{
  "AuthorID": "aff",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200378/profile",
  "Posts": [
    {
      "AuthorID": "aff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200378/profile",
      "Content": "Jul 2, 2015 02:52AM aff wrote: I had a skin sparing umx with immediate DIEP reconstruction. I agonized over umx or bmx. In the end umx was the right decision for me. That was a year ago and with every day that passes, I feel better about this decision. I have no regrets at all about umx or DIEP reconstruction. Even though it has not always been an easy recovery from this surgery, if I had to go back and do it again I would make the same decision every time. I had chemo before surgery and radiation after. This decision is so personal and it has to be the right decision for you. We are here to answer any questions you may have. I wish you all the best as you make this incredibly difficult decision.",
      "MessageIndex": 18,
      "PostDate": "02/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/832716",
      "Title": "difficult decisions- types of BMX surgery, experiences tshire MsVeryDenseBreasts"
    },
    {
      "AuthorID": "aff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200378/profile",
      "Content": "May 30, 2014 06:07PM aff wrote: Thanks everyone. I starting going out without a hat or wig 9 days ago and couldn't be more thrilled about it. My hair starting growing in around week 5 or 6 of Taxol so it's about 10 or 11 weeks of hair growth. Now...my eyebrows and eyelashes are another story. Top eyelashes have grown in but they will not cooperate and curl the right way so I have a very difficult time with mascara. Bottom eyelashes are coming in very slowly and are very short, but they're coming. Eyebrows seem to be going in the wrong direction. They were much thinner this morning and I needed to dig out the eyebrow kit again.",
      "MessageIndex": 20386,
      "PostDate": "30/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "aff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200378/profile",
      "Content": "May 22, 2014 10:40PM aff wrote: Lisa and MinusTwo - thanks for the tip on the Buffs. The UV one will be great for the summer. My hair is just about covering my scalp (not quite there yet) but not long enough to offer any protection from the sun.",
      "MessageIndex": 20352,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "aff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200378/profile",
      "Content": "May 20, 2014 06:21PM aff wrote: I wish I had found these boards during chemo. I am new here with chemo behind me and surgery and rads ahead of me.  If only I had known about icing my hands and feet before. It's great advice for anyone about to start Taxol or Taxotere.  After 12 rounds of Taxol I am desperately trying to hang on to 4 of my nails. Last treatment was on May 2 but there has been very little change to my lifting nails since the end of chemo. Any advice would be great. Toenails were fine but my heels peeled so much that it made walking painful for a couple weeks. I am pleasantly surprised by how much hair has grown back already, even if my new hair is salt and pepper. I did not have any gray hair before. I wore a wig for several months but gave that up about a month ago. I have been wearing bandanas and hats and went out with just a nice headband yesterday. It was quite liberating.",
      "MessageIndex": 20326,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "aff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200378/profile",
      "Content": "May 21, 2014 10:26PM aff wrote: Same as Lisa for me. I thought I was home free. Eyelashes and eyebrows thinned, slightly, during chemo. Much to my surprise, they started falling out after. I am 3 weeks post chemo. Eyelashes seem to be ok now but eyebrows continue to thin. Have no experience with tattoos. e.l.f. makes a great eyebrow kit.",
      "MessageIndex": 20338,
      "PostDate": "21/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "aff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200378/profile",
      "Content": "May 21, 2014 10:34PM aff wrote: big step for me today... 3 weeks post chemo and I went out for the first time without a scarf, bandana or hat. It was so liberating. I wore a wig for a couple months but just couldn't keep doing it. I wore a bandana or a hat until today. One step at a time...one day at a time.",
      "MessageIndex": 20339,
      "PostDate": "21/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "aff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200378/profile",
      "Content": "May 29, 2014 06:08PM aff wrote: donnabelle - love it! Nina - great tips, thanks Notbuyingit - I think you look great but I'm sure you'll be happy with either choice HomeMom -  it truly sucks for a minute and then you get over it like everything else we have endured. I do understand. I swore I would cut it before I lost it but it was right around the holidays and I just ran out of time. The final days before I shaved what was left were a few of the worst in this journey.  So far I am thrilled with my hair growth. I am 4 weeks PFC tomorrow. After having really long hair my entire life I am kind of enjoying this.  ",
      "MessageIndex": 20379,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "aff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200378/profile",
      "Content": "Jun 2, 2014 12:51AM aff wrote: 43",
      "MessageIndex": 282,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "aff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200378/profile",
      "Content": "Jul 1, 2015 02:37PM aff wrote: I'm so sorry to read about your recurrence. I had DIEP in June last year and started radiation in July, as soon as I was able to lay flat (no easy task 5 weeks after surgery). I had no change to the DIEP breast. I was very concerned heading into radiation and very pleased after. Best wishes to you.",
      "MessageIndex": 4,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/832587",
      "Title": "Anyone have radiation after DIEP? klanders klanders"
    },
    {
      "AuthorID": "aff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200378/profile",
      "Content": "Jun 25, 2015 03:30PM aff wrote: Hi Regatta - I did not have chemo after DIEP but my last chemo was just 4 weeks before surgery. I did have radiation after surgery and I did not have any complications or problems healing. Wish you the best.",
      "MessageIndex": 4,
      "PostDate": "25/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/832894",
      "Title": "Chemo while recovering from flap surgery? regatta21 Meow13"
    }
  ]
}