{
  "AuthorID": "ag471",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283582/profile",
  "Posts": [
    {
      "AuthorID": "ag471",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283582/profile",
      "Content": "Dec 20, 2018 02:43PM ag471 wrote: Thank you so much for the replies so far guys. I'm a son. As a daughter I might have been able to do more. I'll update her data more after meeting the oncologist tomorrow.  Any questions you all would suggest that should be directed to the medical oncologist?",
      "MessageIndex": 3,
      "PostDate": "20/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868929",
      "Title": "Breast Cancer Diagnosis CT Scan Results ag471 Moderators"
    },
    {
      "AuthorID": "ag471",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283582/profile",
      "Content": "Dec 21, 2018 01:31PM ag471 wrote: I thought I will update you fine folks. We met with the medical oncologist today. She is concerned with the lung nodules. There were a few that show up in a chest x-ray from 2012, so that might be a good sign. But apparently the Lung lymph nodes are enlarged as well. They believe that it can be due to Tuberculosis which is asymptotic so far. The location of the nodules and the lymph nodes is not usually typical of cancer, but they can't rule it out and still want to put it as a decent likelihood (They said 75% TB, 25% otherwise). Also they can't start chemotherapy till they rule out TB since complications can happen. We have travelled to countries that would have exposed us to TB so it is possible, but it is so nerve wrecking since we still don't have answers. Will have to do a Bronchoscopy to look at the lungs further.  Fortunately the medical oncologist doesn't think it is IBC which they were worried about, since the rash has really gone down and it is not displaying any further symptoms. Lets see how it goes. They believe they will be able to start Chemo in the first week of January irrespective.",
      "MessageIndex": 4,
      "PostDate": "21/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868929",
      "Title": "Breast Cancer Diagnosis CT Scan Results ag471 Moderators"
    },
    {
      "AuthorID": "ag471",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283582/profile",
      "Content": "ag471 wrote: Hi all, My mom (56 years old) was diagnosed with breast cancer last week after her biopsy result of a large tumor (5cm) came back as aggressive (Grade 3). During the surgeon visit, she was clinically diagnosed with IBC due to rash around her breast and therefore as Stage 3. The lymph nodes biopsy came back as inconclusive. We were set up with a bone scan, CT Scan, Chest Xray, blood works and an ECG. It has been a whirlwind of a couple of weeks with all of us going through a high range of emotions. Due to being diagnosed as an IBC, the surgeon wants to do chemotherapy followed by surgery followed by radiation therapy. Her results have come in and we are scheduled to meet the medical oncologist (for chemotherapy) this Friday. Our family physician has also been getting the results and has been conveying them to us at our request. Her bone scans came clear as well as the CT scan results for abdomen, liver, and pancreas. They did find 2 small nodules in the outer layer (?) of the lung, but nothing else worrying there. The radiologist report recommends a follow up CT scan in 6-12 months. They find the lymph nodes below the breast as interesting and recommend a biopsy. Our family physician says that the oncologist will make a call for a biopsy of the nodes, but since they are already proceeding with chemotherapy, it should not change anything. With regards to the nodules in the lung, he mentions that it is quite common and most often benign, but I can't help but worry if this could mean something else? He mentions that it should not impact the staging. She has had shingles in the past on the same breast in a similar area which had all cleared up. Her rash currently, she also believes, is shrinking which apparently is not too common with IBC. Is that true? Has anyone had experience with lung nodules with BC/IBC that were benign/malignant? Has anyone had/or heard of shingles flare up been misdiagnosed as IBC? This looks like an incredible forum and thank you all so much for reading this. Dx 12/10/2018, IDC, Right, 2cm, Grade 3, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868929",
      "Title": "Breast Cancer Diagnosis CT Scan Results ag471 Moderators"
    }
  ]
}