{
  "AuthorID": "AgentMo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
  "Posts": [
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "AgentMo wrote: Hello! I have found this board some weeks ago and after having been a silent user I have decided to join the board because it is such a great place to be. So, let me introduce myself. I am 33 and I have been diagnosed with breast cancer in May 2010. Initially, everybody thought that the cancer has been caught relatively early, but unfortunately after lumpectomy it has turned out that four of my lymphnodes were already cancer positive. Ever since I am on a rollercoaster of emotions. Especially the four instead of three positive lymphnodes are ticking me off. I am so scared that the four positive lymphnodes mean that I will not be healed. On the other hand, I know there is a chance (albeit nobody told me how big it is) that my treatment will work. But it is so difficult to wait and find out.  Currently, I am receiving TAC-chemo every 21 days (my third round will be the coming Monday). After that, I will receive radiation, Tamoxifen, something like Zoladex, and Zoledron acid. I would be very happy to hear from others with a similar diagnosis and whether there is anything else I should do to increase my chances of survival. I know that I should exercise and I do as much as I can during chemo.  Finally, let me tell all of you that as far as I have followed this board I think it is a great place to be. It has helped me to see that I am not the only one confronted with such an unfavorable diagnosis. I don't really know how all of you can be so positive and hopeful, but I sincerely hope that your way of thinking will somehow take me over as well.  Dx 5/2010, IDC, 2cm, Stage IIIA, Grade 2, 4/13 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/756082",
      "Title": "Newbie AgentMo Susie-Q"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Jul 31, 2010 12:58PM AgentMo wrote: Thanks for all your answers, I am happy I came here. Today, I am having a downer. My mother-in-law spoke to a friend of hers, who happens to be an oncologist. After seeing my diagnosis, she put my chances of survival to a mere 50 %. That seems to be really small in my eyes and I cannot see me belonging to the happy group who makes it. How do you deal with information like this?",
      "MessageIndex": 6,
      "PostDate": "31/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/756082",
      "Title": "Newbie AgentMo Susie-Q"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Aug 2, 2010 01:57AM AgentMo wrote: Thanks for your replies, I am really touched. 75% -  80% sounds so much more ensuring than 50 %, I hope you are right. In Germany, it seems that officially oncologist are not giving out any percentages, I am consistently only told that my cancer can be healed, but that it is already advanced or that my risk of recurrence is high. I despair hearing these statements because they do not sound too reassuring, do they? I know I am young and I know that with four involved nodes I am no longer in the reassuring stage II group, but I have always hoped for a survival rate of more then 50 % and I would love to hear some more reassuring words from my doctors.",
      "MessageIndex": 17,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/756082",
      "Title": "Newbie AgentMo Susie-Q"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Sep 14, 2010 01:07PM AgentMo wrote: I can totally relate to your feelings. When others tell me that because of me they take more precautions or that they have had a lump and it has turned out o.k., I just feel even more unfairely treated. I also don't wish my friends any bad news, but at the same time I cannot help but feel totally envious and jealous that they have drawn the good cards and I have drawn the death one.",
      "MessageIndex": 3,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/758012",
      "Title": "This makes me feel terrible...anyone else? shockedat39 chrishat"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Jul 29, 2010 11:08PM AgentMo wrote: I am so glad I have found this board. Unlike most of you, I am from Germany, and hardly anybody here seems to have breast cancer stage III when diagnosed. I, however, unfortunately do, because my tumor, which was exactly 2.0cm, has spread to four lymphnodes. I am always wondering whether the combination of a rather small tumor and extended lymph node involvement means that my chances of surviving are even less than those of a large tumor and the same lymph node involvement. I am very scared of this situtation, because I am also quite young at the age of 33. Currently, I am undergoing TAC chemo every 21 days.",
      "MessageIndex": 7,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/756002",
      "Title": "Tumor Size in Stage III peverson Leslie1962"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Aug 14, 2010 11:28PM AgentMo wrote: @chrihat: Me, too, I would have love to have neoadjuvant chemo in retrospect, just to see whether it works. However, I think in both our cases the doctors did not count on finding the many positive nodes they have found. I guess that is more of an explanation as to why neoadjuvant therapy hasn't been offered to you. I really don't think it has anything to do with you knowing that you want a mastectomy anyway.",
      "MessageIndex": 17,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/756002",
      "Title": "Tumor Size in Stage III peverson Leslie1962"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "May 15, 2016 04:17AM AgentMo wrote: I don't belong on this forum, but I became aware of Nancy because of who she was and because she was one of the persons who had to forgoe children due to bc (which is likely my fate, too). I hope you don't mind that I want to post my condolescences here, too. Nancy will be sorely missed. The only consolation is that she will hopefully no longer suffer as the last couple of months have seemed very hard on her. My thoughts go to her family and all those lucky people who got to know her personally.",
      "MessageIndex": 18,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/844276",
      "Title": "Nancyh exbrnxgrl PaulaAmy"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Mar 25, 2011 01:25PM AgentMo wrote: Jackie, I think you should scan. Even though it is not in the official guidelines yet, there are quite a lot of doctors and scientist around that believe that finding mets early is very useful and makes treatment much more successful. You are not worse off in any case, but you can become active should there be need to. Personally, I have an easier time to cope with reality than remaining in a hopeful, yet anxious state.",
      "MessageIndex": 2,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/766632",
      "Title": "To scan or not to scan jdootoo gutsy"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Sep 3, 2011 01:27PM AgentMo wrote: Jenny, lucky you! I have had the same test done, but in my blood they found CTCs twice. In retrospect, I should not have done the test, because now I am sitting here expecting mets to come up every minute. It is a really bad sign to have CTCs, but for you, it is a really good sign not to have them. Congratulations.",
      "MessageIndex": 4,
      "PostDate": "03/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774126",
      "Title": "This might be a silly question... jennyboog barbe1958"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Apr 12, 2012 05:09AM AgentMo wrote: many - my CEA also varies more widely than CA 15-3. CEA is also the less reliable tumor marker for breast cancer in general. For CEA my reports always state the normal range up to 5. I wonder whether your lab measures it differently than mine. In any case, I don't think you should be too worried about CEA slightly above 2.5. For your mental reassurance, you could ask your doctor to repeat the measurement. Maybe everything is back to normal already because CEA react to any slight inflammation.",
      "MessageIndex": 1,
      "PostDate": "12/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785620",
      "Title": "Tumor markers many many"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Feb 13, 2012 08:45AM AgentMo wrote: ... on a positive note: the fact that so many lower stage ladies do not feel the need to come here and tell somebody that she is not allowed to feel bad for having been dealt with a less favorable stage and prognosis is encouraging. This shows that the majority of the ladies is very understanding and compassanate. ... on a general note: I find it  inappropriate to intrude on a board clearly not designed for one's stage with the aim of telling others that they are not allowed to feel how they feel. There is a reason why stage III is for stage III. I seriously hope you do not go to the stage iv board to tell people that they are just as badly off as you are because you do have a chance of a recurrance, too. And to make your weird sense of statistics very clear Barbe: even a stage iv has a very slight off-chance to be healed by a miracle. I wonder whether you would therefore go to stage iv and tell people on there that chances are 50/50: either they die or they won't.",
      "MessageIndex": 150,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780849",
      "Title": "Why am I only ok talking to stage III ladies?feeling like a jerk Josiekat lkc"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Feb 11, 2012 05:51PM AgentMo wrote: \"... 2 of them did not have it and the 3rd was very early stage. I felt truly jealous ...\" I guess that perfectly sums up the feelings of some of us stageIII'ers, too.  Lower stages are jealous when somebody does not have bc, higher stages are jealous of that as well, but also of those who where lucky enough to catch cancer earlier. While there is obviously no gurantuee for anyone of us, stages do go along with prognosis and that prognosis is not a number somebody made up just for the fun of it.  I guess looking for others with a similar stage is like finding out that you are not the only one who has to deal with a crapshot this bad. And that is a very human feeling. As the borad title very truthfully states: The stage three board is for stage III'ers to see that we are not alone. ",
      "MessageIndex": 90,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780849",
      "Title": "Why am I only ok talking to stage III ladies?feeling like a jerk Josiekat lkc"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Jan 12, 2011 03:01PM AgentMo wrote: @SherriG: That is an interesting point. I was thinking myself today that maybe I have metastasis all along and they are simply too small to show up on my scans. And indeed, if I already have them then they should show up on the scans rather sooner than later. And since I am more likely to have them than somebody diagnosed without LVI and lymph nodes they should indeed show up more quickly at my higher stage than at the lower stage. I would be very interested to see this study.",
      "MessageIndex": 40,
      "PostDate": "12/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763208",
      "Title": "Never hearing the word Cured!!!! faithfulheart jennifer1"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Feb 12, 2012 11:49AM AgentMo wrote: @Beesie: Thank you for this super summary you have written. In my previous posts I also simply wanted to let Josiekat know that what she is feeling is entirely human and warranted. And a lot of us feel the same. Because the truth is as simple as you stated it: the risk of recurrance is higher for stage III than for stage I. ",
      "MessageIndex": 120,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780849",
      "Title": "Why am I only ok talking to stage III ladies?feeling like a jerk Josiekat lkc"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Jan 11, 2012 04:32PM AgentMo wrote: I have posted a similar topic some time back when all of a sudden lower stages seemed to take over the stage III forum. While I know that everybody can end up with mets, the odds are simply higher with a stage III diagnosis than with a lower stage. So yes, I also envy people who had so much more luck than me. I do not take comfort in knowing that somebody no node involvement survived for a long time because that is simply not comparable to my situation. All the survivor stories about people with no node involvement simply do not seem to relate to me at all. I feel as if I am in a completely different world. I am aware that in some way I do not adequately respect that people with lower stage also go through a traumatic phase and also fear recurrence and I got blamed for that last time. But in a way if I am not allowed to feel that way, people with lower stage do not adequately respect my feelings either. And I am aware that some on this board are going to think about me - well she only has four nodes involved, she has been so lucky. So - a very difficult topic, but I think most of us stage III'ers have these moments and these thoughts and understand. Hugs.  ",
      "MessageIndex": 13,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780849",
      "Title": "Why am I only ok talking to stage III ladies?feeling like a jerk Josiekat lkc"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Feb 5, 2011 09:31AM AgentMo wrote: Actually, the biggest difference between Azure and Austria is that premenopausal women where chemically sent into menopause in Austria. That fits well with the Azure fact that postmenopausal women benefitted from Zometa. So my take is as long as you are postmenopausal however induced it is well worth to have Zometa. It is not doing you any harm anyway, so the only thing that can happen is that it actually prevents your cancer.",
      "MessageIndex": 11,
      "PostDate": "05/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764416",
      "Title": "What to do about Zometa?? Let-It-Be Let-It-Be"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Jun 13, 2013 01:38PM AgentMo wrote: I am so happy for you!!! And ... you give me hope for myself. Enjoy enjoy enjoy",
      "MessageIndex": 25,
      "PostDate": "13/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/806012",
      "Title": "In shock for a different reason - PREGNANT! Letlet kathleen1966"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "May 22, 2012 04:35PM AgentMo wrote: Don't decline it. You might pay with your life.",
      "MessageIndex": 1,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787896",
      "Title": "Anyone out there decline taking Tamoxifen? tmetz1616 shelly56"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Apr 16, 2012 05:07PM AgentMo wrote: I think the most important fact you shoud try to convey is that the general opition (bc is curable and a \"good\" cancer) is very wrong. BC can and does kill, and it does so quite frequently because it is so frequent. Also, you should try to make people aware that for bc sufferers chemo and radiation might not be the hardest time to go through, but that it is rather the uncertainty about future propects. And this uncertainty only really begins after active treatment. Finally, I don't think you need to educate people in the sense that you convey all the facts about the disease. Far better would be a good summary where they ccould find quickly find all the information in case they should need it. That way those who need to can become informed patients and really discuss the required steps with their doctors.",
      "MessageIndex": 2,
      "PostDate": "16/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785935",
      "Title": "Help writing a paper..Please All4God pupfoster1"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Jan 4, 2011 07:37AM AgentMo wrote: I believe that anything stage III is locally advanced unfortunately. Your mum seems to be stage IIIa, so locally advanced, but even so stage IIIa is in principle curable. I think you should go for a liver and a bone scan, too, in order to be sure that the beast has not spread. Hugs AgentMo",
      "MessageIndex": 4,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "May 21, 2013 03:52PM AgentMo wrote: @wintersocks: I can relate to you. I always think that chemo is a bit like birth - apparently horrible to go through (no personal experience, unfortunately - for me it was cancer instead of children), but quite easily forgotten.",
      "MessageIndex": 14,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/804639",
      "Title": "Almost 3 years out, still so scared I won't see kids grow up Outfield kelly279"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Jun 3, 2013 04:13PM AgentMo wrote: Two years ago the recommendation for you would have been ovarian suppression. However, guidelines have been changed and now they only recommend tamoxifen without ovarian suppression regardless of age. Having your period does not mean tamoxifen is not working. Tamoxifen does not supress estrogen, it adds another type of estrogen and if this type binds on the cancer cells, they do not grow. However, in my personal opinion, chances are greater that the tamoxifen-type and not the normals estrogen binds on the cancer cell the less normal estrogen is in your body (after all, they are in some kind of competition). So for me common sense suggest that you should suppress your ovaries. I am a year younger than you are and I go by Zoladex + tamoxifen. I also convinced my onc that I should have Zoladex for 5 years. So far insurance pays, but if not, I would go by my gut feeling and pay myself. I consider the Zoladex part at the very least as important as the tamoxifen part. Hope this helps.",
      "MessageIndex": 3,
      "PostDate": "03/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/805543",
      "Title": "Stage 3 - Periods have come back, should I take further action? Lillymillie politicomama"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Dec 26, 2010 06:25PM AgentMo wrote: That is wonderful.",
      "MessageIndex": 36,
      "PostDate": "26/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745637",
      "Title": "10 years ago at Christmas.... Gabrielle Mimidi"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Jan 5, 2011 06:02AM AgentMo wrote: @Sheila: The staging information that you have posted is the old staging information (today it is only used for the clinical staging, but not for the staging after pathology). Today's staging can for instance be found at the American Joint Committee on Cancer. One possible link is the following: http://www.cancer.org/cancer/breastcancer/detailedguide/breast-cancer-staging",
      "MessageIndex": 21,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Jan 4, 2011 04:32PM AgentMo wrote: I know for sure that staging has changed in 2002 or 2003. Before 2002, all patients with positive axillary lymph nodes were regarded N1 and hence stage II. This definition has been changed, now N2 start with 4 positive lymph nodes. Therefore, those with more than 3 positive lymph nodes today would all be classified as stage III. The location of the positive nodes matters for the N3 classification and hence for the distinction withing stage III. Caaclark, I certainly would also feel better being stage II. Unfortunately, by now I have dwelved too much into the topic. Glad you are approaching five years.",
      "MessageIndex": 13,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Mar 16, 2017 11:22AM - edited Mar 16, 2017 11:23AM by AgentMo Dear Atha, Your words have touched me because they remind me so much of my story. I was diagnosed with 33, which was in 2010, and at that time I would never have thought that I would be alive almost seven years later. Yet, here I am. I have no great advice to offer you, because what you are feeling is what I was feeling and what I often still feel. I have never entirely left the scary bubble, which may not be what you want to hear at the moment, but I hope it helps to know that you are not the only one feeling like that. And in time, to a certain extent you learn to live with it. At the beginning there hasn't been an hour without me thinking about cancer and dyning. That has changed, I now certainly have hours where I don't think about it (though not yet days). And a certain kind of acceptance has come to me, because no matter what I think or do, there is only a limited amount of influence I have on what is going to happen. I follow the doctors' advice, I eat reasonably, I go to the gym. I still feel somewhat betrayed for having to fight cancer rather than raising a child as I wished to do. But even as it is, my life today is so much better than it was when I was diagnosed. I hope you will be able to handle the situation a bit better than I have and experience more joy that I do. ",
      "MessageIndex": 4,
      "PostDate": "16/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/853468",
      "Title": "Sad everytime I meet the doctor. Any hope stories? Atha85 Mamabear0"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Dec 11, 2010 10:15AM AgentMo wrote: @Athena1: Regarding the difference in stages, it should be noted that the Austrian study still used old staging. Stage II in that case meant 10 or less involved lymph nodes and not only up to three lymphnodes. Regardless, the results are a big disappointment for me. I hope I will receive Zometa in the future despite these results, in particular because I am exactly the patient that took part in the Austrian study group (33, hormone-receptor positive, taking goserelin and tamoxifen though of course I had chemo). I so hoped to better my chances with Zometa because chance for people of my age are dismal anyway. Unfortunately, it  seems 35 is the age where chances tend to improve. Before you are up to die before you know it.",
      "MessageIndex": 19,
      "PostDate": "11/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761792",
      "Title": "Zometa - Latest News out of San Antonio Meeting voraciousreader Gitane"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Dec 18, 2010 12:02PM AgentMo wrote: O.k., here is what I was told: it is very curious that Zometa did not show any effect in this study, but this surely is not representing Zometa not having an effect. Rather, it seems to be a question of dosage. The positive results for Zometa exist and that plentiful. They should not be discarded simply on this one study.",
      "MessageIndex": 48,
      "PostDate": "18/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761792",
      "Title": "Zometa - Latest News out of San Antonio Meeting voraciousreader Gitane"
    },
    {
      "AuthorID": "AgentMo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105996/profile",
      "Content": "Sep 2, 2011 02:53PM AgentMo wrote: I am also just borderline Stage IIIA. However, even though I can totally understand that the difference between three and four affected lymph nodes cannot be the world, I cannot get around being Stage III rather than Stage II emotionally. It bothers me a lot and I feel as if I would have a much better chance of surviving being Stage II instead of Stage III. I know this is crap, I know that the staging categories are to some extent arbitrary (for instance I have read one study that says the real difference is between two and three lymph nodes) and I know that I cannot help it anyway. But I just can't get over it.",
      "MessageIndex": 4,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774100",
      "Title": "Ok now I feel dumb... Letlet Yanyan"
    }
  ]
}