{
  "AuthorID": "AGeorgiaDeb…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108936/profile",
  "Posts": [
    {
      "AuthorID": "AGeorgiaDeb…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108936/profile",
      "Content": "Jan 7, 2011 07:11PM AGeorgiaDeb wrote: Oh yeah I wanted to tell you that I will have 38 treatments.  8 of those will be boosts.  I had one not so good margin.  I also had 4 tumors-3 DCIS and one invasive DCIS.  The invasive one was only discovered in the path from the lumpectomy.  My point is that it seems I could get skin irritation after 38 treatments. Debbie",
      "MessageIndex": 275,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "AGeorgiaDeb…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108936/profile",
      "Content": "Jan 7, 2011 07:35PM AGeorgiaDeb wrote: Rain city you are right about the IDC.  I will blame it on chemo brain.  Thanks Sherry about the Cystal.  I will look forward to no gland activity! I may try corn starch-that't what the RO said.   Has anyone tied that?",
      "MessageIndex": 283,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "AGeorgiaDeb…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108936/profile",
      "Content": "Jan 10, 2011 07:51PM AGeorgiaDeb wrote: Lots of info from all of you ladies!  I have a heard time keeping up but I am trying!  Some of you have answered my questions-I love your feedback!!  I had 3 treatments and then we had snow in Atlanta which brings everything to halt.  I will miss treatments-does this matter?  I am worried.  I am so relieved they told me not to try to make it when the roads are horrible but I worry! All of you Texas ladies-I enjoy your posts.  I know where Frisco is and you have an amazing Christmas light presentation.  Very cool! Hey Canada girls don't think the US has horrible healthcare-I am paying for this treatment but compared to the cost it is very small.  I am thankful. I have choices and I do NOT want the government to be a part of my health care. Debbie",
      "MessageIndex": 344,
      "PostDate": "10/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "AGeorgiaDeb…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108936/profile",
      "Content": "Jan 13, 2011 04:38PM AGeorgiaDeb wrote: I am in the Atlanta area too.  Misssed 2 days and I found out today that I have to make them up on Sat and Sunday.  That doesn't make me happy and that doen't make sense either. I just dread having to go. I should want to get this over with.  But then again none of what I feel lately makes sense.  So far I have 5 treatments under my belt -I have to seee the medical oncologist tomorrow at 8AM.  Another drive on the ice. UGH! I guess I get all the info about Tamoxifen.   Debbie",
      "MessageIndex": 441,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "AGeorgiaDeb…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108936/profile",
      "Content": "Jan 7, 2011 07:07PM AGeorgiaDeb wrote: Hey ladies! I was supposed to be in the Dec rads group but I got a reprieve to see family in Texas over the holidays.  I started the treatment on the 5th.  I found it very clinical.  No warm fuzzies. Not feeling like they care too much -just get her in and go on.  No warm blanket, no suggestions for skin care.  Just a pamphlet about no deodorant, under wire bras, shaving, use mild soap with no perfume, etc.  Like others I have not been advised to do any skin care and I am nervous.   We have been having cold weather and I have dry skin.  I think it is worse because of the chemo.  I want to be proactive on the skin issue.  I asked the RO about it and he said sue aloe vera cream.  Isn't  aloe vera a gel?  does anyone have a recommendation about one with little added ingredients. I think I am sensitive about the skin-I am about 6 weeks out from my last chemo and my body is showing signs of going back to normal.  BUT  2 days before the rads I ate dinner a friend's house.  I ate food I had eaten before and my lip started swelling.  I looked like collagen gone bad!  I think it was the dye in a Christmas napkin.  I  have never been allergic to anything!  Benedryl stopped it but I was a sight.  Bald and big lipped!!  Hot flashes and BO!!  LOL Well I just wanted to get in this group-tried to read all the posts but I started to get mixed up on all the info!  I will keep trying.   Seems like the things to try are Aquaphor, Miaderm and aloe vera. Do any of those natural deodorants help? I don't want o bother spending my money if they don't.  I perspire alot -winter or not and I get stinky!  Might as well wipe the underarms a few times a day. Most of all I am glad to hear from fellow BC folks.  I have been trying to be \"normal\" so I did not take time to read posts.  I really don't have anyone to talk with and I feel like all my friends are tired of it.  Plus I have some other friends who are recently diagnosed with not so great prognoses so I don't want to whine. Sorry to be so long. Debbie",
      "MessageIndex": 273,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "AGeorgiaDeb…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108936/profile",
      "Content": "Jan 7, 2011 07:13PM AGeorgiaDeb wrote: Oh yeah I wanted to tell you that I will have 38 treatments.  8 of those will be boosts.  I had one not so good margin.  I also had 4 tumors-3 DCIS and one invasive DCIS.  The invasive one was only discovered in the path from the lumpectomy.  My point is that it seems I could get skin irritation after 38 treatments. Debbie",
      "MessageIndex": 276,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "AGeorgiaDeb…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108936/profile",
      "Content": "Feb 1, 2011 03:13PM AGeorgiaDeb wrote: I don't get on too much-so many posts to read some days.  I love the one about the graduation .  My center is pretty low key on the rads.  Very businesslike.  I am on # 20 of 38.  My skin is very pink in a band across my breast ( at the top) and it is itchy.  Sore too.  I am using a cream with Lidocaine and Aquaphor.  Does it really get crispy?",
      "MessageIndex": 980,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    }
  ]
}