{
  "AuthorID": "agnes121",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77921/profile",
  "Posts": [
    {
      "AuthorID": "agnes121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77921/profile",
      "Content": "agnes121 wrote: Hi, new here.  Just wondering if any of you premenopausal womem talked to your doctors about the studies that show there is a higher survival/lower recurrence rate (to the tune of 3 times the chance) if you have your surgery in the luteal phase of your cycle, or the last half of it.  My surgeon doesn't think there's enough evidence to support this study's validity but I'm inclined to go that route anyway.  I mean, it can't hurt, right? Here's my problem - I was diagnosed almost 7 weeks ago.  Due to switching doctors and the holidays, I have yet to schedule a surgery.  If i go by this theory (surgery in the luteal phase), i'd need to have surgery next week which is proving to be difficult for my surgeon (she's booked solid).  she can get me in the week following, but that's too late cycle-wise.  so, the great debate is: do i wait another 3 weeks for surgery (bilateral mast), do i go ahead and have surgery the following week and ignore the study, or do i just do chemo before surgery (another option the surgeon and oncologist threw out there). any of this strike a chord with any of you?  advice?  opinions? thanks and nice to meet you (albeit under crummy circumstances)!  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727505",
      "Title": "Timing your surgery - did your doctors talk to you about that? agnes121 mocame"
    },
    {
      "AuthorID": "agnes121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77921/profile",
      "Content": "Jan 16, 2009 09:33PM agnes121 wrote: If you google \"timing surgery for breast cancer according to cycle\" you'll get a list of articles/studies, both pro and con.",
      "MessageIndex": 2,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727505",
      "Title": "Timing your surgery - did your doctors talk to you about that? agnes121 mocame"
    }
  ]
}