{
  "AuthorID": "ailenroc",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
  "Posts": [
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Oct 16, 2008 01:00PM ailenroc wrote:",
      "MessageIndex": 11,
      "PostDate": "16/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/722871",
      "Title": "2nd opinion: Pathology? EleanorJ misheley"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jan 15, 2009 04:08PM - edited Jan 15, 2009 04:13PM by ailenroc thisisme: I have some data and resources to this question in an earlier post of mine: see Bilateral or Unilateral Mastectomy? Implant risks? see the table regarding pros and cons - first page and the conversation with John Link (onc) Mx reduces your breast tissue to about 1-2%. If in the general population, one has a lifetime risk of about 12% than that leaves after mx about 1-2% of that 12% ... very small, especially if there was no invasion yet. I did prophy although risk of contralateral disease was very small ... It had cancer too. Below some resources on the topic. Risk to the other breast - Contralateral disease In general, according to the study, women diagnosed with breast cancer in one breast have three to four times the risk of developing a new cancer in the other breast. Much of this increased risk has been attributed to genetic predisposition, hormonal risk factors and other common causes. But there remains the possibility that treatment regimens for the first breast cancer, including chemotherapy and radiation, might also play a part. http://www.medicinenet.com/script/main/art.asp?articlekey=93419 http://www.cancer.gov/newscenter/pressreleases/MRIContralateralRelease \"One in ten women diagnosed with cancer in one breast will develop the disease in the opposite breast. Having a better technique to find these cancers as early as possible will increase the chances of successful treatment,\" said NIH Director Elias A. Zerhouni, M.D. As many as 10% of women with breast cancer develop a new tumor in the opposite breast, even though nothing is found when they are checked with mammograms and physical exams at the time of their original diagnosis. Finding these cancers earlier could help women make treatment decisions (some women with cancer in just one breast opt to have both breasts removed as a precaution), and might spare them from extra rounds of surgery and chemotherapy later. Researchers from the University of Washington Medical Center in Seattle studied 969 newly diagnosed breast cancer patients to see if MRIs could find contralateral cancers that mammograms and physical exams missed. The scans found 30 early-stage tumors the other tests could not detect, and missed only 3. \"This study gives us a clearer indication that if an MRI of the opposite breast is negative, women diagnosed with cancer in only one breast can more confidently opt against having a double (or bilateral) mastectomy,\" says John E. Niederhuber, MD, director of the National Cancer Institute, which sponsored the study.",
      "MessageIndex": 4,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727368",
      "Title": "Risk reduction with proph mastectomy and other stat questions thisisme ailenroc"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Nov 13, 2008 10:33PM - edited Nov 14, 2008 04:46PM by ailenroc Candy: I described recovery in detail with advice in this thread:  http://community.breastcancer.org/forum/44/topic/708419?page=1#idx_23 or if the link does not work search: Bilateral or Unilateral Mastectomy? Implant risks? How does one anyone post a prior thread so that the reader can link to it? Anyone Know? Good Luck!",
      "MessageIndex": 17,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724329",
      "Title": "Scared CandyLuna ailenroc"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Nov 29, 2011 10:30PM ailenroc wrote: This is great information. Thank you for posting such a thorough guide.",
      "MessageIndex": 243,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751566",
      "Title": "VISIBLE SIGNS OF LYMPHEDEMA - A PICTORIAL LindaLou53 glennie19"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jul 30, 2009 03:09PM ailenroc wrote: Kudos to you for trying to be proactive about your bi-rad3 rating. When I got that, I didn't even comprehend what that meant and relied on my doc's recommendation to return for a follow up in 6 months. My strong suggestion is to get an ultrasound and perhaps and MRI. Plus get a copy of the mammogram images and look at them yourself. Also get the actual radiologist report of the mammogram and ideally the ones of the two prior years too. You want to know what they are seeing; what gives rise to the level 3 rating, how long its been there, and how fast it is developing. Ideally the radiologist looks at the film with you and explains his/her findings/concerns. As they say, in 8o% + of cases it's nothing to be concerned about, but if there is something the best you can do is detect and treat it early. All the best for you. Here are a couple sources to pursue that can help you understand your report and film better: http://www.infoacademy.gr/microcalc/index.php?option=com_content&task=view&id=13&Itemid=47 Rating Categories http://www.infoacademy.gr/microcalc/index.php?option=com_content&task=view&id=19&Itemid=40 In BI-RADS 4 the radiologist has sufficient concern to urge a biopsy (2-95% chance of malignancy). www.radiologyassistant.nl/en/4349108442109",
      "MessageIndex": 2,
      "PostDate": "30/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738175",
      "Title": "Bi-Rad 3. Do I need an Ultrasound? sjvg Beesie"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jul 20, 2009 04:01PM ailenroc wrote: One more question: what are the major breast cancer centers. I know that not all of the major cancer centers specialize in breast cancer. Anybody know which do?",
      "MessageIndex": 1,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737711",
      "Title": "How to find good doctors ailenroc mj1016"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jul 21, 2009 02:27PM ailenroc wrote: Meg: I agree that breast centers are a great idea -- specialists + coordinated services. The NCI and other lists pertain to all cancer centers, not breast centers and their approval alone does not give a whole lot of information. I happen to know that the Irvine facility has a lot of problems although it makes their list.  Does anyone know of a list that lists the best breast centers in the U.S.?",
      "MessageIndex": 9,
      "PostDate": "21/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737711",
      "Title": "How to find good doctors ailenroc mj1016"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jul 21, 2009 12:50PM ailenroc wrote: Thanks Idaho and Mawhinney: nurses and friends are definitely a common theme or ask your doctor ... but quite frankly, in my own experience that did not do me much good. The nurses and doctors at my pcp's office and the radiology center where my cancer was detected were not that knowledgable ... they did not want to make any recommendations .... \"we can't make recommendations to specific doctors\" ... did not have a list either of possible specialists to chose from which I thought that must have given that they must diagnose more cancer patients than me ... and the few recommendations I ultimately got were certainly not to the best bc specialists in the area. So my question remains: does anyone know of a more systematic way of finding the best doctors?",
      "MessageIndex": 8,
      "PostDate": "21/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737711",
      "Title": "How to find good doctors ailenroc mj1016"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "ailenroc wrote: A friend of mine just got diagnosed too. While I can share a lot of information with her, I never quite figured out how to systematically go about finding the best surgeon / plastic surgeon. Any advise on what I can tell her? Oncotype score: 1; BRCA neg; bilat bc & bilat mx w recon; Dx 5/30/2008, IDC, <1cm, Stage IB, Grade 1, 0/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737711",
      "Title": "How to find good doctors ailenroc mj1016"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jul 20, 2009 05:05PM ailenroc wrote: Annaanne: thanks for the quick response. I saw Giuliano myself last year and was very impressed with his knowledge and thoroughness; I couldn't stand his resident though. Her arrogance nearly killed me. I also wasn't able to look at any photos of prior patients. I did for opt for a closer surgeon. I presume Guiliano did your surgery and you are happy. Did you experience overall good care at his hospital?",
      "MessageIndex": 3,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737711",
      "Title": "How to find good doctors ailenroc mj1016"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jul 20, 2009 07:36PM ailenroc wrote: Annaanne: I love your attitude:  \"the most important time with the surgeon was when I was unconscious\" - that's a great way to look at it and very true. I am glad that your experience there was so well. Traveling from Oregon ... you are a trooper.",
      "MessageIndex": 6,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737711",
      "Title": "How to find good doctors ailenroc mj1016"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jan 15, 2009 09:57AM - edited Jan 15, 2009 10:00AM by ailenroc I second Beesie's and Kleenex's comments above.",
      "MessageIndex": 12,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727304",
      "Title": "Has anyone done sentinal node biopsy on prophylactic side? samiam40 Binney4"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jan 14, 2009 06:54PM - edited Jan 14, 2009 06:59PM by ailenroc Bilateral or Unilateral Mastectomy? Implant risks? Hope you find some useful information there. In the meantime, here is a list of links with additional photos of what mx can look like; often they look quite good. Lisa above is right: be sure to have excellent surgeons. I paid extra to get the local (Orange County) top plastic surgeon and so far, so good. I have hardly any visible scars. From what I have seen in pics and other patients, surgical technique makes a huge difference. My best wishes to you. Cornelia http://www.breastreconstruction.ca/index.htm http://breastreconstruction.org/PersonalStories.html http://www.mdanderson.org/Diseases/BreastCancer/reconstruction/dIndex.cfm?pn=E10BC669-C550-45C8-83E293CE1B08E003 http://smartplasticsurgery.com/reconstruction/photos.html http://www.mdanderson.org/Diseases/BreastCancer/reconstruction/ http://www.lisajewellmd.com/procedures.cfm?proc=Breast%20Reconstruction http://www.breastflap.com/breast_reconstruction_photos.htm http://www.prma-enhance.com/index.cfm/ProcedureNameID/19/PageID/1946 http://www.myselftogetheragain.org/process.htm http://www.101plasticsurgicenter.com/photo.cfm?c=14 http://www.thebreastexpert.com/breastreconstruction/breast-reconstruction-start.htm http://www.thebreastexpert.com/breastreconstruction/Breast-reconstruction.html http://www.thebreastexpert.com/breast-cancer/Nipple-Reconstruction.htm areola http://www.thebreastexpert.com/breast-cancer/Areola-Reconstruction.html http://www.whfhhc.com/Breast-Reconstruction/6670.htm http://www.tlhplasticsurgery.com/index.php/photo-gallery/dr-paredes-patients/breast-reconstruction/ http://www.breastcancer.org/tips/reconstruction/ask_expert/2007_05/question_05.jsp",
      "MessageIndex": 11,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727309",
      "Title": "I am so confused as to which route to take jancie Beesie"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Nov 21, 2008 04:29PM ailenroc wrote: Otter: thank you for your note. It is good to know that I have good company. Thanks for the tip with the thread, I'll look at it. You are right, people do seem to want to hear that we are ok because then they are more comfortable ... back to business as usual .. it is feels really strange. I almost feel that I 'shouldn't talk about it ... so everybody else can feel as usual. Weird. Hugs to you to, Cornelia P.S. what do you do to move on ... to make yourself feel good?",
      "MessageIndex": 9,
      "PostDate": "21/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724420",
      "Title": "I'm not depressed ... just sad ailenroc ailenroc"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Nov 24, 2008 11:05AM ailenroc wrote: Hi Ladies, Thanks for you thoughts. Here is a group hug for all of us. I still wonder are there some wonderful strategies that some of you have for 'moving on', making yourself feel better without drugs, growing from the experience ... perhaps doing something to help others in the same situation in order to have something useful come out of this? Cornelia",
      "MessageIndex": 13,
      "PostDate": "24/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724420",
      "Title": "I'm not depressed ... just sad ailenroc ailenroc"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "ailenroc wrote: So there it is ... diagnosed on 5/30, bilateral mast on 7/30 and finally in the middle of November I am sad.  After the initial shock and horror and crying I was task focused, exhausted from dealing with all the tasks, alternately trying to enjoy myself and trying to recover after surgery. Now I'm back to work, recovering adequately and sad. No crying spells. No gloomy deep \"where's the Prozac or I'm going to kill myself\" depression ... just sad about how difficult everything still is, sad about being sick, sad that my healthy lifestyle clearly didn't mean a thing, exhausted by too many doctors' visits, daunted by how tough it is to catch up with work, confused about what to eat (no meat, no soy, no sugar, no dairy ... just lots of kale ... depending on what I read), scared about a recurrence, and sad to have no one to talk to .... I do have family and friends but since I look normal and the surgery was a quarter year ago ... they are over it. Problem is, I'm not. The cancer thing doesn't fit my self image, I really feel tied down with medical issues, still don't know if I have made the right decisions regarding Tamoxifen (to take or not to take), and wondering if I should have used the opportunity as an excuse to travel the world. Does anyone get like that?  What do you do when you get like that? How do you move on? Oncotype score: 1; BRCA neg; bilat bc & bilat mx w recon; Dx 5/30/2008, IDC, <1cm, Stage IB, Grade 1, 0/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724420",
      "Title": "I'm not depressed ... just sad ailenroc ailenroc"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Nov 17, 2008 08:12PM - edited Nov 17, 2008 08:14PM by ailenroc Thank you for all your notes ladies. It is comforting to know that I am not alone. I do think it is PTSD ... posttraumatic stress syndrome. I still wake up in the night with my first thoughts focusing on cancer and find it generally hard not to think about cancer ... although the acute crisis is over. I guess that is in part why we all return to this site here. Some connection to people who've been there, who are there and we don't need to explain at length what it feels like. When people compliment me that I look 'great' or that I look perfectly 'normal' ... and that one 'couldn't tell' by looking at me, I am tempted to respond that it isn't just about looks (what are we supposed to look like anyway ...?) but that I am still feeling it ... I am hurting ... and I don't mean major pain ... but the awareness that my life has profoundly changed ... in a bad way ... a way I did not chose. That my body has been majorly traumatized and that I am still recovering from the surgery while preparing for the next surgery; that I have to do physical therapy every day to move and look as normal as I do ... and that I'd like to do something grand ... something equally grand to the shock of hearing that I have cancer ... to undo that shock.",
      "MessageIndex": 7,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724420",
      "Title": "I'm not depressed ... just sad ailenroc ailenroc"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Nov 11, 2008 06:02AM ailenroc wrote: Get a second opinion on your post surgery path tissue. Get it from a reputable hospital that has a breast cancer unit where the pathologist is trained and experienced in reading breast tissue. Your really want to know what it really is.  I had three readings; the first two concurred: FALSELY. The third done at a breast cancer center, got it right. The oncotyping is a good idea in addition ... although it can, I believe only be done on ER+.",
      "MessageIndex": 2,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724213",
      "Title": "Pathology results different from biopsy results. Please help! havehope ZEKE"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Aug 13, 2010 09:33PM ailenroc wrote: I am glad it was a good decision for you Jenn. You sound like a brave woman. Did you research the surgery in any way - do you have any tips or resources you could point me to?",
      "MessageIndex": 3,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/756678",
      "Title": "Post mx oophorectomy thread ailenroc speech529"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "ailenroc wrote: There does not seem to be such a thread despite many mentions of oophs ... although I'm sure there are many of us pondering or facing that surgery or living with the consequences. Here my situation -- and a plea for info and help: I am a breast cancer patient (2yrs out), post bi-mx w recon, 51 pre-meno, and just learned that I have 4 complex paraovarian cysts that should be looked at because they have grown (slowly, max 4 cm) and one has a \"thickened wall\" which is apparently associated with malignancies, but, of course no one knows if this is cancer or just one of these benign things. My CA125 is normal. But because I need to make a decision on oophorectomy (one or both or at all??) and possible hysterectomy (for sure if they find ca) I want to learn asap what I need to know to make good decisions. Where do I begin? What are my options given my situation? Please don't tell me to talk to my doctor - I do, of course, but if I have learned one thing in the last two years than that is that relying on my doctors to give me a clear understanding of all my options is a very limited proposition. I don't know what all my options are: e.,g. I just read that if I have an ooph a frozen section should be done in the OR: so that if there is cancer one can proceed with hysterectomy, and cancer staging and lymphectomy. That is the complete knowledge I have right now and considerably exceeds what my doc (an onc gyn) told me: she said: 'I suggest we remove both ooph; that takes about 30 minutes and you can go home and you can go on HRT and if you get mood swings you can take Prozac' - Well, I'd like to have a better sense of what to be prepped for so I can chose the right treatment; doctor, etc. For example, can one do oophs with daVinci? is there an advantage to that?? Is there any other test to help determine whether these cysts are malignant? I am really not eager to have surgery after 8 of them in the last 2 years and the side effects of forced menopause are scary because they are systemic and it sure sounds weird that I would have to be on HRT as bc patient whose tumor was 100% ER+. Lots to think about in a short time. Any info on all of the above or experiences or advise where to start, what to read, etc would be much appreciated. Oncotype score: 1; BRCA neg; bilat bc & bilat mx w recon; Dx 5/30/2008, IDC, <1cm, Stage IB, Grade 1, 0/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/756678",
      "Title": "Post mx oophorectomy thread ailenroc speech529"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Nov 10, 2008 10:07PM ailenroc wrote: I had a hospital bed for a while post bilateral which made live a lot easier. Thereafter, I got a wedge system 'contourliving.com' ... actually ordered it on Amazon for $99 ... keeps you wedged into a stable position ... no sliding off the pillows. It worked great for me and was tremendously helpful ... less upper body pain ... congestion.",
      "MessageIndex": 10,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724028",
      "Title": "BedLounge back rest pillow rayhope SandyinSoCal"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jan 15, 2009 01:47PM ailenroc wrote: Jancie:  Beesie above is right on. look also at the following info: http://www.breastcancer.org/symptoms/path_report/ http://www.oncolink.com/types/article.cfm?c=3&s=5&ss=838&id=9588 http://breastcancer.about.com/lw/Health-Medicine/Conditions-and-diseases/Understanding-and-Dissecting-Your-Breast-Cancer-Pathology-Report.htm Help with decision-making - need to register (its free) http://www.nccn.org/default.asp Follow the link: NCCN Clinical Practice Guidelines in Oncology. These are the NCCN guidelines for BC treatment that oncologists use. They are very detailed for all possible BC types and treatments. e.g., it allows you to check, based on your diagnosis and staging, what course of treatment would be best for you ... Tamoxifen or not, etc. Breast Anatomy: http://training.seer.cancer.gov/ss_module01_breast/unit02_sec01_anatomy.html Quadrants of the Breast - e.g., to know you're your path report means when they say \"tumor at 6:00 o'clock.\" http://training.seer.cancer.gov/ss_module01_breast/unit02_sec02_anatomy.html",
      "MessageIndex": 4,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727041",
      "Title": "I am confused on pathology report - help! jancie ailenroc"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Feb 16, 2009 10:26PM ailenroc wrote: diamondgurl: very sorry that you have to experience this. I fought hard with the decision whether to do a prophlactic one. I posted my decision-making process, pro and con lists for bi versus unilateral, research links, the process and aftermath, etc here: either search this post: Bilateral or Unilateral Mastectomy? Implant risks?  or try to click here:  http://community.breastcancer.org/forum/44/topic/708419?page=1 I did have the bilateral ... which turned out to be a good thing ...  Hope it helps.",
      "MessageIndex": 17,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/728992",
      "Title": "Bilateral Mastectomy DiamondGurl Superwoman808"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Feb 16, 2009 01:22AM ailenroc wrote: semiam: so short after surgery try to keep wrapping yourself (actually, have somebody help you) with ace wrap (wide ones, about 2 should be enough). That gives you some compression to keep the swelling down and you can control where the wraps go to cover the scars. I did the wraps for about 2 weeks; they felt more comfortable than any bra. Thereafter try frontopening (zipper) sports bras. Nike has one that works for me. Good luck.",
      "MessageIndex": 10,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729004",
      "Title": "Sports bras cutting into sential node scars samiam40 lazydaisy"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "ailenroc wrote: Is cancer a kind of auto immune disorder? Since my diagnosis 9 months ago, I keep stumbling across bc patients who say that they have some kind of immune disorder: allergies, asthma, eczemas, psoriasis, lupus, various hypersensitivies to certain substances, rheumatoid arthritis, type 1 diabetes, endometriosis, and so on. I've been trying to find research on this but unsuccessful. Does anyone know if bc and immune disorders are related? Do you have any sources you could point me to? Oncotype score: 1; BRCA neg; bilat bc & bilat mx w recon; Dx 5/30/2008, IDC, <1cm, Stage IB, Grade 1, 0/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729689",
      "Title": "Immune system problems and cancer related? ailenroc orange1"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "ailenroc wrote: I had 5 nodes removed in right axilla in 2008 during BMX; bad cording in right arm thereafter, quite painful, but problems subsided with PT over the course of 6 months. What remained was the feeling of having a softball or sometimes (after physical strain / high temperatures) a grapefruit underneath my arm: painful pressure that made all clothing feel too tight even if it isnt. Then, 6 months ago, my right arm gets skin cancer in the most unusal spot: the inner elbow, which is one of the most protected areas. I have never been a sun worshipper and the whole thing made little sense. I had a tiny scratch on that spot a month earlier and dermatologist speculated that the trauma from the scratch in combination with the impaired lymphsystem may have triggered the cancer growth. Anybody ever hear of that? Anyway, since the surgical removal of the skin cancer, my right arm has not been the same: right after the surgery I had again bad cording and mild swelling. It is as if the damaged lymphsystem in that arm is highly vulnerable to any insult. By now the cording has subsided and the swelling is only noticable when measuring differences between arms BUT I have bad pain in the inner elbow when I keep my arm bent for more than 3 minutes (as while typing this note). No muscles were damaged during the surgery; the Moh's surgery targeted only the skin cancer and the upper layers of the skin. No doctor knows what to do with the pain that I have now. I am being told that lymphedema does not cause pain; just swelling. That is not true, right? Has  anyone had a similar experience? Or does anyone have any advice for me? Dermatologist sent me to vascular surgeon who had no interest in the situation and tells me I should see an orthopod or a rheumatologist or a shrink. I don't feel in the least that this is an orthopedic issue or other but that the pain originated after the cording and has since not subsided. Help please. I am in Southern California - in case anyone knows a physician who actually understands lymphedema. Oncotype score: 1; BRCA neg; bilat bc & bilat mx w recon; Dx 5/30/2008, IDC, <1cm, Stage IB, Grade 1, 0/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/807787",
      "Title": "Doctor says 'Lymphedema is not painful' - Is it? ailenroc LadyHelaine"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jul 17, 2013 11:14AM ailenroc wrote: Thank you so much for your responses ladies! One of the most unpleasant parts of the cancer and LE journey has been that one needs to defend oneselve: \"No, it really hurts!\"  Even if you can't see any visible wound or swelling. \"No I am not malingering!\" But I am struggling most days with the consequences of the damage to my lymphsystem although it may not be as bad as other people's LE or post cancer problems. I feel very discouraged about talking to 'health care providers' about my health; so tired of hearing suggestions that it's all psychological 'maybe because of what you've been through' that I find it a chore and waste of my time to talk to my health care 'non-providers' at all. Do you have difficulty convincing your docs that you have pain and need help? And how do you deal with that effectively? How do you convince them of what they can't see? Kira: it's been suggested that the odd pain I have in my right arm, especially when I put it in a bent position is a neuropathy. Have you heard of neuropathy as a consequence of LE? Or of similar pain with LE? To me it makes sense in terms of LE, if I bend the arm, circulation is somewhat obstructed and the arm starts hurting and it gets better when I straigthen and move the arm lightly. Does anyone else have such symptoms?",
      "MessageIndex": 7,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/807787",
      "Title": "Doctor says 'Lymphedema is not painful' - Is it? ailenroc LadyHelaine"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jan 11, 2009 10:57PM ailenroc wrote: Jancie: I thought the decisionmaking was the worst. I detailed my decision making process, pros and cons of either approach, and my insights from the process and aftermath in the following post: Bilateral or Unilateral Mastectomy? Implant risks? Hope it helps. All the best for you. Cornelia",
      "MessageIndex": 45,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726815",
      "Title": "I am scared -just diagnosed jancie traceyz"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "May 12, 2010 07:48PM ailenroc wrote: I still have the same problem. Any suggestion on how to effectively treat a hypertrophic scar?",
      "MessageIndex": 1,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/745151",
      "Title": "Effective Scar Treatment 2 ailenroc ailenroc"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Aug 20, 2008 11:01AM ailenroc wrote: I had read about Vitamin C, and although I normally take every day about 1000 mg, I stopped taking it at the request of my PS who said that it might affect the scar formation: it would indeed speed up the healing BUT too much so. Do you have any good sources / research on the Vit C issue? I have more surgery coming up and l'd like to inform myself more. Thank you. Cornelia",
      "MessageIndex": 24,
      "PostDate": "20/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719436",
      "Title": "Need to decide one breast or two? catemarie catemarie"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jan 15, 2009 01:17PM - edited Jan 15, 2009 02:14PM by ailenroc BTG:  I am pasting here an excerpt from one of my earlier posts: I don't have any breast tissue anymore ... well, not quite ... there is the 1-2% standard left over. John Link, the well known oncologist and author of a series of BC books, told me that because I have almost no BC tissue left, that I have a lower chance of recurrence than women have a risk for bc in the general population! Stunned, I asked him \"If that is the case, why don't doctors recommend mastectomies more readily or at least suggest them as an option? Why did doctors recommend to me only lumpectomy and radiation with mastectomy being 'completely out of the question?\"   He paused, and then said \"that is a good question; in fact, there is a lot of discussion about that in the field. To a large extent it is obvious that with the drastically reduced amount of breast tissue, the risk for recurrence is drastically reduced too, especially for women who were early stage, no LN involvement ... but doctors are shy to recommend such a drastic step to early stage patients ... and, of course, there is the 'standard of care' ... tradition ... that says early stage bc can be treated with lumpectomy and radiation ... and then there would likely be a lot of protests from all the radiologists and other stakeholders (e.g., GE, Siemens, Phillips) who produce radiological equipment.  Mastectomies would cut a lot of their business.  The situation reminds me of the SAT scores for getting into college: although they are not really useful, do not predict academic achievement ... they continue to be used everywhere ... because that is the general practice and because there is a multibillion dollar industry behind them. Now, with that said, I am not suggesting in the least that every woman should have mastectomies. I think that is a highly individual decision. However, I think that mastectomy should be offered as a treatment option even to early stage patients with a thorough explanation of the risks and benefits of each treatment course. The post above also has detailed info of my post mx recovery, week by week -  and also a pros and cons list that I came up with for myself regarding this big decision. Hope you find some useful info there.  All the best for you and your wife.",
      "MessageIndex": 19,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727067",
      "Title": "Masectomy vs Lumpectomy Decision BTG koshka1"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jan 11, 2009 11:03PM ailenroc wrote: I thought the decisionmaking was the worst. I detailed my decision making process, pros and cons of either approach, and my insights from the process and aftermath in the following post: Bilateral or Unilateral Mastectomy? Implant risks? Hope you find some helpful info there. All the best for you. Cornelia",
      "MessageIndex": 11,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726618",
      "Title": "Just diagnosed w/aggressive IDC theredheadamy kim40"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jan 27, 2009 02:38PM ailenroc wrote: please review the link: http://discoverysedge.mayo.edu/de08-4-gen-goetz/ Tamoxifen only works for 50% of women; the cyp2d6 test would help you determine if it would even work for you.",
      "MessageIndex": 3,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/728022",
      "Title": "Tamoxifen concerns - patient with Atypical Ductal Hyperplasia JanW wallace101"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "ailenroc wrote: I have a friend who was recently diagnosed with DCIS; lumpectomy turned up multi focal disease, resulting in a mx recommendation. She is a DD+ size and wants to retain the other breast, ideally, but realizes that she might change her mind down the road for cosmetic / symmetry reasons, especially after she has switched out of Kaiser into a PPO with access to better plastic surgeons. She knows that she has the right to do bilateral now even if not medically necessary but wants to know if that legal right expires at some point: does she have to decide now or could she have the second one done in half a year? Oncotype score: 1; BRCA neg; bilat bc & bilat mx w recon; Dx 5/30/2008, IDC, <1cm, Stage IB, Grade 1, 0/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/759097",
      "Title": "Does legal right to prophy mx expire? ailenroc CoolBreeze"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jul 8, 2009 01:51PM ailenroc wrote: \"Poor Greg!\"  From a friend who heard that I would have a bilateral mx and whose immediate reaction was to feel sorry for my husband.",
      "MessageIndex": 114,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735274",
      "Title": "100 things never to say to a woman who has had a mastectomy: iwannabefree jillyG"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "ailenroc wrote: I have been searching the boards for posts on scar treatments; I've seen some before ... followed their advice and tried: Topical Treatments: Mederma, Bio-Oil, Scar Guard, Vit E Silicone Sheeting: CVS, ScarFX, and ScarAway  The CVS sheets actually have produced the best outcome, although have not taken care of the problem. My original mastectomy scars (anchor / reverse T shape) healed well: flat, and nearly invisible. However, I have problems with the scars from the exchange; I presume due to the increased internal pressure / stretching of the skin after the insertion of the implant. One are on the left breast has developed into a hypertrophic scar: red, raised, thick and itchy. All of the above treatments have made matters worse. Any recommendations? I have of course talked to my ps: \"He's not concerned\" .... trouble is, I am, because I am bothered by the itchiness every day and concerned that there is a progression of the problem one year after surgery. Oncotype score: 1; BRCA neg; bilat bc & bilat mx w recon; Dx 5/30/2008, IDC, <1cm, Stage IB, Grade 1, 0/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/745151",
      "Title": "Effective Scar Treatment 2 ailenroc ailenroc"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jan 27, 2009 03:46PM ailenroc wrote: Hi movinon: I wrestled with the same question  Lumpectomy, Mastectomy or Bi-Lateral Mastectomy and documented my decision making process, research, and surgery aftermath in the link below: hope it is helpful. Bilateral or Unilateral Mastectomy? Implant risks?",
      "MessageIndex": 27,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727489",
      "Title": "Lumpectomy, Mastectomy or Bi-Lateral Mastectomy movinOn movinOn"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Feb 6, 2009 07:50PM ailenroc wrote: Hi movinon: I wrestled with the same question  Lumpectomy, Mastectomy or Bi-Lateral Mastectomy and documented my decision making process, research, and surgery aftermath in the link below: hope it is helpful. Sorry, here is the link again: hope it works this time. If not, you can always copy the thread title from here, paste it into the search command and access it that way. Bilateral or Unilateral Mastectomy? Implant risks? http://community.breastcancer.org/forum/44/topic/708419?page=1",
      "MessageIndex": 32,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727489",
      "Title": "Lumpectomy, Mastectomy or Bi-Lateral Mastectomy movinOn movinOn"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Jul 28, 2011 12:29PM ailenroc wrote: I tend to be a magnet for mosquitos. But since using 25% or 30% DEET spray, no more problems. I don't like to spray the stuff on the skin. Instead I wear very lightweight sunprotective clothing - spf 50+ (Coolibar; or Sun Preacautions) with long sleeves and spray on the clothes, hat, shoes - so my skin does not get any of the spray. I spent quite some time in the tropics each year deep in the jungle and close to water - the mosquito coast, so to speak - and I have not gotten a single bite. The trick is to have a few changes of that type of clothing; it's a good investment. The clothing is so lightweight and airy that it actually cools one down in the hottest and most humid places.",
      "MessageIndex": 75,
      "PostDate": "28/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/771119",
      "Title": "Preventing mosquito bites? moogie BeckySharp"
    },
    {
      "AuthorID": "ailenroc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68991/profile",
      "Content": "Nov 25, 2008 01:21AM ailenroc wrote: 2 weeks is a good idea. I chronicled in brief my recovery and needs at the different stages here: Bilateral or Unilateral Mastectomy? Implant risks? Hope you find more useful info there. I wish you a speedy recovery.",
      "MessageIndex": 12,
      "PostDate": "25/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724795",
      "Title": "How long do you need someone to help after surgery? rayhope karen1956"
    }
  ]
}