{
  "AuthorID": "Aimee73",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263851/profile",
  "Posts": [{
    "AuthorID": "Aimee73",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263851/profile",
    "Content": "Nov 25, 2017 12:39PM - edited Nov 25, 2017 01:00PM by Aimee73 Waiting and not knowing is the worst. I don't even know what to do with myself sometimes. I'm scared. My husband works in another province and just last week shortly after he got home for days off I found the mass. I don't want to call it a lump because it's so weird and big! I have been having really painful swollen lymph nodes in my armpits for the past few months, on the side of the mass mostly. I shrugged it off at first, stopped using deodorant thinking maybe it was irritating them. It's not always the same lymphnode but they will get big, really sore for about a week and then it goes down and a different one will flare up. The last one was huge, finally made me wonder if there was more going on. Ive never really examined my breasts, silly me. They are very small and deflated,lol. I'm almost 44, breastfed 3 babies and being nearly flat chested it never crossed my mind that I could get breast cancer. After my bath last weekend I was standing in front of the mirror and realized my left breast was noticeablely larger than the right. I started feeling around and realized that underneath between my ribs and the normal breast tissue is a very large mass. It's solid, somewhat oval shaped but not really, it's hard to explain the shape. It's somewhat movable but seems to move the rest of the breast around with it when it's moved. It is not painful at all. The armpit lumps are though. I went to the doctor on Tuesday ( found it Sunday night), she didn't seem to care how worried I was, I left the office wanting to scream at someone, I just want to know now what's going on! My mammogram and ultrasound aren't happening until December 1st, still almost another week! And then I have to wait for the results of that. I'm going out of my mind worrying. I have a really bad feeling about this. I've also been feeling unwell the past few months. Always extremely tired and get have been having dizzy spells, almost fainting, blacking out, blurred vision. And I've had a chill, really cold all the time, extra blankets on the bed. Honestly I wish doctors could put themselves in our shoes and try a bit harder to speed this process up! My husband knows what's going on. I was so upset I had to tell him, he's been very supportive and try's to keep me positive. But he needs to go back to work next week. And I'll be alone! For the tests, the results. Cell service is terrible on their job site, sometimes days go by when he can't call home. I don't want to tell my Mom or sister or my kidswhat's going on until I know what's going on but it really sucks not being able to talk to someone about this. I It's terrifying. The thoughts going through my head all day. That's why I thought I'd post here, just to put it into words. Better than keeping these feeling inside. I'm scared. I don't want to die.",
    "MessageIndex": 41,
    "PostDate": "25/11/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/859886",
    "Title": "Scared to death Shyann30101 Georgia1"
  }]
}