{
  "AuthorID": "aimster1123…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
  "Posts": [
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jun 25, 2007 04:38PM aimster1123 wrote: I agree with the others, with just one more treatment to go I think she can make it. It's hard, I know!! I almost had to start having mine in the hospital, I was having such a hard time, but my Dr. finally came up with a set of meds that make it just bearable for me. 3 more treatments to go! The side effects do eventually go away for me after about a week, and then I feel better. Tell your wife we said she can do this!! And talk to her Dr. about more help to get through the last one. Best wishes, Amy",
      "MessageIndex": 3,
      "PostDate": "25/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/641116",
      "Title": "Question regarding wife's treatment essameldin Renrel"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Dec 30, 2010 08:35PM - edited Dec 30, 2010 08:39PM by aimster1123 Hi all, I'm joining in with the roll call.  I'm not new to the forum, nor new to BC (see my post below) but I haven't posted in a long time.  I'll try to paste everybody who's responded so far, and then add mine at the end. If you're joining up, copy this whole thing and paste it into your message so we keep a running list.  Hope I didn't miss anybody! age 40, starting chemo probably first week of January: 4 AC/2 wks apart, 12 Taxol, 1 wk apart, clinical trial E5103 (80% chance I'll also get Avastin, 20% get placebo). More about me on myblog... ProudMom_Wife in California  Age 45, starting chemo January 5, Dose Dense AC (4x) then T (4x), all 2 weeks apart.   Tundra in Montreal, Canada Age 35, started chemo Dec 28th, (2010); Taxol: weekly for 12 weeks. Then on to AC... age 44, starting chemo January 18: 4 AC/2 wks apart, 4 TC/2weeks (neulasta 24 hours after the AC and TH) then weekly herceptin for the rest of the year. aimster1123 from MO age 42, starting chemo Jan 13:  TC 4x, 3 weeks apart.  But, it's my second time around with BC (and no, I don't have BRCA--just \"lucky\")--had it in 07, too, and had FAC 4x, 3 weeks apart.  So it's my second time losing hair and all that.  Ask me anything you want!   Many people call chemo \"doable\" but for me it was absolutely hideous, and my onc would agree.  I'm hoping this time will be better, but not expecting it.  I can give more details if you want them. :)",
      "MessageIndex": 58,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Dec 30, 2010 08:57PM aimster1123 wrote: Sorry for all the font/bold trouble in my roll call post--I guess my pasting didn't work very well! Amy ",
      "MessageIndex": 60,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jan 2, 2011 10:03PM aimster1123 wrote: Hey all,  I feel like a complete dork!  For weeks I've been misremembering the chemo I had my first time around--it was FEC, not FAC.  So all the hideous nausea I had last time probably came mostly from the C, which I'm having again this time.  I was kind of hoping I'd have it easier, since I wasn't getting A this time (and that's known as a bigger nausea-causer than C) but turns out I didn't get it last time either!!  I had to go back and read my own blog posts from 3.5 years ago to figure this out.  DUH!  Welcome to all the newbies!!  Mary Margaret, I'd love to hear more about what it was like for you after your oophrectomy, being in menopause and all that.  I'm going to be having that down the road, since even though my cancers have both been er/pr+, tamoxifen didn't help.  I'm so impressed that you tried BodyPump in the midst of all this!  YAY for BodyPump!  I love it so much.  I hope you'll give it some more tries, because we always say it takes 3 classes to really decide what you think of it.  I get to go to it myself tomorrow, for the first time since surgery--it's the first possible day my surgeon would allow it.  I CAN'T WAIT!!  I'll be doing the class with NO weight on my bar, but who cares?  I can't wait to be back in my happy place, working out with friends.  It's gonna kill me, but I can't wait.  OK, about hair loss, last time I was on FEC(!) and it started coming out exactly 13 days after my first treatment.  I reached up to run my fingers through my hair, and when I brought my hand down, I had about 20 hairs in it.  I went and got a pixie cut the next day (it was down to my shoulders before that) but 2 days after that it was coming out so much I felt like I was shedding everywhere and was going to get a bald spot in back and not know it.  So I had my hubby shave it.  What a relief!  I was so scared about it, but when it was over, I looked in the mirror and realized I was still me.  And my husband said sweet things about how I looked like Demi Moore in GI Jane (yeah right).  At first I wore a lot of scarves, then I got really into wearing a half-wig with hats, and then for the last part I wore mostly my full wig.  I stopped wearing a wig the minute my hair was about 1/4 inch long.  That was exactly 3 months after my last chemo treatment.  It was summer/hot for most of the time I was bald, so I'm curious what it will be like to be bald in the freezing cold.  Yikes! All for now--I'll probably write more once chemo starts and I hit the bed. AmyA (aimster1123)    ",
      "MessageIndex": 95,
      "PostDate": "02/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jan 3, 2011 09:13PM aimster1123 wrote: Just some thoughts on how to \"plan\" for when to have chemo, or what to anticipate being able to do or not do afterward. People say it all the time to the point that it sounds cliche, but it really is true--everybody is different and reacts differently.  I was a puking maniac, on a regimen that was supposed to be \"easy\"--other people refer to chemo as \"doable\" and \"not really all that bad.\"  Some people start feeling sick right away, for others it doesn't hit until 3-4 days after treatment and then WHAM!  So planning is really, really hard to do. I think it's fairly universal to say a few things, though.  1)  Most people on a 3-week cycle have the most trouble the first week after treatment, and then feel better and better til the next one.   2)  Most people find that the first treatment is the easiest one, and the second one is often harder.  After that, fatigue increases as you go, but usually ickiness tends to turn around on the same day.  I'm sure there are exceptions to both of these things, but this seems to be the general trend. So, that still makes it really hard to plan!  Vis, I'd say that Friday or Monday are your best bets.  If you want to be sure you can be at work on a Thursday, then do Friday.  But if you're really worried about the ER, you could wait til Monday.  Is your concern with the ER that it will be super-busy on the weekend?  Because with my clinic, you don't wait through the regular chattel at the ER--the onc always calls ahead (because you call them first) and tells them you're coming and to take you right in.  And I know the other major cancer center in town has a special floor that you go to for ER, instead of the regular one.  So if yours is like that, you wouldn't have to worry about waiting, should you need to go. MaryMeg, my instincts say that you very well COULD be up for singing (especially since this is your first treatment), and if you could do it it would be SO uplifting for you AND for everybody who hears you and knows what you're going through.  That said, I wouldn't plan to do it without the understanding that if you aren't up for it, you will cancel and they'll have to deal.  I would just talk to them about it and say that you REALLY want to do it, but you can't guarantee you'll be physically able.  Then maybe they'll also be up for letting you do it on a different week, when you know you'll be feeling good, like the Sunday BEFORE a treatment instead of the one right after. This is a huge journey that we're on, and chemo is a GIANT mountain in the midst of it.  There will probably be days when you feel like CRAP, and can't work, and the world will go right on spinning.  My advice is, take the time you need to care for yourSELF.  If ever there was a time when it can be OK to do that, it's now.  After this is all over, we can go back to being the ones who take meals to other people and work extra hours.  For now, we need to let others care for us, and slow down when we need to.  That's my little sermon!  And I'll need you to write it to me again when I try to push myself to go teach violin lessons when my body is telling me otherwise, OK?  Vis, we all know about being down!  Man, sometimes it just comes over you and you can't find a way out.  I've been there many times, with both dx, and it's so so hard.  The sun WILL shine again, but sometimes you have to wait for it to show up.  Just know that the ups and downs are totally normally, and don't beat yourself up for them.  Come and post here, and we'll do our best to lift you up. Last thought:  Waiting for scan results STINKS!  I have to say, any nurse who says you \"shouldn't be nervous\" has never been in our position.  That said, I was a whole lot less nervous my first time around with BC--I was too naive to realize the major ramifications of what the results would mean.  Now I'm a lot more \"experienced\" and scans FREAK me out.  I just brace myself until they're over, and pray and pray and pray for enough peace to get me through it.  That's about the best I can do! All for now, girls, AmyA (aimster1123) ",
      "MessageIndex": 103,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jan 17, 2011 11:06AM aimster1123 wrote: Hey all,  Here I am, day 5 after my first TC.  We knew going into this that I'm the nausea queen, so they immediately put me on the anti-nausea pump right after chemo was over.  Day 1 I also took a Marinol, and seemed to do fine when that wore off.  Used 26 extra anti-nausea doses from the pump (asked for 48, but it locks you out for 15 minutes after each request, so I couldn't get all I tried for) in the 1st 24 hours.  Then Day 2-3 seemed a lot better and I only needed 8 extra doses, so it seemed like it was time to get rid of the pump on day 4 (which was WAY earlier than I used to get rid of it when I did chemo before).  BAD IDEA.  Within 4 hours I was hugely nauseated, ALMOST ready to throw up, called the onc and he said to have them come put the pump back on.  So we did that last night.  So here I am on day 5, hooked up again, feel like total crap--nausea, headache, exhausted, can't do anything but lie in bed.  This is turning out, sadly, to be a lot like what chemo was like before, although both my onc and I hoped and thought it would turn out better.  Oh well.  Just have to settle in for the long haul.  I was dreaming of going to the gym today, and doing  some laundry, and just FEELING a little more like myself, but forget it, I'm a useless blob. Sounds like almost all of you are doing better than I am--if not, CALL YOUR ONC!!!!!  They WILL help you and you shouldn't hesitate to ask for it.  You're paying them well.  Over and out from yucko-land, Amy ",
      "MessageIndex": 327,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jan 19, 2011 05:21AM aimster1123 wrote: Aimee, that's exactly how it happened for me, too.  The next day I got a pixie cut (mine was shoulder length before that) and that lasted 2 days before I became too paranoid about shedding and possibly getting a bald spot that I wouldn't notice but others would.  So, started coming out on Thursday, pixie cut Friday, shaved on Sunday.  A huge relief, actually, but working up to it was scary.  Hang in there, and tell us what you decide.\\ Amy (my full nickname growing up was \"Aimster-Rooster\", believe it or not! ",
      "MessageIndex": 370,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jan 18, 2011 04:07PM aimster1123 wrote: Hey all,  Day 6 here, still pretty low.  I'm on the pump still, still nauseated, had diarrhea today--hd wants to think that's a step in the right direction??  I'm not too sure--it sure felt yucky!  Totally dead-tired.  I forced myself to walk around the house a couple of times and put in some laundry, then retreated for the bed AGAIN.  I remember from last time through this that there was always a very specific \"turn-around\" time for me--in a matter of hours I would begin to feel way, WAY better, and crave food, and want to do things.  So I'm just hanging on, waiting for it.  Something tells me it will be on Thursday, because that's when it was last time, but who knows?  Has any of you experienced that?  As soon as I get this pump off, my plan is to show up at the gym the next day and do SOMETHING.  And my mantra is going to be \"gym before all else\"--I figure if I can do a workout, it will boost my energy and endorphins, but even if it doesn't, I've put first things first that way.  So here's hoping for Friday or Saturday to do that! Slcst--hang in there.  Tell us how you're feeling.  And if you throw up--call your onc!  Even if you don't, but you think you might, you should call.  They don't want you to get \"behind\" the nausea if you can help it. Blessings to everybody, Amy And MaryMeg, YES it's BodyFLOW here--same as BodyBalance!  I might try to fit one of those in soon... ",
      "MessageIndex": 365,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jan 23, 2011 11:51AM aimster1123 wrote: Hey all, Amara, welcome!  Maybe somebody has said this already, but as a fellow \"youngster\" (I was 38 with my first dx--this is my 2nd time with BC and I'm 42--still considered \"young\") I've heard it said many times that they usually lean toward giving chemo, to really try to take care of it so you aren't dealing with this again.  That said, I HAD chemo the first time, and still got it again, but there was only a 3% chance of that happening, so you can't go by my experience. :) So, I'm on day 11, and the crawl out from under chemo-yuck is SO SLOW.  No dramatic turnaround day for me, the way I had last time I went through this.  But, I'm off the pump, and not quite so nauseated.  My stomach is a little better too--there for a while it was just in constant turmoil.  At this point I still have very little appetite--I just eat to make sure there's something in my stomach.  I'm lightheaded after a short time of walking around.   I DID manage to work out yesterday, though!  I went to BodyStep and did the whole class with no extra risers--just the bench top.  I had to keep it very low-impact, low-energy, because I felt like if I pushed it too hard I would probably pass out, seriously.  But I managed to get through it and it felt good.  Now, after that I came home and absolutely couldn't get out of bed the rest of the day.  But at least I did it.  I'm going to try again on Wednesday, I think.  I'd love to do it more, but I'm realizing I have enough energy for about 1 activity per day, and I have to teach violin lessons on Monday and Tuesday, so that will have to be it for me. I'm curious to hear everybody's shaving stories!  How you felt afterwards, especially.  The anticipation was SO much worse than the event last time.  Oh yeah, I got a \"twiggy\" cut on Friday and I love it.  Too bad I won't have it for more than a week or so. :(  I'm pretty well stocked with scarves and hats and wigs, so I guess I'm ready. MaryMeg, you always make me laugh--thank you. :) Love to you all, Amy ",
      "MessageIndex": 444,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jan 1, 2011 05:14PM - edited Jan 1, 2011 05:19PM by aimster1123 Hey all,    OK, sorry for the weird spacing!  I guess it doesn't work too well to write in a different program and paste in.  Took me a while to realize that we had continued on to page 3!!  Duh! JulieH, yes, the F was Flourouracil (sp?).  My onc really doesn’t know if it will be as bad, the same, or worse than last time, but he’s already planning to put me on an anti-emetic pump immediately after treatment.  That’s what I had to do last time if I didn’t want to end up in the ER with massive throwing up troubles.  I also had to take Marinol (synth marijuana) last time which I HATED, so I’m really hoping I might not have to take that this time.  YES, my port has been pretty sore both times, but I got mine two weeks ago and I don’t even notice it at all now. Karen,  sounds like we’re on the same chemo regime—TCx4, 3 weeks apart.  And both on our second dx, too—probably no coincidence!  Did you say when you start?  1/13 for me.  I agree with most of you that the port procedure isn’t too bad, in the grand scheme of things.  And it’s SO nice to have it.  Last time I ended up having so many more IV’s than I would have expected, and it was never a big deal.  Just stick it in and you’re good to go. Warriorprincess, SO sorry you’re having to go through this at ANY age, but especially so young.  You are brave and awesome.  You’ve probably already thought about having the genetic testing done, but plenty of time for that after treatment is over.  You are in such a great place being at home, and you will get through this a little at a time.  When you come out the other side, you will have learned and matured and grown SO MUCH.   AmyK, I read some of your blog pages—you and I have a fair bit in common, besides just our names.  I too have a LONG infertility story (our 2 kids are adopted from Russia) and am an exercise fanatic (hope you don’t mind being grouped with me in that!).  I teach BodyPump (weightlifting class) and was in the process of getting certified in BodyStep (athletic step aerobics class) when my 2nd dx came up.  I’m an artist, too, but in the form of a violinist, not a writer or graphic designer, though. :) A little more about me:  in March 07 at age 38 I was diagnosed with IDC, stage 1, neg nodes, 1.1 cm tumor.  I had lumpectomy, chemo (FACx6) and rads, and took Tamoxifen until my recent dx.  This time I was dx’d in early November, after my onc found a lump at my regular exam.  I had bilateral mx with TE’s on November 18, 6mm tumor and one positive node.  I’ll be starting chemo on 1/13 as you know, CTx4, 3 weeks apart.  After that they’ll give me shots to put me in menopause, and most likely I’ll ultimately have a full hysterectomy to make menopause a permanent thing.  And of course I still have to have reconstruction.  My onc says that my body probably doesn’t metabolize Tamoxifen, since this cancer was er/pr + (as was the last one).  It really shouldn’t have been growing at all, but it was.  My onc  said my chances of recurrence were 3-4%.  I don’t have BRCA—had that test done a couple of years ago—I’m just lucky. :) All for now, AmyA (aimster1123)",
      "MessageIndex": 75,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jan 17, 2011 01:20PM aimster1123 wrote: Vis,  I feel for you!! What has your onc suggested so far?  There IS more they can do.  There are anti-emetic pumps, different drugs, even hospitalization (I almost did this last time, and a friend of mine is having to do it right now) during infusion so they can watch you and give you IV meds to help you up to the place you need. Working may NOT work--it will be OK.  I know this is so, so, hard.  For once this is your time to make yourself the focus.  YOU are the priority this time.  Call out for help, too--is there somebody who can call the onc for you, and help make your case a little more clear?  This is tx 1, right?  Trust and know that if your onc is worth his/her salt, they WILL make subsequent tx's go better.  Let us know the latest when you can, Amy ",
      "MessageIndex": 333,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jan 17, 2011 01:22PM aimster1123 wrote: Hey all, Still in yucko-land, but I've been taking Marinol a little more often.  It's kind of 6-of-one, half-dozen of another--the Marinol makes me totally out of it and sleepy, with no attention span, but puts the nausea in the background.  Without it I'm more nauseated, yet coherent, but likewise I'm more aware of the headache I have, too.  So I'm going for number rather than sharper right now.  I'm figuring day 14 or so for hair fall-out, shave the weekend following (29-30). I believe they give Neulasta once you've demo'd a need.  I didn't get it after tx 1 3.5 years ago, and then DID for every tx after, since my white counts dropped super low in between tx 1 & 2.  This time they gave it to me right away after tx 1.  That stuff definitely works.  So, I continue in my blob-like state.   I know from experience that eventually I will fee better.  Waiting for it is what stinks!  Amy ",
      "MessageIndex": 334,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jan 17, 2011 04:42PM aimster1123 wrote: Hey all, I'm totally with you all on the exercise!  As soon as this pump comes off and I'm up to it, I'll be there, every day I can, for an hour or more.  My exercise addiction came after my first battle with BC, and it's all based on group fitness.  If you've ever tried it, and you're hard pressed to WANT to exercise, give it a try!  Put me in a class, and I'll do anything for you.  Put me on my own, and I'll last half as long.  A minimal exercise week for me is 5 hours, a great one is 8.  Right now, I'm at 0!  UGH.  It's killing me, but I have to just lay down and take it--no choice.  I did manage to teach a little bit of BodyPump last week (at my Monday 5:30am class, no less!), before chemo, so I just have to look for the windows when they come up. By the way, I'm on TC, no A.  Last time I had FEC, so no A then either, but the Cytoxan definitely did a number on me.  I think I might be attributing the low-point of this day 5 to the Taxotere, which I've never had before.  A lot of people say that they get a delayed reaction to that drug, and for me last time things always got steadily better after the initial yuck.  This time seems to be much more up-and-down, so that's my theory as to why for the moment.  So glad to have you ladies to slog through this with. Amy ",
      "MessageIndex": 337,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jan 19, 2011 02:29PM aimster1123 wrote: Hi all, SO sorry for everybody suffering through this!  And SO glad we can suffer together, at least.  I don't know if I hit a true \"turnaround\" yet, but nausea is DEFINITELY better today, finally.  Tomorrow we're going to start the process of weaning from the pump.  The in-home nurse will switch it over to demand-dose only (instead of every-30-min-drip + demand doses) and I'll start taking anti-nausea in pill and patch form.  Assuming I feel OK 24 hours later, and haven't needed to use the demand doses, I'll be DONE.  Thank goodness! By the way, Ativan is a beautiful drug, IMO!  Helps with nausea and anxiety, and helps you sleep. Which is what I need to do right now!  ;) Love to you all, Amy   That said, I think I'm starting to get a taste of the Taxotere joint pain.  Suddenly today, my hips are really, really sore.  It's not a muscle pain, it feels like it's IN the bones.  Very bizarre, and actually fairly painful.  But honestly, I'll take it over the nausea I've had the last week any day.  At least, I say that now, LOL!  I'm definitely in better spirits today, after this upturn, and an amazing, beautiful time with God this morning.   ",
      "MessageIndex": 387,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "May 25, 2007 12:23AM aimster1123 wrote: Hey, Just checking back in to say that yesterday was day 15 of my first cycle and the hair started coming out. Yikes! How long does it take to fall out? Do I have a couple days, or a couple weeks? Just curious, Amy",
      "MessageIndex": 33,
      "PostDate": "25/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/571635",
      "Title": "Anyone having FEC? ducky1 SKD"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "May 7, 2007 12:29PM aimster1123 wrote: I'm having 6 rounds of FEC every 21 days, starting this coming Thursday, 5/10. Mine is adjuvant--had lumpectomy with neg nodes, pr/er+, her2 neg. My onc thought about TC, but since I'm a professional violinist, we decided to avoid the neuropathy. I had 2 opinions from oncs, and the other one would only offer me FEC through a clinical trial, saying that it had not been tested enough, in his opinion. But the other onc is a more forward-thinking Dr., IMO, and FEC was his idea after spending a weekend \"agonizing\" (his word) over which treatment to give me. So hopefully it's the best option! I think it is, or I wouldn't have trusted him with my care. How soon did you lose hair with FEC, anyone? What about other side effects? Just trying to get a handle on what this is gonna be like! Amy",
      "MessageIndex": 17,
      "PostDate": "07/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/571635",
      "Title": "Anyone having FEC? ducky1 SKD"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "May 12, 2007 01:20AM aimster1123 wrote:",
      "MessageIndex": 22,
      "PostDate": "12/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/571635",
      "Title": "Anyone having FEC? ducky1 SKD"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "May 7, 2007 05:51PM aimster1123 wrote: Forgot to mention that I'm in the US. My understanding from the one onc that didn't want to give me FEC, was that it hasn't been tested enough in the US to have become a mainstream option here. I guess they're cagey about taking on a new primary treatment?",
      "MessageIndex": 18,
      "PostDate": "07/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/571635",
      "Title": "Anyone having FEC? ducky1 SKD"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Jul 8, 2007 02:13PM aimster1123 wrote:",
      "MessageIndex": 5,
      "PostDate": "08/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/650032",
      "Title": "Extreme Fatigue? shopper16 shopper16"
    },
    {
      "AuthorID": "aimster1123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49767/profile",
      "Content": "Aug 30, 2007 07:42PM aimster1123 wrote:",
      "MessageIndex": 12,
      "PostDate": "30/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/685875",
      "Title": "questions for those done w/chemo bluewillow karen1956"
    }
  ]
}