{
  "AuthorID": "Aisha32",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88181/profile",
  "Posts": [
    {
      "AuthorID": "Aisha32",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88181/profile",
      "Content": "Sep 18, 2009 05:21PM - edited Sep 18, 2009 08:22PM by Aisha32",
      "MessageIndex": 1,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/740586",
      "Title": "Phyllodes tumor !!!!! Aisha32 Aisha32"
    },
    {
      "AuthorID": "Aisha32",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88181/profile",
      "Content": "Aisha32 wrote: So what is a phyllodes tumor? The nurse called me back this afternoon at 2:00 and apologized for not returning my call from yesterday. She told me that my tumor was benign (YEAH!!!) and was called a phyllodes tumor and that this type of tumor grows rapidly and quite large, so it was good that my lump was removed. She told me they did need to see me for follow up...I reminded her that I am scheduled for 9/29. I asked her to spell phyllodes for me and told her that I was having tightness in my armpit. She spelled it out and then told me to see how I was doing next week and call back if it does not feel better. I did not ask for the sleeping aid because I realized I have to get a lot done this weekend and although it is quite obvious I need to take care of myself, these things have to be done. I am going to run out and get some Tylenol PM though. Anyway, you know I digress easily. I will tell you that it my digression and lack of focus is apparently due to anemia and it is quite serious. I have always had borderline low blood iron and found out ten minutes before having my biopsy that I was really anemic, so I called my primary yesterday and I have to follow up next week. Taking an iron pill is not going to cut it... Focus... I looked on the internet for like 45 minutes at work after the nurse's call and then left to get my ladies. This is what I read about Phyllodes tumors: These are rare tumors (less than 1% of tumors are determined to be this type) and they can be benign, borderline or malignant. They are not found in the lobes or ducts of the breast. These are commonly confused with fibroadeomas, so you need a skilled pathologist to test it. Phyllodes tumors can grow to be quite large, regardless of whether they are benign, borderline or malignant. Surgery to remove is the best option, regardless of whether it is benign borderline or malignant. It appears that the testing protocol of this tumor is somewhat more extensive. Needle biopsies do not allow for a more accurate determination of whether it is a phyllodes tumor or a fibroademoa and if the former, whether it is benign or malignant. If it is malignant, surgery to remove adjuvant with radiation. You have to have a margin removed with the tumor regardless of benign or malignant. What is a margin? Does this mean that the surgeon needs to isolate it or where it was in the breast? I think I learned some thing else, but I want to look more and most importantly, I want to hear from you to see what you have heard about this. I found a lot of information on this site and looked up Dr. Barth as recommended by one sister to another sister on this board. Yall ladies are amazing people. I have my follow up with the surgeon and I know I need to do my homework for the next ten days. Long story condensed, I had a good twenty questions when I went in for my initial consultation. I met with the nurse practitioner first and for a more extended amount of time. I told you before that I was disappointed or second guessed her because she she gave me two incorrect pieces of information to questions I asked her. About having blood work and general anesthesia. I forgot to tell you that I asked her too if some healthy tissue would be removed along with the lump and be tested.  I had read that on a number of sites and in some of the posts from the ladies here. She told me no, just the lump. I did not ask the surgeon those three questions because I felt comfortable with her answer based on the fact that I am a paralegal and if I cannot give you an answer about a legal procedure I will tell you that I do not know the answer to that, that you need to ask one of my attorneys or I will find that out for you. My fault for getting comfortable. I guess now a question is if what I have read is correct, that you need to take tissue surrounding it, then was this done in my case. I have to read the report. When I follow up for my anemia appointment next week, I am going to have my primary give me a copy. This is the kicker and another area of concern. My older sister has had two lumps. One was a cyst and another was what? A phyllodes tumor- benign. She only had a needle biopsy and if what I read was correct, she needs to have it removed because it is going to grow and because it needs to be tested properly. I have so many questions for this surgeon.   I am going to go look some more on Phyllodes and also anemia but I will be back. Take care, hugs and kisses. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/740586",
      "Title": "Phyllodes tumor !!!!! Aisha32 Aisha32"
    }
  ]
}