{
  "AuthorID": "AJBaller",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60829/profile",
  "Posts": [
    {
      "AuthorID": "AJBaller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60829/profile",
      "Content": "AJBaller wrote: Hey guys..I'm a little new to this, so if my technical explanations are off..please help educate me. My mother is 56 years old, and was just diagnosed with Stage 2 breast cancer.  Her tumor however was 10 cm large, but it is classified at stage 2 because it had not spread to her lymph nodes (from what I have read stage 2 is generally 2-5 cm).  Is this a very odd occurence?  Does this put her at a significantly higher risk, despite the fact that she is only in Stage 2? They removed the mass in the start of October, and she recently began her chemotherapy  (She has had 2/6 treatments, and will undergo radiation afterwards).  This is very hard for me to deal/see.  I go to school in a different city, so I can't even be with my mom and it kills me.  I actually only found out tonight because they wanted to tell me in person, not over the phone. I'm so scared, its so hard watching my mom be so weak and frightened.  I am doing everything I can to support her.. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/697273",
      "Title": "Worried son? AJBaller Shirlann"
    },
    {
      "AuthorID": "AJBaller",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60829/profile",
      "Content": "Dec 22, 2007 12:33PM AJBaller wrote: Thanks for all the support everyone, I really appreciate it I do believe the cancer is Stage 2 though (The doctors told her this) Stage 2B means * The tumour is less than 5 cm and the lymph nodes under the arm contain cancer cells but are not stuck to each other, and the cancer has not spread or * The tumour is bigger than 5 cm across, there are no cancer cells in the lymph nodes in the armpit and the cancer has not spread So she falls under the 2nd point there, it is a large tumor, but it has not spread.  So that is very good. ",
      "MessageIndex": 5,
      "PostDate": "22/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/697273",
      "Title": "Worried son? AJBaller Shirlann"
    }
  ]
}