{
  "AuthorID": "Akitagirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
  "Posts": [
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Oct 28, 2014 10:19AM Akitagirl wrote: Hi everyone - had this torture done yesterday and was not happy with the radiologist.  He came in and said, \"whatever you have heard, this does not hurt\".  Well - it hurt like HELL.  I was very upset that he set me up for that.  I would have rather him tell me that this will hurt, but only for about 15 seconds.  Afterwards, my MIL said to him, \"you must have gone to glamour school and learn how to prepare patients for this\" he replied that if patients expect little pain, then they will have little pain.  To that I replied, \"bullsh$!t!!!\"  That got everyone laughing.  :-) Bottom line....be prepared for the worst and be thankful for the best. Akitagirl",
      "MessageIndex": 64,
      "PostDate": "28/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769441",
      "Title": "Radioactive Injection into Nipple NOT TERRIBLE waynesgirl50 Motherofall6"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Feb 11, 2015 02:32PM Akitagirl wrote: Homemom - You might be on to something!!! I was reading through this, as I have passed my 4th round of TCH and have 2 more to go...starting to really miss having hair. At any rate, I began losing my hair almost exactly 2 years ago. I used to have very thick, healthy hair and on my 40th birthday, started noticing it become very thin in the front and on the sides. Not a male-patterned baldness, just a frontal thinning. In fact, that is what started all of this in the first place, my hair thinning! I had started taking synthroid, thinking it was my thyroid...nope. Then I finally went to the dermatologist in early August. He found melanoma in-situ on my back, which scared me enough to remember my bi-annual mammogram, which then found the BC. I honestly believe that my hair thinning began with the early stage of my cancer. There is absolutely zero family history of male or female balding - in fact, my 72 year old dad still has a head full of hair. At any rate, I will let everyone know how the hair re-growth goes, but I do have hope! Thank you for sharing! Akitagirl",
      "MessageIndex": 21823,
      "PostDate": "11/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Oct 7, 2014 10:52AM Akitagirl wrote: Coraleliz - I am sorry you are having such a hard time with that MO practice.  It's actually quite common to not allow patients to switch.  In my previous practice, once a patient selected her OB/GYN, she is not allowed to switch.  This especially is enforced if she is pregnant (we did not share call, but took 24/7 for our own patients - not a good QOL).  Unfortunately, the rationale for this is simply revenue and ego...hence why I left and do not even practice anymore.  Many times policy overrides patient wishes and that is not right.  I might recommend that you have your BS and RO get in touch with your MO to discuss and hopefully convince him to come into alignment.  Doesn't always work, but sometimes peer pressure is the ticket. This has been a very interesting discussion.  I was not planning on even requesting the Oncotype, as it will not influence my chemo decision.  However, hormone therapy poses significant risk for me, so having this measured will hopefully give me reassurance in declining tamoxifen.  Thank you, ladies!",
      "MessageIndex": 14,
      "PostDate": "07/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/825115",
      "Title": "can i demand Oncotype Dx testing zha-an kris1114"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Oct 23, 2014 02:07AM Akitagirl wrote: Hi Bippy - this is a difficult decision indeed.  Originally, I was not even considering a bilateral mastectomy.  However, I did say that if my genetics came back positive, then I would consider it.  So...I did test positive for the PTEN mutation, which puts me at a very high risk of recurrence in the other breast.  Therefore, I have decided to move forward with a BMX.  Some of the thoughts that help me feel a little better, is that I am very small to start with, I am having augmentation done, and now they will be easier to match.  That may sound silly, but it does help me cope with the thought of losing both breasts.  Another thought that puts it into perspective is that I am 42, and do not want to continue getting mammos and CBEs every few months for the rest of my life.  That does not fit in with my busy life.   Have you had your genetic testing?  That might help tip the scale. Akitagirl",
      "MessageIndex": 9,
      "PostDate": "23/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/824232",
      "Title": "Surgery, dense breasts, HER2+ and me Bippy625 knmtwins"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Jan 13, 2015 12:12PM Akitagirl wrote: Hi MrsTee, I was in your same situation. The deal breaker for me was the return of my genetic testing. When I found out that I had a PTEN mutation, which give me an increased risk of bilateral cancer, I moved ahead with a BMX. It turns out they found LCIS in my right breast along with the IDC in my left breast. Positive sentinel node and down the rabbit hole of chemo I went (and still am). However, my reconstruction is going well. Getting my TEs filled is not a big deal and being a previously small-breasted woman, it's kind of fun to see them grow instantly. Kind of lovin' my insta-boobs. ;-) Everyone here is correct - it is a personal decision that only you can make. We are all here to support whatever that is and we will help walk you through this journey. Hugs, Akitagirl",
      "MessageIndex": 17,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/827513",
      "Title": "Help Please! MrsTee Izzyfran"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Nov 28, 2014 12:00PM Akitagirl wrote: Hi there, I had IDC with a 1.7 cm tumor that was just beneath and a bit lateral to the areola/nipple. My main goal was to do a nipple-sparing mastectomy with reconstruction. Unfortunately, when I had the MRI prior to surgery, we found an extension of the tumor that went directly to the nipple. Therefore, we performed a full mastectomy and the surgeon \"cored\" out the nipple, leaving the areola. The results were much better than I expected, and the plastic surgeon and I are discussing a future surgery to take half of my right nipple and putting it onto the left side to give it a little more even appearance. That might be a consideration? Also, I agree about the radiation. It is the plastic surgeon's worst enemy and if you want to complete reconstruction with great outcomes, I might recommend a mastectomy over a lump/quadectomy - in order to avoid any radiation. Then, you have lots of options for reconstruction. Just some food for thought! Sincerely, Akitagirl",
      "MessageIndex": 7,
      "PostDate": "28/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826577",
      "Title": "Tubular but close to nipple - Quadrantectomy or Mastectomy? katcar0001 katcar0001"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Jan 7, 2015 01:27PM Akitagirl wrote: Spookiesmom - Agree, there is no current antidote for this medication. However, I have been on it for over a year and have had several minor cuts and one major one from a figure skating accident that required sutures...the bleeding does stop. :-) I also am on chemo in combination with this and even with the lower platelets, if I cut myself or if my nose bleeds...it does stop. There have been no serious adverse effects or loss of life directly correlated to any of these Factor Xa inhibitors and their safety profile is BETTER than coumadin. There are no cases of anyone bleeding to death. However, there have been cases of transfusions needed for both patients on coumadin and on these newer meds. Furthermore, they are working on a antidote and are almost complete with trials that are looking at how to test the efficacy of this drug, as you cannot rely upon INRs or PT/PTT to measure effectiveness. Some people develop antibodies and hence this type of medication may not work, that is why testing is being developed. You are correct that there is an antidote to coumadin. However, as you are well aware, it is very tricky to keep your INR levels consistent, as this drug has many drug-drug interactions as well as drug-food interactions. These new drugs do not have the sensitivity or interactions with other drugs. By the way, I am not a drug sales representative. I am a research scientist who is accountable for the quality of design and execution of clinical trials within the cardiovascular therapeutic area.",
      "MessageIndex": 11,
      "PostDate": "07/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827410",
      "Title": "On Coumadin sunseta1969 sunseta1969"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Nov 15, 2014 10:26AM Akitagirl wrote: Hi hummingbird - when do you expect your oncotype score back? R.",
      "MessageIndex": 3,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826287",
      "Title": "Poll on Final Pathology Report Mommy2Six ThinkingPositive"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Akitagirl wrote: Hi Ladies, Although I am fairly new to this wonderful site, I haven't seen any referrals to the National Comprehensive Cancer Network site.  Here you will find guidelines for patients specifically for each stage of breast cancer.  Their professional guidelines are used daily in practice and they have basically taken these and made them 'patient friendly'.  I encourage those who are newly diagnosed to read through the guidelines.  Helps to get the basics.  Sorry if this is repetitive, just wanted to make sure folks had this info. www.nccn.org Blessings to all, Akitagirl germline PTEN mutation - thus, bilateral mastectomy with reconstruction. Taking part in research study for those with low HER2+. Dx 9/2/2014, IDC, 1cm, Stage IIA, Grade 2, 1/9 nodes, ER+/PR+, HER2- Surgery 10/27/2014 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery 11/6/2014 Lymph node removal: Left, Underarm/Axillary Targeted Therapy 12/3/2014 Herceptin (trastuzumab) Chemotherapy 12/3/2014 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Surgery 4/27/2015 Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824987",
      "Title": "Great resource - thorough and clear! Akitagirl Akitagirl"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Akitagirl wrote: Hi Everyone, My oncologist is referring me to Dr. Chong at University of Colorado to discuss whether I am a candidate for lymph node transplant. Just wondering if anyone has had experience with him? Thoughts? Recommendations? Thank you! germline PTEN mutation - thus, bilateral mastectomy with reconstruction. Taking part in research study for those with low HER2+. Dx 9/2/2014, IDC, 1cm, Stage IIA, Grade 2, 1/9 nodes, ER+/PR+, HER2- Surgery 10/27/2014 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery 11/6/2014 Lymph node removal: Left, Underarm/Axillary Targeted Therapy 12/3/2014 Herceptin (trastuzumab) Chemotherapy 12/3/2014 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Surgery 4/27/2015 Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/857352",
      "Title": "Dr. Chong in Denver...anyone know him? Akitagirl Akitagirl"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Dec 11, 2014 11:06AM Akitagirl wrote: Lillp07 - Have you talked to your doc about doing a skin sparing mastectomy and then just \"coring\" out the nipple? That way, the incision is beneath your breasts, will not show if you plan on doing reconstruction, and all they do is take out the nipple, but leave the areola. I had to have my left nipple taken, but on the other side, she did a full skin/nipple sparing mastectomy. My PS will now take half of my (rather small) right nipple and give it to my left side. Even with that, I still plan on doing a really pretty flower tattoo over the left breast. There are some amazing pictures on Pinterest. Just look up \"mastectomy tattoos\" and you'll be impressed! Good luck! Akitagirl",
      "MessageIndex": 6,
      "PostDate": "11/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826892",
      "Title": "Double Masectomy with no Nipples Lillp07 bobogirl"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Dec 11, 2014 01:19PM Akitagirl wrote: Hi there, I agree with what everyone has said...pain is different for everyone and there is no \"right\" answer. For me, I am not allowed to take the one over-the-counter med that works for me - ibuprofen. Tylenol does not touch me and so I have to take a prescription strength. With that being said, after my BMX, I took all my meds for about 3 days and then reduced it to 1 dose in the morning and 1 in the evening. Now I am taking a little bit of percocet to help with the Neulasta shots during chemo. Nothing else touches it. So, I may take more than others, but again...everyone is different. Akitagirl",
      "MessageIndex": 11,
      "PostDate": "11/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826885",
      "Title": "Poll: How Long Did You Need Pain Meds? Mommy2Six Ariom"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Sep 30, 2014 05:05PM Akitagirl wrote: Hello there!  I am in the fairly early stages of this journey and have really appreciated all of the input from this incredible site!  As a 42 yo with 1.8 cm IDC, ER/PR+, HER-, BRCA pending and pre-surgical, I have now consulted with all of the specialists and have thoroughly reviewed the NCCN guidelines and researched several articles.  If I do have any positive nodes, I will definitely choose chemo.  Even if I do not have nodes, I will still consider chemo.  Why, you may ask?  Well, right before I found out about my bc, I also discovered that I have Melanoma (in-situ, thank God).  I have also had two brain tumors, so I am starting to think that I was dealt a fairly stinky deck of genes.  Therefore, I want to aggressively treat any cancer that might be lurking and will not base my decision on an oncotype score.   With that being said, the amazing thing is that everyone is different and I am thankful that we actually have choices now.  Whereas 20 years ago...there were very limited options.  I encourage everyone to go with what their heart/mind is telling them.  We are the only ones who definitely know our bodies inside and out, so please trust yourself.  Do the research, get the feedback, but at the end of the day, you need to feel comfortable with your choice. Please let us know what your decision was. Hugs Akitagirl",
      "MessageIndex": 18,
      "PostDate": "30/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/818536",
      "Title": "Anybody have stage 2B IDC Cancer with very low oncotype score? annabananas AKJ"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Jan 7, 2015 08:11AM Akitagirl wrote: sunsetata - I am also on a blood thinner of a different kind. It's called Eloquis and is a Factor Xa inhibitor. Much easier to take than coumadin and more effective. You don't have to get your INR labs checked...ever. I, however, chose NOT to bridge myself for my ALND and ended up having a TIA. Lesson learned. Make sure you bridge correctly with Lovenox! Warm Regards, Robyn P.S. Since you have to be on a blood thinner forever, you might want to ask your doc about the newer Factor Xa inhibitors. I lead the project management team for another company's product and know that there are now three out on the market. Eloquis is the best as far as study quality and statistical strength vs outcomes. If you watch television, you should see commercials for it. ;-) ",
      "MessageIndex": 7,
      "PostDate": "07/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827410",
      "Title": "On Coumadin sunseta1969 sunseta1969"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Mar 18, 2015 08:14AM Akitagirl wrote: Hi AndreaC, I am thinking and praying for you...next week will be very stressful I am sure! I also wanted to see if you have had any genetic testing. Although I am BRCA1/2 negative, I do have the PTEN mutation. Not as much is known about this, as BRCA is \"Cinderella\" and PTEN is just the \"attendant\"...but it is called Cowden's Syndrome. We have a much higher risk for the following: glioblastoma, melanoma, breast, kidney, endometrial and colon cancer. I have now had both breast cancer and melanoma-in-situ along with two epidermoid brain tumors. I always wondered why I was having such weird events at such a young age, as my first craniotomy was at the age of 24 and I was 42 last September...now it makes sense. I do not want to scare you, but there is a NCCN screening protocol for people with Cowden's Syndome and it is also an autosomal dominant mutation. So, my daughter has a 50% chance of having this as well. When she turns 18, we will have her tested...praying for her to have all my husband's genes. :-) I am a Certified Nurse Midwife - started my career as an ER nurse and for the past 13 years have been working from home doing pharmaceutical research and development. No more direct patient care, but certainly making a difference in many lives bringing drugs to market. I love working from home and I really love not having to take call and catch babies at wee hours of the morning! What was I thinking? Akitagirl ",
      "MessageIndex": 822,
      "PostDate": "18/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Nov 15, 2014 10:24AM Akitagirl wrote: Hi Mommy2Six, I was dx'd with a 1.7cm, grade 1, IDC just sub-areolar upon initial ultrasound and FNB. The ultrasound and physical exam did not show any suspicious lymph nodes, and hence I was clinically diagnosed as Stage 1 IDC. I then requested a MRI to help determine whether we could conduct a nipple-sparing mastectomy. That MRI showed the same lesion in addition to a new lesion that was just anterior (above) the original tumor, measuring 0.3mm and with a suspicious linear expansion directly into the nipple. The MRI still did not show any suspicious lymphatic invasion, so I still remained Stage 1. Thus, prior to surgery I agreed to have the nipple cored IF the surgeon could not find a clean margin. Post-operatively I was was not surprised to see that she did have to remove the nipple, but the areola is intact. Upon final pathology, the grade of the breast tumor changed to grade 2, with very concerning combination of cell types, the size remained the same, however they also confirmed lymphovascular invasion. Finally, the biggest surprise was that my sentinel node was filled with a 1.3cm tumor. However, the other 3 pulled during surgery were negative. I then consented to a SLND - she pulled 6 more and they were all negative as well. Praise God! So, now I am Stage 2a and preparing for chemotherapy beginning the week after Thanksgiving. However, because they only found 1 positive lymph node (1-3 is the 'grey area'), I do not have to do any radiation at this time. This is one story of a change, but there are many, many more that either stay the same or are even downgraded upon final pathology. Fight the good fight! Akitagirl",
      "MessageIndex": 1,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826287",
      "Title": "Poll on Final Pathology Report Mommy2Six ThinkingPositive"
    },
    {
      "AuthorID": "Akitagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205563/profile",
      "Content": "Nov 12, 2014 09:35AM Akitagirl wrote: Sunny8 - As a pharmaceutical scientist who has dedicated 13 years to discovering both treatment and causes for diseases ranging from the rarest of the rare to the most common illnesses, I want to encourage you that we ARE looking at the big question of WHY. Since we mapped the human genome in the late 90's, we have embarked upon a very exciting journey of individualized analysis, care and treatment. For example, we have a lot of knowledge now about the BRCA1/BRCA2 gene and the effects that mutations of such have on bodies. We also found the P53 and the PTEN mutation (which I have) and are still discovering what happens when these genes become mutated. We are also asking the question of WHY genes get mutated and how far up the chain of reaction can we move to prevent these mutations from ever occurring. The other point that we all agree upon, is that our bodies do interact on several different levels with our environment. There is a lot of research going on to try and determine why one family member escapes the morbidities that all of the other family members have, whilst they still have the same genome pattern. For example, my paternal great-grandfather, grandfather, grandmother, uncle, father, both cousins and brother all suffer(d) from alcoholism and mental illness. Both of my cousins are dead from alcohol/drug abuse and lifestyle choices, my brother has schizophrenia, has abused all sorts of chemicals and lives in a halfway house. Yet, for some reason, I have none of these psych issues and live a very healthy and blessed life. Now, as a Christian, this is where my faith comes in and I realize that we are not all dealing with just atoms and cells, but with human spirit and our ability for freedom of choice. That is a whole separate conversation...but a fascinating twist on how and why things happen on this planet. Bottom line - it's good to ask the questions. I personally believe that it is not healthy to ask \"what did I do wrong\", but instead, ask yourself \"how should I now respond\". How can I make a difference in not just my own life, but in others lives as well. We can leave a legacy of positive improvement, of showing grace and strength, of making a difference for our future generations. That gives me a sense of purpose and actually, in a very strange way, it gives me joy to know that we CAN make a difference. For me personally, my dream is to meet my Father in heaven and have Him say to me, \"well done, my good and faithful servant. Well done\". Regardless of your beliefs - know that you can make a difference, we can pay it forward and we can get through this together as a sisterhood of strength. I will be thinking of you and hoping for the best! With my true appreciation and understanding, Akitagirl",
      "MessageIndex": 36,
      "PostDate": "12/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    }
  ]
}