{
  "AuthorID": "AlaskaAngel…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
  "Posts": [
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Mar 1, 2012 03:23PM - edited Mar 1, 2012 03:25PM by AlaskaAngel Thanks dancetrancer, for that explanation. I do think it is unprofessional that my surgeon knew 9 years ago what it was, but the rads doc didn't. It contributes to my lack of confidence in crisis specialists, because they tend to only deal with the patient situation at the time of treatment, which is why so often they are in denial about anything and everything else at the time they sit on the tumor board to make such limited recommendations in the blind. I still don't have a clear understanding of how rads works in terms of why the rads necrosis so gradually spreads (and probably will continue to spread for me). Or why it only affected the lower half, unless the lower half had a different circulation than the upper half. Another experience that was interesting to me was when, as part of my personal preference for increasing my vitamin D, I spent as much time without much clothing on in whatever Alaskan sunshine I could get right from the time of diagnosis, including sunlight on bare breasts. One day I looked down at the lumpectomy breast and was amazed to see a distinct pattern on the breast of red spots in scattered shapes in a circular pattern. I realized (from having seen numeruos patient mammograms over time) that what I was seeing was the surgical clips. The red skin spots faded pretty quickly. The next time I saw my surgeon and we went over my mammogram, I saw the identical pattern of clips. So I told him what I'd seen. He didn't accept it, but I have no doubt about what it was myself. A.A.",
      "MessageIndex": 34,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Mar 1, 2012 12:36PM - edited Mar 1, 2012 12:39PM by AlaskaAngel Thanks, Spinnerpom. That is exceptionally well-written and empathic! I've been curious about a problem from my rads experience, with a question that wasn't discussed in the article and that is probably not all that common. I had IMRT rads to the left lumpectomy breast in 2002 with boost. Eventually the lower 1/6 of the breast turned hard and painful to touch, even though there is nothing to \"see\" that is different (because unlike what we consider \"burns\", rads works differently and exposes the tissue under the skin to treatment). Over time the area that was painful and hard spread upward as well. It is called \"radiation necrosis\" (basically, as gross as this sounds, melted fat, leaving hard tissue behind). My understanding is/was that the action of the rads exposure is not static and that it continued to \"expose\" over time, but that idea conflicts with what was said in the OP above. I'm not really sure. All I know is that the hardened painful portion of the breast went from being just the very bottom half over the years to being the entire bottom half over the years. It makes it difficult to tell whether or not there is any recurrence, in comparison to whatever is hardening the lower breast and making it so painful to the touch. A year after I completed treatment I spent the money to travel back in the Lower 48 to the radiology center where I had been treated, to be seen by the radiologist who had prescribed my treatment originally. It just happens that person was also the chief of the brand new rads center at the time I had been treated. The radiologist told me it was unknown what the hardened area was, and preferred to recommend an MRI. The rads doc admitted to being less familiar with reading ultrasounds personally, which was fine by me. But my breast surgeon was located 2 states distant in Seattle. So by my request, the rads doc ordered the MRI to be done in Seattle for my surgeon to review. I traveled to Seattle. My surgeon told me that he suspected it was \"radiation necrosis\". The MRI was done, and an accumulation of fluid indicated he was correct. The accumulated fluid was fatty fluid (oil). The MRI results were provided to my rads doc. I do not know why it happened, nor do I understand at all why my rads doc didn't mention what it might be. I have no solution for it. My surgeon drained the accumulated fluid. It is still painful. As a final note, I did and do think my rads doc was a caring person with good intentions. I remain puzzled by it all, however. AlaskaAngel",
      "MessageIndex": 29,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Mar 5, 2012 09:51AM - edited Mar 5, 2012 09:56AM by AlaskaAngel Terrific discussion here, very interesting and mutually supportive!  I want to continue the focus on those who are struggling with the decision-making. Yet I also think that cancer centers are only slowly starting to spend any resources on those who are fortunate enough to last after going through it, but have issues due to the treatment. Thanks,Outfield, for additional insight into my question. I want you to know I didn't miss your response. I just want to provide some perspective to those who are wondering what happens as more time goes by..... the stuff that rads docs don't talk about, and don't seem to know. I agree that it takes lots of time to heal.... \"healing from what is a massive radiation injury can take quite a long time too.  There are all sorts of structural changes as a result of those reactive chemicals, and recovery from those can go on for 12-18 months.  Sometimes in that process of healing, things end up seeming worse than at the time of the injury.  Tissues stiffen.  Inflammatory cells turn dead material into liquid.\" .... BUT.... I am ten years out now and the spread of the hardening of the breast and painful area is continuing. In my own situation it has resulted in tightening that is pulling on the arm and shoulder, and even though I only had one benign sentinel node removed at surgery, and I did PT to keep frozen shoulder from being complete, my left arm clear down to the hand is having problems. I honestly don't know if this is common. But I also think long-term survivors do have issues from rads that are ongoing. So.... I'm reluctant to assure anyone that they aren't common, either.  Because of the damage, In the past year I finally have had to give up my only source of income that is based on being able to use that arm. I went from being full-time to part-time to get by with it, and now can't continue. I think in this discussion there still is not a clear answer as to just what rads does or how it works, because I would have expected it to heal at some point and stop advancing, and not continue to have more effects. I don't hear the answer to that in our discussion. P.S. A side note - I had Adriamycin and Cytoxan with 5-FU at age 51 and have a fairly good EF (I do take CoQ10), and my bc was left-sided, for those with heart concern questions to consider. A.A.",
      "MessageIndex": 59,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Mar 21, 2011 05:53PM - edited Mar 21, 2011 05:53PM by AlaskaAngel I haven't had a recurrence since being treated 10 years ago but do not consider myself cancer-free. Cancer cells are just cells that are abnormal and all humans have some of them at any given time. The immune system either works to keep them from taking over, or not. Some of us have more cancer cells than others do, mostly because our immune system doesn't manage to keep up with getting rid of the cancer cells fast enough. That is why things like proper exercise, proper diet, not smoking, etc. help to avoid recurrence. AlaskaAngel",
      "MessageIndex": 3,
      "PostDate": "21/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/766414",
      "Title": "Am I cancer free? Thatgirl Thatgirl"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "AlaskaAngel wrote: Hi. I'm trying to connect bc patients and advice for vaccination for this year, so if this post starts sliding too far down the board, please occasionally post to it to bring it back up. Thanks. Here is the info from U of Penn's Oncolink (you have to read the blog and the comments to get the info on the pneumonia vaccination): http://www.oncolink.org/blogs/index.php/2009/09/h1n1-seasonal-flu-vaccines/#comments Dx 12/3/2001, DCIS/IDC, Left, 1cm, Stage IA, Grade 3, 0/1 nodes, ER+/PR+, HER2+ (IHC) Surgery 1/3/2002 Lumpectomy: Left; Lymph node removal: Left, Sentinel Chemotherapy 3/12/2002 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Fluorouracil (5-fluorouracil, 5-FU, Adrucil) Radiation Therapy 9/10/2002 Breast Hormonal Therapy 11/15/2002 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741239",
      "Title": "Cancer patients and vaccinations, 2009 AlaskaAngel AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "AlaskaAngel wrote: http://www.nytimes.com/2012/02/01/health/repeat-breast-cancer-surgery-guidelines-found-unclear.html Dx 12/3/2001, DCIS/IDC, Left, 1cm, Stage IA, Grade 3, 0/1 nodes, ER+/PR+, HER2+ (IHC) Surgery 1/3/2002 Lumpectomy: Left; Lymph node removal: Left, Sentinel Chemotherapy 3/12/2002 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Fluorouracil (5-fluorouracil, 5-FU, Adrucil) Radiation Therapy 9/10/2002 Breast Hormonal Therapy 11/15/2002 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782011",
      "Title": "Margins, and repeat surgeries AlaskaAngel AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 5, 2008 11:50AM - edited Dec 5, 2008 11:52AM by AlaskaAngel Hello. I am 6 years out from chemo. In general, more breast cancer patients gain weight than lose weight with treatment. If there were health care providers among the oncs and PCPs and nurses and technicians that are employed in providing treatments, maybe then patients would be given a better description of what goes on physiologically and psychologically and how to best deal with it. But I think you will find, as I did, that there are almost no health care providers among those you encounter who have actually had breast cancer AND been treated with chemotherapy and rads. Remarkable, but true. As you go through it, ask each provider and see for yourself. So here is one single breast cancer survivors perspective for you to consider. Chemopause and chemotherapy with steroids means in general undergoing the following changes: 1. The hormones that support tissue maintenance like estrogen, progesterone, and testosterone will be less from now on. Steroids can cause additional muscle breakdown, and increased appetite. The muscle breakdown results in actual muscle weakness, which makes it harder to effectively exercise, which means the same amount of exercise you did in the past is going to be harder to accomplish. Once a person gains a good chunk of weight, they are also clumsier. They are more susceptible to injury. For example, after treatment when I increased my exercise to what would have been customary for me before treatment, my knees swelled up to the point that I had to stop entirely to let them heal. No one from the \"treatment team\" is there to tell you any of these things or help you work through them. All the cheerleading to get you through treatment is over when you have had your last toxic therapy, and you are on your own. Increased weight gain puts women at higher risk for recurrence, so that leaves you in charge of cheerleading. Health care providers do not yet acknowledge to themselves or to patients that by causing weight gain during treatment, they are also at the same time predisposing patients to a greater likelihood of recurrence. Your permanently lower testosterone levels also reduce the ability to rebuild muscle tissue. At the same time that your muscles are not working as well as they used to be, your metabolism has slowed down permanently. This means that after treatment if you have gained weight or even stayed the same weight, you will have to get used to eating about 200 to 400 calories less per day that you have been eating for years. Also, the weight that is gained now tends to accumulate at the lower abdomen. Like the person who posted earlier who did FEC, I had CAF x 6 and gained over 20 pounds. Over the last 6 years I have managed to lose about 3 1/2 pounds per year. This is nothing to laugh at, because all of the above physiological changes due to hormonal changes and the use of steroids makes it much harder to make any progress. However, even though not a single health care provider I've had in the last 6 years has ever raised the issue of the importance of not being overweight as a way of avoiding recurrence, I know enough on my own that I continue to work at it. I saw a naturopath at the cancer center and my insurance paid for it, but he also did not deal with weight gain at all. I saw a nutritionist at the cancer center. My insurance didn't pay for any part of that visit. (That in itself says a lot about how much the medical world still needs to learn about prevention and cancer and treatment and rehabilitation.) But the nutritionist was very tuned in and extremely helpful. It was a really difficult visit for both of us, because it is hard to acknowledge that dieting and exercising work differently now for me and it IS much harder for me now than it was prior to treatment. I am now back to being barely within what is normal BMI for my height. (You can check yours by googling \"BMI\", and a calculator will come up for you to enter your height and current weight, so you can compare it to what is normal.) Try not to gain the weight in the first place. But whether you do or not, hopefully you might understand the reasons why things are different for those who truly become completely menopausal hormonally through chemopause in order to prevent recurrence. Best wishes, AlaskaAngel",
      "MessageIndex": 6,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725484",
      "Title": "weight gain during chemo??? rayhope theprettiestmess"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Sep 25, 2013 05:01AM AlaskaAngel wrote: P.S. Possibly you could go straight from screening mammo and/or perhaps ultrasound to having a biopsy, to save the cost of the diagnostic mammo... if the mammo and ultrasound provided enough info. A.A.",
      "MessageIndex": 13,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Oct 21, 2013 10:28AM AlaskaAngel wrote: Cancer does the weirdest things to what seems logical. For example, people overwhelmingly tend to lean toward believing that the most godawful treatments must be better than the less awful ones, and that the worse they are, the more tough they must be on cancer. At the same time, only about 20% of early stage bc patients benefit from chemotherapy. In part that is because the majority diagnosed are hormone receptor positive, and they don't benefit as much from chemotherapy as hormone receptor negative patients do. But by golly, it is hard to get panicked hormone receptor positive patients to grasp that truth. When it comes to imaging, people also tend overwhelmingly to believe that the more expensive imaging must be \"better\" than the less expensive imaging. Not so. It is just one additional trick in the bag of tricks the radiologist has. It has its limitations just like mammograms and ultrasounds do. But that is why they start with the least expensive types of exam and then work up from there. And that is also why we don't just have MRI's for everyone, without mammos or ultrasounds. Each type provides different kinds of information. In your case I personally don't support a 6-month wait-and-see. At a minimum I would want repeat imaging of some kind and another physical exam at least 3 months sooner, and even though it seems to be unheard of commonly and is unsupported by the medical profession, I would want my physician to start having markers done, to establish a baseline if possible. (It isn't always possible, but to me it still is worth a try rather than going blind for 6 months. Jeez.)",
      "MessageIndex": 48,
      "PostDate": "21/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Sep 25, 2013 04:53AM AlaskaAngel wrote: Yes, thanks Pat, good idea, hope it works! It is more of a hassle and cost in AK than it is in most places (which are usually closer to more price competition and more expertise), and usually too expensive to travel out of state for it, especially on short notice. Hope all turns out well. Let us know how things go... A.A.",
      "MessageIndex": 12,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Sep 27, 2013 07:19AM - edited Sep 27, 2013 07:19AM by AlaskaAngel I'm glad you have been persistent in seeking to get it fully evaluated, and have been successful in getting into the program. There are around 200 forms of breast cancer and so it is not really possible to take chances on which one or how fast growing they are, so not following up even though it is a hassle is truly not a good idea. So many women do not realize that. A.A.",
      "MessageIndex": 22,
      "PostDate": "27/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Sep 28, 2013 01:38PM AlaskaAngel wrote: alaskanabbott, it makes a huge difference when the person asking the questions is so clearly willing to move forward on her own with people's help. Whatever your situation turns out to be, you will do much better just because of that. Your neighbor down the road in Alaska",
      "MessageIndex": 29,
      "PostDate": "28/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 12, 2014 10:28AM AlaskaAngel wrote: No leahs, it is more like suddenly being kicked in the shin, just pain, not burning. Neuropathy happens with the taxanes but my treatment didn't include a taxane. Thanks for the suggestion, though! I'm just so puzzled by it. In the first year after tx I had asked my onc about it and he offered no explanation for it of any kind, but said that the distal extremities usually aren't where recurrences are often found initially.",
      "MessageIndex": 4,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/821850",
      "Title": "Shin sensitivity AlaskaAngel clarrn"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 12, 2014 03:44PM AlaskaAngel wrote: heartandsoul, it never did feel that way for me, but then I only took the tamoxifen for 1 year at full dose, and took it at half dose for the remaining 3/4 year that I continued it. What comes to mind about different aspects of density in regard to tamoxifen is the studies done at the Karolinska Institute, done to find out if more rapidly diminishing breast density is a reliable indicator for shorter-term use of tamoxifen, or not. Diminishing density of the breast would reduce the \"support\" tissues in the breast, making the breasts more fatty (and clear) and less firm. But that doesn't mean that is at all related to bone density or to the shins.",
      "MessageIndex": 11,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/821850",
      "Title": "Shin sensitivity AlaskaAngel clarrn"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 13, 2014 04:13PM AlaskaAngel wrote: Me too - Right now it is just one more of the SE's that \"usually don't last after finishing chemo (ha ha ha)\" If anything comes of mine, I'll share the info too. A.A.",
      "MessageIndex": 13,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/821850",
      "Title": "Shin sensitivity AlaskaAngel clarrn"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Sep 23, 2013 05:06AM - edited Sep 23, 2013 05:08AM by AlaskaAngel Hi A, Dense breasts, fibrous breasts -- think of it as being the structure that most of the breast tissue is supported by. The problem is that in mammograms, the structure shows on the image as being white, and cancer does too. The more structure there is that is supporting the breast, the harder it is to see any cancer, since they are both the same color. This is where usually in addition an ultrasound would be done. An ultrasound detects things like liquid-filled versus solid (and cancers are solid). They should be at the very least doing both another mammogram AND an ultrasound. The inverted or retracted nipple is of concern because as cancers grow, they displace other tissue and sometimes that means the distortion includes the nipple area. If your mammo AND ultrasound are still suspicious, likely you will need to have a biopsy and there are several types: FNA (fine needle aspiration, which is a tinier needle but can miss some cancer tissue because it is finer), core needle (which is a thicker needle), and other types that take more tissue. I would want to see a breast surgeon if possible if I were you. If you are very rural in Alaska that may be why you are being sent to the closest surgeon, a general surgeon, rather than a breast surgeon. If you want, you can send me a personal message through this site with any questions. P.S. Forgot to insert this answer to one of your questions: Diagnostic vs screening mammograms: AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Sep 23, 2013 05:13AM AlaskaAngel wrote: This is a better explanation of screening vs diagnostic mammos. Just click on the link: http://www.cancer.gov/cancertopics/factsheet/detection/mammograms ",
      "MessageIndex": 2,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Sep 23, 2013 07:31AM AlaskaAngel wrote: With the larger hospital in Anchorage there would likely be practitioners with more breast cancer patients/more experience.  I'm not necessarily saying that someone who adds \"breast cancer\" to the title \"surgeon\" is terrific (mine in Alaska was definitely poor quality and delayed my diagnosis). But you want someone who has done a LOT of breast surgeries and breast care for the best outcome. I had Premara BC/BS and had my surgery in Seattle because my surgeon was so bad here, and it won't hurt for you to inquire. I'm glad your exams came back negative. But because it is hard to catch cancers early in patients with dense breasts, especially with prior questionable lumps or nipple problems, be quick to have repeat exams, even though they are a hassle I know.",
      "MessageIndex": 4,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Sep 27, 2013 01:10PM AlaskaAngel wrote: It isn't that at all, Pat. It is because there is so much involved with breast cancer that they just try to generalize as best then can to be able to describe it at all.",
      "MessageIndex": 24,
      "PostDate": "27/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Oct 8, 2013 08:16AM - edited Oct 8, 2013 08:17AM by AlaskaAngel",
      "MessageIndex": 33,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Oct 15, 2013 04:53PM AlaskaAngel wrote:",
      "MessageIndex": 39,
      "PostDate": "15/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Sep 24, 2013 05:00PM AlaskaAngel wrote: Hi A, I'm just wondering under what conditions your insurance would be willing to pay for a diagnostic mammo, and for a referral from your OB-GYN for a visit with a surgeon?  The only definite way to ID cancer is with a biopsy, and the screening mammo isn't intended to ID cancer, it is just done to check for suspicious signs like calcifications, and sometimes even those aren't there when cancer still is.  It isn't possible to know for sure initially with just a screening mammogram and they know that, so what is the purpose of the screening mammogram if not for a qualified doctor to use it to determine when to move on to a diagnostic one? Once added risk (family history) and a recognized lump and inverted nipple are added to that.... what more do they say they would need in order to pay to have it checked out? Puzzled, AlaskaAngel",
      "MessageIndex": 9,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Oct 8, 2013 03:30AM AlaskaAngel wrote:",
      "MessageIndex": 30,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Oct 16, 2013 02:16PM AlaskaAngel wrote: Hi - The preliminary report sounds fine, which is encouraging, and if the final report doesn't show anything more, then by MRI you are cleared for the present. These testing tools are not perfect. Be aware that some breast cancer, even large breast cancers, can be missed by mammogram, ultrasound, and MRI. Those are the tools commonly used and the combination generally is reliable. But it can happen. Sometimes cancers can show up later as well, such as within months, that weren't seen when the studies were done. However, unless they see enough to concern them or there are concerning signs or symptoms, no further studies will usually be recommended. I don't want to be a wet blanket. I just want to be honest about it. I too would be feeling generally relieved based on your preliminary report, and I hope it comes out benign.",
      "MessageIndex": 43,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811453",
      "Title": "Fibrous breasts, lump, inverted nipple, confused not worried alaskanabbott AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 12, 2014 09:24AM AlaskaAngel wrote: Hi bluepearl, My bone density came back as off-the-chart excellent despite never taking any AI. The shins aren't painful except when something touches them, so it isn't a major problem for me. I am just curious to know if anyone else came out of treatment with the same result. My chemo isn't one that is very common anymore (CAF), either. Thanks though for the possible suggestion. A.A.",
      "MessageIndex": 2,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/821850",
      "Title": "Shin sensitivity AlaskaAngel clarrn"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jan 18, 2012 09:14AM AlaskaAngel wrote: Emerald097, Doctors use the mammogram to see whether there are calcifications (very tiny stony bits made up of calcum) in the breasts. If the calcifications are shaped in a certain way, and if there are many of them concentrated in an area, that indicates that a cancer is \"more likely\".  They then do an ultrasound as well. An ultrasound tells whether the breast tissue has a solid lump or a fluid lump in that area, and whether or not the tissues around the lump have become pulled out of their usual shape by it. Sometimes they find additional areas to look at that maybe didn't have a lot of calcifications but still don't look normal on the ultrasound. A solid lump is more likely to be a cancer. A fluid lump is more likely to be a fibroadenoma and not cancerous. But they cannot tell for certain. That is why, if they think it might be, it also has to be biopsied by taking a piece of that lump out either by needle or by cutting it out, to put it under a microscope to see what the cells actually look like. AlaskaAngel",
      "MessageIndex": 3,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781217",
      "Title": "Can doctors really see cancer on mammograms and ultrasound? Emerald097 dogeyed"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jan 18, 2012 12:38PM AlaskaAngel wrote: Emerald097, As Marie 5890 said, you won't know until you know. FYI - The average core biopsy leaves the breast feeling somewhat sore and bruised but usually only for a few days, in terms of dealing with the weight and movement of the baby afterward. Hope that helps.  Be sure you are clear about just how you are supposed to find out the results before you leave the rads department so that you know what to expect about that, and when to start pestering for answers if there is any delay. Best to you, A.A.",
      "MessageIndex": 9,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781217",
      "Title": "Can doctors really see cancer on mammograms and ultrasound? Emerald097 dogeyed"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 12, 2014 02:52PM AlaskaAngel wrote: I'm not delighted to hear that you two have it also, but at least we do have a comparison here to go by! The only commonality among all 3 of us that I see would be the Cytoxan. (Every successive treatment I had was delayed by one week because my counts were slow to recover, and I refused any blood booster such as Neulasta, so there is no commonality for that as being a cause for the shin pain.) Of the support drugs for chemo I had some steroids with treatment. The only antinausea medication I had was ondansetron (Zofran), and Compazine. I too had no such problem prior to treatment, and was 52 at time of treatment.",
      "MessageIndex": 8,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/821850",
      "Title": "Shin sensitivity AlaskaAngel clarrn"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "AlaskaAngel wrote: I'm a long way out from doing chemotherapy. But ever since completing it, my shins have been extremely sensitive to touch. It is painful to just rest one leg on top of the other shin. I had chemo that is less common now (CAFx6). Does anyone else have the same experience? My labs all come out just fine, and I've been NED since doing chemo in 2002. A.A. Dx 12/3/2001, DCIS/IDC, Left, 1cm, Stage IA, Grade 3, 0/1 nodes, ER+/PR+, HER2+ (IHC) Surgery 1/3/2002 Lumpectomy: Left; Lymph node removal: Left, Sentinel Chemotherapy 3/12/2002 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Fluorouracil (5-fluorouracil, 5-FU, Adrucil) Radiation Therapy 9/10/2002 Breast Hormonal Therapy 11/15/2002 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/821850",
      "Title": "Shin sensitivity AlaskaAngel clarrn"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 12, 2014 03:01PM AlaskaAngel wrote: bluepearl, I just tolerate it and try to never do anything that would put pressure on the shins. A nagging underlying concern would be if it is some kind of indicator for later leukemias, since I did have Adriamycin. I am 12 years out from treatment, and so far I'm NED and healthy.",
      "MessageIndex": 9,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/821850",
      "Title": "Shin sensitivity AlaskaAngel clarrn"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jan 18, 2012 11:01AM AlaskaAngel wrote: What kind of a biopsy will it be? (There are fine needle biopsies, core needle biopsies, stereotactic biopsies, and biopsies that remove the entire cancerous lump for analysis.)  Do you recall which type they will be doing? A.A.",
      "MessageIndex": 5,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781217",
      "Title": "Can doctors really see cancer on mammograms and ultrasound? Emerald097 dogeyed"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jan 26, 2012 06:41PM AlaskaAngel wrote: Emerald..... The one type of biopsy that didn't occur to me when you asked was a biopsy of a node that was not in the breast..... I'm sorry. I didn't know you were going to have an axillary node biopsy. You definitely have my sympathy. I had a single axillary node biopsied BUT I had it as part of my lumpectomy and had plenty of anesthesia. I can think of no good reason for inadequate anesthesia for an elective procedure like that. Going in there moves tissues around and stretches different tissues and leaves them sore. I am so, so sorry. I am glad you have some help with the baby. I would have been screaming too. A.A.",
      "MessageIndex": 34,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781217",
      "Title": "Can doctors really see cancer on mammograms and ultrasound? Emerald097 dogeyed"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Apr 5, 2011 03:41PM - edited Apr 5, 2011 03:44PM by AlaskaAngel Mainly I wish that someone would have explained the actual effect of chemo in terms of prevention. I did not know at all that chemo is just generally effective for roughly 5 or so years. It would have helped me to do better planning based on my diagnosis to be told that honestly up front. I also wish someone would have been honest about the real impact on sexuality for women. AlaskaAngel",
      "MessageIndex": 10,
      "PostDate": "05/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/767104",
      "Title": "In retrospect, what do you wish you knew before starting chemo? jamiebeth jamiebeth"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jan 20, 2012 09:41AM AlaskaAngel wrote: Emerald, Some people just have to be \"right\" even when they are not, and get away with it most of the time. But they sure are high-maintenance people to have around while they do. I hope you can figure out ways to get by while you heal, and that your biopsy will be as easy on you as possible. This may be one instance where just a call to the local cancer society might or might not be helpful but is worth a try. They may be able to hook you up with a cancer survivor who could help out. I have listened to many free presentations by a group called cancercare.org and you can look online to see what they also might be able to offer or connect you with: http://www.cancercare.org/ Let us know how things turn out. AlaskaAngel",
      "MessageIndex": 22,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781217",
      "Title": "Can doctors really see cancer on mammograms and ultrasound? Emerald097 dogeyed"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jan 26, 2012 03:45PM AlaskaAngel wrote: Emerald097, By now the biopsy has been done, and hopefully getting past it helps. Hope the family is less annoying for you while you are dealing with it all. Hugs, A.A.",
      "MessageIndex": 29,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781217",
      "Title": "Can doctors really see cancer on mammograms and ultrasound? Emerald097 dogeyed"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 10, 2011 01:49PM - edited Dec 10, 2011 01:50PM by AlaskaAngel phgraham, I have direct experience with the problems that occur with this drug, and because of that I will be honest about it and say that no one should casually dismiss the possibility of serious side effects from it. It is a very important drug that is used in situations where it is felt that the first-line antibiotics would not work as well, so I'm not saying it isn't helpful and important for some. What I am saying is that there are a significant number of people who have serious reactions to it as well. Because of a citizens outcry about these cases going unacknowledged by the medical profession, eventually the FDA was convinced it was important enough to add the black box to the written insert provided with the drug. The symptoms are often not recognized until the damage is severe. The effects for some patients and their cases are real: http://lawprofessors.typepad.com/mass_tort_litigation/2011/10/levaquin-bellwether-trials-update.html AlaskaAngel",
      "MessageIndex": 16,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778716",
      "Title": "Levaquin (levofloxacin) TAPPY TAPPY"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "May 4, 2013 02:53PM - edited May 4, 2013 03:18PM by AlaskaAngel VR, thanks for the suggestion for the MC thread... While I'm here...  I am happy to see more studies that are focused on ways to analyze who recurs and who does not, with the goal of better knowledge about who can avoid some treatments and who cannot. A trial that I think would fit the area you are interested in for genetic analysis is the NCT00897299. Identifying Genes That Predict Recurrence in Women with Breast Cancer Treated with Chemotherapy.... which seems to be a study of the kind I was talking about.... and yet.... it isn't, quite. Here's the actual language and focus: \" \"RATIONALE: Studying samples of tumor tissue from patients with cancer in the laboratory may help doctors learn more about changes that occur in DNA and identify biomarkers related to cancer. It may also help doctors predict whether cancer will come back after treatment. PURPOSE: This laboratory study is identifying genes that may help predict recurrence in women with breast cancer treated with chemotherapy.\"   and   \"OBJECTIVES: So.... I know it sounds like the result would, by coincidence, provide the information I am asking for... but to me the result is less definitive of the result I am looking for. I am asking them to use patients like me who have proven characteristics for nonrecurrence over \"x\" number of years.... characteristics that had a definite outcome, not a speculated risk that assumably is not certain for any particular individual. I'm asking that they nail down what characteristics absolutely provide no recurrence for \"x\" number of years through actual people who have actually not recurred. My question is a different question, one that would at least let some people definitely benefit. A.A.",
      "MessageIndex": 90,
      "PostDate": "04/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "May 6, 2013 09:13AM AlaskaAngel wrote: Delighted you posted, Ingrid! Don't go away -- the time difference brings some delay in response. I think the most accurate and up-to-date response might come from VR. So I will just say hello to encourage you to keep checking here. I was diagnosed so long ago that I am not as current about the question. I was diagnosed so long ago that it wasn't even standard to test for HER2 positivity, and the only hormonal post-chemo treatment available to me was tamoxifen. (I'm not entirely sure all of those differences truly represent a lot more progress, or whether it simply offers one/inflicts one with more choices that make people feel like they have more control over this disease!) A.A.",
      "MessageIndex": 95,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "May 6, 2013 09:54AM - edited May 6, 2013 09:58AM by AlaskaAngel Violet, grammie, smo and mepic... My thought upon reading your posts was simplistic in a way, but I am of the belief that not all answers have to be complicated even in a scientific environment. Sometimes a simple observation is intelligent. A recent study indicated that breast density is especially relevant in regard to whether or not a patient is benefitting from the use of tamoxifen. I can say that observation of breast density was true in my case. So keep this concept in mind, even in considering whether or not you personally would benefit from tamoxifen. My breast density after completion of CAFx6 and IMRT rads of 7 weeks was still very dense. After just 3 months of tamoxifen, my mammos were very clear and not at all dense, and they have remained that way ever since, despite my dropping off tamoxifen after only 1 year at full dose and 3/4 year at half-dose. At the time I noted the difference but no one else saw what it meant. I cannot prove it but I think I was one of those patients for whom tamoxifen works extremely well right off the bat. (My tumor was 95% ER+, but the recent study didn't mention whether or not they were smart enough to analyze the degree of ER positivity as part of that trial about breast density with tamoxifen.) What I wonder too is whether those who benefit right away like I did, stand to have adverse effects if they continue it TOO long.... but at any rate... Since some of you are going to be seeing experts soon about it, maybe you might ask them specifically about the recent study and whether or not they have gotten up some willingness to USE breast density as a way of measuring whether or not to initiate tamoxifen, and whether or not there is willingness to USE the degree of breast density to MONITOR as you go along on the drug, to see whether you can drop off of it sooner. Perhaps you could share their responses with us to keep us current. Just my 10 cents. A.A.",
      "MessageIndex": 99,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 28, 2011 02:43AM - edited Dec 28, 2011 02:44AM by AlaskaAngel Kaara, That is why I suggested to the Mods that it might be really helpful to include either age or menopausal status as a characteristic specifically listed as part of the signature, but they suggested instead that people put that info in separately. It is well known that the vast majority of breast cancer patients are diagnosed after age 60.  It may be that there just isn't the capability to add another category of information in the signature. I do think, however, that the lack of that information as a rule is actually very problematic in that because most people who post do not indicate their age and/or menpausal status, the vast majority of breast cancer patients (those over age 60) aren't able to distinguish meaningful information about treatment for their situation and end up confused about it, and generally overtreated as a result. The older and more menopausal one is, the less likely there will be recurrence and the more likely one will suffer SE's, and to a greater degree. Since they ARE the majority of breast cancer patients, that personal info is especially important. A.A.",
      "MessageIndex": 14,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/774491",
      "Title": "For those age 60 or older, early stage bc, considering treatment AlaskaAngel Kaara"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "May 6, 2013 09:31AM - edited May 6, 2013 09:33AM by AlaskaAngel joyH1109 Don't mind at all. It was not the best medical practice unfortunately...! I found out about my HER2 positive status somewhere around 1-2 years AFTER dx, and it was ONLY because I questioned it. The HER2 trials were coming to a close at the time I was diagnosed, so oncs were well aware that they were looking promising. The MO I had was considered top of the line....  and never once mentioned the possibility of trastuzumab or the trial, which I would have been eligible for at the time....and I had specificcally ASKED to participate in clinical trials... yeesh.... I'm just thankful that, as things turned out, I didn't need trastuzumab, and didn't end up costing myself and the world the extra cost for it.",
      "MessageIndex": 98,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "May 6, 2013 10:13AM AlaskaAngel wrote: For convenience: http://breast-cancer-research.com/content/14/4/R114  and http://health.usnews.com/health-news/news/articles/2013/04/22/mammograms-can-measure-how-breast-cancer-drug-is-working-study",
      "MessageIndex": 100,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 23, 2014 12:51PM - edited Jun 23, 2014 01:09PM by AlaskaAngel There seems to be some misconception that OncotypeDx was designed to predict whether use of chemotherapy is useful or not. It was designed to determine whether or not hormonal therapy is useful. As pointed out, OncotypeDx is based on the assumption that tamoxifen is being used.  ",
      "MessageIndex": 66,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 24, 2014 12:41PM - edited Jun 24, 2014 12:44PM by AlaskaAngel lekker,  Because there are so many complicated factors involved for all breast cancer patients who are trying to find their own choice of treatment, and because I have personally sat back for over a decade of hoping \"someday\" HER2 positive patients would have equal access to that kind of test, and because there is no clear distinction in the OP between the choices in testing available to \"all breast cancer patients\", pointing it out is meaningful to around 1/4 to 1/3 of \"all breast cancer patients\" who happen to be HER2 positive -- as well as to allow the remaining 3/4 to 2/3 of \"all breast cancer patients\" to understand that the existing research results do not allow HER2 positive sisters or brothers to have those choices. I don't think it is so terrible to provide that information to everyone and let the discussion move on.",
      "MessageIndex": 81,
      "PostDate": "24/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jul 21, 2014 07:48PM AlaskaAngel wrote: xbrnxgrl, thank you for the clarification about tumor boards as it applies to Stanford. I too hope it is the standard of practice in general and that patients are generally made aware that they are welcome to attend, although just how common that is among cancer patients is uncertain. Not all patients would necessarily want to be there, but being invited may help them to understand the process and to understand what specialty practitioners are involved at their particular institution. The tumor board composition remains the same as it has been for years. They have included other specialities in some circumstances, but as a rule they do not.",
      "MessageIndex": 134,
      "PostDate": "21/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jul 21, 2014 08:55PM AlaskaAngel wrote: Lee7, My perception is that the majority are not ever invited to attend, even just to listen and not ask questions. And as with most of cancer care -- what you don't \"know\", makes it more difficult to ask about. For some who have access to the top cancer care institutions, their own experience tends to make them believe that is how cancer care IS, and and they believe that is how it is \"done\" for all patients. It would be nice if everyone had that kind of access. But the reality is that plenty of cases are reviewed by local small tumor boards, even with no mention to the patient about the review of the case by any tumor board. I also don't think it is so shockingly terrible to be willing to question or comment adversely about the status quo, since that is often the basis for raising awareness of the variations in patient care, and for improvement of the status quo. Why should anyone be so afraid to talk about it?  ",
      "MessageIndex": 137,
      "PostDate": "21/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "May 6, 2013 09:24AM AlaskaAngel wrote: Violet 1 - I'd enjoy meeting you too in person if both of us can find a way. My DH, our scottie (3 senior citizens), and I will be ferrying and driving south most likely, so will be coming through CA (Canada), WA, OR and into N Cal, going as far south as Sacramento via I5, and likely will include travel east up US 50. First part of June. I have jury duty all this month to fulfill, or we'd be on our way already... PM is fine, to avoid taking up more of this thread. A.A.",
      "MessageIndex": 97,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 22, 2014 02:39PM AlaskaAngel wrote: The initial replies, which stuck to providing knowledgeable information in response to a request for that information, were beneficial. Those who are knowledgeable about the technical details involved with breast cancer are valuable resources.  Getting personal and implying a need for counseling based on what is very minimal contact in a forum might be reasonable by way of a private, personal message, which can be either accepted or ignored without any obligation, would be a far more adult way to express such personal claims. In public, they become a not-so-subtle form of attack. Hopefully, those who have valuable knowledge will avoid using that leverage to support some kind of \"right\" to publicly point that kind of insinuating finger at those who come here seeking information. AlaskaAngel",
      "MessageIndex": 50,
      "PostDate": "22/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 22, 2014 07:57PM - edited Jun 25, 2014 05:49PM by Moderators Thanks xbrnexgrl, for pointing that out, as the current posts were the first time I saw this thread and I didn't catch it.  I concur, \" Info on KI-67? Keep it coming for those who need it.\" ",
      "MessageIndex": 57,
      "PostDate": "22/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 23, 2014 02:29PM - edited Jun 25, 2014 09:07PM by Moderators Yep. In part, the generalizing about use of tests like OncotypeDx happens because between 2/3 and 3/4 of all bc patients are not HER2 positive.",
      "MessageIndex": 76,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 24, 2014 12:27PM - edited Jun 25, 2014 09:12PM by Moderators",
      "MessageIndex": 80,
      "PostDate": "24/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jul 21, 2014 01:35PM - edited Jul 21, 2014 01:35PM by AlaskaAngel My tumor was reviewed by a tumor board too, at a major cancer center. What has come to be the standardized process is to have a \"tumor board\" with a composition heavily favoring those whose job it is to do the cutting, radiating, and chemical treatments available to review the pathology, with the oncologist generally in charge of it. That isn't to say that they aren't focused on what they think is best for the patient, because they are. It is just to acknowledge that their expertise is cutting, radiating, and chemical use and they are much less educated in other types of medical knowledge. Knowledge about cancer is expanding in other areas of expertise, and maybe in a few decades there will be progress and  we might see other specializations finally having more authority in treatment recommendations than we've had thus far with the standardized make-up of tumor boards that has been static in place for so long. When the recommendations seem so limited and so harsh at times, that explains at least some of the mysterious reasons for it that aren't obvious when the entity is just called something so officially created and authorized as the words \"tumor board\". One tends to think that they are more well-rounded in their expertise than they really are. This was something I wasn't aware of at the time my tumor was reviewed 12 years ago, and its the same today as it was then.",
      "MessageIndex": 122,
      "PostDate": "21/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 10, 2011 03:46PM AlaskaAngel wrote: Thanks for your conscientiousness, Phyllis.  With this one, it is the very people who tend to push themselves to \"work through\" any symptoms they encounter with their health, and not be \"wussies\", who ended up with the worst damage. In my family situation I had questioned this particular drug's use with the physician involved even though I had no idea the FDA had changed the insert 2 or 3 years ago and added the black box, but the physicians at the hospital still failed to watch for it and didn't recognize the symptoms as being caused by the drug when they occurred. A.A.",
      "MessageIndex": 18,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778716",
      "Title": "Levaquin (levofloxacin) TAPPY TAPPY"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "AlaskaAngel wrote: http://jnci.oxfordjournals.org/content/early/2011/08/31/jnci.djr299.abstract  Dx 12/3/2001, DCIS/IDC, Left, 1cm, Stage IA, Grade 3, 0/1 nodes, ER+/PR+, HER2+ (IHC) Surgery 1/3/2002 Lumpectomy: Left; Lymph node removal: Left, Sentinel Chemotherapy 3/12/2002 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Fluorouracil (5-fluorouracil, 5-FU, Adrucil) Radiation Therapy 9/10/2002 Breast Hormonal Therapy 11/15/2002 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/774491",
      "Title": "For those age 60 or older, early stage bc, considering treatment AlaskaAngel Kaara"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Oct 1, 2011 01:30PM - edited Oct 1, 2011 01:31PM by AlaskaAngel Association between tamoxifen and diabetes for older women: http://onlinelibrary.wiley.com/doi/10.1002/cncr.26559/abstract  ",
      "MessageIndex": 9,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/774491",
      "Title": "For those age 60 or older, early stage bc, considering treatment AlaskaAngel Kaara"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "May 6, 2013 08:05PM AlaskaAngel wrote: Theoretically, what the denseness means is that if you have been on tamoxifen for a while and the breasts are still dense by high-throughput mammogram, the tamoxifen likely is less effective for you. If you have been on tamoxifen for a while and the breasts are less dense by high-throughput mammogram, the tamoxifen likely is working for you. If you don't have dense breasts to begin with, then possibly you would not benefit from tamoxifen. Consider showing the study to your doctor to get your doctor's opinion about it.",
      "MessageIndex": 103,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "May 4, 2013 12:45PM - edited May 4, 2013 12:47PM by AlaskaAngel What an interesting discussion among you all! Violet 1, I don't know what part of N CA you are in but I travel there yearly to the foothills east of Sacramento and plan to do so again in about a month. VR, Our history is similar in that my DH and I were healthy and \"invulnerable\" until we hit our 50's and 60's... then.... WHAM.... WHAM... we are at the point where we are reluctantly giving up some of the activities we have enjoyed because even with effort we are simply not as able to continue to do them without taking a lot more risk. I have always wondered and wished that research would spend at least a little time looking at those who do NOT recur, like me, to ferrit out why we haven't recurred, so that the information could be applied to more people who happen to have whatever test characteristics are meaningful from that kind of study so that they could be confident in foregoing some treatments. I was under the age of 55 at time of diagnosis as a HR+ HER2+++ patient and even today, 10 years later, the recommendation for those like me diagnosed now have not changed. Yet I did not do extensive treatment beyond chemotherapy and radiation and toda all tests are normal range and stable other than a slightly high alk-phos that has always been slightly high. mepic, for whatever reason, I have never ever felt concern about recurrence, but have felt terrorized by treatment. I take it for granted that each of us has no garantee that we will live any particular length of life, and I know that someday mine will end. I can only do what I think is best to get that far. A.A.",
      "MessageIndex": 88,
      "PostDate": "04/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/798805",
      "Title": "<1 cm - Stage 1a - Team 4My3kids rosecal954"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 23, 2014 01:53PM - edited Jun 25, 2014 09:00PM by Moderators Exactly my point. Those who are here and who are HER2 positive who read the generalization about OncotypeDx and TAILOR-X and SOFT, etc. don't realize that it doesn't apply to them, and unless this is pointed out specifically, they get innocently sucked into the generalizations being made.",
      "MessageIndex": 71,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 23, 2014 02:16PM AlaskaAngel wrote: I'm not ignoring your posts, Meow13, but only addressing some issues about other testing available. Thanks for the new info to encourage us all!",
      "MessageIndex": 75,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 24, 2014 12:10PM - edited Jun 25, 2014 09:09PM by Moderators \"But what does \"better\" mean?  Does it mean \"better\" that some patients can avoid chemo?  Or does \"better\" mean that with targeted therapies and chemo one stands a better chance of living a long life?\" I don't define \"better\" for others, since I believe each person will have to do that personally. Some may prefer to make that decision for others. I do, however, believe in genuine choice based on equal access to research. And that is what very early stage HER2 positive patients do not have. ",
      "MessageIndex": 78,
      "PostDate": "24/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 23, 2014 01:28PM - edited Jun 25, 2014 08:57PM by Moderators Generalizing is how we try to help others get the general rationale for various tests. The problem with that is that there is a tendency to blindly \"think of\" each test as it applies to our own diagnosis. Generalizing about the use of OncotypeDx conveys the impression that it can be used by all to consider whether chemotherapy would be helpful, or whether tamoxifen is helpful. For example, we know that for about 1/3 of those who are HER2 positive, the addition of tamoxifen increases the risk of recurrence. Using the results of OncotypeDx for HER2 positive patients for the purpose of deciding whether chemotherapy is helpful for that group with the idea that HER2 is aggressive so therefore chemo is important, fails to recognize that by requiring the use of tamoxifen, for 1/3 of those patients the addition of tamoxifen can defeat the usefulness of chemotherapy.",
      "MessageIndex": 68,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 24, 2014 01:57PM - edited Jun 25, 2014 09:17PM by Moderators",
      "MessageIndex": 84,
      "PostDate": "24/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jul 21, 2014 02:26PM AlaskaAngel wrote: Yes -- it is what is in place and organized. xbrnxgrl, do you know if the patient usually is presented to the tumor board, or if that only happens if the patient is aware that it can be done that way and specifically asks to go?",
      "MessageIndex": 125,
      "PostDate": "21/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Mar 13, 2012 01:43PM - edited Mar 13, 2012 01:47PM by AlaskaAngel Susan, Would that I lived next door to you!  My father made whole wheat bread for us kids frequently when we were growing up, and made it in a wood stove, too!  Just curious... The only bread I eat now is the LaBrea whole grain bread, which is shipped to the grocery store and baked fresh. I am wondering if it comes close in content to what you bake? I slice it very thin and have 2 slices a day toasted, with olive oil and garlic..... But back to the main topic of this thread.... I am 61 now (also with no children) and have worked in several careers over my lifetime, and have enjoyed all of them. For the last decade or so I've been self-employed, working from my home. Last year, because of the steadily worsening radiation fibrosis that is tightening up the lumpectomy breast and pulling on the arm, and because that shoulder and arm have become weaker and weaker despite PT.... I reluctantly terminated the work I was doing independently and shifted to P/T call-when- needed work as an employee. That got me through the summer very well, but the arm and shoulder continued to weaken so I finally gave that up too. Other than the paycheck (!) I haven't missed working. My spouse retired a few years before I did. Last year a dog adopted us, the first dog we've had since my diagnosis. All 3 of us are very young senior citizens. We are housebound quite often in winter, and live a more relaxed lifestyle. We have to travel at least yearly to get some of the medical care we need now, and are often gone a month or more for that. This year it has been unusually snowy here, but I love the peaceful beauty of it, and our new partner sees to it that we don't stay stuck in our chairs all day. I got a copy of the series about exercise for those over 50 and am giving it a go. I had been jumping rope for exercise -- something I've done all my life for exercise, along with hiking -- but pretty much had to give that up, as my knees were very sore from it. We are far enough from town that it isn't practical for us to spend the money for gas and time in a gym or at the community pool on a regular basis, but my retired sibling lives in the Lower 48 only a block away from her community pool, so she enjoys making that part of her routine. I can honestly say that I am never bored.... I hope you find your own pleasures and delights as your circumstances allow.",
      "MessageIndex": 7,
      "PostDate": "13/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784082",
      "Title": "No More Work Rohm"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Apr 5, 2011 07:05PM - edited Apr 5, 2011 07:07PM by AlaskaAngel Hi, \"Oncology reports\" is a general term but could be interpreted as meaning the path report too. The initial path report often doesn't include all of the info because some of the tests like HER2/neu take longer to complete. So keep asking for that info if you dont' have it. Also, in comparing different people's situations, age at time of dx makes a difference; also, the majority of women diagnosed with bc are diagnosed when they are over the age of 50.",
      "MessageIndex": 4,
      "PostDate": "05/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/767086",
      "Title": "Is this right? pebee AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Mar 23, 2015 03:06PM - edited Mar 23, 2015 03:09PM by AlaskaAngel The post was done in January and unfortunately never received a reply until now. For those who don't like to feel like each lab is scary until the results are available, they can just ask not to be told the results and that way the doc still can keep an eye on them. I prefer having the CA 15-3 done, because even though it isn't accurate for some of us, it just gives me one more piece of information to base my decisions on about my risk level and whether or not to go ahead with further testing if I am on the fence about the risks of further exposure to radiation, for example. I agree with the OP's thoughts about the colonoscopy.",
      "MessageIndex": 4,
      "PostDate": "23/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/827927",
      "Title": "CEA Blood Test somerset72 AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Mar 24, 2015 06:05PM AlaskaAngel wrote: Hi Lucy55, I'm wondering if maybe it doesn't work well for those who simply have other sources of inflammation that also may cause high readings... like maybe a smoker, or a secondhand smoker, or those who consume mostly the foods that are highly inflammatory, or those who have the increased inflammation of obesity, etc. etc. Maybe the docs choose not to do the testing on them, but still do the testing on those who have no known other reason for increased inflammation.",
      "MessageIndex": 6,
      "PostDate": "24/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/827927",
      "Title": "CEA Blood Test somerset72 AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "May 4, 2012 11:30AM AlaskaAngel wrote: 51",
      "MessageIndex": 786,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Mar 31, 2012 12:57PM - edited Mar 31, 2012 01:01PM by AlaskaAngel More interesting comments.... I think the shorter haircuts appeal more and work well for women with small-featured faces, and are really nice on them. (My face wasn't/isn't one of those, unfortunately!) I say \"wasn't\" because I am 10 years out now. My hair has been long to midback for about 5 years, which is what it was \"b.c.\" I keep it that way because I've only been to a hairdresser twice in my 61 years and don't want to deal with the frequent cuts, and it is easy to just wash and brush for me. I hesitated to post on this thread originally because it is about those who are doing mx and/or reconstruction, and I had lumpectomy x 1 side.  And yet.... I went ahead and posted because there doesn't seem to be any thread for the issue of gender loss when it comes to ovarian ablation. I think in part it is confusing for me because I don't feel like my boobs ever were or are all that related to my sexuality or gender, whereas the loss of hormonal influence is like watching my shadow walk along the sidewalk without any part of me in front of it. A.A.",
      "MessageIndex": 97,
      "PostDate": "31/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Apr 6, 2012 12:53PM - edited Apr 6, 2012 12:54PM by AlaskaAngel I keep trying to get a grasp of what the difference between sex and gender is, and I'm not getting it. To me they are the same thing.... I think it would clarify things if we knew each other's ages and whether each of us has only recently gone through treatment, or is truly completely menopausal or not. I see a lot of posts by women who assume they are postmenopausal once they haven't had periods for a while, and the technical medical definition is 12 months without a period, but there is very little evidence to support that as being true postmenopause. It hasn't been adequately studied, and they have found that some women who retain their ovaries have significant hormonal influence as far out as a decade after they have stopped having periods. Everyone worries about physical appearance to some degree. My nose is bigger than I'd like, and the chemotherapy has affected the appearance of my bone structure of course and my teeth over time. The only other issue related to appearance is in regard to weight, which was never a serious problem until menopause and slowing of metabolism to a crawl. Even then, and even though it took 6 years to shed the weight I'd never had before that was gained from being sick and stuck doing treatment for so long, I was able to shed it. As the metabolism slowed even more, it all came back even with the more extensive exercise and strict dieting. I look feminine despite the weight, but I feel totally without gender and nonsexual, like a 5-year-old, and it is completely foreign territory for me. I tend to wear pretty overalls a lot because I am self-employed and work at home, and they are comfortable. I wear eyeliner and touch up my eyebrows because they disappeared with treatment, but I wear no other makeup. I wear feminine earrings and rings and a necklace. My husband and I have been married for 39 years, 40 this fall. It is like living with a brother not a spouse. In answer to your question, Outfield, no. Psychologically, since some of my work is in the medical field, it has been very traumatic that the very people who provide some measure for me of what sex and gender might be, including my PCP, act as if the loss to me is of no consequence at all.... as if I never had any gender or sex to begin with anyway. A.A.",
      "MessageIndex": 102,
      "PostDate": "06/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 31, 2011 07:02PM AlaskaAngel wrote: I'm still not sure how to define the differences, and I do believe some very professional counseling would help, although the cancer center in Seattle is overwhelmed by those dealing with the first 2 years of trauma and treatment, and has determined that anybody past that point has to go it alone. So I can't get counseling for it or to define the problem at the cancer center that recommended my treatment. I \"get it\" that others here do feel feminine. What I don't \"get\" is the importance that is being put on feeling the power of being either feminine or masculine despite treatment. It sounds like it is important to have that sense of empowerment, and that it has nothing to do with sexuality per se. I'm not sure what the focus here is. I have no sense of gender and no sense of sexuality now. It isn't like I don't understand or appreciate female assertiveness/power or male assertiveness/power. I used to have a sense of gender and a sense of sexuality so I remember what it was like. It is difficult to describe or define. AlaskaAngel",
      "MessageIndex": 78,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Apr 7, 2012 11:52AM AlaskaAngel wrote: greenfrog, We have to find the humor in it wherever we can, or we really suffer! But your male friend is more accurate than not, and that is what I have tried to describe. A bc pal of mine with a dx similar to mine chose to do Herceptin without chemo, and she is only 4 years younger than I am and has had no loss of her sense of gender. She was already menopausal at time of dx, whereas I was premenopausal. A major difference between us is that she has not lost any of the \"impetus\" (which I believe is hormonally based) that drives her in ALL aspects of her life -- not just sexuality or gender. I think that there is a tendency for medical providers to think of hormonal levels as only affecting sexuality, when they actually affect all aspects of sensuality. The loss of total sensuality is what is so difficult to describe. It does affect gender and sexuality, but it is global, and not limited to just those specific areas of concern. I don't know how to \"put it back\".",
      "MessageIndex": 110,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Feb 8, 2012 03:16PM - edited Feb 8, 2012 03:18PM by AlaskaAngel Nice to \"meet\" you all. Contemplating the issue in terms of being only 39 is almost unimaginable, and I do admire the directness about it. There aren't many of us \"oldtimers\" on the boards. Most posts are by people who are either just diagosed or going through treatment or starting to recover, and then people move on. In the first 5 years after chemo + tamo, I got by basically with the use of the Estring even though I am HR+. Then that didn't work anymore. Five more years have gone by since treatment. I am \"hoping\" to obtain the Scream Cream to see what it offers. But.... The Problem is not that simple. My DH too still wants some, but has not pressured me for it. But at the same time, he is less affectionate and crankier and less cooperative in general. I do have compassion for him about it, so I will get the Scream Cream, but without any enthusiasm and even a bit of dread. A.A.",
      "MessageIndex": 17,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jan 3, 2012 08:10PM AlaskaAngel wrote: It is a very interesting discussion. We have people here whose perception of gender and of sexuality have been affected differently. There is the question for some of  us of figuring out how much sexuality is involved with breasts, and how much gender is involved with breasts.... and the lack of breast(s).... There is the question for some of us of figuring out how much sexuality is involved with hormonal devastation by chemotherapy/ovarian ablation, and how much gender is involved with hormonal devastation by chemotherapy/ovarian ablation.... There is the question for some of us of how much sexuality and/or gender is involved when one undergoes both treatments.... So even when we are sharing our thoughts, we don't all have the same background experience of gender or of sexuality. I never flirted with women and only flirted with men, and I always thought of that as the difference.  I still don't know whether that was gender, or sexuality. It was the difference between the way I would ask mom for something, and the way I would ask dad for the same something. Now flirting has no meaning whatsoever. A.A.",
      "MessageIndex": 84,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 28, 2011 01:44PM AlaskaAngel wrote: I had perfect breasts at dx and was within proper BMI, and chose lumpectomy, CAFx6, IMRT rads, and tamoxifen. At 10 years out, still married x almost 40 years to the same guy, despite having both breasts I have no sense of gender but it goes beyond that. My sense of it is that treatment diminished not just sexuality but sensuality on all levels. My lumpectomy breast was fried by IMRT rads (radiation necrosis) and is pulling tighter and tighter, and is disabling my left arm and shoulder. I am considering possibly a left MX. AlaskaAngel",
      "MessageIndex": 24,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 29, 2012 03:42PM - edited Jun 29, 2012 03:43PM by AlaskaAngel I agree with the others who posted. A second opinion would be helpful. If not that, a shorter period in-between imaging (MRI or mammography) would be what I would request, such as no more than 3 months. I had a BIRADS 4 that my surgeon would not biopsy and at that time it was 0.6 cm. By mammogram and ultrasound 6 months later, it was 1.0 cm and was cancerous, which resulted in a recommendation that I have chemotherapy. It CAN make a significant difference. If you have additional trouble getting more definite analysis or imaging of this, one test that provides a rough indication for possible bc would be to ask to have a CA 27.29 or a CA 15-3 lab test done. It is not considered reliable, but it may provide some information to indicate whether there is a suspicioius level of inflammation. These tests are not done as a substitute for having a biopsy done when one has a BIRADS 4.",
      "MessageIndex": 4,
      "PostDate": "29/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/789861",
      "Title": "Bi rads 4 and no biopsy.? elisewin Jules1018"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jan 5, 2012 10:09PM - edited Jan 5, 2012 10:11PM by AlaskaAngel Clocking in at 10 years this week...",
      "MessageIndex": 225,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758694",
      "Title": "How many years have you been a Survivor? IllinoisNancy Lou789"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Feb 8, 2012 03:22PM AlaskaAngel wrote: Anko, The younger one is, the less difficult the outcome with chemo is, at least for a few years -- those who have surgical removal of the ovaries have instant menopause and that is very difficult. But yes. Medical providers continue to not be honest about it for the most part. Sad, but true. There are no perfect treatments for cancer, but I do think medical providers should get real about it and quit pretending, and take responsibility for honestly preparing patients PRIOR to starting treatment. A.A.",
      "MessageIndex": 18,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 29, 2011 02:54PM - edited Dec 29, 2011 02:55PM by AlaskaAngel Because most of those who post are newly diagnosed or in treatment, and there also is no part of the signature to show how old they are or whether they are chemopausal, it is really hard to interpret much of anything as it applies for those who are older/chemoopausal or much farther out from treatment. I wonder how many of the responses so far are from people who are not yet truly chemopausal or who perhaps didn't have any chemotherapy.  With chemopause and passage of time the effects of gender loss are more pronounced (and more devastating). When we consider that over 50% of those diagnosed with breast cancer are over age 60 at time of diagnosis, the majority of those diagnosed who do undergo chemopause have a significantly different gender experience than those who remain somewhat less than truly postmenopausal. AlaskaAngel",
      "MessageIndex": 45,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 29, 2011 03:46PM AlaskaAngel wrote: Hi Barbara, Momine and thatsvainity, I'm in SE AK, Barbara. Do you ever miss AK? Thanks for the responses. What I see on forums in trying to evaluate my own gender issue is hard to interpret because age and menopausal status isn't given for most posts. CAFx6 at age 51 did start me toward menopause, but it was tamoxifen that ended my sense of gender. I mean... I'm genderless, like a 5-year-old. It would be difficult as a single, but as a person married to one guy for about 40 years, it is truly awful. I hesitated to post on this thread because I only had a lumpectomy. But this is where the gender discussion IS. I am not big on breasts but I wouldn't try to say how I might feel in actuality about removal -- but -- gender is not limited to breasts or no breasts. It is hormonal as well, and for those who are older (the majority) AND who have chemotherapy, docs and their staff people are oblivious to the problems created in regard to gender. Thanks for the responses, AlaskaAngel",
      "MessageIndex": 50,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Apr 6, 2012 08:40PM - edited Apr 6, 2012 08:43PM by AlaskaAngel In looking at photos of my mother and of my grandmothers taken when they were about 55, they appear much older than I do at age 61. I wonder if this is due to our highly estrogenized, synthetic exposure today....  Anyway, aging generally results in appearing more and more androgenous physically with time, although each of us can dress it up to suit our individual inclination, or not. My impression is that many if not most people who have gone through treatment tend to take stock within a year of completing treatment, and assume \"that's it, this is how it is going to be\". If they still have some libido, they tend to post as though they have survived the storm and so that must be the \"norm\" among most breast cancer patients. But around 2/3 of all breast cancer patients are 55 or older at time of diagnosis, and most of those who post that they still enjoy some libido are under age 55 (which is only 1/3 of the patients dx'd with bc). I completed chemo and rads without loss of libido or any vaginal issues at age 52. Within 2 weeks of starting tamoxifen, vaginal dryness was painful and I had no libido, still at age 52. I used the e-string for 2 years and although it did nada for libido at least sex was less painful. So then I used \"creativity\" and explored new ways of touching, being more playful, etc. etc. with determination, but with no pleasure other than accommodating my spouse. It does get worse with time. I feel androgynous and asexual. I understand the importance of exploring new challenges and continue to do that. Achieving them provides no sense of accomplishment in that there is nothing to attach the achievement TO. A.A. P.S. My mother and one grandmother both had bc in their lifetime, but neither one did chemotherapy, and neither of them died of bc.",
      "MessageIndex": 107,
      "PostDate": "06/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Apr 7, 2012 01:05PM AlaskaAngel wrote: greenfrog, It is very precious to meet someone who has the understanding of the global loss involved. It is a loss of sensuality in toto, as opposed to depression due to cancer. It mimics depression. It is similar in that hearing music or experiencing other artistic endeavor is so muted by the loss of hormonal balance required to support it. What is so remarkable to me is that people trained in medical theory who understand and accept that hormones drive sexuality, and who even understand that excess hormones can drive aggressive behavior, are so completely determinedly blind to the understanding that the lack of hormones has a similar effect on the thought processes and behavior. It is inconvenient for them to recognize that with current standard treatments favoring overtreatment as a method of saving the minority (who are primarily young and under the age of 50) they are also creating the likelihood of a majority who have lost function like you and I. Two-thirds of those who have bc are diagnosed with it at age 55 or over.",
      "MessageIndex": 112,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jun 29, 2014 02:29PM AlaskaAngel wrote: Hi Kay, In 2002 when I did tx, there was no pre-treatment or post-treatment counseling provided to help us to deal with the problem. There is more awareness now that this problem is common (instead of silent denial), but the failure to provide true informed consent in coordination with treatment is still far too prevalent. There are threads such as \"I want my mojo back\" with LOTS of posts from others dealing with this. I don't recall offhand exactly where that thread is posted, but probably there are others who might if you can't pull it up by a search. With empathy, AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822386",
      "Title": "Low sex drive skrl skrl"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Jan 13, 2011 11:33PM - edited Jan 13, 2011 11:34PM by AlaskaAngel I was dx'd HER2+++, ER+, PR+ in very late 2001 at age 51, no such thing as Oncotype Dx then, and trastuzumab still in trials so not available either. I did CAF x 6 (refused blood boosters) and wish I hadn't done chemo, as I feel it did negatively affect my life, and that there are far better hormonal treatments including ovarian ablation that would have been better for my particular dx. AlaskaAngel",
      "MessageIndex": 81,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762764",
      "Title": "If you were stage I, did you get chemo??? mdg SusansGarden"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "AlaskaAngel wrote: Info from U of Penn, Oncolink: http://www.oncolink.org/blogs/index.php/feed/ Dx 12/3/2001, DCIS/IDC, Left, 1cm, Stage IA, Grade 3, 0/1 nodes, ER+/PR+, HER2+ (IHC) Surgery 1/3/2002 Lumpectomy: Left; Lymph node removal: Left, Sentinel Chemotherapy 3/12/2002 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Fluorouracil (5-fluorouracil, 5-FU, Adrucil) Radiation Therapy 9/10/2002 Breast Hormonal Therapy 11/15/2002 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741146",
      "Title": "Novel H1N1 2009 pandemic, and cancer treatment AlaskaAngel cherneski"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Aug 9, 2009 06:46PM AlaskaAngel wrote: Hi All, Viewpoints on cancer vary a LOT depending on each of our own situations, our individual cancer characteristics, and the experiences that we or people we know have had.... and what makes it harder is that the picture isn't clear because we still do not know for sure what works for any particular person. gscott started this thread because she is new to a diagosis here. Please help to encourage her to continue to ask questions so that she can make sense out of the confusion of it all. Konakat, thanks for providing some helpful links. There are lots of questions to think about with each new diagnosis. Studies on the net are very difficult to analyze with accuracy, partly because by the time information is available from them, usually they are read without considering how much has changed in what is known now versus when the study was started. As I said earlier, the more advanced the cancer is, the more important having therapy is. Some of the reasons chemotherapy can end up not working, or even worse, causing cancer recurrence aren't obvious in the studies. For example, some of the studies include dose-dense treatment and some don't. Dose-dense almost always includes the use of non-chemo products such as blood production boosters. For some these products work well, and for some they don't; they are now under greater recommended restriction for use with therapy, as a cause for growth of cancer. This problem exists as well for those with higher stages of diagnosis, not just those who are stage 1. If we are going to speak to someone who is newly diagnosed, I hope we can be fair enough to explain this problem well enough that if their doctor is recommending dose-dense chemo and doesn't mention this issue, then as a patient that person would know they might need to understand more than just \"do the chemo, it isn't so bad, chemo saves lives\". There is just too much pressure to cave in to fear, and consider chemo the only logical choice, without being given the support to get a good understanding for making the best possible choice. In addition, because stage 0 to I cancer patients have lower rates of recurrence, the question arises as to whether chemotherapy actually makes much sense for them at all. We know that a fairly small percentage in this group will recur. We also know that among that group, there is a smaller group who, despite doing all the initial treatment with chemo and radiation and all the support drugs, promptly recur anyway. They truly lost the lottery. You and I may be fortunate enough that we aren't one of them but no one can truthfully say that doing chemo helped them. As well, others who are stage 0-1 sometimes recur after the first year, or two, or three. Did the chemotherapy delay their recurrence, or was that just an uninterrupted period of cancer growth regardless of treatment until there were clearer indications the cancer was always there? In most cases no one can say for sure. How are these numbers counted..? Are they counted as favoring chemotherapy because of the delay in documenting recurrence? When recurrence happens for a person who has never had chemotherapy, it happens not at the time of what was known and what treatments were available at diagnosis, but at a time when more has been learned and newer, better options are available to them, including other chemotherapies, and better information about the previously used support drugs for treatments. When recurrence happens for a person who has chosen the \"biggest guns\" available at the time of diagnosis, it can mean they are eliminated from participating in current clinical trials testing newer therapies because their previous therapy would distort the data. Given that for stage 0-1 we are talking about a much lower rate of recurrence to begin with, does it really make good sense to continue to support the belief that \"throwing the book at it\" right away makes genuine sense for this group? The reason I ask is because times have changed and a much higher percentage of all patients are being diagnosed as early stage. AlaskaAngel",
      "MessageIndex": 51,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738576",
      "Title": "How many here have survived 6 years after chemo? gscott Beatis"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 30, 2011 01:34AM - edited Dec 30, 2011 01:36AM by AlaskaAngel Checking in - A.A.",
      "MessageIndex": 221,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758694",
      "Title": "How many years have you been a Survivor? IllinoisNancy Lou789"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Feb 11, 2012 08:54AM - edited Feb 11, 2012 08:55AM by AlaskaAngel Whatever choice each of us makes, one plus factor that only you really know whether you have going in your favor is diet and exercise and good general health habits. It is very reinforcing to realize that if you do not smoke, for example, that alone is would change your likelihood for no recurrence, even though it is not counted as part of oncotype dx. Add in exercise, also not calculated in such tests as oncotype dx. Add in being disciplined about your nutrition, also not calculated in such tests and oncotype dx. Best to you, A.A.",
      "MessageIndex": 45,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781362",
      "Title": "IDC Grade 2, 1.8 cm, 0 nodes - SHOULD I HAVE CHEMOTHERAPY? renaedarlene DizzyD"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Nov 19, 2013 06:11PM AlaskaAngel wrote: Age 50 and VERY premenopausal",
      "MessageIndex": 70,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Nov 30, 2011 02:49PM AlaskaAngel wrote: Hillck, Why wouldn't ANY of the cancer centers, including the ones you mentioned, be offering one?  Why would it have to be limited to those two centers -- unless the major centers are quite satisfied with what they have been offering for a long time? As long as patients are so happy to buy into and go through chemotherapy and take what is standard, and insurance companies are willing to pay for what is standard, aside from those who are willing to think beyond that, where is the motivation  going to come from to research  anything different? A.A.",
      "MessageIndex": 111,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 01:56PM AlaskaAngel wrote: thenewme, Yes, I have seen the NCCN guidelines (only AFTER completion of treatment since my medical providers provided no guidance for that understanding at the time). And you are correct in that chemotherapy is not required for all early stage breast cancers, and I do apologize to all for generalizing about that. What I am referring to is the medical/cancer industry's profitable insistence that combination therapies such as trastuzumab, which until the current limited trials are completed, has only been available WITH the use of chemotherapy, for early stage bc. Thanks for the careful reminder, A.A.",
      "MessageIndex": 151,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 06:48PM AlaskaAngel wrote: Here is a similar example, from the ACS Breast Cancer Facts and Figures, 2005-2006.  (I checked the later versions and they don't have any similar info listed so one can't tell whether there was any improvement or not.) Chemotherapy Research has established that combinations of drugs are more effective than just one drug alone for breast cancer treatment. If the disease has become resistant to the first-line therapies, which include specific combinations of cyclophosphamide, methotrexate, fluorouracil, doxorubicin (Adriamycin), epirubicin, and paclitaxel (Taxol), about 20% to 30% of patients will respond to second-line drugs.",
      "MessageIndex": 168,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 10:23PM AlaskaAngel wrote: Plantlover, I agree, and do remember how difficult it was to get through treatment time after time, six times all told. As a stage 1c, my concern was never about the risks of cancer but about the risks of treatment. It is a very different question and experience for those who are diagnosed at higher stages, in terms of fears and hopes and the greater need for encouragement. Part of the question involved here is that some of the readers of the two threads about perspective are those who are in the process of treatment, while others are in the process of making the decisions about treatment. I do agree with you in that once someone has made the decision, whatever they have decided, the most important support for them is encouraging them and getting them through it. For those who have not yet made the decision, both of the threads discussing perspectives about treatment provide the most support by providing as much objective truth as possible.  The problem is that the readers include people from both groups. Hillck, Correct. One shouldn't use the 20-30% statistic about second-line treatment to make the automatic assumption that first-line treatment would have the same result. I may not have clearly explained well enough when I presented that information (although I do think I did make that distinction) but it is a similar comparison in that it gives people some basis for understanding the success rate for at least one kind of chemo administration. I was using it to demonstrate that if it is possible to find the success rate for second-line treatment, logically we should also be provided the information as to the success rate for first-line treatment..... but.... so far, it seems that information is not readily available. The only time I've ever seen it was in the discussion I saw online among reputable oncs, and at that time it was mentioned as 17%. Given that the controversy seems to be rather significant among the people who are actually asked to make the choice about whether or not to do treatment, it is quite odd and seems quite unethical that no one here seems to have been given the information to answer that question, in order to help them decide based on the truth, whether to do treatment with chemotherapy or not. Yet claims about effectiveness or lack of it are made all through the discussion. I would think that if first-line chemotherapy does provide significant benefit on the whole and not just based on individual characteristics or experiences, those who provide chemotherapy would quite certain to be right up front with that kind of support information. But apparently that information is not easily available. A.A.",
      "MessageIndex": 174,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 5, 2011 02:35PM - edited Dec 5, 2011 02:42PM by AlaskaAngel Like LtotheK, if it is true, I'm happy to see that HR+ doesn't extend out forever. I'm almost halfway there... but then, I'm also 60 now and don't expect to live forever.  It is terrific to have genuine clear opinions about treatment here for anyone who is thinking about how to best deal with cancer, to help them get a feel for it outside of what doctors tell them, especially when they get variable recommendations from physician consultations. So, how do I look at what others have posted?  Objectively speaking, most are posting within the first few years after doing treatment, so I know that they have not yet experienced full long-term effects yet, and hopefully they are honest enough to acknowledge that I have had that extra time that they haven't. I don't know how many were younger at time of diagnosis but the younger they were at time of diagnosis, the less full postmenopausal effect and added aging from treatment that they likely are experiencing. At the same time, I too have to recognize that HER2 positivity seems to end up with most of the HER2 population being younger than I was at time of diagnosis, which then makes the danger greater for them than it was for me. And all of the recent responses, with the exception of susieq58, and one stage 1 who was not recommended to do chemotherapy, have been from those at higher stages so we are in agreement about treatment, since I believe that adding chemotherapy makes more sense for higher stages (for those who are not compromised by other significant diseases). I think the discussion is really good stuff for anyone who is trying to figure out what will work best for their own situation. A.A.",
      "MessageIndex": 229,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 5, 2011 04:13PM - edited Dec 5, 2011 04:24PM by AlaskaAngel Hi Cooka, Congratulations on getting past that part of your treatment! Yes, I did chemotherapy and I do regret it. Cooka, your dx shows higher risk than mine, as you are HR negative. The person who started this thread would prefer that all responses here be limited to posts only from those who do not regret it, which gives the impression no one would rather not have done chemotherapy.  As one of the more experienced stage 1 breast cancer patients, who often receive conflicting recommendations about chemotherapy from their medical providers, I feel stage 1 patients deserve a place in this discussion that allows them to acquire other patient perspectives.  Their situation clearly is different than the situation of higher stage patients BECAUSE medical providers are NOT universally in agreement based on the evidence thus far in making recommendations for their treatment. In addition, as noted previously, thus far with the exception of a few trials that are just now being offered, there has been no scientific investigation to demonstrate one way or the other whether chemotherapy in addition to trastuzumab is helpful or harmful. The original trials for the most part excluded stage 1 breast cancer patients.  Therefore, all the added risks of chemotherapy and all of its support drugs and periodic imaging with radiation tests for those stage 1's considering trastuzumab have not been adequately scientifically justified for HER2 positive stage 1 patients. In addition, even after many decades, we are unable to tell for certain in advance just which breast cancer patients benefit from it and that includes all stages. So far, no one has been able to provide the information on what the percentage of success (no recurrence) is for the group of all breast cancer patients over time posttreatment, so we don't have clear knowledge of who or how many are being helped by use of chemotherapy -- yet it continues to be the standard by which any other treatment must be compared, regardless of how effective or ineffective it may be in terms of the many OR the few. Some people prefer not to look very closely at what their options are, and prefer only encouragement for EVERYONE to complete treatment with chemotherapy, which is in itself known to be carcinogenic. I'm not one of those people. AlaskaAngel",
      "MessageIndex": 232,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 5, 2011 08:47PM AlaskaAngel wrote: susieq58 We can't know.  Outside of the current clinical trials such as the one offering trastuzumab alone for the elderly and a few other similar trials, the standard of tx is to do trastuzumab with chemo. All we can know is that there are those like me who could, with a 1.6 cm ER+, PR+, HER2+++ grade 3 tumor plus some DCIS. We do know that many stage 1's don't need anything but surgery.  We know that adding radiation to that, and adding ovarian ablation to that, and adding hormonal treatment to that, would improve the likelihood -- and we do not know what number of patients for whom chemotherapy may be causing recurrence as a carcinogenic substance. A.A.",
      "MessageIndex": 242,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 6, 2011 01:37PM - edited Dec 6, 2011 01:40PM by AlaskaAngel I have to say that I value the diverse intellects here enough to consider the preponderance of them not being in agreement with me.  I think it is exceptionally worthwhile to have some posts from a stage 1 who is many more years out from treatment than the vast majority of those posting, with much more time for more cumulative SE's.  Most who are here are younger than I was at time of treatment (and are, as would be expected, higher stages). Long sentences ARE a problem! Using a thread title that says nothing at all about the limited expectation of the thread is not being straightforward, and outlining that expectation along the way doesn't change that. Those who have received treatment in the last 5 years have had far more access to information than was available at the time I was treated, so I should keep that in mind. I and my counterparts were lucky at the time to have the 3rd ed of Dr. Susan Love's Breast Book, with no online support whatsoever. I remember having to order a copy of the NCCN's breast cancer guidelines, just to see what they were. At my original surgeon's office in Alaska there was not a single flyer for breast cancer patients. I remember telling my onc multiple times that as a HER2 positive I wanted very much to particpiate in a clinical trial, to at least do what I could to contribute to progress. The idiot (and I don't say that lightly) at the very least could have told me to get online and have given me the site clinicaltrials.gov, since he failed entirely to tell me about the then-active clinical trials for trastuzumab. As a patient who was from small town Alaska and who asked him about the cancer center's video that I'd seen a flyer for, he didn't even tell me where the cancer center education department was so that I could check it out. Were ALL oncs like that? I had no reason to think they wouldn't be. Not a good start for this absolutely chemophobic stage 1. Thanks, A.A.",
      "MessageIndex": 278,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 7, 2011 07:46PM - edited Dec 7, 2011 07:47PM by AlaskaAngel The exception per Orac's article: \"One aspect of this trial that needs to be emphasized is that there were very few trials of patients with ER(+) tumors with favorable histology. These are the sorts of tumors that probably do not benefit much, if at all, from chemotherapy and can be effectively treated with estrogen-blocking drugs. There are a number of clinical trials right now looking at this very question, using signatures based on a number of genes to classify tumors as high, low, or intermediate risk.\"",
      "MessageIndex": 342,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Aug 8, 2009 11:36AM - edited Aug 8, 2009 11:51AM by AlaskaAngel Hello We ALL struggle with statistics and how we feel about them, but your question is a very good one because the answers are complicated. We all want to believe that there will be a magic answer for our own cancer that will beat the odds. For the most part, research has been focused on testing a variety of very toxic synthetic treatments with the illogical notion that somehow, even without matching those treatments with our own individual genetic heritage or our lifestyle practices that can create havoc (pollution, abuse of substances including too much of foods that are bad for us), chemotherapy will blast the cancer to smithereens. It just ain't so. But it is entirely natural to want doctors to be able to do that for us. Modern society tends to think that anything can be bought if we just have enough money to pay for it. Rarely they stumble on one that actually works fairly well, like Gleevec. For the most part, however, chemotherapy is truly a shot in the dark. That is hard to explain in a way that people who are desperate to survive will understand or accept. As so many have posted in this thread, there are many more survivors (chemotherapy or not) than the interpretation about the numbers from that study seem to be telling you. The reason for that has a good side and a bad side. As odd as it is, the good news is that most people who do chemotherapy for breast cancer get no benefit from it at all and have to deal with all of its other effects. Why is that the good news? Because most people with breast cancer would live many years without ever recurring regardless of the treatment they choose beyond surgery, especially now that most are being diagnosed at a much earlier stage of the disease. This is a very controversial topic and always creates a lot of debate. Each one of us wants to be in the number that does not recur. Chemotherapy has a pretty low success rate for a few in either preventing recurrence altogether or delaying death. Some choose it because they feel they will be one of that limited group who does genuinely get that limited benefit, and for the most part there is no way to tell who will get it. Studies define groups among us who are more likely than other groups among us to get the most benefit, and doctors then recommend treatment for us based on what group we happen to fit into best by the characteristics of our tumors. There is as yet no way to tell for sure which individual person will get any benefit or how much benefit that individual will get from treatment. Each person has a different tolerance level for taking risks. Some will be more inclined to believe that doing very toxic therapy poses the least risk and the most benefit, and others will be more inclined to think it poses the most risk and the least benefit. The small percentage who actually do benefit from toxic therapy are that small group who win the lottery. The rest of us are just playing the lottery without any benefit and an unknown amount of harm. The problem with playing the lottery and hoping to be at best one of the small group that actually does get some benefit is that the scientific interpretation of study results fails to include a solid analysis of just which patients have recurrence or death due to the toxic therapy, or even due to the various drugs used in support of the toxic therapy, or to a combination of both. As the others have said in their posts, the perception that the group that survives more than 5 years is as limited as 2-3% is way off the mark so I hope that cheers you (and others) up. The rule of thumb is that the more advanced the cancer is by the time it is found, the lower the survival likelihood. At the same time, because of our individual genetic composition and our lifestyles and comorbidities, sometimes even the tiniest tumor can turn out to be one that benefits from the therapy. There are no garantees. So far unfortunately research has come up mostly with toxic therapies because more natural ones can't be patented and don't make money to pay for the research. Breast cancer is an ENDOCRINE disease and we need more research into the ENDOCRINE basis for each individual's cancer so that doctors can tell which part of that person's endocrine system is malfunctioning and how to best \"fix\" it if at all possible. There is good evidence that diet plays a major role for that, and especially that balancing types of fats eaten may be one of the keys, along with reducing the toxic substances that we eat (the pesticides, herbicides, hormones, antibiotics, and plastics residues with hormonal components that we are artificially introducing into the food chain). Another key would be consistent adequate exercise. Those are things that are hard to get people to do. They would often rather get through the challenges of toxic treatment in the hope that they won't have to permanently improve their eating habits and exercise habits. Hope this helps, AlaskaAngel",
      "MessageIndex": 21,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738576",
      "Title": "How many here have survived 6 years after chemo? gscott Beatis"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Nov 30, 2011 03:48PM AlaskaAngel wrote: Hillck, I'm not advertising for any institution, including ALT ones. I mentioned that source simply because it was the only place I personally had been to, along with going to conventional treatment centers, where metronomic had been offered. I know that the onc I had at the non-ALT cancer center that recommended my CAFx6 lectured several years after my treatment, indicating that metronomic chemotherapy had possibilities. Are we looking for possibilities other than that which has been standard in its outcomes for the last few years, but only if two out of all the possible sources do the homework on it? A.A.",
      "MessageIndex": 126,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 01:44AM - edited Dec 1, 2011 01:46AM by AlaskaAngel Looking toward the future....Pro-chemo or no-chemo... either way... (and remember, I did chemo myself)... Given that: The standard regimens for initial treatment for some years now have been TCH, AC+TH, AC+T, (and for non-USA primarily, FEC or CAF plus H for some). For some the C has been carboplatin and for some the C has been cyclophosphamide. Aside from those standard chemotherapies, there is targeted trastuzumab and lapatinib (although those too work for an unpredictable subgroup of those who are HER2 positive, so it isn't actually yet truly \"targeted\"). and Because of the wide diversity of all our individual characteristics, in some distant lifetime there is hope for the possibility of other targeted therapies. It is understandable that there is a strong inclination to encourage others to gamble on being lucky enough to win the chemo lottery, and to keep doing the same standard treatments listed above. It takes courage to forego that standard treatment in order to seek to develop something better, just as it also takes courage to go forward with the unknowns of the chemo lottery. Hopefully that is understood. Favoring a focus on that same basic set of options means that we as patients are going to avoid the potential for improving the status quo, and that we in effect fully support maintaining the current volume of recurrences/mets. Here is my question. For those who are glad they did or are doing one of those therapies that have been standard treatment for some time now, do you favor continuing the status quo for the volume of recurrences that occur with those therapies? If not, how does encouraging others to do the same therapies do anything but support continuing the same volume of recurrences/mets for those who lose the chemo lottery? AlaskaAngel",
      "MessageIndex": 140,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 4, 2011 09:34AM - edited Dec 4, 2011 09:35AM by AlaskaAngel Until a treatment becomes identifiable with certainty prior to its administration as to which patients it will treat successfully, none of us, including you, can be certain whether chemo helps in our particular situation or not as individuals, simply because chemotherapy continues to not be scientifically analyzed and used as just one more variable in the conglomeration of substances used to treat us. It is perfectly okay to have our own personal belief that it does or doesn't or even \"might\" help (for those who aren't certain). It is perfectly reasonable to understand that because chemotherapy drugs are in fact carcinogens they also do cause cancer. Two people with identical diagnoses can do the identical chemotherapy treatment, and one can recur anyway -- including either you or me -- at any time. A.A.",
      "MessageIndex": 192,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 4, 2011 02:54PM AlaskaAngel wrote: Hi Plantlover, \"A.A.  You obviously feel very strongly that chemo is not the right choice for many.\" Yes.  Even oncologists feel that chemo is not the right choice for many, and do not recommend chemotherapy for many. \"Personally, I believe that in the world we live today every single one of us has put toxins in our bodies.  It may come from the foods we prepare or from foods prepared for us in a restaurant setting.  It may come from that plastic container one stores leftovers in.  It will most definitely come from the very air we breathe.\" Agreed. And some people use all kinds of carcinogenic chemicals in addition to be prettier, as a matter of free choice.. And some people add carcinogens by smoking, as a matter of free choice.  And some people add carcinogens by doing chemotherapy, as a matter of free choice. I too run into the plastic containers, or the tainted foods, so in THAT sense I too put carcinogens in my body, but by free choice I avoid as many as I can, and now that includes chemotherapy for me by free choice. \"It's almost as if you hope to dissuade those that have made a choice you disagree with.\" Not at all: Best to you, Maggie!  We are all in this together -- may your future be bright! and It is perfectly okay to have our own personal belief that it does or doesn't or even \"might\" help (for those who aren't certain). and, even trastuzumab Trastuzumab sure didn't make any difference for me, although I generally DO recommend it since it is not yet truly targeted therapy.  \"I'm just wondering why you think that would be helpful to someone just starting treatment?\" If the readers were only composed of those who are \"just starting treatment\", it would be reasonable to focus entirely on their need for encouragement (as I have said to you before). But the readers here include those who are still trying to decide, based on whatever truth they can find, along with their own feelings about it.  Do you think it is helpful to those who are trying to decide, to limit comments to only those that are intended to convince them one way or the other? If each thread is to be limited to comments that are totally supportive of the person who started the thread, then that is important information for everyone to know. I'm not saying that is your intention but I am asking what you mean when you continue to emphasize that as being the purpose you had in starting the thread. I believe your intentions are good, but I don't think including subtle censorship is a good intention. There are very good comments from people doing chemotherapy in this thread, and many that commend you. I see no problem with that. Do you think that all threads on the forum should be limited to those that are entirely supportive of the person who starts each thread? I thought all threads were open to polite and informative discussion, including opinions that differed based on personal experience. I happen to be someone who doesn't just post either for or against chemotherapy, and I also happen to be someone who can speak from personal experience. I think that is worth taking into consideration. AlaskaAngel",
      "MessageIndex": 199,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 4, 2011 09:49PM AlaskaAngel wrote: Plantlover, With your positive sharp focus on getting others through treatment, you might want to post under the forum Help Me Get Through Treatment.  No offense, just an idea, in trying to figure out the best way to keep discussion limited to that particular topic. A.A.",
      "MessageIndex": 212,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 6, 2011 12:13AM AlaskaAngel wrote: Cooka, \"Then the pool for other studies will grow as it has in past medical advances.\" Still not sure what you are driving at, or what you want people to do with your information. Volunteer for studies?  What I am driving at is whether or not ethically we should provide a discussion under the topic chemotherapy that is titled \"Chemo and Breast Cancer -- Another Perspective\", indicating that it is a discussion supporting the full range of breast cancer patients (in treatment, before treatment, after treatment), with the intention that no discussion pro or con whatsoever should be offered to help stage 1's get anything but endorsement for doing chemotherapy when they are dealing with the puzzling dilemma that stage 1's face in being given conflicting professional recommendations from oncology doctors about whether to do chemotherapy or not, on the basis that any such open discussion would be harmful to other patients of other stages. I'm wondering how any trials for treatments that stand to be better than chemo would ever get the patient participation to motivate doctors to seek it and financiers to pay to prove it, since patients are so completely convinced that the best protection is by doing treatment with chemotherapy, and the current medical/pharmacologic practice has so little financial reason to pursue it -- knowing that patients are so enthusiastic about making sure they do chemotherapy to be \"on the safe side\". ? A.A.",
      "MessageIndex": 254,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 6, 2011 01:07AM - edited Dec 6, 2011 01:08AM by AlaskaAngel susieq58 You and I in general were recommended to do chemo for the same reason I think... if you also were pre to perimenopausal at time of dx? I think one difference for us was that trastuzumab was not yet approved for me when I completed chemotherapy, whereas it was approved by the time you completed chemotherapy.",
      "MessageIndex": 258,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 6, 2011 07:17PM AlaskaAngel wrote: Cynsister, I saw a female onc when I qualified for the lapatinib trial (for those who missed out on trastuzumab) and dropped out before it started due to required frequent CT scans. When I was qualifying for that trial, the techs doing the CT failed to use the equipment properly and I was given a double exposure, which was followed by 3 days of radiation sickness. I work with other medical providers. They are hard-working, compassionate and highly qualified, but provide no help with SE's, know only the minimum about bc, and in the first few years, didn't even recognize SE's. They are just glad to get patients on the plane or ferry to specialists for treatment recommendations. I don't see oncology specialists. Much of medical services in the USA is toxic overtreatment for patient reassurance in crisis, not for better care, but for CYA. I see my PCPs once a year. I do like my Seattle surgeon and see him every few years. Thanks for asking, A.A.",
      "MessageIndex": 308,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Nov 30, 2011 01:50PM - edited Nov 30, 2011 01:54PM by AlaskaAngel Everyone is going to view treatment differently and there is nothing wrong with that. Some find comfort in doing whatever is standard treatment, and get it over with and hope for the best, and some feel that treatment that hasn't changed or improved much in decades and still can't be predictable for the individual patient isn't comforting at all. There should be lots of discussion pro and con for people to be able to make a choice that they feel is best for them. Some people want lots of reassurance and promises and encouragement regardless of the facts pro and con, and then get mad if it doesn't pan out. Others make up their minds to do standard treatment after consideration and just need encouragement to get through the long succession of treatment. It is logically hard for me to accept the black-and-white thinking of chemotherapy based on occasional expensive large clinical trials that after decades still isn't predictable for the individual patient, and often only offers temporary effect. To provide the broadest range of thought about ALL possibilities, I want to mention that one might want to review and consider the option of metronomic chemotherapy. When I was considering treatment, I did have a consult with the Cancer Treatment Centers of America and metronomic chemotherapy was being offered there. Has anyone seen any major cancer center make the effort to run a clinical trial to determine whether or not metronomic chemotherapy with trastuzumab is a preferable option in regard to early stage HER2 positive bc? If the question isn't even being considered then we are back to the black-and-white standard therapy that hasn't improved much for decades. Just another possibility for you all to give some thought to, in deciding what to do. AlaskaAngel",
      "MessageIndex": 104,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Nov 30, 2011 03:27PM - edited Nov 30, 2011 03:27PM by AlaskaAngel AnnNYC, I understand the intent there, but if it has not been used except for primarily advanced bc, do they really know whether the tumor burden is what counts or if it is truly only effective on slow-growing cancers -- and in conjunction with trastuzumab, how much of a difference that too might make? Or are they just dismissing those possibilities altogether? A.A.",
      "MessageIndex": 121,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Nov 30, 2011 03:42PM AlaskaAngel wrote: hillck, Yes. One of my frustrations is that the farther out from treatment one is as a NED, the fewer trials I am eligible for.  (I've participated in 2 trials, and dropped out of another one before starting it after qualifying.) It is similar to the basis by which trastuzumab trials were done. As long as they excluded the largest group of breast cancer patients -- those who were early stage (due to earlier detection/mammography, etc.) the results looked much better, because only those patients who were more likely to recur were allowed to participate, and that made the results more dramatic.  But that also ended up creating a false impression about how effective it might be for early stage bc patients and left them having to endure chemotherapy whether or not chemotherapy helps. A.A.",
      "MessageIndex": 123,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 01:45PM - edited Dec 1, 2011 01:47PM by AlaskaAngel Pip57, Yours is a really good point. In a way, both of us are saying the same thing. If treatment for all groups was separated out so that each and every variable involved -- including the \"hidden\" potentially unknown effects of support drugs used so that chemotherapy can be included -- and was put to the test and had to be justified -- then it is possible that the results of trials for early stage and later stage could outline more clearly just what matters most in treatment of more specific situations for both groups, and why. It is just as frustrating for you to not be able to apply the results of early stage trials as it is for early stage patients not to be accurately able to apply the results of later stage trials to early stage treatment. A.A.",
      "MessageIndex": 149,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 06:04PM AlaskaAngel wrote: The point here isn't to \"win\" or to \"lose\", and it isn't one targeted at any one person, pro-chemo or no-chemo. With all the debate, why not cut to the chase? Is that information openly and freely provided to the public, or not? The point here is to see if verifiable sources of of information available to any of us -- online or off -- can provide that percentage as a service to each one of us in getting closer to understanding benefit vs risk provided by the \"standard\" against which other therapies are held. AlaskaAngel",
      "MessageIndex": 165,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 06:38PM - edited Dec 1, 2011 06:38PM by AlaskaAngel Hi Luah, I agree, there are other treatments that are often more helpful than chemotherapy is, depending on one's individual circumstances.  However, if the people who set the requirements for access to therapies made it possible to evaluate whether chemotherapy should have ever been chosen, or continue to be used as the standard against which newer therapies have to be measured, and then fail to even allow a true comparison with it and without it, there isn't a clearly documented basis for that preference. A.A.",
      "MessageIndex": 167,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 4, 2011 02:29PM AlaskaAngel wrote: Hi susieq58, Taking a part of a sentence only doesn't provide the content of what was said. \"simply because chemotherapy continues to not be scientifically analyzed\" is only part of what I said. chemotherapy continues to not be scientifically analyzed and used as just one more variable in the conglomeration of substances used to treat us. The meaning for that is, that chemotherapy drugs are not tested fully (equally) with other possibilities and are considered to be the mainstay when we can't factually know whether another substance might actually perform better alone than when combined with the chemotherapy.  REAL science allows chemotherapy to be considered just one variable among many others, just like all the rest, and tested against each one. Until that is how each substance is tested without that bias in favor of chemotherapy, we won't know. A.A.",
      "MessageIndex": 198,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 4, 2011 08:43PM - edited Dec 4, 2011 08:44PM by AlaskaAngel cp418, I can't give metformin the credit for my long continuing remission, as I have only been on it for about a year.  I take an extremely low dose (probably too low to be significant) of 250 mg per meal. I do not have any chronic disease other than bc (and chemopause) and have been tested for diabetes, etc. I am on it through my PCP's referral by the endocrinologist's noncomittal Rx. I am so thankful for it. Eating without steady weight gain was a nightmare for me with chemopause.  (All my life until then at age 52 I have maintained normal BMI.) Hope that helps. A.A. P.S. However, as an ER+ PR+ my risk extends into eternity, so hopefully it and its helpful effect on weight will reduce that risk for me.",
      "MessageIndex": 211,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 6, 2011 01:01AM - edited Dec 6, 2011 01:03AM by AlaskaAngel AnnNYC I think she has explained her position very thoroughly too. It clearly prohibits those with stage 1 breast cancer who receive conflicting professional advice about chemotherapy vs no chemotherapy from discussing that dilemma anywhere BUT in a forum for alternative treatment. My impression is that stage 1 issues such as that are just too difficult and annoying to have to discuss here when there are so many people who are so busy doing treatment. Am I wrong? Would those patients whose oncologists make the professional recommendation that they don't do chemotherapy get full support here for that recommendation? I didn't know that the person initiating threads with titles that are general with no indication to readers that they are limited to posting only positive endorsements of chemotherapy, would be deciding what the parameters were for a general topic of Chemo and Breast Cancer.... especially when it is known that not all patients are recommended to do chemotherapy.",
      "MessageIndex": 257,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Nov 30, 2011 03:07PM - edited Nov 30, 2011 03:08PM by AlaskaAngel thenewme, My older sister was dx'd with IDC 2 years before I was, and did not do chemotherapy, whereas I am the only one in a herd of family with lots of bc who did chemotherapy.  Neither of us has ever recurred.  My older sister was dx'd with IBC 1 1/2 years ago, which leaves her in a situation even less common than triple negatives, as far as research goes. She is doing well on Femara. But the frustration in terms of clinical research is real. A.A.",
      "MessageIndex": 115,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Nov 30, 2011 03:15PM AlaskaAngel wrote: AnnNYC, Are there any trials examining the combination of the use of trastuzumab and metronomic chemotherapy for early stage breast cancer patients that you could find? It does seem to me that option should have been at least researched by now for early stage HER2 positive breast cancer patients, given that trastuzumab was originally offered to breast cancer patients over a decade ago. Thanks, A.A.",
      "MessageIndex": 118,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Nov 30, 2011 03:53PM AlaskaAngel wrote: AnnNYC, I had suggested that exact thing about 7 years ago in a direct contact with Dr. Susan Love's staff. And that is what I too thought the Army of Women was about, but when I responded to what I thought was that offer from the Army of Women, I could not get the response to go through on the computer. I don't know what they ended up doing. Part of the problem with that idea involves privacy restrictions, and part of it involves the complexity of tracking patients long-term. It comes down to, what are we as patients willing to consistently actually DO to lead to better outcomes. A.A.",
      "MessageIndex": 127,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 03:11PM AlaskaAngel wrote: susieq58, If you can point me to any trials completed that proved that trastuzumab alone didn't work as well as trastuzumab plus chemo, I welcome that information.  They are now conducting a few stray trials such as using it for some situations where a patient cannot tolerate chemotherapy, and there is at least one trial I think for elderly breast cancer patients, but I don't think it has reported out yet. Again, they did the original studies comparing chemotherapy alone to chemotherapy plus trastuzumab; the trials were NOT done compariing trastuzumab alone to chemotherapy plus trastuzumab. The frequent statement that \"they\" found that \"chemotherapy plus trastuzumab\" was found to be \"more effective\" is in regard to the fact that it was only compared to the use of chemotherapy. A.A.",
      "MessageIndex": 158,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 04:00PM AlaskaAngel wrote: Hi Luah, As of this year, which is more than a dozen years out from the introduction of trastuzumab with chemo for metastatic patients, and more than a dozen years out from the initiation of the adjuvant clinical trials for trastuzumab and chemotherapy, finally a scattering of trials have been set up for use of trastuzumab alone for adjuvant use. I listed as many as I could find of those trials on page 15 of the thread When Do Most Recurrences for HER2 Happen? on the forum for HER2/neu positive patients. I can't agree with your statements here, since science continues for the most part to falsely imply that chemotherapy drug regimens are logically the \"standard\" for comparison. Scientifically speaking, chemotherapy is just one more variable like any other due to its poor track record in general, and even more so in that there is no way to predict what chemotherapy regimen or drug will work for any particular person. In addition, it would be really helpful if oncologists would provide what the percentage success rate is for the application of chemotherapies to breast cancer patients as a whole group. From what I understand, the chemotherapy regimen is verifiably useful 20% or less of the time that it is used -- in part because some patients never needed it and in part because the chemo didn't match the patient's cancer characteristics. Please don't rely on that information; take the time to ask your oncologist. It would be very interesting to know what all of those here find out, with documentation. My personal basis for making that statement is from an online discussion among oncologists around 2006 or 2007, but perhaps someone can further determine what the percentage is currently. As I understood it, that 20% or less includes those for whom chemo did not continue to provide success. The minimal record of success is a rather unscientific way to choose a \"standard\" to compare everything else against, or to fail to investigate other treatments used alone for a decade or more at a time. A.A.",
      "MessageIndex": 160,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 04:25PM AlaskaAngel wrote: LtotheK, I hope that means those who contend that chemotherapy is a valid standard against which other therapies must be measured will be willing to provide the documentation indicating what the proven success rate percentage is for all breast cancer for all chemotherapy regimens applied? I freely admit I do not have the link to documentation to prove the 20% is accurate and can only say that I saw it in an online discussion among the group of better-known oncologists. I would hope that percentage has improved since 2006 or 2007 when I saw it mentioned.  At the time, there was no difference of opinion about that percentage among the oncs participating in the discussion. I would think that information would be easily publicly available to anyone considering choosing therapies, as a matter of not being based on profits but on truth alone. Is it?",
      "MessageIndex": 162,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 07:06PM AlaskaAngel wrote: Here is another one that provides a general idea of what the percentage is. This tells us that the maximum percentage of improvement for the group treated with postop (adjuvant) chemotherapy is 40%: From Seattle Cancer Care Alliance > Breast Cancer > Treatment Options > Chemotherapy \"Chemotherapy given after surgery, or adjuvant chemotherapy, has been proven to improve the cure rate and overall survival rate for breast cancer patients. Adjuvant chemotherapy may reduce your risk of a recurrence of breast cancer by as much as 40 percent.\"  2004-2011 Seattle Cancer Care Alliance (It is hard to say what the average percentage of improvement for postop adjuvant therapy is, other than that it is less than 40%.) A.A.",
      "MessageIndex": 169,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 4, 2011 12:35AM - edited Dec 4, 2011 12:36AM by AlaskaAngel A matter of perspective, and a matter of choice.  Stage II, agreed.  Stage I T1c.... Nah. But that is speaking in hindsight, sad to say. Time is a great teacher. A.A.",
      "MessageIndex": 185,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 4, 2011 12:55AM - edited Dec 4, 2011 12:56AM by AlaskaAngel Thanks, susieq58, but I don't think so. And I don't mean I'm not appreciative that I'm healthy, because I am, other than all the lousy SE's I ended up with from treatment.  Trastuzumab sure didn't make any difference for me, although I generally DO recommend it since it is not yet truly targeted therapy. A.A.",
      "MessageIndex": 188,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 4, 2011 02:02AM - edited Dec 4, 2011 02:09AM by AlaskaAngel I didn't have trastuzumab.  That is what I mean.  I am living proof that trastuzumab is not yet a truly targeted therapy.  I personally don't believe chemo is worth it for ER+, PR+ stage 1's and don't think it did squat for me.  But then, I'm the only one in a herd of breast cancer patients on both sides of my family who DID chemotherapy, and since out of all of us there has only been one who developed mets and died (and she got bc in the 1950's, when it was advanced by the time they found it), and I know for absolute certain I am the only one in the entire family who ended up with SE's, well, it seems pretty unnecessary in the first place to me.  Especially since the onc I tried to trust failed so miserably to be at all honest about any SE's in the first place.  My older sister had IDC 2 years before I did and only did 2 weeks of tamoxifen, and to this day has never recurred.  She didn't have any SE's until she developed secondary IBC 2 years ago and did do chemo for that. She too got zero benefit out of the chemo -- even her onc admitted that, based on testing -- and she is doing fine on Femara alone -- but she does have the SE's.... Most ER/PR negatives are the younger people, who generally are not stage 1 by the time their cancers are found. A.A.",
      "MessageIndex": 190,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 4, 2011 10:01AM AlaskaAngel wrote: Best to you, Maggie!  We are all in this together -- may your future be bright! A.A.",
      "MessageIndex": 194,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 4, 2011 06:52PM - edited Dec 4, 2011 06:58PM by AlaskaAngel The best news for stage 1's of all is knowing that a LOT of them never need anything more than surgery, which means that whatever they choose to do, a lot of them will not recur. Some certainly will believe \"chemo saved them\" anyway. But NOT all can just do surgery, which is the less good news. In other stages the number who would never need anything more than surgery is less, but still present. There are those hidden HER2' positives who happen to be like me, who never need trastuzumab at all, so that is also a reason for hope no matter what they decide to do. Some of them will certainly believe that trastuzumab \"saved them\" anyway. But NOT all can safely leave trastuzumab out, which is the less good news about that. LtotheK, The only problems I see with 1-5 are that: Chemotherapy has been used as THE way to achieve ovarian ablation for so many of the studies, rather than carefully using less toxic methods for that in making comparisons (along with the additional treatments of radiation, other hormonal treatment, etc.) and 5.  Because of the underrepresentation of stage 1's in the HER2 trials, it will be a long, long time before Adjuvant will be able to figure in exactly what effect trastuzumab used along with menopausal achievement by means other than chemotherapy does in comparison to chemotherapy + trastuzumab. Hi Apple: I posted my dx in several responses but it is long and has to be typed in each time to get the clearest description of it, so sometimes to keep the posts shorter I leave it out. P.S. Also, Blondiex46 is the other shoe. None of us here know whether or not we will still eventually recur, whatever treatment we choose.",
      "MessageIndex": 207,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 5, 2011 11:57PM AlaskaAngel wrote: LtotheK, Unfortunately, both Adjuvant and cancermath.net fail entirely to take into account the one advantage provided by chemotherapy in their counts that is not exclusive to chemotherapy: ovarian ablation or postmenopausal status. As long as there is no direct comparison including ovarian ablation or postmenopausal status between the patient who does add in chemotherapy with the characteristics of: IDC, ER/PR+, HER2- patient with a 2 cm tumor, node negative, grade 3 the comparison is not a true comparison. And, since chemotherapy is a carcinogen and ovarian ablation or menopausal status doesn't have to include a carcinogen, and doesn't attack the immune system like chemotherapy does, the person receiving no chemo but receiving ovarian ablation likely would have superior results. A.A.",
      "MessageIndex": 253,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 7, 2011 02:02PM - edited Dec 7, 2011 02:05PM by AlaskaAngel  Judy67, Early stage bc is a gray area for many, and I'm glad you found some worthwhile discussion here to go with your analysis of your situation and options and can go ahead feeling good about your choices. AlaskaAngel",
      "MessageIndex": 338,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Nov 30, 2011 02:43PM AlaskaAngel wrote: Hi Luah, In using clinical trials.gov, the only trial that came up with the search terms trastuzumab and metronomic was this one, which is only for metastatic patients and not early stage HER2 positive bc: NCT01329640 Do you know if any of the trials you listed were specifically for early stage HER2 positive bc? Thanks, A.A.",
      "MessageIndex": 110,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Nov 30, 2011 03:23PM AlaskaAngel wrote: Hillck That pretty much indicates that such possibilities, no matter what, aren't likely to happen anywhere except in those two sources.  AlaskaAngel",
      "MessageIndex": 120,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 1, 2011 01:15PM - edited Dec 1, 2011 01:18PM by AlaskaAngel Thanks for the responses and the understanding of my question. On the one hand there is the concern for the very young newbies, who have a difficult rate and speed of recurrence and mets that is so hard to effectively address, and then there is the frustration with the lack of sigificant progress in reducing recurrence/mets for all groups. I appreciate the differing viewpoints. When it comes to chemotherapy pro or con, the status quo is clearly not scientifically based when it comes to early stage breast cancer. The system of testing therapies against metastatic patients first and then making chemotherapy the standard for other treatments to be compared to it doesn't allow true scientific consideration of the chemotherapy itself as being simply one out of many variables. For early stage breast cancer, chemotherapy continues to be required as a standard practice regardless of whether there is true justification for it. It continues to be required even though it is known to be a carcinogen, and as such, is capable and likely to be causing a certain amount of cancer in the group that is especially unlikely to need chemotherapy in the first place. It continues to be officially promoted as a \"protective\" solution for this group despite the failure to research each and very variable equally in the treatment specifically in behalf of this group. So when it comes to being protective of ALL newbies--including young newbies--who are early stage, that is a genuine concern, not an imaginary one. AlaskaAngel",
      "MessageIndex": 144,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 5, 2011 01:13AM AlaskaAngel wrote: Hi rosemary-b. A thread about chemotherapy does belong here for discussion. The suggestion was made in case posting on the Help Me Get Through Treatment in particular would be more specific to Plantlover's expressed purpose. A.A.",
      "MessageIndex": 215,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 5, 2011 07:38PM - edited Dec 5, 2011 07:42PM by AlaskaAngel I am curious to know just who is going to be the first to do the treatment that you all hope \"someday\" would not require chemotherapy? Will it be any of you? Who should be that person? As it stands, doctors will not recommend any such drug for that very first patient, because any kind of new drug always has to be done in conjunction with chemotherapy as the standard of care, so that everyone can say the chemotherapy was what made the difference, and so that everyone will continue to believe that we all must do chemotherapy no matter what, to be \"safe\".... literally a \"no-brainer\". When my onc asked if I wanted to do trastuzumab and advised me not to, I took some risk and won that lottery. Ditto for the AI's, and for not doing 5 years of tamoxifen. All of which \"can't be done\", because everyone is convinced it is just too risky. My \"guess\" is that most if not all of those here found my signature almost impossible. But the truth is that the majority of stage 1's don't need anything but surgery to avoid recurrence. And it is particularly interesting to be a live person who is recurrence-free as a HER2+++ who never did trastuzumab because in a time when it is automatically given to everyone, the belief becomes more and more solid that it is not possible for anyone who is HER2+++ to not have recurrence without it -- even though it is known that trastuzumab only works for about half of those who get it, doesn't work for some like me at all, and stops working for many. That is the power of positive thinking. And yet, most breast cancer patients do not perform daily exercise to lower their risk factor! A.A.",
      "MessageIndex": 238,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Dec 5, 2011 10:33PM AlaskaAngel wrote: Hi LtotheK, Well, one likely culprit is so invisible to all those who want desperately to believe in chemotherapy that it is hard to see. As long as no one ever proves that chemotherapy as a carcinogenic sometimes actually causes breast cancer, the assumption is that it doesn't. So, if you are looking at statistics that list secondary cancers but don't ever list any column titled \"breast cancer caused by chemotherapy\" to tallly for that possibility, and that only list possibilities such as later leukemia, etc. you won't \"have\" any \"proof\". Try to find any indication in Adjuvant Online, for example. (Hint: Look at the numbers of those who completed all recommended treatment and recurred anyway -- and who wonder why.) Cooka, The few studies that are being done with trastuzumab alone for limited groups are going to apply only to those limited groups. The longer it takes, the longer it takes for the data to be considered \"5 years out\" for them, or \"10 years out\" for them, to get to the point where then another baby step is taken. Meanwhile, the wealthy countries continue to use massive overtreatment, while those in less prosperous countries can't afford to give those at highest risk reasonable treatment, and somehow we justify those numbers of dead people, as if one woman in Chicago USA is any more important than one in the Congo. ",
      "MessageIndex": 250,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    },
    {
      "AuthorID": "AlaskaAngel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10571/profile",
      "Content": "Feb 15, 2012 01:24PM - edited Feb 15, 2012 01:27PM by AlaskaAngel Most tend to err on the side of caution/fear (which has more merit for higher stages and less logic for lower ones). As a stage 1, I followed that tendency myself. Logic lost out to caution/fear because I didn't understand why there would be so much emphasis on overkill by people I thought were more knowledgeable than I was. I do think those who turn down chemo are still a minority mostly because it is hard to figure out why so many choose chemo when the numbers are strongly in their favor to avoid it. Saying this out loud in a public forum is not popular. Any of us can recur at any time. Most of those who say their chemo is \"preventing their recurrence\" don't even know if they never would have recurred without it.   I too would consider chemo more strongly if there is LVI. A.A.",
      "MessageIndex": 17,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/782687",
      "Title": "Another \"Chemo or No Chemo?\" Dilemma! crking71 bcisnofun"
    }
  ]
}