{
  "AuthorID": "alemankc",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201756/profile",
  "Posts": [
    {
      "AuthorID": "alemankc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201756/profile",
      "Content": "alemankc wrote: Hi all. Just trying to figure out things about cysts. My mammo/ultrasound showed a cyst with debris. Recommended another one in six months. But they said it's not cancer or anything. So why do they need to recheck it? I'm 48 and never had a cyst before, so I'm curious about what to expect, ie will it go away, get bigger first, etc Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865085",
      "Title": "Why recheck mammo in six months for cyst? alemankc mustlovepoodles"
    },
    {
      "AuthorID": "alemankc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201756/profile",
      "Content": "alemankc wrote: Hi, my 14 y.o. was diagnosed Friday with a 2 cm by 3 cm fibroadenoma. We decided today to talk to a breast surgeon to see what we want to do. My question, if anyone might know, is this....I know this is a benign tumor, thankfully, but in October, she had a benign tumor taken off her tibia bone. I am wondering if she's just really \"lucky\" to have gotten two lovely unrelated tumors, or do you think there could be a connection between the two? The NP who sent her for the breast ultrasound said she really doesn't know. Anyone heard of this? Or is she just a \"bumpy\" girl, do you thonk? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/822072",
      "Title": "14 yo daughter with fibroadenoma alemankc LMoon"
    },
    {
      "AuthorID": "alemankc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201756/profile",
      "Content": "alemankc wrote: so original radiologist said \"cyst with debris\" and follow up 6 months. Gyro suggested seeing a breast surgeon just to be safe. Breast surgeon recommended ultrasound with aspiration. Went today and they did an ultrasound followed by core biopsy x4. I asked the nurse after how there was tissue to core biopsy it as opposed to aspirating contents. She said my cyst had a solid and fluid component. Anyone have better explanation as to why one said debris in it and other said solid component? Same thing? Guess I'm just not understanding how they could do a core if it was a cyst Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/865677",
      "Title": "Core biopsy for cyst? alemankc alemankc"
    },
    {
      "AuthorID": "alemankc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201756/profile",
      "Content": "Jun 19, 2014 02:59PM alemankc wrote: No biopsy done. Diagnosed using ultrasound. We have an appointment with surgeon on Friday the 27th.",
      "MessageIndex": 2,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/822072",
      "Title": "14 yo daughter with fibroadenoma alemankc LMoon"
    }
  ]
}