{
  "AuthorID": "alex91",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157798/profile",
  "Posts": [
    {
      "AuthorID": "alex91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157798/profile",
      "Content": "alex91 wrote: Hello ladies,  this is the first time I'm telling someone about my problem, and I know this isn't the best place to do it but I'm really desperate and have no one to turn to. So here's my crazy story. When I was 10 I found a small hard lump under both my nipples. As they were the same on both sides, I thought it was normal and a part of development or something. I know I should have said something to my parents but we've never really talked about anything personal, let alone female stuff, so it was almost impossible telling them. Soon after this I found 3 small lumps on my head underneath my hair, and being a nerdy kid, I did some research and every single book/article on cancer said that once it has spread, it's not curable and the doctors can only extend the patient's life a bit. Obviously, I didn't want to spend my last months/years in the hospital, but most of all, I didn't want to cause my family more pain than necessary (my parents had it very difficult already, due to my sister's illness and other things). So at the age of 10 I made this very stupid decision not to ever tell anyone and just enjoy my remainig time (I know it sounds crazy). I never even dreamed about going to highschool or even college, but here I am now, 20 years old and freaked out more than ever. The lumps are now HUGE and they fill my whole breasts (literally). I don't think they've grown (at least not noticeably) in the past few years (I've had the same bra cups since about 16). What worries me most is that they are firm, irregular and they feel attached (but yet somehow moveable, I can't really describe it), and they don't change size before/after my period. Apart from the lumps, my breasts look completely normal, there's no dimpling, nipple discharge or invertion, no skin changes. The lumps are not painful, only sometimes when pressed. The 3 little lumps aren't pianful either, they're flat and about 1/2 inch in diameter. They haven't grown since I first found them (do metastasis grow?). They can be moved around a bit, but feel kind of attached to the skull which freaks me out. I also had one more on my finger bone but it went away after 2 years or so (can mets disappear without treatment?) The worst part is that I haven't had it checked by a professional yet. By the time I came to my senses a few years later I thought it was too late anyway and reading and hearing everywhere about how early diagnosis is essential, I was sure it would be useless to seek help. Please don't think I'm a freak for leaving this unnoticed for so long - of course if I found something like this at 15 or older, I would immediately run to the doctor. But now I feel like trapped in my body, like I have to bear the consequences of a 10-year-old's dumb decision. I almost feel mad at my 10 y/o self for being so irresponsible, because this thing really affects my life. I can't really focus on my studies and I'm not as good a daughter as I'd like to be (I kind of blame my mother for not taking me or suggesting going to an OB/GYN at 15 as all my friends' mothers did, or not ever bothering to ask if I've had a check-up or any problems). I've been to the doc a few times because of a slight infection down there and other minor problems, but I haven't had a complete check-up with breast palpation etc. Anyway, I finally got up the guts and I'm getting it checked up by an OB/GYN in two weeks. The thing I dread the most (except for this being BC of course) is that the doc will probably think I'm nuts for leaving this untreated for 10 years. But at annual check-ups at my GP all the test always came back OK (except for higher ASLO on my last check-up last week, but I don't think that's relevant). Would blood or liver tests show something abnormal if I had advanced cancer? I also feel very good physically, I do sports regularly, eat healthy stuff, never smoked or anything. And there's no history of BC in the family... So the thing I'd like to ask you girls is if you think I would still be alive and kicking if this was cancer from the beginning? Or have you ever experienced/heard about something similar? And what could those small lumps be, except metastasis? Sorry for this extremely long post. I still can't believe I'm writing it and I'm probably going to delete it later, but I  am really scared and I thought maybe you could help me ease my mind a bit before my appointment. I would give anything for these lumps to be B9... I know the chances of a 10 y/o getting bilateral BC (and living with it for 10 years with no problems) are quite slim but there always IS a chance. Thanks a lot for any opinion or answer to my questions. Have a lovely day :) Alex Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/791452",
      "Title": "Would I still be alive? (20 y/o) alex91 itsjustme10"
    },
    {
      "AuthorID": "alex91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157798/profile",
      "Content": "Aug 27, 2012 10:53AM alex91 wrote:",
      "MessageIndex": 7,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/791452",
      "Title": "Would I still be alive? (20 y/o) alex91 itsjustme10"
    },
    {
      "AuthorID": "alex91",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157798/profile",
      "Content": "Aug 2, 2012 03:08PM alex91 wrote: Hey ladies, thanks for the support! :) I will keep you updated. And no, I haven't told my parents yet and I don't plan to before I get the diagnosis. I don't want to upset them unnecessarily, they've always been concerned even about my or sister's fever and I can't imagine how they'd cope with suspicion of cancer. But if this turns out to be something serious I know I'll have to tell them.",
      "MessageIndex": 6,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/791452",
      "Title": "Would I still be alive? (20 y/o) alex91 itsjustme10"
    }
  ]
}