{
  "AuthorID": "alex56",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
  "Posts": [
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Jan 19, 2011 07:57AM alex56 wrote: May the angels welcome her into heaven; they're lucky to have her.  Rest gently.",
      "MessageIndex": 79,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763574",
      "Title": "Bopeep is an angel Leah_S"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Feb 10, 2012 11:04AM alex56 wrote: Oh this made me smile!   We're all celebrating with you!",
      "MessageIndex": 10,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782475",
      "Title": "FIRST TIME WITH NED! MCTHO rosie06ct"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Jan 19, 2011 05:31PM alex56 wrote: Hi Leah!  I was really apprehensive for my first visit to the LE therapist too.  I think he must have blocked off about 2 hours for my appointment.  First I filled out a questionaire with general health history, and then a lot of questions about your ability with everyday tasks, range of motion, pain, etc.  Then we went into the treatment room and he gave a review of the lymphatic system using the Klose posters.  He gave me some privacy to get undressed and settled onto the table.  He started the MLD massage explaining the whole process while he worked.  Then he let me get dressed and started the bandaging.  Be sure to wear a really large shirt because working that bandaged arm through a sleeve is a bummer!  All in all, it was a very pleasant experience; the massage felt GREAT, and I learned a lot.  Most important, I started to feel empowered and on the road to managing LE on my own.  The days you are bandaged 24/7 get hard, so when you're finally fit with a daytime sleeve you'll just want to sing!  Take notes though, you'll need them.  TONS of info to remember.",
      "MessageIndex": 22,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/761323",
      "Title": "well, dang Leah_S kira"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Nov 14, 2011 05:04PM alex56 wrote: My opthalmologist said she wants to check my eyes every 6 months after my stage IV diagnosis.  The meds are hard on the eyes, plus my pressures have been high lately.  She scans them also to check the optic nerve.  Breast cancer can spread to the eyes so she wants to stay on top of things.  I vote for the opthalmologist.",
      "MessageIndex": 7,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778093",
      "Title": "eye exam in stage iv K-Lo carcharm"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Jan 3, 2011 08:27AM alex56 wrote: I had a left mastectomy followed by radiation.  Mild lymphedema developed in my arm due to aggressive lymph node removal.  I started lymphedema therapy about 10 months after the mastectomy.  My therapist did very gentle lymph massage on the affected side of my chest and commented that massage on radiated skin must be done with great care.  He gave me stretching excersises to do and taught me MLD (manual lymph drainage) which has been fantastic. Massage should also not be done in an area of active tumor(s).  In the hands of a skilled therapist, massage can be wonderfully therapeutic and effective.  It is also effective if the lymph vessels begin to harden - the therapist can gently manipulate and stretch them to improve your range of motion.  I would encourage you to find an experienced OT or physical therapist who works with bc patients.  My understanding is that the massage needed for cancer issues is different than for sports related conditions.",
      "MessageIndex": 2,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762416",
      "Title": "treatment for fibrosis cycle-path alex56"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Apr 8, 2013 05:41PM alex56 wrote: Looks like I'm 45.  I'm a lurker and sometime poster, but I read through these threads often.  So many wonderful people here!",
      "MessageIndex": 48,
      "PostDate": "08/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Jan 5, 2011 03:31PM alex56 wrote: I have the leopard print and black lace sleeves and they are awesome!  Can't wait to get the spring designs in a few months!  I'm making peace with the meaning of 'forever' with respect to LE, but no doubt about it, it's a struggle.  Hang in there everyone!",
      "MessageIndex": 8,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/762919",
      "Title": "Does the swelling ever go away???? nannajean Marple"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Oct 6, 2010 11:21AM alex56 wrote: I had my hysterectomy April 2010.  Uterus, cervix, ovaries, tubes - all gone.  Ultrasound showed a large fibroid and a thickening in the uterine lining.  Since they wanted to put me on arimidex which is for post-menapausal women, I decided to just have it all removed. Fortunately there was nothing malignant there. Frankly, it was one of the best things I've ever decided to do.  My surgeon is a friend and did a fantastic job. I was doing stairs and walks the day after I got home from the hospital.  The long vertical scar is barely noticable.  At 53 I was done with it anyway. Not having to worry about cancer in any of those organs is such a relief - we've all got enough on our plate with the breast stuff, thank you. ",
      "MessageIndex": 8,
      "PostDate": "06/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758771",
      "Title": "Oophroectomy (sp) Tabatha00 Alyad"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Apr 21, 2012 12:28AM alex56 wrote: Diagnosis Dec.2009 > mastectomy Jan. 2010 > Radiation Feb.2010> Arimidex & Zometa started May 2010.  My bone mets have been stable ever since so I am happy to dodge the chemo bullet for as long as I can.  I'm going through reconstruction now and feeling content with my treatment and my life!",
      "MessageIndex": 16,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786140",
      "Title": "Best Treatment for Stage IV metastatic breast cancer sgupta EnglishMajor"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Oct 7, 2010 02:09AM alex56 wrote: Meg:  My hysterectomy was scheduled the week after I finished radiation.  My general surgeon did both my mastectomy and hysterectomy - I wouldn't trust it to anyone else. After the hysterectomy my onc started me on arimidex and monthly zometa for the bone mets.  I have another CT and bone scan next week.  If there is progression they may start chemo, if there isn't, we'll stay the course.  They made me post-menopausal via surgery, but I am SO glad I had it done.  Recovery from that, for me, was way easier than the mastectomy.  All of this is scary, but the day after the surgery I wondered what all the fuss was about.  Now I am not terrorized by my period and have lost over 20 lbs.  From time to time I also indulge in a pommegranite martini infusion too!",
      "MessageIndex": 12,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758771",
      "Title": "Oophroectomy (sp) Tabatha00 Alyad"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Jan 11, 2011 02:46PM alex56 wrote: Hi kbooker; I too was stage IV from the start (Dec. 2009).  Disbelief, anger, depression - all those feelings are part of the \"new normal\".  I have found that anger is the most productive of all those emotions though.  When I'm angry I get fiercly defiant and actually get a lot done!  Of course some days you have to pry me from the fetal position with a crowbar, but those days are starting to diminish.  I've signed up for an EMT class that starts this month and will be a part of our local volunteer ambulance crew.  My scans have been stable, and like Lowrider, all I take is an anti-hormonal (arimidex) and zometa once a month.  My youngest is in college and I'm determined to see her graduate.  My oldest is engaged and I will be visiting her next month.  I'm confident I'll be able to hold my first grandchild whenever that happy event happens.  Give yourself permission to cry and thrash (I do it in the shower) and then keep as busy as you can with activities you enjoy.  I'm wishing you strength to get through your treatments - hang in there!  Just picture the little cancer bastards dying as they're administering your chemo.  Hope they all go down choking!",
      "MessageIndex": 8,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763211",
      "Title": "RECENT RECURRENCE - STAGE IV - SCARED TOO DEATH kbooker Fitztwins"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Jan 18, 2011 05:38PM alex56 wrote: I get my generic arimidex thru the Anthem BC/BS Express Scripts.  It's like $20 for a 90 day supply.  Unbelievable.",
      "MessageIndex": 4,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763573",
      "Title": "Does anybody get meds through mail? cookie97 nancyh"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "alex56 wrote: I have mild LE in my left arm.  I've  been doing MLD, wear a day sleeve, and have been wrapping at night.  Lately I've been waking in the middle of the night with my arm completely numb.  I've gone a couple of nights without the wraps, but my hand still gets tingly.  My LE therapist will try to fit me in next week, but thought I'd check and see if anyone has had a similar experience.  Sometimes I get the sparkler feeling in my tricep too; hot in the upper arm, and a cold tingly thing going on in my hand.  Sometimes a vertigo feeling when I'm laying down too.  This is exhausting. Dx 12/2009, Stage IV, Grade 2, 20/25 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/763438",
      "Title": "Numb hands at night alex56 Marple"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Jan 13, 2012 05:10PM alex56 wrote: Yes!  How funny, I was just noticing this recently too.  I had my mastectomy 2 years ago and felt the temperature sensation shortly after the surgery.  It went away for awhile, but I've noticed it again this winter.  Boy, you can feel it go all the way!  I agree that it is probably the lack of \"insulation\" there.",
      "MessageIndex": 1,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/780979",
      "Title": "Weird sensation when drinking hot or cold beverages Cats134 OBXK"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Oct 5, 2010 06:21PM alex56 wrote: Boy flachica, your post rang some bells. I'm getting my head around the fact that if I don't get hit by a bus crossing the street, breast cancer is eventually going to kill me.  BUT, I'm really ok with the fact that I will not be languishing in a nursing home, drooling into a cup, not recognizing my family and friends. That picture scares me even more. In the meantime, I will wage war on my body, cut out the body parts that are trying to kill me, and spend time with the people that mean the most to me.  Breast cancer is the dirty word I wash out of my mouth with a martini!",
      "MessageIndex": 39,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758685",
      "Title": "Well, I get it. flachica KSkier"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Mar 13, 2012 06:08PM alex56 wrote: It's such a comfort to know that no question is too off-limits!  I was able to schedule my hysterectomy for the day my period was supposed to start.  Take that....payback's a bitch! They'll take good, compassionate care of you Emaline.  Wishing you well!",
      "MessageIndex": 12,
      "PostDate": "13/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784096",
      "Title": "Embarassing question.... Emaline jocelynlally"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Feb 3, 2012 05:06PM alex56 wrote: I can echo what the others have said.  I've got extensive bone mets too and have been kept stable with arimidex, zometa and Calcium/Vit D.  My last scans showed some healing lessions too. Hope you get a good long run with your treatment; many of the ladies here do. Frapp:  looks like you and I were diagnosed at almost exactly the same time!  Gee, whose naughty list did we get on that year?  I asked for earrings.",
      "MessageIndex": 4,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782112",
      "Title": "Bone mets ladyleen4 ladyleen4"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Feb 3, 2012 10:24PM alex56 wrote: Stage IV from the beginning for me too.  Luckily I have been stable these two years on arimidex and zometa.  At first, I didn't want to read anything about metastatic breast cancer because I was so angry and depressed.  Then I started goggling for info and found this site.  Happy Day!  There is a wealth of great info here as well as advice, even recipes!  Coping with all the issues we have is made so much easier here.  My husband gave me an AR15 assault rifle for my birthday, so now when I feel overwhelmed we just go out and blow the hell out of some stumps or other inanimate targets.  It's the best thing ever.",
      "MessageIndex": 61,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781871",
      "Title": "...And you are? EnglishMajor keepingon"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Jan 16, 2011 06:21PM alex56 wrote: Thank you Kira - I'm so grateful for your advice.  When I spoke with my therapist on the phone he also mentioned the brachial plexus.  Oy.  I read the link you provided and that sounds exactly like what has been happening to me recently.  I'm happy to hear at least ONE thing might resolve on it's own!  The bed spins are a bummer however, but likely harmless (let's hope).   I wish we all had a nickle for every minute we spend working on our LE issues - we could all book a charter cruise with really hot therapists!",
      "MessageIndex": 2,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/763438",
      "Title": "Numb hands at night alex56 Marple"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Apr 18, 2011 04:15PM alex56 wrote: Hi Luphy:  This club just keep getting bigger.  I was diagnosed Dec. 2009 with Stage IV, mets to bone (spine) from the get go.  I had a mastectomy, radiation, and now am on monthly zometa and generic arimidex.  So far my tumor markers have been coming down and my CT and bone scans are stable.  I had scans again today and praying that they continue to be stable. I hope it is an encouragement to you that I feel really good, work full time, take classes, and continue to live my life well.  I have not had chemo yet and my onc is not inclined to rock the boat unless something takes a turn for the worse.  For now the arimidex and zometa are doing what they are supposed to do with minimal side effects.  I have CT scans and a bone scan every 3 months.  The stress of living from scan to scan is pretty awful, but I try to fill my time with friends and family as much as I can.  Why some women live many years and some only months is a question I can't answer, but every morning when you open your eyes just try to spend the day living the life you love.  I know lots of women on the stage iv board are being treated the same way I am, with just the estrogen inhibitors and bone strenghtener.  But many of the women who are enduring chemo are having fantastic results and great success in their treatment.  Keep asking your doctor questions and require that they explain your treatment options.  There is so much to learn and new stuff is coming down the line all the time.  Peace to you!",
      "MessageIndex": 4,
      "PostDate": "18/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767743",
      "Title": "A fight that I do not want to lose, suggestions needed luphy2006 texasrose361"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Dec 15, 2010 05:45PM alex56 wrote: I had a left mastectomy in Jan. '10.  My bone mets were found thru scans after the surgery.  I began radiation in February - 38 treatments.  Last month I met with the PS who indicated that having TE and an implant is the way to go, but he likes to start the procedure a year out from completion of treatment (in my case from when I finished radiation).  The fact that I have mets is not an issue for him as long as everything is currently stable.  He and I will talk again in March to get this show on the road.",
      "MessageIndex": 2,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762064",
      "Title": "Delayed recon on radiated BMX? suz45 Laurita"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Dec 17, 2010 08:07AM alex56 wrote: OMG, SO happy for you!  What a great way to end the year.  May the statistics crash and burn around us all!  Enjoy a glass of something good and I'll raise a toast to all of us as well. Cheers!",
      "MessageIndex": 11,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762064",
      "Title": "Delayed recon on radiated BMX? suz45 Laurita"
    },
    {
      "AuthorID": "alex56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110614/profile",
      "Content": "Dec 16, 2010 08:41AM alex56 wrote: Suz: I live in Maine.  The PS I saw is in Waterville.  I guess I'm confused by the range of info here.  I was told before my mastectomy that immediate reconstruction was not advised because I'd be heading into radiation.  When the PS examined me in Nov he said recon with TE and subsequent implant is my only option (my abdomen has hysterectomy and appendectomy scars which preclude DIEP).  The only thing that would blow my plans for spring recon would be if something took a turn for the worse and they needed to start chemo.   My onc is on board with this plan too.  This is a great place to figure out what questions to ask - sometimes you don't know that you don't know.  Everyone's experiences here a worth their weight in gold.",
      "MessageIndex": 6,
      "PostDate": "16/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762064",
      "Title": "Delayed recon on radiated BMX? suz45 Laurita"
    }
  ]
}