{
  "AuthorID": "alexanjb",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111524/profile",
  "Posts": [
    {
      "AuthorID": "alexanjb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111524/profile",
      "Content": "May 13, 2011 09:19PM alexanjb wrote: I had the weird white facial fuzz too.  I woke up with it one morning and totally did a double take in the mirror.   My (head) hair started coming back before I was done with the Taxol.  It grew back soft, curly, and salt and pepper color.  I am told it is quite striking.  I haven't had it styled yet but it looks like I have!  I don't know if it will stay this way.  I have heard people say that it goes back to \"normal\" after a while.  I don't feel like processing it in any way.  I haven't even used a blow dryer on it.  Helluva way to get good hair for the first time in my life!",
      "MessageIndex": 9250,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "alexanjb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111524/profile",
      "Content": "May 13, 2011 09:05PM alexanjb wrote: Sue53-I felt like lying around too.  And I did.  You don't need to be superwoman, you just need to get through this.  Just listen to your body and your head.  If you know you are getting down from lying around, then get up and do something.  If its too much, then lie down again.  Tell your onc team everything.  Mine was wonderful about helping me with anything that was bothering me physically or emotionally.  Don't be afraid to use the meds they give you for the side effects.  Sometimes I couldn't sleep.  Sometimes all I did was sleep.  I had hemorroids with fissures so bad that I sat on the toilet and cried.  I was tempted to put the numbing cream (for my port) you know where, I've put ice packs places I never imagined I would.  I found out what I look like with no hair and I was rewarded by my hair growing back better than it ever was.  You will get through this.  Do whatever helps you.  We are all different.  I found that if I could distract myself by reading or playing scrabble on my computer I didn't obsess so much.  Good luck and best wishes. -Joy",
      "MessageIndex": 8,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768883",
      "Title": "Just started TC 2 days ago and looking for support Sue53 alexanjb"
    },
    {
      "AuthorID": "alexanjb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111524/profile",
      "Content": "Jul 13, 2011 06:31PM alexanjb wrote: Yes, it's shocking to get that call.  I'm still not sure how I feel about it being told to us over the phone.  I agree with the posts above.  Knowledge is power.  Take someone with you, yes, but try to find someone that is not in shock as well.  As far as treatment well....I had the works and it is a rough ride but it is doable.  Cry when you need to, hold your chin up when you need to.",
      "MessageIndex": 5,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771591",
      "Title": "In shock motheroftwins SoCalLisa"
    },
    {
      "AuthorID": "alexanjb",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111524/profile",
      "Content": "Jul 14, 2011 05:26AM alexanjb wrote:  I was given a lot of literature.  Someone above said that no one cares about your body as much as you do.  So, that means you need to be proactive.  No matter how good your team is you still need to be ready to communicate and ask all kinds of questions. Don't worry, all of the questions don't have to be asked on that first visit.  For instance we have well water and in the literature I read that unless your water is tested EVERY day you need to drink bottled water while on chemo.  I asked if this was true and I was told yes I should drink bottled water for the duration.  Of course, we don't even know what your treatment plan will be yet, so don't worry about things like that yet,  I am just saying to read the literature and communicate everything or else your team won't know your living circumstances.",
      "MessageIndex": 22,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771591",
      "Title": "In shock motheroftwins SoCalLisa"
    }
  ]
}