{
  "AuthorID": "Alfieval",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
  "Posts": [
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jul 9, 2014 06:46AM Alfieval wrote: Hi. I had mastectomy almost 4weeks ago waiting for results of sentinel node biopsy so don't know if I need more treatment,I have seroma across stitches. Going on holiday with my daughter on 28th and we are flying for one hour each way. Still sore across breat but more so under arm makes excersises difficultdifficult but still doing them. Do you think my holiday will be ok,my breast nurse hasent told me to cancel yet?  Alfieval",
      "MessageIndex": 6,
      "PostDate": "09/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/822314",
      "Title": "Flying immediately after lumpectomy or mastectomy Sallyfs1 Alfieval"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jul 14, 2014 08:51AM Alfieval wrote: hi Arion  I had my mastectomy with snb 4weeks ago after a week when drains were removed I stopped pain meds and started excersises and moved on to advanced exercises was doing well.Now I am going back over and can only do basic excersises I am in pain across breast and under arm and have a seroma across breast and under arm painful where had snb depressed because I was slowly getting better and getting more movement in arm now worse than when I started and still no results.  Alfieval",
      "MessageIndex": 6,
      "PostDate": "14/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/822702",
      "Title": "Post Surgical Pain FranfromFL Ariom"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jul 17, 2014 02:01PM Alfieval wrote: Hi Arion. Thank for your message it was very helpful have been down lately but good news I got my results and I'm all clear so now just have to heal, went to see nurse today and she said the fluid has been absorbed by my body and the pain I feel is nerve pain,under my arm I do have cording she said I have to keep up full exercises and work through the pain or I will loose mobility in arm. The exercise sheet I'm working from is the one from this site and it says exercise until it pulls but not to cause pain, now I'm told to do them even if painful.The discription you gave of a claw is how my breast feels all the time right now and under my arm is painful with the smallest of exercises but I have to do all of them regardless.What you said about things you do at home without thinking is true, I live alone since my husband died of cancer so I have to do things for myself but I forget how heavy some things are like a full kettle of water or one day I lifted top of cisten to put blue loo in didn't realise until it hurt, I also have a cat and I know he weighs more than ten pounds ha ha ,so what you said is right I could have been doing things to cause my problem I will have to be more careful but can't pull back as you said because Iv been told to fight through the pain. I am unhappy because I didn't want the snb with the breast surgery from the beginning but was told over and over that I should,my result have proved me right I had two dcises two far apart for lumpectomy so didn't need snb.Never mind it's done now but I wouldn't be having these problems and I could Kick myself. It was good to hear about your history and I hope you are going ok now. Thankyou   Alfieval",
      "MessageIndex": 8,
      "PostDate": "17/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/822702",
      "Title": "Post Surgical Pain FranfromFL Ariom"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jul 18, 2014 04:23AM Alfieval wrote: Hi Ariom. Thanks for reply, Is PT exercises? No I haven't tried massage didn't know if it was safe yet to put anything on breast like I don't use deodorant under that arm yet? It's 4 and half weeks since surgery,can you recommend a suitable essential oil please? It's strange isn't it that the excersise leaflet said the same as you,but my breastcare nurse is making me excersise through the pain which is no fun at all. I'm sorry to hear about your mum I think your right it would have been easier for her now. My mum died of bowel cancer and her mother and grandma so I get regular tests,it was prostate with my husband and my dad,nursed them both myself at home,my brother died of lung cancer but no breast cancer in family I only have one brother left.thats why I give to cancer research it's such a horrible thing isn't it? Sorry need to cheer up don't I want to make you miserably too. My cat Alfie wants to play so that will help. All the best your a great online friend.",
      "MessageIndex": 10,
      "PostDate": "18/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/822702",
      "Title": "Post Surgical Pain FranfromFL Ariom"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Aug 11, 2014 08:52AM Alfieval wrote: hi Moira Back off holiday with my daughter and on my own again feeling low,crying lots which I'm not used to doing and remembering my David,did after your surgery have this effect on you? Been to see my surgeon he has told me to massage breast scar as it it still lumpy and bumpy it doesn't look nice,he said it will help putting pressure on it but he says he will have to do a bit of surgery to make it look a bit better,he agreed it didn't look right. How did your scar look after swelling went down I thought it would be flat? I'm still doing excersises PT gave me more to do.Surgeon says I have fluid under arm but he can't get at it until I have scan,he can feel it but when He try's to remove it he can't find it.Strange ha ha  Hope to hear from you  Val",
      "MessageIndex": 15,
      "PostDate": "11/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/822702",
      "Title": "Post Surgical Pain FranfromFL Ariom"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Alfieval wrote: Hi I have had mastectomy,I thought scar would be flat as have to wear a prosthesis,but I have been left with a thick layer of skin all the way across and under arm,it's  going to get in the way and is not what I expected. The surgeon that I saw for all of my appointments said I would be pleasantly surprised well I'm not.When surgeon came in just before surgery and said I'm your surgeon I had never seen him before,it wasn't the one I had been talking too,it was a shock. Had a form to fill in from hospital. One of questions asked was did I have confidence in my surgeon,what could I say I'd never met him.  Alfieval Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/822446",
      "Title": "Mastectomy scar Alfieval Kicks"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Aug 30, 2014 07:44AM Alfieval wrote: hi Moira  Good to talk to you, My son and girls have gone home now and it's so quiet I miss them already. I'm so sorry to hear about your adopted son, is there no way you can get in touch with his wife it's so sad you have a grandchild but can't see them? My daughter is 40 years old and divorced she has always wanted a baby and she is worried about time running out so she is going to a sperm bank,she has had all the tests now and just has to choose a man off list and wait for the right time.Wow watch this page as they say.Its strange isent it how some girls don't want a child and some long for one I'm sorry your daughter felt that way Moira.Oh my you have been busy it must be tiring for you I hope your sorted out soon and can relax. I am still doing the exercises almost have full movement,Iv been given my prosthesis now it looks really good but it's heavy to carry around I have two weeks to try it and see if it's ok. I received an appointment with cancer doctor for a chat don't know what it's about as Iv already seen my surgeon. I don't know how you felt after but I soon get tired and when family left I sat in chair and fell asleep for two hours ha ha.Always good to hear from you.By for now take care.  Val X",
      "MessageIndex": 19,
      "PostDate": "30/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/822702",
      "Title": "Post Surgical Pain FranfromFL Ariom"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Aug 21, 2014 05:56AM Alfieval wrote: Hi Moira  Good to hear from you,yes I was just the same running on adrenaline for a while not even thinking that I had cancer. My goodness you really went through it didn't you,I hope you had someone nice like you to talk to when you needed it. I have been for an Ultra sound,they found fluid and removed it, there was a lot deep down that's my surgeon couldn't find it,exercising still hurts but movement improving all the time.Doctor put me on low dose antidepressants for a while,I was on them during David's illness and death but after a while took myself off them. I really hate crying in front of anyone Moira I prefer to go home and have a good cry on my own. So I'm feeling better and don't feel tears coming every time I try to talk to someone so embarrassing I dashed home when ever it started HaHa.Im glad your scar got sorted in the end but it took a while didn't it? My son and two granddaughters are coming to visit on Saturday for a week so they will keep me busy. All my family live a long way from me,David and I moved to Cumbria to retire as David loved this area, but it takes my son or daughter 7 hours to drive here and my oldest son lives in America. Thanks for your reply, Take care, By for now. Val",
      "MessageIndex": 17,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/822702",
      "Title": "Post Surgical Pain FranfromFL Ariom"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jul 22, 2014 09:19AM Alfieval wrote: hi Ariom  It's me again I haven't been able to find a blend of essential oils do you know what is in your blend? Do you know if wintergreen is safe to use after surgery it has the original aspirin in it can't remember name something like silitate. Still having problems excersises painful. My breast care nurse is going to make appointment for me with physio therapist to give me more exercises,she also sent me on an appointment with nurse to measure me up for prosthesis when I can't even where a bra yet,Strange ha ha .Still feel frustrated over snb. Thank for listening. Alfieval. Bye the way my name is Val and my cat is Allfie.",
      "MessageIndex": 12,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/822702",
      "Title": "Post Surgical Pain FranfromFL Ariom"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jul 24, 2014 05:10PM Alfieval wrote: Hi Moira Good to hear from you a place online recommended a mix of wintergreen,peppermint and Helichrysm in jojoba carrier oil I'm going to give it a try,if it doesn't work I will go on Iherb and have a look thanks. The only thing that worries me about my mix is that wintergreen is a kind of aspirin.You said you were fitted after swelling went down my breast is still swollen and very hard, under arm still painful but I am making myself do exercises. Going on holiday with my daughter on Monday won't be able to wear a bra, going to Isle of white it's still in the UK just for a week,will be seeing my surgeon when I return. Nurse sending me to PT when I get back. I only feel that way about snb because it's the only thing holding me back and I told them I didn't want it. I have friends living in Aus we email each other often, we used to be a foursome when they were in uk. Good to talk to you. Love Val",
      "MessageIndex": 14,
      "PostDate": "24/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/822702",
      "Title": "Post Surgical Pain FranfromFL Ariom"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jul 9, 2014 09:30AM Alfieval wrote: I understand how you feel I had mastectomy with sentinel node biopsy almost 4 weeks ago still waiting for results of biopsy don't know if I need more treatment. I still have pain across breast and under arm so find it difficult to do excersises  Have seroma along scar.  Alfieval",
      "MessageIndex": 18,
      "PostDate": "09/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/821398",
      "Title": "Just when I think I'm good to go.... Suesinstitches Suesinstitches"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jun 21, 2014 06:10PM Alfieval wrote: Hi. Mastectomy on Monday two drains, today one measured 100mls the other 50 mls,been told coming out on Monday doesn't sound right to me,what do you think?",
      "MessageIndex": 13,
      "PostDate": "21/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739721",
      "Title": "Drains after bilateral mastectomy-questions! SDinSDCA Alfieval"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Alfieval wrote: Hi. Had mastectomy with snb three weeks ago waiting for results one was dcis but the other one they didn't know if it was invasive. Very sore across stitches and under arm everything pulls can't wear bra.I have fluid across chest and under arm nurse wants to wait and see if it goes away by itself but it's been there 3 weeks and I have swollen feet as well don't think it will go without help  Alfieval Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/822576",
      "Title": "Waiting for biopsy results after mastectomy Alfieval Alfieval"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jun 20, 2014 05:36PM Alfieval wrote: I came home after mastectomy on Wednesday,have two drains in kept catching them on things and hurting myself but told I'm ok. After two days had 130cc in each side but my breast care nurse said they can come out on Monday I'm concerned that that's to soon,Friday today.  Alfieval",
      "MessageIndex": 12,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739721",
      "Title": "Drains after bilateral mastectomy-questions! SDinSDCA Alfieval"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jun 23, 2014 03:37PM Alfieval wrote: hi Ariom. Thanks for replying. Next day fluid dropped to 20 in one and 10 in the other so pleased nurse took drains out today. For any one having drains out it didn't hurt at all and it's great to be free of them. Now I have to start exercises to prevent cording and lymphodema and wait for results to know what happens next. All the best.  Alfieval",
      "MessageIndex": 16,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739721",
      "Title": "Drains after bilateral mastectomy-questions! SDinSDCA Alfieval"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jun 29, 2014 07:04PM Alfieval wrote: Hi Ariom  Thanks for your message. I'm a bit behind with exercises,breast care nurse forgot to remove dressing under my arm from node removal and I couldn't get it off in shower so rang district nurse and she removed it for me,I'm now exercising three times a day and doing ok. We don't have massage in UK and not sure what silicone scar strips are but glad you did so well. Still have swollen sore feet and a water infection slowing me down a bit. I have good friends living in Australia  All the best  Alfieval",
      "MessageIndex": 19,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739721",
      "Title": "Drains after bilateral mastectomy-questions! SDinSDCA Alfieval"
    },
    {
      "AuthorID": "Alfieval",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200861/profile",
      "Content": "Jun 29, 2014 07:26PM Alfieval wrote: Hi Aviva5675 Thanks for message. Wish I had had a belt like yours I was carrying them round in a bag and kept getting them snagged. Thankfully they are out now and everything appears ok.  All the best. Alfieval",
      "MessageIndex": 20,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739721",
      "Title": "Drains after bilateral mastectomy-questions! SDinSDCA Alfieval"
    }
  ]
}