{
  "AuthorID": "Ali81",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231257/profile",
  "Posts": [
    {
      "AuthorID": "Ali81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231257/profile",
      "Content": "Apr 16, 2016 04:18PM Ali81 wrote: The radiologist said he wouldn't do the mri without the contrast as it picks up a lot more. But I do think a mamo and finding a breast surgeon. The breast surgeon I was referred to, heard I was already getting imaging and they said unless there is something there he won't see me!!! Wth!? Anyway I'm currently looking for another.",
      "MessageIndex": 2,
      "PostDate": "16/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843484",
      "Title": "I just don't know what i should do! Long... Ali81"
    },
    {
      "AuthorID": "Ali81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231257/profile",
      "Content": "Ali81 wrote: I did my bse after seeing a facebook post about a women finding dimples in her breast...turned out to be cancer. I had no idea to look for that...anyway low and behold I found two very light indents stacked at 6, it also is flattening out There like my breast is resting on the table and when I tense my muscles it makes a deeper indent. There is no palpable lump and the breast is less thick. I have a ton of pictures... just hoping it disappears one day. :( Seen my gyn, didn't give it Any serious consideration ( currently looking for a replacement!!) so I went to my gp who referred me for an ultrasound. Found nothing. Have a nagging feeling my Boob is just not meant to do this...plus reading all about how it looks and presents. So I ask for a repeat ultrasound and mamo. I'm 34, 5mths pregnant and of course, Have dense breasts! Gp said no to the mamo because of pregnancy but gave me a referral for the repeat ultrasound and mri. Had the ultrasound...the tech was lovely and I felt very thorough looking around...found nothing! The radiologist came in and took a visual look and said I don't Have cancer and doesn't think I need the mri. I'm worried about the contrast as it stays in the babies fluid and it's not been around that long to know of the dangers. So they did a 3d ultrasound. Nothing... Finally to my question...should I rely on those 2 ultrasounds and 1 3d ultrasound scans and wait until baby is here In another 4 months to get the mri. I just don't want another 4 months of possible growth. I wished people weren't misdiagnosed. I really want to trust the scans would have picked something up if it was there. Do you guys think if it was pulling my skin Or tethered to my tendon it would be big enough that they would have seen something!?? Ahhh someone slap me! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843484",
      "Title": "I just don't know what i should do! Long... Ali81"
    },
    {
      "AuthorID": "Ali81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231257/profile",
      "Content": "Apr 19, 2016 03:17PM Ali81 wrote: I know, I would really love to hear from other women who had the symptoms of breast indentations/dimpling and changing shape, mine is flattening out underneath too. There is no palpable lump either. I am thinking a mamo while waiting for the mri after baby is born.... I just don't know if I should wait that long. Isn't ilc and idc aggressive?",
      "MessageIndex": 4,
      "PostDate": "19/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843484",
      "Title": "I just don't know what i should do! Long... Ali81"
    },
    {
      "AuthorID": "Ali81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231257/profile",
      "Content": "Apr 15, 2016 04:10PM Ali81 wrote: Boo! Oh how I hope it's that benign fast growing tumor!!! How did the biopsy go!? When did they day they'll get back to you!? Thinking of you!!!",
      "MessageIndex": 1,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/843428",
      "Title": "Waiting for Core Biopsy- 5.5 X 2 X 1.8 cm Mass WifeMomTeacher keepthefaith"
    },
    {
      "AuthorID": "Ali81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231257/profile",
      "Content": "Ali81 wrote: This Post was deleted by Ali81. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843503",
      "Title": "Breast flattening and indented. Anyone?? Ali81"
    },
    {
      "AuthorID": "Ali81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231257/profile",
      "Content": "Apr 19, 2016 03:13PM Ali81 wrote: I know. Thank you. but I really wanted some advice from other women with indentations/ flattening and dimpling.",
      "MessageIndex": 2,
      "PostDate": "19/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843503",
      "Title": "Breast flattening and indented. Anyone?? Ali81"
    },
    {
      "AuthorID": "Ali81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231257/profile",
      "Content": "Apr 19, 2016 07:41PM Ali81 wrote: I did my bse after seeing a facebook post about a women finding dimples in her breast...turned out to be cancer. I had no idea to look for that...anyway low and behold I found two very light indents stacked at 6, it also is flattening out There like my breast is resting on the table and when I tense my muscles it makes a deeper indent. Seen my gyn, didn't give it Any serious consideration ( currently looking for a replacement!!) so I went to my gp who referred me for an ultrasound. Found nothing. Have a nagging feeling my Boob is just not meant to do this...plus reading all about how it looks and presents. So I ask for a repeat ultrasound and mamo. I'm 34, 5mths pregnant and of course, Have dense breasts! Gp said no to the mamo because of pregnancy but gave me a referral for the repeat ultrasound and mri. Had the ultrasound...the tech was lovely and I felt very thorough looking around...found nothing! The radiologist came in and took a visual look at my breast and said I don't Have cancer and doesn't think I need the mri. I'm worried about the contrast as it stays in the babies fluid and it's not been around that long to know of the dangers. So they did a 3d ultrasound. found nothing... Finally to my question...should I rely on those 2 ultrasounds and 1 3d ultrasound scans and wait until baby is here In another 4 months to get the mri. I just don't want another 4 months of possible growth. I wished people weren't misdiagnosed. I really want to trust the scans would have picked something up if it was there. Do you guys think if it was pulling my skin Or tethered to my tendon it would be big enough that they would have seen something!?? Ahhh someone slap me",
      "MessageIndex": 6,
      "PostDate": "19/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843503",
      "Title": "Breast flattening and indented. Anyone?? Ali81"
    }
  ]
}