{
  "AuthorID": "alicia57",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83845/profile",
  "Posts": [{
    "AuthorID": "alicia57",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83845/profile",
    "Content": "May 16, 2009 10:10AM alicia57 wrote: I'm 57 and in the Fall of 2007 was diagnosed with Stage 1 breast cancer in the right breast.  The very next day my mother, age 82, was diagnosed with her third separate instance of breast cancer.  Her first incidence was at age 72 and got a lumpectomy, 9 years later she got it again in the same breast and had the breast removed - both were estrogen positive. She tried to talk to her surgeon at the time about getting the other breast removed and he just told her he didn't see any medical reason to do so. Flat told her that and at the time she didn't have a Medicare supplement that would have paid.  She struggled for a year feeling lopsided and uncomfortable, hating prosthesis that didn't match the other breast, and fearing cancer returning in the other breast.  She got a Medicare supplement and persisted and thank God her regular physician wrote a letter saying removing the other breast was a medical necessity.  She had the breast removed (she had had a mammogram that February and this was October) and the path report came back with the shocking result that she had HER2+ breast cancer in that breast.  I had struggled with lumps and fibrocystic diseas since I was 20 and I was tired of living in terror of my breasts.  I and my wonderful surgeon concurred that a double mastectomy was what I needed to do.  I have never regretted that.  I'm older and always have been a bit of a tombody so I don't miss them because I always lived in fear of them anyway.  I just didn't get reconstruction.  But I know from my Mom's experience how uncomfortable she was with just one breast.  I wish you the best with your decision, but just remember - it's your decision.   Oftentimes doctors just don't understand what you're going through and to me you sound pretty sure of what you feel you need.  I don't know your background, but you do.  I'd go for another opinion.  Take care.",
    "MessageIndex": 22,
    "PostDate": "16/05/2009",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/732028",
    "Title": "contralateral prophylactice mastectomy 2 years later ally2 mythreesons"
  }]
}