{
  "AuthorID": "alittlebird…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70883/profile",
  "Posts": [
    {
      "AuthorID": "alittlebird…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70883/profile",
      "Content": "Nov 13, 2008 02:08PM alittlebird wrote: I have the same complaint about the scars from my double mastectomies, no reconstruction. The tissue beneath the scars, more so on one side, feels thick and extremely tight. The tightness is like a metal band across my chest, sometimes a pinching sensation, quite uncomfortable but not 'painful' . The skin and scar area is still profoundly numb except for this tightness. It intensifies when undressing or in cold air, similar to the sensation of 'goose bumps' but stretched armpit to armpit across my chest. I used to think I needed to do more stretching exercises but that actually makes it worse. The most comfortable thing is heat. My surgeon shruggs his shoulders and suggests it's from the nerves that were cut. I'm 1 year post op and this condition seems to be getting worse.",
      "MessageIndex": 1,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724401",
      "Title": "Scar tissue stcking to ribs during healing.. Lynette Lynette"
    },
    {
      "AuthorID": "alittlebird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70883/profile",
      "Content": "alittlebird wrote: I'm rather new to the board, great people here! I've figured out foobs, fipples (hilarious) and OMG but who is NED (actually an old boyfriend's name)? Also have seen DH and FH ... related? And thanks for illuminating me! \"You can easily judge the character of others by how they treat those who can do nothing for them or to them.\" —Malcolm Forbes Dx 10/10/2007, IDC, 1cm, Stage I, Grade 2, 0/2 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/720032",
      "Title": "Who's NED? alittlebird Yogi70"
    },
    {
      "AuthorID": "alittlebird…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70883/profile",
      "Content": "Aug 17, 2008 04:32PM alittlebird wrote: I had bilateral mastectomies in October 07. I chose bilateral though only one breast had a tumor. I've never once regretted that decision. Balance and eveness is better and it's easier to get 2 matching prosthesis (or reconstruction) than to match the other breast size and weight. Also, I never wanted to go through mammograms again. For years I'd had a normal negative mammogram but 7 months after the last one I find a 1cm tumor myself. I'd lost faith in their accuracy finding early tumors. MRI is the new way to go. Very difficut decision for sure. Best to you whatever you decide and hang in there.",
      "MessageIndex": 11,
      "PostDate": "17/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719436",
      "Title": "Need to decide one breast or two? catemarie catemarie"
    }
  ]
}