{
  "AuthorID": "Alli",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
  "Posts": [
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Alli wrote: Hi, My Mom had left total mastectomy with SNB on Tuesday.Â  The surgeon removed 4 Sentinel lymph nodes.Â  Has anyone had this many sentinel nodes removed?Â  I had 2 with my lumpectomy.Â  Also, the area above her breast site and below clavicle has areas of \"cording\", like a hard thin rope that runs up and down.Â  I can feel at least 2 of these. Anone else have this? Thanks, Alli Dx 11/2/2006, IDC, Left, <1cm, Stage IA, Grade 3, 0/2 nodes, ER+/PR+, HER2- Surgery 11/30/2006 Lumpectomy: Left; Lymph node removal: Sentinel Radiation Therapy 3/1/2007 Whole-breast: Breast Dx 11/8/2016, DCIS, Left, Stage 0, Grade 3, ER+/PR+, HER2- Surgery 1/5/2017 Mastectomy: Left, Right; Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Surgery Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/722169",
      "Title": "How Many Nodes? Alli bettysgirl"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "May 9, 2017 06:12PM Alli wrote: Notverybrave- can't believe you are able to post so soon after your surgery! I am so happy for you that you could have immediate pre pec implants. Hope your recovery goes smoothly and pain is well controlled.",
      "MessageIndex": 99,
      "PostDate": "09/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "May 3, 2017 10:57PM Alli wrote: I had bmx followed by direct to implant pre pec implant placement 2 weeks later. So I was off work for a total of 8 weeks which was just right. I'm a Critical Care nurse and didn't want to return to all the hospital germs while I had any open skin issue. It was just right. I was mentally and physically ready. Good luck to you! Alli",
      "MessageIndex": 20,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851880",
      "Title": "Mastectomy Recovery-what's normal Lillady0430 Alli"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Jul 25, 2007 05:56AM Alli wrote:",
      "MessageIndex": 11,
      "PostDate": "25/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/645437",
      "Title": "Anyone's underarm hair growing faster Made Alli"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Jan 13, 2017 12:30PM Alli wrote: I had Lump+rads in 2006. Just Dx with recurrence in same breast and underwent BMX-Nipple and skin sparing on 1/06/17. My PS does above the muscle direct to implant reconstruction usually at the time of the BMX. In my case she chose to wait for 2 weeks after the first surgery to see how my tissue is healing before deciding how to proceed with reconstruction. Went for follow up appt yesterday and she was satisfied with the current condition of my skin. Both nipples are dark purple but did both bleed when she was cleaning them with an antiseptic-so this was a good sign. So, next Friday she will proceed with the direct to implant pre pectoral implant placement (no tissue expanders). Though this situation is not the same as a lift/reduction, the risk of skin necrosis and infection because of prior radiation remains similar. We are cautiously optimistic that things will heal well. Good luck to you all",
      "MessageIndex": 7,
      "PostDate": "13/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851724",
      "Title": "Breast reconstruction after lumpectomy/rads. jenny153 jenny153"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Alli wrote: I had a mammo and mri yesterday for my 2 yr follow up after having left breast cancer.Â  The mri showed 2 areas of enhancement, one linear shaped, and one that looks like a cluster of cysts Â in my good breast.Â  Neither area showed up on mammo.Â  TheÂ cluster appearing oneÂ showed up on ultrasound but the linear area did not.Â  I will be having an ultrasound guided biopsy on the cyst appearing one and mri guided biopsy on the linear one.Â  Anyone with a similar experience? Of course I am fearing the worst but just ready to know what we are dealing with. Alli Dx 11/2/2006, IDC, Left, <1cm, Stage IA, Grade 3, 0/2 nodes, ER+/PR+, HER2- Surgery 11/30/2006 Lumpectomy: Left; Lymph node removal: Sentinel Radiation Therapy 3/1/2007 Whole-breast: Breast Dx 11/8/2016, DCIS, Left, Stage 0, Grade 3, ER+/PR+, HER2- Surgery 1/5/2017 Mastectomy: Left, Right; Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Surgery Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/728223",
      "Title": "MRI shows linear enhancement Alli shabby6485"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Nov 4, 2008 08:37AM Alli wrote: Hi, My sister's results are in and it is Paget's. The next step is to do an MRI or maybe a PET scan.Â  I guess there is a new study evaluating the use of PET scan to look for additional tumors in the breast similar to MRI.Â  She was told that if she were a part of this study, that the PET would be at no charge.Â  She has no health insurance.Â  Now we just cross our fingers and pray for no invasive cancer.Â  Appointments with the team of doctors are in the morning. Alli",
      "MessageIndex": 4,
      "PostDate": "04/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723748",
      "Title": "Anyone with Paget's? Alli zap"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Nov 2, 2008 09:07AM Alli wrote: Ozzie, I am sorry about your recent diagnosis.Â  It does sound like it was caught early which is great. I had DCIS/IDC- stage I and Mom hadÂ multifocal DCIS.Â  We were very fortunate that ours were caught early as well.Â  Hopefully my sis will be as fortunate.Â  The surgeon did say that he would most likely do an MRI.Â  Going through this whole process is so emotionally exhausting with all the waiting between tests etc. Best wishes to you.Â  You are on the hardest part of the journey right now.Â  It does get better once you have your attack plan in place.Â  I'll let you know how things turn out with my sister. Alli",
      "MessageIndex": 2,
      "PostDate": "02/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723748",
      "Title": "Anyone with Paget's? Alli zap"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "May 7, 2017 08:55PM Alli wrote: Adelozier- you WILL see your little one grow up! You are in the absolute worse part of this journey right now. Once you have a plan of attack you will feel such relief. I was in your shoes 11 yrs ago. I was 36 and my son was 9. I was terrified. I remember hiding in the bathroom to talk on the phone because I was worried about scaring him since I couldn't talk about it without crying. I just knew I'd never see him grow up. He is now 20 yo and I'm so proud of him! A second opinion is always a good idea. Bc.org is the best place to gain accurate, up to date information and also a huge support group from those in the same position. Don't get wrapped up with dr. Google or statistics-some of them are way outdated. Deep breath.... educate yourself..... gain all the facts about your cancer.... and kick some cancer butt. You have time to make the decisions that are right for you. Alli ",
      "MessageIndex": 49,
      "PostDate": "07/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/853241",
      "Title": "Enjoying your 30s...and breast cancer! Jsut9802 Ella77"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Nov 8, 2008 11:00AM Alli wrote: We met with the surgeon again about treatment for my Sister's Paget's.Â  They offered too many choices.Â  My sis went in feeling fairly certain that she wanted a bilat. mast.Â  but then it seemed that lumectomy+rads was being pushed on her.Â  I too had a difficult time deciding which surgical option to choose, but I was the first in the family diagnosed, not the third.Â Â  I will support her with whatever she chooses.Â  They have decided that the mammogram and clinical exam are sufficient and did not order an MRI/PET scan. Any words of wisdom to help decide which treatment route to go would be appreciated. Even with negative genetic testing on myself, I cannot help but feel that this family has a pretty high chance of dealing with this beast again.Â  They want to retest me for the BRCA 1/2.Â  Apparently 2-3% of tests are falsely negative.Â  There is a test in clinical study at UNC to help detect the the ones that are missed.Â  I feel that it will also be negative, but maybe it can help with future decision making if by chance it is positive. Â Ozzie, Have you found out more about your treatment plan? Take care, Alli",
      "MessageIndex": 6,
      "PostDate": "08/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723748",
      "Title": "Anyone with Paget's? Alli zap"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Alli wrote: Hi, My sister had a nipple biopsy on Friday for suspected Paget's.Â  She also has new subareolar calcifications but according to the specialists at UNC-Chapel Hill, they do not look suspicious.Â  Has anyone out been diagnosed with just Paget's, without an underlying breast cancer?Â  I am so sick of this disease. It has afflicted 3 of us in the family in less than 2 yrs.Â  Alli Dx 11/2/2006, IDC, Left, <1cm, Stage IA, Grade 3, 0/2 nodes, ER+/PR+, HER2- Surgery 11/30/2006 Lumpectomy: Left; Lymph node removal: Sentinel Radiation Therapy 3/1/2007 Whole-breast: Breast Dx 11/8/2016, DCIS, Left, Stage 0, Grade 3, ER+/PR+, HER2- Surgery 1/5/2017 Mastectomy: Left, Right; Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Surgery Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723748",
      "Title": "Anyone with Paget's? Alli zap"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "May 26, 2009 09:23AM Alli wrote: Mysister had Paget's diagnosed in December.Â  She had an irritated raw area on her nipple that would drain a little.Â  It would become a little less irritated with antibiotic ointment but never went away.Â  She had a mammogram that showed calcifications behind her nipple.Â  She had a punch biopsy on her first surgical visit which diagnosed the Paget's.Â  In the end she had a bilat mastectomy which proved the calcifications to be dcis.Â  I am soÂ thankful for the nipple irritation, otherwise she would have never had the mammogram that I had begged her to get for 2 yrs.Â Â My mother had been diagnosed with bcÂ 3 months earlier and myself 2 yrs before. Please get the biopsy.Â  It is relatively simple and at least you will have the answer and can move on. Best wishes, AlliÂ ",
      "MessageIndex": 18,
      "PostDate": "26/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731956",
      "Title": "Pagets symptoms?? cshamber sadsel"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "May 5, 2017 07:21PM Alli wrote: I have had both types of surgeries. 10 yrs ago at age 36 I had lumpectomy and rads. Ended up with a drain for a week and was out of work 4 weeks after surgery and also during rads. I have had no noticible problems from rads being done on the left side. During the next 10 yrs I underwent increased monitoring with alternating MRI and mammos. I had 4 b9 biopsies. All in all I tolerated the high surveillance well psychologically. After my first diagnosis both my mom and sister were diagnosed with BC. I had a recurrence 10 yrs and 1 month after my first dx. I always knew that I would choose BMX if I had BC again. I have no regrets about keeping my breasts for those additional years and I do miss them but have absolutely no regrets about the aggressive surgery this time around. It is such a personal decision but remember there is no wrong choice. It all boils down to what your comfort level is in regards to frequent monitoring and the possibility of call backs for biopsies. In my case, I was confident that because of increased monitoring, if I had a recurrence that it would be found very early stage which it was. Best wishes to you all struggling with these decisions. You will not make the \"wrong decision\". Many folks are way too free with giving advice that have not had to face these decisions. Remember to take their opinions with a grain of salt and go with your gut after your have received all the facts  ",
      "MessageIndex": 6,
      "PostDate": "05/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854858",
      "Title": "Mastectomy or lumpectomy with radiation? jillybeantabby ML1209"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Mar 5, 2017 09:02PM Alli wrote: sounds like you needed a drain in after this surgery. I have always been one to develop seromas after surgery or drain removal too soon. I think you are smart to wait and see your BS and avoid the germ infested ER. Keep it as clean and dry as you can. I think the Vit C is a good idea too. Avoid aspirin and ibuprofen because of bleeding risk. Hope it clear up soon and things go well tomorrow.",
      "MessageIndex": 3,
      "PostDate": "05/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/853212",
      "Title": "Wound leaking after revision surgery.... groucho2 groucho2"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Mar 13, 2017 07:28PM Alli wrote: bevmomduck- So sorry about the nipple. I'm in the one headlight group too thanks to radiation. Hope you will heal up quickly once the necrotic tissue is gone. Vargadoll- that is one precious baby. Hoping she is home soon. Wishing you all a great week!",
      "MessageIndex": 2714,
      "PostDate": "13/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Mar 15, 2017 09:48PM Alli wrote: Good grief bevmomduck-so sorry about the necrotic US. Hope it will heal up quickly. Radiation does a number on us at the cellular level. Are you going to be doing more hyperbaric oxygen therapy? Glad it seems like the chemo gals are doing well thus far with the second rounds. Hoping it continues. You all are such amazing strong women! Baby Charlee just makes me smile--- I needed that tonite! So happy she's home. I received my knitted knockers finally but too late to use them since I have my implants now. Is there anyone in this group that could use them? I think most of you already have TE so not sure if could you use them. If you know anyone that needs them, please let me know- they are super soft. Hope everyone stays warm and cozy tonite and gets some restful sleep. ",
      "MessageIndex": 2747,
      "PostDate": "15/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Jan 4, 2017 09:26PM Alli wrote: Elem-glad you to hear you are doing well. please go easy on the laundry! Sending positive and healing thoughts to tomorrow's group-Mom4ever, annoyingbood, and Maya15. Fightingirl, got my Hibiclens today too. That's some expensive soap! They use to give it during part of your pre op session, but no more. Jinmo-good luck with your appt tomorrow and gather all the info you can to make a good decision then go with your gut and try not to look back! You will feel much better at that point.",
      "MessageIndex": 214,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Feb 7, 2017 07:35PM Alli wrote: Hi ladies, I do not post very often but have been following everyone's journeys. I have to say that you all are an inspiration to me even though we have never met. There is so much strength and support here from women that really do get it. I have a few friends that have been down this road that can relate but have many more well meaning friends that are way too free giving unsolicited advice and have no clue what this is really like, emotionally and physically. My mom and sister have both defeated BC, so they are huge support to me. Someone a few pages back discussed how difficult it is to accept help. They sounded so much like me. My work family arranged a Meal Train for me. So, every other day someone delivered food to our home. The food was delicious and I really did appreciate it but it stressed me out so bad. I would worry about the messy house, how terrible I looked, and about the dogs jumping all over them. I am usually the one that takes care of everyone else and I like that role much better. The last meal that we got was actually a pizza delivery that a friend sent. That was a great idea I thought. No stress about entertaining the pizza guy, though the dogs did still give him the once over. I wish everyone the best no matter where you are with treatment. I know many of you are still in the waiting phase to find out what's next and I think that's the worst part. I'm a get it done and behind me asap kind of girl. During my first round with BC ten years ago, I did have 33 sessions of rads and took Tamoxifen. I have to say they are both doable. When I first started rads, I thought there is no way in hell I could do that for six weeks but before I knew it, I was done. Rads did have a cumulative effect in regards to fatigue. It was after I finished and went right back to working 12 hr shifts that I realized just how tired I was. So be good to yourself. Nap often! Good luck to all of you recovering from surgery, undergoing reconstruction, and beginning chemo or radiation. I cannot believe we are well into February! What a rollercoaster of emotions January was. Next year at this time, hopefully everyone in this group will have BC in the rear view. Wish we could all meet up in the cabanas! That thought is what kept my anxiety under control going into both of my surgeries! I am one of the fortunate ones that will not be joining the chemo group. BMX revealed a lot of pure DCIS-only. On Jan 20th-2 wks, after BMX, I had direct pre pectoral implant placement. That surgery was way more painful than I had expected. So far my radiated skin is healing ok. My skin was still very swollen and not very pliable apparently so only have smallish implants and will likely have some fat grafting and maybe attempt a larger implant in about 3 months. I believe both of my nipples will survive. So for now I'm done and just recovering and enjoying the beautiful coastal NC weather we have been having before I have to return to work in a couple of weeks. The bills are rolling in and the PTO is running out! Best wishes and hugs to you all! Alli",
      "MessageIndex": 1749,
      "PostDate": "07/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Mar 5, 2017 09:37PM Alli wrote: Bevmomduck- so glad the service went well. 600+ in attendance says a lot about about your brother and how loved he was. Glad the HB oxygen treatments are helping. I wish that I had been offered those since I did end up losing the nipple from the radiation side. Thinking of those having their second round of chemo this week and I think maybe one starting- Shellybeans I think. Also best wishes to the Rads girls and those starting tamoxifen. Hope you all have a great week! I will be starting back to work on Wednesday after 2 months off. I work with some great folks but have really gotten use to my stay at home routine. The weather in eastern NC has been delightful.  ",
      "MessageIndex": 2583,
      "PostDate": "05/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Apr 23, 2017 10:04PM Alli wrote: Glad to see so many of you cruising through treatment. Congrats to pugsmama and 3 bears for getting off the chemo train. What a relief for you all nearly finishing rads and working towards creating a new normal life. I truly believe that we will all be better women for having traveled this journey. I believe I am one of the few that already have my implants. My rads side is very tight and feels shrink wrapped. I will be having fat grafting on 4/27 to hopefuly improve the rads side. She will inject fat all around the rads breast and to both upper poles. The rads boob does have significant rippling. I was told that this was the most painful thing they have done to me yet. I'm hoping the pain is short lived. I will share my experience later this week. Hope all of you lovely ladies have a great week. I will mentally be visiting the cabanas on Thursday. I helped me through the first two surgeries so I'm counting on it again. Much love to you all",
      "MessageIndex": 2944,
      "PostDate": "23/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Apr 24, 2017 08:09PM Alli wrote: Shoregirl- good luck with your surgery tomorrow. So nice to move on to the squishy side. My Ps said the FG procedure was the most painful surgery that I've had yet due to the pain from the donor site (tummy). Not looking forward to it but hope it improves the tightness of the rads side. 3 bears-I love the barn. Varga- A rainy mountain day sounds delightful! ",
      "MessageIndex": 2952,
      "PostDate": "24/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "May 3, 2017 08:30PM Alli wrote: Elem you are so right about the cancer journey. We are forever changed not only physically but psychologically as well no matter what stage we are when diagnosed or treatment required Only those that have traveled this road can fully understand. I don't know what I would have done without BC.org and you ladies. DCBC good luck with your exchange and FG on Friday. Tomorrow is a week since my revision and FG. I am feeling very good. The donor sites and area above my implants is very sore but only taking occas Tylenol during the day. Still take oxycodone at night more to help me sleep than for pain. Have still been a little tired I think from the anesthesia. Today was my first day without a nap since surgery! The compression garment is hot but it does feel more comfortable with it on. My boobs feel so much softer since FG. I actually mowed grass today on riding mower and could feel my boobs bounce a little. (I hope that doesn't hurt anything) It was a nice surprise,before they were just tight and firm. I sure hope the fat stays. Please let us know how it goes. I am hoping it will much easier than your first surgery. 3Bears we live on the NC coast not far from the outer banks and we frequently go boating at Cape Lookout. I hope you have a wonderful time and can celebrate being cancer free though you still have recon ahead of you. The weather has been wonderful and water temp is a lovely 76 degrees Enjoy!  Much love to you all!ðŸ˜˜",
      "MessageIndex": 2995,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Feb 14, 2017 10:21PM Alli wrote: Wow Docmama-You have got to be so proud of him! Sounds like you and hubby have done a fine job raising him. My son is 20yo and I think my BC has affected him significantly. It's not so much what he says but how he has shown so much grown up genuine concern and love and helps me out with the farm chores and also taking care of my aging parents. My dad had a near tragic tractor mishap today and the tractor actually took out the whole back wall of his barn. He was just getting ready to plow his baby girl's garden-me. Thank God he wasn't hurt and my son came right over to help get the mess straightened out. Don't know what I'd do without him. Thinking of you all starting chemo or rads and some of you finishing rads this week. I found rads to be very tiring and it was worse towards the end. Take naps whenever you can. Hang in there to those still waiting on a plan. Good luck to the surgery girls this week-pamela and Bevmom! Remember the Cabanas......the frosty beverages will be waiting for you. Cowboyup-I also have 2 horses and it's amazing how much I've missed mucking stalls! I was at the barn today when my nephew came by to put the horses in the barn for me and it seems that my big boy, Elroy has redeveloped his nasty habit of rushing into the stall like something crazy. He is big enough to really hurt you when he pulls his shenanigans. I can't wait to get back in service to get his manners straightened back out. Horses have always been my therapy when going through tough times, need them now more than ever. Hope you are able to enjoy your horses again soon! I know many of you are having a hard time dealing with the Tamoxifen decision. I took it 10yrs ago after Lump and rads. I stayed on it about 2 years and then went off of it to attempt having another baby. Honestly the only problem I experienced was feeling moody, irritable, and mildy depressed. It may not have been the med at all but rather just the whole BC ordeal. In the end, we did not have another child and I did not resume Tamoxifen as I was supposed to for 3 more years. Now, here I am with a recurrence. Will never know if taking the med for the entire 5 years would have prevented it. Everyone has different experiences. I really did not experience any physical side effects. So, I would suggest you educate yourself but don't read too deeply on side effects and give it a try if your MO suggests it-they will usually give you all the statistics regarding recurrence rates with and without it. For those that had pure DCIS and a BMX-it may not be suggested at all. If you had lump or UMX and are ER/PR+. it will likely be suggested. Shellybeans-you look beautiful. Looks like you have found a great place. Love all you ladies dearly! Sleep well! ",
      "MessageIndex": 2110,
      "PostDate": "14/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Jan 19, 2017 02:32PM Alli wrote: I have been following along everyone's posts and wow, what a journey we have all been on! There are so many unexpected events along the way. Learning to give up some control and rely on others has been so hard for me. I felt so good last weekend after having my drains out, that I really overdid it cooking and trying to clean a little. I developed seromas on both sides. They aren't painful, just annoying. So.... for those with drains still in, don't push too hard to have them removed if your BS is the slightest bit hesitant. And...when you do get them out, take it easy for a few days. I am returning to surgery tomorrow for pre pectoral implant placement. There is a possibility that I will end up with only TE since I am still very sore and swollen. My skin (even the radiated side ) looks good and nipples are coming along Not a pretty sight but they look viable -kinda pink and purple zebra striped. Since I had skin and nipple sparing, the PS doesn't want to wait longer than 2 weeks to start my recon. I sure don't feel ready for another surgery but am just trying to put my total trust in her recommendations. Good news is that I had pure DCIS so chemo is off the table. Good luck to all of you healing from surgery or in the pre surgery phase and to those of you in the midst of decision making regarding your treatment plan. The waiting for the plan to be put into place has always been the hardest for me. To those considering brachytherapy radiation-I had a friend that did this 10 yrs ago and she was totally happy with her treatment and remains cancer free. I had traditional radiation and had to drive 1.5 hrs each way for treatment. It was doable but I was exhausted near the end, probably as much from driving as from the rads. I will be thinking of you all as I'm heading to the cabana tomorrow! Can't wait for that frosty drink (aka Versed)! Alli",
      "MessageIndex": 840,
      "PostDate": "19/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Feb 9, 2017 06:08PM Alli wrote: Docmama-Love the Pipers story! I bet you did think you were getting a great deal! Thinking of you all getting ready to board the chemo train. As a nurse, I would strongly recommend a port for chemo. The medications can be very irritating to the small peripheral veins and even cause tissue damage if the medication leak outside of the vein. Also, most of us are limited to using one arm only for IV sticks/blood draws etc. due to lymph node sampling so that lessens the selection of useable veins for chemo. Port insertion is a simple procedure that can save you a lot of discomfort in the long run. Fightngirl-hope you received good news at the MO appt today ",
      "MessageIndex": 1839,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Jul 11, 2017 09:59PM - edited Jul 12, 2017 08:44PM by Alli DCIS in AZ- what follow up scans are you having done? I felt a little lost last week at my MO when she told me they would not be doing any x ray imaging to look for local recurrence since I had bmx and \"pnly DCIS\" She also said that the only thing they would be monitoring are my labs that could show any signs of metastasis. I have had an MRI or mammogram every 6 months for the past 10 years. Though it was inconvenient, it did give me a sense of comfort knowing that a recurrence would be found early. Are any of you that had bmx for DCIS and recon havIng any X-ray imaging to assess for recurrence ? I'm not comfortable waiting for lab work to reveal mets. On another note, I am so happy for you awesome brave ladies nearing the end of treatment, having exchanges, and moving on to a new normal life. Wewill all be stronger and forever changed from this experience. My plan is undergo one more FG procedure in September. My foobs are kinda quirky looking but look ok under clothes or a swimsuit. I really miss having sensation in breast. All I get now is a weird itch that you can't feel when you scratch it.... ðŸ˜ Wishing you all the best! Alli",
      "MessageIndex": 3147,
      "PostDate": "11/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Dec 22, 2016 09:27PM Alli wrote:  Having Nipple sparing BMX on Jan 6th. Will have second surgery Jan 20th to begin reconstruction if my previously radiated side appears to be healing ok. Looks like our group is going to be a fairly large one. Best wishes to you all Alli",
      "MessageIndex": 17,
      "PostDate": "22/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Jan 5, 2017 10:32PM Alli wrote: Glad to hear that the Jan surgery girls that have checked in are doing well thus far. It settles my nerves a bit. Have to arrive at 6:30 at the hospital so I'm first case of the day. I had a very brief booby pitty party tonight but then reminded myself that they have turned on me twice now and I'm not giving them another chance. Good luck to you all going into surgery tomorrow. I think I'm going to borrow the beach bungalow happy thought as I roll into the OR :) Best wishes to all! ",
      "MessageIndex": 254,
      "PostDate": "05/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Jan 11, 2017 01:15PM - edited Jan 11, 2017 01:16PM by Alli",
      "MessageIndex": 474,
      "PostDate": "11/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Jan 15, 2017 08:40PM Alli wrote: DCIS inAZ- I am so sorry for your the loss of your sweet furry friend so suddenly. I am glad you were there with him. My girls have been such a comfort to me during this ordeal and the many sleepless nights in the recliner. I cannot not imagine dealing with BC and losing such an important part of the family. Glad you have the new puppy which I hope will help lessen the pain slightly. Annoyingboob-Many surgeons are doing pre pectoral direct to implant placement at the same time of nipple/skin sparing BMX with very good results cosmetically and with less pain and healing time. It is a fairly newer procedure so not widely available but def worth looking into. I ended up having a 2 week delay between my NS BMX and direct to implant placement due to having previous radiation 10 yrs ago. The rationale for waiting between the surgeries was to see if my previously radiated skin would heal well enough to tolerate an implant. So far things appear to be healing well and I will have the implant surgery on 1/20. My nipples are not in great shape but the PS seems to think they will survive. The remaining skin looks great. PM me if you'd like any more info. Welcome to all of the newcomers. I'm sorry that you have had to join us but you will find so much support here to get you through this. I know that many of you have received pathology results after surgery that were worse than what was expected pre op. I am so sorry that you now once again find yourselves waiting for consultations and answers to help make additional treatment choices. You are a strong bunch and will no doubt get through this and do everything you can to avoid this crap ever again. Hope you all have a good week and best wishes to all of those with upcoming surgeries. When fear and anxiety creep in...go to the bungalows! ",
      "MessageIndex": 703,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Feb 10, 2017 11:31AM Alli wrote: First concert was .38 Special/Foreigner/Reo Speedwagon-it was great! Hubby and I are big fans of KISS -have seen them 3 times, it's a great show but prob wouldn't want to see them without makeup. Also love Def Leppard and Journey-they don't music like that anymore! I was born in 1970 also. My son is 20 and I have a grandog-a Beagledor named Hope. Fightingirl-so happy chemo is not in your future! You chemo girls are so strong! I realize how much more intense my treatment could have been and feel so fortunate to have avoided chemo but a little guilty at the same time. Will be cheering you all on while you kick some cancer butt! DCISin AZ-Did you have direct implant placement at time of BMX? I had mine 2 weeks after. Happy Friday to all!",
      "MessageIndex": 1897,
      "PostDate": "10/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Feb 10, 2017 02:33PM Alli wrote: Pugsmama-Love the hairdo-You're so pretty! As for drains...My BS rule was less than 30 cc/day for 2 days in a row. I developed seromas after each drain removal but never really drained much while they were in. Drains are the pits. I just got home from Lowe's Foods. Wish I had thought about the online grocery shopping. $4.95 is a bargain. My foobs feel so tight after pushing that full cart around. First real groceries I've bought in over a month! My PS has me on a 5# weight restriction for a month. I know I overdid it shopping. DCISinAZ- How is your implant side doing? Did you have nipple sparing? I sort of wishing I had taken it a little slower and gone the TE route. My implants are small and my radiation side is so tight. I think I will end up losing about half of the nipple on that side. I too had a soft spot and when I pushed on it I could hear sloshing up above it. The sloshing is gone but the area remains softer than the rest. Never in the world did I think I would be discussing my nipples with so many people!",
      "MessageIndex": 1910,
      "PostDate": "10/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Feb 22, 2017 06:40PM Alli wrote: Bevmomduck- So sorry about your brother. You and your family are in my thoughts and prayers tonight.",
      "MessageIndex": 2318,
      "PostDate": "22/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Apr 27, 2017 06:45PM - edited Apr 27, 2017 06:52PM by Alli Shoregirl-so glad that surgery is behind you. Stay ahead of the pain. I just got home from fat grafting/ revision and visiting the cabana. I was prepared for the pain to be awful but so far it is so much easier than my BMX or implant placement. I think the PS injected the long acting lidocaine because my abdomen feels numb. I do have some pain around my implants- I guess where the fat was injected. Have to wear compression wrap to abdomen for 3 weeks and back in surgical bra for 2 weeks 24 hrs a day. Will keep you posted. I expect to be sore tomorrow. Good night to all you amazing ladies!",
      "MessageIndex": 2972,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Jan 3, 2017 03:04PM Alli wrote: Hi Jan surgery Ladies, Reality has finally set in. Just received the phone call regarding my surgery this Friday. Looks like I'm the first case of the day so that means I will have to leave the evening before since it is a 3 hr drive. I was really hoping to spend the night before surgery at home with my furry kids since they bring me so much comfort. My son will move back in for couple of nights to care for the pups. I do dread the surgery and recovery so much but realize that this is my only sensible option. At the time of my first diagnosis 10 years ago, I chose lumpectomy and radiation. I have no regrets about that decision. At that time I had no family history but since then, both my Mom and sister were diagnosed. I knew that if I ever had a recurrence, that I would have a BMX. I am very comfortable with that decision but I will miss my breasts. I am glad that I was able to have them for those 10 years between cancers. It's not like they get much attention, but I have always enjoyed having them for those brief moments when they were getting attention. It's hard to get the hubby to say much about it, but I feel like he will miss them too. I have been off work this week and nesting big time. Wish my house were this clean without having to deal with cancer. Made the Walmart run today. Getting the hair touched up tomorrow and had my pedicure and wax last Friday. Nerves are kicking in. Hope it's ok to have a glass of wine (or two) this close to surgery. Apparently my friends from work are setting up a \"meal train\" for me. It's a phone app-go figure. I thought that was a neat gesture. For those of you starting our group out tomorrow, I wish you peace and comfort. Please keep us posted on your recovery. I will be glad when we are all on the other side of this journey!",
      "MessageIndex": 172,
      "PostDate": "03/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Jan 8, 2017 12:05AM Alli wrote: My NS bmx went well yesterday. I can honestly say that the anxiety and anticipation pre op was far worse than the surgical experience itself. I do not remember anything in between receiving Versed and waking up in my hospital bed ..... Except rambling on about the beach bungalow and a frosty beverage as they were attempting to put the anesthesia mask on my face. I'm afraid that I probably babbled on and said something embarrassing. Hopefully the staff had a good laugh. I have had significant discomfort. Maybe my pain tolerance isn't what I thought it was. We were nearly snowed in at the hospital and got discharged just in time before the weather was too bad. Hope all of you brave ladies are feeling relief from the cancer anxiety and physical relief with the pain meds. For those with upcoming surgery dates, please know you will get through this and feel so much peace on the other side of surgery. Go to the bungalow.....it was a great distraction. Hugs to all. Good night       ",
      "MessageIndex": 311,
      "PostDate": "08/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "Alli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41885/profile",
      "Content": "Jan 11, 2017 12:38PM Alli wrote: Hi Girls, It is good to hear that for the most part, everyone is doing well. Waiting for pathology results is one of the most anxiety producing parts of this process. I believe it is as bad as the couple of days just prior to surgery. I am the kind of person that just wants to know....good or bad so that I can move on to plan B. I am expecting my results tomorrow. To those that have just joined us, I am sorry you are here but you will receive a ton of support from some really great and funny girls. It amazes me how much post op protocols vary among physicians. My BS has me in a compression bra but does allow me to shower with the drains in. The drains are covered with an occlusive Tegaderm dressing and the incision has steri strips. There is a blister on my left side that is covered with Dermabond skin glue-for the life of me, I cannot remember how the doctor said that happened. I hope that my PS is ok with what my BS has had me doing. I will meet with them both tomorrow. I had skin and nipple sparing BMX and it is not a pretty sight. I am hoping that weeks down the road that I will be happy with my choice. Both nipples are very dark purple... lefty is worse (had previous radiation) and I'm not sure she is going to survive this. The plan is to return to surgery on 1/20 and have direct to implant placement above the muscle if all of my tissue looks viable. I cannot imagine going back in to surgery so soon as my chest is still very taught and swollen not to mention sore. Docmama- So sorry about the illness spreading through your family. I hope you continue to stay well. I cannot imagine heaving and vomiting with a chest this sore. I hate that your family is having to deal with all of the BC issues. The first time I was diagnosed, I was 36yo and one of the first things my MO did was send me to a genetics counselor and order BRCA testing. At that time, my only family history was a paternal aunt. We were considering having another child so I had gone in for a physical. Luckily my very thorough FNP sent me for a baseline mammo which found my early stage BC. I still get emotional when I think about what would have happened without her. I would have gotten pregnant and my BC probably would have gone undetected until it was far advanced. Since my BRCA was negative, I opted for Lump+rads and have not regretted that decision. However, 2 yrs after my first diagnosis, both my mom and sister were diagnosed (both early stage). I always knew that if I ever had a recurrence, that I would opt for more aggressive surgery. I was diagnosed this time 10 yrs and 6 days from the first time So, my family is considered to have a \"familial\" cancer. We are in a study at UNC-Chapel Hill that is developing testing for other BC genes. It may not affect my generation but hopefully by the time my son is having children, we will have knowledge that would potentially affect medical decision making for his family. The cancer genetics counselors are so freaking smart- I hope they can help sort things out for your family. Wishing you all a good day! I will be hoping for good reports for everyone waiting for results and comfort to every one during your recovery. I will forever laugh when I think of the bungalow. My surgical team was probably so glad to put out that cuckoo lady that wouldn't shut up about that bungalow and fruity beverage. When the anxiety creeps in-head for the bungalow!",
      "MessageIndex": 472,
      "PostDate": "11/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    }
  ]
}