{
  "AuthorID": "allmylove",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123322/profile",
  "Posts": [
    {
      "AuthorID": "allmylove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123322/profile",
      "Content": "Apr 8, 2011 03:53PM allmylove wrote: poptart - I've been translating everything multiple times to my mom but honestly she only understood half of it and my mom sort of has a happy-go-lucky personality. So instead of making a decision she's kind of just  like \"I'll do whatever everyone else thinks is best.\" I've yelled at her for it and told her she has to decide for herself because it's too big of a responsibility on me.. but since I am home and I am much more educated than her, I feel like I really should help her to make the decision. I've done cancer research for 3 years as an undergraduate student at Hopkins so I think because of all that she's relying on me a lot. Another thing is that even though the surgeon and radiation oncologist both only speak English, the two oncologists I found speak her language. So yea even though the oncologists talked to her personally she's still not really deciding on her own.. ugh.. pj123 - she's 100% ER and PR positive - so yea that's good news. I think she's in good health and she's relatively young so I do think that chemo won't do her in. However, you're right in saying that since it's been 5 weeks I do want her to just make a decision and stick with it. She has to start treatment soon and personally I think the sooner the better. I just called the oncologist and they're sending another tissue sample in for oncotype.. but that's going to take another 2 weeks. I think waiting 2 more weeks is kind of ridiculous.. We should just decide on it and move on.  Thanks for all the warm comments everyone, please keep them coming. What were your oncotype scores and what did you decide on doing? ",
      "MessageIndex": 4,
      "PostDate": "08/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/767242",
      "Title": "Failed oncotype - chemo or no chemo? allmylove NormaJean65"
    },
    {
      "AuthorID": "allmylove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123322/profile",
      "Content": "Apr 9, 2011 07:29PM allmylove wrote: thanks for the comments again there was no ki67 score on the pathology report.. nor biopsy report and i pretty much have both memorized is there a catagory that mentions angiolymphatic invasion? as in do they mention it and then write yes or no or is it only mentioned on the report if they find invasion?  the only \"bad\" thing about her report is the tumor grade, which is 3 (8/9). that would be the only reason why they'd put her on chemo. the chemo would be TCx4 like i mentioned earlier. my dilemma is that if i sway her into getting it, i think the biggest reason is because i want her to do everything she can and live longer. that's very selfish and i won't be suffering from the side effects, she will. but if i tell her not to get chemo, what if it comes back? I don't know if i can live with that either.. i think i'm just stuck ",
      "MessageIndex": 7,
      "PostDate": "09/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/767242",
      "Title": "Failed oncotype - chemo or no chemo? allmylove NormaJean65"
    },
    {
      "AuthorID": "allmylove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123322/profile",
      "Content": "allmylove wrote: Dear all: I just skimmed through the thread about intermediate oncotype scores. I wanted to post directly in there but I'm hoping I'd get more responses from starting a new topic. I've been pretty much making a lot, if not all of the decisions on treatments for my mom because she doesn't speak English. She's relying on me a lot, which I don't mind but I feel really pressued to make the RIGHT decision, even though honestly nobody knows what exactly is right. So here's what I'd love some advice on - my mom has IDC, stage 1, tumor size .5cm, grade 3, 0 nodes, ER+/PR+ Her2- (54 yrs old). I've been waiting on the oncotype result to decide whether or not she should get 4 cycles of TC. We've seen 2 oncologists and both of them were 50/50 on chemo. So I was going to make the decision based on oncotype. The problem is that the result came out as something like \"failure to perform\". Honestly that really pissed me off.. I mean I waited 2 weeks and there's no result.. apparently the test can fail if the tissue sample the lab sent in isn't big enough. The pathology lab said yesterday they'll send in more samples hoping they can redo the test - but it may still come back as failure. I don't know what I should do. Because she's only stage 1, it's ok that she doesn't get chemo, however, her tumor grade is 3 which means most likely her oncotype score won't be low. One of the oncologists thinks that it'll probably be intermediate or very low-high. Which means we still have to decide on our own whether or not she should get chemo. I just think that it's been 5 weeks since her surgery and I'd really like her to start radiation as soon as possible. I don't think waiting 2 weeks for the results is a good idea. She's not even taking any AIs right now. Does anyone know anything else I can base this decision on? I feel like logically I should tell her not to get chemo because the benefit doesn't necessarily outweighs the risk/suffering. But emotionally I want my mother to live forever and get all the treatments she can, even though it's a very selfish thought to have.  If anyone can chime in on your decisions or any information, I'd really appreciate it allmylove and best wishes to you all Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/767242",
      "Title": "Failed oncotype - chemo or no chemo? allmylove NormaJean65"
    },
    {
      "AuthorID": "allmylove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123322/profile",
      "Content": "Apr 11, 2011 11:56AM allmylove wrote: NormaJean65: I knew the test goes up to 100% but I didn't think people actually get that score.. and here I see people feeling crappy over a 20 something score.. Like the previous person said, try not to let that score run your life. Like the previous person said, even people with low scores can still have recurrances. Nothing is a gurantee and the test is really a decision factor for chemo treatment. So think about the fact that you've done all that you can do fight this disease and move on to happier thoughts like the fact that it's stage 1, your nodes are clean. I don't think you should \"give up\" but knowing that you've done everything you can isn't exactly a bad thought.and CA27.29 does fluctuate a little bit so don't let that scare you either. Perhaps you should consider getting a second opinion or just switching to a different oncologist that makes you feel better.. best wishes, allmylove",
      "MessageIndex": 12,
      "PostDate": "11/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/767242",
      "Title": "Failed oncotype - chemo or no chemo? allmylove NormaJean65"
    },
    {
      "AuthorID": "allmylove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123322/profile",
      "Content": "Apr 18, 2011 12:54AM - edited Apr 18, 2011 12:59AM by allmylove I think that while the oncotype \"recurrance\" score matters, the more important part of it is predictability of how much chemo will benefit the specific person. I think some of you are confused with the whole recurrance rate and hormone drugs.. so basically you should think about recurrance for oncotype score as distance or systematic recurrance, which means having cancer elsewhere - this is what chemo is for. sometimes surgery misses cancer cells in the breast or in the blood, and since chemo is given in the blood stream, it'll attack the cancer cells escaped from surgery. this is also how people get distance recurrances and metastatic cancer - where the cancer has traveled elsewhere. for local recurrances radiation or mastectomy takes care of that. note - not that chemo doesnt also help with local recurrances, but its mainly for distance. chemo just covers a wider area since you're getting it everywhere the blood travels the difference between tamoxifen and arimidex isnt even worth the discussion - usually premenopausal women takes tamoxifen and postmenopausal takes arimidex. if you're ER positive, which you should be to get the oncotype dx test, you'll most likely take either or.  so edwards750: your test score is still valid just because you took arimidex instead of tamoxifen, dont worry  i hope im explaining things well - feel free to ask me specific questions again or i guess you can just ask oncologists for more professional answers =)",
      "MessageIndex": 95,
      "PostDate": "18/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763815",
      "Title": "Anyone with an intermediate oncotype? Lovelillian nem126"
    }
  ]
}