{
  "AuthorID": "allurbadday…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
  "Posts": [
    {
      "AuthorID": "allurbadday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
      "Content": "Dec 25, 2012 04:48PM allurbaddayswillend wrote: Add me to the list of breast radiation patients who get nausea from it even if their ROs say they won't. It's not too bad but it is pronounced for a couple hours after the rad treatment and then fades until the next day. I am also on tamoxifen and have been taking it at night, about 7 hours after radiation. the nausea corresponds more directly to the radiation but I bet being on tamoxifen doesn't help my body deal with the nausea better.",
      "MessageIndex": 5,
      "PostDate": "25/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/792145",
      "Title": "radiation and nausea gracie1125 jennsmc"
    },
    {
      "AuthorID": "allurbadday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
      "Content": "Jun 22, 2012 06:51AM allurbaddayswillend wrote: Thank you for the links. I'll spend some time on that site - there's great stuff there. My nadir is also 10 days so I find it hard to imagine I'm getting a lower dose at three weeks than a patient at two weeks. I'll just have to ask my MO.",
      "MessageIndex": 2,
      "PostDate": "22/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/789481",
      "Title": "AC every two weeks or three weeks? allurbaddayswillend ruthbru"
    },
    {
      "AuthorID": "allurbadday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
      "Content": "Jul 4, 2012 10:40AM allurbaddayswillend wrote: ok, this morning after I went outside to brush off all the little bits of hair from me me and my clothes, I went back to my bathroom and slathered Scalpicin all over my itchy nearly bald noggin. aaaaah! soothing relief. Last night I noticed when I was itching it I was getting a lot of skin and bits under my fingernails - I should have just used the sctuff then. My scalp is currently comfy without the scarf and I'm thinking the Scalipicin will help with my tendency to ingrown hairs and such.",
      "MessageIndex": 16333,
      "PostDate": "04/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "allurbadday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
      "Content": "Jul 1, 2012 08:17PM allurbaddayswillend wrote:",
      "MessageIndex": 16242,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "allurbadday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
      "Content": "Jul 2, 2012 09:26AM allurbaddayswillend wrote: Gemmie, I'm in the same boat: I buzzed it down the other day but so much is still falling out and it's itchy and getting in my computer keyboard and everything else. It's almost as bad as my husky mutt shedding her winter coat! SO I put a scarf on my head a few minutes ago and it actually feels a bit better to have that little bit of pressure on my head plus it'll contain the bits of hair until I go outside, take it off and shake it out. I like Billiemae and other's advice, I will probably ask my husband to help me shave it tonight or tomorrow. You in?",
      "MessageIndex": 16264,
      "PostDate": "02/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "allurbadday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
      "Content": "Jul 2, 2012 10:11AM - edited Jul 2, 2012 10:15AM by allurbaddayswillend VVH, Have you tried the scalpicin yet? If that's not helping, there are other products that have more salicylic acid in them or lactic acid (in 12% concentrations like AmLactin) that can help loosen up surface cells that might be blocking follicles or pores. If you go up in concentration or try the amlactin, always be careful to test a little (1 sq cm)  patch somewhere and wait a day or two so you don't irritate your whole scalp. and as jpmom says, seeing a dermatologist could be good as s/he could prescribe something most appropriate for you and your skin. (I already have my dermatology appt scheduled for next January, should be post-radiation and all. I expect I will need some help.) auntienance, now that you mention it, I too have a good dent on the top right side of my head and some ridges in the back. It will be fine if I looked like a Star Trek alien or something but if it's just weird, I may not be so enthusiastic about the dome look. we shall see...",
      "MessageIndex": 16269,
      "PostDate": "02/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "allurbadday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
      "Content": "Jun 30, 2012 08:46AM allurbaddayswillend wrote: Hi everyone, I googled /buff head wrap\\ and I got many different sites. Do you all have some particular recommends? I only ask because I have a limit on my internet usage (rural satellite connection) & it would help me to narrow down my choices a bit. Thanks!",
      "MessageIndex": 16207,
      "PostDate": "30/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "allurbadday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
      "Content": "Jul 3, 2012 09:39PM allurbaddayswillend wrote: Gemmie, I buzzed it with a shorter attachement on the clippers this morning and took the photo that's now my avatar. My head is still very itchy though. I tried to go topless but that was worse than having the pressure of a scarf on even in the heat so I put it back on. I hope the BGC went ok today and you're not feelin to crummy. jpmom, I've started using eyeliner again and won't go without colored lip gloss. I don't use foundation, rarely powder but I definitely feel the need to accentuate other features and be \"girly\" too. I hope you sleep well tonight. I got a prescription for a \"brain off at bedtime\" pill early on too. I hope everyone's doing well in the heat!",
      "MessageIndex": 16326,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "allurbadday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
      "Content": "Jul 6, 2012 09:18PM allurbaddayswillend wrote: oooookayyyyy, jp, onvacation, and TheDivineMrsM have obviously been abducted by aliens at some point and returned to us. (cue X-files theme...) Ossa, your hair is beautiful! and so are you! I'm a redhead too but I don't have those pretty blue eyes. :)",
      "MessageIndex": 16386,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "allurbadday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
      "Content": "Jul 1, 2012 02:35PM allurbaddayswillend wrote:",
      "MessageIndex": 16233,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "allurbadday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152612/profile",
      "Content": "Sep 12, 2012 12:14PM allurbaddayswillend wrote: melmcbee - I know it's been a few days but I saw your post about scalp discomfort. I have had that off and on too, especially when it was first falling out. There have been a few other times when I've had the same feeling but not quite as strong as 14 days after my first AC. I switched to using the same cleanser and lotion on my scalp that I use on my face. It has a little peppermint in it so it's kind of soothing but it also doesn't dry it too much which seemed to be part of my problem. I use Dr. Woods facial cleanser (not Dr. Bronner's, Dr. Woods) and California Baby Sensitive Everyday lotion. The cleanser and lotion combo also seems to help prevent peeling which I was getting a bit of on my scalp - nothing too intense but definitely some skin cells were coming off.",
      "MessageIndex": 17489,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    }
  ]
}