{
  "AuthorID": "ALLYSONPTL",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164982/profile",
  "Posts": [
    {
      "AuthorID": "ALLYSONPTL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164982/profile",
      "Content": "Nov 26, 2012 05:19PM ALLYSONPTL wrote: I start chemo Friday, so I'm not sure if I'd fit into the Nov. or Dec. group, but I'll try both for now.  I'll be getting TCH through my port.  I am nervous about how tired I'll feel and the joint pain and mouth sores.  I also go on Saturday for a shot of Neulesta?  My doctor's office has not said anything about a chemo class, but I know I have to be there at 9am and chemo does not start until 11am, so maybe they just didn't mention the scheduled activities.  Since people seem to have different responses to the same chemo drugs, it's hard to prepare.  I need to continue working, but am concerned I won't be able to keep up or do as well as my normal quality of work.  Anyone else working during chemo?  I was told I'd have six cycles, then we'll see how the tumor responded. I pray for everyone who is struggling with this cancer and I'm glad we have a place to talk, vent, and gain support. :)",
      "MessageIndex": 653,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "ALLYSONPTL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164982/profile",
      "Content": "Nov 30, 2012 11:06PM ALLYSONPTL wrote: I had my first cycle of CTH chemo today. I was prepared for many different side effects and intesities to start appearing this afternoon, after the treatment, But...so far, I feel great! Thank God!  I guess I'm wondering if I should be waiting for \"the other shoe to drop\" ?  Will the side effects really hit after the Neulasta injection tomorrow?  I'm glad today is a good day, but I want to keep those good days.  Any thoughts, advice? Thanks.",
      "MessageIndex": 813,
      "PostDate": "30/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    }
  ]
}