{
  "AuthorID": "AlwaysAnxious",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149109/profile",
  "Posts": [
    {
      "AuthorID": "AlwaysAnxious",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149109/profile",
      "Content": "AlwaysAnxious wrote: Am awaiting a biopsy which won't be in till next Friday at the earliest.  Not sleeping and not coping well.  Went to a walk-in clinic today to explain situation and was given 1 Ativan 1 mg. a day to take.  Just wondering when you think that should be taken to get maximum result.  Am looking to feel calmer during the day and to be able to focus.  Lost my car on the Wal-Mart parking lot today, for example!!!  When taking Ativan during the day, how long does the tranqulizing feeling last?  Thanks.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787000",
      "Title": "Ativan - when to take it?? AlwaysAnxious CoolBreeze"
    },
    {
      "AuthorID": "AlwaysAnxious",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149109/profile",
      "Content": "AlwaysAnxious wrote:  Must start off by apologizing for the length of this post. I had a complex cyst aspirated due to my request. They wanted to put me on a 6 month re-check with mammogram and ultrasound but I'm a worrier. Anyhow, the radiologist also took a sample of breast tissue right next to the cyst which did collapse when aspirated. I took it that it was standard procedure to take a sample next to the cyst. Anyhow, I went to get my results today and it appears the cyst was fine. However, the tissue next to the cyst showed atypical cells. The pathologist suggested core biopsy of tissue in that area. The family doctor who I spoke to at the 'breast clinic' said she wasn't sure if they could get tissue in that area since the cyst was gone and she was pushing me to wait for the 6 month mammogram/ultrasound which I was originally scheduled for. She also told me that atypical cells in the breast were very common. I said that I wasn't comfortable with that and she finally offered to bring the report to the radiologist to get his opinion  Just wanted to add that I went back to hospital this afternoon and picked up the FNA Pathology report.  \"One of the smears is moderately cellular containing stromal fragments as well as multiple predominantly small and choesive aggregates of ductal epithelial cells.  These do show a mild degree of cytological atypica with modest nuclear pleomorphism and occasional prominent nucleoli but with dispersed chromatin and no obvious mitotic activity.  They have also scheduled me for an ultrasound of the breast on May 3rd based on radiiologist's review. One final question:  Even if the ultrasound comes out fine, would you insist on an MRI as a final diagnostic tool to make sure the whole breast has been examined as much as it could be?  Would still appreciate anyone's thoughts on this pathology report.   Anyhow, you are the ladies who always seem full of information. I'd especially like to know if the finding of atypical cells is very common and would you be quite worried about it.   If the radiologist says we can do core biopsies, I will certainly do it. This 'cyst' has been going on since January and I am truly going 'nuts' with it. I was so hoping that today would be the end of it but it seems that another 'can of worms' has been opened up for me. The anxiety is really getting to me. I've been researching but don't understand most of it. . Thanks for listening and looking forward to your replies!!!!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786395",
      "Title": "atypical cells found next to complex cyst AlwaysAnxious marie5890"
    }
  ]
}