{
  "AuthorID": "AlyssaRN4",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271810/profile",
  "Posts": [
    {
      "AuthorID": "AlyssaRN4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271810/profile",
      "Content": "Apr 4, 2018 10:09AM AlyssaRN4 wrote: Thank you so much Bringmesomewine! Yes it’s so hard to wait. Now that it’s long enough since the biopsy hat the results could potentially be ready it’s even more stressful somehow! It’s all I’m thinking about. I’m so sorry to hear you are going through something similar. Sending good vibes your way and hoping for benign results for you!",
      "MessageIndex": 3,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/863695",
      "Title": "Waiting on Biopsy Result AlyssaRN4 mommakat"
    },
    {
      "AuthorID": "AlyssaRN4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271810/profile",
      "Content": "Apr 7, 2018 04:58AM AlyssaRN4 wrote: I just got the pathology for the lump yesterday and it’s benign!! Fibroadenoma. I’m still waiting to hear the cytology on the cyst but I expect that will be fine. I haven’t talked yet to my Dr about the plan now. Occasionally they still would like you to remove it, otherwise usually 3-6 month follow up testing initially is the norm. Thinking of you Emma wishing you the same outcome Bringmesomewine!",
      "MessageIndex": 6,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/863695",
      "Title": "Waiting on Biopsy Result AlyssaRN4 mommakat"
    },
    {
      "AuthorID": "AlyssaRN4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271810/profile",
      "Content": "AlyssaRN4 wrote: Hello All! I’m a first time poster and I guess I’m just looking for support as I wait for my biopsy results. I’m 38, an RN and School Nurse, wife, and mom of 2 beautiful girls. I found a lumpy area in my left breast and went for an exam with my Gyno. I had not yet had a mammo but have very dense , fibrous, breasts. He said to be safe go for a diagnostic mammo and ultrasound but expected them to be negative. Well, 2 cysts were seen with a dense area of concern above one of the cysts that the Radiologist strongly suggested be biopsied because it’s “suspicious, and abnormal”. Ended up with a BIRAD of 4a which usually indicates suspicious but a 0-30 percent chance of cancer. Went for an ultrasound guided core biopsy (4 sections) 4 days ago. One cyst was aspirated with bloody fluid (hemmorhagic) and the other was left alone. When I finally was able to speak with my gyno after the procedure, I asked his opinion on cancer and he said “You are young so your chance of cancer is low but there is a suspicious area and if you told me you didn’t want a biopsy I would have said that I STRONGLY suggest it.” Feeling nervous as the results are closer to coming. Anyone else with 4a or young etcwant to share a good or bad result of their biopsy? I’m not afraid of negative information I just want to get as much knowledge as I can... that’s keeping me sane haha. Thanks in advance for your posts!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/863695",
      "Title": "Waiting on Biopsy Result AlyssaRN4 mommakat"
    }
  ]
}