{
  "AuthorID": "AmandaJeanette",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255971/profile",
  "Posts": [
    {
      "AuthorID": "AmandaJeanette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255971/profile",
      "Content": "AmandaJeanette wrote: Hello! I am hoping to get some insight on what my doctors believes to be a hematoma under my skin, although I have not yet been in for my follow up after a core biopsy. Right where the biopsy was taken from I have a painful lump with some mild yellow and purple bruising...nothing that I would consider horrible. It has gotten way better however the lump still persists. I have been trying to do some research and wanted to know if it is still possible that this is in fact a hematoma even with minimal bruising? The lump is still hard and painful, especially to the touch. I often do not even like to sleep without a bra on. This has has thrown me in a loop and has me panicking. I have also tried warm compresses as I read it helps to dissipate the blood but it doesn't seem to be helping any. Also has anybody else had this issue? If so how long did it take for it to completely heal and did you have apt of bruising or only minimal? If it was not a hematoma, what was it! Please help ease my worry. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857403",
      "Title": "Hematoma after core biopsy AmandaJeanette MTwoman"
    },
    {
      "AuthorID": "AmandaJeanette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255971/profile",
      "Content": "AmandaJeanette wrote: Hello All, About a week and a half ago I had a stereotactic core biopsy done on a small nodule believed to be a fibroadenoma in my breast. I am so thankful and relived to say that it came back benign! I have not had many problems after the biopsy and thought recovery was going very well until I noticed a decent size lump, located at the exact site where the biopsy was taken from. I am beyond freaking out and am wondering what this could be from. I know that scar tissues will most likely be a result of the biopsy but this seems different. Needless to say I am freaking out quite a bit. Of course it is the weekend so I am unable to call my doctor, I will be calling on Monday, but I was looking for some insight to what this may be. Directly where the lump is there is bruising, yellow and purple, but it does not look like there is any sign of infection. The bump is definitely a little sore infrequently and to the touch. Has anyone had this experience before and if so what is happening?? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857256",
      "Title": "Lump after stereotactic core biopsy AmandaJeanette Silbar"
    }
  ]
}