{
  "AuthorID": "amandapanda…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124693/profile",
  "Posts": [
    {
      "AuthorID": "amandapanda…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124693/profile",
      "Content": "Mar 5, 2011 04:44PM amandapanda wrote:  leaf: thats alot of crossing  it worked back in elementary school for me when i wanted a snow day! It can still work now. Thanks! I love the Boringly Benign. I will gladly take it! carpediem1965: I will definitely try that. No dreams last night (phew!) However i am still bleeding and I have been having lots of pain under my armpit after biopsy which was three days ago...whoa THREE DAYS ALREADY? Yes! I have my fiance constantly replenishing ice packs to put under my arm, even thought the cores were taken near the center of my chest. Not stressin'!  About the dreams you have with your husband, I will keep your family in my thoughts and pray for a speedy safe return of your husband! What your'e going through is tough, but your are here on this site offering advice to ladies and giving them hope, for that I thank you and send all the blessings back to you in return! ",
      "MessageIndex": 8,
      "PostDate": "05/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/765696",
      "Title": "Patience and Worrying: Clash of the Titans! amandapanda SarahsMom"
    },
    {
      "AuthorID": "amandapanda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124693/profile",
      "Content": "amandapanda wrote: Ever since I began this whole breast scare ordeal in October, I have been doing extensive research on EVERY possible diagnoses this little thing thats hanging out in my breast could be. One thing I have been seeing over and over again is that ladies in my age group (20's) keep getting told they are too young. However, I haven't been told that, ever since the mass came back as abnormal on an ultrasound. Makes me wonder...and worry. Are doctors seeing something concerning? I have a \"Multilobular nodule,(2.31cm long) on right breast with FINDINGS NOT CONSIDERED BENIGN BY ULTRASOUND\".  I even got a second opinion and was still a Bi-Rads 4. What does that mean?!  I was given a Bi-Rads 4 because it is irregular in shape with some angular margins branching out...and went in for my biopsy yesterday.  Time to play the waiting game now.  Can anyone offer any advice on what the radiologist meant, by 'not considered benign by ultrasound?' I am trying to be as patient as a 22 year old who could possibly have cancer could be  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/765696",
      "Title": "Patience and Worrying: Clash of the Titans! amandapanda SarahsMom"
    },
    {
      "AuthorID": "amandapanda…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124693/profile",
      "Content": "Mar 3, 2011 08:12PM amandapanda wrote: Thank you very much!  i have been a secret groupie of this website for quite some time...glad to feel welcomed here   I asked the radiologist for a copy of my sonogram..as a souvenir. She gladly printed one out for me and I said \"thank you. it looks like a breast baby sonogram :-)\" I am being trying to stay positive about the whole situation because honestly, there is nothing that can be done at this point...the lump IS what it IS. Whatever IT may be.  ",
      "MessageIndex": 3,
      "PostDate": "03/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/765696",
      "Title": "Patience and Worrying: Clash of the Titans! amandapanda SarahsMom"
    },
    {
      "AuthorID": "amandapanda…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124693/profile",
      "Content": "Mar 4, 2011 05:33PM - edited Mar 4, 2011 05:35PM by amandapanda Had a horrible dream last night that my results came back in positive. I was (naturally) so distressed and numbed by the results that i decided to sleep on it. I woke up (in real world) around 6am totally convinced that \"yesterday was one of the worst days of my life\" and  I got up to look at all my paperwork to find the pathology report that said IDC, but couldnt find it. Thats when I realized it was all a terrible frightening dream.  I am so in tuned with my body that i often dream about getting my period or having an infection the night before i discover it, with 100% accuracy. This is taking its toll on me and lets just hope this dream is nothing more than that. In my culture we say to share nightmares so they won't come true. SO there. I've shared it!  Still no results from biopsy but will keep updating ...the Titans are still at war in my head. Patience took a horrible blow from Worry today.",
      "MessageIndex": 5,
      "PostDate": "04/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/765696",
      "Title": "Patience and Worrying: Clash of the Titans! amandapanda SarahsMom"
    }
  ]
}