{
  "AuthorID": "amarilloliz…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132834/profile",
  "Posts": [
    {
      "AuthorID": "amarilloliz…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132834/profile",
      "Content": "Jul 22, 2011 06:59PM amarillolizzi wrote: I was just diagnosed at the first of July 2011 with stage 4 breast cancer with mets in the lungs.  This is my first experience with cancer at all and to have such a drastic diagnosis is shocking to say the least.  I just turned 36 so I'm kind of freaking out.  I go next week to have some more tests run like a bone scan, ekg, etc.  Next Friday I get my port put in, and I start chemo August 1.  I'll be on Adriamycin/Cytoxan for 4 rounds then we'll rerun all my tests and see if it's working.  Any advice and/or encouragement would be appreciated.  I've spent the last 2 days reading lots of posts on these boards and it's very helpful to see so many people kicking cancer's ass and not letting it get them down.  I just feel completely overwhelmed because everything is moving so quickly.",
      "MessageIndex": 61,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726633",
      "Title": "Looking for my \"Lung Mets\" sisters.... WingsofHope grammadebbie"
    },
    {
      "AuthorID": "amarilloliz…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132834/profile",
      "Content": "Jul 22, 2011 09:45PM amarillolizzi wrote: Thanks everyone for replying.  Cathy2, that is exactly how I feel!  I feel like I've been sprinting for 3 weeks without stopping.  Every test I take seems to come back with not the best of news.  I keep trying to focus on the positives - liver and the rest of the abdomen look clear, heart seems to be good, etc.  I have a bone scan and a brain MRI next week before I start chemo and I'm really nervous about the results. @ reesie - thanks for the offer.  I've learned so much just reading about other people's struggles.  I read all 24 pages of the chemo board just writing down everything I could about getting ready for chemo.  Overall I'm in good spirits and am more angry then depressed. ;)  I'll definantly be checking in here often to boost my resolve.",
      "MessageIndex": 67,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726633",
      "Title": "Looking for my \"Lung Mets\" sisters.... WingsofHope grammadebbie"
    },
    {
      "AuthorID": "amarilloliz…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132834/profile",
      "Content": "Jul 22, 2011 06:43PM amarillolizzi wrote: I was just diagnosed with stage 4 breast cancer at the beginning of July.  Today, I found out that I will be starting 4 rounds of Adriamycin/Cytoxan with Neulasta shots starting on August 1.  I'm freaking out by how fast everything seems to be going.  But, I'm glad that we're moving fast because that means treatment will start soon.  As my best friend told me, I plan to kick those cancer cells right in the nuts!",
      "MessageIndex": 2,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    }
  ]
}