{
  "AuthorID": "AmazonCatwoman",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234796/profile",
  "Posts": [
    {
      "AuthorID": "AmazonCatwoman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234796/profile",
      "Content": "AmazonCatwoman wrote: My breast surgeon recommended I take Evening Primrose Oil for the next 6 weeks before following up with her again. I have had absolutely HORRIBLE diarrhea while taking it though. I have only taken 1500mg each day for the past couple days. I feel like this is a small dose but should I go even lower or is it possible that I'm just not going to be able to handle this? Has anybody else had such bad diarrhea with this dose? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/846677",
      "Title": "Evening Primrose Oil AmazonCatwoman AmazonCatwoman"
    },
    {
      "AuthorID": "AmazonCatwoman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234796/profile",
      "Content": "AmazonCatwoman wrote: My BS felt and could see the hard areas in my right breast on my last visit. She told me she thought it was just fibrocystic changes and bc of my 100lb weight loss because nothing showed on my mammo or US and to try a couple things and come back 6-8 wks later and that if there wasn't any improvement we would discuss excisional biopsy. Why do you think she wants to go directly to excisional biopsy? I haven't had an MRI or any less invasive biopsy. These areas are very easily felt and seen though upon examination. Also, my breast just feels worse and the hard, thick flat area on top definitely feels like it has grown since I discovered it a few months ago and regardless, I don't want to wait anymore because whether or not this is something benign or malignant (ILC would be my concern) this thick, hard area in my breasts needs to go. It's problem enough for me that I want it out. I have large breasts and am okay with getting scars and potentially a significant reduction in my breast size with this stuff taken out. If my BS really just thinks this is fibrocystic changes though, could she not do the excisional biopsy even if I tell her that regardless of whether or not she thinks this is malignant, that I want it out anyway? My follow up appt is not until late September but I may try for a n earlier appt and want to know how I should handle things going in. I've just reached a point where I'm done and I want this out. They are my breasts and I get to choose what I am okay with and what I am not, right? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847408",
      "Title": "I want it out AmazonCatwoman Icietla"
    }
  ]
}