{
  "AuthorID": "Amazon_Archer",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82712/profile",
  "Posts": [
    {
      "AuthorID": "Amazon_Archer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82712/profile",
      "Content": "Amazon_Archer wrote: So I have been feeling pretty miserable with a cold since around the 1st of the month. Then last week I started having flu symptoms, you know what I mean, vomiting, diarrhea, low grade fever. So by Sunday I couldn't stand it any more and I went to one of those Urgent Care places. Told the PA my past history and he decided to send me to the hospital for a CT Scan STAT. I am so glad he did. They have found a solid mass on my right ovary measuring 9.4 x 3.0 x 4.8 cm . Monday I spent all day trying to get an appt with my PC so he could refer me to a specialist. When they finally called me back at the end of the day on Monday, they told me they were sorry but there office only covers my basic care and that I would need to find a specialist myself, of course this is at the end of the day, so now I would have to wait until Tuesday morning to make phone calls. Then LightBulb went off. Hubby and I just moved back to Arizona, in November after spending 1 1/2 years back in Virginia helping my mother downsize her house so she could move into a smaller place. There is a Mayo Clinic just 20 miles down the road from where we bought our new home. So Tuesday morning I googled Mayo Clinic and got what info I needed, so I called....1. They accept my insurance. 2. I then spoke with an appt coordinator and she said she would give my info to the dept I would need to go to and they would contact me by this Friday to give me an appt date. 3. Wednesday morning bright and early Mayo clinic calls and asked....Can you be here in the morning? I said yes. 4. So bright and early Thursday morning I arrive at Mayo clinic. I see a gynecological surgeon and after examing me said, Surgery is next Thursday the 20th. The surgeon's assistant comes in and then says....if you can stay today, we can get all your pre-op stuff done now, but it will take most of the day. Told her no problem for us (hubby and I), So we spent the rest of the day doing pre-op.  It ended up, since I have bronchitis from this stupid cold they want me to do a pulmonary function test on Tuesday to make sure I can handle the surgery. So if I pass my breathing test on Tuesday, surgery on Thursday. If I don't pass the breathing test they will postpone surgery for a week to let me finish getting over my cold. I thank God, the PA at urgent care decided to send me for a CT scan. The surgeon said with my past bc history and my family history the chances of this mass being benign is pretty slim. But I'm keeping my fingers crossed until he wakes me from surgery and gives me a definitive answer one way or the other.  I know this isn't a ovarian cancer board but dear dear ladies, the chances of getting ovarian cancer after bc is a possibility and it's not called the silent killer for nothing...usually by the time they find it, it's in the late stages. So beaware, be proactive and God Bless All of You Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752626",
      "Title": "I Thought I had Bronchitis and the Flu Amazon_Archer lvtwoqlt"
    },
    {
      "AuthorID": "Amazon_Archer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82712/profile",
      "Content": "Amazon_Archer wrote: I had a modified radical mastectomy 17 years ago on my left breast with 32 lymph nodes removed, 4  were positive. I have been lucky and have never had severe lymphedema. The worst I have is not being able to wear my wedding band on ocasion. I still have numbness on most of my left chest cavity and on the underside of most of my upper left arm. Now here is my question....I am going in for surgery again on Monday, July 6th for cancer in my right breast. I am having another modified radical. The surgical nurse said she didn't think it would hurt for me to have my blood pressure taken or given iv's in my left arm since it has been so long and since I have never had a major problem with lymphedema. I was told when I had my mastectomy the first time to NEVER allow anyone to do iv's or bp on my left arm. Who should I believe? The doctor's and nurses from 17 years ago or the surgical nurse of now? I really would appreciate some input from you ladies out there. Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/736904",
      "Title": "Is it Safe? Amazon_Archer barbe1958"
    },
    {
      "AuthorID": "Amazon_Archer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82712/profile",
      "Content": "Amazon_Archer wrote: I have always been one of those women who have had a problem with underarm odor ever since puberty. Well, since I my surgery was only 3 weeks ago I'm still not suppose to use deodorant. I have found much to my joy and amazement that pure aloe vera is a great natural deodorant that doesn't hurt my surgery area. I just thought it might help someone else who might have the same problem and need an alternative to use until they are healed well enough to go back to deodorant again. Peace and swift recovery to all. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738290",
      "Title": "Using Aloe Vera Amazon_Archer Amazon_Archer"
    }
  ]
}