{
  "AuthorID": "amberyba",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
  "Posts": [
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Aug 9, 2008 02:21AM amberyba wrote: I know you are very frustrated, I would be as well...it is sad that the medical profession has come to this...you about have to ask for a copy of any of your test results...that is what I have come to put into practice...hang in there...you are doing the best you can.",
      "MessageIndex": 1,
      "PostDate": "09/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/719281",
      "Title": "Why wasnt I told of my 2 inch mass by my doc? Lburwell leaf"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jun 19, 2008 07:59PM amberyba wrote: LaneF, I have read your other post too and the title about your mom being an angel brought a smile to my face...I lost a grandmother a few years back...and shortly after she passed away, I could feel her presence on a few occasions. when a gentle breeze cooled my face inside where there was not a chance of any air flow around, then on another occasion when I was working the night shift in the emergency room, the same gentle breeze when there was no explanation of air flow...my friend whose father had died earlier than my grandmother was there when it happened and told me that it is true this happens...I use those special times and moments to speak to my grandmother...tell her how much I love her...I know she loved the LORD and is with him....and sometimes in my prayers I ask the Lord to tell her Hi and that I love her...Your mom is free from her pain, and her love is stronger than ever for you. If you like to read...some good books are Dominion and Deadline by Randy Alcorn, they give a vivid picture on what of Heaven...and I just read a great book called The Shack, that encouraged me alot...then there is the Bible of Course to encourage us. May the Lord bless you and Keep you and Make His Face to Shine upon you and give you peace! In Jesus Love, Amber",
      "MessageIndex": 26,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707520",
      "Title": "MY MOM IS NOW AN ANGEL...AND I ALREADY MISS HER! LANEF SandyAust"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Dec 22, 2008 05:12AM amberyba wrote: Rebecca, Thanks for sharing, my heart goes out to you and your family...I have a sister who had BC 9-10 yrs ago...and it is always in the back of your mind that BC can strike again. Then I got BC this year and I am much more in tune to the chance for BC to recur for my sister and myself. it has hit home... I have read that cancer likes Iron....and when I saw that your sister was anemic, it make me wonder how many women with BC are anemic...and if this is a symptom that it is thriving. My hemoblobin has been up and down since surgery....so your sharing has enlightened me...You just never know when you share things that the little things can make a difference. Anything you or your sister have a question about, this is a wonderful forum...we can learn so much from each other and help is there. My faith has grown thru all of this and this verse has many times gotten me thru...BC can make us anxious...I am continually petitioning the Lord....and He has provided comfort, help and answers.....I am ever so thankful!  Philippians 4:6-7  Do not be anxious about anything, but in everything, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus. May the LORD bless and Keep you and your Sister! In Jesus Love, Amber",
      "MessageIndex": 6,
      "PostDate": "22/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726193",
      "Title": "Sister's Cancer is Back after 8 years Rebecca2008 Rebecca2008"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "May 23, 2009 12:05PM - edited May 23, 2009 12:07PM by amberyba Jeanette, Try not to worry, I had to give myselft a pep talk and one way of thinking is that the mass is innocent until proven guilty. did the ultrasound suggest a cyst....also I have read that fibradnomas can grow fast. http://books.google.com/books?id=-OlwodQhdM4C&pg=PA138&lpg=PA138&dq=fast+growing+fibroadenomas&source=bl&ots=FLJBTIjxlH&sig=v-QrwKXDT6LkIAos3y3kMDAU78I&hl=en&ei=kUcYSrfZAtPHtgeT_cSBDQ&sa=X&oi=book_result&ct=result&resnum=10 so it can be benign. are you having an incisional biopsy or removing the lump? you can also request for an MRI of the breast, sometime can offer more conclusiveness. I can understand how terrified you must feel, I will be thinking of you. Amber",
      "MessageIndex": 2,
      "PostDate": "23/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/734695",
      "Title": "Too Young I need advice. netty90 Kaidog"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jul 10, 2008 01:42PM amberyba wrote: the 10 year is to long to take, 5 years is the recommended time to take Tamoxifen, it is a big decision...I would ask the doctor is having a mastectomy guarantees no cancer in the future....and why do they want to start tamox if it is only precancerous? Maybe because you are a high risk. ask a lot of questions and second and third opinions never hurt. Good luck!",
      "MessageIndex": 2,
      "PostDate": "10/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708869",
      "Title": "Should I take Tamoxifen? Carolyn233 lvtwoqlt"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jun 14, 2008 03:27AM amberyba wrote: sorry that you are going through this...it does seem odd that you would wake up with a bruise, and soon after notice a large lump. does it Hurt? could it be a spider bite? this may sound rediculous, but  I have read about brown recluse bites, they hide under beds and sheet etc. and the damage they can do to skin looks pretty bad... but if itis a spider bite as such you will need treatment...these spider bites can go unnoticed. hematomas (bleeding under the bruise) can form under a bruise, and if this is just a bruise then it will take time to go away. Hopefully this is just minor, but check with your doctor on Monday to be sure. ",
      "MessageIndex": 1,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707303",
      "Title": "found something in the shower ariana leaf"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jun 4, 2008 05:23PM amberyba wrote: Susan, I've only a week of treatments left, I devoped a quarter sized blister 3 days ago, I talked with my rad nurse today and she said once my blister broke and got in the radiated field, that the doc would prescribe silvadene...if the area is raw (kind of like a blister removed)...your best bet is getting the doc to look at it and make sure it isn't infected and getting the proper topical application. I bet it really hurts. mine hurts to touch. the blister covering is protecting my skin beneath, and I know once air hits it it will probably hurt worse, but it keeps getting bigger, because the fluid is increasing with no where to go. so I know if your skin is peeling it is very similar...The weekend is coming so I'd get the doc to write a prescription if needed, I'm thinking the same, it's just so expensive the meds, but I am a nurse and know that silvadene is wonderful for burns and radiation could be in the same class as burns! ",
      "MessageIndex": 2,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/706770",
      "Title": "Raw peeling skin what to put on? SusanB12 pabbie"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Apr 19, 2008 07:47AM amberyba wrote: Prycylla, I can understand your feelings...that must really hurt...finding that your mom had a sad experience with her own mom has enlightened you to why she may be reacting this way. I will pray for you both. There is hope...don't give up and let her know that you don't give up easily....shower your love on her....When we are showered with love it changes us. Also I sent you an email. just check \"my Home\" And you will see there is a message in the inbox. In Jesus Love, Amber",
      "MessageIndex": 2,
      "PostDate": "19/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704250",
      "Title": "how to deal with anger prycylla althea"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 15, 2008 04:10AM amberyba wrote: I have changes, near the hair follicles, and swelling that progresses thru the day, so that my nipple is tough, I am 3 months post rads and have noticed the hair follicles  (almost looks like a pimple) around the nipple are darker and swell more toward the evening, I am going to call one or two of my doctors today to just get it  checked. I had the SNB dye injected at my nipple during the resection and my nipple has been different since..the nurse in me tries to rationalize the changes to the surg, SNB and rads...but My DH knows I worry and has encouraged me to sch an extra appt...which I hate to bother the doctors...but I have to be sure....finding your post on nipple changes has reaffirmed my thoughts that it is probably due to a combination of things, I asked my surgeon in July about the tough nipple, but the hair follicles that are dark make me think that hair tried to grow and got stuck due to swelling, but I have looked at IBC and questioned if it resembles that...then I freaked last night...my heart sank with doubts...but this morning it doesn't look as bad...but I am still going to check with a doctor. So let's keep each other informed with what we find out, and any others who have had similar problems maybe will share as well. Hang in there!! hugs and prayers, Amber",
      "MessageIndex": 2,
      "PostDate": "15/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/721141",
      "Title": "Awkward or Stupid Nipple question... sta1129 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 15, 2008 04:43PM amberyba wrote: Hi all! I did sch. an appt. I talked to the breast surgeon's nurse and after I tried to describe the findings, she said he would need to see me and asked if I could come in the morning...I said yes...but now it doesn't seem as bad and I feel almost stupid for taking up the doctors time...my mind is clear and I do feel good...I also read on another thread about this same issue and that what I am seeing is normal for a radiation side effect. Nice story about your nurse!",
      "MessageIndex": 7,
      "PostDate": "15/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/721141",
      "Title": "Awkward or Stupid Nipple question... sta1129 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 22, 2008 03:04AM amberyba wrote: Hugs and prayers Stephanie, You have such great faith...and inspire us all...I am glad you have such good help....Our Lord is able....love in Jesus, Amber",
      "MessageIndex": 54,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721550",
      "Title": "Morphine all day everyday - Things are getting serious TripleNeg lewisfamily503"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Aug 26, 2008 06:10AM amberyba wrote: Heather, I understand, it is a mother's worst fear (once you have BC) is that for your daughter, I will be praying for you and your daughter, something similar happened with my daughter last year when she was 15, (before I was diagnosed), she had a red spot on her breast, but it dissappeared and the gyn examined her within a few weeks and everything was OK.  since my diagnosis, and researching BC I am more aware of my teen daughter and how this may affect her. (my sister had BC too.). Hang in there and let us know how things go. In Jesus, Amber",
      "MessageIndex": 6,
      "PostDate": "26/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720058",
      "Title": "\"STRESSED\" 3 MO scans for me and mammo for 19 yr old daughter. heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Aug 30, 2008 11:46AM amberyba wrote: so happy happy and glad. God bless! may your scans be excellent, it is good to enjoy the weekend, happy labor day In Jesus love, Amber",
      "MessageIndex": 14,
      "PostDate": "30/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720058",
      "Title": "\"STRESSED\" 3 MO scans for me and mammo for 19 yr old daughter. heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Aug 12, 2008 09:54PM amberyba wrote: Pat, I am hurting for you...so much to deal with... are they saying the mass in your mediasternum is stage 4 and is causing the fluid to build up? and was this causing your rib pain?and it is so hard to understand because your nodes were negative that this happened. Hugs and prayers, Amber",
      "MessageIndex": 6,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719433",
      "Title": "Trip Neg Recurrance....warning long post! wayover20 wayover20"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jun 22, 2008 09:00AM amberyba wrote: Jude, I understand your feelings exactly, and I believe you are heading in the right direction....your cancer was slow growing and that is a plus and that the actual tumor was only 6mm is great.  I had to make the same decision too...my tumor was 1.5cm, which anything >1cm in the past has had chemo as suggested...mine was grade 2, er/pr+90%, noncomedonecrosis and non vascular...cancer comprised only 5% of the tumor mass on my original path report, and my oncotype came back a 7. My Lord is and has been a key in all this cancer issue...I stand amazed at everything I have experienced...with much prayer and friends prayers and encouragement...that Oncotype score amazed me as well, there was much praying going on about that too. May you have a blessed day, I will pray for you now. Lord, take care of Jude's worries and concerns, help make it clear to her what treatment is best, heal her body and protect her always. Thank You Father for Jude. In Jesus Name amen. Have a blessed day Amber",
      "MessageIndex": 19,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707657",
      "Title": "Lumpectomy/Chemo and Radiation...HELP totaldo artsee"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jun 17, 2008 01:40PM amberyba wrote: Kymberlyn, I really do feel for you...but you are doing the right thing...personally if I had a med. onc treat me the way yours treated you...i would have walked out and left....he is insensitive and not really a doctor if he hasn't reviewed your case before he enters your room... June 30th is a long time to wait....I would call back and asked to speak to the office manager...ask for a good referral to an office with a good reputation, who may can work you in earlier...usually if a clinic feel like they are loosing a patient they will work you in, and if they are to busy to see you I can't see why they wouldn't refer you... You can request copies of all your charts. call ahead and have them to get them ready at a time you can pick them up...I too had to pick up films...my doctors have been willing to give me copies of any report or lap work I have asked for. Your report is stage 1, that is wonderful! er and pr + is a good sign too! usually good prognosis...and it sounds like your surgeon communicated to the med onc that you were a good candidate for lump w/ balloon radiation therapy...I asked my surgeon is I could have this or a partial breast radiation...but I am 2 years shy of the recommended age to do these. Hang in there...you can get through this...us bc girls are pulling for you and each other. I will pray for you now! God bless! In Jesus Love, Amber",
      "MessageIndex": 1,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707443",
      "Title": "I'm so confused Kymberlyn pip57"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Nov 28, 2008 11:44PM - edited Nov 28, 2008 11:48PM by amberyba I have had this hardening (I call thickening) and have been concerned as well. I did go to my breast care surgeon, who has done ultra sounds on some of the areas a few months ago...he said everything was OK. And he told me the area near the SNB site  was probably sore and indeed since then it has gotten more sore and sometimes is hard. One thing I have noticed is that the area between my SNB scar and lumpectomy scar as well as the lump scar gets harder as the day goes on....and from what I have read, often the lymph fluid has a difficult time draining, when we are able to rest and sleep the area may drain better, and another thought is that radiation can cause thickening of tissue. But you are doing the right thing, often BC and the side effects of surg/radiation can have the same symptoms. So having a professional exam the areas of concern is important. I was tempted last week to have my surgeon check me again because the area felt unusual, and was raised and hard...even emailed the breast care nurse... but after a good night's sleep the areas softened some. My scar where the lumpectomy was, also is lumpy and the end of the incision, and hard over the incision. but every day it feels a little different, my breast care nurse told me it was ok to massage the area....I am hoping to soften the scar tissue when I massage the area...yet at the same time I have read per Susan Weed massage is good to keep the fluid moving, but there is question if the area is cancer. So I do use caution. I am glad you posted.,,hopefully others will share their experience and we can all learn...I feel so unsure at times wondering if the things I find in my breast and symptoms I am having are normal or should I worry.... God Bless, let us know what the oncologist says on Monday Amber",
      "MessageIndex": 1,
      "PostDate": "28/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725132",
      "Title": "Lumpiness near radiation and lumpectomy spots paws0147 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Dec 1, 2008 06:57PM - edited Dec 1, 2008 06:59PM by amberyba Paws, Glad your onc is being thorough... the area where you burned during rads did a blister form, or did you have little blisters or clogged pores occur. I had a blister from rads and the skin beneath is odd looking....my breast surgeon took a close look...My breast also had a lot of swelling during rads...and there are a lot of stretch marks and the nipple sometimes is soft and sometimes tough. I hope everything you are experiencing  is just from the rads. 2 weeks is a long time to wait...I will be thinking of you!!! God Bless you!!!! amber",
      "MessageIndex": 6,
      "PostDate": "01/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725132",
      "Title": "Lumpiness near radiation and lumpectomy spots paws0147 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Apr 30, 2008 02:44AM amberyba wrote: I've just started radiation...and am concerned about how I may have adverse effects to my skin, so I am trying to prepare for it... things I found are: Aloe vera Calendula turmeric/curcumin my rad oncologist told me I could use them here are a couple of links, but you can google on your own and find out quite a lot on  healing from radiation effects http://www.drweil.com/drw/u/id/QAA326156 http://www.freshplaza.com/news_detail.asp?id=18504 God Bless you, Amber",
      "MessageIndex": 2,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/704783",
      "Title": "radiation therapy....after sugarsunnyjugs Shirlann"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Nov 29, 2008 03:16PM amberyba wrote: I'm not sure if cancer would show up that way...but I try to think innocent until proven guilty... It is raining the weekend here and both my children are playing golf...I walked 18 holes in the rain today, and I'll rain suit up and walk the 18 holes tomorrow. Have a blessed weekend...try not to worry...and I will look forward to hearing how things go on Monday. Amber",
      "MessageIndex": 3,
      "PostDate": "29/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725132",
      "Title": "Lumpiness near radiation and lumpectomy spots paws0147 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jun 1, 2008 05:48PM amberyba wrote: Funny thing I developed cough and nasal drip one week after starting rads...thought it was due to allergies, but I don't really have allergies,,,but i coughed up yellow phlegm just until this week and it is getting less and less....i told my rad team that i had a cough...but one of them had bad allergies and i guess we just chalked it up as that for me as well, but I never have had productive cough with allegies that lasted so long and i'm now on my 6th week of radiation.... but the radiation does get your good cells too...so you have a harder time fighting off germs. and they told me some radiation goes near rib/lungs to make sure they get the entire breast area. also developed a cyst (think clogged pore from aquaphor) in the radiated field and am using antibiotic cream...and it has been there about 2 weeks...the doc checks once a week and ok'd the antibiotic cream...but said my skin looks great, I have been drinking fresh carrot juice for about a week...and should be trying other things to help my immunity too. but I did start noticing less phelgm as the days have gone by...maybe the juice helped....I'm just lucky that my sister-in-law gave me a juicer many years ago for my birthday...it still works good....and carrots really taste good and are excellect for your health, I just  can't find the time to juice but 1-2 time a day. Basil glad you posted your question...i bet alot with BC have experienced cough and congestion with radiation.",
      "MessageIndex": 6,
      "PostDate": "01/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/706000",
      "Title": "sick during radiation basil16883 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 15, 2008 05:57AM - edited Sep 15, 2008 05:58AM by amberyba thanks wishiwere and wintermoon,... I will check with the doctor, and hope not to appear so annoying....and let you all know what he says. just which doctor is the question? Amber",
      "MessageIndex": 5,
      "PostDate": "15/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/721141",
      "Title": "Awkward or Stupid Nipple question... sta1129 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 16, 2008 04:18AM amberyba wrote: It can, and probably effect everyone in different ways, check out the radiation threads and you can read side effects others are experiencing.",
      "MessageIndex": 9,
      "PostDate": "16/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/721141",
      "Title": "Awkward or Stupid Nipple question... sta1129 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 16, 2008 10:12AM amberyba wrote: my breast sugeon checked everything out...pulled out the ultrasound and everything is OK! Hooray!",
      "MessageIndex": 10,
      "PostDate": "16/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/721141",
      "Title": "Awkward or Stupid Nipple question... sta1129 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 19, 2008 06:47PM amberyba wrote: so glad of the good report!",
      "MessageIndex": 12,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/721141",
      "Title": "Awkward or Stupid Nipple question... sta1129 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 22, 2008 12:30AM amberyba wrote: Your first path report does raise ? about clear margins, and like Viv asked, did you go back for re-excision in 2000? but if you have the same surgeon, I'd take both reports and ask him to explain. and I feel for you and am sorry too. hoping for good reports! Amber",
      "MessageIndex": 2,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721584",
      "Title": "Close margins on lumpectomy Sher crazydaisy"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 22, 2008 05:08PM amberyba wrote: Sher, I am so happy that no other cancer was found in either breast....to me that is a very encouraging thing... One thing I would do is ask for a second opinion on the TN...ask that another pathologist exmine and restain for hormones....I have studied on the web that some er- tumors when rechecked are positive. Did you take any antihormonal chemo with the first diagnosis? Best wishes, Amber",
      "MessageIndex": 6,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721584",
      "Title": "Close margins on lumpectomy Sher crazydaisy"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 23, 2008 05:20AM amberyba wrote: Sher, It really makes me worry when I see the recurrences happening when tamoxifen is taken. one of my friends sister had a recurrence after her 5 yrs of tamoxifen too. And like you I have read that  tamoxifen resistance often produces a hormone negative recurrence. I really am pulled at whether it is worth taking...some people tell me when their friends opted to not take tamoxifen they had a recurrence as well...but with the other side effects of tamox with the uterus and liver and possible stroke it does justify some serious thinking, I am on my 3rd bottle of tamoxifen... I am not familiar with Fox Chase, is this a lab company or law firm....if the surgeon and rad onc. did as supposed it does seem like that your recurrence could have been caused by their negligence...that is awful. you have been thru so much! well hang in there, God Bless, Amber ",
      "MessageIndex": 8,
      "PostDate": "23/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721584",
      "Title": "Close margins on lumpectomy Sher crazydaisy"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Nov 25, 2008 04:41AM amberyba wrote: Doe, Thanks for sharing, I think the good thing is that the area healed up after the first application of A&D ointment. Radiation side effects can occur and persist for 6-12 months, and some women report having difficulties longer... But You have an appointment soon and the doctor can take a good look and tell you precisely....and that is only a couple of weeks away....I remember after rads feeling a lump at the end of my scar...I had an appointment 3 weeks later with my breast surgeon...boy was that the longest 3 weeks...and I checked the area concerned several times a day....but when he ultra sounded the area it is just scar tissue.... I think Debbie offered good advice about moisturizing, my rad onc didn't tell me this. But last night I noticed my lump. incision was hard and tight, so I put some palmers cocoa oint. on it then this morning it was softer...so Thanks Debbie, I will keep a check and moisturize occasionally. Amber",
      "MessageIndex": 2,
      "PostDate": "25/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/724962",
      "Title": "New Symptom lionessdoe TJW"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 13, 2008 03:37AM amberyba wrote: Joy, I can understand your feelings,  When the breast surgeon completes your lumpectomy, he will probably do a sentinel node biopsy, if there are any positive nodes  he will probably run the pet scan etc. try not to jump to conclusions about your symptoms...the symptoms could be related to osteoporosis/hormone related etc,age related) for example I have had hip pain for about 9 years...and the funny thing is that natural progesterone cream took it away...so it was more than likely hormone related. The bladder problem may be due to your age as well. I just started having stress incontinence. (urine leakage when you sneeze or jump or run) but my gyn told me to practice kagel exercises and this has been helping. I am quite a bit younger than you though but menopause and premenopausal symptoms happen at diff ages for some. You can ask you doctor to check your calcium and vit D level and estrogen levels, the reason you see about spots on the lungs and the liver is because one of the first place BC spreads after the lymph nodes is the lungs and the liver... The oncologist may well be the one to order scans if you need them, but the surgeon did order the breast MRI. On your next surgery, take a list of questions with you...the surgeon will gladly answer them before the surgery, he has to mark the spot and you have to witness his mark prior to the surgery. and it looks like you will see the surgeon prior to the surg itself. God Bless Amber",
      "MessageIndex": 1,
      "PostDate": "13/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721128",
      "Title": "JUST DIAGNOSED-SCARED SILLY! wildfilee carolsd"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jul 25, 2008 11:02PM - edited Jul 25, 2008 11:04PM by amberyba Stephanie, I reiterate Kim's prayer. I am glad you aren't giving up. Hey sonic is great we have \"happy hour\" half price on drinks at Sonic here from 2-4p...do you have it there? fluids are the important thing to keep you hydrated...are you able to eat anything like saltine crackers....your electrolytes may be out of wack too, your doctor could do an easy check on those...so I am glad you are checking with him about these happenings! In Jesus Love, Amber",
      "MessageIndex": 32,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709616",
      "Title": "Protruding Chest Nodule: Please pray TripleNeg Felicia"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Feb 4, 2009 08:55PM amberyba wrote: Rusty your story touches my heart, I just said a prayer for you...hang in there, rest as much as you can, try to get some good nutrition, and do not feel guilty, BC is mean. You are important to the Lord Jesus. In Jesus Love, amber",
      "MessageIndex": 13,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728492",
      "Title": "Fourth year mark...and fell like im slowly losing. rooni LuAnnH"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jun 17, 2008 12:54PM amberyba wrote: I too have the shooting pains, mainly in my nipple where the tissue is tough underneath, also when I lean on my hand while my elbow is on a table the area around my underarm throbs, does any one have this pain as well? I finished the boost last wednesday, I didn't notice the underarm pain until rads were finished, and the nipple pain seems worse today. the boost only touches a fraction of my aeola and none of my nipple, it is tender to touch. the boost area looks like it is scorched by an iron compared to the other radiated skin. I am figuring this is par for rads...but my rad nurse said to call if I had any questions....that it would take 6 weeks for the radiation to work its way out Thanks,  Amber",
      "MessageIndex": 4,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/707320",
      "Title": "Shooting pain in breast post radiation, anybody else? larousse Shirlann"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jun 12, 2008 09:02AM amberyba wrote: My sister (age 32 then) had lumpectomy, chemo, rads, no hormonals (even though + hormone recptors) 9 years ago and still in remission. My rad therapist had lumpectomy and rads, no hormonals (even though + receptors) 9 years ago as well...still no problems My sisters med oncologist told her after the lumpectomy that it was a good choice, because often if the BC comes back it comes back in same location whether you have mastectomy or not....and at least she had breast for it to grow, rather than her lungs. I told my surgeon what this onc said before my partial and he didn't agree. but it made sense to me. I chose lumpectomy and then 2nd surgery was just partial mastectomy....would have gotten total mastectomy if MRI/CAD had shown more BC after first excisional biopsy(lumpectomy) came back malignant. My surgeon told me that with my type of cancer that lumpectomy/radiation was no different than mastectomy/no radiation. So I chose Lump/RAD...but Rad therapy was hard for me and I had second thoughts after the first week of rads and thought I should have had mastectomy....but now I have just finished rads and I am glad I made the decision and of course I am glad it is over....just hoping and praying I stay NED. Good luck with your decision",
      "MessageIndex": 19,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706946",
      "Title": "Anyone? Lumpectomy vs. Mastectomy w/No Re-occurance???"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jan 28, 2009 04:08AM amberyba wrote: Myra, just wanted you to know I was thinking of you. glad you are back with a new fighting spirit. you have done great research.....hope your condition improves soon. in Jesus, Amber",
      "MessageIndex": 1,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728084",
      "Title": "AFTER radiation: lung fibrosis??? Myrajuc Imasurvivor"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jul 28, 2008 09:24PM amberyba wrote: Cathi, I understand what you mean...we get to know our breast and it just scares me when I noticed something just as you say... keep getting your fears and concerns out, it helps talking with those who have been through it. It has only been 2 years since your diagnosis, it never gets easy when you find a lump or a swollen node or have unusual pain and other symptoms. Hugs and prayers, Amber",
      "MessageIndex": 1,
      "PostDate": "28/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709820",
      "Title": "Did you just know your BC had come back before DX 1Cathi 1Cathi"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jun 28, 2009 10:51PM amberyba wrote: same here.\\ during radiation my breast did enlarge, and after the swelling remained. One thing I spoke with my breast care nurse was about this swelling and the possibility of fluid build up due to lymph node removal. and this also contributes and she told me breast massage was ok. I tried this for a long while and did notice the radiated breast would not be as swollen in the morning, but by evening the breast would swell. and as you stated unlimited, it is good to wait before you attempt any surgery to even the breast lopsideness out. some people have less swelling than others and then some people have smaller breats after, I think it varies from person to person.",
      "MessageIndex": 3,
      "PostDate": "28/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736653",
      "Title": "Breast bigger after radiation rgiuff kimaesha"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 16, 2008 12:36PM amberyba wrote: Jo Ann, I'll join. I have been in nursing for 22 years....my sister is a nurse as well and had BC 9 yrs ago...What kind of nursing have you worked in and what shifts. I started as a open-heart nurse; working 1st alternating 3rd...the third shift is what I hear gets health care workers..I've worked many other areas ED, floor nsg, teaching, L&D etc..I really enjoy variety, but the heart is my favorite....since my dx....and treatment...I have started looking for new work...and one stipulation is no nights....between childrearing and night working I've put in my dues. It will be good to talk to other nurses and see how we are doing so thanks for posting this thread",
      "MessageIndex": 1,
      "PostDate": "16/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 17, 2008 07:23PM amberyba wrote: Heather, having the time off and being out of direct patient care will help so much. I used the time to take extra walks when I decided not to work after diagnosis...now I continue the walks. Hope you have a goodnight! Amber",
      "MessageIndex": 10,
      "PostDate": "17/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Oct 2, 2008 05:59PM amberyba wrote: Angie, I am from Albemarle, NC and I sent you a private message...hope all is well. JoAnn, good news about not needing SNB. Hi to all the rest of you nurses...there are quite a lot of us. I just started a new job at a local nursing home this week...first time with a nursing home...I had always heard the nurse to patient ratio was high, when I asked the nurse who schedules staff this question she told me one hall per nurse....no numbers...now I know  why...seems like 20:1, so I hope I can muster the energy and the quickness with accuracy to get the job done. Also I heard from my nurse manager in the ED and It looks like I'll be returning soon to have hours there too. Bc does make it's mark on us, financially, emotionally, spiritually, and physically. I am 3 months post treatment and I am just now feeling the best I have felt since diagnosis. God Bless All! Amber",
      "MessageIndex": 76,
      "PostDate": "02/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "May 26, 2008 08:40PM amberyba wrote: Alca, My sister and first cousin were diagnosed at age 32 and my sister is now 41 and my cousin is in her 50's, they both are doing great...I was just diagnosed at age 43.  so I wanted to encourage you with these good stories. I was wondering why the doctors thought the cancer was a varicose vein initially? I too had to go for a 2nd surgery to get clear margins and am now in radiation...it is a scary battle, the breast cancer .org is a wonderful support...  Best wishes and God Bless!",
      "MessageIndex": 4,
      "PostDate": "26/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/706196",
      "Title": "A huge sigh of relief alca1229 easyquilts"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 16, 2008 10:22PM amberyba wrote: that sounds good...my doctor gave me the 2mg pill and told me to take one or two. sometimes I took 2 pills right before bed and that was 4mg... hope you feel better soon!!!! Amber",
      "MessageIndex": 3,
      "PostDate": "16/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721297",
      "Title": "Dilaudid for pain fightinhrd123 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Mar 11, 2009 05:38PM amberyba wrote: NANATO3, when my Sentinel node biopsy was done it was close to my breast under the arm pit...so I think those knots sound like  lymph nodes... Also when I had the diagnostic mammogram it was not a digital machine. the digital gives a lot better read....so you might want to ask the radiation technician if you are getting a digital mammogram. all the best and hugs, Amber",
      "MessageIndex": 5,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/730433",
      "Title": "Concerned Newbie Nanato3 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Apr 28, 2008 07:14PM amberyba wrote: Dragonfly, I aggree with twirl girl, sounds like you are getting radiated in wrong places. It makes me angry that you aren't taken seriously with your complaints....Get another opinion. and like twirlgirl said...skip the next appointment. Your oncotype score was low so you know your chance for recurrence is in the low percentage. I will pray for you: Lord Bless Dragonfly with your peace and love..put her in good capable hands to treat this breast cancer...help her body to heal. in Jesus name, amen dragonfly, I read on another breast cancer site of a woman undergoing radiation treatment and getting so red ant irritated that she was opting to take a break in treatment,,,she found out about turmeric/curcumin helping skin reaction and asked her onc about it. started taking it and within a week her skin had improved dramatically... so you might want to check on this too. God Bless, Amber",
      "MessageIndex": 3,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/704707",
      "Title": "I want to quit Dragonfly92127 twirlgirl"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Oct 24, 2010 07:49PM amberyba wrote: Anne what a testimony. you strengthened your body's natural defenses. you are getting a physical spiritual balance.",
      "MessageIndex": 14,
      "PostDate": "24/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759395",
      "Title": "PLEASE HELP ME!! Mom is diagnosed with Stage IV Breast Cancer Trust Trust"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 23, 2008 08:17AM amberyba wrote: a note on the tub thingy. my sister and I have both been thru BC. she has to wear a sleeve for lymphedema (9 yrs), I told her I was taking detox baths because Cathi (one of the girls here) menitioned it and then I googled and found out about it as well). My sister tried it and it is helping the lymphedema, and it is helping the pain at my SNB site where swelling and lumpy tissue has formed since radiation. So you may want to give it a try. 1 cup each baking soda and epsom salt to a tub of water (your temp) soak for 10 minutes. I did it about 4-5 times last week and skipped the weekend..last night it did help my hurting joints...and I feel better this morning....but I read it was good to use after radiation. my breast swelling doesn't seem as bad either.",
      "MessageIndex": 6,
      "PostDate": "23/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/721576",
      "Title": "Sauna, Steam Bath, Jacuzzis Myrajuc sccruiser"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "amberyba wrote: wondering if any one has had changes in nipple post lumpectomy and sentinel node injection below nipple? and when going through radiation if have changes? Amber Almond Dx 2/2008, IDC, Left, 1cm, Stage IA, Grade 2, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/705099",
      "Title": "are changesin breast tissue after surgery and during radiation amberyba amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "May 26, 2008 07:15AM amberyba wrote: what encouragement! I'm newly dx...and have wanted to hear good stories....It is so hard and I've heard sad stories as well...so it is a battle we keep fighting to win. For me it is a spiritual, physical and mental battle...so these stories are positive on my mental! My sister dx at 32yrs, is now on the 9 yr survival. (41!) My cousin is many more years out as well. that is funny about having the magazine subscription upped for 5 years....keep up the spirit and the good cheer! Love in Jesus, Amber",
      "MessageIndex": 5,
      "PostDate": "26/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706140",
      "Title": "a word of encouragement sylvie pod1257"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "amberyba wrote: I finished radiation 3 weeks ago today, this weekend, I just placed my hand over my chest and noticed the similar lump same as I found Christmas morning 2007. it is near the end of the incision where the inital tumor was....and I started my period a few days after finding this lump. So I'm not sure if it is cycle related, scar tissue or the dreaded BC, I do have a second visit with med onc in the morning and see the rad onc and breast surg next week...so I hope to get some answers or that the lump disappears. Looking for some encouragement or feedback if anyone has had similar experience. Thanks, Amber Amber Almond Dx 2/2008, IDC, Left, 1cm, Stage IA, Grade 2, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/708389",
      "Title": "lump post rads amberyba amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jul 4, 2008 06:38PM amberyba wrote: med onc said probably scar tissue, but to have surgeon take a look...or just to keep a check on it...talked to my sister who had BC 9 yrs ago...who found similar lump near or on scar...",
      "MessageIndex": 2,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/708389",
      "Title": "lump post rads amberyba amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Aug 19, 2008 06:28PM amberyba wrote: I am 43 as well and my gyn. ordered a diagnsotic mammogram followed by ultrasound if suspicion warranted...and yes suspicion was there...turned out on Ultrasound a 1.4 cm, by the time I went to my breast surgeon his ultrasound said 1.5cm, which when he excised the thing it trully was 1.5cm. Ultrasounds can be more specific as to whether you have a solid tumor or a fluid cyst. the tumor usually is a concern even though it can just be a fibroadenoma which is benign...my breast surgeon does his own ultrasound right in the exam room...it makes me think they are very valuable.... Remember innocent until proven guilty as far as the lump goes. God Bless, Amber",
      "MessageIndex": 3,
      "PostDate": "19/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/719756",
      "Title": "Breast Ultrasound fruitloopcentral amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 9, 2008 01:14PM amberyba wrote: as a nurse enlarged lymph nodes often indicate infection, I bet if you are coughing it is enlarged from that. I worried to about my lymph node swelling, the lymph nodes are great responders to trouble in the body...It is good that your doctor is on top of things, Best wishes, Amber",
      "MessageIndex": 2,
      "PostDate": "09/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720876",
      "Title": "Enlarged para-aortic lymph node : possible to be mets? chochipkooky sdg605"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Apr 19, 2008 01:32PM amberyba wrote: Kathyni, Hi! I had an excisional biopsy and then partial mastectomy since February '08. Everyone's pain level is different, I don't do well with narcotics either. I used motrin...later I found out that it can cause excessive bleeding at the tumor site. I developed a rather large amount of fluid at the tumor site for the excisional biopsy site. My surgeon said this was normal. A month later I had a partial mastectomy and sentinel node biopsy to get clear margins (since my tumor proved to be invasive ductal carcinoma). I asked the breast care nurse if there was anything I could take for the pain besides the Lortab. I wasn't able to sleep well when I took it. She told me she would talk with the doctor. He gave me a different narcotic which I only used for about 5 days. Otherwise I didn't use any other pain med... As far as the quadrant is concerned, depending on your breast size, you may notice a smaller breast, or maybe not. and depending on the location of the surgery as to the type of bathing suit you can wear. The nausea problem is one I struggled with post anesthesia as well, but if the surgery is short and they use a mild anesthesia you may have very little nausea. my first surgery was an excisional biopsy and I noticed very little nausea, but the partial mastectomy I had more meds for anesthesia. because I was under a longer time. I had to call the surgeon on call because I was dry heaving and my incision at the lymph nodes was bleeding through the dressing...He wouldn't suggest any anti-nausea med...but told me to get off my feet and believe it or not within an hour the nausea had subsided and the bleeding as well. Ginger ale is the key. the nurses offer it in the recovery room. Make sure your surgeon gives you a phone number to get in contact with him or whoever in his group that is on call. They really don't mind if you call and want you to have a splendid recovery. About the easier part...it will come,,,remember to write down all your questions for the doctor...take a notepad with your questions the day before surgery. ask about using the arm on the affected side. showering? Pain med? phone # to contact. length of time to find out report from biopsy? Hang in there, In Jesus Love, Amber",
      "MessageIndex": 2,
      "PostDate": "19/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704175",
      "Title": "Ductal Excision Tuesday, what to expect? kathryni amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 11, 2008 07:53PM amberyba wrote: Shen, prayer is powerful. dear Lord, help Shen to be strong and put her in good medical hands to fight this cancer. Give Shen peace that You are by her side. In Jesus name, Amen In Jesus Love, Amber",
      "MessageIndex": 11,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720987",
      "Title": "Please pray for me shend 2timer"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jul 25, 2008 03:04AM amberyba wrote: Stephanie, your faith encourages me...it is OK to be afraid, give your fears to the LORD. he will give you strength and peace. The Book of Philippians has many encouragements. I will pray, LORD, bless Stephanie with peace and strength, relieve her fears, show her that you are in control and that your Love will see her through this journey and battle....Father the we give you this battle. Be with Stephanie's family and their losses, may their faith be strengthened. In Jesus Name Amen Love and hugs, in Jesus, Amber",
      "MessageIndex": 13,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709616",
      "Title": "Protruding Chest Nodule: Please pray TripleNeg Felicia"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "May 6, 2008 12:28PM amberyba wrote: thanks Bren, my surgery was at 9:30 position and resection is 1 inch close to my nipple...maybe that explains it...  my surgeon told me that the nipple was assaulted from SNB injection below nipple, and at axilla where lymph removed...I just wondered if others had similar effects... I just had my 7th of 33 rad treatment....did the rad treatment help the nipple and breast tissue to smooth out?",
      "MessageIndex": 3,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/705099",
      "Title": "are changesin breast tissue after surgery and during radiation amberyba amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jul 22, 2008 03:28AM amberyba wrote: Abby, I am so sorry. it seems unbearable to be going through so much. Prayer for you: Lord, you know Abby from before she was formed to now. help her to be strong, help the pain to be bearable and give her comfort and peace, be with her doctors and give them wisdom. In Jesus name amen. hugs Amber",
      "MessageIndex": 1,
      "PostDate": "22/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709462",
      "Title": "more bone mets found abbyglp lv2cmp"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 17, 2008 06:25AM amberyba wrote: Jo Ann, my employer wanted me to take as much time as necessary...it was really a shock for them, they kept telling me it wasn't cancer...but after telling them I could come back, they haven't needed me to work...which  is OK, because the ER is stressful...I have applied for a couple of other positions in this small town. welcome aboard DEB, are those your grandkids? amber",
      "MessageIndex": 4,
      "PostDate": "17/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 16, 2008 06:26PM amberyba wrote: Hi Laura, I am a nurse and have given dialudid as well an was prescribed it after my partial mastectomy. dilaudid is for severe pain, usually a doctor will prescribe it at a low dosage...it did help me sleep and I only took it 2-3 times daily...It really did help me sleep....so yes it can knock you out....how many milligrams are the pills? Is any one staying with you?  You shouldn't drive a car when you are on this med....so make sure that if you may need something that someone can help you out. Best, amber",
      "MessageIndex": 1,
      "PostDate": "16/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721297",
      "Title": "Dilaudid for pain fightinhrd123 amberyba"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jul 29, 2008 11:43AM amberyba wrote: Wonderful! Celebration in order !!!!! Amber",
      "MessageIndex": 5,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709839",
      "Title": "Still NED!!! Analemma Barb-FightingBC"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Jul 1, 2008 10:39AM amberyba wrote: Emily, Your score is very encouraging, my first inclination is that the doctor will not suggest chemo. this is a sample of oncotype dx report: http://www.genomichealth.com/oncotype/publications/oncotype_reportform.pdf I scored a 7 and the med onc said I only had a 6% chance of recurrence if I did hormone therapy and that chemo would not benefit me. and the great thing is that your tumor is grade 1. when you go to the med onc ask for a copy of the oncotype result, I go this Thurs and will get a copy of my report, also get my tamoxifen rx. Good luck Amber",
      "MessageIndex": 1,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708352",
      "Title": "Oncotype score is in Emily2008 otter"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 17, 2008 08:43PM amberyba wrote: Jo Ann, I didn't realize you were waiting for your MRI results, was your DCIS found with mammogram? and did you have an incisional biopsy? I remember waiting for my MRI...I just felt the cancer may show up other places....but it was clear....thank goodness. so hang in there and let us know when you hear. Kim, welcome too! You have a wonderful nurse manager! Nighty night Amber",
      "MessageIndex": 13,
      "PostDate": "17/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 21, 2008 10:08AM amberyba wrote: Marie Kelly, thanks for the inspiring story!",
      "MessageIndex": 37,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 21, 2008 05:46PM amberyba wrote: Held, I understand as well...it makes me smile...I had a question for my surgeon after the first lumpectomy...I thought the fluid filled cavity was a cancer tumor, growing fast...he smiled at me and said, cancer wouldn't grow that fast and smiled again and said \"I thought you would have more questions than that\", I smiled back, and told him, \"but you know more than I do\". I do believe the doctors know more, they hold a much higher degree...and I have found that they like to be asked questions...the funny thing is that sometimes our \"dumb questions\" (as we think) aren't really that bad. there are some doctors out there that aren't confident and they are the ones who I think get frustrated when asked questions. I worked in a small ER prior to diagnosis and sometimes I did hate to ask questions to doctors about their orders...so I would ask one of the nurses...very often even the most experienced nurse would say \"I'm not sure, ask the doctor\", and most of the doctors enjoyed explaining their reasoning. So don't feel bad or stupid, just ask away...I find I have a clearer conscious and can tackle things better if I get straight answers. and for those docs who answer like your stating, leave them be...or if you have to keep dealing with them, share with them that you feel uneasy about asking questions, usually showing them that you are a patient and your nursing knowledge just puts you on the border of knowing just enough to worry you about things regarding your health. being in the medical field puts us knowing just enough to make us worry...medicine is a science and that is constantly changing. Held, I really like your Joshua verse! May the Lord be with you! Amber",
      "MessageIndex": 41,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 18, 2008 05:24PM amberyba wrote: Hi Marie, I graduated in 1986 from a three year nursing program in Charlotte, NC...I have been working relief nursing for the past 5 yrs....I had took 9 years off to be a full time homemaker, I heard there was a need in the local ER and so I took the plunge back into nursing....now I need to work due to all the expenses of not only my having BC, but having 2 teenagers....and of course with gas prices etc the cost of living is rising quite fast. anyway did you go to nursing sch. right after HS....I am 43... You are almost at the 5 year mark in survival....2/22/09 will be 5 years for you. I was wondering if you did  tamoxifen and if so how is that going? Being in oncology you have a lot of knowledge and experience. Jo Ann, sounds like the MRI dept is giving you the run around...we know how long sometimes things take or that sometimes paperwork or computers have their problems...I am sure everything will get cleared up. i hope everything comes out negative for the heart issue of your DH, the family history sometimes overrides any healthy habit you undertake...but with what you said, I would tend to believe it is hernia related. I had a ferritin and cbc drawn this am, I have been slightly anemic and low iron since all this treatment....and been taking ferrous sulfate for 10 weeks, usually the onc nurse calls me around 6pm to tell me what to do as far as getting repeat blood work or taking the FeSO4. Well have a great evening all! Amber",
      "MessageIndex": 18,
      "PostDate": "18/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "amberyba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64846/profile",
      "Content": "Sep 18, 2008 07:42PM amberyba wrote: I wouldn't worry, You know my sister is a nurse as well and had BC when she was 32, now she is fixing to turn 42 and she didn't take the hormonals, though she tried...she is doing great. I was contemplating the surgery and just radiation...but I am trying the tamoxifen. but I am taing CoQ10 and flaxoil with the tamoxifen....I wonder if any other nurses are using alternative in addition to traditional... Well have a great evening.",
      "MessageIndex": 20,
      "PostDate": "18/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    }
  ]
}