{
  "AuthorID": "AmericanBed…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131215/profile",
  "Posts": [{
    "AuthorID": "AmericanBed…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131215/profile",
    "Content": "Jun 24, 2011 10:00AM AmericanBedu wrote: My initial experience with MD Anderson was when my husband received treatment there for a rare leukemia in 2009.  I am pleased to say that with the facilitation of his primary oncologist where we were living he was able to receive his appointment in a matter of weeks.  With his specific diagnosis we were instructed to plan on 2 weeks of testing and then treatment for 9-12 months. During the time we were there my own cancer relapsed.  I believe his already being an established patient and the fact we had been living out of the United States helped in my receiving an expedited appointment and acceptance as a patient. Yes; it is imperative to collect all medical records, slides, scans, etc., in advance and then be prepared to complete even more forms prior to the actual appointment.  That is the hardest and most stressful part.  Once in the system, you are there and so many doors of opportunity and treatment options open.  MD Anderson has programs for the patient, caregiver and family members. The Texas Medical Center is the largest group of specialized hospitals in the world and it is instantly seen and felt.  MD Anderson is a large facility of multiple buildings yet each building is similar to a hotel with a concierge and information center.  There are patient advocates and social workers there to help one navigate the system. I think though most important is where YOU feel the most comfortable and confident.  I am now treated at Carolina BioOncology Institute outside of Charlotte, NC.  My oncologist is a former MD Anderson consultant and I like that in addition to specializing in oncology, he remains very active in research and clinical trials. Don't be fearful or afraid to ask questions of your medical team and ensure the explanations or directions given are understood.  YOU are also an important part of the team.",
    "MessageIndex": 26,
    "PostDate": "24/06/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770478",
    "Title": "thinking of heading to MD Anderson for consultaton gracem PJB"
  }]
}