{
  "AuthorID": "Ammonova",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
  "Posts": [
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Jan 31, 2013 09:10AM Ammonova wrote: Sending good happy thoughts to you! my biopsy is next wednesday so i feel you for sure! same to you spincera!",
      "MessageIndex": 14,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799675",
      "Title": "Who's Getting a Biopsy Tomorrow? MishaT Southernangel"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Ammonova wrote: I have my pre op appointment today for my excusional biopsy that is scheduled for wednesday. can anyone recomend any questions to ask or what info i might want? thank you! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799933",
      "Title": "Pre-Op for excusional biopsy today - questions to ask? Ammonova ginger2345"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Feb 4, 2013 08:26AM Ammonova wrote: Thank you! i'm adding those to my list :)",
      "MessageIndex": 2,
      "PostDate": "04/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799933",
      "Title": "Pre-Op for excusional biopsy today - questions to ask? Ammonova ginger2345"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Feb 5, 2013 06:22PM Ammonova wrote: thank you guys :) it makes me feel better that i'm not the only one who is getting worked up into a frenzie! and yeah i haven't been able to eat - my stomach is a giant knot. i keep randomly sweating or getting dizzy. i caught myself almost hyperventalating a second ago and i've chewed all of my nails down to a nub. if i wasn't so..nervous/scared/panicked/frustraited i would be laughing histarically at myself. i probably could have left work but i've found some little things to keep me busy and if i went home i'd just go to sleep...so maybe if i wear myself out a lot i'll sleep tonight. with the help of a bottle of wine. embrase the suck...now that's something i can relate to and take to heart. my dad is laughing at me right now because as he puts it 'you build bombs and work with explosives everyday, you've been to afghanistan more then once, you raise a 7 year old boy by yourself - at least now i know your human and can actually be nervous or anxious about something' thanks again so much ladies...i'm breathing...taking it slow...Misha...the waiting...it's awful. i hope you get your results soon!",
      "MessageIndex": 6,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799987",
      "Title": "Excusional biopsy in the morning - freaking out Ammonova SarahsMom"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Feb 4, 2013 12:54PM Ammonova wrote: my pre op was with several people, i was actually very impressed and comforted with it! they did blood work, i spoke to an anastesialogist (i'm sure i spelled that all sorts of wrong...) and one of the assisting nurses that will be there, as well as some of the staff that will be taking care of me before and after the surgery. Thank you all for your suggested questions! i feel much more comfortable and informed about it now... of course until tomorrow - when i'll be freaking out all day because my surgery is on wednesday!",
      "MessageIndex": 10,
      "PostDate": "04/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799933",
      "Title": "Pre-Op for excusional biopsy today - questions to ask? Ammonova ginger2345"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Feb 2, 2013 05:28AM Ammonova wrote: At least they are still optimistic and up beat and doing the biopsy to be sure! You got the biopsy scheduled soon too! Sending B9 thoughts at you this weekend. Hang in there!",
      "MessageIndex": 17,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799475",
      "Title": "awaiting first mammogram. 26 years old. Hart Ammonova"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Ammonova wrote: Big deep breath. I'm all robed up and just waiting for my iv. Having my dad here is helping...wish me luck ladies and thank you all for all the suport and caring you've shown me! Ill update after the surgery. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800045",
      "Title": "at the hospital for my biopsy Ammonova mrenee68"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Feb 7, 2013 10:48AM Ammonova wrote: Hello ladies! thank you for all your thoughts and prayers. the surgery is over and i guess it went well. from what the surgeon was saying it was bigger then he thought. today i'm very bruised (looks like he had to dig a little into the muscle right underneeth my breast...ouch!) in some pain but on looooots of pain killers. the incision looks pretty bad but it's brand new so i'm not to worried about it yet. it is a huge reliefe just to have that thing GONE! still no word on path results yet but i don't expect to hear anything until tomorrow at the earliest. the hospital staff was very nice and even called about an hour ago to check on me. it was kind of funny because that orange disinfectant stuff they use? i was covered in it! it's like the dumped a bucket it of it on me. lol much to my embarassment my best friend and house mate (god bless her) stripped me from the waist up an scrubbed it all off for me! the washcloth was rinsing out orange! i'm going to go lay back down and rest for a bit until my son gets home from school. as soon as i hear anything i'll post. thank you again so very much for your thoughts and support...i really don't know what i would have done without it! lots of love to all of you!",
      "MessageIndex": 11,
      "PostDate": "07/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800045",
      "Title": "at the hospital for my biopsy Ammonova mrenee68"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Ammonova wrote: my biopsy is tomorrow morning. i'm suposed to be there at 7. i'm at work right now it's 9 in the morning and i'm freaking out. i'm sick to my stomach, i'm sweating, i can't concentraite (on anything except BC and biopsy research...stupid google) my father is coming in this afternoon which is kinda awkward for me considering the situation and i just...need some kind words or someone to slap me and tell me to chill the hell out. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799987",
      "Title": "Excusional biopsy in the morning - freaking out Ammonova SarahsMom"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Feb 1, 2013 07:50AM Ammonova wrote: how frustraiting! i'm so sorry! hopefully the MRI goes through - can you maybe go to another doctor for a second opinion or someone that will treat your concerns seriously? fingers grossed for you!",
      "MessageIndex": 4,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799753",
      "Title": "cant let it go..... ashleysscared lostinmo"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Feb 5, 2013 03:28PM Ammonova wrote: i've had surgery before - it's not so much the surgery it's self i'm worried about...well a little bit the tumor is pretty big so i'm worried about being disfigured - eventhough the surgeon said i wouldn't be - still worried. and the results - said it would take 24 to 48 hours for the pathology reports. however since i'm in the military they have to send the reports to base and wait for my doctor there to review them so...who knows how or when i'll hear! i'm a single mom and ... yeah i've just got myself really worked up about it today since it's so soon. really wish i had brought a sedative with me to work ha ha ha.",
      "MessageIndex": 2,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799987",
      "Title": "Excusional biopsy in the morning - freaking out Ammonova SarahsMom"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Jan 29, 2013 08:22PM Ammonova wrote: Hello, I'm 28 and going through the same thing. have a large lump in my right breast (3.4x1.0x3.4 cm). i've had the diagnostic ultra sound and mammo - was rated a BI-RADS-4 and am going to have an excisiniol biopsy done next week. the waiting is tearing me apart! My heart goes out to you! I noticed durring all of my tests so far that eventhough the tech's aren't suposed to tell you anything - if you make polite conversation and get them talking you can get some information. say things like 'oh wow that's pretty neat, i've been thinking about radiology, how long have you been doing it?\" butter them up - act interested in the picture and not the diagnosis and you'll get some good tid-bits. waiting for the results is the worst, and they will probalby want to biopsy.  I was shocked because i exected a needle biopsy - the lump is easy to see and feel and closer to the surface so why not just do that? but my surgeon wants the whole thing out just to 'be safe' my thoughts are with you! good luck and keep me posted please?",
      "MessageIndex": 12,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799475",
      "Title": "awaiting first mammogram. 26 years old. Hart Ammonova"
    },
    {
      "AuthorID": "Ammonova",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167442/profile",
      "Content": "Jan 31, 2013 01:23PM Ammonova wrote: The waiting is awful heart! i've been a nervous wreck waiting for my biopsy and was a nervous wreck waiting my mammo and U/S before that! i also did endless ammounts of research so that if they all decided to whisper with me in the room i'd understand the termonology! as far as other symptoms at first i wanted to say no but...My nipple the breast with the lump is inverted and has been for quite some time. I was told that was natrual since i did breast feed my kid for awhile. but now i'm wondering...why would it take so long to do that...and would it stay like that? (my son is 7 years old!) and now i also have a lot of pain / sensativity under my breast on the bottom around to under the arm pit. So i'm not sure if that's related either - or is it just sore from me poking around so much? other then those i can't think of any other symptoms at all. i've also been told that it is probably a fibroadenom if a slightly large one. so here's crossing our fingers for both of us! after your x-rays (tomorrow?) don't freak out if they want to biopsy just to be safe... that was my shocker. i figured they'd want to biopsy, and if not i was going to ask for one. i just assumed it would be a needle biopsy so i was kind of floored when he jumped straight to 'lets just take the whole thing out!' thos forum has been my sanity for the last few weeks eventhough i only recently started posting so this is a good place to stick around! you are in my thoughts though! this whole process sucks!",
      "MessageIndex": 14,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799475",
      "Title": "awaiting first mammogram. 26 years old. Hart Ammonova"
    }
  ]
}