{
  "AuthorID": "amy394",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71597/profile",
  "Posts": [
    {
      "AuthorID": "amy394",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71597/profile",
      "Content": "Oct 4, 2008 09:47AM amy394 wrote: Hi - Just wanted to let you know you are not alone.  My case sounds very similar to yours. I had a suspicious mammo which showed microcalcifications and was sent for a mag image mammo. After the mag image, I was told by the radiologist that this appeared to be a malignancy and was sent for a core needle biopsy. The pathology results were sclerosing adenosis which the radiologist strongly disagreed with.  After being told by the surgeon (that the radiologist referred me to) that she would rather \"wait and see what happens over the next year\", I decided to go to the comprehensive breast center at Brigham and Women's Hospital.  B&W re-read my pathology slides and dx me with atypical hyperplasia and I underwent a wide opening excisional biopsy with wire localization this week, 9/29.  I am now waiting, not so patiently, for the results.   I would like to strongly suggest you trust your own instincts and be your own advocate.  If you have any doubts or questions that have gone unanswered, get a second opinion - preferably from a hospital that specializes in breast care.  Nobody cares as much about your health than you do!! Good luck my thoughts and prayers are with you. Amy ",
      "MessageIndex": 6,
      "PostDate": "04/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722198",
      "Title": "HELP NEEDED...Microcalcifications- biopsy coming up busymomof4 leaf"
    },
    {
      "AuthorID": "amy394",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71597/profile",
      "Content": "Oct 5, 2008 07:23PM amy394 wrote: Just wanted to let you know my Dr. called on Sat with the results of my path report.  All findings are B9!  I wanted to thank all of you who are such an incredible support system for women like me - you are truly an amazing group of people!!   Be patient busymomof4 and never lose faith. Thanks again. AMY ",
      "MessageIndex": 12,
      "PostDate": "05/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722198",
      "Title": "HELP NEEDED...Microcalcifications- biopsy coming up busymomof4 leaf"
    },
    {
      "AuthorID": "amy394",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71597/profile",
      "Content": "Sep 1, 2008 03:32PM amy394 wrote: Thanks for the advice. I have an appointment scheduled at Brig & Womens tomorrow in Boston and I am so afraid they are going to put this off as well.   I wish you all the best and I will let you know how things go tomorrow.   ",
      "MessageIndex": 2,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/720452",
      "Title": "conflicting diagnosis of sclerosing adenosis amy394 amy394"
    },
    {
      "AuthorID": "amy394",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71597/profile",
      "Content": "Sep 1, 2008 05:04PM amy394 wrote: Thank you so much for the reply.   I'm very eager to have a specialist look at the results.  I need peace of mind. I'll let you know how I make out tomorrow. And you are sooo right about the testicle thing!! ",
      "MessageIndex": 5,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/720452",
      "Title": "conflicting diagnosis of sclerosing adenosis amy394 amy394"
    },
    {
      "AuthorID": "amy394",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71597/profile",
      "Content": "Sep 1, 2008 07:21PM amy394 wrote: Thank you so much! It helps to know others have been through this.  I'm hoping Brigham & Women's hospital will see the need for the excisional biopsy so I can have more definitive results.  I will PM you to let you know the results. Thanks for the support. ",
      "MessageIndex": 7,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/720452",
      "Title": "conflicting diagnosis of sclerosing adenosis amy394 amy394"
    },
    {
      "AuthorID": "amy394",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71597/profile",
      "Content": "amy394 wrote: I just joined the forum with hopes that someone can help me! I was called back in for mag image mammo on 08/08 due to microcalcifications found in the upper, outer area of my right breast.  Upon conclusion of the mag image mammo, the Dr. informed me that he was \"highly suspicious\" of a malignancy and assigned BIRADS 5. I was scheduled for, and had a stereotactic biopsy on 08/11 by a different Dr. The pathology results came back with a diagnosis of sclerosing adenosis.  Both radiologists are skeptical of the pathology results and they referred me to a surgeon for an excisional biopsy to rule out any possible malignancy.  Upon meeting the surgeon for the excisional biopsy consult, she told me she thought it would be best to NOT perform the excisional biopsy and wait 6 months to see if there are any changes to the area. I am scared to death that this could be a malignancy and I can't imagine waiting another 6 months to have a resolution to this. Has anyone had a similar diagnosis/misdiagnosis?   Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/720452",
      "Title": "conflicting diagnosis of sclerosing adenosis amy394 amy394"
    }
  ]
}