{
  "AuthorID": "Amy988",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248976/profile",
  "Posts": [
    {
      "AuthorID": "Amy988",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248976/profile",
      "Content": "Mar 27, 2017 09:58AM Amy988 wrote: I have just seen alot of people who got misdiagnosed because of their age etc, so I was unsure whether I should be asking for a biopsy or just ignore it . From the thread before I hadnt had any imaging tests",
      "MessageIndex": 2,
      "PostDate": "27/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/853755",
      "Title": "Should I ask for biopsy? not confident Amy988 mustlovepoodles"
    },
    {
      "AuthorID": "Amy988",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248976/profile",
      "Content": "Mar 29, 2017 10:51AM Amy988 wrote: on youtube and in the news I have seen young girls get misdiagnosed because they tend to assume it cant be anything serious because of age. I understand that it is very uncommon but it is still possible. It says on google that fibroadenomas have clearly defined edges, but mine doesnt. It feels like a circular lump attached to some thick breast tissue on either side , hence why im concerned and think they may have got it wrong",
      "MessageIndex": 10,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/853755",
      "Title": "Should I ask for biopsy? not confident Amy988 mustlovepoodles"
    },
    {
      "AuthorID": "Amy988",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248976/profile",
      "Content": "Amy988 wrote: i just went for an ultrasound on a lump I found in the breast, which to me feels attached to other thicker breast tissue. Yet they still diagnosed me with a fibroadenoma. The first woman checked with the ultrasound and she wasnt to sure on whether to biopsy or not because Im 20 and dont like to do biopsies unless they are fairly certain, so she went to get the consultant to then check and she confirmed that I dont need a biopsy. I asked why the other lady needed the second opinion and she said it was because one side looks like breast tissue and the other part she could see a lump but it didnt look suspicious so im some what confused . Should I be confident in a sense that even the consultant said that all is fine ? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/853755",
      "Title": "Should I ask for biopsy? not confident Amy988 mustlovepoodles"
    },
    {
      "AuthorID": "Amy988",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248976/profile",
      "Content": "Mar 28, 2017 12:42AM Amy988 wrote: I have seen a couple of young girls who have written their stories online saying they got diagnosed with fibroadenoma but she pushed for a biopsy, got it and found out it was actually breast cancer. So I have a worry that if I leave it , it could cause trouble",
      "MessageIndex": 6,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/853755",
      "Title": "Should I ask for biopsy? not confident Amy988 mustlovepoodles"
    }
  ]
}