{
  "AuthorID": "AmyA7",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79190/profile",
  "Posts": [
    {
      "AuthorID": "AmyA7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79190/profile",
      "Content": "Mar 30, 2009 01:04PM AmyA7 wrote: Snowflake & Brian, I agree with all the postings on this board about finding a surgeon, oncologist, and plastic surgeon (if needed). I've had an amazing team of care-givers. My oncologist is the best! I asked a nurse to recommend a breast surgeon and even though I don't think she was suppose to she did -- and I've been very pleased. My breast surgeon recommended an oncologist and a couple plastic surgeons. I really lucked out with all my doctors. They are great! I was in denial or shell-shocked for a long time after diagnosis and surgery and even during treatment. My motto \"one day at a time\" really helped me cope. I'm approaching my one year dx (diagnosis) anniversary and also one year in remission as well! It is very shocking but try to take one day at time. When I was first dx I couldn't even go on these discussion boards it was too overwhelming, just in the past few months I'm able to go on and encourage others by sharing my experience. Please know that you are not alone and rely on people -- it sounds bizarre but you will never feel more loved on this journey. Take good care and hang in there! Hugs, Amy",
      "MessageIndex": 18,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/731591",
      "Title": "Just diagnosed - what should we look for in a doctor? Snowflake70 LindaYO"
    },
    {
      "AuthorID": "AmyA7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79190/profile",
      "Content": "Mar 31, 2009 08:32AM AmyA7 wrote: Thanks for the update Brian. I'm sending prayers and hugs your way as well. Your wife is exactly where she needs to be right now. It's amazing how things turn out. Like others have advise take it one step at a time. Don't worry about the timing or delay in BC treatment -- I had day surgery to remove a hematoma in my left breast one year ago today. My BS assured me that it was a \"hematoma, hematoma, hematoma and nothing else\" her words exactly. I remember it like it was yesterday. Imagine my surprise and disbelief when she called me April 3, 2008 and said that the pathologist found cancerous cells. I had an MRI then had to deal with different opinions from various radiologists (long story). I sought a second opinion and even went to my gynolocologist for insight. I had a mastectomy on May 7. Anyway, my point in telling you about my journey is to say don't panic about the delay in treatment -- your wife is exactly where she needs to be right now. Take good care and one day at a time! Gg08 - Congrats on your one year anniversary. It feels good to be one year out from all this!!! I think just sharing your experience with others is definitely helpful! :-) Just my opinoin. Hugs to you!",
      "MessageIndex": 23,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/731591",
      "Title": "Just diagnosed - what should we look for in a doctor? Snowflake70 LindaYO"
    }
  ]
}