{
  "AuthorID": "amyg47",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254166/profile",
  "Posts": [
    {
      "AuthorID": "amyg47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254166/profile",
      "Content": "Jun 18, 2017 08:58AM amyg47 wrote: Thank you for your replies. I did not mean not taken seriously about my breast, I meant not taken seriously about my fear for IBC as I have researched and asked for the tests that I am having done - but i guess that is called advocacy and thanks to some amazing women in cyber space that have helped direct me thus far. I am thankful for your replies and for all of the amazing information that I have gathered here. Hoping that after this skin biopsy on Tuesday, I can put this to rest for now. Keeping you all in my prayers and thank you again.",
      "MessageIndex": 5,
      "PostDate": "18/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856200",
      "Title": "Worried about IBC amyg47 Kicks"
    },
    {
      "AuthorID": "amyg47",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254166/profile",
      "Content": "amyg47 wrote: I am making myself crazy. A week and a half ago I woke up with a swollen, red, sore breast. There seemed to be something that resembled a blister so I thought....hmmmmm how did I get this infection? I waited a few days but symptoms were getting worse so i went to gyno. Gyno thought maybe a boil deep under the skin.....she tried to squeeze it....OW - nope no head, no puss, nothing. Put me on 200mg doxy and sent me home to schedule diagnostic mammo and sono. I am on day 6 of antibiotics and some of the redness and swelling has subsided. Just on the 1st day. Since then it remains the same. I went for the brutal, painful mammo and sono (because of the swelling OUCH) and the tech said, I don't see much. I see what looks like it could be an abscess but it doesn't go very deep. I also see some skin thickening but that's all. After the sono, the radiologist came in and basically shook his head at me for reading online and said this is not IBC - there is no tumor. Wait what? Everything I read about IBC says that there is typically no tumor? So now I sit here - waiting for someone to take me seriously. My breast is not very swollen anymore - which I know is a good thing. There is still quite a large area of redness and pain and of course the mushy purple area that my gyno thought could be a boil deep down under. I couldn't get into the surgeon for a few weeks so I am seeing a dermatologist on Tuesday and asking for a punch biopsy. I hate not being taken seriously. I do feel like if this was an infection....I would have a fever? Feel sick? Or perhaps it would be better by now on antibiotics? Does anybody know if redness can go down a bit with antibiotics? Shouldn't it resolve completely? I am 47 - 14 years out from being a breastfeeding momma. I'm feeling very uneasy about this. Advice? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856200",
      "Title": "Worried about IBC amyg47 Kicks"
    }
  ]
}