{
  "AuthorID": "amylsp",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
  "Posts": [
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 2, 2014 02:01PM amylsp wrote:",
      "MessageIndex": 39,
      "PostDate": "02/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 3, 2014 06:00PM amylsp wrote: Good Luck with your Chemo tomorrow Kiwi!  I've been feeling slowly better each day.  Evenings have been the worst for the fatigue and indigestion.  Just make sure to give yourself a few days to veg out.",
      "MessageIndex": 54,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 22, 2014 03:49AM - edited Nov 22, 2014 03:57AM by amylsp Thanks Chris! I too was secretly hoping I wouldn't lose my hair. I hope you find a beautiful wig that speaks to you. To be honest, I'm feeling nervous about wearing my wig in public for the first time tomorrow. It just screams 'wig' when I look at myself in the mirror. But my husband reassures me that's because I know it's a wig, and it's different from how my hair has ever looked. I will probably only wear my wig occasionally. I look forward to having fun with the hats and scarves.",
      "MessageIndex": 359,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 9, 2014 11:39AM - edited Nov 9, 2014 11:41AM by amylsp I've finally been starting to feel more normal now that I am 1 week + from my chemo. That was until today. Was food shopping and had to race to the bathroom with an attack of the 'big D'! Taking it easy and feeling a little better now. Chopped my hair super short and got a beautiful wig yesterday, so I now feel prepared for the hair loss that should be starting soon. Glad to hear others have also started or are about to start their chemo. It feels so good to get the ball rolling. ",
      "MessageIndex": 133,
      "PostDate": "09/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 19, 2014 06:51AM amylsp wrote: I had my husband buzz cut my hair on Monday night. It was so liberating and my head feels so much better. My hair is about 1/2 an inch long at this point and still shedding. But it's much less painful now than when the hair was longer. I'll try and post a pic later. .",
      "MessageIndex": 295,
      "PostDate": "19/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 21, 2014 09:29PM - edited Nov 21, 2014 09:38PM by amylsp  I just got back from my second Chemo. Four more to go! It was very uneventful. Just feeling tired. Here's a picture of me with one of my new turbans. My Chemo takes place in a hospital. It's comfy, but definitely doesn't look like a yoga center! If this Chemo is anything like the first, I'll experience my crash on Sunday and Monday. I'm going to be proactive and take more stomach meds this time to see if I can avoid the heartburn tho. Love seeing the pictures of everyone. It's great to put a face to all the names  ",
      "MessageIndex": 347,
      "PostDate": "21/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 21, 2014 09:36PM - edited Nov 21, 2014 09:37PM by amylsp  Here I am with my buzzed head. I just buzzed it on Monday and it's amazing how much has continued to fall out since then. I have several bald spots, especially on the back of my head from rubbing against the pillow. I'm going to watch a friend's play tomorrow, so my wig will have it's 'maiden voyage'. I hope all of us that have started our chemo are not feeling too badly. Good luck to all the ladies starting chemo next week. And a wonderful Thanksgiving to all",
      "MessageIndex": 348,
      "PostDate": "21/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 22, 2014 03:04AM amylsp wrote: Thanks KnittingPT. It's very comfortable. I also just bought the exact same silky navy blue Turban that you were sporting a few pages back. I love the look of that one, for slightly more fancy occasions, And you look quite fetching in your hat! AnnSF, thankyou so much for sharing your story about hair loss and finding your groove. It was beautiful to read. It really speaks to how struggle and difficulty can help lead us to discover inner strength and healing potential that we might not realize we had.",
      "MessageIndex": 354,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 22, 2014 12:24AM - edited Nov 22, 2014 12:32AM by amylsp  TallyLassie, I got a short pixie cut too. I only had it for one week before I had to buzz it tho. It's too bad I couldn't hold onto it longer as I was enjoying it. One great thing about the buzz cut is the 0 upkeep. Shampoo, pat dry and you're ready to go! Once it all falls out, I guess I won't even need the shampoo! You look great. Thanks for sharing the pics.  ",
      "MessageIndex": 350,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Dec 19, 2014 05:59AM amylsp wrote: WheelyGirl, the first time my husband buzz cut me, I still had quite a bit of hair left and we went down to about 1/4 inch. Once I started getting big bald patches, he took it down to about 1/8 of an inch. Even after my 3rd Chemo last Friday, I still have a small amount hair left and it's actually growing, lol. I've heard that leaving a small length of hair is less likely to irritate the follicles than going totally smooth, but I don't know if this is true or not. MidLifeCrisis, I hope the folliculitis is clearing up. I developed a rash on my head, as well. But it cleared up with some witch hazel and hydrocortizone cream. My MO had mentioned putting me on antibiotics if it got worse. Wishing a clear head for you soon! Seagirl, You look great, and that list was precious! Starting to feel a bit more normal 1 week out from Chemo 3. Lots of heartburn and indigestion, but new medications I'm on have made it a bit more manageable. Looking forward to feeling better by Christmas next week. I'm really behind on getting ready though!",
      "MessageIndex": 733,
      "PostDate": "19/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Jan 21, 2015 09:43PM amylsp wrote: Another one missing in action here! Just not been feeling up to posting much. Going in for my 5th chemo this Friday. My 6th and last chemo is scheduled for February 13th. The 4th treatment was definitely the toughest so far, compounded by the fact that I am now mildly anemic. But I definitely start to feel better by the 2nd and 3rd week, so that's always something to look forward to. Hopefully that will remain for the last two treatments. It's good to feel that I'm in the homestretch! Looking forward to chemo being behind me. Well wishes to everyone. We will all be finishing this part of our journey soon!",
      "MessageIndex": 850,
      "PostDate": "21/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 2, 2014 05:28PM amylsp wrote: Thanks Erica!  So far I feel better today than yesterday.  Still significantly fatigued though.  The mouthwash seems to be working pretty good.  No mouth sores, and just a bit of sticky mouth. ",
      "MessageIndex": 42,
      "PostDate": "02/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Oct 30, 2014 05:12PM amylsp wrote: Just returned home from Chemo.  It was a long day (10:30-5:00), as I met with my Oncologist before the appointment.  The Chemo itself took about 5 hours as they infused the three drugs slowly to make sure I did not have a bad reaction.  I've been told the next Chemo will be about 3 1/2 to 4 hours from check in to check out.  I had a friend sit with me today, and that was actually very nice.  I'm not sure I will be able to have someone with me every time, but it was sure nice for the first time, and I recommend it, if possible My only reactions so far are flushed skin (especially my cheeks) - I look like I've spent the day in the sun.  The nurse says this is from the Dexamethasone (the steroid I'm taking for a few days).  I'm also starting to develop a little heartburn.  Hopefully it will not get worse, as I'm prone to gastritis and GERD, normally.  I also feel a little fatigued, but that's probably from the Benadryl.  It felt so good to finally have my first appointment, and get the ball rolling.  Waiting for a month, with all the nervousness and worrying seemed almost worse than actually starting the treatments!  Now I can say \"one down, five more to go\"! The best of luck to everyone.  I'm glad to be a part of this thread.",
      "MessageIndex": 24,
      "PostDate": "30/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 5, 2014 02:52PM - edited Nov 5, 2014 02:55PM by amylsp",
      "MessageIndex": 80,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 17, 2014 06:08AM amylsp wrote: Hi all! My thoughts and prayers are with Erica, Chris, Mrshq1 and anyone else starting Chemo this week. You will get through it, and it feels so good to get the ball rolling! I have my second infusion this Friday the 21st. I'm not looking forward to it, to be honest. I've been feeling more and more myself as the days go by, and know that feeling will go once I get the chemo again. Just have to keep marching on! In terms of current SE's, my head is really sore and bruised feeling. Even lying on my pillow hurts. My hair started shedding last Friday and really picked up last night. It's not coming out in clumps yet, but I wouldn't be surprised if that started soon. So I've decided that today is the day for the hair to go. It makes me feel sad, but I will have my husband give me the buzz cut tonight. I have my wig and a few hats, and just ordered a few pretty scarves from TLC. So at least I'm ready! The other current SE is sleep disturbance. I have no problem falling asleep, but wake up multiple times a night. I'm not in pain or discomfort when I wake up and don't feel particularly anxious. I just can't sleep through the night. I'll have to ask my MO about that when I see him this Thursday. As for myself, I'm 53 years old. I have a great husband and a 13 year old son. My son has some special needs - he has anxiety disorder and autistic spectrum disorder - so he keeps my husband and I busy and on our toes! He's a great kid, but it can also be very stressful at times. I've been working as a Massage Therapist for 25 years and love my work. I'm self-employed and work out of my home, which will hopefully make working through treatment much more doable. So glad to have found these boards, and to have the support of all you fine ladies.",
      "MessageIndex": 237,
      "PostDate": "17/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Oct 29, 2014 11:37AM amylsp wrote: Hi all, I've been lurking on the boards since August after I was diagnosed.  After three surgeries, I'm finally ready to start Chemo tomorrow (10/30).  Feeling very nervous, but grateful for all the suggestions in this thread and on the board in general.",
      "MessageIndex": 12,
      "PostDate": "29/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 22, 2014 03:33PM - edited Nov 22, 2014 03:52PM by amylsp Thatcameragirl, days 3 and 4 were the worst for me during treatment 1 as well. I attribute it, in part, to being off the steroid after day 2. We'll see how it goes with this infusion. Midlifecrisis, my headaches have only been mild, but I haven't been taking anti nausia meds. I do have the sore nose though. It's alternately runny, and then crusty dry, and it sometimes is a little bloody when I blow my nose. I've been taking claritin every day, not just the nulasta days, so I don't know if that's been helping or not, as my discomfort doesn't seem to be quie as bad as what you're describing. Liwi, thanks for sharing the 'chemo top'. I'll have to check it out. I, unfortunately, have been hit with the heartburn again. None of my normal prescription meds seem to be working that well. It hasn't been severe, but just boardering on severe. I've suffered from reflux and GERD for over 18 years, so this is probably going to be one of my weak areas in terms of SE's. I might give my gastroenterologist a call. She's a two time BC survivor, and might have some additional suggestions, over and above what my MO has been able to offer ",
      "MessageIndex": 370,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 24, 2014 05:55AM amylsp wrote: Morning Ladies. Unfortunately I spent 6 hours in the emergency room yesterday! My heartburn has been bad this time around, so I guess I have not been eating and drinking as well as I should. I drove to the hospital yesterday morning for my Nulasta shot and felt Ok. When I sat down to eat some lunch though, the heartburn got really intense. I tried all my usual cures and nothing was working. So I decided to take a shower, thinking it would make me feel better. That was a big mistake. My son was at his friend's house and my husband was grocery shopping. I wasn't in the shower for more than five minutes when it felt like I was going to pass out. I barely got myself out of the shower and had to lie on the floor because my legs were so weak. I was finally able to get myself up and walk to the bedroom to call my husband and the last thing I remember is picking up the phone. Next thing I know, I wake up on the floor. I apparently smacked my head and chin good and hard on either the dresser or the wooden rocking chair in the process, but I don't remember anything. I was able to call my husband on the phone and get him home. and we called my oncology emergency number. My MO was the doctor on call, and he said I was probably badly dehydrated and being in the hot steamy shower lowered my blood pressure enough to cause me to black out. I had to go to the emergency room for a CT scan and blood work to make sure my head and blood levels were OK. Everything looked good and I got sent home last night, with just a mild headache and a good sized contusion on my forehead and chin. I did find some time to laugh though. When I went to the bathroom at one point while at the hospital, I got quite the scare when I looked in the mirror. Between the buzzed cut head with massive bald spots, contusions and abrasions on my face and head, and a bright yellow face mask, I was quite the sight! Hoping the heartburn doesn't get bad today. It's currently lurking in the background. Waiting for my gastroenterologist's office to open to see if she has any good suggestions. Hoping to get some good, well needed rest today! Hope everyone is doing well. ",
      "MessageIndex": 401,
      "PostDate": "24/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 13, 2014 05:21AM amylsp wrote: VintageGal, I'm so sorry you're going through this again, and so soon! My heart goes out to you. Stay strong! We're all here to support you. Day 15 and hair seems to be holding on. My scalp feels sore though, so I guess it's only a matter of time. Week two out from chemo was a breeze compared to week one. I'm still very fatigued by late afternoon/evening, but the indigestion has calmed down significantly. Entering week three seems bittersweet though, because I know at the end of it, I'm just going to get slammed again. .Going to my first support group today at the local area Hope Club. Looking forward to it! ",
      "MessageIndex": 166,
      "PostDate": "13/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 17, 2014 08:26AM - edited Nov 17, 2014 08:28AM by amylsp Hi KnittingPT! We can't have fur bearing pets as my husband is allergic. I really miss having cats and dogs, as I grew up having them. But I do have a great Cockatiel named Cricket, who just turned 17, and Willie the Goldfish, who is surprisingly entertaining to watch!",
      "MessageIndex": 239,
      "PostDate": "17/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Dec 13, 2014 04:16PM - edited Dec 13, 2014 04:19PM by amylsp Sorry I've been missing in action. I've very behind in the posts and it's hard to catch up. Just had my third THC yesterday. Three down three to go! On my gastroenterologit's avice, i started senekot with slool softener the day before chemo. I ended up waking up every two hours last night with bad diarrhea, but if it means my heartburn will be less intense than it will be worth it. My bad days are usually Sat night through Tuesday morning. Will see how it goes this time around. Starting to get used to wearing my wigs in public. Still feels weird! Got a nice shoulder length wig through my insurance and a cute pixie cut wig through Paula Young. Good continued chemo journey to everyone!  ",
      "MessageIndex": 695,
      "PostDate": "13/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 26, 2014 03:39PM amylsp wrote: Hi Marcela. That sounds like my day on Sunday, except I ended up in the emergency room. I was all alone in the house and got really lightheaded in the shower. Got out and had to lay on the floor for a few minutes. After that, walked to the bedroom to call my husband and passed out. Gave myself a nice bruise/contusion on my forehead and chin in the process! The combination of the hot steamy shower and the dehydration was what did it. Stay hydrated Ladies! I haven't had the really bad taste yet. But some Ladies talk about drinking Gatorade or adding Gatorade powder to water to make it easier to drink. (?) Been slowly feeling better. Thanks everyone for your well wishes. Going to my Sister-in-Law's for Thanksgiving. Hoping to have some kind of appetite by then! Have a great Holiday weekend everyone!",
      "MessageIndex": 442,
      "PostDate": "26/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Jul 19, 2017 03:01AM amylsp wrote: The 3 year anniversary for diagnosis for a number of us is right around this time. It is great to be three years out! Here's to many more!",
      "MessageIndex": 928,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Oct 29, 2014 05:39PM amylsp wrote: Thanks for the welcome Erica!  I'll let you all know how it goes tomorrow.",
      "MessageIndex": 14,
      "PostDate": "29/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 1, 2014 02:42PM amylsp wrote:",
      "MessageIndex": 32,
      "PostDate": "01/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Mar 10, 2015 07:29PM amylsp wrote: It's so great to see everyone finishing up with chemo one by one. I'm almost four weeks out from my last chemo, and finally starting to feel better this week - fatigue hit me pretty bad the last round. I have my 'Dry Run' for radiation tomorrow and start the radiation treatments on Monday. I'm definitely feeling nervous, but figure if I can get through chemo, I can definitely get through radiation. Good luck to everyone finishing up!",
      "MessageIndex": 912,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Jan 28, 2015 06:19AM - edited Jan 28, 2015 06:22AM by amylsp Had my 5th Chemo last Friday, only one more to go (2/13)! I'm anemic, and now my platelets are a bit low as well. My MO seems more concerned about the platelet count, and slightly lowered the dose for Carboplatin this time around. He also lowered the dose for the steroids on the 3rd day (only 1 pill instead of 4) due to all my gastrointestinal issues, and I'm happy to say this is the first round that I did not experience the severe heartburn, which was a great relief! I\"m still pulling out of the first week funk, but I will work today and feel up to it (sort of!). I'm also getting 6 TC treatments instead of 4, which is fine with me, tbh. My MO said it's due to the aggressiveness of my tumor which is Her2+ as well having micropapillary features. I also showed evidence of lympho-vascular involvement in addition to the one node that was positive. So I think 4 vs 6 might be based on how aggressively the MO believes the cancer should be treated. I think 4 treatments is standard at this point, and 6 is probably reserved for more aggressive cases. I had axillary cording develop in my arm after my three surgeries. I stretched it and massaged it myself and it seemed to clear up. After 4th chemo though, it reared it's ugly head again and I was experiencing pain when reaching up for things. One thing I discovered though was that I was really dehydrated at the time. Once I re-hydrated, the pain disappeared and has not returned. I will definitely see a Lymphodema specialist once I finish Radiation, but it was interesting how lack of hydration made the cording worse. Just thought i would pass that on. Glad to see so many of us finishing up with our final chemo treatments. I will still post updates here, but hoping to see some of you over in the spring radiation thread once that gets started.",
      "MessageIndex": 884,
      "PostDate": "28/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Feb 17, 2015 11:10AM amylsp wrote: It's been very quiet in our thread! Just wanted to let you all know I had my LAST Chemo treatment on Friday the 13th of all days, LOL! All 6 TCH treatments are now behind me and it feels so good. I will continue with my Herceptin treatments every three weeks through the end of October, and will start Rads in about 4 weeks or so. So happy to be moving on with my treatment. My thoughts and prayers are with all of you still finishing Chemo, and a speedy recovery to those of you who have finished. Maybe I will see some of you in the Spring Radiation thread. Hope everyone is doing ok! :)",
      "MessageIndex": 897,
      "PostDate": "17/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Apr 27, 2015 01:06AM amylsp wrote: Hi Tally! It's so great to be on the other side of treatment, isn't it. I have my last three radiation treatments and will be done with that on Wednesday. Next, onto hormone treatment - starting with tamoxifen in the next few weeks. Like you, I'm continuing with Herceptin as well. I've had three solo Herceptin treatments so far, and very few side effects as far as I can tell. Thinking of all the November 2014 Ladies and wishing everyone well!  ",
      "MessageIndex": 918,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 4, 2015 04:03AM amylsp wrote: Jean, the area under my collar bone is also very sensitive to the touch (not necessarily painful). The best I can describe is that it feels slightly bruised. I have no hardness except the incision scar which is hard and slightly painful when I massage it. I think these things are probably normal.",
      "MessageIndex": 3218,
      "PostDate": "04/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Apr 29, 2015 08:01AM amylsp wrote: Hi, I'm from the spring thread, but have a question for you Ladies. I just finished radiation treatment today (28 full breast/ 5 Boosts). I was told by both the RO and Nurse NOT to use sunscreen on the treated area (the breast all the way up to the collar bone), and to instead keep the area completely covered for 6 months! When I asked why, they said all the additives and ingredients in sunscreen can cause skin irritation to the treatment area. Has anyone else been told not to use sunscreen? I might try to find a more natural sunscreen without a lot of additives. I definitely do not like the idea of no sunscreen, or keeping the area completely covered all summer long. What have others experienced with the use of sunscreen? Thanks!",
      "MessageIndex": 2850,
      "PostDate": "29/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Apr 30, 2015 05:53AM - edited Apr 30, 2015 05:53AM by amylsp \"amylsp, I finished rads on March 30 (15 whole breast and 4 boosts), and NO ONE has ever told me not to use sunscreen in the radiated area (about the same general area as yours).\" Thanks so much Kayfry. I've also searched online for contraindications regarding sunscreen on irradiated skin and can barely find anything. I think this is a case of my RO erring on the cautious side. Does anyone have any experience with more natural sunscreens that don't have a lot of additives?",
      "MessageIndex": 2859,
      "PostDate": "30/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Sep 16, 2015 08:27AM amylsp wrote:",
      "MessageIndex": 22575,
      "PostDate": "16/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 24, 2015 07:01PM amylsp wrote: I did chemo first and then radiation. For me, radiation was much easier. The hardest part was having to go 5 days a week for 33 treatments. Luckily I only lived 20 minutes away. My skin did get quite red and a bit uncomfortable towards the end, but no peeling or blisters. I used aquafor and aloe vera several times a day, as needed. Fatigue was noticable, but again, not as bad as Chemo.",
      "MessageIndex": 6,
      "PostDate": "24/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836994",
      "Title": "Any Women Who Had No Problems During Radiation? ChiSandy Grammy4"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Nov 21, 2014 02:22AM amylsp wrote: Hi Eleanor, I'm in the November Chemo group but lurk in this thread. Here's a Link that gives info about the Oncotype DX. It's given to women at Stage 1 or 2 who are Node Negative to assess the possibility of the cancer reoccurring. Your Doctor is probably recommending you consider Chemo because a score of '23' falls into the 'Intermediate Risk Category' for the cancer recurring. I'm not sure about how many days it's safe to wait, but in my situation I had to wait 73 days from my original surgery for chemo to begin as I unfortunately had three surgeries. It does make me nervous that I had to wait so long, given my cancer is Grade 3 and node positive, but it couldn't be helped. If you do decide to go with Chemo, it is probably better to start sooner than later, imo. Good Luck with your decision! Either way, there's a lot of great support on this board.",
      "MessageIndex": 597,
      "PostDate": "21/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Dec 2, 2016 08:22AM amylsp wrote: Hang in there Ladies! From the 2014 November Group and here to say that life does return to normal, albeit a new 'normal'. My best advice is to stay hydrated. Just keep a liquid by your side and keep sipping. The more hydrated you are, the less the SE's. Wishing you all speedy and manageable treaments. :)",
      "MessageIndex": 820,
      "PostDate": "02/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "amylsp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205690/profile",
      "Content": "Jan 27, 2017 11:16AM amylsp wrote: Just had my port removed this past Tuesday after having it in for 29 months! It feels so great!! I had it done at the hospital with conscious sedation, and it all went without a hitch. I had some soreness for a few days and it's still a bit swollen in the area, but otherwise no complications so far. I had my BS use actual stitches this time, as I consistently have issues with dissoluble stitches. So hopefully the iscision will stay closed after she removes the stitches next Friday. That's the only thing I'm currently worried about.",
      "MessageIndex": 28,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850385",
      "Title": "TERRIFIED of getting my port taken out - how bad is it? CrawfordsMommy Tinyfrog"
    }
  ]
}