{
  "AuthorID": "AmyL",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10951/profile",
  "Posts": [
    {
      "AuthorID": "AmyL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10951/profile",
      "Content": "Sep 27, 2007 01:17AM AmyL wrote: River, The vaccine trial is a new Phase I trial out of Memorial Sloan Kettering. I can't explain it now but here's the link to the brief. It basically hopes to teach your body to produce cancer fighting cells. www.mskcc.org/mskcc/html/2270.... To be elidgible you need to have either stable or NED. It looks like I'm going to do it. This trial just opened and I'll be the first participant. I just got new scans that came back stable and figure why not add one more weapon to the arsenal.",
      "MessageIndex": 23,
      "PostDate": "27/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/691993",
      "Title": "bone mets survivors riverinerabbit mom2acat"
    },
    {
      "AuthorID": "AmyL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10951/profile",
      "Content": "Sep 13, 2007 04:05PM AmyL wrote: I have bone mets. I was diagnosed in November, a year after finishing chemo AC&T. I'm ER+ and was on Tamoxifen and Lupron when I recurred. I was diagnosed at 33 so I was premenopausal. My treatment has been and oopherectomy, arimidex and monthly zometa infustions. I'm also looking into vaccine trials. I'm now stable/healing and my markers have dropped into the low end of normal range.",
      "MessageIndex": 20,
      "PostDate": "13/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/691993",
      "Title": "bone mets survivors riverinerabbit mom2acat"
    },
    {
      "AuthorID": "AmyL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10951/profile",
      "Content": "Sep 27, 2007 08:50PM AmyL wrote: Hi River, Yes, I have bone mets. This is not for Her2, they have a different one for Her2. I'll keep you posted. Amy",
      "MessageIndex": 25,
      "PostDate": "27/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/691993",
      "Title": "bone mets survivors riverinerabbit mom2acat"
    },
    {
      "AuthorID": "AmyL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10951/profile",
      "Content": "Sep 29, 2007 06:04AM - edited Sep 29, 2007 06:04AM by AmyL I am VERY Pro Oncotype DX Testing I was one of the earlier takers of the test back in June of 05. I was Stage 1, Grade 2, 1.1 cm tumor, ER+100/Pr-, node negative, no lymphovascular invasion. I was in the grey area for chemo though my onc was pushing for it because of my age, 33. I got the test done and scored 36 which is high, it means a 25% chance of recurrance without chemo. I trusted the test and did AC&T x4 dose dense then went on to do Tamoxifen and Lupron. November of 2006 I metastize to my bones and validate that test. Everyone including my oncologist was shocked that I recurred. That high score always made me nervous. Get the test done. My insurance denied it and it went to every level of appeal. They billed me very long after that, at least a year after the test. They offered me a payment plan and I said I couldn't pay. I haven't received a bill since and that was close to a year ago. I think/hope they wrote it off. Amy",
      "MessageIndex": 46,
      "PostDate": "29/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/650646",
      "Title": "Oncotype Dx test... Harley44 123JustMe"
    }
  ]
}