{
  "AuthorID": "amypat",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80604/profile",
  "Posts": [
    {
      "AuthorID": "amypat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80604/profile",
      "Content": "amypat wrote: I really need someone's input!  I'm scared to death and have no one to talk to.   My mother had breast cancer at the age of 44 and had a masectomy.  My father and brother have cancer also.  So I'm a little scared!  I recently found a lump in my left breast during a self exam, went to the doctor, she felt it and immediately sent me to have a mammogram and ultrasound.  My doctor is out of town so I haven't been able to get the results from her, but I did go to the imaging place and got a copy of the report.  The mammogram rated it as a Category 2: Benign findings...but the ultrasound reads the following:  \"Single enlarged left axilary lymph node.  No corresponding sonographic finding to the area of palpable concern in the left breast and recommend further management by a breast surgeon. \"  So of course the term \"breast surgeon\" has me concerned until I can talk to my doctor.  Does anyone have any insight or had a similar report?  Any help would be great!  Thanks so much to everyone who hung around to read!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730434",
      "Title": "Need help understanding test results...please! amypat Ina"
    },
    {
      "AuthorID": "amypat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80604/profile",
      "Content": "Mar 16, 2009 06:08AM amypat wrote: Ok, so I went to the surgeon and they have scheduled a MRI for Wednesday.  The lump in the breast that was once palpable to myself and my doctor is no longer palpable.  The lump in the lymph node is still not palpable.  The surgeon doesn't seem overly concerned but wants to do the MRI because of my family history.  The surgeon scheduled the MRI at a place that can also do a biopsy if necessary.  I guess I need to clarify it with him, because I'm not sure if he plans on some type of biopsy being done at the same time or not.  Is it customary to go in for just a MRI and a biopsy be done at the same time?  Or do they usually tell you in advance?  I guess I just need to clarify with the surgeon.  Also, is it possible to have just cancer in the lymph nodes?  ",
      "MessageIndex": 5,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730434",
      "Title": "Need help understanding test results...please! amypat Ina"
    },
    {
      "AuthorID": "amypat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80604/profile",
      "Content": "Mar 10, 2009 07:21AM amypat wrote: Thanks so much Lories!!  I have been anxiously awaiting a response!!!  The doctor being out of town is very bad timing for me!!!",
      "MessageIndex": 2,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730434",
      "Title": "Need help understanding test results...please! amypat Ina"
    },
    {
      "AuthorID": "amypat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80604/profile",
      "Content": "Mar 18, 2009 04:46AM amypat wrote: Thank you ubuana.  I am greatful that my surgeon is being cautious and sending me for the MRI.  Like everyone else waiting for results, I am just really worried.  My father has lymph node/gland cancer with some other types of cancers.  So I'm just really worried.  Thanks to everyone else who has responded to all of my post.  There is an amazing group of women on this website.  Very brave.  Best wishes to everyone.",
      "MessageIndex": 8,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/730434",
      "Title": "Need help understanding test results...please! amypat Ina"
    }
  ]
}