{
  "AuthorID": "ana92",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261181/profile",
  "Posts": [
    {
      "AuthorID": "ana92",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261181/profile",
      "Content": "ana92 wrote: Hi guys, This is my first post to this forum so please redirect me if I've posted this in the wrong place! I've recently had a breast ultrasound performed because I felt some lumps in my right breast. My GP sent me right away because I'm BRCA1 positive. The US showed a fibroadenoma in my left breast which I wasn't concerned about (I've had this biopsied a year ago and there's been no growth). It also showed two small cysts in my right breast (which are new for me and apparently what I've been feeling) and scar tissue on my right breast as well. The scar tissue and cysts were not found on my previous US done about 6 months ago, and I'm kind of confused how I could have developed scar tissue on a breast that I've never had surgery or a biopsy on? GP couldnt really give me any clear answers so wondering if anyone has had any experience with this before? Thanks in advance. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/859313",
      "Title": "Scar Tissue in Breast, No Trauma?? ana92 ana92"
    },
    {
      "AuthorID": "ana92",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261181/profile",
      "Content": "Oct 19, 2017 02:41AM ana92 wrote: Thanks for the reply ktktbird360, The ultrasound report says scar tissue (didn't specify a radial scar?). Was yours identified on ultrasound or mammogram? Hope all the testing goes well for you.  Yes, I definitely want a specialist so I can avoid unnecessary stress! 🙄",
      "MessageIndex": 7,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/859313",
      "Title": "Scar Tissue in Breast, No Trauma?? ana92 ana92"
    },
    {
      "AuthorID": "ana92",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261181/profile",
      "Content": "Oct 12, 2017 01:50AM ana92 wrote: Thank you for your reply! My ultrasound was just done at a standard imaging centre-not specifically for breast cancer. I'm working on finding a good breast specialist in my area, mostly because I feel that most health care professionals I've seen simply disregard any serious possibility of me developing beast cancer because of my age. I was in a car accident late last year, but I have had US since then with no scar tissue identified. This has pretty much popped up in the last 6 months and I've definitely not had any trauma to my breast in this time. I feel like I'm probably being paranoid and I want to just trust that it's not a big deal but I'm just finding it hard to wrap my head around this",
      "MessageIndex": 5,
      "PostDate": "12/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/859313",
      "Title": "Scar Tissue in Breast, No Trauma?? ana92 ana92"
    }
  ]
}