{
  "AuthorID": "anafoefana",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
  "Posts": [
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Apr 4, 2012 11:46AM anafoefana wrote: LuvRVing, love your hair!  Ossa, at least your hair is dark and not mostly white!  I have come to terms with my gray and sort of like it, but it does age you!  Still, I don't think I will dye it anymore. You look great by the way! I have the same issue with the waving, curling thing.  It is waving in the back and sort of curling on one side. On the top it is growing in all different directions.  At this point I am just going with it... at least it is hair and it is mine!!!  My eyelashes are finally making a come back!  Woo hoo.  I have been using Latisse for 6 weeks.",
      "MessageIndex": 14762,
      "PostDate": "04/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "May 20, 2012 11:21AM anafoefana wrote: Hi ladies, Ossa and MizMarie, you guys look great!!   I had my first cut a few weeks ago.  I was starting to feel like I had a mullet since the back and sides grew faster in the beginning.  I am still gray, and keeping it.  My question is on eyelashes.  I am using Latisse and have been since the beginning of March.  My lashes are long and about the same as they were before all this started, but.... on my right eye, right smack in the middle, they grow in.... and fall out again.  Even with Latisse!!! Thank goodness for individual fake lashes! Has anyone else experienced this?  grrrrr",
      "MessageIndex": 15403,
      "PostDate": "20/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jul 3, 2012 09:47AM anafoefana wrote: Dragonfly, you look great!  Ossa, yes, I am very grateful for the treatment as well.  I did okay through most of it. I really did not know how bad I felt through TCH until I started feeling better.  Radiation and the lumpectomy were a breeze and I did not have any SEs with Herceptin. It all worked the way it was supposed to for me!  About my hair.. still not sure what I am going to do.  I am going to visit my brothers in a couple of weeks. They have not seen me since before I was diagnosed, so I will see what they think. They are not very diplomatic and certainly will not hold their opinions back.  It is all in loving fun, and we will see how many jokes they come up with.  On another note, Latisse is finally working for me and I have long eyelashes!  Yay!  Has anyone used generic Latisse?  Just wondering if it is the same.",
      "MessageIndex": 16310,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jul 2, 2012 04:40PM anafoefana wrote: Thanks all for the coloring suggestions.  I will explore some of the those options.  Has anyone tried Herbatint?  They say it covers gray really well and is a natural coloring. Hmmm.   I've had my hair cut twice, it is very short because it is growing unevenly and my hairdresser wants the top to catch up with the sides and back. Part of me is tempted to keep it this short because it is so easy, but at the same time, it is a constant reminder of what I have been through.  Ossa, you always look great! I've been lurking lately, not posting much.  I just marked the end of my treatment today as I had my port removed.  Almost a year to the date of when it when in.  What a year this has been!",
      "MessageIndex": 16279,
      "PostDate": "02/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Mar 10, 2012 06:15PM anafoefana wrote: After all that has happened to me in the last year, I am just glad I have hair. I am getting the \" I like your haircut.\" comment from strangers and it makes me smile.  I have a lot of white, but it seems to be darkening.  I have tri-color strands, white tips, brown middle and black roots.The back is darker than the front.  I am not sure if I will color it again, but for now, hair is good, it does not matter if it is white! My eyelashes are still struggling.  I have been using latisse for 4 weeks and have not noticed much change.  They fell out a second time a few weeks ago.  Has anyone experienced that?  I have not worn my contacts since November and I am hoping to wear them again someday, but can't without  eyelashes because I get stuff in my eyes. ",
      "MessageIndex": 14455,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 16, 2012 08:41PM anafoefana wrote: I am about 16 weeks PFC and have been going topless for about 2 weeks.  My hair is very short and mostly gray.  It is very interesting, some of the longer strands are tricolor ( I feel like my beagle). The tips are white, the middle is brown and the roots are black. The hair on the top of my head took longer to come in and it is not as full as it is on the sides and the back.  Is that common?  I am not sure if my hair is going to get curly ( I had straight hair before chemo).  It is very soft and feels and kind of looks like cotton.  I am just glad to have hair!  I don't think I will dye it anymore.  I lost my eyebrows and lashes about 5 weeks PFC and my brows came in right away, but my lashes are still struggling.  They are very short and I have gaps.  I just started using Latisse.  For those of you who have used it, does it really work? My lashes were not super long or full, but they were good enough!   I am hoping Latisse will come to my rescue!",
      "MessageIndex": 14037,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Apr 5, 2012 11:20AM anafoefana wrote: Ossa, Latisse is working!  It took about 4 weeks to see anything, but in the last couple of weeks my lashes are really filling in and actually growing longer.  The few I had were so short and stubby!  I am using one brush for both eyes and have made it last a little longer.  The nurse at my MO gave the name of a PS who \"deals\" L:atisse at a lower cost, so I am going to check him out.  Too bad the lashes will fall right back out when we stop using it!  I am okay with the gray hair.  I think I will keep it this way for now anyway.  It mostly black in the back.  My hair was ash brown before all this.   I have been using Mane and Tail horse shampoo and conditioner.  I don't know if it really helps, but my hair is very soft and is pretty thick now.  It took a long time to fill in, but it has and now just needs to grow a bit.  ",
      "MessageIndex": 14789,
      "PostDate": "05/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jul 1, 2012 04:27PM - edited Jul 1, 2012 04:28PM by anafoefana I know somewhere people have talked about coloring their hair.  I was all set to keep my gray and the other day the cashier at a store asked me if I wanted a senior citizen discount.  She meant well, but boy, what a reality check!  I am not 55 yet and have always been told I look young for my age.  I didn't think it would bother me, but it has, enough that I think I am ready to color it.  I've been done with chemo for a long time now and my hair is growing.  I've had it cut a couple of times and while it is mostly salt and pepper, the hair around my face is mostly white. It is short, but there is plenty of it.  Any recommendations, doing it yourself vs going to a salon?  I have always colored my own and am pretty good at it, but I am wondering if it is okay to use the same products I used before?  My hair came back very similar in texture as to what it was.  It is a little curly on the back of my head, but the rest is pretty much what I had before.  Any advice is welcome.  I think I am ready! ",
      "MessageIndex": 16237,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 12, 2012 02:27PM anafoefana wrote: Elizabeth59, I would not minimize anyone's cancer as I am a cancer patient myself.  I am sorry if that is what you thought I was implying.  I sure did not mean for it to come across that way.  I was merely commenting on \"how can someone feel a small tumor\".  Many people find their tumors before a doctor does. I think it is important for us to know our bodies.  That does not imply that you or anyone else is responsible for the stage of your disease. I apologize if that is the way it came across. ",
      "MessageIndex": 193,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 13, 2012 12:15AM anafoefana wrote: 5kidsmom, My RO convinced me to do radiation on the nodes also because of the size of my tumor.  She presented my case to the interdisciplinary board at the hospital and based on current research, she felt  and everyone on the board agreed that it was really important to have them done. I didn't show any node involvement in the beginning, but I don't know if I had micromets.  I had a SNB, she took 3 nodes and nodes and margins were clear.  The RO said that coming out of neoadjuvant treatment it is hard to say that the nodes were not involved and she told me that without radiation, my  odds of recurrence increased significantly.  So, I have 3 more rad treatments on my whole breast and nodes, and will have 8 boosters on the lumpectomy site.  The way I saw it, if I am getting radiation anyway and it improves my odds, go for it.   J-Bug, I am sorry you are having such a hard time with rads.  I am doing okay with them.  My armpit is sore, but nothing terrible.  I quit wearing a bra this weekend, because it was rubbing.  I am wearing a camisole with a built in bra, and it is working.  I hope your burns heal quickly.  I am using Miaderm, emu oil and aquaphor nightly.  I have also been putting aloe vera on right after the treatments before getting dressed.  I just fan myself dry and that seems to help cool things off right away.  I have to share a story.  I mentioned I work with children with autism.  I have one little guy that has been pinching breasts.  On Friday I was putting another child in a chair and this little one ran across the room and from behind me put his arms around me and pinched me as hard as he could.  He could have at least pinched my other side!!  I screamed so loud that it startled everyone.  I was in a lot of pain for the rest of the day. I told my assistants I may have to take leave until he stops doing that!!  It hurt! Never a dull moment in my classroom! Back to reality tomorrow.  I hope everyone has a great week. ",
      "MessageIndex": 198,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 15, 2012 12:53AM anafoefana wrote: Leanna9, no worries.  I think I don't express myself very well sometimes and written words can be misinterpreted.  Twistedsteel, I agree this cancer stuff stinks.  ",
      "MessageIndex": 226,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 16, 2012 02:48AM anafoefana wrote: I found my lump,  but did not get excited about it at first.  I have a history of lumps and dense tissue.  My mammograms had been normal, I had one 6 months before feeling the lump.  I probably should have gone to the dr sooner,  found the lump in February and did not see the dr until May when I realized it was growing and fast.  It was about the size of a pea when I first felt it. When I finally got to the dr. I knew it was bad by the look on her face.  When I went for the mammo, I knew, but they would not say anything until I had a biopsy.  Waiting was very hard, but fortunately the news came within two days of the biopsy.  I have no complaints about my doctors. The hospital has a BC center where all the docs work as a team.  I felt informed and well cared for.  I am going to another hospital for radiation because it is closer to home, but it is also a BC center and all of the drs. speak highly of each other.  Initially I thought my tumor was 4.5 cmm because that is what the biopsy pathology report said.  I did not realize it was 7 cmm until I received the second MRI report after chemo.  Chemo got all of it, there was no trace of it.  The BS removed 2 cmm of tissue and the margins were clear.   I should not have any caving from radiation because of the way she did the surgery.  My left breast is smaller than the right now, but I don't think anyone can tell unless they stare at me.  I don't have large breasts either (34B) so my chest is not something that calls attention anyway.  Eve and pixel, it is sad to hear that there are such unprofessional drs out there. ",
      "MessageIndex": 68,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 10, 2012 02:09AM anafoefana wrote: Hi all, I have been fighting a cold (like J-Bug) for over a week.  I took off from work on Friday and Monday, but we had a federal audit on Tuesday and I needed to be there. I went in yesterday and today and will go back tomorrow, but I feel pretty crappy.  The stuffy nose is not getting better and I have a very dry non-productive cough.  It has been awful during my rads treatments because my throat starts itching and I have to hold it and not cough.  Yesterday they were taking pictures and I just couldn't contain it and I coughed. My eyes were tearing from trying to hold it and my glasses got stuck to my eyelids... it was a mess.  They had to do the pictures again today and I barely made it through the treatment. It was a huge relief to cough!   J-Bug, glad you are better. Sorry to hear you are having skin issues.   I had #21 out of 33  today and am a little pink, but holding up okay otherwise.  I only have 4 more whole breast treatments. It is hard not to be in control of our lives.  I think that although I try to accept things as they come, it is really hard not to be able to do what you want or need to do.  But, you are almost done with rads and hopefully the next part won't be hard.   My sister in law has just been diagnosed.  She is stage 0, ISDC.  She does not know yet what they are going to do besides a lumpectomy.  She may not have to have rads, but I  am pretty sure she will have Tamoxifen, as she is ER+PR- HER2-.  There are too many people with this! ",
      "MessageIndex": 175,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Mar 17, 2012 01:21PM anafoefana wrote: Indigo and hope, sorry you are here.  It stinks, especially in the beginning when there are so many unknowns.  You will feel better and it will not be as overwhelming as you begin your treatment.  Who knew there was so much to learn?  One of the families I work with gave me a poem about how we live our life around plan A.  This is plan B.  We just have to change things for a while!  I am so grateful to everyone on these forums.  I have learned so much from them.  There is so much you don't get from the Drs and nurses and the ladies here are a wonderful source of support.  Ana",
      "MessageIndex": 276,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 12, 2012 02:20AM anafoefana wrote: J-Bug,  it was unfortunate to have that conversation now.  I am going to a different hospital for radiation because it is closer to my house.  I am very happy with the surgeon and oncologist and the team of doctors at the first hospital,  Everyone has been so happy and encouraging with my response to chemo.  My tumor was mostly in situ and my nodes appeared clear even before chemo so I was comfortable with my decision to just do minimal node dissection.  The RO told me that radiation will be enough to make sure and she also told me that we had a home run and it would be a shame to take a chance on changing that.  I am okay with it.  Things have gone so well for me until now, I am keeping my fingers crossed that they will continue that way. Phila, would a lithotripsy be out of the question for your stones?  I had one when I had 7 and a 5.  That is less invasive although though it still means out patient surgery.  Just wondering since you are going through so much already!",
      "MessageIndex": 54,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 21, 2012 04:51AM anafoefana wrote: The dense tissue seems to be common for us.  I had a history of lumps that came and went. Sometimes they got pretty large, and then would dissappear completely. They were linked to my menstrual cycle and were usually very painful.  Ossa, mine was very small when I first felt it also, and then it grew very fast over a few weeks and did not go away.  That is what prompted me to go to the Dr.  I was not due for another mamogram until August.  I felt the lump the end of February and in May it grew very fast.  I was diagnosed on June 10th.   I could hardly feel my tumor after the first TCH and it was completely gone by the 5th treatment.  My margins and nodes were clear after surgery.  I just started rads and will be on Herceptin until July.  I am really looking forward to being done. I have a little maltese dog that for the last 3 years would jump on my chest and put both paws on my left breast and press down.  He did that every morning when we woke up  and I told my husband \"I wonder if he is trying to tell me I have cancer.\"   My husband told me I was crazy. He doesn't try to jump on me like that anymore, but I know that there are cancer detecting dogs.  ",
      "MessageIndex": 102,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 22, 2012 02:40PM anafoefana wrote: panamajayne,  not sure about herceptin cost.  My insurance covers it, but I do have a copay for every visit.   You are having stomach issues with Herceptin? I have a little stiffeness in the mornings, but that is the only side effect from it.  So far my heart is good, my numbers are actually higher each time. I hope you feel better soon! ",
      "MessageIndex": 108,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 13, 2012 12:21PM anafoefana wrote: Wow... again I apologize if I offended anyone by my comments.  I was only saying what I thought, it never occured to me that it was offensive.  I am sorry.  What else can I say? I  would really appreciate it if we can just let this go now.  We are all going through this and there is no need to be hurtful or sarcastic. Ossa, you are right,  I was merely trying to stress the importance of self exams.  Maybe it won't help everyone, but it does save lives. It certainly did mine.  I was not due for another mammo for several months and had I not felt my tumor I would probably not be where I am now.   5 kidsmom and Ossa, my skin is doing well.  I am slightly pink, mostly tanned. I don't know if it is the emu oil, or the combination of that with Miaderm, aquaphor,and aloe.  I really like emu oil, it doesn't have a smell and is absorbed quickly.  ",
      "MessageIndex": 208,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Sep 9, 2012 03:56AM anafoefana wrote: J-Bug, Sorry you are having a hard time.  I did not go this route as I had a lumpectomy, but would have if I had a mast.  I've finished my treatment, had my port removed in July and have been trying to get on with life. I had neo-adjuvant and was a good candidate for a lumpectomy even though my tumor was 7 cmm. I do not have large breast, but the mass was completely gone and I was fortunate to have clear margins and nodes.  I had radiation too. That part was easy, but I am feeling the effects of it still.  I ended up with a frozen shoulder and have been to PT for several weeks. It is helping, but don't know if I will regain full motion.  The area where I had radiation is very tender and having my first mammogram was the most painful experience since all this started.  I have not developed lymphedema. I am hoping I won't but I guess that can happen at any time.  Twistedsteel, you are so right. This disease stinks! Way to many people are affected and dying from it!  It is such a helpless feeling! ",
      "MessageIndex": 346,
      "PostDate": "09/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 20, 2012 12:16PM anafoefana wrote: Phila,  you are in my prayers.  I am sorry you are going through this and I hope you can find some answers soon.  Keep us updated.",
      "MessageIndex": 85,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 11, 2012 04:12PM anafoefana wrote: I had a history of lumpy breasts, they came and went for years.  I noticed my tumor when it was the size of a pea, a year ago.  I had a trip planned to Japan the end of March, and I really didn't want anything to get in the way of that, so I was going to go to the doctor when I came back mid April if the lump was still there.  When I got back from my trip, it was still there, and a little bigger.  I made an appt with my ob and she could not see me until the end of  May.  Then, life happened, I was overwhelmed at work and forgot about my lump.  Mid May I noticed the lump was huge, from pea size to lemon size.  I am not very big, so it was noticeable.  I went to my PC, who sent me for a mammo and ultra sound the next day.  I had a biopsy the next week and my official diagnosis on June 10th.  Everything moved very quickly after that.  My MO said my cancer was very aggressive, but fortunately my tumor was mostly in situ. I don't like to go around telling people how bad it was for me in the beginning, but I feel that people think that BC is no big deal.  Most people say \"good thing they caught it early\",  well it was not early, and I just let it slide because there is so much people don't know.  I didn't know either until I was diagnosed, so I try not to be too judgemental.  Leanna9,  I think that if a person knows her body,  she can detect changes, even if they are small.  I guess it might be harder for someone who has large breasts, but I think it is very common for women to detect their tumors before they are picked up by a dr. or mammo.  ",
      "MessageIndex": 185,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Nov 25, 2011 11:29PM anafoefana wrote: Hello, I am having a lumpectomy and sentinel node biopsy on November 29th. I had neo-adjuvant chemo and my 7 cm tumor is gone.  Praying for clear nodes and margins, but prepared to go back if needed. Keepingthefaith, I did not find a November group either.  Wishing all of you the best as we go through these procedures. ",
      "MessageIndex": 50,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 8, 2012 02:56PM anafoefana wrote: J-bug, Thanks for telling me about this thread. I also found my mass, 6 months after my last mammo.  I didn't go to have it checked right away because I have a history of lumps that come and go.  This one did not go and it grew very quickly after a couple of months.  I was diagnosed with IDC. Initially they said it was 4 to 5 cm, then with the MRI it was 7cm, mostly in situ.  I am HER2 + ER/PR-.  I started chemo early July and my mass was almost unpalpable after the first round.  I had a second MRI after my 6th treatment in Oct and there was no trace of the mass and nodes appeared clear.  I had PET scan before starting chemo and I was completely clear except for the breast.   I had a hard time deciding on what surgery to have as I was given the option of a partial mastectomy.  After much discussion and second opinions, I decided to go with the least invasive as my body was and is still recovering from chemo.  I figured I would have to have more than one surgery if I opted for a mastectomy anyway because they would have had to use enlargers for rads. I had a lumpectomy 11/29 and my margins were clear.  I had 3 nodes removed, all negative. .  J-bug, you were diagnosed the same day I was.  What a horrible weekend that was!  My favorite uncle passed away on the 12th, he was 70 and was having tea with his wife and just fell over. You mentioned your children and I wanted to share I am a Special ed teacher and work with Child Find.  I teach 3 to 4 year olds, most of my students this year have autism but my class is a non-cat ID.  Challenging but I love working with the families.  I understand your approach to this whole thing. ductal, you have had a hard ride.  I totally agree with your statement about cancer.  I have had to say that to people who thought they needed to feel sorry for me.  I am the same person, I just have cancer now.  I am fortunate that my family is very supportive and they have been wonderful about taking care of me during my tough days. They do not like to hear me talk about the possibility of recurrence or that just because I am doing so well it means this will be over in July.  I try not to talk about those things, but I wonder and hope I won't be dealing with it again.   I did well through chemo over all, had a few bad days after each treatment and at the end had to have a couple of transfusions. But, I worked through most of it.  I start radiation tomorrow and plan to work through that as well.  I am thinking this will be the easier part of the treatment.  I am still on Herceptin until July, but have not had side effects from it. I am looking at it as the next hurdle.  I try to focus on the positive as much as I can.  Working with children with disabilities I have learned that it is not what they can't do, it is what they can do, that is important.  I try to apply that to everything and I think it just makes life easier.  I am very grateful for wonderful drs, caring nurses, a supportive family and friends. I have no control over what is happening to me, but I would have never imagined that the people around me cared so much about me and I am very grateful. This is plan B..... plan A threw me a curve ball :)",
      "MessageIndex": 49,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 9, 2012 12:19PM anafoefana wrote: Phila, Having had a history of kidney stones and passing several, I can tell you that it might just be that.  I ended up in ER several times for the same stone until they finally passed.  I think that the is the worst pain I have ever had.  I had two children naturally and kidney stones were much more painful than childbirth! I understand not knowing and waiting!  I am sorry you are going through this and hope it is just stones!  Let us know! Thanks J-bug.  Today is my big rads day and I guess I am a little nervous now.  The first day of anything is difficult!  I am sure I will be fine though. Good luck with your appt today.  Mine was very easy and quicker than I thought.  The tatts are not painful. ",
      "MessageIndex": 52,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Oct 7, 2012 05:02AM - edited Oct 7, 2012 05:03AM by anafoefana J-Bug, You have been through a lot and it is good to hear that things are getting better. ",
      "MessageIndex": 363,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778961",
      "Title": "Calling All with Tumors 6 cm + J-Bug CaliKelly"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 21, 2012 07:28AM anafoefana wrote: Lifechanging2011,  I totally hear what you are saying about just because I am not complaining it does not mean I am fine. I get that a lot at work, but at the same time, it is hard to understand it unless you have been through it. I am so glad to have these boards to vent and learn from others who are at the same place I am. I am tired of this journey too.  I will be done with Herceptin in July and can't wait!  I am thankful that everything has gone as well as it has though.  Chef127, the fatigue is unusual, not like just being tired.  On a positive note, I am sleeping much better and through the night.  The bad thing is that I feel like staying in bed in the morning!  5 a.m. comes way too soon!  I will rest this weekend.  I am getting a new student on Monday.  I have a class of 8 four year old special needs boys.  5 of them have severe autism, 3 with physical and cognitve disabilities.  All of them are functioning at about a 2 year old level and all are non verbal. I have one that is like a wild animal, and the new one is an energizer bunny.  So, never a dull moment in my class!  I love my work, but it is draining between the classroom and the paper work.   Momine, you are right, some days I am more beat than others.  I think it is too soon to be so tired, but when I met with the RO this week, she asked if I was experiencing fatigue.  Helen, I am having issues with my naked pictures splashed all over computer screens when I walk in.  The techs are very nice and they make the experience more tolerable, but it is getting old already!  I am very modest and hate to undress in front of anyone, so this hard for me.   No skin issues yet.  I am using aquaphor and emu oil at night after I shower  and  aloe vera right after the treatment.",
      "MessageIndex": 273,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 18, 2012 12:59PM anafoefana wrote: Ralston and Chef, I have little black spots also and developed a huge pimple right at my bra line... so no bra for me!  I also have a lot of moles I did not have before and the spot on my clavicle is very red and sore.  I guess I didn't treat as well as I did my breast!  I have 5 more boosters and I am done!  Time has really gone quickly for me and it has not been too bad. I am almost in the home stretch!  I just have to get through Herceptin until the end of June and I can take a breath.  I know I will never be able to breath easy because this will always be hanging over my head.  I saw my MO this week and she told me to be very careful if I start having headaches.  She said that is the only place Herceptin does not work.   Chef27, how are you feeling?  When do you resume your treatment or have you already?",
      "MessageIndex": 605,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 18, 2012 01:46PM anafoefana wrote: Chef27, Glad to hear you are better.  You will be done in no time.  I am finding the boosters to be easy.  It is shame to drive there every day for a two minute zap!  I am relieved I don't have to do tammox or AI.  Herceptin has been easy for me.  I have a little stiffness in my legs in the mornings but it goes away as soon as I start moving.  I can deal with that.  AnnAlive, I didn't mean to scare you! I think she just wanted me to be aware of it. I had a PET scan, but now she wants me to have an MRI once RADS are done.  I don't think anyone is feeling the need for another PET scan.  All my blood counts are finally back to normal and I think it was just a matter of time.  My liver counts are normal and I am not anemic anymore.  I had trouble with those during chemo and had to have a couple of transfusions.  I have to go for a colonoscopy too.Yuck! Oh well, better to have it done and know everything is okay. ",
      "MessageIndex": 608,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 19, 2012 04:13AM anafoefana wrote: AnnAlive, Thank you for the link.  It is scary to think about, but I am trying to think positively.  It is good to know in case you develop those symptoms.  Being HER2+ is not good, but I think we are better off today than we would have been years ago.  One day at a time is my motto.  I have learned to not be upset over the things I have no control over.  We will be okay! Helen, you are so right.  If all this we are going through makes us cancer free, then it is worth going through! ",
      "MessageIndex": 611,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 21, 2012 03:41AM anafoefana wrote: Okay so my sailing along has come to a halt.  I noticed over the weekend that my arm was sore.  I thought I just slept on it wrong.  Yesterday it was a little more noticeable and today I can barely move it.  It does not look swollen, but I am wondering if it is lymphedema.  Today is a Dr. day anyway, but I had to call in to work because I can't drive.  Grrrr. ",
      "MessageIndex": 630,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 21, 2012 03:17PM anafoefana wrote: Yay Ossa.  It  will go really fast!  J-Bug,  RO says it is not lymphedema.  She thinks my muscles are just inflamed/tightened and she gave me some exercises to do and told me to take Advil.  She measured me for a sleeve, said she wanted me to have it in case. I will be driving one handed to work tomorrow.   I also got a prescription for Silvadene for my clavicle. So, tomorrow will be better right?? They have a gong at the radiation center and everyone who completes treatment gets to hit it the last day.  I am looking forward to making a lot of noise this Friday!",
      "MessageIndex": 639,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 25, 2012 12:31PM anafoefana wrote: Thanks Ossa. You all will be done before you know it and then it just healing time!   I did my share of suntanning in the 70's .  I used to mix coke with baby oil to get a better tan. I think it would have been better to not use anything!   The last time I used that I ended up with blisters on my face and a sunburn so bad it put me in the hospital.  Talk about no knowledge!  ",
      "MessageIndex": 678,
      "PostDate": "25/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Mar 4, 2012 05:20AM anafoefana wrote: Ralston, hoping you are better soon.  I am sorry you are having such a hard time! Ossa, you are so right about the support and understanding.  The people around me feel that I am better now and life can go on as if nothing happened. I try not to make an issue of my cancer, but life is never going to be the same.  Banba, yes.. still cooking although not painful.  I can feel it and it is uncomfortable, but it doesn't really hurt. ",
      "MessageIndex": 746,
      "PostDate": "04/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Mar 10, 2012 01:52PM anafoefana wrote: Hi all, Chef, I hope your blood sugar is under control and thanks for letting us know about the connection with rads.  I am doing okay,  burns are just dark spots now, but my arm is getting progressively worse.  I have limited range of motion without pain.  I am doing the exercises they told me to do, but I think I may need therapy.  I don't see any cording or swelling, just pain. I am going to have to call the dr on Monday.  Grrrr. Ossa you look great! I am glad the emu oil is helping.  It is nice... I am still using it. ",
      "MessageIndex": 778,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Dec 28, 2011 07:48PM anafoefana wrote: Hi, I am going for my simulation tomorrow and I believe I will start on January 5th.  For me, this is the next hurdle.  I had neo adjuvant chemo (TCH) and finished in October.  I had a lumpectomy on November 29th and have clear nodes and margins.  My tumor was 7 cmm and I am HER2+, so chemo was a given.  I am fortunate to have responded as well as I did.  Chemo took its toll on my body and I am still recovering, but I was able to work and maintain my life as normal as possible.  I expect to do the same during radiation.  I am a teacher also and hope to only take a few days towards the end if I need to.  I am still on Herceptin and will be on it until July 2012.  I am very grateful for it and have had minimal SEs since I finished with the other two drugs. Both my oncologist and radiation oncologist have told me that exercise will help with fatigue. It is difficult to find the time when school starts, but it is well worth making the time. ",
      "MessageIndex": 38,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 20, 2012 10:00PM anafoefana wrote: I just had my 7th treatment today.  I have been very tired this week, especially at the end of the day.  It may have nothing to do with rads, but I am worried that it is going to get worse.  I am trying to walk everyday after coming home. Work has been harder than usual.  My students have been out of control this week.  I got bit twice and kicked and punched several times, and it was a short week!  My skin is still normal, but I feel like my breast is shrinking.  It may be just because the swelling from surgery has finally gone down.  Has anyone else noticed that?   Have a good weekend everyone! ",
      "MessageIndex": 268,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 22, 2012 06:31AM anafoefana wrote: Rjbaby, Momine is right.  I had horrible swelling of my ankles after TCH.  It only lasted a few weeks, and now I am fine. Ossa, good to know that we need to keep the lotion going. ",
      "MessageIndex": 290,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Mar 3, 2012 03:47AM anafoefana wrote: Congratulations AnnAlive, NWartlady, and others who finished this week.  I finished a week ago and my skin is better, but the boost area is flaming red.  It continues to get redder everyday, but it is not painful.  My clavicle area finally calmed down and healed and my armpit (now black) is starting to peel.  The little black dots I had all over my breast are slowly dissappearing. Chef, sorry about the taste thing.  I ended up losing 6 lbs during rads, but I did not notice taste changes.  Maybe after having it so bad with chemo, nothing seemed as bad with radiation.  Ossa, you and I are neck and neck.  I finish with herceptin in June.  I started the first week of July last year.  On the one hand I am so ready to be finished, and on the other the idea of not having constant contact with drs is a bit scary.  It is a wierd feeling because I was so healthy before all this came up. Now I am a little paranoid.",
      "MessageIndex": 735,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 10, 2012 03:49PM anafoefana wrote: I was supposed to have my first treatment yesterday, but when I got to the hospital they said the RO needed to talk to me.  She was not there so I had to go home and wonder what in the world was happening. They told me to call her today.  I got a call from the RO today while at work.  She told me she has been feeling really uncomfortable  and felt strongly that she needed to present my case to the multidisciplinary board at the hospital. She said she did that on Friday and that the consesus was that they need to radiate my lymph nodes as well. She said that with the size of my tumor, she really felt that I should have had a complete lymph node dissection (only had sentinel and two) with a lumpectomy.  My breast surgeon was not as sure of the need to radiate the nodes. I told her I was okay with it, I know there is risk of lymphedema but hopefully that won't happen.  I am dissapointed, but I trust the drs and I think they are doing what is best for me in the long run.  I surely don't want to increase my chances of going through this again!  Ralston are you having the nodes done as well?  I guess if they remove them then you don't need to have it.  The RO said that radiation is very effective on the nodes.  I did not have any positive nodes and although my tumor was 7cmm, it was mostly in situ.  I am not sure... but I made the decision to have the nodes done as well.  Hoping no real bad SEs.  I start tomorrow after work.  ",
      "MessageIndex": 153,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 6, 2012 05:02AM anafoefana wrote: Hi all, Chef, you and I are at the same place, today will be #18. I am feeling a little sore also and my nipple is very dark as well.  I have two moles close to the nipple that I did not have before.  I will point them out to the RO tomorrow. I caught a cold and am feeling really miserable.  It is ironic, I managed not to get sick all through chemo and now I am sick. I don't know if the wiped out feeling is from rads or the cold.  My MO said my WBC are low.  I had Herceptin last Thursday and they drew blood. This could just be a combination of things. My RO explained the measuring for boosters last week.  She told me she doesn't like the term boosters because it makes it sound like they give you more.  She said it is just really localized in the area of surgery rather than the whole breast, but it is not \"more\" radiation.  I did not go to work today, but will have to go tomorrow.  Our school division is undergoing a special ed Federal Audit and they are coming to my school.  Everyone is going crazy trying to make sure we are in compliance with everything.  I hope this feeling goes away today!  Have a great week everyone. ",
      "MessageIndex": 476,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 11, 2012 08:49AM anafoefana wrote: #22 down.  3 more whole breast and 8 boosters.  I am holding up pretty well, but am looking a little pink.  My arm pit is sore and my bra is beginning to rub that area.  I find that going bra less in not comfortable for me because I am still sore from the lumpectomy. Does anyone else have that?  Any movement is painful.  Maybe it is from rads? twistedsteel, interesting to learn the 4 day thing.. it makes sense. I guess that is why it is important to continue skin care after treatment is done.  I am glad I won't need tamox, but am still on Herceptin.   I don't really have SEs from that.  AnnAlive,  I read an article recently about radiation producing \"chemo brain\" symptoms as well.  So, if you are foggy, it may be a combination of things.  I don't feel so slow anymore, but I still lose thoughts.  It may be menopause too!  A lot of good excuses! ",
      "MessageIndex": 529,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 11, 2012 10:40AM anafoefana wrote: Ossa, Yes, \"only\" .  When I was diagnosed the BS said that I had to have chemo, and it was better to do it upfront.  If I had surgery first, I would not have had the option.  Both my MO and BS were very encouraging to do breast conservancy because my response to chemo was \"phenomenal\" as they put.  I had the option of whatever I wanted,  and I considered a bilateral, but after discussing it with my uncle who is an onc,  I decided on a lumpectomy.  There was a chance I would have to go back in, but margins and nodes were clear.  My uncle told me that because my body had just been through so much with chemo, it was better (if I had the option) to go with the least invasive to my body.  I was prepared, and still am to have more surgery.  Obviously I do not want to have a recurrence, but there are never any guarantees.    My RO insisted on treating the lymph nodes because of the size of my tumor.  I have a triangle \"tan spot\"right by my collar bone.  It is interesting to learn the different perspectives and options.  I think that Herceptin has been the miracle drug in my case.  My tumor was reduced to almost nothing after the first treatment and was completely gone by #4.  All of the drs were so happy and have told me that people who respond this well to treatment have a very positive outcome.  Obviously, we don't  know what tomorrow will bring, but I hope for the best.  Enjoy your weekend too! ",
      "MessageIndex": 532,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 20, 2012 04:23PM anafoefana wrote: J-Bug and Rockym,  Congratulations!  I have 4 boosters to go and you can stick a fork in me because I will be done! Chef127, I hope your last treatments go quickly and that your skin holds up.  My breast area is fine, but the clavicle area is very red and sore.  I am not peeling or oozing so they will not prescribe anything.  I am just using emu oil and aloe vera on it.  The nurse said to use neosporin on it too.  Interesting that this happened after they finished those treatments.  It has been almost a week since my last whole area treatment. ",
      "MessageIndex": 622,
      "PostDate": "20/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 23, 2012 04:16PM anafoefana wrote: AthabascanWarriorPrincess ask your RO to give you samples of aquaphor or other creams.  You really need to treat your skin in order to prevent the serious burns.  Talk to the nurses and I am sure they will help you out.   Hang in there.  You are going to have more treatments than most of us.  You can buy an aloe vera plant and harvest it to use.  You are better off using 100% aloe.  I cut my leaves up and carry a container with me.  It is very soothing.  It is sticky but you can fan it dry. The plants are not very expensive.  Some grocery stores carry big leaves also. (Whole foods and Wegmans).  You will get through this just as you did other parts of treatment.  I know there are horror stories, but that is not the case for everyone.  ",
      "MessageIndex": 657,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Apr 12, 2012 02:01PM anafoefana wrote: Congratulations Ossa and Ralston.  I am fast approaching that date and really looking  forward to being done with herceptin.  I have 4 more to go!! I don't go back to se the RO until June... is that weird?  Not that I am having any issues.  My skin is back to normal.  I am still having arm pain and mobility issues, but that is happening with both arms.. so maybe it is something else.  I am also having terrible knee pain when I sit for too long.  I have arthritis, and I may just be closer to that surgery. ",
      "MessageIndex": 854,
      "PostDate": "12/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Apr 14, 2012 04:50AM anafoefana wrote: Chef, thanks,  I am hoping the knee pain is related to Herceptin.  Hopefully it will get better. For now, just trying to exercise and rebuild some thigh muscles.  The picture., thanks. I am embracing my silver hair. I think it is going to stay silver.  I have an appt to get my first cut in a few weeks.  I have had to trim the back a couple of times because it was starting to look like a mullet.  I am thankful I did not have to deal with reconstruction.  I almost decided to have a BMX, but am glad I went with a lumpectomy.   Ossa, hope you had that cake and wine!  Woo hoo!  I am starting to feel like a survivor now that I am in the home stretch.  I am walking in the survivor walk at our Relay for life in a few weeks. What a year this has been. J-bug and twisteedsteel, I have a tan mark on my collar bone, but my breast area is back to normal.  The collar bone area was the only area that hurt and peeled, so maybe it has something to do with that.  I can see it is fading , but I think it will just take some more time.  I am still using emu oil on it and it is very soft, but dark. The breast area is very tender still and some areas are very hard.  My MO told me that is all very normal. ",
      "MessageIndex": 861,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 8, 2012 08:50AM anafoefana wrote: J-bug, thanks for the link. Athatbascan, I too was really concerned about rads for a while.  The nurse who did my mapping told me that you usually hear the horror stories, but most people go through it with little consequence.  She said most people do get a little pink, but they do fine.  It was reassuring to me and I am hoping that if I am proactive with the lotions, I will do okay. It is only 6.5 weeks, and we can do anything for a short time!!!  I am sorry for your burns and hope you find some relief!  I have heard from others who have been through it that sometimes it helps to stop for a few days to heal if the burns are really bad.  Maureen, I share J-bug's concern.  Chemo is scary, but the alternative is scarier.  I also agree that being brave does not mean you are fearless.  I was and still am scared!  Every step is scary, but in the end, we get through it and look back and feel like perhaps it was not as bad as we thought it would be.  Not a walk in the park, but doable.  In any case, we will do this together and get through it too!!  ",
      "MessageIndex": 125,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 28, 2012 03:44AM anafoefana wrote: Yesterday was # 12 out of 33 for me.  I was really tired the first few, but now am feeling normal.  I sleep really well at night (better than in a very long time).  My skin looks fine, no changes yet.  I use Aloe Vera right after treatment and Emu oil and Aquaphor at night after I shower.  I am not having any other symptoms and hoping it will stay that way. After chemo and surgery, this part is not too bad.  I am losing weight,  about a pound a week.  Is that typical?  I am not trying to (although I need to).  ",
      "MessageIndex": 381,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 1, 2012 04:23PM anafoefana wrote: Interesting to see the different experiences.  I have a changing room and there is coffee and other drinks available if you want anything.  The techs seem to change a lot,  there is only a couple of consistent people, but they are all very nice. I just had #15 out of 33 and I am holding up well.  I have a little bit of a \"tan\" but am not feeling anything different.  I use aloe right after the treatment, and still using emu oil and aquaphor.  I also got some Miaderm and have used a couple of times.  Fatigue is wierd.  Some days I feel totally wiped out, and then others I am totally normal.  I lost another pound this week.  Not that I am complaining!  It is just kind of weird. Chef, are you still losing also?",
      "MessageIndex": 426,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 15, 2012 05:27PM anafoefana wrote: Sorry to hear that some of you are having trouble. Chef127, I hope you are able to resume quickly and can still travel.    I finished  whole breast today.  Yay!  I am holding up well.  My skin is tanned.. a little red around the collar bone, but otherwise it is good.  I have been using Emu oil and aquaphor from the beginning. I am now using Miaderm as well.  I use aloe vera right after treatment before I get dressed and the others at night.  I am thinking Emu oil is great!!! I am done in a week and two days.  I am ready but I will miss seeing the techs every day.  They are all very pleasant.  If you are thinking about getting Emu oil, make sure it is 100% pure.  I buy mine through Amazon.  Hang in there ladies.  We will all get through this as we did other parts of our treatment.",
      "MessageIndex": 581,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 21, 2012 05:40AM anafoefana wrote: Maureen, Thanks, I only had 3 nodes removed but had them radiated, both axillary and supraclavicle.  I knew going in it was a possibility, and even after they are done.  My RO said she really felt strongly about treating them because of the size of my tumor, even if my margins and nodes were clear.  She told me it was a significant difference it the probability of recurrence.  Oh well...  Hope she has something to help! :) I will ask for a compression sleeve prescription.   I try not to sleep on my left side, but I do end up that way sometimes.  I try to follow the guidelines for preventing LE, but I guess it just happens.  Like I said...oh well.  I have been fortunate to not have other SEs...",
      "MessageIndex": 633,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 22, 2012 02:20PM anafoefana wrote: Maureen, I share my classroom with another teacher and she calls me Ana banana speed racer because  she thinks I drive too fast.  Really she drives too slow!  Yes, I am happy about the LE and I sure hope it stays that way.  I am doing everything I can to prevent it.  I got the sleeve today, not very comfy but I will wear it at work.  It felt better today but it hurts to move it up or to lift anything.  Thank goodness for Advil. NWartlady, thanks, I am relieved it is not LE.   Two more to go... Yay!!!",
      "MessageIndex": 650,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Feb 25, 2012 04:40AM anafoefana wrote: As I teach my students to say \"All done.. finished!\"  Glad this is over, but has not been the worst part of my year.  The area where the boosters were is pretty red, but it is not as bad as the spot on my neck.  That one is healing, starting to peel now.  I was finally prescribed silvedene and that helps.  But aloe vera is the most soothing. I have been walking around with a little container of aloe chunks. It is sticky, but it dries quickly. Chef, it is interesting how cream recommendations differ.  My RO was totally for Emu Oil and aquaphor. She just told me to make sure not to put it on before I came in for treatment.  She said the skin needed to be clean.  I was told that the skin dryness may be permanent.  They said to expect symptoms for 4 to 6 weeks.  Fatiguen never became an issue for me, just off and on.  Hang in there everyone who is almost done. Time goes really fast in the end! ",
      "MessageIndex": 674,
      "PostDate": "25/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Mar 14, 2012 03:31AM anafoefana wrote: Is anyone dealing with more fatigue after treatment?  I seem to be wiped out everyday after work... more than before.  My days are blending into each other!  All I do is sleep and work!",
      "MessageIndex": 788,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Mar 24, 2012 05:09PM anafoefana wrote: JBug, What a relief to have the results come back clean!  I hope you are able to get some rest and that you get calls back from all three of your interviews!  I hope you are not too stressed out and that you can take some time to relax. ",
      "MessageIndex": 840,
      "PostDate": "24/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Apr 1, 2012 02:46PM anafoefana wrote: J-Bug, I am glad you got some rest and that you are feeling better.  I hope by now things have settled down a bit.   I know what you mean about work.  I am fortunate that my job is stable and that my administrators have been incredibly supportive.  When I told my principal about my diagnosis she told me that they would do what ever I wanted to do to make it work.  I had the option of taking a leave of absence, but I decided it was better to work and I am so glad I did. It has been a tough year, not just because of my health, but because I have the most challenging group of children I have ever had. But, I am glad I get to go to work everyday! Hope you have an job offer!!!",
      "MessageIndex": 843,
      "PostDate": "01/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Jan 7, 2012 10:25AM anafoefana wrote: I have my first rads on Monday and I am calm.  I have been using Emu oil twice a day for about a week and hoping everything will go well.  They told me to have \"clean skin\" for treatments, no creams ect.  But, they said it was okay to apply after treatment.  The nurse told me that some of the greasy ointments actually create burns, so try to stay away from them.  The RO is very pro Aquaphor, but I don't like it much as it does not absorb well.  Other people have mentioned Calendula lotion which is supposed to be very good and someone told me about Sween cream. I guess whatever works for you!  I have olive skin and am hoping that will help!   I purchased front opening sport bras and am hoping these will work. I was told that some people cannot wear bras during rads.  I have been wearing these sport bras 24/7 since my lumpectomy and hope to continue.  They are cotton and no frills Fruit of the Loom from Walmart.  I have been told this part of the treatment will be easier than what I have already been through.  Chemo was not terrible, surgery was fine and I recovered quickly, so on to the next hurdle.  I am still on Herceptin, but so far no mentionable side effects from it.  AussieKate Herceptin is a wonderful target drug for HER2.  I was stage 3 with a 7cmm mass which was completely destroyed with chemo.  I had no traces of a mass by the end and my margins and nodes were clear.  I had a lumpectomy 6 weeks ago.  Chemo was not terrible for me and was able to maintain a some what of a normal life during most of it.  tnhelen glad to hear you are doing well.  Do you have noticeable fatigue?  That is my only concern as I  plan to continue working.  I  will be going to treatment from work everyday.  ",
      "MessageIndex": 117,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    },
    {
      "AuthorID": "anafoefana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131712/profile",
      "Content": "Mar 21, 2012 05:35PM anafoefana wrote: Hi all.  Congrats to all who recently finished.  It is great to be done with another hurdle isn't it? Ossa, glad the Emu oil worked so well for you.  I think it made a difference for me as well.  I have been using Latisse for 4 weeks and just started seeing some results.  The few eyelashes that returned fell out again a few weeks ago.  I am definitely seeing some growth now though.  I know what you mean about the stubby eyelashes.  By the way, I read that Latisse only works while you are using it.  Chef, I feel better this week, but I agree, the fatigue has been worse for me after finishing.  I am not as tired this week anymore.  itsjustme, My RO said to come back in 3 months and then every 6 months.   JBug, how did things go with your MO?  I hope all is well!",
      "MessageIndex": 826,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    }
  ]
}