{
  "AuthorID": "AnaMaria34",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247735/profile",
  "Posts": [
    {
      "AuthorID": "AnaMaria34",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247735/profile",
      "Content": "Oct 9, 2018 08:24PM AnaMaria34 wrote: I'm here. 2018",
      "MessageIndex": 612,
      "PostDate": "09/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "AnaMaria34",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247735/profile",
      "Content": "AnaMaria34 wrote: That happened much faster than I expected. Found out today I have several new bone mets and now liver mets as well. I was diagnosed stage 4 in February of this year. 8 months ago. What I read so far doesn't look promising. 4-8 months untreated and 6-12 with treatment. What can I expect in this process through death? Are there things that make it easier? I know everyone is different but I would love to hear what you have experienced. Not just physically but mentally, emotionally, and spiritually as well. I know none of us have completed our time on Earth yet but I hope to hear your stories. Please. And I would love friendship and support from anyone who is willing to offer it to me. Thank you. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867696",
      "Title": "I found out I have mets to the liver... Please be here with me. AnaMaria34 funthing42"
    },
    {
      "AuthorID": "AnaMaria34",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247735/profile",
      "Content": "Oct 9, 2018 09:05PM AnaMaria34 wrote: Thank you cure-ious. You're right. About everything you said. That was very helpful in calming down a bit. I am 35. Diagnosed stage 1a February of 2017 and stage 4 February of 2018. Both ER and PR positive, her2 negative. I had a double mastectomy and no other treatment because of preexisting conditions that would likely be exasperated by hormone therapy. 8 months later found a skin leision that was looked at by multiple doctors but not biopsied or confirmed until 4 months later. Also found mets to bone. I tried tamoxifen twice for just a week and felt so crummy I stopped both times. No other treatments. I am scheduled to start radiation to some bone spots that hurt and my chest wall where the skin spot is along with some tumors. I am scheduled to start xgeva. That was scheduled before I got the news of the liver mets. I found out today during an ER visit for abdominal pain. I haven't updated my doctor yet. I am currently at a small local hospital after being at John's Hopkins for a time. It was a pain to drive into the city and feel more like a number than a scared human. I suppose I should look into going back? Ugh. For support I have my husband and my 10 year old daughter (I'm not sure if it's a good idea to lean on a child for support.) My mother is also somewhat available. She is taking care of my grandparents (my grandmother has stage 4 ovarian cancer). I don't have any close friends. Thank you again cure-ious. ♥️",
      "MessageIndex": 2,
      "PostDate": "09/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867696",
      "Title": "I found out I have mets to the liver... Please be here with me. AnaMaria34 funthing42"
    },
    {
      "AuthorID": "AnaMaria34",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247735/profile",
      "Content": "Oct 9, 2018 09:50PM AnaMaria34 wrote: Thank you cure-ious. Your being up late with me and taking the time to respond in your positive way really touches me.",
      "MessageIndex": 6,
      "PostDate": "09/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867696",
      "Title": "I found out I have mets to the liver... Please be here with me. AnaMaria34 funthing42"
    },
    {
      "AuthorID": "AnaMaria34",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247735/profile",
      "Content": "Oct 20, 2018 07:51AM AnaMaria34 wrote: JFL, Thank you for telling me a little bit of you're story. Can you give me more details about how you feel? I just started palliative radiation and xgeva yesterday and the day before. The doc says if I want to do anything I can shut down my ovaries and add Ibrance. I am afraid of the repercussions of depriving my body of estrogen. And I'm afraid that once I have that first injection, I have no choice but to deal with it for months until it gets out of my system. I already suffer so much from my mental and emotional state. And I have a few physical issues I already deal with that would likely get worse that I'm not sure I could tolerate well. It's always been difficult for me to find purpose and reason enough to carry me through the mental anguish I feel very frequently. I'm still hanging on to hope that something will bust open and I can enjoy life fully and make my life worthwhile to me, but it's not here yet and it makes making decisions about my health very difficult. Difficult because I don't want to die (or suffer to a greater degree). I'm afraid of greater suffering, what comes after life, and leaving my family to suffer and my daughter to grow up without me. Ugh. Sorry for the venting. ",
      "MessageIndex": 13,
      "PostDate": "20/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867696",
      "Title": "I found out I have mets to the liver... Please be here with me. AnaMaria34 funthing42"
    },
    {
      "AuthorID": "AnaMaria34",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247735/profile",
      "Content": "AnaMaria34 wrote: Hi Everyone! I have cancer in one breast and will not be able to save skin or nipple. I have decided to remove both breasts. What options do I have for the healthy breast? Can I/should I save the skin? The nipple? Can I have an expander put in and filled to my breast's original size immediately after mastectomy? Right now I'm leaning toward a diep flap reconstruction after the rest of my treatments, though I am still open to the idea of implants. What are your experiences? Is there an option that would give me a better result? I'd love to keep my healthy nipple if I could (if it would have feeling). Are there any websites that specifically discuss options for this situation?Thank you! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/853326",
      "Title": "Prophilactic options? AnaMaria34 mustlovepoodles"
    },
    {
      "AuthorID": "AnaMaria34",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247735/profile",
      "Content": "AnaMaria34 wrote: Hi All, I'm just wondering why all of my doctors have recommended genetic testing for me, including the genetic counselor. I have zero family history of anyone with any kind of cancer for as far back as we can remember (which is about 5 generations). No cancer on either side. The only reason they are recommending it is because I'm 34. I do wonder if I might be the first in my family to have a genetic mutation, but I haven't been able to find any information about non-inherited gene mutations. If the mutation happened in my body, in my life time, would that show up on this test? Would I be able to pass that on to my off spring? I suppose so, but I haven't come across the information I'm looking for. Anyway, I'd love to see if anyone has had a positive genetic test result and not had a single other person in their family with cancer. Is that you? Thanks in advance for sharing any info with me related to this topic! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/854523",
      "Title": "Genetic Testing with No Family History? AnaMaria34 Lula73"
    },
    {
      "AuthorID": "AnaMaria34",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247735/profile",
      "Content": "Apr 26, 2017 12:04PM AnaMaria34 wrote: Yes. I thought my stats would be included at the bottom but I guess I don't have that setting turned on or something. I had stage 1a, grade 3 IDC (2 tumors 1.7 & 2 cm) and DCIS in the left breast. Had a dmx. Waiting on Oncotype DX test results for chemo. ER+ so will try to do 10 years of Tamoxifen. Thanks for bringing it to my attention that I didn't include that info.",
      "MessageIndex": 4,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/854523",
      "Title": "Genetic Testing with No Family History? AnaMaria34 Lula73"
    }
  ]
}