{
  "AuthorID": "ananda8",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
  "Posts": [
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Aug 8, 2008 09:28AM ananda8 wrote: Trust is a difficult issue for me as well.  I had a mammogram followed by a sonogram and was told I was in the clear.  I did a routine breast exam 4 months later and found a lump.  If I had not done the self exam, I would not have had another mammogram for 8 months and my prognosis would be substantially different.  The people reading the mammogram and the doctor who did the sonogarm flat out missed my 2.4 cm tumor.  Yeh, I have issues of trust. I think as advanced as we are in medical treatment of cancer, we are still in a primitive hocus-pocus stage.  Radiation therapy may reduce recurrence but lord, lord that is a primitive treatment.  I can feel the damage to my right lung when I exercise.  It feels tight just beneath my right breast. I am reading everything I can about diet and supplements to support my therapy.  At least I have an oncologist who is empathetic, likes to talk, and is a bit cynical about all of the money sloshing through cancer research.  He isn't threatened when I discuss ideas about supplements.  Do I trust him?  I think he cares.  I don't think he is perfect, no one is.  Trust may come in time.",
      "MessageIndex": 5,
      "PostDate": "08/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/719230",
      "Title": "Cancer, do you trust people? Crisis Mode Jennyany Shirlann"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Mar 21, 2010 04:37PM ananda8 wrote: I have rib pain most likely from Rads.  It isn't all the time but it is irritating.",
      "MessageIndex": 6,
      "PostDate": "21/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750105",
      "Title": "A Pain in the Rib helena67 MaineCoonKitty"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 27, 2010 11:29AM ananda8 wrote: If you are uncomfortable with the need for radiation you need to get a second opinion.  I didn't want radiation because the surgeon couldn't explain why I needed it.  It wasn't that he wasn't clear in his explanation, rather I was incapable of understanding that day.  A second doctor, two weeks later said the same thing in a different way, and I knew I had to have radiation. Believe me you must be comfortable with the idea of radiation or those will be the longest 33 days of your life.",
      "MessageIndex": 2,
      "PostDate": "27/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/749013",
      "Title": "Recently Diagnosed and Concerned about Radiation hopie NatureGrrl"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "ananda8 wrote: My brother has just been diagnosed with his third oral cancer.  All three times he has caught it very early.  This time they will be pulling his lower teeth and removing a small part of his lower jaw.  Soft food recipes won't help at first because his tongue is going to be stitched down.  Ugh!! His surgery is March 22 and he will be living with us until he can eat solid food and drive.  I have spent the entire evening trying to find recipes for people who are on a post operative liquid diet.  Can anyone help me out?  The oral cancer boards are useless in this area because there just isn't enough activity on them. Thanks.   \"As soon as we abandon our own reason, and are content to rely upon authority, there is no end to our troubles.\" B. Russell Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748966",
      "Title": "Off Topic Cancer Help ananda8 ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 25, 2010 10:04PM ananda8 wrote: Great Idea, thanks.",
      "MessageIndex": 2,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748966",
      "Title": "Off Topic Cancer Help ananda8 ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 26, 2010 06:48AM ananda8 wrote: What a good idea to blend soup with vegetables into a hot smoothy.  I am going to the health food store and try to find some rice protien.  I heard that it is almost tasteless and can be added to food to give it a boost of protien.  I know that this is going to be very hard on my brother.  He is already very thin and I am so concerned that he maintain his weight while recuperating. I have no idea how long his tongue will be stitched down and then how long it will take to heal after it is surgically released.    The thought of it gives me the heeby jeebies.    Maybe he miss-heard the doctor. ",
      "MessageIndex": 4,
      "PostDate": "26/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748966",
      "Title": "Off Topic Cancer Help ananda8 ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 26, 2010 07:45AM ananda8 wrote: Ezscriiibe, The Magic Bullet site had a recipe for baby food and that made the light come on in my brain.  I have now book marked a site that has all kinds of baby food recipes that I will just have to add various spices to and will have good recipes for my DB. I love the Internet!!!!!!!!!!!",
      "MessageIndex": 9,
      "PostDate": "26/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748966",
      "Title": "Off Topic Cancer Help ananda8 ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 26, 2010 07:31AM ananda8 wrote: Ezscriiibe, Thanks for the link to Unjury.  I have book marked it and will read everything.  Loss of muscle tissue is a big concern of mine for my brother.  I want to do anything I can to get the best possible nutrition into him until he can eat regular food. I have the very old blender that has a motor so powerful that it could propel a boat and I will be using that.  But thanks for the link to Magic Bullet because it does have good recipes on the site. Thanks again.",
      "MessageIndex": 7,
      "PostDate": "26/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748966",
      "Title": "Off Topic Cancer Help ananda8 ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 14, 2010 04:29PM ananda8 wrote: This will be gross.  Take some of the yellow green snot on a Qtip and pour Hydrogen Peroxide on the Qtip.  If it bubbles you have an infection.  You need to check with your PCP if it bubbles.  I got a post operative infection and the surgeon flushed my boob with Hydrogen Peroxide.  It killed almost all the bacteria but I still had to take IV antibiotics for four days.  I hope it is just nasty old skin.",
      "MessageIndex": 4,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/745930",
      "Title": "Rads burn peeling and seeping yellow/greenish snot looking stuff buccaneersdj Bethie1"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 14, 2010 06:03PM ananda8 wrote: There is a difference between bubbling on potatoes and on infection.  The bubbles on infective bacteria are smaller and more closely pact.  Hydrogen Peroxide bubbles on tissue and on blood but the bubbles are larger.  Peroxide does not bubble on all infectious bacteria, just on those that are hydrolase positive.  If the bacteria is staff or pseudomonas, the bubbles will be very dense and small. Back in the dark ages when I was a microbiology major in college, hydrogen peroxide was used as an initial differentiation between unknown bacteria.  It is still an easy way to spot an invection.",
      "MessageIndex": 8,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/745930",
      "Title": "Rads burn peeling and seeping yellow/greenish snot looking stuff buccaneersdj Bethie1"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 14, 2010 06:01PM ananda8 wrote: Thank you so much Benney.  I had know idea that prostate surgery patients risked lymphedema.  I will tell my friend today. Climb on your soapbox anytime.  Bravo.",
      "MessageIndex": 24,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/748290",
      "Title": "My Surgeon never told me tamlyn110 PauldingMom"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Dec 22, 2008 08:20PM ananda8 wrote: Radiation can cause fatigue.  I had 33 treatments and began to feel tired around number 20.  I was tired for a couple of months and then began to feel better.  Don't push yourself too hard but do try to go for slow walks and stay active.  If you really tired, then sleep.  Listen to your body and do whatever you feel is right for you. Cancer sort of snuck up on me psychologically.  I sailed through the partial mastectomy. I had a post op infection but that didn't depress me.  I didn't like the thought of radiation but I coped OK.  I was a real trooper.  Then, I finally had to deal with the fact that I had cancer.  I did get blue.  It lasted for a couple of months until I could process the whole thing.  What helped me more than anything was being able to talk about my experience and what I am going through with my husband.  He just sits there and listens.  He doesn't try to cheer me up, but rather accepts that I am going through a rough patch.  He is a doll. Best wished to you and may you have joy and contentment.",
      "MessageIndex": 1,
      "PostDate": "22/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/726255",
      "Title": "Is this '' normal '' canadian ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 14, 2010 02:30PM - edited Feb 14, 2010 02:33PM by ananda8 Binney4, Thank you for the advice.  Yes, I consider myself fortunate not to have lymphedema after having 8 lymph nodes removed.  The surgeon couldn't find my sentinel node. The dye did not \"light it up\".  So to be extra safe she removed and tested eight.  All were clear. I have a neighbor who is a physical therapist very familiar with lymphedema.  She approved the type of message I was doing.  I occasionally get a small swelling in the arm pit area especially when I haven't been exercising.  I gently press on the swelling while deep breathing and the excess lymph drains through the system.  I have joined Curves for exercise that is both aerobic and very gentle.  It is a great program. All in all I have not had any real problem with lymphedema but I realize that it can come on at any time and I am watchful.  I will read your links.  Thanks again. PS.  I also take turmeric every day. Turmeric is an anti-inflammatory.  My onc approved the use.",
      "MessageIndex": 18,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/748290",
      "Title": "My Surgeon never told me tamlyn110 PauldingMom"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 24, 2010 05:40PM ananda8 wrote: I was told by my surgeon to keep a stuffed animal under my arm at all times I was awake.  Holding the animal between the arm and the chest keeps pressure on the area where lymph nodes have been taken out.  I had 8 lymph nodes removed 2 years ago and have no edema.  I still have my little mastectomy pig that I carried under my arm. I realize that this is the opposite of  the  OP but I figure that there may be someone reading the thread that has not had surgery yet.  I hope they get their own stuffed animal and have a good outcome.",
      "MessageIndex": 42,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/748290",
      "Title": "My Surgeon never told me tamlyn110 PauldingMom"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 13, 2010 12:48AM - edited Feb 13, 2010 12:48AM by ananda8 My surgeon never told me.  My onc never told me.  Thank goodness my PCP mentioned it. I figure people are people.  They get distracted or forgetful or concentrate on a good surgery and not the \"little details\" of after care. This is an emotional time and perhaps will always be so.  Just concentrate on the fact that you do know  now and you don't have lymphedema.  Best wishes,",
      "MessageIndex": 1,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/748290",
      "Title": "My Surgeon never told me tamlyn110 PauldingMom"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 13, 2010 11:44PM - edited Feb 13, 2010 11:44PM by ananda8 I had eight nodes removed and have no trouble.  I check my arm by comparing it to the arm on the other side.  I hold both arms out shoulder high and compare size and shape.  If I even think that there may be swelling, I gently massage the arm by moving down the armpit towards the waist as I deep breathe.  I read somewhere that deep breathing helps circulate the lymph.  Needless to say any aerobic activity helps in that area. I hope that those of you that have just had surgery know that you should not lift more than five pounds for several months.  That is what my PCP told me.  Now I lift anything that I can manage. I would like other's thoughts on the above.  I haven't done any deep research on the subject.",
      "MessageIndex": 10,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/748290",
      "Title": "My Surgeon never told me tamlyn110 PauldingMom"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Aug 22, 2010 01:40PM - edited Aug 22, 2010 01:43PM by ananda8 The following link is from the Linus Pauling Institute:http://lpi.oregonstate.edu/infocenter/minerals/iodine/ Here are snips but read the whole thing.  I would hesitate to have any test requiring radioactive iodine before attempting to correct the problem through diet and supplements.  Of course any supplements I take would be under a doctor's supervision.  Too much iodine is as bad as too little. \"Thyroid enlargement, or goiter, is one of the earliest and most visible signs of iodine deficiency. The thyroid enlarges in response to persistent stimulation by TSH (see Function). In mild iodine deficiency, this adaptative response may be enough to provide the body with sufficient thyroid hormone. However, more severe cases of iodine deficiency result in hypothyroidism. Adequate iodine intake will generally reduce the size of goiters, but the reversibility of the effects of hypothyroidism depends on an individual's stage of development... Adults Inadequate iodine intake may also result in goiter and hypothyroidism in adults. Although the effects of hypothyroidism are more subtle in the brains of adults than children, research suggests that hypothyroidism results in slower response times and impaired mental function (1). Other symptoms of hypothyroidism include fatigue, weight gain, cold intolerance, and constipation... Nutrient Interactions Selenium deficiency can exacerbate the effects of iodine deficiency. Iodine is essential for the synthesis of thyroid hormone, but selenium-dependent enzymes (iodothyronine deiodinases) are also required for the conversion of thyroxine (T4) to the biologically active thyroid hormone, triiodothyronine (T3) (6, 8). Additionally, deficiencies of vitamin A or iron may exacerbate the effects of iodine deficiency (6, 14).",
      "MessageIndex": 3,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/757047",
      "Title": "thyroid cancer after breast? YUMMY ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Mar 1, 2010 03:54PM ananda8 wrote: Please convey this to the young couple.  May the best they've ever seen Be the worst they ever see. May the mouse never leave their pantry.  ",
      "MessageIndex": 10,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749111",
      "Title": "An exciting time in our lives ElaineD lukejessesmom"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "May 2, 2010 07:42AM ananda8 wrote:",
      "MessageIndex": 26,
      "PostDate": "02/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/751956",
      "Title": "Oh wow - 4-yr cancerversary today! sugarplum YATCOMW"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Dec 11, 2010 12:29PM ananda8 wrote: Christmas is fine as a cultural tradition that goes back to the Roman festival of Saturnalia, a time of eating, drinking and merry making.  I think anyone can celebrate it as a secular holiday or a religious one or both.  Easter is also a pagan holiday in honor of the Celtic mother goddess Ostare or Eastra.  The Celtic religion spread from just north of Greece all the way to Norther Europe at one time.  The witch burning of the Middle Ages was the final push to drive out the last vestiges of one of the most ancient religions on the planet.",
      "MessageIndex": 45,
      "PostDate": "11/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761581",
      "Title": "Anyone NOT celebrate Christmas? Mom3 Shanagirl"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 20, 2010 12:03PM ananda8 wrote: I'll try to gather the stats and will post when I get to 100 replies. We are at 395 replies now and if I don't do it in batches it will just be too much. I was 61.  My mammogram and sonogram were clear.  Five months later, I found a 2.4 cm lump myself. ",
      "MessageIndex": 405,
      "PostDate": "20/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Mar 18, 2010 01:32PM ananda8 wrote: I had a mammogram and sonogram 4 months before I found my lump myself.  I got an all clear letter from the radiologist.  If I had not continued to do breast exams past menopause, I would have had a different outcome.  I was 61 when I was diagnosed.   I switched radiologists.",
      "MessageIndex": 427,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "May 28, 2010 08:02PM ananda8 wrote: It's breeding season.  The baby animals are dying as well as the adult population.  An entire breeding seasons for endangered and threatened species has been eliminated.  Species are dying.  A way of life for the shrimp boats and fishermen is dying.  Whole ecosystems are dying.  They are dying down there.  James Carville was not exaggerating.  He was stating a fact.  If this insults people, then those people need to work on developing compassion of other people and other species. End of rant.",
      "MessageIndex": 11,
      "PostDate": "28/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753256",
      "Title": "\"We're dying down here\" -- grr -- rant MJLToday konakat"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 20, 2010 12:47PM - edited Feb 20, 2010 12:49PM by ananda8 Here are the stats for the first 5 pages of the thread. Responses 143 counting only first occurrence. 27-33 years old ----------  8% 34-36 years old ---------- 15% 37-42 years old ---------- 32% 43-46 years old ---------- 18% 47-52 years old ---------- 15% 53-56 years old ---------     6% 57-62 years old ---------     2% 63-66 years old ---------     1% 66-76 years old ----------  <1% Eighty-eight percent (88%) of the 143 respondents were under the age of 53 when diagnosed.  Perhaps someone could start a poll for the age of the women on this board. ",
      "MessageIndex": 407,
      "PostDate": "20/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 18, 2010 12:30AM ananda8 wrote: Here is a list of blood ranges.  http://pathcuric1.swmed.edu/PathDemo/nrrt.htm As you can see the range for ALT is 7 - 56 U/L The range for ALP is 31 -126 The range for Bilirubin is 0.2 -1.3 These are huge ranges and fluctuation can depend on what you have eaten in the past couple of days or week.  It can fluctuate based on hydration levels.  It can fluctuate based on whether you were fasting before the sample was taken or not. When I have labs taken, I always fast whether the instructions say to or not.  I try to have the same level of hydration by having the labs always taken in the morning.",
      "MessageIndex": 2,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/748451",
      "Title": "Liver Function Test jader peachy49"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Jun 5, 2010 12:11AM - edited Jun 5, 2010 12:13AM by ananda8 Before you go hiring an attorney, could you please share with us your original diagnosis and pathology report. Also, did you go for at least yearly mammograms?",
      "MessageIndex": 6,
      "PostDate": "05/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753654",
      "Title": "Attorney in the house? lisa34lisa lisa34lisa"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Mar 28, 2010 09:24AM ananda8 wrote: My neighbor had a mastectomy over 30 years ago.  She was one of the first on tamoxifen.  The real stuff made from the bark of yew trees.  She was on it six months and has not had a recurrence.  She is close to 80 now.",
      "MessageIndex": 7,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750429",
      "Title": "80 years old......???? Mamita49 ruthbru"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Jul 4, 2010 09:46AM ananda8 wrote: Hope777, Have you had your surgery yet?  After surgery, it will take a few days to get the official diagnosis.  Be sure to have your doctor go over every word of it with you and also have someone sit in to be your listener.  When I was first diagnosed, the doctor would explain things very carefully but all I heard was 'cancer cancer cancer'.  My listener, my DH, took notes for me and repeated what the doctor said. You will probably have radiation and you can ask questions about that to your doctor as well as the radiologist.  If you have had radiation at any other time, you need to be certain that the doctors know this.   You may or may not need chemotherapy. I hope this helps.",
      "MessageIndex": 320,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Nov 11, 2010 12:06PM ananda8 wrote: \"I use to say at night before I went to sleep(\" cancer you will leave my body) positive affirmations.\"  msphil, I also talked to my tumor in the days before surgery.  I had seen a picture of a breast cancer cell and it had little angry spikes on it.  I didn't wish it away, I wished it peace and calm.  I pictured those angry spikes softening and rounding until the cell became normal.  While this imaging probably had no affect on the cancer, it calmed my mind.",
      "MessageIndex": 459,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 9, 2011 08:57PM ananda8 wrote: grannydukes, Describe your anger.  Who are you angry with?  If you aren't angry with a person then what are you angry about?  What does the anger accomplish?  Is the anger useful at all?  Are you angry because it helps you to feel like you are \"fighting\"? I am not really asking for answers to my questions but just trying to help you analyze your anger, pick it a part so you can put some of it aside. I never felt angry but I have felt tremendous fear and I picked my fear apart by asking myself questions and analyzing my answers.  It helped me overcome my fear, at least up until now.   I hope this process will help you.  By the way, this process can be used with meditation.  It's called Insight Mediation. Best wishes.",
      "MessageIndex": 549,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Sep 4, 2010 12:04PM ananda8 wrote: Of course many of us worry about recurrence.  Every once in a while when I think I am just being a hypochondriac, I get a test done and it turns out something is wrong.  Right now I am being tracked for low thyroid.  Before that I was having trouble getting my Vitamin D where it should be.  Just because I'm paranoid doesn't mean I'm wrong.  Keep on top of things and try not to have your concerns take over your life. ",
      "MessageIndex": 374,
      "PostDate": "04/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Nov 7, 2010 08:09PM ananda8 wrote: I am confused.  Why do some of us have two surgeries, one to remove the cancer and the next to remove lymph nodes and some of us have only one where the cancer and nodes are removed at the same time?  I had eight nodes removed at the same time my tumor was removed.  I got all of the results at the same time; path report on the tumor and on the nodes. I would hate to think  it was because the doctors and hospitals charge twice for everything but I can't think of another reason.  Perhaps someone can help me out. ",
      "MessageIndex": 446,
      "PostDate": "07/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 10, 2011 12:04AM ananda8 wrote: grannydukes, You are going through so much anguish as well as anger.  I hope your meditation eventually leads you to a place of equanimity.  My arms are around you now.  ((((HUGS))))",
      "MessageIndex": 552,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 14, 2010 10:21PM - edited Feb 14, 2010 11:04PM by ananda8 I have a D cup on one side and a B-C on the other.  Most days I don't wear any enhancement.  I figure that people don't notice the difference even when I wear a T-shirt.  On the days that I wanted to even things out, I used to stick two of these silicone foobs on the smaller side.  I arrange them to overlap so I am equally full on both sides.  Now I only use one because I found a bra with a firmer cup and it holds the D side in.  http://www3.jcpenney.com/jcp/X6.aspx?DeptID=50475&CatID=51860&GrpTyp=PRD&ItemID=1573a9f&attrtype=&attrvalue=&CMID=50475%7c51093%7c51860&Fltr=&Srt=&QL=F&IND=6&cmVirtualCat=&CmCatId=50475|51093|51860 I live in Arkansas and know all about hot sticky weather.  The silicone is so comfortable that I forget that I am wearing it.  It is also about as heavy as normal tissue.  I have gardened and done aerobic exercise while wearing the foob.  I never felt sweaty or hot.  I wear the silicone next to my skin and buy regular bras.  I hope you find something that works for you.",
      "MessageIndex": 5,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/747036",
      "Title": "Fitting an A and a B in a bra without using fillers? linn56 ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 15, 2010 01:25PM - edited Feb 15, 2010 01:30PM by ananda8 linn56, Go to JCPenney and look up Fashion Forms Silicone Enhancers.  They are found under bras and then bra accessories.   The ones that Penny's are selling now have \"nipples\" which are new. They come in A/B and B/C.  Half and Half Shaping Pads brand is the one I use.  I guess JCPenney's isn't carrying them anymore.  I wear them next to my skin.  I don't need a special bra because they don't slip around. Once they are at body temperature, I don't notice I am wearing them.   Because two of them weigh about the same as the tissue I lost,  I find I don't have back aches any more.  These do not come in sizes but I think they may still work for you.  I wish they had these when I was a teenager.  http://www.freshpair.com/Fashion-Forms-Half-and-Half-Shaping-Pads-8900.html I bought two pair because I didn't know how they would hold up. Well, it has been over a year and I have yet to use the second pair.  I work up some face soap in my hands and gently wash them after every use.  Make sure that the pad is thoroughly rinsed in warm water.  I pat it  completely dry and put it back in the box. Best wishes",
      "MessageIndex": 8,
      "PostDate": "15/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/747036",
      "Title": "Fitting an A and a B in a bra without using fillers? linn56 ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "May 29, 2010 08:17PM ananda8 wrote: BP's effort to stop the leak by pumping mud into the well has failed. http://news.yahoo.com/s/ap/us_gulf_oil_spill;_ylt=An7kEak6zuSeRe65kv8yCjis0NUE;_ylu=X3oDMTNoN2hpbGowBGFzc2V0A2FwLzIwMTAwNTI5L3VzX2d1bGZfb2lsX3NwaWxsBGNjb2RlA21vc3Rwb3B1bGFyBGNwb3MDMQRwb3MDMgRwdANob21lX2Nva2UEc2VjA3luX3RvcF9zdG9yeQRzbGsDYnBzdG9wa2lsbGVm",
      "MessageIndex": 15,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753256",
      "Title": "\"We're dying down here\" -- grr -- rant MJLToday konakat"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Jun 5, 2010 10:10PM - edited Jun 5, 2010 10:12PM by ananda8 lisa34lisa sent me a PM.  She said she deleted her posts on the recommendation of her attorney. It appears she took the advice given on this thread and followed it.",
      "MessageIndex": 24,
      "PostDate": "05/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753654",
      "Title": "Attorney in the house? lisa34lisa lisa34lisa"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Mar 9, 2010 12:01PM ananda8 wrote: I am suspicious of any supplement that is stripped from its original spice or herb.  People take curcumin which is the \"active\" form of turmeric.  When I discussed this with my onc,  he said that taking turmeric made more sense because natural herbs have trace elements that are also beneficial.   ",
      "MessageIndex": 3,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/749506",
      "Title": "Check out Dr Jorge Fleschas Rosemary349 ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "May 1, 2010 03:48PM ananda8 wrote: Best wishes to my stage II sisters. ",
      "MessageIndex": 292,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Nov 7, 2010 08:31PM ananda8 wrote: I can see having to go back to get more nodes if the SN showed positive.  Mine never lit up so they took eight at the same time as my partial mast.  What I don't understand is why an SNB is not done routinely.  General Anesthesia has serious associated risk.  Approximately 200 people die every year in the USA due to anesthesia alone.  Perhaps there is a medical reason that is just not clear to me.",
      "MessageIndex": 448,
      "PostDate": "07/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Aug 22, 2010 01:18PM ananda8 wrote: I have a slight problem with my thyroid.  My test results indicate borderline hypothyroidism.  My doctor says that Arimidex suppresses the thyroid. ",
      "MessageIndex": 1,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/757047",
      "Title": "thyroid cancer after breast? YUMMY ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Sep 25, 2010 10:27PM ananda8 wrote:",
      "MessageIndex": 29,
      "PostDate": "25/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/757047",
      "Title": "thyroid cancer after breast? YUMMY ananda8"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Mar 7, 2010 08:56AM ananda8 wrote: More natural stuff.  Eat a handful of walnuts a day. Chew them thoroughly.  Walnuts have lots of fiber, are very good for the colon and slow may slow the growth of cancer cells. http://www.webmd.com/breast-cancer/news/20090421/walnuts-fight-breast-cancer",
      "MessageIndex": 6,
      "PostDate": "07/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749423",
      "Title": "Ascites and Constipation Relief - Advice desparately needed mason204 MCTHO"
    },
    {
      "AuthorID": "ananda8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70027/profile",
      "Content": "Feb 25, 2010 02:00AM - edited Feb 25, 2010 02:01AM by ananda8",
      "MessageIndex": 7,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748532",
      "Title": "Please stop everyminute sas-schatzi"
    }
  ]
}