{
  "AuthorID": "Andi39",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202774/profile",
  "Posts": [
    {
      "AuthorID": "Andi39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202774/profile",
      "Content": "Andi39 wrote: first off, I am new here, Hello everyone! (waving) Secondly, I have been reading the boards for a few weeks and I have to say thank you for all the support you ladies give. It is amazing. I am a 39 year old mom of 5. I have an amazing life. By choice! My history: Kidney issues since teens. Kidney stones (over 200 in 2012) yes, 200+. I was so sick for so long and nobody could figure out why. I ended up with PICC lines from odd infections after the birth of my 5th child. Long story, I won't bore you on this board. But I had Primary Hyperparathyroidism and adenomas in three parathyroid glands but all glands were hyperplasia. I say all that to say that hyperplasia is uncommon and can be found in other areas or organs, I am told anyway. Fast forward to now. About 2 months ago I found a lump in my right breast. After going  thru 24 surgeries in fifteen years, I decided to ignore it. Dumb idea but honestly, I am sick and tired of medical stuff. That attitude lasted for about 48 hours when my heart reminded me I need to keep healthy for this lovely family I have. I set up a mammo (here where I live you don't need an order for a once a year mammo). When I went to my mammo I did not tell her about the lump. Reason...I went to same hospital about 8 years ago for a mammo ordered by my primary because I was bleeding from my breast. I was terrified. I went  and explained everything to radiologist. Also, my father had BC years ago. He was in the army and developed a mass on his chest (nipple area). The army doc removed it and tissue, said it was cancer but all was gone after surgery so he was fine. My mother also had a cancerous lump removed in the 80's. The radiologist almost laughed at me. I heard \"you are fine, BC doesn't hurt or bleed, your dad could NOT have had BC as docs didn't even know about BC in men during that time\". I felt embarrassed and sad. He told me to go home and be glad it was nothing. So, I figured ok, I am NOT going thru this again. I will go in for my mammo, if something is wrong, they will call me. Week later, I get a letter that tells me \"your mammo didn't suggest any abnormalities. However, your breasts are very dense so we feel this test wouldn't show anything anyway, see your gyn:...So, I called my GYN and he got me right in. Felt my breasts, said ok. We will wait one month to make sure it isn't a hormone thing because I had an ablation 2 years ago and have never bled during my cycle so I have no clue when my cycle is...If at 4 weeks its still there, you are going straight to a surgeon. 2 weeks go by with no change. Third week comes and my armpit begins hurting. My nodes in my pit on that side are swollen. My nipple is becoming inverted. I called him and he set up a surgeon appt for next Monday and asked to be put on a call list if someone cancels. I asked my GYN if we should do a mammo or some other testing before seeing surgeon. He said see surgeon and let him order any tests as he knows what he needs. I don't know what to expect. I am nervous because I went years with my parathyroid tumors. I was so sick. Nobody knew how to help or what to do. I am afraid this time, that will happen. My problem is also, I cannot have an MRI. During one of my surgeries to remove most of my left kidney, a doctor broke a guide-wire in my kidney. When he removed the partial kidney area he thought the wire was inside. I was sent for an MRI of my back and began feeling very sick. They pulled me out, did a plain x-ray and found the wire. I can't have it removed because its too dangerous. So, If I can't have an MRI, what can they do? Sorry this is so lengthy but if you read this far....You are a gem. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822851",
      "Title": "Wonderful support and questions Andi39 sarahjane7374"
    },
    {
      "AuthorID": "Andi39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202774/profile",
      "Content": "Jul 24, 2014 04:19AM Andi39 wrote: Thank you Sarah for responding! 5 kids too? Awesome!! Well, I saw the surgeon on Monday. my worst fear was him saying there was nothing there and sending me on my way. Its not that I WANT anything to be there, but there IS! Just like with the tumors in my neck. I was dismissed dozens of times despite over 200 kidney stones that were the cause of a calcium overproduction... He took 2 seconds feeling my breast and said \"this?\" and said it was definitely something there. His guess was a 2cm palpable mass. He ordered a biopsy for this Friday with results next Wednesday. My nipple has begun retracting also. My mass, I didn't think it hurt, he even asked if it did. But after the exam and still today, its sore. Weird..... I have no idea what next week will bring but I am ready to know. Weird how one word. Just one...Cancer can stop a person in their tracks...I am hopeful for a B9 report but I also have to be realistic.I see my breast every single time I take a shower. I see the mass.  my entire breast has changed shape and size. Its quite scary. I have 5 kiddos and one of them has cerebral palsy. I am her nurse so even tho I still beg, pray, plead with God for it to be benign I also have to began working on making plans for fill in nurses etc..those things take time. Easier to plan ahead and cancel if everything is ok than to wait and on top of dozens of testing and appts try and take care of the details.. Sorry, I am rambling....",
      "MessageIndex": 2,
      "PostDate": "24/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822851",
      "Title": "Wonderful support and questions Andi39 sarahjane7374"
    }
  ]
}