{
  "AuthorID": "Angellestinnett",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217660/profile",
  "Posts": [
    {
      "AuthorID": "Angellestinnett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217660/profile",
      "Content": "Angellestinnett wrote: About two weeks ago I found a new lump in my breast in the \"1 o'clock\" region maybe two centimeters above my nipple and brought it to my Obgyn's attention and he sent me for an ultrasound which was today... I have a history of benign phyllodes tumor in this breast maybe two to three inches from this site and multiple cysts in my other breast I've also had breast augmentation with a Mini lift so incisions were around my nipples in 2012... My ultrasound seemed a little different than past experiences today, the tech had a concerned way about her and didn't seem to get very many angled pictures of this lump like in the past and she had to use a silicone circular object to put more depth between the probe and lump she said because it was so close to the surface... She also had me wait undressed while she spoke to the radiologist and when she came back asked if I had a mark or anything on my breast near the lump \"anything black or dark like a big bite maybe\" we're her words... Just struck me as odd given past experience so... She said the radiologist was looking at the films and would follow up with my dr and my results shouldn't take long and since I'm young he will more than likely want to follow up... My question is can cysts develop close to the surface? And could this be scar tissue? What were your experiences Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/845942",
      "Title": "Hard pea sized lump near surface of skin Angellestinnett Denise-G"
    },
    {
      "AuthorID": "Angellestinnett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217660/profile",
      "Content": "Angellestinnett wrote: Just curious if any ladies had body aches before diagnoses? Almost flu like aches... I constantly feel \"under the weather\" my neck area aches giving me a headache... And I almost feel like I have an ear infection because of the way it constantly aches... My back always hurts as well and I'm only 23 so I'm not in too bad of shape... No fever... Also constant breast itch? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/833161",
      "Title": "Flu like body aches unthought about cancer symptom? Angellestinnett Angellestinnett"
    },
    {
      "AuthorID": "Angellestinnett",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217660/profile",
      "Content": "Angellestinnett wrote: In February I noticed a hard almost quarter sized lump on my upper right breast I was pregnant at the time so we through it off to hormones then I lost the baby at 16 weeks in April and come June it still wasn't gone so I told my dr and he sent me for an ultrasound and referred me to a surgeon... The radiologist said it looked to be a fibroadenoma and he wants to see me back in 6 months unless it gets bigger he wants to see me sooner... Followed up with my dr and he said since it's not fluid filled that he can drain he doesn't want it in there because it shouldn't be there so my appt with the surgeon is Monday and I'm kinda unsure what to expect or think... I know fibroadenomas are very common and don't have to be removed but it kinda has me worried that the dr wants it removed because it seems as if he's worried about it... I'm 23 andhave had implants placed 3 years ago... I haven't breastfed in 5 years but still have a clear sometimes yellow or white creamy discharge that can be squeezed from my breast... Anyone else have a similar situation? Breast cancer doesn't really run in my immediate family although some distant family has had it and my dads brother just recently passed from breast cancer Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/832960",
      "Title": "Possible Fibroadenoma but OB has me worried Angellestinnett Angellestinnett"
    }
  ]
}