{
  "AuthorID": "AngelaKS",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
  "Posts": [
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 8, 2016 06:51PM AngelaKS wrote: Haha I don't do anything to my eyebrows but I have a teenage daughter who is a whiz with make up and I guess I will have her do them. I am signed up for the Look Better Feel Better class at my center next month. They seem to help with that too. I had my first treatment today and I am so tired. It was a super long day that started when I woke up 1.5 hours before my alarm that was set for 0400 and ended when I got home at 1900. I had to be there super early for PET/CT as I said. I already have the results from that and there are three lymph nodes and there are two tiny nodules on my right lung. The report said chest CT in three months. I see my MO on Monday so I hope to have answers as to ER & PR as well as her thoughts on my lung. I had a PE in March so maybe it is something from that? One can hope.  I took Claritin but they failed to mention that the pharmacy closed at 1700 and so we missed getting Zofran. The center is an hour away and I do not have prescription coverage so praying I don't feel sick. Not much else I can do about it. I cannot even imagine driving there again tomorrow. I have been there twice this week already. I cannot take Motrin for the Nulasta as I take blood thinners so I hope that Tylenol will help with the Claritin. My tummy feels a bit off but it had so much medicine today that I am not surprised. I hope you are all doing well and I do apologize for not responding to each of you. Thank you for all the info and support.",
      "MessageIndex": 383,
      "PostDate": "08/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 9, 2016 09:38AM - edited Sep 9, 2016 09:39AM by AngelaKS ACS74 thank you! I went to local pharmacy and it is $95 so the cancer center is mailing it and it was $22. I hope it will be here tomorrow, but more likely Monday. Well, I did it! I cut off all my hair, there is plenty to donate. I know there are many worthy causes, but I chose to donate to one in Michigan that gives to children with hair loss. It is difficult for me at 43, I cannot imagine a child. Well, I can, I remember a kid from primary school who must have had Alopecia and had very little hair. Children tend to be mean so that is my choice. I feel pretty good, just tired. Neulasta will do it's thing about 2000 and then I can take a shower! I am glad Emily is doing well, we are close in infusion days and we are on the same treatment, so I really appreciate your sharing. I had lunch, still have a bit of a sorta heartburn or something feeling but it could be so much worse so I am okay with that. Thank you everyone. I am so glad I found y'all. ETA: I have been reading the signatures and I notice that most of you had surgery first. Mine is not until after chemo, just interesting.",
      "MessageIndex": 395,
      "PostDate": "09/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 10, 2016 05:25PM AngelaKS wrote: Sr2295 Welcome, I am new too. I started chemo on Thursday and I am doing chemo prior to surgery with targeted therapies. I am on Day 3 and my day has been busy but I have had a couple of naps. My tummy is queasy and I am a bit achy but otherwise I am ok. I wish I had the Zofran but hopefully by Monday and if I don't need it by then, I will have it for next time.",
      "MessageIndex": 429,
      "PostDate": "10/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 12, 2016 05:33AM AngelaKS wrote: CC2016 I thought about that too. I probably need to shave anyway, but maybe after that? I am sorry you had a rough weekend. How are you today?",
      "MessageIndex": 448,
      "PostDate": "12/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 17, 2016 03:39PM AngelaKS wrote: I too had a bad reaction to compazine and refused it when they offered a prescription for it. I went in for a migraine and it did take care of the headache but I felt so crazy, I'd rather have the headache. I wonder if I ended up so sick since I had to wait so long for anti nausea meds after the infusion? I would never have guessed it was a wig! I love it. I cut off my long hair so I'd kind of like a longer one but will see what I can afford. I hope that everyone is doing better and can get some rest and relax a bit. I am feeling much better but haven't really eaten anything yet. I am trying, but my stomach is so sore. xoxo thank you all for your support. It means the world to me.",
      "MessageIndex": 578,
      "PostDate": "17/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 23, 2016 04:10PM AngelaKS wrote: I am sorry Bagsharon xoxo",
      "MessageIndex": 690,
      "PostDate": "23/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Nov 19, 2016 02:27AM AngelaKS wrote: Hi! I am sitting in the hospital due to a severe infection (bladder) and super low blood counts. I got two units of blood today. They say I should hopefully be home by Thanksgiving but I hope that was a joke. I do not want to be here that long. The food is terrible and I am over an hour away from home. My local hospital doesn't have an Oncologist per se even though that is where I go to see my MO. Makes no sense but here I am. I have typically been getting sick with vomiting and the big D on day 5 and I tend to let it go too long and end up in the ER not being able to keep anything down and in need of fluids. I have not had that problem this time so I am hopeful that I will have the same luck with the new meds for my last two treatments. I am watching Harry Potter and the Chamber of Secrets and trying to do a bit of work, but not getting much done lol I work from home as a travel agent specializing in Disney travel but also do Sandals/Beaches and will be adding some more cruise lines and destinations when I finish the training for those. It is nice to have a distraction but honestly, I always have a client or new lead when I am at my worst. lol I have even been on the phone booking Walt Disney World while getting chemo. :) Oh and I am on this nutraphenic (not sure of spelling) and that means cold, yucky food that is supposed to be hot lol We have pretty much cancelled any plans for Thanksgiving. We will probably just make dinner for our family + our daughter's boyfriend. I am going to try a new fresh recipe for cranberries. Maybe some orange zest. Otherwise, pretty much the basics. I love to cook but not sprouting out into new territory this year. Extra big celebration next year. xoxo thinking of you all and especially the tropical view that I do not have nor will I in what will shortly be cold, snowy Michigan.  ",
      "MessageIndex": 1258,
      "PostDate": "19/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Nov 19, 2016 03:19AM AngelaKS wrote: Hello! I am sorry you are feeling rough Smile. I get the Neulasta pod every treatment. I have been feeling the same way. I put in a load of laundry the other day and I swear I needed a nap after but it was time to pick up the kids from school. I hope you are feeling better soon! Last night my fever was around 100.2 and then it went to 100.6 so I called. By the time the on call doc called me back it was 101.6 and by the time (I lollygagged for a bit) I got to the ER it was 102.6 Today has been pretty good. It was 99.8 the last time they took it, but I think that is pretty much the highest since it broke. I guess with blood transfusions, you can still get an infection so they were in here every 15 minutes for I think the first hour, then it goes to 30 minutes, etc.",
      "MessageIndex": 1261,
      "PostDate": "19/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 12, 2016 11:03PM AngelaKS wrote: Dennyj - I have #5 on Friday and started feeling yucky Saturday evening. I am okay now but this morning was rough. I hope that it gets better for both of us. I was sick pretty much the whole time between my scheduled rounds. I was feeling better by the time I actually had my infusion but ick! I am ready to be done with this part. I am scheduled for my last round on Dec 30. I am with you and hope that I will feel good for Christmas. xoxo",
      "MessageIndex": 1362,
      "PostDate": "12/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 13, 2016 02:36PM AngelaKS wrote: Docmama - I know what you mean. We usually do a photo card for Christmas but I was not about to do that. I've allowed one photo since my hair. I have seen people that know and that is okay I suppose but in the beginning, I didn't want to go out at all. xoxo",
      "MessageIndex": 1367,
      "PostDate": "13/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 14, 2016 09:31PM AngelaKS wrote: That is great news! I am glad you are underway! I cannot wait to be done. They lowered my carbo too, I am not sure about the Taxotere though. I still feel horrible, I hope it goes away soon. Hope everyone else is doing okay and feeling good. xo",
      "MessageIndex": 1380,
      "PostDate": "14/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 19, 2016 05:58PM AngelaKS wrote: Thank you! I finally had my major breakdown and of course it was when the nurse was in my room hanging blood. After a few minutes when I was first dx, when all I thought of was a mastectomy, I moved on and pretty much hoped/prayed.etc for a lumpectomy. Today I learned that probably isn't going to be an option and while I know that the genetic tests can come back negative, I don't feel 1. that they will 2. like anything has 'gone my way' triple +, aggressive, large, etc so I am basically planning on it now but I didn't want even one let alone both. I know many of you are planning on it and many have already had it done but this is the first time my MO has even really talked about surgery at all so I guess I just hit my breaking point. I really am one of those people who cries in the movies, at commercials, etc but I have literally cried (now) four times since my dx and twice was today. I cried myself into a bloody nose during my first blood transfusion. I am just about done with the second one now. I am sorry for the lame, whiny, poor me post but I just lost it today. I know that y'all understand and I guess I feel safe here putting my feelings into words. I know my husband married me not my boobs (honestly, I'll probably end up with more than I ever had) but for some reason, I just am having a very hard time with this. Thank you very much for letting me vent and being such great support! xoxo",
      "MessageIndex": 1404,
      "PostDate": "19/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 9, 2016 04:51AM AngelaKS wrote: Oh goodness! I hope you are able to control the bone pain Ware. Mine will medicate this evening so it is coming I am sure. xo I felt fine when I got up but I ran out to the store and had the heat on to clear the windows and when I was driving home got quite warm for about 40 seconds and have been a bit queasy since. I have a 7UP and a Vernor's and took a tums. Hope that will work until I can call my primary to see if she can give me a sample of Zofran or something. It does make things more difficult. The local hospital is now a campus of the hospital I go to (not the cancer center) but they are remodeling and my bad luck is that includes the treatment areas. Good news is that I can go there for appointments with my MO. I flat out refused to drive an hour for a CBC so I am doing those here too. I promised to go early in the morning so they could get the results sooner.  It has been a long time since I was a part of a message board group like this. I had one when I was pregnant with my son and I am still in touch via Facebook with many of them. :) I am off for my haircut at 0900 so please wish me luck. I hate it when they cut an inch or two too much so it will be hard to watch them cut it all off. It is for a good cause though, someone will get hair I hope from it. Have a great day!!",
      "MessageIndex": 389,
      "PostDate": "09/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 9, 2016 10:13AM AngelaKS wrote: Yes, Sam, I think that is what they are hoping for! It is quite large. More than 10 cm so hopefully it will shrink some at least. You have a great weekend too! We have our son's first football game tomorrow so it should be fun!",
      "MessageIndex": 397,
      "PostDate": "09/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 12, 2016 04:59AM AngelaKS wrote: I am trying to drink. My kids both have colds or something going on, so they are both home today from school. Trying to keep them resting so it doesn't get worse. They are 14 & 9 and grandma has suppressed immune system too so no sending them there. They are good though and know I am feeling rough so help out. I never filled my rx after surgery, I did regret that last weekend, but I will fill it today and hope that it helps. I can't take more Motrin so I've had some Tylenol this morning. I am trying on the water, but it is ugh! I am going to have some hot tea in a minute and see if that goes down easier. I hope you are all doing well today!",
      "MessageIndex": 446,
      "PostDate": "12/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 27, 2016 05:50PM AngelaKS wrote: CC I hope your day gets better xo Kdtheatre - I do not even see that on my blood work results from my infusion day. I am sorry, I hope you are able to speak to someone about that soon. xoxo",
      "MessageIndex": 735,
      "PostDate": "27/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 7, 2016 03:47PM AngelaKS wrote: Hello! I've been too sick (again) to be on here or do anything else. I went to ER yesterday for fluids and they gave me Zofran and Phenagren (someone asked, I take it for nausea) and then a GI cocktail that was Mylanta & Lidocaine and that really settled the pain in my stomach. It is just so irritated. Finally feeling a bit better today. I did notice that I did not have the bone pain like last time so that is something right? This has just been so awful, at times I cannot imagine doing it 4 more times, but I do what must be done. Hair is going, I wish it would just go already to be honest. I wear a scarf of some kind all the time now. I hope you are all doing better xoxo",
      "MessageIndex": 908,
      "PostDate": "07/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 8, 2016 05:23PM AngelaKS wrote: Hi! I am TCHP for six treatments and then Herceptin to finish a year. At this time, I only know of surgery and radiation after this round of chemo. ",
      "MessageIndex": 946,
      "PostDate": "08/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 11, 2016 04:42AM AngelaKS wrote: I saw MO today and she wants me to return to the clinic on Mondays after my treatment on Fridays for fluids and such to try to prevent me from getting so sick. I am getting bald spots but some is still hanging in there. Honestly, I wish it would just go. I showed my husband and daughter (15) and my daughter said, well that is different. It was kind of funny, but as my son (9) does not want to see it, I wear some kind of scarf or hat all the time, even while sleeping. I want to respect all their feelings. My husband keeps saying he didn't marry my hair but still... I am finally feeling better! Thank goodness for that. I hope y'all are doing okay and hanging in there. xoxo",
      "MessageIndex": 968,
      "PostDate": "11/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 11, 2016 04:55PM AngelaKS wrote: Thanks Smilethrupain! I hope he will come around too. He doesn't say much but they have been through a lot the last year and a half. I've had many health problems and it is hard on them. Your kids sound amazing :) xoxo",
      "MessageIndex": 974,
      "PostDate": "11/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 31, 2016 09:24AM AngelaKS wrote: Well, I spoke too soon. I was super sick last week, ended up in the ER again. Spent about 7 hours there and have been feeling better and better each day. Still very tired but doing much better. Goodness, I will be glad when this part is over. I think I am waiting too long to get help though, next time after about a day of being sick I will be going in. I went back to the clinic twice after treatment for hydration but that doesn't seem to have helped very much. My house is a huge mess and I could do nothing for days. Oh well, here is to feeling better and getting things done while I can. I hope you are all doing okay and I am sorry I got so far behind (again). xoxo",
      "MessageIndex": 1141,
      "PostDate": "31/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 16, 2016 05:59PM AngelaKS wrote: Yay! That is awesome! Congrats! I cannot wait to do my last one on the 30th. The past couple have been pretty rough. I cannot stand the acid stomach. Nothing is helping. ",
      "MessageIndex": 1392,
      "PostDate": "16/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 20, 2016 06:22PM AngelaKS wrote: Congrats Ware! Here is to an easy ride on this one!",
      "MessageIndex": 1412,
      "PostDate": "20/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Jan 8, 2017 11:10AM AngelaKS wrote: Sorry that I've been gone. Had my last chemo on Friday! Had to wait an extra week due to platelets. Went for genetic testing last week and have to wait for results before deciding on surgery. Hoping no hospital stay this time.",
      "MessageIndex": 1493,
      "PostDate": "08/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 8, 2016 12:12AM AngelaKS wrote: Thank you for the welcome and the info on Phil's. My BFF actually did if for me earlier :) I have so much to read through since this thread was started, I am considering taking my laptop with me so I can read it all. I really should be sleeping, but my husband and I both woke up awhile ago and I am still up. I am on nothing but water since I have PET/CT at 0600 and I have heartburn or something going on. I have an appointment to donate my hair on Friday. I just thought it might be easier if I wasn't losing my long hair, maybe it will help. Thanks again. Will update later after my scan and the party in the chemo room.",
      "MessageIndex": 362,
      "PostDate": "08/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 11, 2016 01:24AM AngelaKS wrote: Yes, Herceptin/Perjeta at the same time as chemo. Perjeta was my first infusion the other day. I have round 2 Sept 29.",
      "MessageIndex": 437,
      "PostDate": "11/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 16, 2016 05:54PM AngelaKS wrote: Hi All & welcome to our new friends! I was doing pretty well, the big D came I think on Monday and by Tuesday I took 1 Immodium and it was all over. About two hours later, I was vomiting and have been since then. I went to the ER on Wednesday and they gave me pain meds, a bag of fluids (not nearly enough) and anti-nausea meds. None of it helped. I have been taking Zofran but between vomiting and D, I cannot get anything in me. I haven't taken my normal meds since Tuesday morning. I did take a nap this morning after taking my son to school and woke up feeling a bit different. I am not sure how else to explain it but I pray it is the beginning of feeling better. I haven't eaten anything since Tuesday morning and know that I need to get something in me at some point. The stomach pain has just been too much to try anything.  My center has vending machines, microwave and heated blankets. There is a TV in each little cubby but always someone or 2 or 3 that have them so loud you cannot hear yours. No food offered and the cafe on the floor is pricey especially if you need breakfast and lunch which my husband and I did last time. I hope you are all doing well and I apologize for not responding to you all. This is the first time I even felt up to reading the posts. xoxo",
      "MessageIndex": 552,
      "PostDate": "16/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 16, 2016 05:47PM AngelaKS wrote: Thank you all. I pray I am on the other side of all this. At least for now. D is still here and my stomach still hurts but I haven't gotten sick in awhile. Here's to a great weekend!",
      "MessageIndex": 560,
      "PostDate": "16/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 22, 2016 05:10PM AngelaKS wrote: I had the pod put on my left arm. I have my blood checked before infusion and I was supposed to have it checked at one week, but I was so sick, I didn't go. I know they did it when I was in the ER and that they spoke to a dr at my clinic so I am guessing it was sent to them. They never called to ask why I didn't do it. My hair is really coming out now. I think I am going to buzz it. I have the scarf from Good Wishes that I have been wearing so I might as well not have to look like I showered with a Sashsquatch.",
      "MessageIndex": 667,
      "PostDate": "22/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 23, 2016 10:22PM AngelaKS wrote: I am doing TCHP for 6 cycles and I started 9/8, my next infusion is 9/29",
      "MessageIndex": 696,
      "PostDate": "23/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 27, 2016 01:23AM AngelaKS wrote: Wow crazy that you had that reaction. I am glad you are doing well otherwise. Is anyone else having a problem with their hands peeling? I am putting on lotion like a crazy person but they keep peeling.",
      "MessageIndex": 725,
      "PostDate": "27/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 2, 2016 02:43AM AngelaKS wrote: I am sorry that I have been MIA, I had a couple of very busy, crazy and frustrating days. I just finished reading everyone's posts and cannot begin to address everyone. I was supposed to have infusion #2 on Thursday, however my port has never really worked well and although my blood work was great, I had to wait hours and hours to get a fancy xray of my port. Well, it has a fibrous tissue covering the end of the catheter so they said that they can go in through my groin and strip it, but then the dr asked how long I need to have it and since I need it for 12 months, he gave me the choice of just getting a new port. I opted for a new port since he said that I would likely have to have the procedure done several times over the next year. No thanks. Then this awesome dr surprised me by insisting that they schedule me when he can do it. They left the port accessed since he said it was a good access and so I came home with it like that. I went back Friday morning for my second infusion and when I was reclined in the chair, it seemed to work pretty well and she even got blood return twice which has only happened once before at my pet scan. I showed my chemo nurse my peeling hands and she said that is for sure a se of chemo. She never said anything about it delaying chemo. I got the Neulasta pod again and it injected a couple of hours ago. I have not had any issues with leaking or anything which is good since my clinic is about an hour away and now I am on a Friday schedule, that could be an issue. Sadly, I had a terrible reaction to the Perjeta, which I did not the first time. All of a sudden I could not breathe and then later started shaking and she said that was a delayed reaction. She gave me oxygen since my O2 was at 89, I don't think it was that low even when I was in the hospital in March with blood clots in my lungs! Then they gave me Benadryl and then some steroids (I don't usually get them) and then I felt sick and so they gave me Pepcid and then they gave me Demoral for the shaking. Ugh! All that extra medication! It was awful. We waited a while and then they restarted the Perjeta at a slower drip and I was fine. She said that it is basically a crap shoot, it can happen one time and not the next but then can happen again so they will give me meds each time to try to prevent it. My wonderful friend took me both days and I am so grateful. I have taken Phenagren and I am feeling pretty good other than being super tired. We had to drive over an hour this morning after getting up at 0530 for our son's football game. It was rainy but they won 6-0 and it was clearing up by the time we started home so the drive was much better. We so enjoy watching him play football, I hope he sticks with it but he is saying he may not play next year. Hair - well as I mentioned, I buzzed it some so it is uneven and now I have bald spots. It is super thin and I had very thick hair. I have been wearing scarves and when at home, usually a beanie that I got at my clinic. I have a few scarves but since I have no style as my teenage daughter tells me, they don't always match what I am wearing lol I hope you are all having a great weekend! xoxo",
      "MessageIndex": 816,
      "PostDate": "02/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 11, 2016 12:56PM AngelaKS wrote: VHL thank you, I hope so too!",
      "MessageIndex": 970,
      "PostDate": "11/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 17, 2016 03:07PM AngelaKS wrote: Hi! I am on the same as Emily and Bagsharon and I have not had any nail issues. I have had some shooting pains in hands and feet but that is very seldom, thankfully. We had a good weekend too! Nicklas' last football game for this season and a family gathering. It was very nice to see family that we haven't seen in a long time. I get my new port tomorrow, I hope this one works better and heals better too!",
      "MessageIndex": 1014,
      "PostDate": "17/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 25, 2016 11:05AM AngelaKS wrote: Hi All! I am on day 6 of treatment #3 and doing much better than I did with the first two! I went yesterday and today for fluids only. I tried very hard to hydrate over the weekend and I am sure that helped a lot. I am super tired all the time but still I will take this over not being able to take care of my family because I can't get out of bed for days at a time. I hope everyone is doing well. xoxo",
      "MessageIndex": 1089,
      "PostDate": "25/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 8, 2016 01:51PM AngelaKS wrote: Hi All! ajbclan - I am sorry it was cancelled. I know the feeling but the last one. Hang in there. I am sorry that I haven't been on. I have issues logging in - I have to reset my password every time and honestly the past couple of weeks have just been rough. I think I posted that I was in the hospital for five days. Blood transfusions and just before discharge platelets were infused. I was supposed to get #5 last Friday but they wouldn't do it. I was so disappointed. I was supposed to be done before Christmas but no, now it is tomorrow and we are getting a snow storm. My husband had to take a vacation day (his last until Oct 1) so that he can take me. I was sick pretty much from the last treatment until last weekend. My body is not tolerating the chemo well and they are reducing the dose as well. I have not met with the surgeon yet and I am not sure what we will be doing. I know surgery and then six weeks of radiation and possibly more chemo which I do not want to do. I am so over all of this. Best wishes to you all xoxo",
      "MessageIndex": 1339,
      "PostDate": "08/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 19, 2016 11:48AM AngelaKS wrote: I am sorry Dennyj, I feel for you. I hope you are feeling better. Everyone, I hope is feeling better. I really am disliking the taste bud thing myself. It is finally getting somewhat back to normal. I am in the hospital again. Bad blood numbers. Getting a transfusion right now. They started one last night but stopped because I had chest tightness, thankfully it was just whatever. Cardiac enzymes were good and test to check for a reaction were negative. No one is sure what happened. EKG last night also showed some abnormality, I've had another one today but haven't heard about it yet. I think it will be fine though. I am scheduled for another one tomorrow morning so I hope it is good and numbers are good so I can go home. I am not getting ready for Christmas sitting here lol Thankfully, other than some weakness and fatigue I am feeling much better. This latest round of blood work does not leave me hopeful that I will finish chemo before the end of the year. I was so hoping to be done. Ah well, we shall see. Many hopes that the rest of you are doing well. xoxo",
      "MessageIndex": 1401,
      "PostDate": "19/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 20, 2016 10:08AM AngelaKS wrote: Thank you all! I appreciate it! I don't usually feel like crying to be honest. I do have days when I think are you kidding me? Really? As I have probably said before, Stroke 6/15 - pulmonary embolism 3/16 and cancer 8/16 when is it enough? Anyway, thank you all again for the pep talk. I am feeling better today emotionally. <3 I love this group! Waiting to see what is going to happen with my levels today and see if I can go home. I hope so! I hope you are all doing okay with s/e. xoxo",
      "MessageIndex": 1408,
      "PostDate": "20/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 7, 2016 05:16PM AngelaKS wrote: Hello! I just joined this evening. I start chemo tomorrow. I had my port put in last Friday. I also have PET/CT scan early tomorrow morning before I have my chemo appointment. I am so glad you started this thread. I joined a couple of other message boards but they are not active apparently. I will be doing Herceptin, carboplatin Taxotere & Pertuzimab every 21 days. Thanks again!",
      "MessageIndex": 348,
      "PostDate": "07/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 11, 2016 03:41PM AngelaKS wrote: Oh my, today (day 4) has been quite rough. Not as tired but in a lot of pain. I know that I am not as hydrated as I should be but my tummy has been a mess and water is hard for me on a good day. I finally broke down and took a Motrin 800 which I have a prescription for but am not supposed to take due to the blood thinner, but I could not take it anymore. I hope that it works soon. Oddly even with the tummy issues, I have been able to eat more than I thought I would so that really hasn't been a problem. My mouth is sore but I don't seem to have actual sores. I did get some biotene but don't see a big difference with that yet. Thank you for letting me whine. Hope you are all doing well. xoxo",
      "MessageIndex": 444,
      "PostDate": "11/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 12, 2016 07:03AM AngelaKS wrote: Bagsharon - I feel for you. It is hard for sure. I hate lying on my couch watching my family. We took a trip to the store yesterday and I was sorry. My husband said later that he felt bad for having me go, but whatever, I got out and Nicklas got to look at what he wanted to see. CC2016 - do you have treatment every week? My back is hurting and tummy is still a mess but I don't hurt all over so I am grateful for that. I am still getting my rx filled, just in case.",
      "MessageIndex": 451,
      "PostDate": "12/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 21, 2016 06:16PM AngelaKS wrote: Hi all! I am doing much better, I get tired and have to nap, but otherwise I am feeling pretty good. After last week, I am very grateful for that! I am shedding a lot. My hair is think and in my opinion, my hairdresser left it much too long on top when we cut it off but I am losing it. I guess it will just take a while for it to be noticed. I ordered a scarf from Good Wishes and My USPS says it is out for delivery today. I am glad it will be here before I really need it. My friend has also ordered a couple for me that should be here soon. I do not know if insurance will cover a wig and now with only one income, buying one is out of the question at this time. My husband is a rock star and says that the scarves are sexy and he married me, not my hair (I'm not so sure lol) he doesn't care if I have a wig or not. As with many of you, my treatments will go through the holidays and I am concerned about how I will feel to celebrate or go to family gatherings. I have a 9 yr old so Christmas is still a big thing. Sorry, I think I am rambling a bit. I have not heard from my medical team that there are any issues with getting approved for the chemo or other drugs and I did have Neulasta so I am guessing that it was approved. It is a long story but since a couple of weeks after my stroke last year, I have had state insurance and while often a pain in the behind, they haven't denied anything as far as I can tell. Best wishes for a good day for all <3",
      "MessageIndex": 655,
      "PostDate": "21/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 28, 2016 04:01PM AngelaKS wrote: You look great Bagsharon!",
      "MessageIndex": 749,
      "PostDate": "28/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 7, 2016 08:00PM AngelaKS wrote: I forgot to add that I showed my peeling hands to my chemo nurse and she said it is for sure from the chemo. I had a steroid shot because of the reaction to the Perjeta and that cleared it right up! It is not as bad this time and really is just starting now. I have however had this hard lumpy skin between my thumb and forefinger on my left hand since shortly after infusion 2. It seems to be getting a bit better but while not really painful, quite uncomfortable. Like when you try to open a soda bottle and the cap is on tight and it hurts that spot. Thankfully, feeling much better today but have only had some broth, nothing really sounds good and my taste is still off but not as bad as last time. I guess maybe some things might not be worse each time which is something. I forget if I mentioned that I did not have the pain from the Neulasta this time around. I was achy but that could have been from D&V and dehydration too.",
      "MessageIndex": 912,
      "PostDate": "07/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 15, 2016 03:20AM AngelaKS wrote: That is a great story! I cannot wait until I am done as I am sure all of us feel. :)",
      "MessageIndex": 990,
      "PostDate": "15/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 15, 2016 10:16PM AngelaKS wrote: I noticed a difference awhile after my first treatment, but mine was quite large. I had an appointment with my MO last Monday and she said it was loads better. I had tried not to put too much on it until I heard it from her. I hope that it continues to shrink. I am sorry that some are feeling poorly, I do understand completely! I am going to go in for extra fluids next time and I hope that will make a difference.",
      "MessageIndex": 997,
      "PostDate": "15/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 8, 2016 01:58PM AngelaKS wrote: I have been having the eye twitching and bloody/runny nose too! Thanks for the tips on that!",
      "MessageIndex": 1340,
      "PostDate": "08/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 7, 2016 06:05PM AngelaKS wrote: Thank you for the welcome. How does the Phil's friend work? I went there but it asks for sender's information. Should one of my friends ask for this? Thanks.",
      "MessageIndex": 352,
      "PostDate": "07/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 8, 2016 05:00PM AngelaKS wrote: Thank you! I will be fine, and I will get through chemo. I was just feeling a bit down about it all earlier. I envy your weather! I envy everyone that lives where the weather isn't so awful in the winter lol xo",
      "MessageIndex": 1342,
      "PostDate": "08/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 8, 2016 08:28PM AngelaKS wrote: Yes, I forgot to say that. That is what she is reducing.",
      "MessageIndex": 1344,
      "PostDate": "08/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 8, 2016 12:46AM AngelaKS wrote: Oh wow Lisbeth, that is awful. I am glad the magic mouth wash helped you out so much.",
      "MessageIndex": 364,
      "PostDate": "08/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 10, 2016 05:59PM AngelaKS wrote: Beachbaby is right - it is all done together and the Herceptin has to be done a full year. I will finish that in early Sept. It also does not cause the same s/e that the chemo drugs do. I was told that it is protocol to reduce especially the Carboplatin and they do not seem concerned about it at all. I am guessing it is a better choice than stopping chemo. I did have a good echo last week so I was happy about that. I was concerned about having to stop the Herceptin.",
      "MessageIndex": 1353,
      "PostDate": "10/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 9, 2016 01:10PM AngelaKS wrote: kdtheatre - I am at the Lemmon Holton Cancer Pavilion in Grand Rapids.",
      "MessageIndex": 404,
      "PostDate": "09/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 13, 2016 10:13PM AngelaKS wrote: Didn't someone mention ridges in their nails? I noticed them but mostly on my left hand.",
      "MessageIndex": 1371,
      "PostDate": "13/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 13, 2016 07:03AM AngelaKS wrote: I am getting Neulasta too and I did see my MO yesterday and she expects that the pain from it will be better with each treatment. I really hope so, it is incredibly painful and hard to take anything for it when you are dealing with stomach issues. I did learn yesterday that I am ER+ 80% and PR + greater than 60%, I am not sure really what the numbers mean, I mean as far as the cell ratio, I get that but otherwise. I am rather frustrated with the center at this point. I try very hard not to complain and be positive but yesterday I went to my appointment and they said it had been canceled. What? No one called me. I was beyond mad, I called the main center (I see MO at the local hospital) and the lady said she would have scheduling call me to make a new appointment. Instead, God bless her, she called me back and had talked to her office manager as well as my doctor and I was able to see her at the end of the day, after a 1.5 hour wait. Anyway, still mad about the appointment but very grateful that Audry went above and beyond to help me. Today, the pharmacy called me because I had asked about why the Zofran hadn't arrived yet. They call me and say that they have been waiting for my credit card number! Umm you mean the one I gave you on Friday? Oh we don't have that, we went back through our papers. Seriously? I have been miserable because you messed up and then act like I didn't do my part? Wow! Sorry, I just am upset. I will get over it and hopefully it will be here tomorrow. She said it would be overnight. I hope you are all doing better today. Good luck on the wig shopping! I am sorry, I am having a hard time keeping up with everyone. I haven't really even thought about a wig, not sure about how I will get one yet. I guess I should look into it since by the weekend, it will be my turn.",
      "MessageIndex": 472,
      "PostDate": "13/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 22, 2016 02:44PM AngelaKS wrote: I love that song Kelly. Thank you. Thank you all! I appreciate your kind words. Congrats to all who have finished! That is wonderful! ",
      "MessageIndex": 1425,
      "PostDate": "22/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 23, 2016 01:33AM AngelaKS wrote: ACS -I only buzzed some of it. I got most of the last long parts but the hair all over me was making me crazy lol Hahlyn - what kind of shot? I had Neulasta pod put on the day of chemo but nothing else.",
      "MessageIndex": 679,
      "PostDate": "23/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 23, 2016 03:21PM AngelaKS wrote: LynnC1968 I have my second infusion on the 29th so I'll be with you in spirit. xoxo I have a bald spot and honestly, I too wish it would just fall out already at this point. I am tired of dealing with it. I am still tired but otherwise doing okay for the most part. I don't own a scale so I am not sure about weight loss but I think maybe a few pounds.",
      "MessageIndex": 688,
      "PostDate": "23/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Sep 25, 2016 06:26PM AngelaKS wrote: My hair is coming out more and more every day. I have been feeling pretty good other than the heartburn I usually have. Before chemo, I rarely had a problem with it. I think I will check and see if I can get some Prilosec or something. Sam - I am on the same treatment as Emily, only a day behind. I do my blood work and all on Thursday and I am planning on trying the ice chips this time. I hope it helps because I can't eat so many things anymore. I really can only eat stuff that has a sauce for the most part. Just strange. I hope you have all had a good weekend. We had football yesterday and got some cider and donuts for the kids. Nicklas plays over an hour away next weekend, so we got a room and are driving down the night before. Should be fun! Here is to a good week for all of us. xoxo",
      "MessageIndex": 709,
      "PostDate": "25/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Nov 25, 2017 11:37AM AngelaKS wrote: I just wanted to check in and see how y'all are doing? I am very sorry I fell of the planet for so long. I was feeling so badly and having issues on my computer with this site so I gave up. I was thinking of everyone today and thought I would try and I got right in!  I hope that y'all are doing well. xoxo",
      "MessageIndex": 1854,
      "PostDate": "25/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 20, 2016 04:46PM AngelaKS wrote: Congrats ladies! That is awesome! I am having my third treatment tomorrow. I got my new port on Tuesday and I am praying this one works better. It was sore yesterday but is better today. Here's to little to no se for all of us.",
      "MessageIndex": 1048,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Oct 21, 2016 10:34PM AngelaKS wrote: Hi all! I had my third infusion today! Yay! Halfway done! I tend to have swelling and take a water pill - well this week, I mentioned to my husband that I was still taking it the day of and the days after chemo and I wonder if that contributed to my being so ill? I am not taking it and have not been since I got sick a couple of weeks ago so I too am the Staypuff Marshmallow man and cannot even wear my wedding band. I do not want to be that sick again so I will not take it until I see how things go. Everything went well today and my port worked like a charm! I had an allergic reaction to the Perjeta on 9/30 and so now I get Benadryl and a bit of a steroid to begin with each treatment. Even though they were not crazy busy and we had none of the excitement of last time, it still takes forever! Oh well, only three more to go! We didn't have time to go to the wig place after we were done (again) so I still do not have one. Wearing scarves and beanies still all the time. My scruffy hair is still hanging in there and doesn't seem to be falling out as much. I cannot shower yet because of the new port so I guess I will see when I can do that if more comes out. Hoping that we all have a good weekend and have little to no se this round. xoxo",
      "MessageIndex": 1068,
      "PostDate": "21/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Nov 16, 2016 06:05PM AngelaKS wrote: Congrats to those finished with chemo! That is great news! I have 2 more to go and it has been rough. I am on day 6 of round 4 and I don't feel great but better than I have in the past by now. I spoke way too soon after #3 by day 5 I was super sick and ended up in the ER on that Friday. I have all kinds of new meds to help me, unfortunately since my insurance is so messed up, I wasn't able to get them until day 4 and I needed to start one of them on day 1. I am praying that they helped anyway. My hemoglobin was 8.8 and they say if less than 8 I need to have a blood transfusion. I saw my MO last week Monday and she says she cannot feel the tumor anymore. Praying it stays that way and I am due to have my first follow up echo. Just waiting for them to call for my appointment. Praying my heart is tolerating the Herceptin. Much love to all!",
      "MessageIndex": 1238,
      "PostDate": "16/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Nov 20, 2016 12:38AM AngelaKS wrote: Thanks ladies! I am feeling somewhat better but just want to get out of this place. lol Have a great weekend ladies.  xoxo",
      "MessageIndex": 1266,
      "PostDate": "20/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Nov 20, 2016 06:18AM AngelaKS wrote: Thank you Dennyj! I apologize for not responding to each of you. I get all jumbled and cannot remember who posted what. Please know that I am thinking of each of you and praying for all. I do not mean to lump y'all together. Having kids is hard and I am grateful that mine are not younger. I know your worst fear and am there with you. I too, try to stay away from that. My youngest is only 9 and I feel terrible for him, but then my daughter is 15 and I think it is equally hard for her in a bit of a different way. Hope you are all resting well and feeling good to enjoy your Sunday. xo",
      "MessageIndex": 1268,
      "PostDate": "20/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846973",
      "Title": "Who is starting chemo in September 2016? MFalabella smilethrupain"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Dec 22, 2016 05:52PM AngelaKS wrote: At this time, all I know is that I will be having surgery in January. I finish chemo on Dec 30 (I hope) but I haven't met with the surgeon yet. My MO stopped by my hospital room the other day and said I will most likely have bliateral mx which I did not see coming at all. I will fill you all in on the details as soon as I know what is going on. xoxo Happy Holidays!",
      "MessageIndex": 15,
      "PostDate": "22/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "AngelaKS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239100/profile",
      "Content": "Mar 7, 2017 02:22PM AngelaKS wrote: I am sorry that I haven't been around. I had surgery last week. No reconstruction until after radiation. I spent most of January in the hospital so surgery was delayed. Margins were clear and one node of 9 was positive and it was a lower one. She thinks they got it all. For some reason I don't see MO until the 31st which seems like a long time since the surgeon said they want radiation to start between 2-6 weeks after surgery.  I hope you are all doing well. I am so glad that chemo is over and I am finally starting to feel better. I actually got quite a bit done yesterday and I am feeling it a bit today but I am having a hard time sleeping since surgery.",
      "MessageIndex": 2608,
      "PostDate": "07/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    }
  ]
}