{
  "AuthorID": "Angie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
  "Posts": [
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 7, 2008 06:54PM Angie wrote: Hi,  I too was just diagnosed with triple negative BC in Nov. Since then I had my right b removed and then had to go back for lymph node dissection. The sentinol came back neg, however, the 1 node that my sur. did remove came back positive. The good news is that all 11 that she removed the 2nd time around came back negative. I am starting TAC on this Thursday and have learned to take each day one at a time. My best piece of advice is to not let this become who you are. Remember to enjoy life each and everyday. One of my biggest dreams has been to go ice skating. This weekend I finally found the courage ( yes courage, at 36, the last thing my SIL and I needed was my 14 yr. old and her friends to see us falling all over the ice) to go. My husband had our other 3 younger children by the side and snuck some pix of us and the joy on my face was humbling. I realized that over the past few weeks I had let BC become me, and now I remember to take a break, step back and just enjoy what I have today. Bless you all. Thank you for reading and I am so glad I found this place of sisterhood. It means a lot.                                                                Angie",
      "MessageIndex": 6,
      "PostDate": "07/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698053",
      "Title": "Just diagnosed hummer Jen44"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 8, 2008 07:05PM Angie wrote: Hi Jenny,  Yes my children are the best. They keep me laughing, especially the 2 and 3 year old. My 7 and 14 year old keep me occupied with their schedules so that really helps me remember that life goes on and I am definitely not going to let it pass me by. Any words of advice for me? I start the same treatment this Thursday at Riverside (PCI)and not scared but nervous. Also, how soon did you lose your hair on TAC? I want it to be my choice when it goes so I was thinking about shaving my head this weekend. Hope to hear from you soon.    Hummer, I agree that your surgeon does not sound the best. This time is difficult enough and you should surround yourself with a team that is willing to work with you and for you. I have been blessed with a surgeon and oncology team that has been supportive and informative. When I first found out I was shell-shocked and relied on my team to help me through.So please take a step back and find someone who you all feel comfortable with. You and your family will be in my prayers. With love.",
      "MessageIndex": 13,
      "PostDate": "08/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698053",
      "Title": "Just diagnosed hummer Jen44"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 8, 2008 06:47PM Angie wrote: Hi all and a BIG thank you for the advice. I will be telling them in the morning. Rebecca I agree about a letter to the parents, but I had so many quick appts. that tomorrow snuck up on me. I do still intend on sending a note home.    Also, ironically, my 7 year old had the same superhero interpretation with the chemo. I have 4 children. 2 girls and 2 boys. Their ages are 14, 2, 7, and 3. They are handling this well so far even though we have just begun.     Jenny, YES I am going to PCI and so far I love them. I start chemo on Thurs. and am a little nervous but so far not afraid. I work with the 2nd grade at Phillips and have a child at Smith and at Kecoughtan. I would love to email you so please look for that soon.     Shirlann, I agree with you about speaking about cancer in a normal voice. So far the children at school have seen me continue to just be me through several surgeries so I am hoping that that will help them understand a little more.     Again thank you all for the words of advice.                                                     With love,                                                     Angie                                                   Hampton, Va",
      "MessageIndex": 4,
      "PostDate": "08/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698125",
      "Title": "telling my class Angie WendyK"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Angie wrote: Good morning,I am a 36 mother of 4 children and was just diagnosed on Nov. 1. Since then it has been a whirlwind of surgeries and appts. as I know you all know. I get my portacath Wed and start chemo on Thurs. Very overwhelmed however, I am learning to take one day at a time. I do need help today though. I want to tell my 2nd graders about my diagnosis but am unsure about how to do this. The library has only 1 book which was not in. I don't want to step on parents toes, but I also don't want to walk in on Mon with a bald head and shock them senseless. I appreciate any help that you all can give.                                                       Angie                                                   Hampton,Va. Angie Dx 11/1/2007, 0/11 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698125",
      "Title": "telling my class Angie WendyK"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 29, 2008 07:28PM Angie wrote: I had my port put in Jan 9 and she left my needle in as I started chemo that next day. Mine was really uncomfortable also. I was actually scared to move my arm. It does get better as the swelling goes down. I don't feel it now unless something hits me there.                                   Good luck!",
      "MessageIndex": 6,
      "PostDate": "29/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699356",
      "Title": "OOOWWWWWWW!!!! one2beamup thedudess"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Feb 1, 2008 04:05AM Angie wrote: BTW Mia, it is fine to have a massage during chemo. At the center I go to we get a free one hour massage. We were told that if you go to someone personally, to let them know that you are in chemo tx.",
      "MessageIndex": 3791,
      "PostDate": "01/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 25, 2008 03:35PM Angie wrote: Hi all,     Wow Ulla, Happy for you and your last treatment. Blowing my horn and throwing confetti for you.    Karen, glad to hear about your mom. She sounds like mine. Since my dx she has put herself on the backburner. No matter what I tell her, if she has any problems her response is \" it's nothing compared with this, let's get you through this\". At least your mom went to get checked.    Sue, you asked me about my treatment. Right now I am on TAC which is taxotere, adramycin and cytoxan. I get that every 21 days. I have one treatment under my belt with 5 more to go. The next being Jan 31. The 1st one went okay. Really drained for the first couple of days, and minor nausea. My hair is coming out past 2 days. Very lucky this round. I decided to just take each day one at a time. Reading the boards has helped.     I do have a question, is it normal for my eyes to be pink? I have noticed this and my lid is a little red.    BTW I love the shirt. I'm going to have to get one.     gb lucky you with a Sat to yourself. I have 4 kids so I forgot what that was. LOL              With love,",
      "MessageIndex": 3373,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 28, 2008 12:30PM Angie wrote: Hi all,    I hope you had a great weekend. Mine was busy but fun. I had a lot of reading to catch up on.    gb if you still have the links for the triple neg info, I would love to check it out. The more positive info I find the better I feel. BTW, I agree with you about the difference in schools now and when I was in school. Here, there is so much put into standardized testing it's sickening. I think that if parents really knew, they would not be so in favor of them. But I do like being a teacher's ass't. I feel like the nurse of the ed. field. While the teacher wisks in and feeds the info, I get to come in and hold the child's hand during the process. I love it.      Lisa, is there any way you can defer your insurance premiums since you will be on LWOP? That's what I did 2 years ago for my knee surgery. That really helped take a financial stress off of us. Also I know I'm late on this, but I think you calling on your ex took guts. Good for you.      Loved the pix of you all. Y'all are beautiful ladies.                                                                   With love",
      "MessageIndex": 3605,
      "PostDate": "28/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Feb 1, 2008 03:59AM Angie wrote: Hi All,    Just a quick update before work. My chemo went well yesterday. Came home and slept. 2 down and 4 to go. I'll be happy to see those #s flipped.    I am so glad I read the posts. Y'all had me laughing and made me feel better. I have to show this to my hubby so he can understand that it is not just me. Even my own voice can grate on my nerves.    Karen OMG are you sure you're not married to my dad? My mom has the exact same complaints, except that she is the one who moves to the other room. Funny.    Sue, I do have some weird dreams when I first close my eyes. They're not even clear. Just really weird visions. Hard to explain.    Check in later after work. Have great day.                                                   ",
      "MessageIndex": 3790,
      "PostDate": "01/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 25, 2008 03:54PM Angie wrote:    Yeah 4 little darlings  I have 2 girls Tyana 14 and Alexis 2 and 2 boys Christopher 7 and Jordan 3. Between them and my husband they keep me positive.     So far I do not have to have rads since my margins were clear and lymph nodes as well. I saw mention of the red devil a few posts back. What is that?    And yes it is good evening so far. Work went well and the kids are quiet. And, since my hair is falling out so badly, I don't have to cook dinner. Good evening to me. HEE HEE     With love",
      "MessageIndex": 3383,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 29, 2008 03:37AM Angie wrote: Good morning,    Jane thanks for the site. I'll check it out this morning.    Melody, yes I have the 4 lovies. That's why I'm up on my day off at 5:30. I have my 2nd of 6 cycles on Thurs. I am doing taxotere along with adriamycin and cytoxan. First round went well. The onc was really happy with all my labwork and after seeing me.    I have good news. A couple of weeks ago I met a woman on here who lives in my area with same doc, surgeon. She has been very supportive and we finally get to meet today. I am so excited. Our schedules have been too busy until today.    Also, is it me or do y'all find yourselves looking for other survivors? Last night I was at my son's P.T.A. meeting and saw another woman there with a scarf on her head. I found myself watching her more than the meeting. Afterwards, we were behind her walking out. My husband told me to go talk to her. I did and bless her heart. She is a single mom who was just dx with leukemia. She unleashed her story and was close to tears as finally seeing someone else who is sick. We exchanged hugs and promises to see each other at the next meeting. And to think I almost didn't go. I was so glad to put a smile on her face.     Sorry to talk so much, but being on here and hearing such words of courage and inspiration, helped me reach out last night. I know that I can come one here and vent and cry and y'all understand. This poor girl does not have that. Have a blessed Tues. and thank so much for being there for me. ",
      "MessageIndex": 3619,
      "PostDate": "29/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 23, 2008 06:38AM Angie wrote: Good morning all,      I hope that you don't mind if I join in the fun. I have a read a few posts and have enjoyed the support you all give each other. I was diagnosed Nov 1 and just started chemo and would love to be able to share with someone who understands. I started on this site earlier this month after working up the nerve to look around and found a  wonderful friend and supporter who happens to live right here in the same city. I love this site.      I'm 36, married with 4 beautiful, crazy kids. I am lucky to have my family here in the same area. Unfortunately, they are constantly watching me to see how to treat me. Nothing like being under a microscope.     My chemo cocktail is TAC and I started on Jan 10. My next is Jan31. 1 down and 5 to go!!     Well, my daughter is moving around so it must be time to get them up for school.                                                                                                               Have a great day!!                                                        ",
      "MessageIndex": 3226,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 23, 2008 06:07PM Angie wrote: Hi All,     Thank you for the welcomes. I like the quiz, I scored 48.",
      "MessageIndex": 3303,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 30, 2008 06:19PM Angie wrote:    Lisa, I definitely hold moms like you in the highest regard. You have a lot on your plate and still come out on top. You go girl I know that your daughters are going to be strong women with you as their model.    As for your mil, boy do I understand. My mom is an enabler for both of my OLDER brothers. (Both are at home) So you know I have stories of their crazy lives. My mom is getting tough. About time. The good news is that while they are there she gives them hell about the state of their lives. I love it. Then they have the nerve to complain about her. So my dad and I tell the remedy. MOVE OUT!",
      "MessageIndex": 3703,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 25, 2008 04:06PM Angie wrote:    I think gb is right on the margins also.    Going through this with my children has helped me find the strength to stay so positive. When I first found out, I buried my head in the sand and just let the decisions be made for me. But then I thought of my family and that gave me the courage to get started looking for info and attacking head on. I refuse to let life pass me by, no matter how tired I feel or how bald I get. This WILL NOT defeat me. I made that promise to my 14 year old and she watches me like a hawk to make me keep this promise. She has my temper so I don't know if I want to cross her.     With love",
      "MessageIndex": 3386,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 25, 2008 07:35PM Angie wrote:    Karen, thanks for the info on the eyes. I saw my onc yest and forgot to ask. Need to remember to write things down. My 14 yr old is a blessing. She is a typical teen w/o major attitude. WOOHOO.    Sue, I wish I could shoulder some of the pain. I am with you in spirit and you are in my prayers. Just when you think that you can't take anymore, that is when you can find it in you and in all of us who love and support you to go that extra mile. BTW, what type of treatment are you taking?    gb, good luck going back into teaching. I am a teacher's aide with 2nd grade special ed. and love it. For me there is no better profession. Karen is right about a few teacher's here picking the career for summer's off. I work with one and it's been hard to see the children not get the chance they deserve because their teacher does not want to be there. Is that a problem there?                           With Love",
      "MessageIndex": 3403,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 29, 2008 10:11AM Angie wrote: Hi all,     Karen, I just want you to know that I'm thinking about you. I know that everything will come out for the best. My fingers are crossed and prayers are said.     Sue I know how you feel about being uneducated. Everytime I read something, it leaves me with even more questions.     On a lighter note. I met my friend and she is the best. We had a blast and we were both upset that I could not stay. WOW what a sisterhood I belong to. I love you guys and carry you all with me in spirit.                                                      With love",
      "MessageIndex": 3629,
      "PostDate": "29/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 30, 2008 05:57PM Angie wrote: Hi all,     I just wanted to drop a line to say hello and  hope that you are doing well.    It must be something in the air for arm pain. Mine has had the little needle pricks since yesterday. Then on top of it I started the steroid today so I have that wonderful blah feeling. All this in prep to sit in a chair for 5 hours tomorrow. Big freakin woo.    If all goes well, I'll post after treatment. Sleep well.                                          With love",
      "MessageIndex": 3699,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "Angie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59701/profile",
      "Content": "Jan 30, 2008 06:05PM Angie wrote: Lisa,     I know it took it courage to do what you did and I have nothing but respect for you. My SIL is going through this with my brother and they are not divorced yet. She had to file for child support. My mother is upset, not with her, but because he was not raised that way.I think we as a society make it to easy for parents to cop out of their responsibility. You did the absolute right thing, and I hope it pays off for you and your daughter. $1000 is not enough. His bond should have been what he owes you.",
      "MessageIndex": 3701,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    }
  ]
}