{
  "AuthorID": "anianiau",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
  "Posts": [
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Feb 12, 2009 10:19AM anianiau wrote: I'm hoping Beesie will come in on this one. My understanding is that relatively recent research shows that going back for the rest of the nodes may not be the thing to do. Instead, go straight to chemo. Worth asking your MD about what his/her reason is for doing so. Just my opinion, but it's your body. I wish you a speedy recovery, whatever your decision.",
      "MessageIndex": 3,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728878",
      "Title": "Second surgery to get lymph nodes??? 2lkh538 55Barbara"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 27, 2009 08:59PM anianiau wrote: The BIRADS scale is basically an index of suspicion, from 0 (not suspicious) to 5 (highly suspicious) that radiologists use to assess the likelihood that a finding seen on an image is indicative of malignancy. Your stereotactic biopsy didn't show malignancy. That's good news: Things are probably okay. The down side of doing a stereotactic biopsy is sampling error. In other words, did they hit (exactly) the right spot? Ask your doctor about that small risk--there is a small chance they missed something--and be sure to keep your ultrasound appointment! Any time you poke and prod--and a stereotactic biopsy is definitely poking and prodding--your breasts respond. If the sampling transected (cut across) your ducts, a discharge might happen. Ask your MD how many samples were taken, and from where, and whether your symptoms are consistent with what would be expected clinically. Go over with the MD any relevant family history of cancer--breast, ovarian or colon. A lot is happening right now, and you're also recovering from the stereotactic biopsy. It's so normal to have all those 'what if?' feelings. You've already had the sterotactic biopsy, which is the hard part. The ultrasound is minor. Please be gentle with yourself and don't expect too much. Your feelings are what they are. The statistics are on your side. Good luck on Thursday.  ",
      "MessageIndex": 1,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/728100",
      "Title": "Confused and Need Answers bbmom09 bbmom09"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 31, 2009 10:23AM anianiau wrote: A magnificent post, RadiologyBiller. Thank you.",
      "MessageIndex": 52,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/727995",
      "Title": "Insurance company will not cover my MRI blas dlb823"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Feb 22, 2009 12:38AM anianiau wrote: The odds are also different for BRCA1 and BRCA2...",
      "MessageIndex": 11,
      "PostDate": "22/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/729333",
      "Title": "What are the chances? kdholt Sessna1"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 17, 2009 06:17PM anianiau wrote: This is scarey territory. Take deep breath, joanmac52, then do the follow up your MD has set up. What should lyou expect? My guess is that you will have a lot of decision making to do, as soon as you know what you are dealing with. Sounds as though you have a single mass, so an excisional biopsy would give you a definitive answer to the question, Is this cancer? Other biopsy methods can miss the target, so if you are given a choice, you may want to request the excisional biopsy. When you go to the appointment that is being set up with your surgeon, TALK with him/her! You'll get his/her best effort on your behalf if you ask for the reasons behind the recommendations being made. I suggest bringing along a significant other to the surgical consultation. That person could be your husband, friend, sister, whoever you know will be level-headed enough to handle the job of listening, taking notes, and asking questions you may not have thought to ask. Yes, you should make the decisions, but that doesn't mean you can't have help. Of course you are scared! You can ask you MD for anti-anxiety meds if you think that would help. Whatever you decide, know that you have come to a very good place for support and information. Women who have traveled your path--whatever it may be--know the inside scoop on how to handle day to day issues. (I think the registration shows about 44,000 women and some men, as well, are registered users.) The research threads are good places to search for expert information from the MDs and clinicians. You can go to the chat rooms as well as the discussion boards, for real-time contact with other users. I wish you the best of outcomes. Please let people know how you fare.  Hugs & aloha.",
      "MessageIndex": 1,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727544",
      "Title": "Spiculated Mass joanmac52 Moderators"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 26, 2009 11:05AM anianiau wrote: I have had three excisional biopsies at three different hospitals. In two of them, the wire localization was done through a hole in a special mammogram 'paddle'--but at the third, I was told to stand in front of the radiologist, who placed them 'freehand' and then checked placement with a mammogram. It was actually easier than using the paddle. I asked why the procedure was done one way or another, and the radiologist said that it depends on where you trained. The worst part for me? At the end, the tech covered the wires with a plastic cup, which she taped over the wires. I looked really weird, and that mattered only because I had to go through the waiting area in a wheelchair--with a male transporter! Fortunately almost everyone had left, and the transporter had the sense to say nothing. The mammo department was not close to the day-surgery area, so we had to go through the halls, and up an elevator, but at least he took me the back way and through the staff-only elevators. Bottom line, it was not as bad as I'd thought, either emotionally or in terms of pain. If you are having a hard time, ask for anti-anxiety meds. It's not too late even right before the procedure. Good luck. This will be over soon, and you'll likely be able to do what most of us are doing, look back and say it wasn't that bad after all. Meanwhile, a cyber-hug to you.",
      "MessageIndex": 14,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723823",
      "Title": "excisional biopsy rhodagrl JayeGA"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 14, 2009 01:49AM anianiau wrote: Good that your husband is going with you, and that he's supportive. Sounds as though focusing on your horse and working with him/her does good things for you. Distraction like that takes us out of ourselves & is good for all of us. However, I feel sad to hear you apologize about venting. Of course your emotions are all over the place! This forum is a good place to vent, and it's safe to do so. You are already starting to recognize that things could be different in a bad way. That's a good start for getting back in balance. Take care.",
      "MessageIndex": 3,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727309",
      "Title": "I am so confused as to which route to take jancie Beesie"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 13, 2009 10:41PM anianiau wrote: Yes, this does suck! Don't apologize for having your feelings. They are what they are. You have every right to them. That said, I hope you will listen to what your MDs have to say. If possible, arrange for your husband to accompany you to this appointment. Then, give yourself--and him--a little time and space to process what you've heard. Talk with your husband. This affects you both. Then, go with your gut. After all, YOU are the one who will have to live with (and balance) the cosmetic outcome and the overall results (quality of life, longevity, and the possibility of premature death). That makes you the only one who has the right to make the final decision. Best of luck to you both. ",
      "MessageIndex": 1,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727309",
      "Title": "I am so confused as to which route to take jancie Beesie"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Feb 14, 2009 11:50AM anianiau wrote: Let's send her to sit in the corner! Or at least have her write 100 times, \"Stage IV breast cancer, like Type 2 diabetes and HIV/AIDS, can now be considered a chronic disease, with treatment option available to hold it in check for an extended period.\" Roseg, I love what you said! \" [they] think anybody with Stage IV cancer is at the bus stop waiting for the grim reaper.\" Needed that laugh today. ",
      "MessageIndex": 7,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729080",
      "Title": "Carry on with treatment ? riverinerabbit riverinerabbit"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Mar 10, 2009 07:30PM anianiau wrote: There's a great little saying about why not to assume --\"To ASSUME makes an ASS out of U and ME.\" Be very clear with your plastic surgeon about what YOU want, and why. It's useful to write down your concerns and questions before the appointment--and bring out that list at the start of your appointment. I have found it helpful to start the conversation by saying something like, \"Here's what I think I want. Now tell me the up- and the down-side of doing it that way.\" That gets me the benefit of the person's professional knowledge while making it clear that I will be doing the decision-making. Otter's right. It's worth doing a lot of research. In the end, you are the one who must live with the physical consequences of whatever decisions you make. About those rashes: Have you seen a dermatologist? One thing it's good to rule out is yeast infection--C. albicans. If that's the cause, it would be good to clear it up before your surgery. Good luck to you.",
      "MessageIndex": 2,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/730442",
      "Title": "sensitive skin/sizes? seltzer anianiau"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 4, 2009 11:46PM anianiau wrote: On December 8, I had a bilateral mastectomy (7 nodes removed on the left,1 on the right) but no reconstruction/expanders. Within a few days I had no difficulty doing laundry and no major problems with lifting my arms over my head. However, I found one of those \"reachers\" to be very handy for getting down lightweight nonbreakable items from shelves, picking things up from the floor, or getting small items out of the dryer. If you set up the washing machine with detergent, etc. and do the settings on the dryer, then emptying the washing machine of wet clothes; loading and emptying the dryer; folding laundry and putting it away are things both of your daughters should be able to help out with. Results might not be perfect, but so what! Things will be clean, or at least clean enough. The girls' help will leave you with the energy to tend to their emotional needs, which is important. Even 4 weeks postop, I still find driving a challenge, because of the way the seat belt hits my incisions. At least for me, right now I find it's helpful to tuck that part of the seat belt behind me. My drains were removed too early. Be sure to bring your drainage chart with you to MD visits! And take sbmolee's advice and stock up on a laxative! As many women have noted, this really is major surgery. Not only are you having a bilateral, you're doing tissue expanders. Don't push yourself unnecessarily. Lower your standards on the things that don't matter. Look after yourself and the girls. Shower when your MD okays it. Answers on that seem to vary. I think it was a week before my bandages came off and I could shower. Best of luck to you and your girls.",
      "MessageIndex": 13,
      "PostDate": "04/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726598",
      "Title": "Hello from a NEW member! elizzim elizzim"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 14, 2009 03:30PM anianiau wrote: This lump does sound different. You're doing what you need to do. Good for you! With luck, it will be benign. Please let people know how it goes.",
      "MessageIndex": 3,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727334",
      "Title": "change in lump lagrimas4 anianiau"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 28, 2009 06:27PM anianiau wrote: Jancie, in the end it comes down to you and what you are willing to settle for, and whether you are willing to give up incompatible goals. Do you want the pleasure of continuing to smoke, even though a side effect may be a shortened life? Or are you willing to give up smoking for your best shot at prolonging your life? Remember, the consequences aren't just limited to potential breast cancer. It's lung cancer, emphysema, cardiovascular disease, etc. I wish you well. From experience, I know it's hard to quit. FYI, the average smoker who succeeds in quitting had tried to quit at least a dozen times. Peace.",
      "MessageIndex": 41,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727106",
      "Title": "Smoking and no masectomy? Deb-from-Ohio anianiau"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Feb 14, 2009 02:44AM anianiau wrote: I found several products carried by www.breastbinders.com that were helpful. I mention the website because I could only find them online, although the company told me that two local hospitals order them in bulk. I followed the company's advice and called the hospitals, but neither would sell to an individual. Bummer! Basically the products are all variations of the same thing. They are made out of soft knit fabric sewn with an elastic thread--this makes them look shirred, if you know what that means--and they are closed using a velcro strip. The edges are soft and not irritating. Good luck. These early weeks are full of body changes and maybe these suggestions will give you ideas about what might work for you. For all-over compression (which could hold on absorbent material with ointment) they carry crinkled-looking rolls of bandage in different lengths; these are the least expensive. I bought two of these, in different lengths. They served different purposes. I liked their lined breast binders for day. I asked to have this used after surgery, so this one I did not have to buy--I woke up wearing it! For night use, I liked their abdominal binder, which can be ordered in longer lengths and I felt it was more adjustable. I found it useful to have help from my husband in putting them on, because that way I could have the velcro strip used for closure placed in the back instead of the front. They also carry a compression bra which closes with velcro and has velcro-adjusted straps as well as little 'puffies'. My surgeon was quite impressed with that, for some reason.",
      "MessageIndex": 7,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729004",
      "Title": "Sports bras cutting into sential node scars samiam40 lazydaisy"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 28, 2009 06:43PM anianiau wrote: Jorf mentioned the book \"Breast Cancer Husband\" already, as I have elsewhere on these discussion boards. It's an excellent book, which my husband read and found helpful. I checked just now, and Amazon still has it (for $5.99) as a bargain book. There are 24 customer reviews, of which 22 rank it 5/5 stars, and 2 rank it 4/5 stars. You might want to read a few. Good luck to you both.",
      "MessageIndex": 21,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/728047",
      "Title": "How help my wife through chemo? Husband11 Ninja"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Feb 11, 2009 07:34PM anianiau wrote: Please note that your report says \"...This may represent a neoplastic lesion...\"  A neoplasm is defined as an abnormal growth of tissue, or a tumor. But not all neoplasms are malignant. Let's hope this falls into the non-malignant category. Nonetheless, it is time to move on this. From what you've said, you have a relationship with the doctor that ordered the pelvic ultrasound. Calling your doctor's office to set up an appointment to discuss your options and best bet for treatment would be a very sensible move, if you haven't already done that. Writing down your questions and concerns would be likely to help you get the answers you need. It also does seem sensible to schedule surgery to have this taken out. I would guess your doctor is expecting that call. It feels scary to have to go through this, as you already know from your experience with breast cancer. But as you already know, waiting is going to be part of the process. Avoid telling yourself scary stories. Don't let other people tell you them, either! Keep in mind that you have dealt with this before. What worked best for you then? Did you ask your MD for meds? Did you find it helpful to pray or to ask for support from family, friends, a therapist or a spiritual advisor? There are a lot of ways to cope. These discussion boards are one way, but they don't have to be the only way. I'm sorry that you have to go through this, and I will be thinking of you and hoping for a good outcome.",
      "MessageIndex": 2,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/728913",
      "Title": "Does anyone know.... horsrde horsrde"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Feb 19, 2009 08:18PM anianiau wrote: A year of this? Enough, already! Take a friend with you to whatever follow up appointment you make--same MD or (better yet) another one, for a second opinion. That friend needs to be someone who doesn't have trouble speaking up. You need an advocate. Before the appointment, do some homework. Write out your questions, along with a short summary of what has happened & why you are concerned. Give the MD a copy of this when he/she walks in. Good luck. ",
      "MessageIndex": 3,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/729389",
      "Title": "just not sure what to do... jennyjenn ecm"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 22, 2009 01:56PM anianiau wrote: Hope you have found another MD to do your surgery.  As a former (heavy) smoker, I know how hard it is to quit. But I hope you will keep trying! I read that it takes something like 10 or 12 tries to finally quit. Good luck to you. ",
      "MessageIndex": 34,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727106",
      "Title": "Smoking and no masectomy? Deb-from-Ohio anianiau"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 12, 2009 04:14PM anianiau wrote: My understanding is that the two are basically the same procedure, applied at different times. An excisional biopsy (pre-op) is the intended complete removal of the tissue of interest, before the nature of the tissue has been determined. A lumpectomy (post-op) generally seems to be applied to removal of a lesion that is known to be cancerous. To me it sounds as though you will be having an excisional biopsy. The surgeon does not have to be concerned about obtaining \"clean margins\"--cancer-free tissue--when the mass is thought to be benign, so the amount of tissue removed tends to be smaller and therefore less likely to deform the breast. Tissue removed during a presumed excisional biopsy still goes to the path lab. If it were verified as benign, no more needs to be done. If it were malignant, you might need more surgery--probably a lumpectomy; it would depend on the margins. Good luck with your procedure next week. Surgery is never fun.",
      "MessageIndex": 2,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727217",
      "Title": "Lumpectomyv.Excisional Biopsy to remove entire - difference? Sock Sock"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Apr 6, 2009 02:46PM anianiau wrote: Hi, 4 greatkids, this really is a tough time in your recovery. Please don't expect too much of yourself. I can't say for sure that it will be alright, because I can't see the future. But for most of us, it really will be alright, and it's a safe bet to say that in a month you will be feeling a lot better. Try to alternate between a short term and a long term viewpoint. What can you do to make the next hour better? Rest? Do some walking? Distract yourself? (I ordered Netflix as a treat.) Then recognize that the passing of time will bring healing. You may not see the changes day to day, but week to week will bring improvements. I had my husband take digital photos so that I could see those changes. I'm almost four months out now, but no expanders since I don't plan on having implants or reconstruction. Life is pretty much back to normal in most ways. Keep in mind why you had this surgery: because you valued your life. I wish you good healing and good results, and send gentle hugs your way.",
      "MessageIndex": 2,
      "PostDate": "06/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732040",
      "Title": "just need a hug 4greatkids econmom"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Mar 26, 2009 06:38AM anianiau wrote: One day, just shy of 24 hrs, but I had a bilat mx w/no recon. I was pretty independent, but my husband was able to arrange to work from home for a day or two. However, he did take care of the catpan for the five or six weeks it took the skin incisions to heal. Put things that you will need to use frequently on the counter. I strongly suggest getting grocery shopping done before surgery. Catch up on laundry beforehand, too. And be sure to have a good laxative on hand! Those pain meds can really constipate you, and you may find it hard to drive for a few weeks. A friend suggested buying milk in 1/2 gal cartons instead of the gallon jugs. That was a great idea. If you have small children for whom you provide care, you'll be better off getting some help at home for at least several weeks. Good luck, and take care of yourself.",
      "MessageIndex": 9,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731379",
      "Title": "How long was your Hosp stay for BLMas LynnVA NancyD"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Mar 4, 2009 07:31PM anianiau wrote: I have controlled my type 2 diabetes for about three years now, using diet only. My a1c results have consistently remained well under 7. The critical element for me being able to do this has been working with a registered dietitian to find a way of eating that keeps my blood glucose levels from spiking. Easier said than done! The RD helped me learn to make food choices using the glycemic index and following what's called a consistent carbohydrate content diet, which spaces out the carbs evenly over all three meals. I have daily protein goals (in grams) as well as carb limits. I can eat things that aren't desirable as long as I limit the amount AND the frequency, and pair them with a food that will 'dampen' the impact. E.g., pairing a cookie with a small glass of lowfat milk, or (ONE) square of cark chocolate with ~10 raw almonds. The best way I have found to bolster my will power is not to allow some things in the house! I will eat them away from home, & only a small amount. To help with portion control, I thought a scale would be helpful. (It is.) After spending tons of time on Amazon, reading editorial and customer reviews of different scales, I felt more & more confused about what to buy. Then I found www.saveonscales.com whose prices & quality were better than what I found on Amazon, and no, I don't get anything for referrals. Mine came from the SOS clearance items, but their brands are well-known and they continue to offer good deals. I also eliminated ALL soda & fruit drinks (even diet varieties) & avoid foods with high fructose corn syrup. (If I want baked goods such as muffins, I do them from scratch, using whole grain flour, etc.)  Pasta is whole grain & is cooked only al dente --and limited to 1 c at most. I cook a mix of whole grains for breakfast and use a little agave syrup to sweeten it. Dorothy, you have my admiration for keeping a food diary. I find that very hard. Good luck to all. BC itself is enough of a challenge. ",
      "MessageIndex": 5,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730096",
      "Title": "Diabetes and Breast Cancer kmccraw423 kmccraw423"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 16, 2009 08:16PM anianiau wrote: MelissaA, even if you have exceeded your limit on posting on the discussion boards, you should still be able to go to the chat room and PM people. Good luck with your biopsy.",
      "MessageIndex": 5,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/727445",
      "Title": "can somone help with posting question... MelissaA MelissaA"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 22, 2009 03:47AM anianiau wrote: I think it's good not to burn bridges. You may need some of these people for practical and emotional support down the road. That doesn't mean you have to let them rule your life and time. Some simple, direct words to close friends and family generally work best: \"I need to take some time alone now to think\"--said with a smile as you go out the door--should do it. If not, leave a note explaining in whatever way seems right to you. For people to whom you aren't close, setting clear boundaries from the start is a good idea. About the emotional rollercoaster: Some women have found it helpful to keep a journal to help them sort things out. Others start a blog. This website has chat rooms as well as the discussion boards. Try different things and see what is helpful for you. Best of luck.",
      "MessageIndex": 2,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727747",
      "Title": "Tiem for Yourself? Selfish? hazydc apple"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Mar 26, 2009 07:54PM anianiau wrote: Dear Doctors--ALL of you, but especially the male gender-- I wish you would be required to strip down and put on skimpy paper garments the next time YOU go for a medical check up. That would mean paper panties (or just one of those little paper drapes) for guys, or a skimpy paper gown with a too-small paper sheet for the ladies...Oh, and the examining room should be set to 10 degrees below normal... I wish you would then have to wait AT LEAST half an hour. And your choice of magazines in the examining room should be limited to half a dozen of whatever 'zines would please you least. When the doctor does finally come in, I wish the doctor would introduce him/herself as \"Dr. Last Name\" but greet YOU by your first name. I wish your doctor would share any news regarding test results while you are still dressed all in paper--though I don't wish any bad test results on you. I just want you to experience what most of us have. Best wishes from just another patient",
      "MessageIndex": 30,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/731141",
      "Title": "Dear doctor, I wish ... mawhinney 2frogs1princess"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Dec 17, 2008 07:49PM anianiau wrote: knitkrazy, I have only worn the 'puffies' that came with my surgical camisoles, and only when I go out. (They are useful in keeping things from touching the surgical area, which hasn't healed yet.) These 'puffies' are much smaller than my real breasts; my bras were a 42DD. Yes, I plan to get prostheses--in the equivalent of a B cup, and light in weight. FYI, here's more info to consider. My husband is a medical physicist. He talked about breast reduction to the radiologists with whom he works and passed along to me the information that a breast reduction can distort the breast sufficiently to make 'callbacks' more likely during future mammograms. That was one more reason that nudged me to go bilateral. My sympathies regarding the students and feeling your appearance may be 'judged' when you are in front of the classroom. My father's squamous cell carcinoma resulted in the loss of his entire nose. I was in college at the time, but I followed his progress through what seemed like an endless series of plastic surgeries as he attempted to have his nose reconstructed. Not only did cancer threaten his life, facial disfigurement made appearing in public very hard for him. Your post made me think of his courage in remaining socially active and continuing to work in a position at a university that put him in daily public contact advising students. When I think of my situation, I realize how lucky I am. With breast cancer, the prosthesis/reconstruction issues can remain private if I choose. Some cancers don't leave us with that option. Good luck to you.",
      "MessageIndex": 96,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Mar 24, 2009 07:23PM anianiau wrote: I wish that your internal medicine group practice would hire REAL nurses--the kind who are registered nurses--or at least one for the office or practice. I am tired of dealing with the M.A. (medical assistant) personnel you do hire. I am very uncomfortable having someone with such limited training interpret my reason for being in your office on that particular day and summarize it for my official medical record. Let me write it myself--it's my medical record, after all. Or let me tell it to you. I am uncomfortable with having that same M.A. do the EKG rhythm strip--especially when she has a hard time determining where to place the leads. Has she never had training on how to deal with a mastectomy patient? I suspect not! It bothers me that she can't seem to understand why I insist on waiting for a minute or two before letting her take my blood pressure--or why I refuse to let her take it on my left arm. I resent having her take my temperature inaccurately, jamming the little tube into my ear canal so that it reads the side, not the eardrum. Maybe your office should stick to oral thermometers! I know how limited your time with me is, so I bring a printout of my current medications so as not to have to waste precious minutes reviewing my meds while you enter changes into my electronic medical record. I arrive on time and bring up the reason I am there right at the beginning of the office visit. So, is it too much to ask for some plan of action on dealing with the problem that has brought me to your office?",
      "MessageIndex": 23,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/731141",
      "Title": "Dear doctor, I wish ... mawhinney 2frogs1princess"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Jan 2, 2009 03:35PM anianiau wrote: vivianu, I probably won't have reconstruction. I refuse to let breasts or the lack thereof define me. Implants don't last forever, and the idea of changing them out every decade or so doesn't appeal. I've had enough friends with implants to realize that a substantial minority develop problems. The same is true for reconstruction, a daunting surgery many hours long that can sacrifice core muscle I may need in the future to stay independent. If the reconstruction was being done to correct a facial deformity, I would probably pursue it. My father had multiple cosmetic surgeries to refashion a nose after he lost his after he was diagnosed with invasive squamous cell carcinoma. The first two failed, and while the pedicle flap (from his forearm) was successful, it required many revisions to make a 'nose' of sorts. In comparison, I consider myself fortunate. I can live a full life, and if I wear even minimal sized prostheses, only the people with whom I choose to share will know I have had a bilateral mastectomy. Ten days ago my surgeon called me and said he wanted the steri-strips gone by the time of my next appointment. Remembering how I used to get gum out of my boys' hair, I used plain oil to remove the steri-strips from my bilateral mastectomy incisions. Any lightweight food oil will degrade  adhesive residue, with a lot less pain than acetone/nail polish remover. (I can't say that I had any pain, though it felt weird.) It took about 45 minutes to remove them, since they were criss-crossed over the incision lines, and I still had (and have) scabs and folds along the incision sites. After I was done, I showered with very mild & unscented soap to remove the oil. Barbe, I thought I was the only one with a newly big belly! It makes for a strange profile. I have been flat-chested, though on occasion I have worn the pos-surgical camisole with puffs. That does draw attention away from the belly, though right now I find it hard to have any pressure in the incision area, in the center of my chest, and under my arms. (The surgeon removed the drains too early, resulting in swelling in those areas.) What has worked best in clothing have been pretty camisoles paired with button front blouses, or around the house a loose cotton knit t-shirt. Good luck with your choice.",
      "MessageIndex": 130,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "anianiau",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75587/profile",
      "Content": "Dec 17, 2008 05:15PM anianiau wrote: I had a bilateral mastectomy Dec. 8. The drains came out yesterday. I'm still pretty lumpy and bruised looking sans clothes, but after getting dressed, I'm getting used to the breastfree look at home. I admit to wearing 'puffies' when I go out, but I'm a newbie at this.  After a lot of agonizing over the big recon decision, I opted not to have reconstruction for at least a year, despite a fair amount of pressure from the surgeons to \"wake up from surgery and still have breasts\". Breasts? Well, no, I don't think so! . Foobs, yes--oh, I love that term! But what really kept me from being persuaded to take immediate action was the realization that I would need to sacrifice good muscle, a point that many women have made in their posts here. I was also horrified at the amount of additional OR time required (2-8+ hrs were the estimates I was given for tissue expanders and flaps, respectively) for recon. The surgeons should be required to tell you about those numbers, but that information that seemed to come out only after I was pushing to get it. Wish I had found this discussion thread before surgery. I'd have been a lot more relaxed going in. But as my husband pointed out, it's much easier on your body not to do it immediately, and there's nothing that says you can't change your mind after you've fully healed. Since many MDs don't seem to point that out, we have to do it for one another, and then support a woman's right to choose.  ",
      "MessageIndex": 91,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    }
  ]
}