{
  "AuthorID": "AniPie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83046/profile",
  "Posts": [
    {
      "AuthorID": "AniPie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83046/profile",
      "Content": "May 24, 2009 12:14PM AniPie wrote: Hi all, With regard to the question about radiation and Tamoxifin at the same time.  I asked my oncologist when to start the Tamoxifin and he said after the radiation is over so that if there are side effects, you can tell what is causing them; the rads or the Tamoxifin.  Just my two cents.",
      "MessageIndex": 16,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/729923",
      "Title": "Clear Margins tiptop AniPie"
    },
    {
      "AuthorID": "AniPie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83046/profile",
      "Content": "Aug 18, 2009 12:35PM AniPie wrote: Hey all, I finished my 16 treatments (no boosters) on July 8.  My only side effect was a burn with peeling.  The burn didn't hurt.  It was a little weird to see my nipple peel.  But the main point is there was no pain, just a little itchiness every so often.  During the treatment my doctor gave me something called Natural Care Gel.  I've never seen it in a store, but it's by C.R. Bard, Inc.  It worked really well.  Once the treatments were done, they gave me Aquaphor.  I started out using this other stuff I heard about on this site, My Girl Radiation, it was horrible.  I had some pain under my breast and it got really raw.  Once I started the Aquaphor, it got better.  So even though the women on this site mean well, what works for one person does not work for all.  If you feel what you are using is causing you pain or discomfort, tell your doctor.",
      "MessageIndex": 4,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/738778",
      "Title": "Radiation #1 of 16 done today. O3132W O3132W"
    }
  ]
}