{
  "AuthorID": "ann101",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127124/profile",
  "Posts": [
    {
      "AuthorID": "ann101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127124/profile",
      "Content": "ann101 wrote: I was diagnosed with LCIS in 2004, an incidental finding from a needle aspiration.-I have yearly mammo and bi-annual sonos-i have had core bipopsies in the past-all have been benign. Because I tested negative for the breast cancer gene, my doctor has suggested the best course of action has been careful monitoring.  Recently,  two suspicious masses were found in my left breast but a core biopsy revealed stromal fibrosis.  My radiologist wanted me to have an MRI to confirm this.  Those findings revealed another mass in my right breast-and based on what they saw on the left side, a second look sono was recommended for the let side and a sono/core biopsy recommended for the right. A different radiologist did this most recent sono & core biopsy on the right (found the mass) but didn't want to do the second look on the left (he felt I should go back to the other radiologist who did the original sono)-but after consulting with my breast doctor, she said she wanted to do a surgical biopsy on the left and possibly the right (depending on the pathology report for that which I should have on Wed) so not to bother with the extra test.  I was frustrated by the refusal of the radiologist to do the second look-as I could no longer afford to go back to the other one due to my new insurance plan which began April 1st.  I explained and still he refused-this was politics, I understand...still, I found this all incredibly frustrating.  Here I am on the table and he could have easily taken a look....ah well...  I will get the biopsy results on Wed.  I have managed living with LCIS really well. I get nervous with each biopsy but I have been fortunate so far....this time I am incredibly afraid....I had the two core biopsies last week on the left-and the additional one on the right; this coming Friday I go for the surgical biopsy on one or both sides.   I came here for some support and honest opinions.  My first question is has anyone here had mulitple diagnosis of stromal firbrosis and than had new mass with a cancerous diagnosis? I've been wondering that if most of my findings have yielded this result, it's likely this is the same (stromal fibrosis)-although this mass is in a different breast?  Second question- is has anyone had a diagnosis of stromal fibrosis, gone for a surgical biopsy, just to be sure and had a different result?  Third-have any of you had LCIS for a long time, been cancer free and then been diagnosed with a malignancy? Lastly, if I am fortunate enough to learn everything is bengin, my new breast doctor wants me to meet with an oncologist to discuss medicinal preventive options. Any opinions, experiences that would be useful in my making a decision as to if I should and what drugs you feel work best in terms of side effects & results. I know these are also questions for my doctor as well but having your feedback seem very relevant to me and would be greatly appreciated.  FYI, I am 58, had my first and only child at forty.  Thank you, Anne101  Dx 4/7/2011, ILC, <1cm, Stage II, 1/2 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/767026",
      "Title": "Diagnosis Question ann101 ann101"
    },
    {
      "AuthorID": "ann101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127124/profile",
      "Content": "Apr 3, 2011 09:07PM ann101 wrote: Thank you so much.  This really helps. I have an appt April 27th will an oncologist. I will let you know the results of my biopsies.  ",
      "MessageIndex": 2,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/767026",
      "Title": "Diagnosis Question ann101 ann101"
    }
  ]
}