{
  "AuthorID": "annapc",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112329/profile",
  "Posts": [{
    "AuthorID": "annapc",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112329/profile",
    "Content": "Feb 9, 2011 10:15AM annapc wrote: This is JUST how I feel!  I am on CMF so no hair loss, and fewer side effects. Am being treated at one of the best cancer centers in the world.  I caught it early, no nodes, tiny tumor, clear scans--so prognosis is good.   But ya know, it still sucks sometimes. It has been relentlessly cold outside, my husband is so busy at work that I am holding up a lot at home (to include playing the wife at his evening events--I hosted a dinner party the day after my second surgery) plus I am working, chemo is making me much more tired than I thought it would...and I have always been boringly healthy, so this whole \"sick\" thing has thrown me for a total loop.  Oh, did I mention our dog dropped dead out of the blue last week? (Of cancer, ironically) Yikes--that is a lot of whining.  But wait, there's more! (you can skip to the next post if you don't want to take advantage of the rest of this fabulous offer)  My husband's job is stressful and he has to travel and be out a lot in the evenings. This makes him a bit oblivious to the fact that I have days where I am fatigued and down. I know he loves me, and is concerned, but he has so much else on his plate besides me that he has to compartmentalize. I tease him that my cancer gets scheduled in occasional one hour increments like his work meetings.  He is a very \"pull up your socks and get on with it\" type so is a bit impatient when people aren't the same. OK.  That is enough whining. It all could be much worse. Well, there is one last thing...between us chickens, I do sometimes want to be pampered a bit more, especially in those days post chemo when I am feeling flat as a pancake. (Someone book a massage for me? Surprise mini-break that I don't have to organize? I'll even settle for a bunch of wilted flowers from the corner deli!)  I am pretty strong and private, so don't want people fussing over me too much--but sometimes I would like the option of saying \"buzz off, I'm fine\" rather than everyone taking my strength at face value!  :-)",
    "MessageIndex": 29,
    "PostDate": "09/02/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763157",
    "Title": "Depression Over Good Prognosis? huntreiter3 Momine"
  }]
}