{
  "AuthorID": "annasc",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210728/profile",
  "Posts": [{
    "AuthorID": "annasc",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210728/profile",
    "Content": "Feb 2, 2015 11:40AM annasc wrote: Hi all, This is my first post to a discussion - it's a little hard to figure out where and when to jump in. This place seems appropriate :) I've withdrawn quite a bit from the world and don't have much of a support network so I thought I'd give this site a try. I'll spit out my basics, because I'm not sure how else to start. I'm now 36 (35 at diagnosis) and a mother of a two-and-a half year old. My son was 18 months and still nursing, and I was at my first pre-natal visit with my second pregnancy when I was quickly sent for breast ultrasounds, biopsies, tests, talks with surgeons... it was a whirlwind. Everyone I saw agreed that I have an aggressive cancer that needs aggressive treatment. Within 2 weeks, I had lost my pregnancy and started chemo - my heart was broken. It still is. My son could no longer breastfeed, which was okay but hard to suddenly cut him off like that. I finished chemo (12 weeks of weekly Taxol with carboplatin every 3rd week, followed by DD AC) in October and had bilateral mastectomies with TE placements on November 26 (yes, the day before Thanksgiving - it had to be rescheduled last minute due to a neutropenic fever - my white count was zero at the originally scheduled time). I'm doing okay. My hair is growing back. I have eyebrows again, eyelashes again. Physical therapy has gone well and I start radiation next week. So, that's my start. I finally feel like I have a moment to breathe and am now trying to process all of this. It's a little overwhelming, but I really am getting through it very well. I feel like the hardest parts (physically, at least) are behind me. I'd love any words of wisdom, and will try to help by sharing my experiences should anyone want to ask :)",
    "MessageIndex": 714,
    "PostDate": "02/02/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
    "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
  }]
}