{
  "AuthorID": "anneshirley…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
  "Posts": [
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Jan 12, 2008 02:42AM anneshirley wrote: I had a similar problem with my breast surgeon (a woman) and very insensitive.  But she had an excellent reputation as a surgeon so I went with her and then changed to another surgeon, whom I like very much, after the surgery.  I'd get the tests, as you can always take them to another facility to have them reread.  And yes, he should have done a biopsy before giving you the news.  My breast surgeon did something similar.  She told me I had an invasive cancer of about 2.5 cm. (first opinion said it was DCIS).  In fact, it was invasive but only 5mm.  But still get the tests done at the original facility, so you don't lose time.  You can change doctors later.  I hope he's wrong, or if correct that it's a very positive diagnosis.  Best of luck!",
      "MessageIndex": 9,
      "PostDate": "12/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/698298",
      "Title": "Not sure where to go now BarbaraS HeatherBLocklear"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Feb 28, 2008 08:32AM - edited Feb 28, 2008 08:55AM by anneshirley Nancy--so sorry about your bad news.  40% is high.  I believe medium starts at 19% and ends somewhere around 25%. Could be 30%, but 40% is high.  The good news is that the rest is very reassuring: Her2 negative, ER highly positive. I know women who have had much higher KI-67 reading and are fine, after many years. You will be too. Here's something from the section on pathology on this site: These two tests (referring to KI-67 and S-phase) of how fast the cancer is growing have limited usefulness when it comes to understanding the nature of the cancer and figuring out the best treatment plan. The tests are good, but they tend to be unreliable, so you can't depend on them too much. There are other ways of figuring out if the tumor is aggressive and fast growing. The tumor grade largely reflects this issue.",
      "MessageIndex": 4,
      "PostDate": "28/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/701248",
      "Title": "Moving to Diagnosed NancyD NancyD"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Feb 26, 2008 05:44PM anneshirley wrote: But even if this turns out to be nothing, you need to have health insurance.  One never knows, even at your young age.  Here is the link to Healthy New York: www.nyhealthinsurer.com/health... ",
      "MessageIndex": 22,
      "PostDate": "26/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/701053",
      "Title": "Very painful lump- scared, no insurance! Diamonds1 msannie57"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Feb 26, 2008 05:47PM - edited Feb 26, 2008 09:20PM by anneshirley You might be suffering from \"costco.\"  This is the short name.  it's inflammation of the cartilage and can cause pain under breast and back.  I have it, and I believe it started when I wore a sports bra too small for me.  It's painful but is relieved somewhat if you take an anti-inflammatory drug.  My doctor told me to take three Ibuprofen, three times a day.  It did kill my stomach, however, but it certanly helped. Good luck, but don't let the insurance go if this clears up.  You really do need it in this country, at least for now. ",
      "MessageIndex": 23,
      "PostDate": "26/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/701053",
      "Title": "Very painful lump- scared, no insurance! Diamonds1 msannie57"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Feb 26, 2008 05:26PM - edited Feb 26, 2008 09:19PM by anneshirley Hi--every state is different and New York is one of the more progressive.  Please call the New York State Insurance Department (used to have an office on William St. in NYC) to ask if pre-existing condition (in New York) would preclude you from coverage.  I thought I read somewhere that New York has a provision that outlawed pre-existing clauses, but I may be wrong. Also, there's a New York State program called Healthy New York which has a relatively inexpensive insurance plan for self employed New Yorkers if income is  below a certain amount.  You really need to see a doctor, but call the Insurance Department to inquire about pre-existing clauses in New York, maybe tomorrow.  I'll also check on internet to see what I can find.  If I have any luck, I'll post again.",
      "MessageIndex": 18,
      "PostDate": "26/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/701053",
      "Title": "Very painful lump- scared, no insurance! Diamonds1 msannie57"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Feb 26, 2008 05:31PM anneshirley wrote: Just found this, after entering \"New York pre-existing conditions health insurance.\" Attorney General Spitzer today announced that two health plans have agreed to re-examine their decisions to deny coverage to thousands of New Yorkers. Under the terms of the settlement, two divisions of Excellus Blue Cross Blue Shield in Central New York and Utica-Watertown, will review 16,621 claims, and Mutual of Omaha will review 156 claims, that were denied since 1997 primarily due to alleged pre-existing medical conditions. \"State and federal law require that a pre-existing condition be covered unless diagnosis or treatment of the condition was actually recommended or received six months prior to enrollment in a plan,\" Spitzer said. \"This agreement will help ensure coverage for pre-existing conditions for those who are entitled to it.\" The plans’ review of their denials is necessary because their contracts and/or denial notices contained incorrect or incomplete pre-existing condition definitions, and omitted or incorrectly stated the members’ right to be credited with covered days under previous health insurance. Spitzer’s Health Care Bureau began an investigation of Excellus and Mutual of Omaha after receiving complaints that the plans wrongly denied coverage due to alleged pre-existing conditions. In one instance, the widow of a Mutual of Omaha member called the Health Care Bureau’s hotline after the plan billed her over $200,000 for medical services provided to her late husband. Her husband had twisted his knee several weeks before he joined Mutual of Omaha. Diagnostic tests conducted after his enrollment, however, revealed that, in addition to the sprain, a malignant tumor in his knee had spread throughout his body. The plan refused to cover her husband’s care, arguing that his cancer existed before his enrollment. A review of the plan’s contract revealed that it had incorrectly defined pre-existing condition as that \"which manifests itself in symptoms which would cause an ordinarily prudent person to seek medical advice, diagnosis, care or treatment.\" After the Attorney General’s office contacted the plan, it reversed its decision and paid for the care. In addition, the Attorney General’s office found that both plans’ member contracts and/or denial notices omitted or failed to accurately state the members’ right to be credited with prior health insurance coverage. Generally, a consumer has \"creditable coverage\" if he or she was previously covered under another health plan and had a break in coverage of 63 consecutive days or less between leaving the prior plan and starting with the current plan. \"This action by Attorney General Spitzer sends a clear message that health care consumers will be afforded the protection guaranteed by federal and state law,\" said Mark Scherzer, Counsel to New Yorkers for Accessible Health Coverage. \"New York’s mandated pre-existing condition definition prevents insurance companies from denying coverage for conditions that consumers did not perhaps even know they had before they got their insurance. That’s only fair.\" Please call New York Insurance Department, as I'm sure it can help with your decision about finding a doctor now. ",
      "MessageIndex": 19,
      "PostDate": "26/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/701053",
      "Title": "Very painful lump- scared, no insurance! Diamonds1 msannie57"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Feb 28, 2008 06:19PM - edited Feb 28, 2008 06:21PM by anneshirley Hi--I think the point of doing a SNB is to avoid doing a full axilla dissection.  If they remove sentinel nodes (1, 2, or 3), and the nodes are clean, they don't have to remove all the nodes.  The more nodes they remove, the greater the chance in time of lymphedemia.  I have read that it's best to have a surgeon who has had lots of practice doing sentinel nodes, and as Iodine says, the first surgeon may not have the experience.  I had to wait nearly a month after my initial diagnosis for surgery.  Supposedly, a month's wait is not crucial but it still would be good to have the surgery sooner.   The waiting is very painful. Triple negative cancers respond well to chemotherapy which is perhaps why the first doctor says she will recommend further treatment after surgery. I was told that the pathologist would look at the sentinel nodes during my surgery; if during surgery they found cancer in the nodes they would proceed to a full node dissection.  In that way it would not be necessary to return for surgery again.  The pathologist does a more thorough review after surgery and occasionally finds evidence of cancer missed during surgery.  In that case your mother might have to go for further surgery.  There may be other reasons why the first doctor is not doing a SNB that we are not aware of, so you should speak to her at length so you understand her thinking.  I'm just  talking from general knowledge; the doctor knows your mother and her pathology. ",
      "MessageIndex": 2,
      "PostDate": "28/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/701203",
      "Title": "Questioning surgeon Carly68 roseg"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Mar 26, 2008 03:14PM - edited Mar 26, 2008 03:14PM by anneshirley Debi--Beesie's suggestion about an MRI is a good one.  I noticed my problem because of a thickening. My PCP couldn't feel it, even after it was diagnosed.  It didn't show up on the mammogram or on the sonogram, but I could point to the spot so had a biopsy, which was positive.  After that, my breast surgeon sent me for a MRI of both breasts and the MRI could see the problem--not apparent in the other tests. Now, this is not to worry you, at all.  With so many people looking at it (and particularly if you're small breasted) it is probably nothing.  But rather than live in fear that something is happening, an MRI would finally give you some peace of mind--hugely important. ",
      "MessageIndex": 4,
      "PostDate": "26/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/702888",
      "Title": "Need Input dlhs dlhs"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Feb 21, 2008 11:21PM anneshirley wrote: I had a SNB when I had my lumpectomy.  Two of my nodes were swollen but no cancer was found in either.  It had a name but I can't remember at the moment, but definitely benign.",
      "MessageIndex": 8,
      "PostDate": "21/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/700698",
      "Title": "lymph node pamaly anneshirley"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Aug 2, 2008 01:22PM anneshirley wrote: Hi--I recently had an excision for a lesion on my radiated breast, with stitches.  It did get red around the outside, but not until a few days after the surgery.  It looked raw and, as I remember, worse than my lumpectomy incision.  I had the stitches removed Monday, eleven days after, and the doctor who removed the stitches said it looks fine. Right now it's still red and scaly around the outside and white within, and hard and lumpy underneath the skin, but not I think infected. But unless a professional looks at it, there's no way you can know for sure, so I would  insist on seeing your doctor if you're worried.   My doctor looked at the tissue after the excision and said it looked normal (and it was).  They can usually tell. So please don't worry. Oh, and my breast did hurt but it was more soreness than pain with occasional shooting pains.",
      "MessageIndex": 4,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718939",
      "Title": "Red circle around surgical biopsy site Mimi1261 leaf"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Mar 4, 2008 11:11AM anneshirley wrote: Goldie, Please don't panic about your node.  Nodes do swell after biopsy.  I had three nodes removed, all were clean, and two were quite enlarged. When I asked why, I was told it was the biopsy, which in my case was a fine needle.  It sounds like Stage 1 if that lymph node is just swollen from the trauma of the biopsy. And Rebecca is absolutely right:  even if it's in the node, it's not the end of anything. I can't even begin to remember all the women I've known personally or read about on BC sites who have had many positive nodes and are alive and well many years later.  Your doctor is also right about removing your healthy breast not reducing the chances of recurrence by very much.  For some reason, I never worry about the other breast, probably because it never had dense tissue.  But that's your decision to make.  It's very difficult not to panic and I wasn't very successful at it, but I'm so sure you'll do fine.  ",
      "MessageIndex": 3,
      "PostDate": "04/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/701522",
      "Title": "I'm startng to feel so hopeless! Please help me out! Goldie dhettish"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Jan 22, 2008 12:34PM anneshirley wrote: Hi Cheri, I've been worried about pain around my breast (I have had BC so thought it was mets) and my oncologist suggested it might be costocrondritis, which is inflammation near the sternum.  He told me to take NASAIDS (Ibuproven or naproxen) which helped so I'm pretty sure he was right.  It could be something similar.  Did you try taking an anti-inflammatory?  If it helps it could be \"costo.\"  If it continues, however, I would keep checking it out until I identify the cause.   ",
      "MessageIndex": 17,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/698142",
      "Title": "very very scared! purplequeen purplequeen"
    },
    {
      "AuthorID": "anneshirley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "anneshirley wrote: I received a private message from member Babydoll32732, asking for help.  Since I've never had a guided core biopsy, I couldn't help her and suggested she post her question publicly.  I got a response that she didn't know how but when I tried to send her a private message to explain how, I received a message that she wasn't receiving private messages.  If anyone else can help her, here is what she wrote to me in her private message.  Thanks.  i had a mammo jan 18, 2008--had to have compression pics done --then returned to have an U/S done--now on both breasts i have category 4 suspicious abnormality--or masses as it states on the report--i am having an U/S guided core biopsy done on both breasts---can you give me what to expect, will i be sedated or put to sleep--does this mean after this there will be surgery and does thsi signify something bad--i come from a cancer free family--mother and 2 sisters--i hope you can answer right away--i have no one with experience to turn to Anneshirley Picture of Mary & Sophie, my nieces Dx 6/10/2006, IDC, <1cm, Stage IA, Grade 2, 0/3 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/700769",
      "Title": "Member Babydoll32732 needs help! anneshirley OneBadBoob"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Aug 5, 2008 03:08PM anneshirley wrote: My pathology report indicated that I had two swollen lymph nodes and when I asked why I was told that the fine needle biopsy I had two weeks earlier was the probable cause.  This was from both the pathologist and surgical nurse, so I would say probably.",
      "MessageIndex": 1,
      "PostDate": "05/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/719105",
      "Title": "Can a Core biopsy cause lymph node to swell cjh therese48"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Jan 22, 2008 03:38AM anneshirley wrote: It's now 14 months since I finished chemo (five months after herceptin).  My hair is starting to lose some of the curl, around the sides mainly.  It grows much more slowly than before.  I was always complaining in the past about how quickly my hair and nails grew--no more, but that may be herceptin.  However, I colored my hair as soon as I had enough (about 1-1/2 inch) and had no problems and was really glad I did.  Made me feel better.  I'm not sure why we're not supposed to color but if it makes you feel good, I say do it!",
      "MessageIndex": 11,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/698807",
      "Title": "does everyone get curly hair after chemo? cc01 lago"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Jan 20, 2008 10:59PM anneshirley wrote: I had a lumpectomy and I'm very happy that I did, of my right breast.  My surgeon achieved very large clean margins (greater than 2cm), so my right breast is a bit smaller than my left but it looks fine, even with blue dye from SNB still apparent some 18 months later.  I was an outpatient and was at home about two hours after surgery and never once needed anything for pain or discomfort.  Radiation was not easy.  I did burn and also had a very ugly rash.  But within three weeks of finishing radiation (with the help of Silversulvadene), my breast looked fine and felt fine, and still does.  I live but a ten minute walk from radiology center, so that made it easy on me, and this is certainly not true for you. It's a year now since I finished radiation and I've had no problems whatsoever. Lumpectomy was my choice, not my doctor's, and you must do what works best for you and what gives you the greatest peace of mind.  Good luck in whatever you decide. ",
      "MessageIndex": 19,
      "PostDate": "20/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698898",
      "Title": "Feeling pressured to have lumpectomy instead of mastectomy otter irishdreama"
    },
    {
      "AuthorID": "anneshirley…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61586/profile",
      "Content": "Feb 28, 2008 10:01AM anneshirley wrote: Sueps--please believe what everyone above me has said.  You are not doomed.  So much has happened in just the last few years.  Women who are HER2 positive (formerly a bad diagnosis) now have herceptin.  Women who are triple negative now have a much wider range of chemos to which they respond quite well.  Women who are hermone positive have even a wider range of options.  Whatever your pathology is, there's a treatment to insure that you'll have a long life with your sons.  I can't say don't worry about every freckle, because I do myself these days. Unfortunately, it's part of the whole cancer thing.  But bones creak all the time, even in someone as young as you.  You should always check out any new pains and aches but most of the time they turn out to be the same aches and pains that you had before cancer.  I'm glad you're getting scans soon.  It always helps to be doing something rather than just worrying.   ",
      "MessageIndex": 4533,
      "PostDate": "28/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    }
  ]
}