{
  "AuthorID": "Annegyg",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167955/profile",
  "Posts": [
    {
      "AuthorID": "Annegyg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167955/profile",
      "Content": "Jan 18, 2013 02:04PM - edited Jan 18, 2013 02:06PM by Annegyg In regards to above post \"Brandall\" I think our fathers may be related! It is amazing what our family members come up with, you do realize each of us has our own journey, there is no expiration date...we just keep fighting and pushing on ....fathers, yikes!",
      "MessageIndex": 556,
      "PostDate": "18/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Annegyg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167955/profile",
      "Content": "Jan 18, 2013 02:00PM Annegyg wrote: Limping into a local department store, (mets in my back and hip FYI... ) choose to use handicapped auto \"door open button\"... a \"sensitive, caring\" man shouts with a booming voice \" you are so lazy!\" Ahhhhhhh, really? Family member states \" I just saw some photos of you, cancer looks good on you \" (how about YOU \"try it on\" ) Friend who has not seen me for six months, first words \"oh don't worry you will gain all that weight back, it's just the medicine\" Physical therapist, first day...new patient...I limp in with my cane and now 5 month post chemo hair( gray, curly, short...you all can relate to this). I introduce myself to my new therapist and she sighs with relief, \" oh I am so glad it's \"you\" all I could see was your gray hair and cane when you entered, I thought, oh know another old lady\" ( I assume my 44 year old face pleased her lol) stupid people....",
      "MessageIndex": 555,
      "PostDate": "18/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    }
  ]
}