{
  "AuthorID": "annetteCHI",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88239/profile",
  "Posts": [
    {
      "AuthorID": "annetteCHI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88239/profile",
      "Content": "Oct 26, 2009 01:43PM annetteCHI wrote: considering that I was told to expect fatigue sometime in my third week, I was confused when it hit hard on my third DAY! it went on to get a bit worse, but seemed to level off in my second week. I finished last week and have been feeling the same amount of fatigue. I believe that it is different for all of us. I did not have chemo, but have so far met three women for whom their se's from rads were definitely worse than their se's from chemo. hang in there and allow yourself to rest.",
      "MessageIndex": 1,
      "PostDate": "26/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/742756",
      "Title": "Anyone have more trouble with radiation then chemo? blondie45 jancie"
    },
    {
      "AuthorID": "annetteCHI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88239/profile",
      "Content": "Mar 26, 2010 02:27AM annetteCHI wrote: I also had no ROM issues after surgery (July 09), but as of January I began to experience pain and ROM issues. my rad onc diagnosed it as inflammation of the muscles due to rads. said it can begin 3-6 mos post-treatment. also mentioned that there is nothing to cure it, just time. I do see a medically certified massage therapist once a week, to work on the scar tissue and also to free those bunched-up, inflamed muscles as much as possible. my massage therapist is also working on getting my lymph working better...although I had no nodes removed, the radiation alone can damage the lymph system on the radiated side. hoping you can find relief ~ Annette",
      "MessageIndex": 3,
      "PostDate": "26/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/749797",
      "Title": "range of motion in arm joycey57 painterly"
    },
    {
      "AuthorID": "annetteCHI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88239/profile",
      "Content": "Oct 9, 2009 05:06PM annetteCHI wrote: I'm only on day 10 of rads, but so far I get much relief from RadiaPlex Gel, given to me by my rad onc. applied up to 3xs/day it really helps with the pain, itch and heat. (no idea how good it will work after more days of rads...haven't seen it mentioned here before.)",
      "MessageIndex": 1,
      "PostDate": "09/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/741770",
      "Title": "Best creams for radiation linn56 Rose_wood"
    },
    {
      "AuthorID": "annetteCHI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88239/profile",
      "Content": "May 31, 2010 03:48PM annetteCHI wrote: I had the same side effect - also showed up about 4 months post-radiation. in the end my rad onc diagnosed me with radiation-pneumonitis and pleurisy. she put me on a high dose of steroids for two weeks and the pleurisy cleared up. but I am left with the pneumonitis, which can take months to heal. every time I sneeze I scream, it hurts so much.",
      "MessageIndex": 1,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/750805",
      "Title": "Lung Pain foxyroxy2983 3monstmama"
    }
  ]
}