{
  "AuthorID": "AnneN",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
  "Posts": [
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Dec 18, 2010 08:58AM AnneN wrote: Congrats, Frapp! That's wonderful news!",
      "MessageIndex": 16,
      "PostDate": "18/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762168",
      "Title": "Shout out!! Frapp renee2010"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Dec 20, 2010 04:37PM AnneN wrote: Woo-hoo!! What a fabulous drop and a great Christmas present!",
      "MessageIndex": 7,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762305",
      "Title": "Tumor Markers Down!!!!!!!!!!!!!!!!! mommyx3 EmilyInOntario"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jan 8, 2011 08:53AM AnneN wrote: Thanks for keeping us posted. Best of luck!",
      "MessageIndex": 18,
      "PostDate": "08/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763033",
      "Title": "Meeting with the onc today leprechaun claygirl"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 24, 2009 09:55PM AnneN wrote: Lisa, my heart goes out to you and your mom. My mother also had a stroke about ten years ago that resulted initially in paralysis on her right side. Immediately after the stroke she could not even feed herself. After many months of rehab her only remaining impairments were that she walked with a cane, and her formerly perfect Palmer-method handwriting was ever so slightly shaky. She credited her recovery to the many prayers said on her behalf, but I think her own determination had something to do with it, too. It sounds like your mom is equally determined. So there is hope. There are things she can do to support her immune system to help fight the cancer until she is strong enough to resume treatment. My primary care doctor told me the day I was diagnosed about a very helpful book by a physician who is a cancer survivor himself. It's by David Servan-Schreiber, and the title is Anticancer: A New Way of Life. Servan-Schrieber combed the medical literature looking for things that would help his body fight the cancer and prevent any more recurrences, and then he compiled what he found into this book. He has very detailed recommendations about foods to eat more of and foods to avoid, and nutritional supplements to take. It's not a substitute for conventional treatment, but it helps make conventional treatment more effective. One nutritional supplement he does not mention - probably because he sticks to things that have been proven in clinical studies - is a nutritional supplement called Coenzyme Q10 that has shown promising results in a handful of breast cancer studies in Europe. You might want to check that out as well. Bless you for your devoted advocacy and support for your mom, and bless your husband for supporting you and bringing your daughter to visit her grandma - I bet your mom loves seeing her. I know it will be a long haul, but I hope you get good news in the end. (((Hugs.))) Anne ",
      "MessageIndex": 2,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737938",
      "Title": "New here & needing support JustaBlondy donnabee"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Mar 9, 2010 09:34PM AnneN wrote: Rita Arditti, human rights activist, lived with stage IV breast cancer for over 30 years before her death on December 25, 2009.  There is a video of her speaking to other stage IV sisters at a conference on the Metastatic Breast Cancer Network site: www.mbcnetwork.org/video/RitaA... ",
      "MessageIndex": 2,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749541",
      "Title": "Inspiring Stories of Hope! momto2angels DianaT"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 15, 2009 06:19PM AnneN wrote: Laura, thanks so much for posting - that's really encouraging. Did your doctors have any suggestions about what else might have caused the nodules & caused them to disappear? ",
      "MessageIndex": 7,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 25, 2009 10:01PM AnneN wrote: Thanks, Carcharm. I appreciate the information even though it does strengthen the case that my nodules are probably mets. I haven't had any chemo or radiation yet. No serious respiratory infections since a battle with sinusitis about six years ago, and I haven't even had any garden-variety colds since my diagnosis. And there is one nodule that's been described on my report as spiculated. Becky, thanks for the details on the meds you had to pause for the surgery. I am thinking I might step up the doses of my immune-supporting nutritional supplements when I have to go off meds - I'm taking coenzyme Q10, omega-3 oil capsules, and calcium as supplements. I might just add an extra capsule a day of each. What do you think of that approach? If it turns out that is not a good idea, then I guess I will have to kick the dietary approach up a notch and have broccoli, berries, and green tea at every meal! ",
      "MessageIndex": 29,
      "PostDate": "25/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 16, 2009 10:30AM AnneN wrote: Thanks, Fitztwins and Laura and RobinWendy! It's good to know that there are other things that could cause them and that even if they are cancerous, those of you who have them are able to live with them for years. That's helpful to know for when I have my first conversation with the surgeon this afternoon. I'll post again tonight after I learn what he says. Thanks so much, Anne",
      "MessageIndex": 12,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 24, 2009 09:19PM AnneN wrote: Bump for YamaMama.",
      "MessageIndex": 26,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 29, 2009 07:24PM AnneN wrote: Laura, thanks for checking in. I've had a busier week than I expected and I still haven't called MD Anderson yet. Hope to do that tomorrow. You're right about the beets & brussels sprouts - those are both cancer growth inhibitors, says David Servan-Schrieber. (Anticancer: A New Way of Life, Anticancer Action section, page 11.) He charts veggies in order of how much they inhibit cancer growth - they go like this: Garlic, leeks, scallions, brussels sprouts, cauliflower, cabbage, kale, broccoli, radishes, savoy cabbage, onion, turnips, green beans, red cabbage, asparagus, fiddlehead fern, spinach, beets, potatoes, jalapeno peppers, red chicory, cucumbers, orange peppers, celery, squash, and Boston lettuce. (Those last three, the effect was pretty small.) Thanks for checking in - I apparently am procrastinating and need the nudge! ",
      "MessageIndex": 32,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 20, 2009 07:02PM AnneN wrote: Yes, Laura, Dr. Seema Khan at Northwestern in Illinois. She has published several papers on the question of whether surgery helps Stage IV patients, including an article advocating that clinical trials be done to investigate the question. I called her office to ask if clinical trials were being done yet, and her staff checked with her and got back to me and said no, not yet, and we don't have a timeframe for when there might be. I haven't talked with Dr. Khan personally, just her staff. So I am thinking now I might just ask my doctor to refer me to MD Anderson for a second opinion. I am not ready to throw in the towel on the idea. The research seems most clear that surgery helps if there's only one met, or only bone mets. There's no clear benefit if mets are extensive or visceral. But mine are in between those cases: four small bone mets, plus several tiny lung spots too small to tell if they're mets. So I feel I need more evaluation.  I am bummed that there seem to be no clinical trials yet. It would have been so nice to have been assigned to one arm or another and let that make the decision for me! Thank you for checking back with me! ",
      "MessageIndex": 18,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "AnneN wrote: Hi, sisters. I was stage IV at initial diagnosis. A PET/CT at that time, three months ago, showed 4 small bone mets and about a dozen tiny nodules in my lungs that were \"suspicious for cancer\" but too small for the PET technique's resolution, so there was no way to tell if the lung nodules were mets. Today I got the results of a CT scan I had yesterday. Several of those small lung nodules have disappeared, and the ones that remain are smaller. Lab report cites as an example one that has gone from 8mm to 6mm. Others are apparently smaller than that. Onc says that this response suggests they probably are/were cancer. While it's good news that they're shrinking/disappearing, it's bad news that I would have metastases in lungs and not just bones. Onc was leaning toward recommending that I have surgery to remove the primary tumor, but with this news now she's not so sure, with lung mets having a worse prognosis than just bone mets alone. My first appointment with the surgeon is tomorrow; onc says to go ahead and keep the appointment and see what the surgeon thinks. I have been doing a lot of things to try to support my immune system - exercise, better diet, nutritional supplements. Besides my cancer therapy response, I have also noticed that I have not had any colds, flu, or anything since my treatment began. Does anyone know of anything else those small lung nodules might be besides cancer? Something that my immune system might shrink in three months? Also, has anybody had lung mets and had their primary tumor removed anyway? The big decision I am facing is whether to do the mastectomy, or whether to just continue on with the hormonal therapy that is shrinking my cancer, but not remove the primary tumor. I am inclined to get it out of there if it at all makes sense to do so. I have three young kids (12, 8, 5) and I need to live a long time for them. This is so baffling because I have no symptoms - I do not feel sick. So we're just trying to maximize my survival; there aren't any symptoms to manage. Any advice you sisters can give me from the benefit of your experience would be much appreciated. Thanks so much for all you share.  Faslodex/Zometa/complementary supplements. Mastectomy with immediate DIEP at NOLA on 12/15/10. Dx 3/20/2009, IDC, 6cm+, Stage IV, Grade 2, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 30, 2009 08:20AM AnneN wrote: Okay, so I finally called MD Anderson. And I am SO excited, because the doc they gave me an appointment with is Dr. Stacy Moulder, and if you google her name with the keywords \"breast cancer,\" you find all sorts of research she's done on treating women with metastatic breast cancer. They would have given me an appointment in the middle of August or early September, but my calendar's packed then, so they gave me an appointment on September 11. Entirely my fault that it's not sooner. I am fired up! ",
      "MessageIndex": 33,
      "PostDate": "30/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 15, 2009 05:51PM AnneN wrote: Thanks so much, Ann and Becky and Joan and DJ. Becky, I will PM you with my e-mail address. DJ, my onc thinks the lung nodules are too small to biopsy. They were too small for the PET resolution. too. At this point I'm not concerned about treating them, because they're not causing any symptoms. We're just wondering how the likelihood that they're cancer affects whether it's worth it to do the mastectomy.  Thanks much, all. ",
      "MessageIndex": 5,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 16, 2009 07:00AM AnneN wrote: Bump",
      "MessageIndex": 8,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 16, 2009 04:07PM AnneN wrote: Hey, Laura, now I too have one of those \"on the fence\" decisions to make. Saw the local surgeon this afternoon. He basically agreed with everything my medical oncologist had already said. He thinks the small lung mets are probably cancer; he agrees that they're too small to biopsy; he thinks the lump I had in 2006 was probably cancer all along and not the \"benign cyst\" they concluded at the time (and didn't biopsy). So his conclusion is that surgery won't extend my survival, because I've had the cancer a long time, it's had plenty of time to get out into the rest of my body, it's in my bones and lungs, and he expects I probably have micrometastases elsewhere that are just too small to find. He said \"But there have been times when I've been wrong,\" though, and it's my decision. Even if I do decide on surgery, he confirmed what I had surmised from the Internet, that nobody at this cancer center does DIEPs. He would do immediate reconstruction with implants, but I don't want implants. My onc said yesterday she'd give me a referral if I wanted one. From what I've read on the Internet, the folks who are leading the charge at studying long-term survival in Stage IV patients are the docs at MD Anderson in Texas. So I guess I'll be on the phone to MD Anderson tomorrow morning. I'd be more convinced that surgery wouldn't help me if I heard it from the people who believe it does help in some Stage IV cases. I haven't heard anything yet that convinces me I'm not among the group who could benefit. So my plan at this point is to get a second opinion about whether there's any benefit to surgery at all, and then to explore going to NOLA for immediate reconstruction with a DIEP if it seems there is a chance I'd benefit.  At least there's no hurry - my hormone therapy is still working beautifully; everything is still shrinking. So I have time to do my homework. Thanks, everybody, for your support and info. ",
      "MessageIndex": 13,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 23, 2009 10:13PM AnneN wrote: Thanks so much, everybody, for sharing your experiences. LuAnn, thanks for raising the good point about having to go off the Tamoxifen - I will have to ask my docs about that - the thought of that makes me nervous, but I have heard that before, something to do with clotting or something. Elaine, my sentiment exactly - I keep wondering \"why is this my job?\" But at least the docs are clear that it is my decision and they won't stand in the way of whatever I decide to do. Linda, I'm so glad your lung nodules were not mets, and I hope your next scan shows they haven't changed.  Wow, Darlene. That was grim but helpful - I appreciate your being so frank. That made something my surgeon said make so much more sense. He said he wouldn't recommend surgery with the goal of extending survival, but he would do it for managing symptoms in the breast. My unspoken reaction was \"but that has nothing to do with me - I have no symptoms and my tumor is getting smaller every day.\" I wasn't even thinking of the eventual day when the cancer will progress and what whatever is left of the tumor will do then. Thanks for making me go there. It makes sense that I should deal with it early while I am strong and healthy. Mammalamma, thank you for that sweet story. Your note reminded me of my 5-year-old the other night. She is trying to get her head around this whole \"death\" idea. She knows that both her grandfathers died before she was born, but she doesn't really have any direct experience with the idea. So she asked me if our family knows anyone who has died after she was born. I thought hard for a moment and then told her the only person I could think of was her grandma's friend Frances who lived across the hall from her and who died last winter. Do you remember Frances? I asked my daughter. She pretended to remember and nodded, clearly wanting to hear what came next. So then I told her that Frances had been a very nice lady who had been a teacher when she was young, and after she died a lot of people who had been her students came to her funeral and talked about what a good teacher she had been. That seemed to satisfy my little one and she stuck her thumb in her mouth and curled up in my lap and went to sleep. I guess we all want as much information as we can get! Thanks so much, everybody, for sharing yours. I am going to call MD Anderson tomorrow and see if I can get evaluated there. Anybody got an answer for Princess' question? Anne ",
      "MessageIndex": 25,
      "PostDate": "23/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "AnneN wrote: Hi, sisters. I was stage IV at initial diagnosis. A PET/CT at that time, three months ago, showed 4 small bone mets and about a dozen tiny nodules in my lungs that were \"suspicious for cancer\" but too small for the PET technique's resolution, so there was no way to tell if the lung nodules were mets. Today I got the results of a CT scan I had yesterday. Several of those small lung nodules have disappeared, and the ones that remain are smaller. Lab report cites as an example one that has gone from 8mm to 6mm. Others are apparently smaller than that. Onc says that this response suggests they probably are/were cancer. While it's good news that they're shrinking/disappearing, it's bad news that I would have metastases in lungs and not just bones. Onc was leaning toward recommending that I have surgery to remove the primary tumor, but with this news now she's not so sure, with lung mets having a worse prognosis than just bone mets alone. My first appointment with the surgeon is tomorrow; onc says to go ahead and keep the appointment and see what the surgeon thinks. I have been doing a lot of things to try to support my immune system - exercise, better diet, nutritional supplements. Besides my cancer therapy response, I have also noticed that I have not had any colds, flu, or anything since my treatment began. Does anyone know of anything else those small lung nodules might be besides cancer? Something that my immune system might shrink in three months? Also, has anybody had lung mets and had their primary tumor removed anyway? The big decision I am facing is whether to do the mastectomy, or whether to just continue on with the hormonal therapy that is shrinking my cancer, but not remove the primary tumor. I am inclined to get it out of there if it at all makes sense to do so. I have three young kids (12, 8, 5) and I need to live a long time for them. This is so baffling because I have no symptoms - I do not feel sick. So we're just trying to maximize my survival; there aren't any symptoms to manage. Any advice you sisters can give me from the benefit of your experience would be much appreciated. Thanks so much for all you share.  Faslodex/Zometa/complementary supplements. Mastectomy with immediate DIEP at NOLA on 12/15/10. Dx 3/20/2009, IDC, 6cm+, Stage IV, Grade 2, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 17, 2009 10:42AM AnneN wrote: Thanks, Laura and Crissy. My lab reports say my largest lung nodule started out at 8mm and has shrunk to 6mm. I've never had pneumonia, and I haven't had a bad cough since I had sinusitis six years ago. It's puzzling to have these nodules and not have ANY symptoms. I e-mailed a doc at MD Anderson who recommended a doc at Northwestern who's published several articles about whether surgery improves survival for stage IV patients. I'm currently playing telephone/e-mail tag with both institutions and will probably go to one or the other for evaluation. Thanks again for your thoughts and support! ",
      "MessageIndex": 16,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 1, 2009 12:20AM AnneN wrote: Hi, Jill. My oncologist is pursuing the strategy your Doctor 1 is recommending, and it's working well for me - but one reason she chose this strategy is that my pathology reports showed my tumor is greater than 90% estrogen positive, so in my case hormone therapy is the most effective strategy. It really matters a lot whether your particular cancer is estrogen positive, HER2 positive, etc. and how strongly. At least one of your doctors should be considering this. If they're not, I'd recommend going to one of the major cancer centers (one that's NCI accredited) and finding out what they recommend. I see you're in Wisconsin - any chance you can make a road trip over to the Mayo Clinic in Rochester, MN and get evaluated there? I had an evaluation there and they agreed with my oncologist that I'm likely to get more benefit from hormone therapy than from chemo. This really gives me additional peace of mind that we are doing the right thing. Good luck to you! ",
      "MessageIndex": 1,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736769",
      "Title": "Newly Diagnosed - Looking for Input on Treatment Jill45 rdrake0"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 1, 2009 12:33AM AnneN wrote: By the way, with my hormone therapy, the only side effects I've had are one week of cancer \"flare\" near the start, which meant the bone mets in my spine gave me backaches for a week, and the usual hot flashes that go with menopause. And that's it. No hair loss, and no nausea. So I have been able to complement my therapy with a better diet and more exercise, because I've been feeling well. I think that's an additional reason I'm getting good results. I am very grateful that so far I have been able to forego chemo. When I asked my oncologist, \"So when do we do chemo?\" she replied, \"If this continues to work, maybe never.\" Never sounds good to me! ",
      "MessageIndex": 2,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736769",
      "Title": "Newly Diagnosed - Looking for Input on Treatment Jill45 rdrake0"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Aug 14, 2009 06:36PM AnneN wrote: What did your doctor do to \"check out\" those nodules? If they've never been biopsied, push your doctor to order a biopsy. I found a lump in 2006, had a mammogram and ultrasound, and was told it was a \"benign cyst,\" so I quit worrying about it. Unfortunately, I was so unconcerned about it that I let 2 1/2 years go by before I got another mammogram, and by then my cancer had metastasized to my bones. My oncologist thinks it was cancer all along. She told me that any time the mammogram technician can feel the lump, they should biopsy it, even if the imaging suggests it's benign. \"Sometimes the imaging is wrong,\" she said. If you want a biopsy for a palpable lump and your doctor is dismissing your concerns, it's time to see a different doctor. You are young and so the odds are very good it's nothing. But if it's something, you need to find it early. The young women who do get breast cancer tend to get more aggressive, fast-growing cancers than older women do. Catch it early and your odds of a cure are still overwhelmingly good - but you need to catch it! Trust your intuition, tell them about your family history, and get pushy if you need to. You have our permission! Good luck and I hope it's benign! Anne ",
      "MessageIndex": 2,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/738957",
      "Title": "hi, can someone help? paumi Lina1"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Mar 11, 2010 11:23PM AnneN wrote: I hate that so much money is involved in the cancer treatment industry that I cynically doubt that if a cure is found it will ever make it to market. I don't doubt that science could eventually cure me. I do doubt that our economic system will ever let me have that cure. What a lousy reason for my kids to lose their mom.",
      "MessageIndex": 20,
      "PostDate": "11/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749625",
      "Title": "I hate that... BeckyOD Diana63"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "AnneN wrote: Thank you, Shepgirl, who started the thread called \"How Many Stage 4 Girls are getting SS disability..\" and thank you to everyone who contributed to it! Without you sisters, I would never have known that Stage IV BC is a listed condition so that you don't have to prove you're unable to work. Because of you, I just got my first SS check last week. It is replacing all of the income that I lost when I had to cut my hours at work down to 10 hours per week. So I don't have to go asking my husband for money any more, which I really hated and was really adding to my stress. (He wasn't all that happy about it, either. ;-)      And today I just completed my application for my kids' dependents' benefits. We'll be able to put them in their college fund, so if I'm no longer alive to contribute to their support by the time they head off to college, at least they will have this. Social Security is such a wonderful program - it's not just a retirement program - it helps so many families of people with disabilities or who are survivors of people who died while they still had minor children. I am so grateful to you sisters for cluing me in! You have really made my life a lot easier. Thank you so much!  Faslodex/Zometa/complementary supplements. Mastectomy with immediate DIEP at NOLA on 12/15/10. Dx 3/20/2009, IDC, 6cm+, Stage IV, Grade 2, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743023",
      "Title": "THANK YOU, sisters, for telling me about SS Disability! AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Mar 10, 2010 09:59PM AnneN wrote: Elizabeth, you star! Not only do you sail through getting your brain zapped, you come home and immediately update us, commit a great pun, and then go around posting helpful things to other people's threads. No wonder we all love you. I am glad the zapping went well so far and I'm wishing you an SE-free rest of the week. Anne ",
      "MessageIndex": 470,
      "PostDate": "10/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Mar 12, 2010 11:42AM AnneN wrote: For heaven's sake, Elizabeth, seven hours of driving each way - and from the way you talk about it, it's clear you've made this trip several times before - doesn't he owe you a plane ticket by now? You do the effort, he bears the expense - seems fair to me! Hit him up now while he's worried about ya. Set a new precedent. Change the game. As they say in politics, \"Never waste a good crisis.\"  Tee-hee. Anne ",
      "MessageIndex": 519,
      "PostDate": "12/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Oct 30, 2009 08:46AM AnneN wrote: Bump ('cause I'm really grateful and I want more sisters to know).",
      "MessageIndex": 1,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743023",
      "Title": "THANK YOU, sisters, for telling me about SS Disability! AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Oct 30, 2009 12:50PM AnneN wrote: Oh, Fitztwins, I didn't know. My condolences to Shepgirl's family and friends here.",
      "MessageIndex": 4,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743023",
      "Title": "THANK YOU, sisters, for telling me about SS Disability! AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Mar 13, 2010 03:49PM AnneN wrote: I'll join Robin and cave.  I'm glad it's a trip you enjoy, and you deserve what makes you happy. :-) I hope he spoils you rotten!",
      "MessageIndex": 545,
      "PostDate": "13/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Feb 12, 2010 03:56PM AnneN wrote: Aw, h*ll, Elizabeth. What lousy news. Take a break, then go kick some cancer butt. Hugs, Anne ",
      "MessageIndex": 16,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jun 13, 2009 11:31PM AnneN wrote: RobynK, Thanks so much for starting this thread - because I DO feel, not guilt, exactly, something more like embarrassment, that I have it so easy. Like Bygracealone, I have a highly estrogen positive cancer and so I still have all my hair. I already had metastases at initial diagnosis and so I haven't had any surgery yet except my biopsy. I only have four bone mets and only the two in my spine ever hurt, and those not often, and when they do plain old Tylenol takes care of it. No fractures yet - it was a routine mammogram that caught my cancer; I did not even know I was ill. Walking into the infusion bays to get my Zometa and Zoladex every month, I feel conspicuous, like I'm too healthy-looking to belong there. My friends keep offering their sympathy and support and asking what they can do to help - but I don't feel sick! Even the anxiety hasn't been bad because the hormone therapy has been working and the tumor's been shrinking. And whenever I post here in the Stage IV board I feel like I'm posting in the wrong place. Is there a place for people who are newly Stage IV but so far pretty much symptom-free? I am learning so much from all of you and I hate to cause you any distress. You are all angels and I thank you for sharing so much from your experiences. ",
      "MessageIndex": 26,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734458",
      "Title": "Do you ever feel guilty?? RobynK konakat"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jun 24, 2009 08:57PM AnneN wrote: Diva, My heart goes out to you - if it is any consolation, what your Doc 2 is recommending is a lot like what the docs at the Mayo Clinic told me when I was evaluated there. Like your doc, they recommended doing chemo before surgery to reduce the tumor size, kill any cancer cells that might have spread - and allow the doc to see how well the chemo is working by observing how much the tumor shrinks. There are different kinds of chemo, so if one kind doesn't work, there are others they can try. But I couldn't be treated at Mayo because it was out of my insurance network. So then I got referred to another very good oncologist at the University of Minnesota, and she ordered a PET/CT test which showed I wasn't Stage III, I was actually Stage IV - because I had 4 small bone metastases. Bad news with a silver lining. It was too late for chemo to beat my cancer before it spread, because it already had. My tumor is strongly ER positive, so in my case, hormone therapy is now the best strategy. So that's what we are doing, instead of chemo. If you don't have metastases, your prognosis is better than mine - you caught it before it spread. I remember how awful it was when the news seemed to be worse with every visit. But lately the news has been better with every visit. My hormone therapy is shrinking my tumor, and next month my oncologist is going to check to make sure my metastases are under control. If they are, I'll get referred to a surgeon, and we'll get this thing out of there. Your Doc 2 sounds like he's on the right track. The more info he has, the better job he can do of finding the right treatments to beat the thing so it doesn't spread and doesn't come back. There are things you can do, too. There's a book by a doctor who himself is a cancer survivor that talks about changes in diet and exercise you can do that will make your treatment more effective. It's called Anticancer: A New Way of Life, and the author is David Servan-Schreiber. Our local public library has it - maybe yours does, too. This book says a half-hour walk each day has been shown to extend survival in breast cancer patients, so I have been doing that. I've also cut out most of my junk food, as the book recommends. With the better diet and the exercise, so far I've lost 10 pounds, which is a nice benefit. I feel stronger and feel like I'm doing something to help my treatment work. You've come to the right place. There are a lot of sisters here who will share what they've learned and offer you support. I'm glad you're here. Good luck to you. ",
      "MessageIndex": 7,
      "PostDate": "24/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736466",
      "Title": "Hope Seems Fleeting sutherndiva nene2059"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 9, 2009 10:56PM AnneN wrote: Since she is a student, you can check to see if there is a student health service at her school. The staff at the student health service will have had experience with lots of foreign students, so they should be able to tell her what resources are available to pay for her care, or refer her to someone who can help. It's very possible the lump is nothing. But if it is something, it will be easier and less expensive to treat it early. Waiting will only make it riskier and more expensive. Go now! Good luck to you and her. ",
      "MessageIndex": 2,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/737194",
      "Title": "My Girlfriend lg1987 juanita63"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Oct 30, 2009 05:46PM AnneN wrote: Hi, Maddy. I was also stage IV at initial diagnosis. I've had no chemo. My cancer is highly estrogen-positive and has been shrinking with hormonal therapy (Tamoxifen and Zoladex, plus Zometa for bones). My marker blipped up when I started treatment, and my onc said that could be because of dead tumor cells. Then it went back down again and is now close to normal. My onc says she pays more attention to whether the tumor is shrinking than to the markers. Make sure you exercise regularly - it helps your treatments work better. I bought a treadmill and have been walking on it a half hour a day. There are a couple of books that are very helpful about diet and exercise things you can do to enhance your treatment's effectiveness; one is by Dr. David Servan-Schreiber and another is by Dr. Keith Block. Good luck to you! ",
      "MessageIndex": 18,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742900",
      "Title": "Stage IV on Day One- so filled with fear MaddyMason MaddyMason"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jan 16, 2010 06:22PM AnneN wrote: Hugs, Elizabeth. Best of luck with the trial. Beat those mets! Anne ",
      "MessageIndex": 87,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746762",
      "Title": "Progression in liver and bones :-( konakat dreamwriter"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Aug 22, 2009 11:09PM AnneN wrote: My oncologist said anytime the mammogram technician can feel a lump, \"they should stick a needle in it,\" even if the imaging says it's benign. \"Sometimes the imaging is wrong.\" I had a mammogram and then an ultrasound in 2006 which diagnosed my lump as a \"benign cyst.\" We didn't biopsy it then. I quit worrying about it and unfortunately neglected to even get another mammogram until 2 1/2 years later. By then the cancer had spread to my bones. If you have a palpable lump, get a biopsy. Good luck - I hope yours is benign. ",
      "MessageIndex": 10,
      "PostDate": "22/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739108",
      "Title": "Age Discrimination. ACK! Minny DJ64"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Oct 30, 2009 01:34PM AnneN wrote: I had no idea I had bone mets until the staging PET/CT my onc ordered found them. I had four of them - 2 in spine, one in collarbone, one in hip. (One of the spine ones has since disappeared after treatment.) I have never felt any pain from the one in my hip. The ones in my spine and collarbone don't cause any pain unless I overexert the muscles near them. There was also a period of 2 weeks when I first started my treatment when I had a cancer \"flare\" from the Tamoxifen that caused serious back pain - I had to be helped in and out of bed. But I could manage it with Tylenol, and after the flare subsided, no more pain unless I overdo it. I have never had the burning sensation some of you describe. For me it just feels like any old backache - I wouldn't have known it was mets without the PET/CT. I agree with everybody else - get it checked out! ",
      "MessageIndex": 13,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728705",
      "Title": "Bone mets- what does the pain feel like? jejarvis Tweetyb422"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jul 15, 2009 07:19PM AnneN wrote: I both did and didn't find my lump. I found a lump in 2006; mammogram was inconclusive; follow-up ultrasound seemed to show it was a benign cyst. A lot was going on in my life, I was busy, so I quit thinking about it. In 2009 my primary care doctor reviewed my chart and reminded me that I was way overdue for a mammogram since I hadn't had one since that 2006 mammogram. \"You're right,\" I said, and scheduled one right away. At the time I had no symptoms at all. But the pressure from the mammogram surfaced the tumor, and three days after the mammogram the breast was painful and red. Then I could feel the lump. Mammogram report came back \"additional imaging needed.\" Then an MRI found a 6.7 cm tumor. I was referred to an oncologist who promptly ordered a PET/CT scan that showed it had already spread to my bones and possibly my lungs (lung spots are too tiny to tell if they're cancer). My oncologist thinks they should have biopsied the lump I found back in 2006. She says any time there's a lump the mammogram technician can feel, \"they should stick a needle in it.\" She said \"Sometimes the imaging is wrong.\" Please get a biopsy. My therapy is going well, but I sure wish we'd caught this in 2006. ",
      "MessageIndex": 39,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/695857",
      "Title": "WHAT did YOUR lump FEEL like? gscott MomOfTeenGirl01"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Oct 30, 2009 01:56PM AnneN wrote: 49 and stage IV at initial diagnosis. My onc thinks the \"benign cyst\" I was diagnosed with two years before that was a missed diagnosis; she thinks it should have been biopsied and was probably already cancer then; if she's right, then I was 47. ",
      "MessageIndex": 314,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jan 28, 2011 01:45AM AnneN wrote: What pattih said.   Anne ",
      "MessageIndex": 46,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763942",
      "Title": "Letter to Konakat 1Athena1 SusanR"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Feb 24, 2010 11:03PM AnneN wrote: Fitztwins is right that the Americans with Disabilities Act may be helpful, because it also protects people \"associated with\" someone with a disability. There is a national center in California that helps people experiencing what's called \"Family Responsibilities Discrimination.\" It's the Center for Work-Life Law at UC Hastings. Their website is www.worklifelaw.org. They have a free hotline for questions and they also provide a referral service if it turns out you need an attorney. Anne ",
      "MessageIndex": 10,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748607",
      "Title": "Help....Verizon is so insensitive to their employees Ready2Win 3katz"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Sep 17, 2009 09:17PM AnneN wrote: A member of these boards who goes by the name Pitanga has posted about author Susan Sontag, who lived for 28 years after being diagnosed with a large tumor and at least 28 positive lymph nodes and given 6 months to live. Put \"Susan Sontag\" into the search box and you'll find Pitanga's posts about her. And Sontag didn't have Tamoxifen! ",
      "MessageIndex": 10,
      "PostDate": "17/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740529",
      "Title": "Anyone 10 or 20 year surviror at this Stage TLF Padiddle"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Aug 10, 2009 11:47AM - edited Aug 10, 2009 11:48AM by AnneN Heidi, I don't have brain mets, but I saw someone on another thread mention this site last week and I thought it might be helpful to you: http://www.brainmetsbc.org/ My heart goes out to you and your kids. I hope you beat this thing for a good long while. Anne ",
      "MessageIndex": 2,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Oct 2, 2009 10:54PM AnneN wrote: Thanks, 33skidoo and Heather. Heather, I appreciate your support, and you're right, it does suck, but the funny thing is, I still don't feel sick! People keep offering to help and there really isn't anything I need yet. The only side effect that I have from the drugs that I'm on is hot flashes, and right now none of the mets are giving me any symptoms. It's so bizarre to have this much cancer and feel fine.  People keep saying I have a great attitude, but it's easy to have a great attitude when you feel well! ",
      "MessageIndex": 9,
      "PostDate": "02/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741276",
      "Title": "WTF? Endometrial cancer, too - just diagnosed today AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Oct 1, 2009 11:06PM AnneN wrote: Oops, I think I misspoke there. I believe they'll be switching me from Tamoxifen to an aromatase inhibitor after my ovaries are gone. So I don't actually get to keep the Tamox, but I do get to stay on hormone therapy instead of chemo. Anne ",
      "MessageIndex": 5,
      "PostDate": "01/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741276",
      "Title": "WTF? Endometrial cancer, too - just diagnosed today AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Aug 2, 2009 09:48AM AnneN wrote: Good for you - you caught it early! And it's highly estrogen positive, so you're going to have lots of tools to keep it at bay. You're right that the pathology test after surgery and the sentinel node test will tell you much more, but so far this is good news. Good luck to you! ",
      "MessageIndex": 1,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738283",
      "Title": "what to expect tfried123 AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Aug 2, 2009 10:30AM AnneN wrote: Hi, Tfried. I have no experience with Herceptin since my cancer's HER negative. Some women on this board have had good results, some with no side effects. You can put \"Herceptin\" into the search box and find threads where they've discussed it. I have been on Tamoxifen for nearly 4 months now. I am happy to report that my results have been great (I see you saw them in my signature line) and my side effects have been minimal. The only ongoing side effect I've had is hot flashes, and they're pretty mild. Just the occasional, \"Gee, it's hot in here ... oh, right.\" I figure I would eventually have had them with menopause anyway, so they don't really bother me.  I also had one experience of cancer \"flare,\" which happens sometimes at the beginning of Tamoxifen treatment, which is where the cancer flares up before it begins to shrink. I have two small mets in my spine, so the flare gave me serious backaches for a week (so serious I could not get in and out of bed without help), mild backaches the following week, and then the backaches went away. While I was having them, they were manageable with Tylenol. You probably won't have any flare with Tamoxifen because your surgery will remove all your cancer before you start taking it. If you should happen to get nasty bone pain after starting Tamoxifen you might want to ask for a PET/CT scan to make sure you don't have mets. It's an expensive test (thousands of dollars), so they may not order one for you unless there is some reason to suspect mets. From what you've said it sounds like they caught your cancer early enough that mets are unlikely. Since you are a newbie, you may not have seen any of the other times I've recommended a book that has helped me a lot. My primary care doc told me about it. It's Anticancer: A New Way of Life by David Servan-Schreiber. He's a physician and cancer survivor who combed the medical literature for evidence of lifestyle changes that can help fight cancer, and this book is the result of that search. This board is a great help, too. I hope you learn as much from it as I have and that you get wonderful results from your treatment! ",
      "MessageIndex": 4,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738283",
      "Title": "what to expect tfried123 AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Mar 16, 2010 11:45PM AnneN wrote: Congrats, Sharon! I hope that inflammation is all it is and you can celebrate with the Stable Boy! Anne ",
      "MessageIndex": 9,
      "PostDate": "16/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749813",
      "Title": "The First 'Reveal'...Onc Liked it... Lowrider54 Anne45"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Oct 30, 2009 02:00PM AnneN wrote: Maddy, I bet the women on this site are disproportionately young because the \"senior citizens\" are less likely to run to their computers and Google everything than we younger ones are! So there are more younger women discovering this site because there are more younger women looking for answers on the Web.",
      "MessageIndex": 315,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Mar 17, 2010 01:33AM AnneN wrote: Congrats, Sharon (Lowrider), for successfully navigating the accelerated benefits process! Thanks, JennGrace, for starting this thread, and thanks, MJLToday, for pointing out that disability status gets you out of the 10% early withdrawal penalty for IRAs! This was the first I'd heard of it - thanks so much. I Googled it and the search results say IRS Publication 590 provides the details. Here's the link: http://www.irs.gov/pub/irs-pdf/p590.pdf You ladies are amazing. I learn so much here. Thanks so much! Anne ",
      "MessageIndex": 80,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Aug 15, 2009 02:42AM AnneN wrote: Since you asked for stories of good outcomes - when my bone mets in my spine flared up when I started Tamoxifen, I was taking Tylenol all day long for the pain and had to have my DH help me in and out of bed. Two weeks later when the flare subsided, so did the pain. Now the mets are shrinking and the bone is re-growing. No fractures so far (knock on wood). I am on Zometa, too - I think it's probably helping. If they start you on Zometa, you might want to search for Zometa threads on the boards. There was one where women were mentioning that you can avoid side effects by asking to have your infusion done more slowly - 30 minutes instead of 15. Mine usually take about 25 minutes and I haven't had any trouble. Gentle hugs - I hope you get complete relief from your pain and are walking comfortably again soon!  Anne ",
      "MessageIndex": 13,
      "PostDate": "15/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738838",
      "Title": "Now bone mets, need encouragement wayover20 kbugmom"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Feb 13, 2010 12:12AM AnneN wrote: When I was a newbie, this site was a bright lantern illuminating a very dark tunnel. Now that I have been living with my stage IV diagnosis for nearly a year, I feel blessed to be able to share a little of what I've learned with the sisters who are walking behind me. The comments of women on this site have helped me make treatment decisions. They have helped me add helpful supplements to my diet. And they have let me know the valuable, valuable information that a stage IV bc diagnosis qualifies one for Social Security Disability. This has allowed me to cut my hours at work, take better care of myself, and replace all the lost income so I took no financial hit. I would probably still not know about this if it were not for breastcancer.org. I cannot thank you enough.",
      "MessageIndex": 29,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747824",
      "Title": "Please share how breastcancer.org has impacted you.... Moderators BouncingBetties"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Aug 3, 2009 10:54AM AnneN wrote: Oops. Sorry - I used board slang on your very first day on this board. \"Mets\" is slang for metastases. This is when cancer has spread beyond the lymph nodes to other parts of the body. In my case, since I neglected to get a mammogram for 2 1/2 years, by the time my cancer was diagnosed, it had already metastasized - it had spread to my lymph nodes, four of my bones (two of which are in my spine), and possibly my lungs (the lung spots are too tiny for the scans to show whether they're cancer or not). When I started Tamoxifen, the bone spots flared up and that's what caused my backaches. At the early stage your cancer is at, it is unlikely that you have mets, but it's not completely impossible. The most accurate way to test for mets is a full-body scan called a PET/CT that makes the cancer spots \"light up\" on the images, but it's a very expensive test, thousands of dollars. Insurers don't like to pay for a PET/CT if there's no indication it's necessary. I don't want to worry you - you caught your cancer early and it's unlikely you'll have to worry about mets. Just wanted to let you know that if you had bad bone pain in your first few weeks on Tamoxifen, it could be mets flaring up, and then you would want to ask your doctor about checking for mets.  In my case we already knew about my mets before I started on Tamoxifen. The results of my MRI showed I had fairly advanced cancer - a large primary tumor and at least three lymph nodes involved - so my oncologist ordered a PET/CT the very first day she saw me. Congratulations on catching yours early - you should do well! ",
      "MessageIndex": 6,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738283",
      "Title": "what to expect tfried123 AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Mar 14, 2010 10:41AM AnneN wrote: Oh, Cat, you are both so young for this! At least since you've both been eating well and working out, you're in good shape for the fight ahead! Hugs and best wishes to both of you. Anne ",
      "MessageIndex": 28,
      "PostDate": "14/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749712",
      "Title": "Does it get any worse than this? cmhartley Padiddle"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "AnneN wrote: Hi, all. My apologies that I've been out of touch and haven't been following others' posts. I just had a little spotting - thought it was nothing - oncologist said see a gynocologist. In quick succession, a biopsy, referral to gyn onc, D&C, long story short - it's endometrial cancer. A separate cancer, not a new metastasis. Caught it early - still only grade 1 cells. Odds are good (80%) that surgery alone will take care of it and I'll be back to just fighting the breast cancer. Gyn onc says it's rare for someone to have both cancers. She thinks it's extremely unlikely that the tamox would've caused it 'cause I've only been on it 6 months. Never took birth control pills. Never had HRT. Nursed all 3 of my babies. Baffling. Gyn onc thinks it may be genetic and will refer me for genetic testing.  Have been reading all night, books & web. Have learned that there's a genetic condition called HNPCC syndrome that increases risk of colon cancer (which my mother's brother died of), stomach cancer (which my mother's aunt died of), and endometrial cancer at an unusually young age (I'm 50, which is young for this), among other cancers. Have also learned that there seems to be no alternative to hysterectomy for this. Questions I have for all you good sisters: - Anybody with experience with HNPCC syndrome? - Anybody know anything else that might have put me at risk for both cancers? - Is it really true that I have no choice but to have the hysterectomy? - Anybody know any good resources for how to have a good outcome from hysterectomy, avoiding the common side effects? I won't be replying tonight - I need some sleep and I'm going to sign off and go to bed. I look forward to seeing any advice you can give me tomorrow. Thanks so much, Anne  Faslodex/Zometa/complementary supplements. Mastectomy with immediate DIEP at NOLA on 12/15/10. Dx 3/20/2009, IDC, 6cm+, Stage IV, Grade 2, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741276",
      "Title": "WTF? Endometrial cancer, too - just diagnosed today AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Oct 1, 2009 11:04PM AnneN wrote: Celia, thanks for the article, but my gynecological oncologist told me that while the Tamoxifen may have speeded up what I already had, the endometrial cancer has to have been present before the Tamoxifen started. She says endometrial cancer takes years for the cells to build up to a measurable amount, and I've only been on Tamoxifen 6 months. If I have the surgery, I get to keep the Tamoxifen, which has been doing a great job shrinking the breast tumor and the bone metastases. So I'm not looking for ways to get off Tamox! Patti, I admire your persistence in getting three (!) second opinions. Did they all say the same thing? If hot flashes are the only side effect I get I'll be thrilled - I have hot flashes now from the Tamoxifen & Zoladex, and they're pretty manageable.  Cathy, wow, thanks for sharing your family's story. I am impressed by the way you touched on all my questions! This is a big help in understanding what's going on. I'm sorry that you've been through so much but I'm glad you haven't had any adverse effects from the hysterectomy. I hope you all are doing well. Thanks for responding to my post! Anne ",
      "MessageIndex": 4,
      "PostDate": "01/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741276",
      "Title": "WTF? Endometrial cancer, too - just diagnosed today AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Aug 14, 2009 07:02PM AnneN wrote: Sherri, I'm another hormone therapy success story. My biopsy showed my tumor is over 90% estrogen positive. I've never had chemo. I have been on hormone therapy (Tamoxifen/Zoladex/Zometa) since April and my primary tumor is now about a third of its original volume. My metastases are also shrinking and the bones where they were are re-growing. My oncologist told me yesterday that one of the bone spots would only be a \"suspected metastasis\" if the MRI we did yesterday had been my very first scan - the technician's report says that spot is \"not definitively seen\" any longer. A friend of mine researched the question of whether it's possible to do both hormone therapy and chemotherapy at the same time, and learned that apparently it's risky. So they look at the biopsied tissue and figure out which therapy will be more effective on that particular cancer, and just do one or the other at a time. If the hormone therapy does not work for your mom, they can always switch her to chemo later. If it works, she may not ever need chemo! Good luck and good wishes. Anne ",
      "MessageIndex": 6,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738937",
      "Title": "hormone therapy in place of chemotherapy ForMyMother ForMyMother"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jan 12, 2010 11:22AM AnneN wrote: Yan, My onc told me once that anytime you can palpate the lump, you should biopsy it.  (Context: she was speaking about my \"benign cyst\" diagnosis in 2006, which she thinks was a missed diagnosis - she thinks that lump was cancer back then, but because it wasn't biopsied, we didn't catch it until 2009.) Good luck - I hope it's benign. Anne ",
      "MessageIndex": 17,
      "PostDate": "12/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746611",
      "Title": "New small lump. Does it make any difference? leprechaun 3katz"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jun 25, 2009 12:17AM AnneN wrote: Hi, eenymeeny. Your diagnosis line looks a lot like mine, and I was diagnosed at age 49, too (I'm 50 now). Did you have metastases at your initial diagnosis, or did you have a recurrence? Mine were at initial diagnosis. Along with my hormone therapy prescribed by my oncologist, I am dabbling in natural therapies. I'm taking some supplements (calcium, omega-3, coenzyme Q10, and a multivitamin), cutting out junk food, and taking a half-hour walk each day. My primary care doc recommended David Servan-Schreiber's book Anticancer: A New Way of Life, and I'm trying to do as much of the stuff he recommends as I can stand. I've replaced my hopeless pathetic dependency on Pepsi with a new hopeless pathetic dependency on green tea. Good luck to you! ",
      "MessageIndex": 1,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736465",
      "Title": "NEWBIE eenymeeny cancerkicker"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jan 28, 2011 07:37AM AnneN wrote: Jenn, Hugs on this horrible news. Second opinions are good - a good doctor never minds hearing what other good doctors think. Good luck on the eribulin. We're rooting for you. Anne ",
      "MessageIndex": 32,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764041",
      "Title": "today sucks; progression; new treatment jleigh JannyM"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Sep 11, 2009 02:42AM AnneN wrote: Hi, KS. I was stage IV at diagnosis - bone mets and suspected lung mets. My cancer is over 90% estrogen-positive, so my oncologist chose to start with the hormone therapy. The way she explained it to me is that chemo is faster, so they'll use that first if your cancer hasn't already spread, in hopes of beating it before it does spread. But if it has already spread by the time they find it, then they'll use the more effective therapy, which in my case is hormone therapy, even if it takes longer. (Apparently you can't do both at once because there are risks involved.) As for the surgery question, there is currently research going on to investigate whether surgery extends survival at all in patients who are Stage IV at initial diagnosis. The early research seems to show that if you have very few or only one metastasis, and only in bone, then having a mastectomy can add as much as 18 months additional survival, but if you have widespread metastases throughout your body, then surgery doesn't extend survival. I am in the middle - I have 4 bone metastases and suspicious spots in my lungs that are too small to confirm, but they've been shrinking in response to therapy so we assume they're cancer. But nothing in my brain or liver. So will surgery benefit me or not? I don't know, so I decided to go to the experts. So I am getting an evaluation from MD Anderson Cancer Center in Houston, Texas, where a lot of the doctors who've done the research on this question are based. In fact, my appointment is tomorrow morning. We'll see what they say! Good luck to you and your mom. I hope she gets great results from her treatment! ",
      "MessageIndex": 6,
      "PostDate": "11/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740194",
      "Title": "No chemo therapy for stage IV? ks123 kelly1215"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Aug 14, 2009 08:39PM AnneN wrote: Beautiful, Irina. Hooray!",
      "MessageIndex": 3,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738967",
      "Title": "Good News Irina hollyann"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Nov 13, 2010 07:27AM AnneN wrote: Here are two excellent books by doctors about diet and cancer:           Anticancer: A New Way of Life, by Dr. David Servan-Schreiber           Life Over Cancer, by Dr. Keith Block Both of these doctors have combed the peer-reviewed medical literature and summarized which foods affect cancer treatment effectiveness. They both recommend avoiding refined sugar. Dr. Servan-Schreiber is particularly emphatic about avoiding high-fructose corn syrup (used in colas, etc.). He also recommends that breast cancer patients walk a half-hour each day. My family doctor recommended Servan-Schreiber’s book on the day she diagnosed me, and I went straight to the bookstore and bought it. So from the first day I was diagnosed, I cut out all my cola and started daily half-hour walks. My oncologist said I had one of the best initial responses to therapy that she'd ever seen, and I think this may be a reason why. I don't make myself crazy trying to do EVERY suggestion in these books, but I do the ones that work for me, and I've been happy with the results.",
      "MessageIndex": 19,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760633",
      "Title": "Do we need to change our life style? Suebus tooyoungtohavebc"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Dec 20, 2010 05:27PM AnneN wrote: Blessings, hugs, congrats, and peace, Dreamwriter. Thanks for being here.",
      "MessageIndex": 11,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762302",
      "Title": "It's finally here - my 5 yr Cancerversary dreamwriter twoshoes"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Aug 9, 2009 10:09PM AnneN wrote: Just would like to gently point out (as another poster did above) that the 2-3% survival benefit you're asking about is an INCREASE, not an absolute number. So, for example, if, say, 85% would have survived without chemo, then 88% (85+3) would survive with it. I want also to echo what several have said that you'll need to find out more about your particular variety of cancer before you can accurately assess how much benefit chemo may be for you. For me, I am fortunate to have a variety of cancer that is over 90% estrogen positive. So we are hammering mine with hormonal therapy and diet/exercise, and it's working great so far. I had a Mayo Clinic medical oncologist tell me that in my case, he thought I'd get more benefit from hormonal therapy than chemo, and it looks so far like he's been right. Whether you choose chemo or not, there are some diet/exercise/lifestyle things you can do that will help your treatment be more effective that have been clinically verified. A doctor by the name of David Servan-Schrieber has documented them in a book called Anticancer: A New Way of Life. My primary care doctor recommended this book to me the day she diagnosed me. I have been following many of Servan-Schreiber's suggestions and I believe that's a major reason my tumor has responded so well to hormone therapy. My oncologist said it's one of the best initial responses she's ever seen. Servan-Schreiber is a physician and cancer survivor who combed through the medical literature after he experienced a recurrence, looking for ways to change his lifestyle to reduce his risk. This book is the product of what he learned.",
      "MessageIndex": 59,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738576",
      "Title": "How many here have survived 6 years after chemo? gscott Beatis"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Nov 13, 2010 10:08PM AnneN wrote: She, Thanks so much for sharing your experience. Thanks for your frankness about how you wouldn't do this at Stage IV. I came here wanting to hear what people think. I appreciate your honesty - thank you. I'm familiar with the \"NOLA in September\" thread - I spent a lot of time lurking there when I was a newbie, and it may actually be where I first got the idea to learn more about NOLA. It's been so long now I don't recall for sure. An immediate DIEP was what I was hoping to do when I was first diagnosed when they thought at first that I was stage 2 or 3. Then the PET/CT revealed the bone mets and the biopsy revealed how highly estrogen positive the tumor was, so the whole treatment plan changed to no mastectomy at all at that point. But now 20 months down the road it appears we need some method of local control. And the thing is, I just don't want anything in there any more that isn't me. No tumor, no implant. Just my personal \"ick\" factor. I'm looking forward to having the beastie gone, even though I realize I'll have to fight my way through several months of recovery. A year ago I had an easier surgery - a laproscopic hysterectomy - and the surgical recovery from that went well for me, much better than I expected. That makes me cautiously optimistic.",
      "MessageIndex": 12,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760700",
      "Title": "AnneN's back - didn't win, but not too sad AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Dec 20, 2010 05:26PM AnneN wrote: Just to update anyone who might belatedly be reading this old thread, I can now tell you what I did and how it came out. The slight progression we observed in November became definite progression in a few weeks. So we switched me from Tamoxifen to Anastrozole (generic Arimidex). We still needed local control of the tumor, though, and soon, because it was impacting the skin, bruising it and threatening to break through. Dr. Sullivan and Dr. Stolier kindly worked me into their schedules and I had the mastectomy with immediate DIEP on December 15. (Dr. Massey was in Charleston all month and not available at NOLA, and I wanted NOLA.) Dr. Stolier called me before the surgery to warn me about the risk I'm taking by doing immediate reconstruction instead of delayed - his recommendation was to have radiation in between - but I explained to him my multiple reasons for wanting to avoid radiation and he was willing to do the surgery anyway so long as I understood the increased risk of local recurrence. I'm writing this at five days after surgery. I'm out of the hospital, I'm off narcotics and just using Tylenol, I've been showering without help for two days, and I did ten minutes on the treadmill this morning at 1 mph. I don't have any lymphedema yet, and I hope to keep it that way - we'll see. The flap seems fine, the incisions seem fine, the drains seem fine, and I hope they will come out at my post-op appointment later this week. If current trends continue, a recovery of a few months looks much more likely for me than one that takes a year. I think the thing that'll take the longest to resolve will be the breast incision - I was not able to have skin-sparing after all because the tumor had impinged on the skin too much and the skin had to go. So I have a big patch. Fortunately, the skin tone matches pretty well. If anybody in similar shoes to mine is considering this, the one thing I wish I had known a year ago was that waiting until the tumor threatened the skin would make it impossible to spare the skin. If you are stage IV and you want a mastectomy and your doctor won't give you one, this might be an argument you can use - doing it earlier may provide a better cosmetic outcome. I am looking forward to seeing how low my next CA 27-29 will go now that the beastie is gone!  Thanks, everyone, for sharing your experience and helping me think this through. ",
      "MessageIndex": 19,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760700",
      "Title": "AnneN's back - didn't win, but not too sad AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Dec 20, 2010 07:50PM AnneN wrote: You're kidding, Lowrider - you're in St. Cloud, too? So is \"Minnesota\" - the three of us should get together sometime. But don't feel \"duh\" - I purposely didn't mention the cancer in any of my campaign materials - didn't want people feeling I was fragile because fortunately so far I'm not. MCTHO, I don't know how to change the name of a topic, or I would. I didn't win the election but I do feel like I'm holding my own on the cancer fight. ",
      "MessageIndex": 22,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760700",
      "Title": "AnneN's back - didn't win, but not too sad AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jun 21, 2009 04:05PM AnneN wrote: Lisbeth, There is a lovely book written by a breast cancer survivor who took the same chemo your daughter is having - Vinorelbine and Herceptin. It sounds like your daughter has just bone metastases (which is good news - you can live long and well with just bone metastases); the author of this book had extensive liver metastases, and her therapy put her in complete remission. The author also had young children - her youngest was 3 at the time of her treatment. You and your daughter might enjoy this book; it's beautifully written and inspires hope. The title is Not Done Yet - Living Through Breast Cancer. The author is Laurie Kingston. The publisher is Women's Press, an imprint of Canadian Scholars' Press Inc. There's another more advice-oriented book that's been very helpful to me, too. It's called Anticancer: A New Way of Life. The author, David Servan-Schreiber, is a physician and cancer survivor who combed through the medical literature for diet/exercise/lifestyle changes that have been shown to extend survival; this book is a summary of that research.  Good luck to you both. ",
      "MessageIndex": 6,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736257",
      "Title": "Help to help my daughter garbovits AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Dec 20, 2010 06:34PM AnneN wrote: I just started on it, too, eleven days ago. So far so good. No difference in side effects compared to the Tamoxifen I had before - nothing but the occasional hot flash.",
      "MessageIndex": 2,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762306",
      "Title": "Started on Arimidex..... KentuckyMom justjudie"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Feb 14, 2010 12:48AM AnneN wrote: The one that always makes me wince is any variation of \"I hope you get better soon\" or \"I wish you a speedy recovery.\" I am stage IV. The health I have now is pretty much as \"better\" as I am ever going to get. ",
      "MessageIndex": 11,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748288",
      "Title": "Six Things You Shouldn't Say to a Cancer Patient EnglishMajor RobinWendy"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Mar 13, 2010 05:04PM AnneN wrote: Hi, Vinkari and Hannah. Here are two excellent books by doctors about diet and cancer:           Life Over Cancer, by Dr. Keith Block           Anticancer: A New Way of Life, by Dr. David Servan-Schreiber Both of these doctors have reviewed the medical literature about which foods affect cancer treatment effectiveness. They both recommend avoiding refined sugar. Dr. Servan-Schreiber is particularly emphatic about avoiding high-fructose corn syrup (used in colas, etc.). You can probably find one or both of these books at your public library. ",
      "MessageIndex": 10,
      "PostDate": "13/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749727",
      "Title": "what is the survival rate of stage 4 metastatic breast cancer vinkari dreamwriter"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Nov 13, 2010 12:34PM AnneN wrote: Thanks, Amy! But I'm not doing a double mx. I'm keeping the healthy breast just the way it is. I've been scanned repeatedly over the last 20 months, and there's no sign of anything suspicious in there. And since I'm risking lymphedema in my right arm, keeping the left arm untouched really appeals to me. One reason I'm choosing Dr. Massey is because she's an expert on lymphedema, so I'm hopeful she will help me avoid it in the first place. My medical oncologist suggested radiation, but she's okay with me going the surgery route instead. Every choice involves some risk. I'm just picking the risks I'm most comfortable with.",
      "MessageIndex": 8,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760700",
      "Title": "AnneN's back - didn't win, but not too sad AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jun 14, 2009 09:47PM AnneN wrote: Kaliaja, Did they give you a number for how strongly estrogen-positive your mother's cancer is? Mine is over 90% estrogen positive and so my onc has been able to shrink my tumor with just hormone therapy, no chemo. She is planning on referring me to a surgeon next month. I asked her when I would need chemo and she said that if the hormone therapy continues to work, \"Maybe never.\" One thing that is helping my therapy work is that I've been following many of the recommendations in the book Anticancer: A New Way of Life. The author is David Servan-Schreiber, a doctor and cancer survivor. He combed through the medical literature to find out which lifestyle changes help fight cancer, and this book is the result. He makes very specific recommendations about diet, exercise, and mental health. For example, he cites research showing that breast cancer therapy works better if you take a half-hour walk six times a week. So I've been doing that. Best of luck to you and your mom. ",
      "MessageIndex": 7,
      "PostDate": "14/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/735869",
      "Title": "Could Use Some Advice for My Mom Kaliaja Brenda_R"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Jun 15, 2009 10:20PM AnneN wrote: Kaliaja -  Another reason that they may be encouraging chemo is the staging - your mom is stage IIIC and they may be trying to beat it before it metastasizes. (I'm early stage IV - at diagnosis mine had already metastasized to 4 bone sites.) Apparently the advantage of chemo is that it is faster. My oncologist told me that if I'd been diagnosed at Stage III they would have done chemo first, but since mine has already metastasized they are using hormone therapy first because for my cancer it's more effective, although it takes longer to work. It sounds like in your mom's case, there may be other considerations to think about besides speed. Since her cancer's >90% ER, it might be worth asking her oncologist about trying hormone therapy first. I hope all goes well for you and your mom, too - thanks so much! ",
      "MessageIndex": 13,
      "PostDate": "15/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/735869",
      "Title": "Could Use Some Advice for My Mom Kaliaja Brenda_R"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "AnneN wrote: Hi, everybody. Last time I posted it was to check out for a while because I had just started a run for the state legislature. As a Democrat running in a Republican-leaning district in a Republican-leaning election, of course I did not win, but I got a respectable 38.39% and I'm not too sad or embarrassed. I loved campaigning, met a lot of great people, learned a lot, and had a great time. People are already encouraging me to run again two years from now, assuming I am still healthy enough, and frankly, that encouragement feels great. Of course, the last couple months before election day I was very time-crunched and got a little less careful about diet, exercise, and sleep. That fickle Stable Boy apparently took offense and is flirting with leaving me. The mets are still stable, but the primary tumor has started to sloooooowly grow again. And my CA 27-29 tumor marker numbers, which had stayed stable in the mid-50s to mid-70s for a year and a half, have started slowly climbing; the most recent one was 99. Rather than switch me off a (mostly) successful drug regimen, my onc recommends getting local control of the tumor and keeping the drugs the same, since they're still working at controlling the mets. She suggested radiation, but I told her I would rather just do a mastectomy and get the tumor out of there. (Plus I don't like the prospect of radiation side effects.) My onc is okay with that as long as I do it soon - she is concerned about the tumor eventually breaking through the skin. I have started talking with Dr. Marga Massey about mastectomy with an immediate DIEP sometime early in 2011, probably at NOLA. I am 50% nervous and 50% excited to get it dealt with and start recovering. In late March I am scheduled to do a workshop at a conference in my field, and the thought of having my surgical recovery behind me by then and being back on my feet and moving on with my life just sounds so appealing. So even though I just lost an election and have to deal with this little bit of progression, I am feeling surprisingly good about the whole thing. That said, if you know of any pitfalls/cautions/concerns/issues I should be considering, please feel free to chime in. I always welcome your advice, sisters. Faslodex/Zometa/complementary supplements. Mastectomy with immediate DIEP at NOLA on 12/15/10. Dx 3/20/2009, IDC, 6cm+, Stage IV, Grade 2, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760700",
      "Title": "AnneN's back - didn't win, but not too sad AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Nov 13, 2010 12:38PM AnneN wrote: Hey, Amy - we are writing at the same time! Thanks for the detail and the good luck wishes. I have to go sign off now - gotta get going to take my youngest to a birthday party after lunch.",
      "MessageIndex": 10,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760700",
      "Title": "AnneN's back - didn't win, but not too sad AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Nov 17, 2010 12:41PM AnneN wrote: Thanks so much, everybody, for the good wishes and for sharing your experience! Hugs to all of you. Anne",
      "MessageIndex": 16,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760700",
      "Title": "AnneN's back - didn't win, but not too sad AnneN AnneN"
    },
    {
      "AuthorID": "AnneN",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82253/profile",
      "Content": "Nov 13, 2010 12:24PM AnneN wrote: Thanks, all of you, it's good to be back. Laurie, that's very helpful to know that you had a 3-month recovery. I was thinking two months. I will probably still do it, but it's helpful to know that at that conference at the end of March I may not be in great shape just yet. Implants don't appeal to me at all. If I couldn't have reconstruction done with my own tissue, I'd probably just go with no reconstruction. I don't like the prospect of implants' potential complications, the repeated surgeries involved, or the fact that implants wear out in 10 years or so. I hope to be around for more than 10 years, even though I am stage IV. My mets are small, stable, and in non-dangerous places (mostly bone). I'm gunning for Rita Arditti's 30-year survival record. I may not make it, but it's worth a try!",
      "MessageIndex": 5,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760700",
      "Title": "AnneN's back - didn't win, but not too sad AnneN AnneN"
    }
  ]
}