{
  "AuthorID": "anneofthefo…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194682/profile",
  "Posts": [
    {
      "AuthorID": "anneofthefo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194682/profile",
      "Content": "Apr 16, 2014 04:20AM anneoftheforest wrote: Thanks cinnamonsmiles for sharing. Why elevate the foot?  Blood clots?",
      "MessageIndex": 3,
      "PostDate": "16/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820213",
      "Title": "SLNB on both sides anneoftheforest inks"
    },
    {
      "AuthorID": "anneofthefo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194682/profile",
      "Content": "Apr 25, 2014 08:44PM anneoftheforest wrote: Inks - Thanks for the well wishes. I'm BRCA2+ ... I noticed you were BRCA1+.  I hope you get your expanders out soon. They are like boulders :) Did your PS give you excercises to do?  I thought my range of motion was fine but the therapist moved my arms in certain ways that I had limitations. She said I had functional movement but I could improve in other areas. Always something!  I'm supposed to get my ovaries out soon. Either I'm reading about reconstruction, surgical menopause or LE.  Oh well, one thing at a time or I'll go nuts :)",
      "MessageIndex": 16,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820213",
      "Title": "SLNB on both sides anneoftheforest inks"
    },
    {
      "AuthorID": "anneofthefo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194682/profile",
      "Content": "Apr 16, 2014 07:29PM anneoftheforest wrote: Thanks Ridley for your post.  I will try not to feel guilty :)  Hearing your story makes me feel better.  I do feel very fortunate that it was all caught early.  If I hadn't had that bloody discharge I wouldn't of known.  I had just weaned my youngest so I was hoping against hope it was just something weaning related.  But my mother's breast cancer at 44 alerted me otherwise. I think I am going to get a referral to an LE therapist at the cancer center in my city.  I think it won't hurt to get my arms measured and to just get educated on my risks.  Maybe that will reduce my anxiety a bit.",
      "MessageIndex": 5,
      "PostDate": "16/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820213",
      "Title": "SLNB on both sides anneoftheforest inks"
    },
    {
      "AuthorID": "anneofthefo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194682/profile",
      "Content": "Apr 25, 2014 07:05PM - edited Apr 25, 2014 07:09PM by anneoftheforest inks - I have a two year old that likes to be held as well :)  I asked the LE therapist if I could use my rowing machine and she said yes but to take it very slowly and gradually build up.  She also recommended I get compression garments for when I exercise.  I met with her once to be evaluated and she wants to see me two more times to go over education and prevention in more detail.  I had my BMX 12 weeks ago and my exchange surgery is next week so she wants me to wait until after my surgeries to start slowly working on exercising.  Plus I have some range of motion limitations that she wants to follow me on as well. I am glad I saw her even thougha sometimes I feel as though it is a bit overkill.  I didn't have radiation.  But I'm only 37 so I feel like I need to be proactive.  A PT friend of mine and someone on the FORCE website mentioned getting evaluated by an LE therapist.",
      "MessageIndex": 14,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820213",
      "Title": "SLNB on both sides anneoftheforest inks"
    },
    {
      "AuthorID": "anneofthefo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194682/profile",
      "Content": "Apr 25, 2014 04:37AM anneoftheforest wrote: I met with an LE therapist and she evaluated me and took arm measurements. Since I had SLNB in both arms she said I am low risk for LE (around 4-8%) but it is a lifetime risk.  We talked about things to do to prevent LE like taking the blood pressure on the leg if possible or using the arm with less nodes removed if the leg isn't possible. She said to ask for the smallest needle and the most experienced phlebotomist if I have to do it in my arm.  I can just imagine that would go over well :)  She said even if I don't follow all the recommendations at least I know the risks. It was very informative and at least she has my baseline measurements if something comes up. Thanks cinnamonsmiles for the website reference. Inks, I'm glad you had no problems with LE.  My surgeon said I was low risk and not to do anything different but I'm already a worse case scenario kind of person and wanted to know ways to prevent LE. Thanks for answering my questions. I know I don't have LE but I appreciate your time.",
      "MessageIndex": 12,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820213",
      "Title": "SLNB on both sides anneoftheforest inks"
    }
  ]
}