{
  "AuthorID": "annielynn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
  "Posts": [
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Mar 15, 2011 06:35PM annielynn wrote: I still am finding myself tired through the day. I took a nap earlier in the day, but rallied for an hour at the gym. I wish the weather would warm up.. I'm ready to take the dogs up the mountains.",
      "MessageIndex": 255,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 25, 2011 06:10PM annielynn wrote: Hi ladies..did my treadmill for 45 minutes today. I take my iPad and get caught up on some reading and the time flies. Every couple days I change either the speed, level, or time. I did some thigh workout, too. But boy when I got home I napped for 3hours! I called my dr today and asked about skiing and that was a big fat no..",
      "MessageIndex": 110,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 17, 2011 05:40PM - edited Feb 17, 2011 05:41PM by annielynn Yeah! I finally joined your club today. I had my BMX And reconstruction on Jan 25th. I get my second fill tomorrow. Today I went to the gym and did the treadmill for 35 minutes and worked on my inner thighs. I felt so good! My stretching is pretty good but it is still difficult for me to put dishes away. I have started to do some laundry but could not reach the bleach so will have DH leave that out for me. I feel like a new person. I tried to drive last Friday and cut to close to a bumper while parking. 600 dollar lesson but I think my PS will tell me I'm good to go tomorrow. I am keeping to a smaller diet being I was so inactice but treated myself to a small bowl of rocky road. What a great club and I am glad to belong. BC has brought so many wonderful cyber friends into my life. I get overwhelmed by how much I have gained by losing the boobs. Thank you all",
      "MessageIndex": 75,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 28, 2011 03:57PM annielynn wrote: Hi January ladies.. Did the treadmill for 45 minutes today and some thigh workouts. I sure like to take a rest after, though. I asked my PS today if I could join a cancer fight for life class at my gym. I feel like I don't have too much more to with my fills. I'm at 220ccs and would just like a bit more projection. Well, I don't have any projection at all right now. I am going to the gym now without my fake boobs and just pin my pink ribbon onto my shirt. That was freeing!",
      "MessageIndex": 123,
      "PostDate": "28/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Mar 14, 2011 08:53AM annielynn wrote: Sue.. Great news getting the bikes. Sounds like the perfect birthday present. Red sky.. Good luck with your healing. I hope it goes smoothly. I hate hate hate the drains. Barbara.. How wonderful for beautiful weather, good friends and the love of. Your horses and dogs. I can see how you could have a BC free day. Maria.. Saying prayers that your cold cap works.",
      "MessageIndex": 239,
      "PostDate": "14/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Mar 17, 2011 06:05PM annielynn wrote: Hi Ladies, Redsky.. thanks for the encouragement.. 3 naps, now I like that! Maria.. You're so well organized with your meals.  They sound great. Sue.. great job with the Zumba. Annie.. Is it hard giving up the sweets? Cindy..  ooh, I love the low 70's.  Snowed here in Montana today. Barbara..  good luck with the chemo.  It sounds like you're being kind to yourself and resting.  I did my hour at the gym and it went fine.  I'm increasing intensity/time.  I had a fill today and am at 420ccs.  While at the doctors, I asked him about a painful lump on my sternum.  He was puzzled and ordered antibiotics.  Next week he'll see how it's doing and if no difference, CAT scan.  I guess my mind is in overdrive now.  I think I'm a little grumpy, probably less now that I've been to the gym, but still.",
      "MessageIndex": 274,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 24, 2011 07:39PM annielynn wrote: Hello ladies..this thread is so inspiring. Hugs to all the chemo ladies. I am still doing my treadmill, but have been tired. Today was the first time I've had any pain with a fill. I'm still restricted on upper body but work religiously on my posture! Although a grandma, I don't want granny posture. I wish I could nap today but it's a go-go-go kinda day. It is so cold here in Montana and gray..ugh. MDG..those recipes sound so good. I can't believe we've all had breast cancer and surgery. I am so grateful to have this resource.",
      "MessageIndex": 106,
      "PostDate": "24/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Mar 11, 2011 02:01PM annielynn wrote: Barbara.. good for you to get back in the saddle.  It must have been like heaven.  Sue.. biking somewhere sounds so good right now.  My friend runs a program in Phoenix called The Cycling House.  It's an awesome get away for those that love biking.  He is doing a program in France this year for the tour de france.  I hit the gym first thing and did the leg weights and then the treadmill.  i'm up to level 10 on the hills but have backed the time down to 30 minutes.  I take my ipad and read away.  Hope we all have wonderful weekends!",
      "MessageIndex": 220,
      "PostDate": "11/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 18, 2011 10:03PM annielynn wrote: Second day on the treadmill and I loved it. Still working on my inner thighs. Saw my PS today and he ok'd some minor exercises to raise my arms and stretching my back to get my posture back. I hate how rounded my shoulders have become. Still no physical therapy for two more weeks. Hope everyone is doing well. I got expanded to 180ccs today and seem to be doing well. Goodness, what a process!",
      "MessageIndex": 82,
      "PostDate": "18/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Mar 1, 2011 05:59PM annielynn wrote: Supersally, I love my corgi, and aussie, and sheltie.  They run my life.  I hope you're doing well with all your appointments.  I did my morning workout and went back this evening for the Fit to Fight Cancer wellness group.  They did some tests to see our levels and if there is any areas of concern.  She will compare our beginning results with the results after 6 weeks.  Two more days I need to mark on my calendars!  I rested again after my morning workout.  It's so cold here in Montana, the dogs and I like our down time.  Good luck chemo ladies.",
      "MessageIndex": 127,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Mar 5, 2011 01:26PM - edited Mar 5, 2011 06:56PM by annielynn Hi Ladies.. My workouts are getting more intense. On tues and thurs I also do an extra class called fight for fit.. A cancer program at my gym. I am still upper body restricted, so continue on my legs. I've changed my treadmill to hills and at level10. I'm definitely feeling that. I had another fill thurs, my doc fills 60ccs once a week and I think I'm getting close to Being done. I'm at 300 ccs and might go to 450 or 500. Hoping to stay small. I appreciate the Bff comments. I called mine and said I miss you..come see me! And then she left for Florida, so I still haven't seen her. I am going to Spokane for the weekend but brought my gym clothes. Happy weekend. Maria, hugs for you during chemo.",
      "MessageIndex": 172,
      "PostDate": "05/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Mar 10, 2011 06:38PM annielynn wrote: Oh my, I've missed you ladies.. I've been blah blah all week but kicked it in gear for my cancer fitness class tonight. We do streching first but I am so limited on upper body. We then do weights, again only legs for me and finally treadmill. I pretty much do the same thing during my morning gym time but I so enjoy the commaderie with the other cancer survivors. Like this board, we all share something profoundly private yet so acceptable in a group. My DH has been wonderful, but yet... I was so large breasted before and hated my body so now that I have decided I want to be a small C cup, he's a bit put out. I had another fill today and am at 360ccs which my PS said just one more fill at 60ccs and then he could do the exchange at between 400 and 500 cc implants. Of course all my DH heard was 500. Ugh.. I am 52 yrs old and still don't feel like the boss of anything. Whippetmom suggested 600 ccs but my PS said he wouldn't go over 500. It's no wonder I am feeling blah blah blah! Sorry for long post but it just is flowing tonight.",
      "MessageIndex": 204,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 26, 2011 01:17PM annielynn wrote: MDG..good for your husband. My last fill was painful, too. I was wondering when that was going to happen.. Long day with DD, basketball, final games. Have a great weekend ladies.",
      "MessageIndex": 115,
      "PostDate": "26/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764581",
      "Title": "Jan 2011 gals - post op exercise check in! mdg redskyatnight"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Mar 14, 2011 12:27PM annielynn wrote: My girlfriends had a booby party the Friday before my Tuesday surgery and Oh boy did I drink. Surgery went just fine.",
      "MessageIndex": 3,
      "PostDate": "14/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/766193",
      "Title": "Drank alcohol on Friday surgery tomorrow should I be worried ScariedCat Black-cat"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 17, 2011 08:48PM - edited Feb 17, 2011 08:50PM by annielynn Supersally- did you take pain meds before your fill? I have my second fill tomorrow at 2 and then my DD basketball game at 6 followed by a team party. I am nervous about the pain preventing me from my afternoon. Through all this I have only missed one of DDs game. I, too, have a furry corgi nurse and he brings me much comfort. I am glad your friend took you to lunch and cheered you up. The simple things are really the best medicine!",
      "MessageIndex": 579,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 10, 2011 06:06PM annielynn wrote: Hello ladies..finally after 16 days got my drains out. I am 51 years old and honestly is just about is the happiest feeling. I got my info to send to whippet mom and am thrilled to get going. Of course with the happiness came my weepy tears and ended taking a good old nap. Good luck to the chemo ladies!",
      "MessageIndex": 533,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 12, 2011 06:17PM annielynn wrote: Hi ladies..I love have my drains out. I wear a camisole with fake boobs and so I look almost normal again. I am just allowed to walk but I love it. I tire easily but don't mind as it gives me a better sleep. I had to go back to one pain killer last night but I slept soundly. Prayers to chemo ladies. I can't imagine. My 30 yo DD passed away in a car accident last year but came to me in a dream last night. I feel today has been one of my best day in a long time. Thanks for the encouragement!",
      "MessageIndex": 546,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 18, 2011 01:33PM annielynn wrote: Thanks Terri- I decided to take a pain pill with me just in case so I can enjoy the afternoon.",
      "MessageIndex": 581,
      "PostDate": "18/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 14, 2011 06:22PM annielynn wrote: Thank you ladies for all the kind words.  Happy Valentine's Day to all of us!",
      "MessageIndex": 550,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 7, 2011 12:19AM annielynn wrote: Hi Jan ladies. I had BMX and BSNB and TE Jan 25th. I stayed two nights in hospital with my wonderful daughter right by my side. My path reports say I am cancer free now so great news. I am still using the pain meds though sparingly. I get weepy about once a day for a good cry but am trying to keep a watch on that. I think after PS removed my bandages I was most affected by the way I look. I avoid mirrors for now. Hopefully get my drains out tomorrow when I see BS. This board has been a big comfort and thank you all for sharing.",
      "MessageIndex": 483,
      "PostDate": "07/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 9, 2011 01:46PM annielynn wrote: Hi ladies..had my BMX on Jan 25th with 3 SN on left and 2 on right. I was feeling a bit bettter but something strange happened yesterday. I saw my PS for my first fill today and he thinks I popped a stitched clapping for my DD at her bb game last night. The fill went fine..I was totally numb to it. He had filled 60cc when I had BMX and TEs so I'm up to 120cc. I would like to be a small C or B+. I was a E so you can imagine the thrill for me to go small. I am anxious to give my numbers to whippet mom and see her thoughts. I still have my drains..maybe tomorrow! I'm glad to be a Jan buddy.",
      "MessageIndex": 516,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "annielynn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115999/profile",
      "Content": "Feb 11, 2011 08:31PM - edited Feb 12, 2011 11:54AM by annielynn",
      "MessageIndex": 542,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    }
  ]
}