{
  "AuthorID": "AnnieLNZ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286531/profile",
  "Posts": [
    {
      "AuthorID": "AnnieLNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286531/profile",
      "Content": "Apr 1, 2019 02:14PM AnnieLNZ wrote: Thanks :)",
      "MessageIndex": 2,
      "PostDate": "01/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870740",
      "Title": "Anyone here had a pleurodesis...? AnnieLNZ AnnieLNZ"
    },
    {
      "AuthorID": "AnnieLNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286531/profile",
      "Content": "Apr 2, 2019 02:50PM AnnieLNZ wrote: Thanks Bestbird :) I've had three thoracentesis to date so now the two options being discussed are an indewelling catheter and pleurodesis. I'm due to see the respiratory specialist tomorrow morning NZ time and expect I'll go with the catheter. Best Annie",
      "MessageIndex": 6,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870740",
      "Title": "Anyone here had a pleurodesis...? AnnieLNZ AnnieLNZ"
    },
    {
      "AuthorID": "AnnieLNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286531/profile",
      "Content": "AnnieLNZ wrote: Hi First I want to say thank you - I was diagnosed with MBC in Feb 2019 after 11 and a bit years from first diagnosis. After the initial shock - I meant hello did any of us expect this! I got busy and found this awesome forum which has made me feel far less alone and frightened :) I've got liver, lung and bone mets. Started Letrozole (Femara) six weeks ago. Bloods including liver tests are now normal, tumour markers have been trending down. Today's CT scan showed tumours stable, but fluid still building in pleural cavity (I've had two thoracentesis prior to CT scan). MO suggested as fluid is still building a lot that maybe we should look at pleurodesis... I'm due to see him tomorrow to discuss but thought I'd check and see if anyone here had had a pleurodesis... Thanks :) Annie Dx 10/2007, IDC, Right, 1cm, Stage IIIA, Grade 3, 3/14 nodes, ER+/PR+, HER2- Surgery 11/25/2007 Lymph node removal: Underarm/Axillary; Mastectomy: Right Radiation Therapy 6/2/2008 Whole-breast: Lymph nodes, Chest wall Hormonal Therapy 6/8/2008 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Dx 2/2019, IDC, Stage IV, metastasized to bone/liver/lungs, ER+/PR+, HER2- Hormonal Therapy 2/19/2019 Femara (letrozole) Chemotherapy Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxol (paclitaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870740",
      "Title": "Anyone here had a pleurodesis...? AnnieLNZ AnnieLNZ"
    },
    {
      "AuthorID": "AnnieLNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286531/profile",
      "Content": "Apr 1, 2019 07:19PM AnnieLNZ wrote: Thanks Sadiesservant :) I've been speaking with my MO plus the Respiratory team today and am due to have a consult the day after tomorrow re whether I go with a catheter (apparently they use one called 'Rocket' here in NZ, but said it's the same as PleurX) or pleurodesis. If I choose the former I should be able to get it put in that afternoon! I'm reasonably relaxed about a temporary drain - I had one after my mastectomy and you just kinda get used to it. And like pretty much everyone on here you get used to various needles and whatnot being poked into you. Plus anything that helps with the breathlessness has to be a good thing! Thanks again for your response - I hope all is going well for you. Best Annie ",
      "MessageIndex": 4,
      "PostDate": "01/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870740",
      "Title": "Anyone here had a pleurodesis...? AnnieLNZ AnnieLNZ"
    },
    {
      "AuthorID": "AnnieLNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286531/profile",
      "Content": "May 31, 2019 04:45AM AnnieLNZ wrote: Hi from New Zealand - diagnosed Stage III 2007 / Mets to liver, spine, pleura 2019",
      "MessageIndex": 665,
      "PostDate": "31/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "AnnieLNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286531/profile",
      "Content": "AnnieLNZ wrote: Hi there I had an IPC (Pleural Catheter) put in almost three weeks ago and have been having it drained every 2-3 days. From draining at least a litre each time, the volume started to reduce & the last two drainage attempts produced less than 50mls. Yay! However today I drained a litre - it was slow going and took around 45 minutes before it stopped. My question is has anyone else with a pleural effusion had this - the fluid reduce, stop and then start again? My CBC bloods are good, and my tumour markers are trending down. And I've had no trouble with breathlessness. I'm due to see respiratory specialist on Monday but just thought I'd check and see if a fluctuation in fluid has happened to others. Thanks Annie Dx 10/2007, IDC, Right, 1cm, Stage IIIA, Grade 3, 3/14 nodes, ER+/PR+, HER2- Surgery 11/25/2007 Lymph node removal: Underarm/Axillary; Mastectomy: Right Radiation Therapy 6/2/2008 Whole-breast: Lymph nodes, Chest wall Hormonal Therapy 6/8/2008 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Dx 2/2019, IDC, Stage IV, metastasized to bone/liver/lungs, ER+/PR+, HER2- Hormonal Therapy 2/19/2019 Femara (letrozole) Chemotherapy Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxol (paclitaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/871320",
      "Title": "Pleural effusion question AnnieLNZ AnnieLNZ"
    },
    {
      "AuthorID": "AnnieLNZ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286531/profile",
      "Content": "May 31, 2019 06:21AM AnnieLNZ wrote: Since being diagnosed in Feb this year (almost 12 years after initial diagnosis - what the!?!) I've come to believe that MBC needs better and more psoitive publicity. Back in '07 when I was diagnosed my only experience/knowledge of a cancer diagnosis was that it meant you would die. I think for many people that was their view. In the years since I feel there has been so much publicity about new drugs & survivor stories (esp. breast cancer pink ribbon stuff - ugh don't get me started on that) that general perceptions have changed to a BC diagnosis being something that can be \"battled & won\". However, MBC is still seen as something to be whispered about, something that no-one wants to talk about as there is no \"cure\". People don't like uncertainty. But as many of you know MBC while less than ideal (what an understatement) is something that can be managed and many women do live with it while maintaining a good quality of life. The thing I struggle with most is the people who treat me with kid-gloves and you can tell they are seeing you as a dead person walking. Please just see me as a normal person who has a chronic disease. I'm currently fit & healthy & am trying super hard to treat cancer as just a part of who I am - ie. just like I have blue eyes, a wonky shoulder, etc. Don't get me wrong - there are times when it is super awful and scary & I just want to curl up & cry, but overall I am trying to live my life as best as I can. Case in point - the past fortnight I've felt great, zipping about doing all my usual stuff, great blood test results, then this evening I get an inconclusive CT report so now have to wait until earlier next week to find out if the new spots on my spine are good spots (as in healing) or bad spots (as in cancer). The worry never really leaves you does it....",
      "MessageIndex": 74,
      "PostDate": "31/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870522",
      "Title": "Myths/Misconceptions about MBC- please share with us! Moderators Sparkles2_2"
    }
  ]
}