{
  "AuthorID": "Annie54",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
  "Posts": [
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "May 28, 2013 08:31PM - edited May 28, 2013 08:33PM by Annie54 Hi Alibeths, The treatment itself is not bad. As I have said on other boards...I think of it as a \"spa day\" as I'm stretched out on a heated recliner with warm blankets, offered food and drink, fussed over by the nurses, and get to watch netflex movies on my computer. Even get a nap in! At our cancer center they infuse you with the \"pre-meds\" before the chemo drugs and they usually include anti-nausea meds, steroids, benydral and ativan which is also an anti-nausea drug but also an anti-anxiety med. Believe me, you are feeling pretty floaty during the procedure - that is why they want someone else to drive you home afterward. I asked them in subsequest infusions to lower the benydral as I showed no allergic reaction to the chemo and I wanted to be clear headed enough to drive myself home. They were happy to do that. My onc had me start taking pre-meds that he perscribed the day before chemo. These included a steroid, claritan (for bone pain from neulasta shot given day after infusion), and an over the counter anti-acid (Prilosec or Zantac). I take the steroid the day before chemo and then for 3 days after chemo.I take Zofran starting the day after chemo for 3 days for nausea to be piggybacked with ativan and or compazine if I need more nausea control. Honestly, the Zofran worked great and I was never nauseated so I didn't need additional meds for that. I did take the Ativan (my new best friend) at night to help me sleep. The steroids can have you wide awake all night otherwise. Indigestion was my one of my worst SE and rolaids took care of it but I'm now taking the anti-acid daily to try and beat it to the punch. I also took stool softeners starting the day before chemo and for a week after to counter any constipation and had immodium on hand when I had a couple of days of diarrhea. After a week I was able to stop all the meds except claritan which I kept using due to my allergies. I know it sounds like a lot of pills and a confusing regimine...but its really not bad once you've been through one round. Everyone is different to how they react to chemo and the pre-meds but it is doable and I've found not nearly as scary or horrible as I was anticipating. You can do this! Ask you onc about pre-meds - he should be perscibing them for you with a schedule of what to take when. Make sure he gives you ativan! As good as any xanax I've taken! Good luck!",
      "MessageIndex": 1,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/805347",
      "Title": "The night before chemo????? Alibeths Alibeths"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "May 24, 2014 06:09AM Annie54 wrote: Conrats Momand2kids! Well done....a long journey but you have arrived at the other side. Enjoy the accomplishment!",
      "MessageIndex": 1,
      "PostDate": "24/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/821352",
      "Title": "All Done!!! momand2kids RaiderGirl"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "May 29, 2013 10:33AM Annie54 wrote: Yes, I got a perscription from the doc for the steroids, 3 anti-nausea meds including ativan the week before my first treatment. I bought over the counter meds myself for indigestion, claritan, immodium, and stool softener. Saline spray is also good because your nose dries out. Hope that helps!",
      "MessageIndex": 5,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/805347",
      "Title": "The night before chemo????? Alibeths Alibeths"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Oct 13, 2013 05:16AM Annie54 wrote: I did chemo and afterward all my blood counts started recovering. Two weeks into radiation, my WBC began dropping - but my MO said he wasn't worried. I assume this means it's a normal thing during radiation. Hope that helps! Annie",
      "MessageIndex": 2,
      "PostDate": "13/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/812774",
      "Title": "Anyone have WBC drop with radiation Amoc1973 Annie54"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Oct 29, 2013 08:24AM - edited Oct 30, 2013 04:25AM by Annie54 I had a 2 week break between the end of chemo and rads. I was feeling good when I started rads and just finished today (yah!) No real fatigue to speak of except I fell asleep a little earlier every night - but felt fine during the day. Worked all the way through. Good luck - you'll be surprised how easy radiation is compared to chemo....it was for me anyway. Annie",
      "MessageIndex": 3,
      "PostDate": "29/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/813723",
      "Title": "question about radiation treatment lovewins lovewins"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Sep 20, 2013 06:57AM Annie54 wrote: Most likely 14 to 21 days after first infusion. Mine started at 21 days and never completly fell out -but I did lose most of it. ",
      "MessageIndex": 19501,
      "PostDate": "20/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Dec 29, 2013 10:21AM Annie54 wrote: Thanks for posting Nora - WOW your hair is gorgeous! Gives me hope as I've only about an inch of hair 4 months pfc. Patience patience!",
      "MessageIndex": 19776,
      "PostDate": "29/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Jan 4, 2014 10:44AM Annie54 wrote: I'm like you Nancy - my hair is growing in all directions but mainly straight up! I've got what my kids call a fauxhawk. No bangs whatsoever. Guess I'll just have to spike it with gel until its heavy enough to fall over into bangs. Sigh.......",
      "MessageIndex": 19804,
      "PostDate": "04/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Mar 1, 2014 08:27AM Annie54 wrote: Wow jojo- I'm 6 months out from chemo and while I have about 2 inches of hair - it is poking up in all directions and just looks crazy! Your picture reminds me I won't have to wait too terribly long for normal hair.......and I want the exact same hairdo as you! Thanks for posting.....",
      "MessageIndex": 20041,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Jun 25, 2014 07:02AM Annie54 wrote: I had TCH chemo (Taxotere, Carboplatin, Herceptin) and finished up last August. I kept my bald head for 6 to 8 weeks before I started to get some fuzz. I was told that with TCH, hairgrowth isn't evident for a month or two whereas if you have ACT chemo, hair growth begins before you finish chemo - just a different cocktail! Now at 10 months PFC I've got a very full and thick 3+ inches of hair. It is growing a bit slower than usual....1/4 inch per month versus 1/2 inch per month...but am hoping it speeds up as things go along. Annie",
      "MessageIndex": 20497,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Jun 25, 2014 06:13PM Annie54 wrote: Hey lago...hope you are right! I finished the big H on May 12th so am expecting to see flowing locks by Christmas :)",
      "MessageIndex": 20500,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Jun 30, 2014 06:54AM Annie54 wrote: Lorbgoo - my hair came back in whitish gray in the beginning but quickly turned darker. I normally have light brown hair and was beginning to have lots of gray at the temples before my dx. Its now about 3 inches long and is back to my original color...and surprise! hardly any gray. Happy about that! Annie",
      "MessageIndex": 20531,
      "PostDate": "30/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Dec 18, 2013 06:28AM Annie54 wrote: Hi All Question for you ladies that are growing or have grown your hair back. I'm 4 months pfc and have good head coverage with about 1/2 to 1 inch of hair. Problem is I also have some major \"face fuzz\" down the sides of my face.....almost looks like mutton chop side burns. Yikes! Has anyone else experienced this? Not sure if it will eventually go away or if I need to start shaving !!!!! Annie",
      "MessageIndex": 19757,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Dec 18, 2013 01:09PM Annie54 wrote: Thanks Jeannine! Good to hear it eventually goes away - just looks and feels so weird. Sigh....one more thing to wait out! Annie",
      "MessageIndex": 19759,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Aug 21, 2013 12:25PM - edited Aug 21, 2013 12:27PM by Annie54 Hi Maureenb, We have basically the same diagnosis except my tumor was larger at 3.1 cm (stage IIA ER 100%+, PR 60% Her2 2.8+; clean margins, no postive nodes)). I'm having #6 of my TCH tomorrow (Yea done!). I asked the onc about 4 vs 6 treatments as a curiosity because I had read on these boards some gals were doing 4. He told me he always does 6 treatments for his patients - which was fine by me because I want to throw as much at this beast as I can. Perhaps your onc recommended 4 because of the small size of your tumor. For very small tumors they will let you forgo chemo all together. HER2+ is a sneaky aggressive cancer though and I was told because of it I would be doing the full chemo.",
      "MessageIndex": 7,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/782191",
      "Title": "4 TCH vs 6 Eileenohio Annie54"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Nov 12, 2013 07:31AM Annie54 wrote: Hi all, Here is a link from the first page of this thread. I've referred to it often! I think the photos are taken a week apart and must of been started a few weeks after the end of chemo (6 weeks maybe?) when hair growth begins. http://www.karinstack.com/images/hair/HS_grid.jpg I had Taxotere and didn't have any growth for 8 weeks after chemo. Now at almost 12 weeks I have a thin covering of dark hair all over. Yea! Hoping it grows faster now! Annie",
      "MessageIndex": 19649,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Jan 4, 2014 04:00PM Annie54 wrote: I know what you mean....I think I look like death warmed over. I never wore much make-up before but am reconsidering that now. I look so washed out ...and with this crazy bristly hair- thinking maybe I could improve things with some rouge and lipstick!",
      "MessageIndex": 19806,
      "PostDate": "04/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Aug 1, 2014 08:47AM Annie54 wrote: I had the peach fuzz on my face also...down along the sides from ear to chin. Very weird looking!  It eventually went away though after a few months. I know some women shave it with the slender electrical razors you can buy for $10 at Target etc. I just waited it out until it faded away. I'm 11 months pfc and have about 3 inches of hair on my head but haven't seen the face fuzz for about 6 months! Annie",
      "MessageIndex": 20742,
      "PostDate": "01/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Jan 18, 2014 09:09AM Annie54 wrote: So sorry about your Mom's progression Katie. They have many treatment options for mets these days so hopefully they can stabilize her and deal with her pain successfully. Care-taking someone going through a major illness is difficult and draining. I nursed my brother who had HIV many years ago and can relate to how hard it is...especially with a loved one. Be sure and take care of yourself.....taking breaks when you need to. There is a thread on these boards for caretakers - it may be helpful for you. Big hugs for you and your mom. Annie",
      "MessageIndex": 1,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/817057",
      "Title": "My mom is stage IV katyand4 katyand4"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Oct 17, 2013 03:22AM Annie54 wrote: I was told nothing on breast for the 4 hours before radiation. I would lube up at night before bed, take a shower in the morning and wash off any residue. My appt was at 10:10 am so I would wait to put the cream on right after my rad treatment, and then lube up again in the late afternoon - so around 3 times a day. Annie",
      "MessageIndex": 3,
      "PostDate": "17/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/812904",
      "Title": "Radiation Skincare Check List palmbreeze dlb823"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Nov 3, 2013 07:40AM Annie54 wrote: Ogicam, Check out the video blog of Christine Newman on Youtube. She also went alternative after surgery for breast cancer and blogs about the process. Unfortunately, she had mets within a year or two of dx and only then did she undergo chemo and radiation in an effort to save her life. Her prognosis is grim. Enough said. Annie",
      "MessageIndex": 8,
      "PostDate": "03/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/813944",
      "Title": "Don't make rush decision based on doctors urgency Ogicam ziggypop"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Dec 15, 2014 01:05AM Annie54 wrote: Hi all, I\"m 16 months post chemo and have the same problems as you describe. I do a lot of financial analysis and writing in my job and have been able to keep doing that. I do have to go over the math several times to make sure its right though! My biggest problem is the day to day stuff...remembering names, what I did yesterday or even an hour ago! It seems my perception of time is way off also. I'll think something happened a year or two ago and find out it was only a few months back. Yikes! Like floating down a river with no anchor. I recently had a 6 month check-up with the doc and complained about all the SE's I was having.... including short term memory loss. So she is letting me have a month break from Anastrozole to see if that helps at all. Surprisingly, within 4 days of stopping the AI, a \"weight\" lifted from my brain and psyche and I felt much more like my pre-bc self. I knew it was hard to get through each day physically but had not realized that there was such a mental component to it. My kids tell me I seem much happier now - since they see me car dancing to the goo goo dolls when taking them to school :) My doc suggested I start doing easy crossword puzzles (not the NY times!) as you have to \"reach back\" in your brain to find the answers. She says that helps retrain your brain to access words from your memory. That makes sense to me so I've started doing just that. I'm also going to enjoy the last couple of weeks of my vacation from the AI.....sigh, still have at least 4 years to go on it but I'm going to insist on an anti-depressant to go along with it. Annie",
      "MessageIndex": 44,
      "PostDate": "15/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778062",
      "Title": "Cognitive and/or learning difficulty post-chemo horsedoc burlenek"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Dec 2, 2013 04:22PM Annie54 wrote: Jen - Love your photo! Having a good sense of humor will take you a long way through this process. I'm not too far ahead of you....was dx in March of this year and have now finished most of my treatment (Herceptin until May 2014). You will find much information and wonderful support here on the boards. Waiting is the hardest part of this journey however once you have a treatment plan in place, it all calms down so hang in there! My fathers family was from Montana and I graduated from U of M in Missoula. Also had a cabin on Flathead lake for many years. Absolutely my favorite place on earth! Annie",
      "MessageIndex": 3,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815245",
      "Title": "I was just diagnosed with Breast cancer on Nov. 19th JenfromMontana mapgirl12"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Aug 12, 2013 07:59PM Annie54 wrote: Thanks 6cats, I actually had an echo done 2 weeks ago - with a score of 65...so I'm good! Onc felt the shortness of breath was more from lower platelet count. Told me I just had to soldier through my last treatment and everything would improve from there. Annie",
      "MessageIndex": 1552,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Oct 4, 2013 06:02AM Annie54 wrote: Catbuster, I also had pre-existing neuropathy in my hands (for years) - which would go totally numb at times. I was concerned about chemo (TCH) also and whether it would make it worse. Asked the doc who said he didn't think it would be a problem - and he was right. My numb, tingling fingers actually went away during chemo for the most part. I did have some slight tingling in the finger tips during the last half of chemo and still have it now 6 weeks pfc - but it is getting better and I hope its gone in a few months. But overall, my neuropathy is much better post chemo than before. Good luck! Annie",
      "MessageIndex": 2,
      "PostDate": "04/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/812210",
      "Title": "Pre-existing neuropathy Catbuster Annie54"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Nov 24, 2013 01:52PM Annie54 wrote: I am 59...diagnosed this year. Doctor told me the average age for BC dx is 61.",
      "MessageIndex": 115,
      "PostDate": "24/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Oct 16, 2013 02:31AM Annie54 wrote: I use what the RO gave me.....At first, Radiaplex gel and then Biafine creme when I developed some radiation dermetitis (itching!) on my chest. She's not a big fan of aquaphor as she says it clogs up in the pores. She ok'ed it for night time use as long as I washed it off in the morning. I also use pure aloe from the plant. I found a large aloe leaf (2 ft by about 6 inches) at whole foods in the produce section for $3.99. I cut a big chunk, strip the skin from one side and put it all over my breast. It has no smell and sinks into the skin fast. Must be helping because I've done 23 of 25 whole breast radiation treatments and will start my 8 boosts on Friday...... my skin is pink....nipple has turned gray in color with large brown freckles on it and my under arm is a bit sore - but otherwise I've done well. No major pain or fatigue. RO said skin could keep changing for 2 weeks past radiation (peeling etc) but should calm down and be getting back to normal at 1 month posts rads. Good luck! Annie",
      "MessageIndex": 1,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/812904",
      "Title": "Radiation Skincare Check List palmbreeze dlb823"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Jan 4, 2014 03:51PM Annie54 wrote: I was lucky and able to work all the way through chemo. My job entails lots of math and analysis so I was worried about being able to think straight enough to do my job well. I won't lie, my brain did get \"fuzzy\" and my short term memory was shot (still is 4 months pfc :() but I was able to maintain my work load - without making a lot of mistakes! I did have to go over the math several times to insure the results were correct but I haven't had any of my clients, bank reviewers, come back with any concerns....so I must of done OK!",
      "MessageIndex": 4,
      "PostDate": "04/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816441",
      "Title": "Chemo Brain - Experiences? Ideas? paloverde ProudMom_Wife"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Nov 3, 2013 07:00AM - edited Nov 6, 2013 05:04AM by Annie54",
      "MessageIndex": 2,
      "PostDate": "03/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813964",
      "Title": "2003, 2004, 2005.....and before ? Mamita49 LizLemon"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Jun 3, 2013 01:53PM Annie54 wrote: Ring that bell loud Jen & Katie!",
      "MessageIndex": 1182,
      "PostDate": "03/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Jun 20, 2013 09:24PM - edited Jun 20, 2013 09:25PM by Annie54 I've found that my taste buds are out of whack for a week or so after treatment and then come back. While the taste buds are funky I eat alot of soups, dill pickles and watermelon. These seem to taste the best to me....and anything spicy. Chinese food also tastes good so maybe try some spicey Kung Pao chicken! Hopes this helps! Annie",
      "MessageIndex": 1348,
      "PostDate": "20/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Dec 7, 2013 09:41AM Annie54 wrote: flopsy, My eyesight has declined due to chemo also. I wear reading glasses and went from 1.75 to 2.50 during chemo. Doc said that was normal and my eyesight would improve over time back to where it was pre-chemo. I hope he's right! Also, I didn't have the infamous \"taxotere tearing\" during chemo....but it came on like gangbusters after chemo was finished (4 months ago) and I still have tears running down my face most days. Have to lay off the eye makeup as everything smears and runs! I didn't have eye pain, but my eyes stung a lot in the mornings so I put lubricating eye drops in - which helped. I had excellent eyesight before dx and am pissed how blurry everything is now, Trying to be patient for the world to come into focus again. Annie",
      "MessageIndex": 1,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815457",
      "Title": "Eye problem flopsy badger"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Nov 3, 2013 09:57AM Annie54 wrote: Sorry, did not mean to offend anyone",
      "MessageIndex": 9,
      "PostDate": "03/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813964",
      "Title": "2003, 2004, 2005.....and before ? Mamita49 LizLemon"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Oct 25, 2013 07:24AM Annie54 wrote: Dean - I had Taxotere also, 6 treatments finishing up 9 weeks ago. I wont lie to you, the last three treatments were the hardest. Lots of fatigue, indigestion, no taste buds. I felt like I was crawling across the finish line. But I want you to know that within 1 month after chemo I was feeling 100% better....not all at once but a little better each day. I have had some \"latent\" SE's which have shown up after finishing chemo (Taxtoere is famous for these)....such as toe nails falling off and some finger and toe nueropathy. None of which have been too bad though. My energy is almost back to normal and I feel good again - so it does get better. I know its tough when you are in the middle of treatment to believe that. We are here for you - ask any questions you'd like and we will surround you with love and support. Annie",
      "MessageIndex": 2,
      "PostDate": "25/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/813520",
      "Title": "Quality of LIFE vs. Quantiy? DeanGudmundson Annie54"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Aug 12, 2013 01:41PM Annie54 wrote: Koru, I have one more TCH treatment and an pretty much the same place you are. Just so sick and tired of the effects, the waiting to feel better, to feel normal again. In the 2 years before my dx I had embarked on a fitness program of running, strength training, pilates etc. I did some physical activity every day, lost 50 ilbs and got in great shape. Felt on top of the world.....and then BC. I do think being in good shape helped me in the long run with chemo and SE's as I've had minimal ones and have been able to work every day. But now here at the end, I've gained 30 lbs back and the fatigue is so strong that all I can do is sit and wait until I'm done with chemo before getting active again. I can't even walk now due to shortness of breath. Oh to lace up my running shoes and hit the trails! That's what I focus on being able to do and feel confident that I'll bouce back quickly. But it can be very depressing having to wait while feeling like a blob with muscle aches who cant walk across a room without breathing hard! Heres to finishing the race and getting back to our pre-treatment selfs....or at least to a \"new normal\" for us. I've been told the months in treatment will seem like a dream at some point and hard to remember specifics.......I hope so! Hang in there....we've made it this far with not much farther to go. We'll be OK Annie",
      "MessageIndex": 1547,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Annie54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177770/profile",
      "Content": "Aug 3, 2013 04:00PM Annie54 wrote: Hi Dennis, The HER2 postive is the trump card...very agressive and sneaky cancer. I've known women (some on these boards) with no node involvement that end up having a re-occurence with mets.....so benign nodes are no guarentee. I've been told that Her2 positive re-occurance usually happens in the first 2 years after diagnosis. It is a personal decision but I would throw everything you can at the beast now - because down the road you don't have the choice anymore. Herceptin is a life saver for many of us Her2 positive gals but it doesn't always do the complete job. If you have more in the arsenal, I'd go for it! Annie",
      "MessageIndex": 1,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/808762",
      "Title": "Cancer free after surgery, is chemo still required? dltvlt ruthbru"
    }
  ]
}