{
  "AuthorID": "AnnieBear",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
  "Posts": [
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Jun 26, 2012 07:20AM AnnieBear wrote: It is hard to find information on this subject.  I had a ductal excision a few months ago and had no problem at all with the recovery.  They suspected a papilloma too but mine turned out to be inflamed ducts.  Not sure why, but ....  They didn't wrap me in an ace bandage or anything - I just went home and continued life, putting some ice on it but there really wasn't any pain.  My scar is under the nipple.  Don't worry at all, you will be fine.",
      "MessageIndex": 7,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789125",
      "Title": "Duct excision victoriah68 sunedaze-52"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Mar 9, 2012 11:56AM - edited Mar 9, 2012 12:07PM by AnnieBear Joanne - I received that same Monkees album at Christmas 1968 and I still have it ! ! ! !  My fantasy crush when I was a kid was John Lennon, followed by George Harrison, and then Jim Morrison.    This was such a fun thread to read through.  I am 58 and I remember all of them - Bobby Sherman, Sajid Kahn, Chip Douglas ! ! ! !   and his little brother Ernie - I had a crush on him too.   And Kurt Russell - yep - still have a crush on him. My first two crushes were when I was about four years old - Popeye and Mo from the Three Stooges ! ! !  What does that say about me ! ! ! ! !",
      "MessageIndex": 126,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783491",
      "Title": "Davy Jones of the Monkees CoolBreeze AnnieBear"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Jul 16, 2010 01:33PM AnnieBear wrote: Hi!  I've been reading this board since I was diagnosed with DCIS but this is my first posting. I'll be starting radiation therapy too this month.  This whole journey has been overwhelming - so much contradictory information.  Even among the doctors I've seen.  But, I feel very blessed to have my cancer found early and to have it be very treatable.  I'll be doing radiation therapy (28 treatments and 8 boosts) and also Tamoxifen for the next five years.  I'm also waiting to see if I am HER2 positive.  Ahhhh... always something.  Good luck to all of us July gals (and guys, if there are any).... May our side effects be few. ",
      "MessageIndex": 71,
      "PostDate": "16/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "AnnieBear wrote: I am sure this is the dumbest thing anyone has posted on this board, but I am wondering if anyone had a tattoo done while undergoing radiation therapy.  Not the radiation tattoos but a tattoo for yourself?   I have an appointment to have a tattoo in September, but I won't be done with rads then and I am wondering if it is a good idea to upset my immune system anymore by having a tattoo then?  Thanks. Dx 4/2010, DCIS, Stage 0, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/756546",
      "Title": "Getting a Tattoo AnnieBear JaneyJohn"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Jul 30, 2012 10:13AM AnnieBear wrote: Pam - I was scared too of radiation and it turned out to be a breeze.  I wasn't tired at all and yes, they protect your thryoid.  I am very pale-skinned and I used a lot of lotion on my boob, several times a day and I was fine.  Do not worry.  I read so many scary things about it but the technicians put me at ease during my fist visit and they were so wonderful.  Good luck!",
      "MessageIndex": 1,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/791311",
      "Title": "Scared of radiation - how bad is it? pamelahope proudtospin"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Jun 27, 2017 02:35PM AnnieBear wrote: My question too is about DCIS turning into Stage IV. I keep reading that it is impossible, yet I see people that it happens to all the time. How is it possible for DCIS to become Stage IV. I worry every time i have a back-ache that I have it. Thanks for your answers.",
      "MessageIndex": 4117,
      "PostDate": "27/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Aug 27, 2013 08:52AM AnnieBear wrote: AWB:  I was going to say the same thing you said.  Mom - do not worry - 90% of the time they are benign and the biopsy is not bad at all.  I had a lot of bruising afterwards though which they don't bother to tell you about.  Good luck.",
      "MessageIndex": 4,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/809838",
      "Title": "Stereotactic Needle Biopsy MomOf3AwesomeKids MelissaDallas"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Jan 18, 2012 04:24PM AnnieBear wrote: Melly T.  Thank you so much for starting this thought provoking thread - I've enjoyed reading everyone's comments.  It's funny that I came upon this today.  For the past few weeks I've been giving this subject a great deal of thought.  I had DCIS two years ago and had a lumpectomy.  Recently I've had a lot of nipple discharge and I had to advocate for myself to get someone to listen and take this seriously.  I first went to my gyne and he said it was nothing to worry about, then visited my radiation oncologist (only because her office is close by) and she said it was nothing to worry about, then I faxed the results of an ultrasound my gyne had ordered to my breast surgeon's office.  A P.A. read it and said it was probably just the seroma that I still have  from the lumpectomy draining out through the nipple and not to worry about it.  None of those three answers were very reassuring for me so I made an appointment with the breast surgeon - saw him yesterday and he said it's definitely not normal and it's something to take very seriously, although he feels it could be the same thing.  But, he's going to do a lot of testing on Monday - MRI with contrast, MRI without contrast, Ultrasound, Mammogram, and a fine needle aspiration biopsy.   Whew.  I'm 58 and back in my twenties, thirties and forties I definied myself by my breasts.  The thought back then of losing them was so overwhelming and scary.  No longer.  I don't even want them anymore and this has thrown me into a quandry - I wondered if maybe I was becoming a Chaz Bono but I stopped and realized that NO, I am still a woman and want to be a woman and just because I might not have breasts it does not make me any less a woman.  Chaz was born into the wrong body, I wasn't.  I applaud him so much for being willing to make the changes to his body that will make him a happy man.  When the doctor said yesterday that since I've had a lumpectomy and radiation the next step (if the test results are not good) would be a mastectomy and I said, No big deal.  His P.A. was shocked and said I was handling things very well.  Since being diagnosed two years I've given the breat issue a lot of thought.  I'll still be me without them and quite frankly, I'm sick of them ! ! !  They are large, they get in my way, and I would have a beautiful chest tattoo done if I did lose them to cancer.   ",
      "MessageIndex": 88,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Jun 28, 2017 02:28PM AnnieBear wrote: Cive and Deanna - Thank you for your answers. I appreciate your comments. Take care. ",
      "MessageIndex": 4122,
      "PostDate": "28/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Jun 19, 2015 10:02AM AnnieBear wrote: I have a question that I just don't understand.  If a person has a double mastectomy - how does the breast cancer come back in the breasts?  Aren't they gone?  I've wondered this for a long time and maybe I'm missing something.  Thanks ladies for your input.  ",
      "MessageIndex": 3034,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Feb 5, 2015 02:45PM AnnieBear wrote: Hi!  I'm not Stage IV so I hate to intrude, but to me a bucket list means things that you have always wanted to do but haven't done yet.  I think it's that simple.  Maybe you've always wanted a tattoo - that could be on the list.  Or a trip to Florida.  Or cleaning out the attic.  Whatever YOU want to do should go on your list. ",
      "MessageIndex": 2,
      "PostDate": "05/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828214",
      "Title": "Bucket List- what did you include? Maureen813 Maureen813"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Feb 6, 2013 10:51AM AnnieBear wrote: Yep - almost three years out I still have pain where I had the lumpectomy.  If one of my cats jumps up while I'm lying down and hits my boob, the pain is excruciating.  I'll get sharp pains through there sometimes, sometimes it's a dull ache.  There are so many things that we aren't told when we get cancer - you really have to research everything to know what might happen.  I had a ductal excision last year and no one told me the scar tissue would pull my nipple into my body - if I'd know scar tissue was going to build up I would have tried to prevent that.  It's sad....",
      "MessageIndex": 8,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "AnnieBear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105206/profile",
      "Content": "Jul 25, 2011 02:57PM AnnieBear wrote: I am so sorry - it is so shocking to hear and until I was diagnosed I had no idea about the different kinds, different treatment options, etc.  I immediately got on the internet and did research and I also went to the library and checked out about 15 books.  I will hold a good thought for you.",
      "MessageIndex": 9,
      "PostDate": "25/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772033",
      "Title": "Very confused and scared maggiestatas AnnieBear"
    }
  ]
}