{
  "AuthorID": "AnnTop",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141064/profile",
  "Posts": [
    {
      "AuthorID": "AnnTop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141064/profile",
      "Content": "Jan 6, 2012 12:31PM AnnTop wrote: Hi, everyone\"  I just learned yesterday that I'll be doing TC x 4 starting on January 19. The size of my tumor (4 cm) tipped me into chemo, as advised by my MO. I won't have to do radiation but will follow up with Aromatase after chemo. My recovery from BMX with TEs (done 12/20/11) has been much better than I thought, but now I'm freaking over the chemo. I just ordered a couple of wigs, but the idea of the hair loss makes me pretty sad. I wish all of you well, and I'm glad I have the community.",
      "MessageIndex": 258,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "AnnTop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141064/profile",
      "Content": "Jan 12, 2012 08:00AM AnnTop wrote: Hi, Ladies: I'm joining you on Jan 19 -- I'll be getting TC x 4, on a three week schedule. Reading your tips and insights have been helpful, but of course I'm anxious about how I'll react to everything. I'm getting a very short haircut the day before my first treatment and I've ordered a wig and a hairpiece to go with hats. I'll try the olive oil treatment that rachelk recommends to protect my mouth and I hope to keep up my long walks in the neighborhood -- they really helped with my recovery from the BMX with TEs that I had on December 20. Best wishes and prayers to you all.",
      "MessageIndex": 391,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "AnnTop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141064/profile",
      "Content": "Feb 1, 2012 02:19PM AnnTop wrote: Thanks so much for this thread. My hair has just started to shed 2 weeks after my first treatment. I had gotten a super short pixie beforehand, but now I'm debating whether to buzz or not. Have my wigs and hats ready. Your experiences are a big help, and I keep reminding myself this too shall pass.",
      "MessageIndex": 45,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781778",
      "Title": "How did you deal with losing your hair? taraw413 lorenar"
    },
    {
      "AuthorID": "AnnTop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141064/profile",
      "Content": "Dec 13, 2011 08:18PM AnnTop wrote: Hi, sisters. My love and best wishes to you all. I was diagnosed November 23 (Happy Thanksgiving) and am scheduled for BMX with tissue expanders on Dec 20 (Merry Christmas). No surprise that I'm crazy with worry and stressed about my job (I run a small non-profit with only one other FT employee). But at least I have friends who have been through this and survived who help my spirits, and now I've found you. I'm opting for BMX because I want to reduce me worry as much as possible. And as barely a 34B, my reconstruction/implants may be an upgrade.",
      "MessageIndex": 380,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "AnnTop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141064/profile",
      "Content": "Jan 25, 2012 04:56PM AnnTop wrote: Madison, thanks so much for your report. I was very worried before my first treatment, and still fret a bit about what SE may pop up, but you have helped me see that things can still be pretty routine. Best to you as you finish your course!",
      "MessageIndex": 26,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781514",
      "Title": "TC (Taxotere/Cytoxan) chemo Neli Lumpynme"
    },
    {
      "AuthorID": "AnnTop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141064/profile",
      "Content": "Dec 19, 2011 03:19PM AnnTop wrote: Hi, girls: I go in tomorow Dec 20 for a Bilateral with tissue extenders. I have BC in the left, but decided to go all the way so I wouldn't have to worry about the right in the future. Like CarolAnn6 I'm worried about the lymph nodes and if they'll stage me differently. But reading about your experiences helps so much. My love and prayers for you all.",
      "MessageIndex": 118,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/777059",
      "Title": "Mastectomy Dec 2011 hawaiik Blessings2011"
    },
    {
      "AuthorID": "AnnTop",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141064/profile",
      "Content": "Dec 26, 2011 02:24PM AnnTop wrote: Hi, everyone: almost 1 week post BMX with TE and what a difference a week makes! I was terrified before surgery that that they's \"find things,\" but thank the Lord, no lymph node involvement and the BS said the tumor was more like 2-3 cm rather than the oncologist-predicted 6 cm. That was the best Christmas news! Spent 2 nights in the hospital than came home -- sat up all afternoon and took a couple of very slow and very short walks. After 3 days on Percoset I weaned off on Dec 24 and went to just Tylenol on December 25. Word to the wise: oxycodone creates constipation, just as does the anesthesia -- went I went off the Percoset, problem solved and how. Hate the drains but my DH is a wonderful nurse -- but I feel like a kangaroo with this bags-o-drains handing from my corset. Incisions no longer hurt at all and just a little discomfort from the TEs 6 days after surgery. My biggest complaint is that I can't get comfortable sleeping on my back (I'm a side sleeper), and for some reason I get a little knot of pain about 15 minutes after I go to bed that tends to keep me up. So I haven't gotten a really good nights sleep yet. But my first thorough sponge bath and getting my hair washed were splendid. Today I even shaved my legs. Go to BS and PS on Dec 29 from removal of some (please, all) drains and for the final path report. Best wishes to you all, and thanks for your reports and insights. They've been a great help to me.",
      "MessageIndex": 629,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    }
  ]
}