{
  "AuthorID": "Anomie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229040/profile",
  "Posts": [
    {
      "AuthorID": "Anomie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229040/profile",
      "Content": "Feb 9, 2017 07:14PM Anomie wrote: My doctor assessed the lumps as mobile and smooth with no malignant features and has sent a non urgent referral to the breast clinic",
      "MessageIndex": 14,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841437",
      "Title": "Shocked by how seriously doc took my symptoms Anomie cliff"
    },
    {
      "AuthorID": "Anomie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229040/profile",
      "Content": "Anomie wrote: Hi, First, a bit of intro: I live in Ireland, I'm 48, single and childless. A month ago before my period my right breast got very achy. I occasionally get mild breast pain and swelling before my period but usually nothing. Because of the pain I started examining my breasts. I realised that the right one was significantly larger than the other, the nipple has moved down and it hangs down lower. The pain eased when I got my period but it has a low grade ache still. I saw my gp/physician on Wednesday, just wanting to flag the changes in my breast so he could monitor it. He gave me an exam and said he didn't find anything. I hadn't felt a lump either. However, he said just to be careful he'd send me to the breast clinic for a more thorough check. I gave him my details for the referral and was told they'd be in touch within six weeks. All fine so far. The next day I got a call from the breast clinic asking me to come for an assessment next Tuesday. That's three working days! A lot sooner than six weeks and believe me our health system in Ireland barely creaks along and delays are almost guaranteed. The doctor must have marked the referral as super urgent or something in the details made them want to investigate it very quickly. Then yesterday, examining my breast once again, I discovered that if i dig my finger deep into it towards my chest wall I can slide my finger over a firm slightly painful area, like I'm feeling the surface of a lump deep inside. It's the right breast at around 10 o'clock. If it's that deep would it show up in a mammogram? I'm nervous and clueless about what any if this means. I can't tell my family yet although I will tell them if it turns out to be serious. I feel very alone and Tuesday feels like a really long time away now. I'm glad to have somewhere to express myself. Wishing each of you the very best. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841437",
      "Title": "Shocked by how seriously doc took my symptoms Anomie cliff"
    },
    {
      "AuthorID": "Anomie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229040/profile",
      "Content": "Feb 20, 2016 06:42AM Anomie wrote: I found a lump. I knew there had to be something there to enlarge my breast. It's deep in my (large) breast but not at the chest wall. It's bigger than a marble but not bigger than a grape. I actually have a feeling of relief. Previously, I felt totally confused and at sea. Now I can tell myself that more than 80% of breast lumps are harmless. I don't fall into a high risk group. So I'm less stressed. Three sleeps until the assessment!",
      "MessageIndex": 9,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841437",
      "Title": "Shocked by how seriously doc took my symptoms Anomie cliff"
    },
    {
      "AuthorID": "Anomie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229040/profile",
      "Content": "Feb 5, 2017 01:46PM Anomie wrote: Hi, I was here a year ago with what turned out to be a fibroadenoma. I really appreciated the support you gave me. I'm back again with two lumps this time. I had pain in my right breast ten days ago before my period. It looked significantly larger than the left but it still has that fibroadenoma in there. Maybe a couple of days later I became aware of a distinctly thicker area towards the top of my breast. I let my primary care doc know and I have an appt with him in two days. However, three days ago a soft lump appeared at about the 1 o'clock position. Two days ago it had grown and become visible on the surface of my skin. Yesterday it felt like a sac with vague segments inside it, like blobs of fat maybe. I could actually see the bulge through the fabric of a t-shirt. So this is Sunday and it's much the same today. It's two days until my appointment. I'm not too freaked out this time, i won't freak out until I've something concrete to freak out about. I'm obviously still concerned and distracted. The examination can't come quickly enough for me 🤐",
      "MessageIndex": 13,
      "PostDate": "05/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841437",
      "Title": "Shocked by how seriously doc took my symptoms Anomie cliff"
    },
    {
      "AuthorID": "Anomie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229040/profile",
      "Content": "Feb 19, 2016 07:31PM Anomie wrote: Hi ladies, Thank you for the reassurance. I needed that! I'll try to consider it good fortune that I got a early appointment. My doctor actually said to me, \"I see that your breast is enlarged but I didn't find a lump. However, most breast cancers are missed at the first exam so I'm sending you for a full check up\". He didn't play it down and the urgent/non urgent symptom section of the referral form was left blank until after I'd filled in my part. When I got home I rang the cancer support line and told then them about the referral. The nurse told me what to expect on the day and said they aim to give everyone an appointment between two and six weeks after they receive the referral. With that in mind I was shocked to get an appointment so soon. In other words, I'm completely ignoring your advice and panicking here! Lol no, I'm trying hard to keep things in perspective. It could of course have been a cancellation. I'm trying not to look at or examine my breasts because I'll just drive myself crazy that way. It's after midnight here and I've just woken up from a nightmare where my elderly mother died of cancer and I was trying to comfort my elderly Dad. The thing is, my beloved father died eight years ago 😓 I've been reading your posts here and by getting more informed I'm starting to feel stronger and more in control. I think I'll try to choose somebody to tell who'll accompany me to the appt. I think I'd benefit from the backup. Thanks again, A",
      "MessageIndex": 5,
      "PostDate": "19/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841437",
      "Title": "Shocked by how seriously doc took my symptoms Anomie cliff"
    },
    {
      "AuthorID": "Anomie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229040/profile",
      "Content": "Feb 25, 2016 09:32PM Anomie wrote: Hi again, I've had my assessment and I wanted to follow up here to add to the information on the site and hopefully help someone who find themselves in a similar situation to my own. At the clinic I met the triage doctor. While he spoke to me I could read my referral upside down on his desk. It said breast asymmetry and nipple changes and had a huge red URGENT stamp on it. So I was right that they fast tracked my appointment but I'm very grateful to my GP for taking my concerns seriously. The triage doctor examined me. He could feel the lump I'd found. We sat down and he filled in a form with his recommendations. He added mobile mass to my doc's list and located it underneath my nipple but central in a diagram. He ticked the urgent box too! He sent me for a mammogram and an ultrasound. I was worried that the lump wouldn't show up on the mammogram because it's so deep. I needn't have worried. Through an open door I could see my mammogram - one breast distinctly larger than the other and a big white blob towards the edge of the image. I was pretty worried at this stage. Next I had the ultrasound. The doctor said she could clearly see the lump, smooth and rounded. She told me she thought it was most likely to be a fibroadenoma but that I needed a core biopsy to be sure it was benign. She went ahead and did that. There was no great discomfort, plenty of local anaesthetic, although she said it was a good few centimetres inside. Her report stated that the mass measured 35 mm. The whole thing took six hours. I'm to go back in a week to meet the consultant and get the biopsy results. I saw where I got an S score and an R score of 3. This must be similar to BIRADS so meaning probably benign. I'm very calm and confident that it's nothing serious. Lastly, I brought a friend with me who has been through breast cancer and she was wonderful, advising me of questions to ask and explaining procedures to me and overall being a huge support. I advise anyone not to go on your own. It's a difficult day. I'll probably pop in here next week to confirm that I got the all clear. I hope someone find this helpful. In short, I found a lump and like the overwhelming majority of lumps it seems to be harmless.",
      "MessageIndex": 11,
      "PostDate": "25/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841437",
      "Title": "Shocked by how seriously doc took my symptoms Anomie cliff"
    }
  ]
}