{
  "AuthorID": "anxiouslywaiting",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212217/profile",
  "Posts": [
    {
      "AuthorID": "anxiouslywaiting",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212217/profile",
      "Content": "anxiouslywaiting wrote: I'm very heartbroken that I've found myself back here again. Three months ago, I started having breast pain, freaked out, went to get some tests done (after bugging my gyno about it so much that he finally referred me to a radiologist). My radiologist did a 3-D mammo & an ultrasound on both breasts and armpits, told me everything was fine, and sent me on my way. ( I posted here then, as well) Since then, I've been seeing a therapist as I have an anxiety disorder and this whole scare made me sink to a whole new low. We came up with a plan that if, in three months, I'm still in pain to make another appt with my radiologist for more scans (having the mindset \"There's nothing I can do about it until May\" helped quite a bit). Lo-and-behold, the pain did not decrease. My bilateral pain decided to take homepage in my left breast (which was the more painful of the two initially) and I felt lumpiness above the nipple. My nipple itched for about a week and then subsided. The swelling in my armpit is also back (after subsiding RIGHT before my visit to the radiologist last time). I went back to my radiologist this time with confidence. I was actually about to cancel my appt because I was so convinced this was hormonal (what with the lumps & armpit swelling coming and going), but decided to go ahead with it because it was part of my plan in therapy. I told her what was going on. She did an ultrasound first (I'm 25, so they didn't want to have to do an unnecessary mammo). I explained the pain and what was going on. She said she thinks it's nothing but she wants to be as thorough as possible for me so she did a 3-D mammogram on my L breast and a magnified mammo on the specific spot that I thought I found a lump as well. She came in, reviewed my scans from this time and last time, said she found some microcalficiations (I was in so much shock that I forgot to ask for my BIRADS), but that she found them throughout my R breast as well (in my last mammo....don't know why I wasn't told of this then...it wasn't even on the report). I started crying immediately because I know microcalcs aren't good news (yes, 50% of women get them...but only 10% of women under 40 have them...the odds aren't exactly in my favor now). She said, \"Why are you crying?? You're fine!\" Then, she gave me the general \"First, b.c for your age is extremely rare and it is not typically associated with pain.\" Considering the amt of research I did the first time around, I know the pain logic is b.s. ..and since I already have microcalcs (which are RARE for someone my age)...kind of seems fitting that bc is something I have as well. She said, \"let's follow up in six months to be sure.\" (Which, again, from research, lets me know that this is likely BIRADS 3 and...people get diagnosed with that score. I understand it's a low #, but, again, I'm already in the minority here. She saw how incredibly upset I was (sobbing like a small, pitiful child) and she said that, in the meantime, I can see a breast surgeon/specialist for peace of mind. She referred me to her and said that she respects the surgeon's opinion and she is someone I can talk to who will offer me assurance and guidance until November (6mo follow up). I'm going ...pardon the french...batsh*t insane. My family has come up with every reason in the book for this to be something else. Meanwhile, I'm over here with elbow, arm, back, armpit, and breast pain and I have a sneaking suspicion that my BEST case scenario will be DCIS; although with the pain, I find that unlikely, as I'm also convinced an MRI would show a mass deep down pressing on a nerve or a muscle contributing to the pain. Of course, the pain in my arm/elbow/back has me thinking the worst (spreading to lymph nodes, bones). I had a neck MRI and shoulder MRI done in March as well. Fluid surrounding my shoulder[swelling] and two slipped discs& neck degeneration in my cervical spine. That has calmed me down, at least slightly, regarding a spread( the pain was already there in March and I had scans done showing no cancer, but slipped discs and degeneration). I just don't know how to go about this. I get trying to be positive and everything but it's like I'm drowning. I haven't been able to breathe easily or to even truly smile since this all began in March. My question is...when I meet with the breast specialist next Monday (June 1)...should I push for an MRI or biopsy? Here is a list of Q's I have ready for her...are there any other specific Q's I should ask? My mom is going with me as well to help with everything as I've been in a bit of a fog lately and thinking clearly isn't something that I'm able to do under large amts of stress. - What do the results of the mammogram indicate? What is my BIRADS score? Do I have clustered calcifications, linear, or segmental? - She mentioned to me that there are calcifications in my right breast as well. I've read that women with calcifications in both breasts are at a higher risk than calicifications in one breast and that women with any calcifications are at a higher risk than women with none. Is this true and what are my odds? - Are these, in fact microcalcifications or macrocalcifications? - Is there any indication of malignancy? - Does the mammogram show a precancerous condition? - Were there any changes from my March scans to my May scans? - Do you think a biopsy should be performed? - Are the calcifications clustered or more spread out? - In your experience, do my scans look worrisome? I know the common stat to rattle off is that 80% of biopsies are benign, but I'm already not a part of the statistic seeing as how most 25yo women don't find themselves in the situation I'm in. Up to 50% of breast cancers can be associated with calcification. - Younger breast cancer patients typically have more aggressive cancers. Is this something I should be worried about? - What are the risks and benefits of \"watchful waiting?\" If I were 50 as opposed to 25, what would your approach be? - I am incredibly active and worry that this is going to ruin my life. Do you recommend any supplements or dietary changes for something like this? - If this does have the possibility of being DCIS, shouldn't I get it biopsied sooner rather than later to try to ward off an invasive cancer? - Do you think this could be ADH, ALH, or LCIS or is it more characteristic of DCIS or worse (invasive)? - If I was not your patient, but your daughter or sister, would you recommend me wait the six months or go through with a biopsy? - Would you recommend an MRI in the meantime? - Is my elbow/back/shoulder pain worrisome? Should I get another MRI on these body parts as well? A little bit about me: 25, no history of bc, otherwise incredibly healthy, had a cancer scare at 2yo in my L-breast when it swelled considerably. After tests, etc., oncologists ruled out cancer and blamed it on hormones and advised my parents to only buy food products sans added hormones. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832032",
      "Title": "Back again :( It NEVER ends anxiouslywaiting anxiouslywaiting"
    },
    {
      "AuthorID": "anxiouslywaiting",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212217/profile",
      "Content": "anxiouslywaiting wrote: This Post was deleted by anxiouslywaiting. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/837252",
      "Title": "New study has me worried anxiouslywaiting Moderators"
    }
  ]
}