{
  "AuthorID": "Apg",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
  "Posts": [
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Dec 19, 2016 05:02PM Apg wrote: diagnosed stage 2b 2/10/16 rt mastectomy 11/22/16 stage IV mets to bones in spine and pelvi",
      "MessageIndex": 284,
      "PostDate": "19/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 2, 2017 05:53AM Apg wrote: I am in a trial at Cleveland Clinic where they are going to take a piece of my tumor and study the mutation for immunotherapy. This was where I went for my 2nd opinion. I am not being treated there however the dr is still putting me in the trial. He said it is a $5000 test I'll get done for free. It will be necessary to have done he said for any immunotherapy I do in the future! I'm very hopeful in this area of treatment. Misty",
      "MessageIndex": 9,
      "PostDate": "02/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851546",
      "Title": "Local Treatment of Residual Disease zarovka zarovka"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 6, 2017 10:37AM Apg wrote: I did yoga yesterday evening. My first time back in about 2 weeks since my oophorectomy. We just did restorative positions because I was having some sciatica issues the past couple days. I have had this problem off and on for 10+ years. I don't know if my cancer is causing it or if it is how it normally was. It feels so good to just relax and do stretches along with meditation! I plan on starting back up with Zumba soon. It will be over a year since I have went to a class. I haven't been since original diagnosis. I will have to start out easy but I'm excited to get back because it is so fun. Have a great day",
      "MessageIndex": 33,
      "PostDate": "06/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 7, 2017 10:10PM Apg wrote: I'm sorry your run didn't help MSL! I admire anyone who runs. My husband has ran a couple marathons and it made me want to try to run but I just never could do it. It was always rough on my cavs. They would hurt so bad. I could do Zumba for 2 hours but couldn't run for 5 minutes! I'm going to try and work up to it again. I did want to say that I find yoga has helped so much with my back pain from my mets. I try to do it each day also. I have lost 20lbs since my diagnosis of mets on 11/22/16. I'm going to stick to the plant based diet with occasional salmon. I feel so much better eating this way and it can only help with the exercise too! Being on this forum has helped me so much with motivation. You all are so inspirational to me! Thank you all!!! Misty",
      "MessageIndex": 47,
      "PostDate": "07/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 15, 2017 11:20AM Apg wrote: I love seeing all these posts! Yesterday my husband and kids went to a rv show. We walked around for 3 hours climbing up and down steps the whole time! I was wore out! I am 6 days out after starting the treatment and I could definitely tell a difference in my energy level! I do yoga stretches each day myself. Today I will be going in for my session with my friend! If I don't do this I'm so stiff feeling!! Have a great day everyone",
      "MessageIndex": 86,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 22, 2017 03:06PM Apg wrote: I will definitely try the coconut oil. That really helped with my mouth being irritated. My rash has spread a little on the inner thighs and my hip area. It isn't bad though. Thanks for the tip :)",
      "MessageIndex": 128,
      "PostDate": "22/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 26, 2017 09:52PM Apg wrote: I did Zumba again yesterday evening. It was only 2 days after receiving the trial treatment and ii was pretty tired but I finished the hour long class. I was drained after it lol! Tomorrow night I will be going to a Zumba fundraiser and it is 2 hours but I will most likely not make it that long! It is fun though and for a good cause. Great job everyone, you keep me inspired and motivated",
      "MessageIndex": 161,
      "PostDate": "26/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Feb 3, 2017 04:00AM Apg wrote: thanks so much for all the advice! I actually have a gift certificate for a sauna spa day! I'm going to have to use it very soon!",
      "MessageIndex": 196,
      "PostDate": "03/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Feb 23, 2017 07:41PM Apg wrote: Lulabee, wow! I can't even imagine all you have had to deal with! It makes me so mad that this has happened to you! You are doing amazing though ! That is huge to get out and walk any distance. You are such an inspiration of strength and determination. Z, enjoy Scottsdale and hope it energizes you to get out! DG, that is awesome....have fun in Cozumel!!",
      "MessageIndex": 291,
      "PostDate": "23/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 16, 2017 09:46PM Apg wrote: I made it to Zumba tonight! This is the first time since my original diagnosis last February! It felt so good. I thought I may forget some of the songs they use to do with chemo brain but I didn't. It was a great night and I finished it off with some yoga stretches. Last night I did yoga and then some ab work. I'm weak in my stomach. I had reconstruction and used my belly so I have an incision from hip to hip. I'm so happy to have this to motivate me! Mist",
      "MessageIndex": 92,
      "PostDate": "16/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 27, 2017 10:04PM Apg wrote: great job everyone! I can say it really does help with all aspects of this! I made it the 2 hours tonight at Zumba. I plan on going to yoga class in the morning. I will say after class I was quite emotional, just thinking about how I use to do this class religiously and then my diagnosis kept me away for 11 months. I had lots of tears rolling down my cheeks. It was lots of different emotions.....happy I made it and thankful to still be able to do it and just knowing that I'm not taking these things for granted anymore. But also being envious a little bit of all the women there living carefree lives and longing for that feeling again. I'm coming up on my year from my original diagnosis so not sure if that is part of it or just my hormone drained body now. I'm on day 19 of treatment and it's been a month since ovaries were removd.anyway I'm just thankful to be able to do these things and thankful for all you ladies",
      "MessageIndex": 168,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Feb 6, 2017 01:02AM Apg wrote: Thanks for posting the sequence again z! Those are the poses I try and do several times a week on my own. I am pretty sore today from yoga yesterday. That chair pose and a few others she had us do really made my butt and legs sore lol! It is good though. I feel like I accomplished something when I can feel the effects the next day!!! Great job to everyone working so hard this past week. Tomorrow is tx day for me so I won't be active for a couple days. I do try and take a walk on my long tx day. Tomorrow is day 1 of cycle 2 so for the trial I have multiple blood draws and ekg. Have a great week everyone",
      "MessageIndex": 210,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Feb 9, 2017 11:09PM Apg wrote: I'm going to have to check out those videos! I did Zumba again last night, boy was I wore out by the end of the hour. Felt like I couldn't raise my arms. I can't wait till spring to get out and walk and exercise outdoors! Hope everyone has a good weekend!!!",
      "MessageIndex": 234,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 22, 2017 06:20PM Apg wrote: Just got back from another walk/hike and getting ready to do yoga with my instructor friend. I do yoga stretches every night but she gets me in challenging positions and makes me sweat! I do it at home just to help keep me from being sore and stiff. I really need to get a Fitbit. I have no idea how many steps I get in.",
      "MessageIndex": 130,
      "PostDate": "22/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Feb 2, 2017 01:34AM Apg wrote: I wasn't too active since Friday until today. I was really struggling with mouth sores over the weekend. Those things are painful. I had 7 of them all on the left side of my mouth which is weird that I had none on the right. I get my infusion on the left side so who knows. Anyway it effected my ability to eat so I was grouchy and didn't want to do much of anything. They are going away now, I only have 3 left. I went to Zumba tonight and I did yoga last night. I'll get a routine going sometime. It just feels good to do something",
      "MessageIndex": 188,
      "PostDate": "02/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Feb 5, 2017 03:40AM Apg wrote: That's great MSL. Z I'm glad you got rest, you amaze me with your activity so I'm sure it was much needed! Paddle boarding sounds so fun!!! Enjoy! I did Zumba this morning and a yoga class. I was beat after and I seriously haven't left the couch the rest of the day. I have napped on and off all day. Oh well, I will make up for it tomorrow.",
      "MessageIndex": 203,
      "PostDate": "05/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 2, 2017 09:22PM Apg wrote: I don't have a Fitbit but I would like to follow this for motivation. I have been doing yoga but I also want to do cardio too. I just had surgery a week ago so I have another week before I can start back to doing anything but I can't wait! I will do anything to make sure I can be here as long as possible. I have done Zumba a lot in the past. Is it safe with bone mets?",
      "MessageIndex": 4,
      "PostDate": "02/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 21, 2017 04:50PM Apg wrote: Today my husband and kids and I are going to the place we camp at throughout the summer and taking our dog for a hike! It is a very beautiful day here, sunny and 60 degrees! We are going to take full advantage of the unseasonably warm weather! Have a great day everyone!!!",
      "MessageIndex": 117,
      "PostDate": "21/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Jan 22, 2017 02:37AM Apg wrote: Z, you are a beast! Wow. I went for an hour walk/hike but I was worn out after. I had taken the ibrance/femara only about an hour and a half prior to this. I find that when I take my meds I'm tired right after but come out of it in a few hours. Also I noticed this evening a small rash on my lower back. Not sure if this is from the trial or the standard meds?!?",
      "MessageIndex": 123,
      "PostDate": "22/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Mar 7, 2017 03:18PM Apg wrote: I have not had much exercise in the past couple weeks. I have done gentle yoga stretching but no actual physical activity. I am up and down all day at work but that isn't the same. I've had some issues with my stomach bothering me so I just haven't made it to the classes I attend. The weekly infusion is making me not feel well for a couple days each week. I hate feeling nauseous each week but I had good results from my scans so I will push through it. I will make exercise a priority this week though! My sciatica has been bothering me too. I have always had this issue. The yoga helps tremendously with it!",
      "MessageIndex": 353,
      "PostDate": "07/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Feb 9, 2017 09:19PM Apg wrote: Rgc77 my husband and one of my kids had a stomach bug this week but so far I haven't gotten sick yet! I hope you are doing well after radiation.",
      "MessageIndex": 710,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Apg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244143/profile",
      "Content": "Feb 11, 2017 09:43AM Apg wrote: Missy, I'm glad you and your family are on the upside now! I hate that you have had to deal with this on top of everything else! Get some rest! Spring will be here soon and maybe we can get together soon!!! Think of you often!!!",
      "MessageIndex": 712,
      "PostDate": "11/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    }
  ]
}