{
  "AuthorID": "Appleg8",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66208/profile",
  "Posts": [
    {
      "AuthorID": "Appleg8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66208/profile",
      "Content": "May 5, 2008 05:30PM Appleg8 wrote: All right... Your right... why would I do that to my kids. If nothing else, that would not be nice to them at all. I'm just going to have to be a stink pot and tell them what I want and stick to my guns. I think my husband is acting this way because he is worried that I am giving up all the things I love and keeping the things I don't love... like work. Anyway, I know everybody at church will bend over backwards to help, I have been the one on the giving end for many years, but taking isn't so easy either. ... not to mention, I need to find a way to not feel like punching someone in the nose every time they attempt at being sympathetic to me But I really do want to thank you all for your comments... My husband thinks I am getting too much info on line, but talking to someone who has nothing to do with bc is completely useless. Thank you for taking the time to talk me through last night (I feel like a complete baby sometimes... ) those weak moments are a killer and I apologize Apple ",
      "MessageIndex": 9,
      "PostDate": "05/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705034",
      "Title": "can I give up? Appleg8 swimangel72"
    },
    {
      "AuthorID": "Appleg8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66208/profile",
      "Content": "Appleg8 wrote: Please dont freak out on me about this question... I just really need to ask it. dx last week with IDC 1.6cm Hp+ and he+ and hr2-. I know everyone says this, but I have a super super super full life. Full as in busy. Anyway, I have been trying to scrape things off my plate so to speak so I can handle what is coming.. however, I am meeting some resistance. For example, I want to sell animals, which I am truly the only person that cares for them ... we are talking a farm here.. My kids and my husband are all having a fit. I know this is stressful on everybody, but the arguements we get into with me just trying to simplify my life have been more than I can handle.. I have NINE children my youngest being only 5, a farm with dairy goats, chickens, horses, meat goats... the works. I have a huge family garden and a fruit orchard I care for, and I work 40+ hours per week and do massive church work. The laundry and meals for this family alone would put most people in the nut house... Something's gotta give! I can't do it all and deal with my bc on top of it.. Ok... let me stop rambling and get to my question what if I just decided to pretend that I didn't have bc. what if I just never had it treated... I know, I know, you don't want to answer the question... but.. how long would you say I would have to live? Would it be 10 years? 5? 20? How long ? apple  Dx 4/28/2008, IDC, 2cm, Stage IIA, 2/10 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705034",
      "Title": "can I give up? Appleg8 swimangel72"
    },
    {
      "AuthorID": "Appleg8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66208/profile",
      "Content": "Appleg8 wrote: Hellowww... out there in bc land I have less than 48 hours before my first chemo treatment. My head is swimming. I read that if I am prepared with info it will be so much easier... I am beginning to wonder about that idea. Everything I read makes me about wet my pants! Anybody out there wanna keep in touch that might be going through treatment at the same time? Im doing what I believe is commonly refered to as AC... but adding a 3rd drug from a clinical trial. Im 45 years old, religious, have lots of kids, live in the country and of course have bc. Looking for somebody to be a cyber chemo buddy.  Anybody else out there having a hard time sleeping due to worry? I'd love to hear from you Apple  Dx 4/28/2008, IDC, 2cm, Stage IIA, 2/10 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709818",
      "Title": "chemo buddy wanted :) Appleg8 Appleg8"
    },
    {
      "AuthorID": "Appleg8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66208/profile",
      "Content": "Jul 28, 2008 07:58PM Appleg8 wrote: Thanks Ann!",
      "MessageIndex": 2,
      "PostDate": "28/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709818",
      "Title": "chemo buddy wanted :) Appleg8 Appleg8"
    }
  ]
}