{
  "AuthorID": "Apprehensiv…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125933/profile",
  "Posts": [
    {
      "AuthorID": "Apprehensiv…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125933/profile",
      "Content": "Mar 16, 2011 11:54AM ApprehensiveUK wrote: Thank you dreidteacher got the result yesterday, its a grade (or is it stage I'm not sure) 3 invasive ductal cancer in the right breast and inconclusive in the left. I don't know anymore than that yet, but feel like my world has been blown out of the water. I have to go for chemo for 4 months then a full mastectomy and reconstruction at the end. I am meeting the oncologist tonight so hope to know more then. Not feeling strong right now and the next person who says try not to worry is going to get slapped! Everyone tells me I can beat this but right now I just want to go to bed and pull the covers over my head til it all goes away. I am hoping my inner strength will return when the shock wears off. To everyone keep strong and I will be looking out for your results next week dreidteacher. The waiting is a killer.",
      "MessageIndex": 9,
      "PostDate": "16/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/766067",
      "Title": "Had the core biospy yesterday dreidteacher shells43"
    },
    {
      "AuthorID": "apprehensiv…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89385/profile",
      "Content": "Sep 18, 2009 02:46PM apprehensive wrote: My pain is getting worse everyday. It feels like my left breast is clamped in a vice and an icepick being shoved throught the nipple. It's kind of hard to get your mind on something else when you have this constant pain. I've been taking 600mg of Ibuprofen every four to six hours for months now for the pain and it seems as if it has just stopped working for me. My doctor offered me something stronger, but I declined b/c I hate pain meds. I'm now rethinking my decision on that. I'm at the point now where I wish if it is something to really be concerned with, that I would get another symptom so I would know for sure. That may sound really stupid, but this is driving me crazy-- literally. I am sleep deprived because of this pain.  I did get a call from the breast clinic, but it will take 30-90 days to get in. I just really needed to vent.",
      "MessageIndex": 6,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740395",
      "Title": "Looking for answers apprehensive apprehensive"
    },
    {
      "AuthorID": "apprehensiv…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89385/profile",
      "Content": "Sep 15, 2009 01:19PM apprehensive wrote: Thank you Jalmom for your reply. I live in the country and the clinic they are supposed to be getting me into is two hours away. I just know I have been in a lot of pain and that tells me something is wrong. I don't know whether I should be just waiting this out or hurrying them up. It has been since March.",
      "MessageIndex": 3,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740395",
      "Title": "Looking for answers apprehensive apprehensive"
    },
    {
      "AuthorID": "apprehensiv…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89385/profile",
      "Content": "Sep 15, 2009 02:34PM apprehensive wrote: Thanks whatisthis. I hope and pray everything turns out good for you. Did your symptoms first begin in August? I mean, did you go from being fine to having all of this at the same time beginning in August? I ask, because my dr said I'm being referred on an unconfirmed diagnosis of inflammatory breast disease, but from what I read, if it were that, I would have some serious stuff going on by now. Like the discharge, hot, red inflammation, ect. instead of the itchy spots and worsening pain. I just don't know what to think. I have a history with cancer, so naturally, my mind gets stuck there.",
      "MessageIndex": 4,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740395",
      "Title": "Looking for answers apprehensive apprehensive"
    },
    {
      "AuthorID": "apprehensiv…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89385/profile",
      "Content": "Sep 19, 2009 03:39AM apprehensive wrote: Thanks to both of you. I appreciate all the info I can get too. I know it's not hormonal b/c I had a hysterectomy 8 yrs. ago and I have been off of hrt since April. So I guess its just wait and see. It sure is nice to have some people to talk to about this though. It definitely helps.",
      "MessageIndex": 9,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740395",
      "Title": "Looking for answers apprehensive apprehensive"
    },
    {
      "AuthorID": "Apprehensiv…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125933/profile",
      "Content": "Mar 15, 2011 04:41AM ApprehensiveUK wrote: I too am waiting for my core biopsy results taken from both breasts, should get the answer this afternoon after waiting for a week. I am so glad I found this board, my nerves are shot to pieces and have had to work from home today as I just keep crying. Good luck to you all, as dreidteacher wrote stay strong and positive! (Although I am having trouble doing that right now)",
      "MessageIndex": 6,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/766067",
      "Title": "Had the core biospy yesterday dreidteacher shells43"
    },
    {
      "AuthorID": "apprehensiv…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89385/profile",
      "Content": "Oct 14, 2009 04:18AM apprehensive wrote: I was finally able to get into see a BS today. They seem to think the rash I have been experiencing (it's gone for the time being) is shingles. While doing the US, she found a tiny spot  (7mm x 5.5mm), that she says could be causing some pain. She says it is not a cyst, could be a lymph node, fibroadenoma, or something else. Whatever it is, she showed me that it has blood flow to it. Anyway, she's going to recheck again in six months. I'm feeling exceptionally blessed right now.",
      "MessageIndex": 10,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740395",
      "Title": "Looking for answers apprehensive apprehensive"
    }
  ]
}