{
  "AuthorID": "apricotjam",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288811/profile",
  "Posts": [
    {
      "AuthorID": "apricotjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288811/profile",
      "Content": "May 19, 2019 08:34PM apricotjam wrote: Sam, regarding the biopsy, you'll see each of us have slightly different experiences, depending on where they're biopsying and who's doing it. I really lucked out ... my doctor was quite good at doing it and I didn't even feel the needle with the numbing agent, nor did I have any bruising. I'd expected lots of bruising since I'm hemophiliac and my blood has trouble clotting. But they compressed it for longer after the procedure to make sure it had stopped bleeding. So that might have helped. Everyone has a slightly different experience, hopefully yours will be minimal side effects.  One thing I do highly recommend is that although you *can* drive yourself there and back, take a friend who drives you. We went out for lunch afterwards, and even though I wasn't really in the mood to eat, it did help my mental state a lot.",
      "MessageIndex": 38,
      "PostDate": "19/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/871562",
      "Title": "Mammogram and Ultrasound results Sam183 Sam183"
    },
    {
      "AuthorID": "apricotjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288811/profile",
      "Content": "Jun 3, 2019 12:05AM apricotjam wrote: When I scheduled mine, the breast hospital was scheduling out a month, because they require insurance pre-auth. The imaging place didn't require pre-authorization for a biopsy, and my insurance assured me it was covered, so I went with the place that would get me in faster. biopsy was just less than a week after the ultrasound.  You'll be running up against several issues: one is whether the insurance requires pre-approval of any sort, second whether the center does (apparently our breast hospital does because it's considered outpatient surgery), and third, how busy they are.  Even if they schedule you a few weeks out, you can ask if there's a cancellation list they call. Some places ask you to call each morning to ask about cancellations, others just keep a list of people who want to come in sooner.",
      "MessageIndex": 5,
      "PostDate": "03/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871866",
      "Title": "Waiting on biopsy appointment Mzbillieb76 Fairydragonfly"
    },
    {
      "AuthorID": "apricotjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288811/profile",
      "Content": "May 6, 2019 04:07AM apricotjam wrote: I just had an ultrasound followup done, and also got a 4B rating. I'm having a hard time keeping it together, but I've got my fingers crossed for both of us.",
      "MessageIndex": 5,
      "PostDate": "06/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871350",
      "Title": "MRI completed now heading for biopsy Sher77 Sher77"
    },
    {
      "AuthorID": "apricotjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288811/profile",
      "Content": "Jun 1, 2019 10:00PM apricotjam wrote: When I had my core biopsy, they put a bunch of steristrips in a star pattern over the incision spot. They stayed on just fine for a week. I think if you get steristrips, you'll be fine. After the run you might want to be extra careful gently cleaning the area to get rid of any sweat so it heals well.  ",
      "MessageIndex": 5,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/871840",
      "Title": "Punch and core biopsy Trishdenys apricotjam"
    }
  ]
}