{
  "AuthorID": "AprilOdo7",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60029/profile",
  "Posts": [
    {
      "AuthorID": "AprilOdo7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60029/profile",
      "Content": "Nov 30, 2007 09:33PM AprilOdo7 wrote: OK... I guess I am venting...else talking to myself, right? I'm sorry....",
      "MessageIndex": 4,
      "PostDate": "30/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695351",
      "Title": "Stage III 010407 DCMom"
    },
    {
      "AuthorID": "AprilOdo7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60029/profile",
      "Content": "Dec 1, 2007 01:35PM - edited Dec 1, 2007 01:48PM by AprilOdo7 Hattie. If I may ask.... Just how sizable was your mass? You sound like you were in the same boat as I am...yet no long afraid. I know I am...",
      "MessageIndex": 9,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695351",
      "Title": "Stage III 010407 DCMom"
    },
    {
      "AuthorID": "AprilOdo7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60029/profile",
      "Content": "Dec 1, 2007 01:32PM - edited Dec 1, 2007 01:48PM by AprilOdo7 Thank you Janis, Maryannecb and Hattie. I DO understand that this is not an interactive board inthe sense of your typical chat forum. Lol...I promise to do better next time...<smile> I think with all cancer patients, at least it is with me, that there is a need for understanding in all things pertaining to our experience.  In my need to know, I find that I am getting the short side of the deal here, and it would be best I did go with my gut feeling to seek out a more trustworthy team for my medical care. I went into this thing when symptoms of this condition started to show (pain and discharge with a lump that seemed to increase in size with every \"monthly plague\")...TOTALLY trusting and dependently leaning solid on the shoulders of my current medical team: thus far I feel a let down.... I totally agree that the answer is to look elsewhere, at least in the direction of  an National Institue of Health affiliated organization specializing in womens Breast Care--I am currently located in the desert region of Southern California where the doctors are either foreigners or 'shipped out' from the inner cities and surrounding surburban areas to 'make a difference' here. $$$...who knows.... My second and third opinions were had along the coastal regions of Southern California, Irvine, CA and Newport Beach, CA where the quality of care as well as the positive outcomes for women experiencing breast cancer are phenomenally better. (That care is some 55 miles away...and expensive to get to as well, but initially, I was willing to travel.) Hattie, I HAVE ALL of my medical records so far,as well as all MRI's, CAT scans, diagnostic mammograms, bone scans, lung scans, brain scans, etc. Mind you, apart from the initial MRI, I had to come out of pocket in paying for many of them while in Irvine and Newport Beach. The reports and x-rays seem to tell a story of medical neglect and/or malpractice. True. Again, I DO need to look elsewhere for my care...as well as seek out a legal professoinal for further assist. Ok...No more venting here. I need to start reading the board,...listening....so as to understand...lol...and not give sacrifice by talking too much,hmm? Blessings ladies. And thanks for responding to little ol' me.  AprilOdo7",
      "MessageIndex": 8,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695351",
      "Title": "Stage III 010407 DCMom"
    },
    {
      "AuthorID": "AprilOdo7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60029/profile",
      "Content": "Nov 30, 2007 09:22PM - edited Nov 30, 2007 09:30PM by AprilOdo7 Help! I was recently diagnosed with IDC in August of this year. My initial diagnosis was just prior to the surgical oncologist acknowledging that a wire from a previous 'biopsy' that went wrong was still inside my breast. What was then a 1 cm lesion now presents as a 6 - 8 cm cancer.       A subsequent MRI revealled that I had a 6 - 8 cm lesion presenting in both breast. I was given the option of bilateral masectomy. I was devestated. Since I could not feel the lesion on the right breast, I found myself literally running from the said diagnosis in preference of finding a second and/or third opinion. My second opinion revealled nothing in the right breast despite my strong feeling that 'something' was actually present there: I had been told as much.... The doctors seemed to have issue with the initial MRI. Yet, a third opinion revealled something that both startled me as well as diminished my faith in what I have come to place my hope in: doctors and modern medicine; for my third opinion, in attacking the findings of the first MRI, revealled that there was nothing whatsoever presenting in my right breast in the form of a 6 - 8 cm mass. It was discovered then that the MRI individual, a radiologist by profession, had deliberately transposed my MRI to give the false positive of something being there AFTER I argued in defense of my referring physician that what I was sent in for a diagnostic mammogram for was the fact that the Doctor referring me stated emphatically that this was a solid mass with no definable boarders and that I would stand by her prognosis ..until proven otherwise. She, being a radiologist, I said, was literally stepping out of her boundaries in diagnosing my condition: She demanded that all I had was a 1.3 cm cyst and that she would be recommending that it be asperated else that I be seen in one year for follow-up evaluation only. This deception has taken some four months away from the proper diagnosis of my disease and its ultimate treatment.  Further deception was this place telling me that there was no lymph node involvement in the left axilla. There was swelling and pain ...yet on ultrasound biopsy of the left breast at the surgeon's order, a rather large lymph node presented itself directly adjacent to the 6 - 8 cm mass. When I asked what this was, the radiologist conducting the biopsy stated, \"That is a lymph node.\" When I asked if he was going to do a biopsy of the node as the doctor had requested in his referral notes, he stated, \"No...we are not gonna touch that.\" Later I hear from my doctor that they say that there is NO lymph node involvement, of which they electronically place in my medical file.  Also,  when the first MRI needed further evaluation on the right, due to what had presented itself, she herself volunteered to do the biopsy, thus taking another doctors place that afternoon.  She entered just under my right breast, and into the fasia tissue between the breast and the breast muscle, and removed tissue from there to present to the pathologist: a place that was certain to reveal nothing there, as the MRI was maliciously transposed and nothing would have been found anyway.  My total lack of faith in the ability of this organization as a whole in unbiased treatment of my ailment is without warrant. I feel afraid for myself and my family....wondering if I have a fighting chance to beat this thing...at least for my husband and children's sake. My husband states that I should go with this organization, dispite  what had happened, and that the cancer is 'getting larger and spreading' and that I need systemic chemotherpy immediately, that he loves me and that he doesn't want to lese me. I think, with these people? What a wad of crock! Are you serious? Never the less here I am......yet still wary and undecided. I have started neoadjuvant chemotherphy in an effort to, first of all, shrink the mass so as to try for breast conservation surgery at a later date. But, I do not know as of yet whether or not this my cancer is actually  responsive to this treatment: I just want to have this thing out as well as the enlarged lymph nodes as well, several now, that now present themselves in both left axilla.  The medical oncologist (chemo doctor) now states that the surgical oncologist has stated that he will be doing a lumpectomy sometime in December, as well as a lymph node dissection. I am hurting here....emotionally. Any suggestions on how to navigate this rough terrain I now find myself and my family travelling upon will be much appreciated. Thank You.  ",
      "MessageIndex": 3,
      "PostDate": "30/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695351",
      "Title": "Stage III 010407 DCMom"
    },
    {
      "AuthorID": "AprilOdo7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60029/profile",
      "Content": "Dec 1, 2007 01:36PM - edited Dec 1, 2007 01:48PM by AprilOdo7 Oh Dear! My poor sig line...better.",
      "MessageIndex": 10,
      "PostDate": "01/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695351",
      "Title": "Stage III 010407 DCMom"
    }
  ]
}