{
  "AuthorID": "Arayasunshi…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
  "Posts": [
    {
      "AuthorID": "Arayasunshi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
      "Content": "Dec 26, 2010 01:58AM Arayasunshine69 wrote: Thanks for your tips...I know I feel better when I exercise.  I lost 130 lbs several years ago, and kept it off until I got pregnant with my daughter, in 2009.  When she was 9 months old, I thought I found a clogged milk duct.  I ate very healthy, and exercise was my drug.  I was very active and fit, and now....sometimes I wonder how did I get here???  To where some days, I have no energy, and just feel sad all the time??  At the beginning of my journey, I was very optismistic, very positive, and then I had my surgery, and when I woke up, found out that it was in my lymphnodes, and they took 14, 5 were cancerous.  Then the Chemo, and they always bruise my arms because they can never get an IV in the first time, and now radiation.  I feel tired all the time.   I do have good days, days where, I don't think about cancer, and laugh with my family and friends.  Days where I take my now 16 month old daughter out, and enjoy every minute.  I miss how healthy, energetic and full of life, I once felt daily.  I have 5 radiation treatments left, and eventhough the days are short and cold up here in Edmonton, I do try to exercise everyday.  Today I done some Wii, and realized how bad of shape I'm in right now.  I feel so broken. And unfortunately, I know that there are many of you who can relate to how I feel.  Thank You so much for all your support, I really apprecaite it. =) ",
      "MessageIndex": 12,
      "PostDate": "26/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762437",
      "Title": "How do you turn bad days around? Arayasunshine69 faithfulheart"
    },
    {
      "AuthorID": "Arayasunshi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
      "Content": "Jan 4, 2011 01:34PM Arayasunshine69 wrote: Thank You 3Monstmama!  I want to stay active too!  I even rejoined weightwatchers online last week, and this week, I'm down 6 lbs.  Yay Me!  I am really trying hard, to not think about cancer all of the time, and to appreciate each day, and do what I can that day, one day at a time.  I am 35 years old, but my body feels much older than that.  I see 70 year olds (and older) running, and that's what I want for me too!  I want to feel fit.  I want to be that healthy.  I plan to do some kind of physical activity everyday.  I'm still a new mom...I don't want her to see me as unfit, and having constant bad days where it hurts to move...I would rather her think of me as a \"fit role model.\"  Happy New Year to you too. =)",
      "MessageIndex": 2,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762890",
      "Title": "Radiation burns with 2 days to go and mini rant. Arayasunshine69 MVRobbins"
    },
    {
      "AuthorID": "Arayasunshi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
      "Content": "Jan 16, 2011 07:35PM Arayasunshine69 wrote: Awww, you're all so sweet! I live in Edmonton...my family are in Newfoundland, and my boyfriend's family are in British Columbia.  My boyfriend works away up North, 2 weeks on, 2 weeks off.  Believe me when I say there are days I feel like a single mom.  My mom spent all summer here, all of October, and 3 weeks in December.  When she came in December, it was because I was going through radiation, and we thought that would be the best time for her to come.  We didn't anticipate me being in all this pain now. *Sigh.*  I told my boyfriend that If I ever had to go through chemo, or radiation again, I was moving back to NL, or BC where I would have alot of family support.  My friends here have been good to me though...but I feel like I call the same people over and over, and I'm just so tired of asking for help.  I feel like there is always something going on, and I'm tired and feel like I'm constantly complaining. Today, my ribs started to hurt...on the left side, (I had radiation on my right side) It hurts when I take a breath, and I don't know what I did.   I think it's time to start looking for a sitter though...someone who I can call up with little notice, to watch my daughter, even for a couple of hours during the week, while my bf is working away.  Most of the time, I'm ok.  I'm so distracted with taking care of her, that I don't have time to feel anything, but some other days, I feel like everything is happening all at once, and it breaks me.  I love my boyfriend dearly, but there are days I'm so angry with him, because he's away.  It's been a really rough 7 months.   I'm so happy to have found this board.  Thanks for letting me rant....",
      "MessageIndex": 9,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763460",
      "Title": "I want to go out but I'm covered in cream. Arayasunshine69 sdstarfish"
    },
    {
      "AuthorID": "Arayasunshi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
      "Content": "Jan 19, 2011 11:04PM Arayasunshine69 wrote: Hi Ladies!  Thanks Jenn. =) My burns are pretty good, I've still been applying the gauze and cream, and it has helped alot.  Seems like there is always something going on though.  Today I was sick, and throwing up all day.  A friend came over to watch my daughter so I could sleep, I could not keep any food or liquid down.  I am feeling a little better right now, so far I've kept some gingerale down. I hate throwing up.  Boyfriend will be home in less then a week, I can't wait.  Is nauscia a side effect from Tamoxifen, or maybe it's from Tylenol 3? Although, if it were a Tamoxifen side effect, wouldn't it have happened sooner, I've been taking them since November?  I have to wait one more week to get the results from my CT and bone scan.  I'm trying to be optimistic about it, but I'm scared.  Hopefully I will have awesome news to share with everybody then. =) xo! Cheers!  ",
      "MessageIndex": 16,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763460",
      "Title": "I want to go out but I'm covered in cream. Arayasunshine69 sdstarfish"
    },
    {
      "AuthorID": "Arayasunshi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
      "Content": "Apr 7, 2011 05:16PM Arayasunshine69 wrote: Hello!  Thank You for all the Birthday wishes, and tips.  Sorry for the late follow up...I stopped taking the percocet...it wasn't helping anyway.  I got out in the fresh air, and found that helped.  I also didn't wear my compression sleeve, and that helped the tingling hands....is it possible that my compression sleeve is too tight?  I went to a Yoga Thrive program on Tuesday, which is offered free to cancer patients, and I found it extremely helpful. I've been doing some of the stretches/poses at home, and find they help.  Next week, the instructor is bringing me dvds so I can follow at home between classes. I have felt so much better the past few days.  It helps that our weather is getting nicer and the snow and ice are melting.  I saw my dr. today, and told him I stopped taking the percocet because they weren't helping, and he suggested I continue to use the tylenol 4s if they work better.  (They don't work, really.) I'm just going to take it one week at a time, and see how this \"pain\" plays out.  Ugh. I hate the pain days.  Cheers!",
      "MessageIndex": 17,
      "PostDate": "07/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/767031",
      "Title": "It's my Birthday weekend and I feel sad. Arayasunshine69 Arayasunshine69"
    },
    {
      "AuthorID": "Arayasunshi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
      "Content": "Aug 4, 2011 12:30PM Arayasunshine69 wrote: Thanks nowords!",
      "MessageIndex": 2,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772661",
      "Title": "Forearm pain? Arayasunshine69 Binney4"
    },
    {
      "AuthorID": "Arayasunshi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
      "Content": "Nov 13, 2010 01:40PM - edited Aug 20, 2013 06:10AM by Arayasunshine69 Thanks Everybody!  There is just an overload of information...Do you know, I spend at least 75% of my day, thinking about cancer, reading whatever I can get my hands on...it is so overwhelming!  I have good days (like today) when I don't feel overwhelmed, feel positive, feel I'll be around a long time, if I take better care of myself, in short, I feel great about everything.  Then, I'll have days where all I can think of is death, how much longer will I be around, think \"who cares what the ingredients are, or what I eat, I'm going to die anyway.\" and sit around and cry all day.   NO ONE in my family or circle of friends can honestly relate with what I've gone through this year.  None of them have cancer.  Last night, was a bad night, and I talked to mom who told me I've completed chemo, I should be happy?  Happy?  Happy that I'm bald, and my eyelashes and eyebrows are gone?  Happy that I have one breast and can't wear any of the sexy tops I used to love wearing to flaunt them?  Happy that I had 14 lymphnodes removed and 5 of those were cancerous?  Happy that as a result my arm feels weak and heavy and now I have to worry about lympdema?  Happy that the chemo is shrinking whatever that is in my pelvis, but it's possible it's metasizes?  Happy that I'll be medically followed for the rest of my life?  ALL THAT SOUNDS AWESOME, I'M SO LUCKY AND HAPPY I'M DONE CHEMO.  note the sarcasim...oh yes, what was this topic about again?  Parabens and Phthalates....",
      "MessageIndex": 6,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/760647",
      "Title": "Parabens and Phthalates Free Products Arayasunshine69 Shanagirl"
    },
    {
      "AuthorID": "Arayasunshi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
      "Content": "Jan 17, 2011 04:08PM Arayasunshine69 wrote: Hi Ladies!  Just thought I'd touch base...the radiation burns are looking alot better today...I'm a lighter shade of pink now...my armpit feels a little better too.  Yesterday, my ribs on my left side started to hurt, and by the time I went to bed last night, I started to have pain in my tail bone...this morning, I could barely move.  Is this related to medications/treatments, or is this just my streak of bad luck? I do have arthritis everywhere...I was so stiff, and all hunched over...of course it's Monday, and all my friends are working.  I finally found relief after taking a tordol, and 2 tylenol 3's, and taking a bath with Epsom salts added to it.  I have a girlfirend coming over when she gets off work, and she's helping me out tomorrow as well, and a cousin is coming by to help me on Wednesday.  I hate feeling like a burden, and feel so helpless.  Kerry, I looked up the Nanny Angle Network...from what I can tell, they don't have a location in Edmonton...looks like they have one in Calgary though.  (3 hours from here.)  What a great idea..I wish it were in Edmonton too!  I actually told my oncologist once that they should have a little daycare there, for moms with children going through chemo.  He told me to write in a request.   I guess I'm just having a hard few weeks.  I know it will pass.  I hope soon.    Cheers!",
      "MessageIndex": 13,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763460",
      "Title": "I want to go out but I'm covered in cream. Arayasunshine69 sdstarfish"
    },
    {
      "AuthorID": "Arayasunshi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
      "Content": "Jan 16, 2011 10:42AM Arayasunshine69 wrote: Thanks DCMom.  I called the host to tell her we were unable to make it....these other moms know I just completed radiation, so I think they'll understand.  I just worry that my 16 month old isn't getting enough time with other children. =(  Hopefully these radiation burns heal soon...I am so tired of wearing this sticky goopy cream...my armpit is raw, the size of my palm, my neck is now raw, and my chest looks like I laid a hot iron on it...yes, I would have felt really uncomfortable had I gone out to socialize. ",
      "MessageIndex": 2,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763460",
      "Title": "I want to go out but I'm covered in cream. Arayasunshine69 sdstarfish"
    },
    {
      "AuthorID": "Arayasunshi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
      "Content": "Jan 19, 2011 11:05PM Arayasunshine69 wrote: Oh yes...Daughter was really good today, even when my help left.  It was like she knew I wasn't feeling well, and had to let me rest. =)",
      "MessageIndex": 17,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763460",
      "Title": "I want to go out but I'm covered in cream. Arayasunshine69 sdstarfish"
    },
    {
      "AuthorID": "Arayasunshi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112098/profile",
      "Content": "Dec 17, 2010 06:24PM Arayasunshine69 wrote: Thanks for the support ladies...I love this board!  I know everyone means well, but unless you experience cancer first hand, it's hard to understand what we're going through.  I've had my boob removed, I've had chemo, am currently doing radiation, will continue with Herceptin until August, will be on Tamoxifen for 5 years, and have had so many test done.  And now, a throat infection on top of it all??  During this already hectic season? I'm not even done my shopping.  Thank God for Good friends...my BFF offered to finish my shopping for me.  \"You stay home until this infection is cleared up, or you'll be too sick to enjoy your Christmas.\" I'm also fortunate enough that my mom and dad came up from NL, and they keep my 14 month old daughter entertained and busy so I can rest.  EVERYTIME I go for anything where I need an IV, it never works on the first try.  It takes a few attempts, sometimes from 2 or 3 nurses.  I want to yell at them sometimes because I think they should know how to do it. But then I think they'll be mean to me, and 8 more months is a long time to go for Herceptin with nurses who don't like you.  I was under the impression, that I could not have a port, seeing that chemo is done, and the herceptin iv is so much smaller.  When I go see my Onc again, I'll have to mention it to him...is it my onc that I would have to mention it to?  Beth...Yes, I live in Edmonton.  Aren't the roads just terrible right now??? my onc. is Dr. Feton...at the Cross.  I like him.  Dr. Hamilton at University done my surgery.  He was awesome.   I'm going to try to rest lots this weekend, and drink lots of fluids.  Hopefully I can get rid of this in a day or so.  I really need to strenghten my immune system.  I have tickets for Sunday night for \"The Singing Christmas Tree\" and I want to go!  Hope you all have a nice weekend. Cheers!",
      "MessageIndex": 6,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762124",
      "Title": "Oh Fudge. Arayasunshine69 jenn3"
    }
  ]
}