{
  "AuthorID": "Art123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185737/profile",
  "Posts": [
    {
      "AuthorID": "Art123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185737/profile",
      "Content": "Aug 9, 2013 11:39AM Art123 wrote: Thanks for all your replies and well wishes. I spoke with the oncologist today and she said chemo will start the first week of September. Still waiting MRI results & lymph node biopsy, I hope there's good news. I'm strong when I'm with Natalie but I get really upset when I'm by myself. Having trouble concentrating at work. Nat is doing well, going to gym eating right and being positive.",
      "MessageIndex": 6,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/809078",
      "Title": "Fiancée diagnosed IDC 3 weeks before wedding Art123 jbdayton"
    },
    {
      "AuthorID": "Art123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185737/profile",
      "Content": "Art123 wrote: Dx IDC 8/2 grade 2 ER+ PR+ Her - MRI Wednesday lymph node biopsy Monday Cluster of small masses which make up one large mass of 7cm Consulted with 2 breast surgeons and 1 oncologist. 2 different opinions: masectomy then chemo or chemo then mastectomy. We liked the oncologist and have follow on 8/27, we getting married 8/23 and going to jersey shire for weekend since we had to cancel our honeymoon. Wife is Leaning towards doing chemo first be it could kill cells if went other places. Is it normal to do chemo then surgery with large rumors. I read survival rates aren't much difference. How soon after 2nd appt would chemo start? Thanks for any help. We're hanging in. Not the most ideal way to start married life but I'm going to be there for her. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/809078",
      "Title": "Fiancée diagnosed IDC 3 weeks before wedding Art123 jbdayton"
    },
    {
      "AuthorID": "Art123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185737/profile",
      "Content": "Aug 13, 2013 09:34AM Art123 wrote: Still waiting for lymph node & MRI results. Oncologist said chemo will start first week in September after our 8/27 appointment. Fiancée is anxious to know results, I told her I don't want to know until 8/27, do not want to know before our wedding. I told her she can call beforehand. She said she feels fine & still going to gym. I'm scared about the size and that it means stage 4. It's 7 cm. I'm a little freaked out.",
      "MessageIndex": 9,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/809078",
      "Title": "Fiancée diagnosed IDC 3 weeks before wedding Art123 jbdayton"
    },
    {
      "AuthorID": "Art123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185737/profile",
      "Content": "Aug 28, 2013 05:36PM Art123 wrote: Just an update. Wedding weekend was great. Lymph node biopsy was negative. MRI breasts show localized to left and not spread to chest wall or pectorals. PET scan tomorrow. Chemo starts next week. 12 weeks of taxol once a week then the AC combo every other week for a total of 4 treatments, then surgery.",
      "MessageIndex": 11,
      "PostDate": "28/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/809078",
      "Title": "Fiancée diagnosed IDC 3 weeks before wedding Art123 jbdayton"
    }
  ]
}