{
  "AuthorID": "Artemisia",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248913/profile",
  "Posts": [
    {
      "AuthorID": "Artemisia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248913/profile",
      "Content": "Mar 20, 2017 12:49PM Artemisia wrote: Yes, I keep thinking that a second opinion might help. Also, has anyone here been on the PARP inhibitors after multiple treatments were discontinued?",
      "MessageIndex": 2,
      "PostDate": "20/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853564",
      "Title": "Mom with Stage IV TNBC for the past 3.5 years and going Artemisia Artemisia"
    },
    {
      "AuthorID": "Artemisia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248913/profile",
      "Content": "Artemisia wrote: Hello, I am new to the forum and wanted to tell you my mom's story and see if other people have any feedback. My mom was diagnosed Stage IV in October 2013 at age 57, with multiple brain mets and lung mets and paralysis to her left hand and foot. She had whole brain radiation, which worked well with minimal side effects and brought back 99% of the mobility of her hand and foot, and was put on Xeloda. That didn't work so two months later she was put on taxol and carboplatin and these significantly reduced her breast tumor and nearly cleared all of her lung tumors. She was on this combo for about 11 months until she had some progression. Then the doctor put her on a clinical trial at Yale which did not work for her tumors but (surprise, surprise), it worked to correct her vision to the point that she doesn't need to wear contacts anymore. After this clinical trial failed, the doctor did another biopsy and told her that her cancer may be Her2+; she was put on Herceptin and Perjeta for five months and neither of them worked, so we revised the diagnosis back to triple negative (I think her doctor earns a percentage of the sales from Herceptin). She was then put on a combo of Avastin/Gemzar and her breast tumor is now gone but the cancer has appeared on her spine and adrenal glands. In September of 2016, she started developing back pain but didn't think much of it until January of 2017, when the back pain had moved up her body. She had a bunch of scans done and confirmed that she has progression to her spine (now doing 5 radiation treatments), lungs, and a few brain mets but the breast tumor is not active anymore. Her quality of life is OK, but being on decadron for the past three weeks and having radiation to her spine has limited her mobility and her mood is low for the time being (she has just come off the decadron too). The doctor now wants to put her on Avastin and some other combination as well as xGeva for the bones. My question is, are there any ladies here who have had cancer to multiple sites and have lived past five years? I know that everyone is different and that statistics are just that, but I need some hope. Initially when she was diagnosed 3.5 years ago and I was reading online forums about whole brain radiation, the statistics were grim, but it has worked well for her these past 3.5 years. Our other problem is that her doctor focuses more of treating the pain and less on the general treatment. He literally takes like 5 minutes to come up with a treatment plan off the top of his head and even offered to put her on Herceptin again last week, which did not work for her in the past (we refused it). Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853564",
      "Title": "Mom with Stage IV TNBC for the past 3.5 years and going Artemisia Artemisia"
    },
    {
      "AuthorID": "Artemisia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248913/profile",
      "Content": "Apr 8, 2017 09:09PM Artemisia wrote: So happy for you Kathi! Your story gives me hope. Have you ever had WBR done?",
      "MessageIndex": 10,
      "PostDate": "08/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853564",
      "Title": "Mom with Stage IV TNBC for the past 3.5 years and going Artemisia Artemisia"
    },
    {
      "AuthorID": "Artemisia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248913/profile",
      "Content": "Mar 30, 2017 04:38PM Artemisia wrote: She was on Opdivo for four months but it didn't work.",
      "MessageIndex": 5,
      "PostDate": "30/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853564",
      "Title": "Mom with Stage IV TNBC for the past 3.5 years and going Artemisia Artemisia"
    },
    {
      "AuthorID": "Artemisia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248913/profile",
      "Content": "Apr 8, 2017 09:08PM Artemisia wrote: Things are not looking very good for my mom. She was admitted to the hospital three days ago. She had her radiation for the spine mets, she has some new brain mets (had done WBR 3.5 years ago and tolerated it very well), has progression in lungs and a bit in adenal glands. She is weak, has difficulty walking long distances (at least she can go to the bathroom alone), and is generally shaky and still on decadron. Her doctor said they will start a new treatment plan come Monday but they want to stop all treatment for now and focus on the brain. Has anyone had Gamma knife or Cyberknife after WBR? Can she do WBR again? Are there chemotherapy agents that cross the blood brain barrier? If we are not informed about possible treatment options, the doctors will just throw any treatment that comes to mind.",
      "MessageIndex": 9,
      "PostDate": "08/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853564",
      "Title": "Mom with Stage IV TNBC for the past 3.5 years and going Artemisia Artemisia"
    },
    {
      "AuthorID": "Artemisia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248913/profile",
      "Content": "Mar 30, 2017 04:40PM Artemisia wrote: Are there actually Stage IV TNB ladies here that have made it past the five year mark? I bet there are several.",
      "MessageIndex": 6,
      "PostDate": "30/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853564",
      "Title": "Mom with Stage IV TNBC for the past 3.5 years and going Artemisia Artemisia"
    }
  ]
}