{
  "AuthorID": "artisto101",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271056/profile",
  "Posts": [
    {
      "AuthorID": "artisto101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271056/profile",
      "Content": "artisto101 wrote: Hello, I really hope I am posting this correctly, it is my first time on this blog. I would really like to apologize for how silly this post may sound, I have been having horrible anxiety for the past month and I figure getting some feedback might help... A month ago I had a weird dream where I wasn't fully asleep, I got a bad pain on the side of my left breast and rolled over and put my hand on it, as I was feeling it I imagined I felt a lump and breast cancer came into my head, suddenly I woke up. I thought nothing of it until a week later I actually did a report on this woman who discovered her breast cancer through a dream. With all the research iv'e done I have now convinced myself I have breast cancer or it is forming inside me. I do have some things that could've contributed to this dream: - I have a lump on my armpit from shaving wrong in the shower, it was close to the area I was feeling in my breast, so I had that in mind as I was touching it -I was PMSing that night and my breasts were very sore, but I've never woken up because of the pain before... -the night or two before this I found out my friends mom had breast cancer. This whole experience has caused me to develop really bad anxiety, I have chest/breast pain from constantly worrying (including soreness in the spot I dreamt of), I am tired all the time and I can't focus on any of my work and I don't know how to stop this!! I even had a breast exam done and my doctor told me I was fine and not to worry. I don't have any breast cancer risk factor that I can think of, I am only 19 years old and I live a pretty healthy life. The only person in my family who has had breast cancer was my great aunt who died at 40, however I heard her cancer was likely due to hormonal injections to help her have a child since no one else on her side has had it. Should I be concerned at all about my dream? If I shouldn't be concerned how can I calm down? This whole thing has messed up my head... I appreciate any advice anyone could give me!! Thank you so much for reading. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863825",
      "Title": "Breast Cancer dream, anxiety, please help! artisto101 Meow13"
    },
    {
      "AuthorID": "artisto101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271056/profile",
      "Content": "Mar 27, 2019 10:50PM artisto101 wrote: yes I know, but that's still a pretty high chance. I've tried to google it and there aren't any sites specifically talking about this mutation that I can find.",
      "MessageIndex": 2,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870673",
      "Title": "Gene Mutation and anxiety artisto101 vlnrph"
    },
    {
      "AuthorID": "artisto101",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271056/profile",
      "Content": "artisto101 wrote: Hi,I wanted to post this here because I recently found out my mom has a gene mutation and I’m terrified I might have it too but the mutation itself doesn’t seem to be that well known? It’s BRIP1, my mom knows I’d freak if I knew about it so I can’t really ask her. From the article they gave my mom, it gives you a moderate risk for ovarian cancer, it started to mention things about breast cancer but none of it made sense really. But I heard it could have a connection to breast cancer. I guess I just wanna know how concerned I should be about BRIP1. My mom is 56 and I am 20, I know this came from her fathers side, and only 2 people on her side had breast cancer, my dads side is compeletly healthy. Thank you if anyone knows anything, I’m not not sure where else Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/870673",
      "Title": "Gene Mutation and anxiety artisto101 vlnrph"
    }
  ]
}