{
  "AuthorID": "artsymom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96357/profile",
  "Posts": [
    {
      "AuthorID": "artsymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96357/profile",
      "Content": "Mar 11, 2010 06:37AM artsymom wrote: I get where you are at.  I was recently diagnosed too but things must take a different turn in Canada because I know nothing of a pathology report and the surgeon has mentioned that once the tumour is removed then I will know the status of the cancer.  So I guess I have the surgery thing figured out (for now) but wish I had a pathology report.  Did they get all that from the biopsy?   I pretty much had the rug pulled out from under me too.  You're lucky to have this place to vent and ask questions.  The people are amazing and if you need a ((((hug)))) they are plentiful.  I have only passed that initial shock and it does wear off a bit I fear the pathology report but take things one step at a time. If your mind goes to the worse cased scenario, as mine did, take it back slowly and own each step.  The early diagnosis is a very good thing, sounds like you have advanced med care so thats all a plus.  How old are you kids?  I have two who are 12 and 15. The 15 yr old is having a more difficult time than the 12 yr old.  I felt a lot better once I met with the surgeon so maybe that will help as you get a little further along too.   Hang in there!  Many (((((((hugs))))))))) your way!",
      "MessageIndex": 6,
      "PostDate": "11/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/749563",
      "Title": "Newly Diagnosed & Overwhelmed VRamos bogdany22"
    },
    {
      "AuthorID": "artsymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96357/profile",
      "Content": "Jan 30, 2010 09:44AM artsymom wrote: I had a mammogram last Thursday, they found the lump, which I can't believe I missed, and now have a biopsy and MRI scheduled for Monday.  Wondering how long I will have to wait for diagnosis.  The waiting is definitely tough.",
      "MessageIndex": 3,
      "PostDate": "30/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/747549",
      "Title": "The Waiting is the Worst... hopeful01 MBCR"
    },
    {
      "AuthorID": "artsymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96357/profile",
      "Content": "Jan 30, 2010 09:59AM artsymom wrote: Sounds like there are so many different types of biopsies.  My doctor never told me which one to expect.  Any idicators of which one they will do?",
      "MessageIndex": 5,
      "PostDate": "30/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/747549",
      "Title": "The Waiting is the Worst... hopeful01 MBCR"
    },
    {
      "AuthorID": "artsymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96357/profile",
      "Content": "Jan 30, 2010 10:08AM artsymom wrote: Thanks groundhog!  I've been worried about which type of bx I was having but that does make sense totally.  Thanks, that relaxes me a bit.  I am hoping that with my tests on Monday that I'll hear before the weekend.  Fingers crossed!  ((hugs)) right back at you!",
      "MessageIndex": 7,
      "PostDate": "30/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/747549",
      "Title": "The Waiting is the Worst... hopeful01 MBCR"
    },
    {
      "AuthorID": "artsymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96357/profile",
      "Content": "artsymom wrote: Hi Ladies, It has been awhile since I've been on the board and missed it greatly.  I have a surgery date which is March 17th, which I figure the Lucky of the Irish will be with me (I'm 50% Irish).  However as everyone knows life doesn't take a time out.  Some of you will remember that my boy had a seizure 2 days after we told him about the bc.  That was one thing.  Doctors medicated him and we were good.  A week ago we met with a neurologist that we were referred to and he (raving God complex) recommended taking him off of the meds because he didn't think it was epilepsy and putting him on something else.  This was based on the description of the seizures he's had over the years that when they happen because I have a history of seizures my husband usually sends me out of the room.  So unfortunately I really haven't witnessed many and didn't have clear descriptions of the event except for the last one which (2 days after we told him) lasted 7 minutes and was the scariest thing ever (so I thought).  He was not hearing what I was saying for some reason and seemed to have his mind made up.  Finally I asked him if he would like me to call my husband and he said, \"yes.\"  So I did on my cell phone and then he said, \"give the phone to me.\" He continued to badger my boy with questions because afterwards he told me many seizures are brought on by abuse so he had to make sure he wasn't being abused.  After he concluded that he lived in a happy home and had a happy life as he put it he recommended the med reduction.  We did so, I'm not a neurologist so took this as a good thing.  He said that he would order an MRI and an EEG and if they said he had epileptic patterns then he would put him back on the other medication.  (Sorry this is getting to be a long story)  My boy had had an EEG when he was 5 and the neurologist said then that he had epileptic patterns but because at that time all seizures had had a trigger he wouldn't recommend medicating a young boy but if, as he got older, they happened without a trigger then we would medicate.  When I mentioned this to the neurologist he scoffed at this report and asked where it was and why didn't' I bring it with me.  Long story short I picked up my boy from school Thurs at lunch so we could head to the MRI (city one hour away), stopped at Subway for something to eat, and he had a seizure in the restaurant.  I was alone with him and now conceded that THAT was the scariest thing I've been through (so far).  He had a mouth full of food and I was so concerned about him choking.  Thank God there were many angels in that restaurant and they all helped me and with 911 called the ambulance arrived shortly.  After a short stay at the hospital and a call to the neurologist (which he didn't return) we let him have a nap and then proceeded to the city so he could have his MRI.  Went well, went for dinner and then drove home.  Unloading from the truck at about 9:00 pm and my husband was opening the house up, I was unloading the truck and my boy went down again with another seizure but this time the truck door was between us so I couldn't catch him and my husband, try as he may, was too far away to catch him and watched him fall right back on his head on the cement.  Back to the hospital and this time to the city via ambulance due to the head trauma.  However during the wait at the hospital to get the iv in etc. My mother-in-law and my daughter show up and my mother-in-law starts in on me how I have to settle down with all this bc stuff and that I was going to be fine and that me carrying on about cancer was what was making this happen to my boy.  This when she has in total spent maybe 3 hours with me in the last 2 weeks.  I was dumbfounded.  In the ER room and she's giving me this lecture and got my daughter all riled up that I was wearing a cross and had cancer books all over the house and that that needed to stop.  That aside, we left for the city, had some excellent medical attn there, wonderful doctors who apparently none knew the neurologist because he's only been in the city for 3 weeks.  They moved up all the tests for my boy, sent the info to this neuro and we're to meet with him again.  They suggested my boy going back on the old meds and sent us home. So life has thrown me a curve ball in the middle of the curve ball and I'm a little overwhelmed. Setting up appts for my boy, my m-i-l giving me her take on things and oh yes, my basement gutted and under construction so hammering etc. with construction workers all over the place. This explains the feeling of overwhelmed, oh and I also have had an abscess near my tailbone that has been infected for over 3 weeks.  I'm on my fourth antibiotic and afraid that this won't clear up since my surgeon said, yes, that has to be gone before surgery.  I am worried that it wont' clear up before surgery and my surgery will be postponed.  I am still counting my blessings because my boy is fine, no more seizures since back on old meds, work is cleared up, have icp with my job, thank God, and good medical attention for the most part for me and my boy.  Great teachers for my kids, a wonderful counsellor provided through my employer, and many good friends.  Just a bit overwhelmed and trying to put the past behind me and move forward, stay positive, eat well and get healthy.  Love those around me and surround myself with things and people that empower me.  This bc is all about a major learning curve and I'm afraid I may have to cram in over the next few days what I need to know about a lumpectomy and pray to God that he stays with us throughout this journey.   Dx 2/5/2010, IDC, 1cm Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/749425",
      "Title": "Waiting for Surgery + Life = Overwhelmed x 2 artsymom artsymom"
    },
    {
      "AuthorID": "artsymom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96357/profile",
      "Content": "Mar 10, 2010 04:14PM artsymom wrote: Thanks so much for the responses.  I have calmed down a lot since the weekend and am feeling quite a bit better.  I think the abscess has calmed down too but I developed thrush from all the antibiotics, surprise surprise.  Anyhow the med I got for that and the stupid yeast infection put me in a sad way yesterday.  I did mange to get outside today and go for a long walk and try to zap that abscess with exercise.  I appreciate all that was said about my kids and my MIL.  BC does really turn the world upside down.  I was convinced I could manage without getting all emotional, ya right. What was I thinking?  I have decided to let the machine answer the calls and have some quiet, don't have to get 1001 things done and take time for myself.  Made some banana bread and threw a frozen chicken in the oven.  Thanks lindasa for the insight to the 15/16 yr old mind.  I am trying to speak more to my daughter but she's one tough nut to crack.  Bullet proof and never has wanted to talk about anything personal ever.  I will keep at it though because for her sake I don't want her to have regrets as you expressed you personally experienced.   Yes, this is a great place to vent.   My husband and I will listen to the neurologist and see what he has to say and then decide if we will stay with him or move on to a different doctor. Thanks again for all the comments and the ((((hugs)))) Sometimes I am so scared and it helps to come online and get some advice or just hugs, it's all good!",
      "MessageIndex": 5,
      "PostDate": "10/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/749425",
      "Title": "Waiting for Surgery + Life = Overwhelmed x 2 artsymom artsymom"
    }
  ]
}