{
  "AuthorID": "Aruba",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
  "Posts": [
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Aug 1, 2012 04:23PM Aruba wrote: Marilyn...you go girl!",
      "MessageIndex": 277,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Aug 3, 2012 01:53PM - edited Aug 3, 2012 01:53PM by Aruba Glad all went well Tazzy! You are a trooper! Take your time with rest and pain meds! So glad you are on the other side!!",
      "MessageIndex": 323,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Sep 13, 2012 10:44AM Aruba wrote: Thanks heidihill. Went to do another ct scan with it today. Nothing on chest, just a button for me to hold down and then release it if i have issues. Was easy but i wonder if i am inhaling and expanding lung. Is it more in the radiation area vs normal breathing. Guess heart more important than lungs. Will ask RO next tome i ser het",
      "MessageIndex": 2,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/793315",
      "Title": "Rads with breathing device to protect heart Aruba msphil"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Aruba wrote: Got call from RO just now that cat scan shows my heart close to chest wall so wants me to do rads with breathing device. Has anyone had this experience? Please fill me in. I now have to go downtown instead of lication 5mins from work for sll treatment but worth it to protect my heart. Nothing easy about this disease. Please fill me in!! You can't control the wind, but you can adjust the sails Dx 7/12/2012, IDC, Left, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Surgery 7/19/2012 Lumpectomy: Left; Lymph node removal: Left, Sentinel Radiation Therapy 9/17/2012 3DCRT: Breast Hormonal Therapy 11/13/2012 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/793315",
      "Title": "Rads with breathing device to protect heart Aruba msphil"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Sep 13, 2012 07:35PM Aruba wrote: Hi Lee7, So glad to hear you had a positive experience with this.  I was just looking up the technical terms for this on google..and found an article..written by my RO!  I know I am in good hands and would drive along way to protect my heart.  I just was wondering if the expansion of the lungs puts the lungs more in rads way.  I will ask that too. I had onco score of 26 and decided against chemo.  This RO said I was candidate for clinical trial for rads that was testing doing 3 weeks of stronger dose vs traditional 6-7 weeks lower dose.  I went ahead and did it and got randomly placed int the traditional 6-7 weeks.  I am curious to see if I have this box on chest too.  Hopefully will start next week. ",
      "MessageIndex": 4,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/793315",
      "Title": "Rads with breathing device to protect heart Aruba msphil"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Aug 22, 2012 02:08PM Aruba wrote: Hi ladies. Only 4 hours sleep last night as i have this chemo decision to make and am going back and fourth. I dont want to have regrets but having a hard time doing TC for 4% lowering of risk. I wake and immediately feel like i am in a nightmare as bad if not worse than orig dx time. I admire you for being brave and tackling this monster one step at a time. I live in Solon and no matter what i decide would love to join your meet if i can?",
      "MessageIndex": 544,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Aug 22, 2012 02:18AM Aruba wrote: Hi Fellow Buckeyes!  I have just been jumping around..so scared today I guess and found you!  I am not in chemo yet but have huge decision to make.  Had lumpectomy about 4 weeks ago and had to wait for the MO to get back from vacation and my Onco test score.  Met MO today and found out I am in intermediate range of 26 (1-18 no benefit from chemo, 19-30 intermediate and no decision on benefits of chemo, above 31 chemo big benefits).  I have a score of 26 in the gray area.  The MO of course said chemo may benefit and I would get 4 DX of Cytoxin/Taxotore every 3 weeks.  I know many have so much more to go through than me....but if this chemo is only going to reduce my chance of recurrence by 4%, I am freaked out.  So I can opt for chemo then rads or go to just rads.  I have a headache as this all happened this morning then I went to work.  So, just wanted to say hi and maybe I'll be back with you doing chemo in 2 weeks.  My head feels like it is going to explode from info overload and recalling the nurse spending an hour today going over the SE I may have...    anyway, I am up in Cleveland and wanted to say hi to all you brave women.",
      "MessageIndex": 533,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Aug 24, 2012 12:38AM Aruba wrote: Hi all. kidsandlabs, thinking of you through all this..getting things moving ahead is a positive in this war!  Kelloggs, thanks for asking about me!  I am not going to do chemo.  I was not planning on it but the intermediate onco score knocked me for a loop.  I have called the place that did the testing to go over my results with a fine tooth comb.  I have discussed it with my hubby, son (23), daughter (25), brother and father as this could well affect them too.  All come to same conclusion that they will support me whatever I decide but that to go through all that for a 4% reduction in recurrence risk is not worth the possible se long term etc.  I will have to make peace that if this monster does come back, I did the bigger things like rads and AI...and it was meant to be.  Still giving myself a day to be sure and will call the MO tomorrow to head me toward the RO for rads.  I hate this disease in that it is not just a one and done like appendicitis surgery or something and also that the Dr's often can give you stats and odds and universal recomendations but at the end of the day, you are the one to make the decisions on various treatment options.   ",
      "MessageIndex": 552,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Jun 30, 2012 02:30PM Aruba wrote: Thanks for responding, I of course will do a biopsy, I am just questioning a surgical excision type vs a core biopsy.  I feel that the surgical one will remove the mass and get us past removal no matter what the results? ",
      "MessageIndex": 2,
      "PostDate": "30/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789904",
      "Title": "Can needle biopsy do more harm? Aruba domesticwomen"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Aruba wrote:   Not happy to be here, but thankful to all for having a forum for me to be a part of...  I had yearly mam a week ago, call back for 2nd mamm and then ultrasound.  Birad rating of 4..was told 5mm mass with calcification but got radiology report that shows mass of 1cm X .5mm x.5mm.  They make you have mandatory appt with breast surgeon before scheduling biopsy.  I have that dr. appt. on Tues.  I have tried to educate myself before appt.   They gave me literature on core biop. wih ultrasound.  My question is why would i not want to have this surgically excised as to 1. get rid of it and 2. have less chance of any bad cells spreading by the holes left from needle biopsy.  I know you are not Dr's and I will ask at that appt.  But since I have not found any info on this subject, I must be missing something.  Thanks for being there...as I have a bad feeling about this. You can't control the wind, but you can adjust the sails Dx 7/12/2012, IDC, Left, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Surgery 7/19/2012 Lumpectomy: Left; Lymph node removal: Left, Sentinel Radiation Therapy 9/17/2012 3DCRT: Breast Hormonal Therapy 11/13/2012 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789904",
      "Title": "Can needle biopsy do more harm? Aruba domesticwomen"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Feb 15, 2014 03:38PM Aruba wrote: Genny, I am on the eastside, Solon.  Had biopsy, lumpectomy and radiation all downtown.  Sounds like you have a good support team around and some who have walked down this path.  Know that you are not alone...enjoy that vaca and feel free to private message me anytime in case I don't happen to get back on this thread.",
      "MessageIndex": 44,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817993",
      "Title": "Waiting for Results, Anxiety is HIGH ldyblu77 sydney2013"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Jul 31, 2012 03:32PM - edited Jul 31, 2012 09:12PM by Aruba  HI LindaLou53,  You, lovely lady, are an INSPIRATION!  I am newly DX just a few weeks ago so obsessively am reading all the boards on here..for comfort, education and because for now this is all I think about.  I saw your response today to the person asking about nodes etc.. and wanted to stand up and applaud you for your words of wisdom, your calm demeanor and your positive attitude.  I am 53, have never had any illness before and no family history etc.  I am early in this process, having quickly had a lumpectomy with no nodes involved, etc. I am awaiting Oncotype testing to see if chemo would benefit me before rads.  I am trying to be positive too and realize I am lucky with early DX etc..but it still takes the wind out of you.  I will keep your words close to heart and think of you when I worry about the unknown.  I salute you!  Hugs ~Aruba",
      "MessageIndex": 1,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791380",
      "Title": "Annual Update - LONG ONE...but Still Good News! LindaLou53 NancyD"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Feb 15, 2014 09:41AM Aruba wrote: Hi Genny, Just wanted to give you a hug and shout out from a fellow Clevelander!  Where are you going for all your testing?  We are lucky that in this city we have the best medical facilities around.  I had all my treatment in 2012 at UH and they were great!  This is a rough time, no doubt about it..once that plan is in place , trust your team, go relax and then get ready to kick this cancer's a$$  to the curb!  ",
      "MessageIndex": 40,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817993",
      "Title": "Waiting for Results, Anxiety is HIGH ldyblu77 sydney2013"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Nov 12, 2012 01:34PM Aruba wrote: Fingers crossed for benign results.  Should it be the other way though, get a copy of your biopsy results for your own records and I'd suggest taking someone with you to next dr appt as you won't hear it all...also notepad with questions ready as it is hard to remember everything you have thought of....hope you won't need any info on here!!",
      "MessageIndex": 10,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/796226",
      "Title": "Still in denial volleymom77 Sickofpink"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Nov 14, 2012 01:33PM Aruba wrote: I know the waiting is unbearable and not knowing when to really expect that call is tough.  I am sure your nerves are on edge which is understandable and may be adding to the way you are feeling.    Where health facility are you working with?  AKron General?  Just curious as I am just up route 8 from you!  Hang in there!!! ",
      "MessageIndex": 15,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/796226",
      "Title": "Still in denial volleymom77 Sickofpink"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Nov 16, 2012 05:26PM Aruba wrote: Hugs coming your way! When you say Pagets too..what other type have they told you as well?  Yup, info overload will be next for until you get full diagnosis and plan in place.  That is what all these tests are about..and perhaps more waiting for results.  YOu are indieed in the worst part with all this wait and see...not that chemo or surgery is a walk in the park, but you do feel better mentally knowing there is a plan in place to kick cancers A$$~~  Dr's appts and tests will be fast and furious now so take the weekend to plan ahead a bit and get organzied where you can and keep busy.   I know its hard and holiday around the corner..but you will get through this one step at a time!",
      "MessageIndex": 27,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/796226",
      "Title": "Still in denial volleymom77 Sickofpink"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Jul 13, 2012 06:40PM Aruba wrote: Just got back from Dr.  I am IDC, 1cm, ER+,PR+, HER2-.  I am going to have a lumpectomy on Friday and he'll check SLN at same time.  If that comes back negative (I PRAY!!!!) then I will have radiation followed by a hormone drug of some type.  I so hope that is all that I have in front of me...who wudda thunk that I am wishing for this to be it and that is it when days ago, this was last thing on my mind.  I really did not feel any pressure, as I want to take this one step at time, but don't want to waste any time either.  Thank you for being a support that understands this better than anyone!  I am grateful for this site.",
      "MessageIndex": 6,
      "PostDate": "13/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790487",
      "Title": "Just got the news-what shall I ask? Aruba christina0001"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Aruba wrote:   As I had feared yet anticpated, I just got the call.  I will meet with Dr. tomorrow and learn more.  All I know now is that it is IDC, at least on US about 1cm, ER+, PR+ and HER2-   which I think are all good considering.  He will go over options but sounds like lumpecotmy and radiation and he'll check a few lymph nodes to know what else I may need to do.   Sort of calmer than I thought I would be as I knew from last meeting with him, he thought this was cancer from looking at the films.  What else do I need to ask tomorrow?  I have tried to read up but now not sure what else needs to be asked if not told?  Thanks everyone.  You can't control the wind, but you can adjust the sails Dx 7/12/2012, IDC, Left, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Surgery 7/19/2012 Lumpectomy: Left; Lymph node removal: Left, Sentinel Radiation Therapy 9/17/2012 3DCRT: Breast Hormonal Therapy 11/13/2012 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790487",
      "Title": "Just got the news-what shall I ask? Aruba christina0001"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Nov 15, 2012 02:13PM Aruba wrote: So sorry to hear it volleymom...take a deep breath!  Tomorrow you will set the stage for plan of action which will be a heck of a roller coaster ride but steps on the way to kicking this cancer in the a$$.  Take someone with you tomorrow and any notes or questions.  You'll get alot more info fast and furious and may have major decisions to make depending on your status. I don't think stage is determined until lymph node status is known.  They may have said grade 3 vs stage 3... (grade is different than stage.).  Also did they say what type of cancer, IDC (invasive Ductal), ILC (Lobular) etc??..all this info will now become available and help to plan the treatments.  You may want to post what you do know on the just diagnosed board here as many will give guidance on the info you have so far etc.   You will be ok and while this is a wilde roller coaster ride that no one wants to be on.....we here get it and will help you through!!  Once you find out what type of cancer, there are specific boards on here for each one as well as ones for getting through each phase of treatment!   I do know your head is probably spinning!!  Mine was too just a few short months ago and I was numb...but you will now get your armor on and become a warrior!!  Hugs to you!",
      "MessageIndex": 19,
      "PostDate": "15/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/796226",
      "Title": "Still in denial volleymom77 Sickofpink"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Nov 12, 2012 01:05PM Aruba wrote: Volleymom and Carolyn,  Trust that this waiting is the worst part.  No matter what the outcome, just knowing and having a plan put in place if at all needed is a relief in itself!  I hope you can post on this site that all came out ok..but know if not that this site is the best and to rant, rave, scream and cry..ask any question and vent away.  We here do get it and have been in your shoes.  You will get through this regardless as you are stronger than you know!     Volleymom--a neighborly hug to you!  I live in Solon.  Please let us know how you get on!  We do care! ",
      "MessageIndex": 7,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/796226",
      "Title": "Still in denial volleymom77 Sickofpink"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Oct 22, 2012 02:32PM Aruba wrote: Meece, thanks for the link for the bracelet!  I ordered one and copied the link to a few other threads on BCO so others could get one too. ",
      "MessageIndex": 13786,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Aruba wrote: Hi ladies. I met with my RO first time today for rads and am going to do a clinical trial. Will find out in few days if i get standard 6 week radiation or slightly higher dose for three weeks which has been studied and used often in Canada trial. SE the same and in all studies so far no difference in outcome. This is stage 3 clinical trial so this one now gathering data on much bigger pool of people. I love my RO and she feels very good about this. Guess either way i can say i am helping those in the future get best treatment possible. Had CAT scan and bloodwork today. Will get call about next steps and which rad direction I go by end of week. Needed to be within 50 days of surgery and have one other medium risk factor (mine is that oncotype at 26). We shall see.. I have never had to make so manymajor decisions in such a short time. You can't control the wind, but you can adjust the sails Dx 7/12/2012, IDC, 1cm, Stage Ia, Grade 2, 0/1 nodes, ER+/PR+, HER2- Surgery 07/20/2012 Lumpectomy (Left); Lymph Node Removal: Sentinel Lymph Node Dissection (Left) Edit Delete You can't control the wind, but you can adjust the sails Dx 7/12/2012, IDC, Left, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Surgery 7/19/2012 Lumpectomy: Left; Lymph node removal: Left, Sentinel Radiation Therapy 9/17/2012 3DCRT: Breast Hormonal Therapy 11/13/2012 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/793055",
      "Title": "Rads clinical trial here I come! Aruba christina0001"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Jul 30, 2012 10:38AM - edited Jul 30, 2012 10:58AM by Aruba Hi ladies. Am gonna jump in this pool :). I have had a whirlwind 3 weeks since dx after 1st abnormal mamm ever. No family hist etc. a real blindside. Had lumectomy and got path reports friday. Now the wait for Onco test to see about chemo before rads. I have medium grade and 100% ER with 30% PR. Grade 2... So am worried ill be in gray area with decisions to make. First appt with MO to discuss results in few weeks. So in the dreaded wait and see mode. I am stage 1. For that i am thankful as well as this forum to meet all of you! ~Aruba",
      "MessageIndex": 13292,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Aug 24, 2012 01:37PM Aruba wrote: I am not having chemo even with higher intermediate score on Onco dx. But have been told with ER+ the Hormone pills are a must and decrease risk of recurrence in half vs the small decrease from cho in my case. I had no LVI and no nodes involved. So rads and then hormones in my future. Have to research and gather the info on your specific case and decide with MO. No cookie cutter answers with BCno matter the stage.",
      "MessageIndex": 13399,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Jul 14, 2012 04:48PM - edited Jul 14, 2012 04:49PM by Aruba Right there with you Mlo.  Mamm on 6/26 with followups, U/S, Biopsy and the call came on Thursday at dinnertime.  I told the surgeon I want to see him asap so traveled to hospital downtown on Friday for appt.  Went through everything and options and having lumpectomy and SNB this Friday.  Feels like i got on a rollercoaster (and i hate them!) and am just holding on for dear life at this point.  Have lost about 10 lbs in these 2 weeks as appetitite not there...but it is all stress I know as I usually have an excellent appetite .  I asked my BS at first ever appt last week if he thought it was cancer by his experience and looking at all the films, even before the biopsy.  He said pathology had to look but he did think it did look malignant...this to me frankly was ok to hear as i got through the initial shock and went into education mode finding this site etc...even before the biopsy.  I became more realistic than optimistic and so here I am ......scared but wanting to move ahead and praying for clear lymph nodes and margins.   Hugs to all.....",
      "MessageIndex": 11,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790564",
      "Title": "So scared mlo69 camillegal"
    },
    {
      "AuthorID": "Aruba",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155292/profile",
      "Content": "Nov 23, 2012 01:09PM Aruba wrote: Lully, I answered  your other post but thought I would post here too... I had 1.5cm, no nodes, clean margins, lumpectomy.  Had Onco score of 26.  I am 53 and no history of cancer except grandfather who died quickly of leukemia at 61.   My MO said they had to recommend chemo as it may have some benefit (in that case think they must recommend).  My reduction of recurrence risk went down 4% more with chemo vs just hormonal (I take Arimidex since post menopausal).  I chose not to have chemo and moved forward with radiaition and now Arimidex.  I had full support of my team.  I think you have to weigh the possible side effects and most important... being able to live with your decsion with no looking back no matter what happens in future etc.  I was fine with that and felt quality of life as important as anything.  I called the Oncotype company to make sure we all were reading results correct etc.    Toughest decision I had to make through all of this!  I dug deep within myself and also had discussion with each family member...this decision could affect them too. Hugs to you as I know this is tough either way! Please note that I had no lymph node invasion of any involvement with sentinal node biopsy...I very well could have opted other way if I had.  I did do 25 rads and 6 boosts.  Also keep in mind that from reading here, many have SE with the hormonals...once I made this decision on chemo, I knew I signed up for rads and at least 5 year hormonals no matter what.",
      "MessageIndex": 2,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/796591",
      "Title": "Has anyone decided not to do chemo? Lully adagio"
    }
  ]
}