{
  "AuthorID": "arwyn54494",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65363/profile",
  "Posts": [
    {
      "AuthorID": "arwyn54494",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65363/profile",
      "Content": "arwyn54494 wrote: I'm soo frustrated, I'm not sure what to do. It started in Feb. with pain in my left breast. Since I've had a hysterectomy with removal of my ovaries 10 years ago, I knew it wasn't hormonal. (I'm 39 now) I called my Dr. & he ordered a screening mamo, which showed nothing. On the day of the mamo, a small sore appeared on my skin. Both breasts looked red - like you can see capillaries. I was put on antibiotics for the breast sore & also bronchitis. Neither one got better so they switched meds 3 different times. I had a fever from the upper respiratory infection & also I very high white blood count. They put me in the hospital for a few days on IV meds for an unknown infection. Since the breast sore still hadn't healed, the infectious disease Doc sent me to the surgeon to cut out the sore to biopsy & stitch me up so I would heal. (this was about six weeks after the sore appeared & I got sick) I ended up having a fever for over six weeks. During this time my breast skin looked worse. The areola looks lighter - almost brownish or yellowish instead of pink. There is a reddish slightly raised narrow rash-like border around half of the areola of my left breast. The nurse practitioner who specializes in breast exams said \"That's very strange. I've never seen anything like that before.\" When she went & got the breast surgeon he told me that it didn't look like any inflammatory breast cancer he's ever seen. He said I have capillary prolifferation on my breast skin but he doesn't know why. My biopsy from the lesion came back vascular hemangioma. When I went back to the breast nurse two weeks later for a recheck, my skin looked worse. She made me wait for the doc to get out of surgery so he could look.They agreed I should have an ultrasound. I wanted an MRI because I read about IBC, but I don't meet the criteria for my insurance. The US was also negative. Since then, the skin of both breasts seems thicker with very light pin hole dents on some of the skin. I called the cancer hotline to find out if capillary prolifferation can be a sign of IBC & she said yes, I should get another opinion. On Thur. I went to a breast center & saw a nurse practitioner there. She told me that the IBC cases she's seen were extremely obvious. She said you didn't have to look close to see the orange peel skin. Both my breasts have become harder in the past couple weeks,(& kind of lumpy) but she said the cases she's seen that the breast was as hard as a bowling ball.The blue veins are also really prominent on both my breasts. The edges of the areola also aren't well defined and round or smooth anymore. They took one skin biopsy on Thur. because they didn't know what else to do. They don't think I have IBC, but they also can't tell me what could be causing all these changes. I should be getting the results back on Mon. Does anyone have any ideas for me? Have you had breast changes like this? If the biopsy is normal or some kind of vascular hemangiona, should I just let this go & hope for the best? Tina Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704279",
      "Title": "skin changes arwyn54494 NancyD"
    },
    {
      "AuthorID": "arwyn54494",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65363/profile",
      "Content": "May 8, 2008 01:16AM arwyn54494 wrote: My MRI results came back - no sign of inflammatory breast cancer! I guess my next step is to see a dermatologist. I'm soo relieved. I think I can be pretty sure that cancer would definately show up on an MRI. Does anyone know the answer to this? I know that IBC is hard to diagnose - that's why I've been so scared these last few months. I'll look up stasis dermatitis to see if that could be what's going on with me too. Thank for for sharing your info with me - my mom & my friends couldn't really understand the fear like you guys can. Just reading about what you all are going through makes me want to do something to help. I can't financially, but if I could volunteer to help  in some other way, I'd be very interested in doing that. Let me know if you have any ideas. Thanks!",
      "MessageIndex": 12,
      "PostDate": "08/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704279",
      "Title": "skin changes arwyn54494 NancyD"
    },
    {
      "AuthorID": "arwyn54494",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65363/profile",
      "Content": "Apr 25, 2008 02:54AM - edited Apr 25, 2008 02:55AM by arwyn54494 well, thank God the biopsy came back neg. They recomended I see a dermatologist, I guess that'll be my next move. The skin continues to look worse - getting even more reddish purple. I also have a little mark that looks like a bug bite today & 2 bruises that look very dark. Each day the skin gets rougher - more like leather. They only did a very small skin biopsy.(& not even from the worst looking area) I'm still leary about inflammatory breast cancer - there's something very wrong. I appreciate all your thoughts & prayers. It means so much to have you write back to me. Your comments made me feel a lot better. Thank you so much. ",
      "MessageIndex": 4,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704279",
      "Title": "skin changes arwyn54494 NancyD"
    },
    {
      "AuthorID": "arwyn54494",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65363/profile",
      "Content": "May 1, 2008 07:13PM arwyn54494 wrote: The clinic called at the beginning of the week to tell me that they're going to fight with my insurance co. to try to get me an MRI. She said that the surgeon & her were talking & decided that they didn't want to miss something. She said we should wait with dermatology 'til after the MRI. I'm sorry to hear about your troubles. I don't know about you, but I tend to obsess over certain things - possible breast cancer being one of them. I've been trying to let it go & actually pray about it & it seems to be helping me cope with this and all my other medical problems. Glad to hear that you're going to go to a breast clinic - it's better to be safe than sorry. How exciting that you're having a baby! I'm 39 & I'm a grandma - he'll be 1 in July. Keep me posted too. I'll be sending happy thoughts your way.",
      "MessageIndex": 7,
      "PostDate": "01/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704279",
      "Title": "skin changes arwyn54494 NancyD"
    },
    {
      "AuthorID": "arwyn54494",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65363/profile",
      "Content": "May 6, 2008 03:19AM arwyn54494 wrote: I 'm very happy to hear your diagnosis isn't IBC.When a doctor tells you not to worry, then can't really explain what's going on - how can you help but worry? I had my MRI tonight & am very anxious to get the results. Nancy - I didn't know that an MRI could actually show the nests or sheets of cancer. I knew it could show skin thickening and lumps that might not show up on a mammo or US. Can you tell me what else could cause the pitted skin besides IBC and mastitis? Have you ever heard of some type of vascular disorder that could cause this or IBC rash or redness that loooks like capillaries or vessels on part of the breast? Maybe I just need to quit asking all these questions & wait to see what the doctor has to say.(although so far I haven't gotten any answers from the doctors) Thanks for the info Nancy & for the good news ksp.",
      "MessageIndex": 10,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704279",
      "Title": "skin changes arwyn54494 NancyD"
    }
  ]
}