{
  "AuthorID": "AryaS",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
  "Posts": [
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "AryaS wrote: Hi I had a baseline ultrasound to monitor tamoxifen usage and learned that I have a 1.6cm complex cyst with a possible mural nodule.  I spoke with my OB GYN who wants to recheck at the end of the month but is urging ovary removal. I haven't had a period since my second chemo treatment in June 2013.  My FSH test came back a 60 (2 years ago it was a 5) which proves I am post menopausal at age 42. My question is after the ovaries are removed, will my post menopausal symptoms be the same as they are now or will they worsen? Has anyone had experience with this? Dx 4/2/2013, IDC, Stage IIIC, Grade 1, ER+/PR+, HER2- Surgery 4/18/2013 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Chemotherapy 5/28/2013 AC + T (Taxol) Radiation Therapy 10/1/2013 Breast Hormonal Therapy 11/20/2013 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/823631",
      "Title": "Ovary Removal Questions AryaS AryaS"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "Sep 9, 2013 08:48PM AryaS wrote: I have one piece of hair on my right temple that never fell out. It was strange how it just held on. I started getting a fuzz of hair during Taxol and now everything has finally evened out and I have about 1/4 inch of fuzz all over. And it seems to be growing! It is filling in surprisingly fast. Interestingly, my last round of Taxol last week completely took out my eyebrows and most of my eyelashes. Bummer. It is really strange how this works.",
      "MessageIndex": 19480,
      "PostDate": "09/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "May 24, 2014 01:17PM AryaS wrote: I had curly hair before chemo but now, it is just crazy, super tight curls that grow straight out from my head!  I was getting so frustrated and wearing lots of hats.  One thing that has helped tame my chemo curl is to leave the conditioner in my hair. Just regular conditioner.  I don't wash it out.  It weighs down my hair and relaxes the curl.  Also, I had all this fuzzy white hair on my face and neck after chemo.  My sister calls it lunago?  I waxed it several times and it has finally not returned.  It took several months though. Hang in there.",
      "MessageIndex": 20356,
      "PostDate": "24/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "Sep 14, 2013 02:22AM - edited Sep 14, 2013 02:28AM by AryaS I am sorry you have to go through this. I have two boys myself so I know this is tough. I just had my last chemo a little over a week ago. 1. my port placement was done in a hospital surgical room. It took about two hours total. I don't remember much of it. It was not bad. The next day, my neck hurt a lot and I took it easy but it was my son's birthday and we still had a little party. It was manageable. It hurt for the next couple of days but was better quickly. I loved having a port and never had a problem with it. It made everything easier because no one can ever find my veins. I just had mine removed on Wedenesday in the surgeon's office and that took 20 minutes. It was very easy. Both times, he did not stitch my skin but used surgical glue and the scarring was very minimal. 2. I cut my hair into a short pixie cut before chemo on the advice of my oncologist. With AC, she said the hair goes on day 14 after 1st chemo. I ended up buzzing it myself to about an inch around day 9. My scalp got very itchy for about a week before it fell out. My hair all came out the night of my 2nd chemo treatment. The cutting of my hair I stages was helpful for me and my boys in accepting the loss. My hair is now coming in but it is blonde and fuzzy! We are having a good laugh about that too. I didn't start to lose brows or lashes until Taxol. 3. For me, the side effects for AC were mostly nausea. The nausea medication made me very tired as well. I also had some disorientation. I did get mouth pain but no mouth sores and I had trouble with indigestion and diarrhea. I did dose dense every two weeks. They told me Taxol would be easier. I had no nausea but I had some joint and muscle pain. A lot of people are doing weekly Taxol and I have heard the side effects are easier. 4. Some people have taste bud problems on chemo. I had a hard time tasting salt while on AC. I tried to eat healthy but some days I felt so yucky, that I ate comfort foods. 5. The steroids made me gain weight. Some people get through ok. I have some work to do now that chemo is over. A lot of mine is puffiness from the steroids so I am hoping losing what I gained won't be too bad. I am trying not to beat myself up about it and you shouldn't either. This is all temporary. 6. My boys took the news fairly well and if anything, this has bound us together even more than before. Our life is filled with a lot more hugs and I love you's. My friend who is a therapist advised me to be up front with them that we are going to do everything we can to fight this cancer and that this will be a rough time but we will get through it together. There are some great books out there dealing with this topic. I got some for my sons. One I think was entitled, \"The Year My Mom Went Bald\" and was a chapter book for kids 9-13. It even talks about how your child can help out. My 12 year old did a load of laundry the other day. I couldn't believe it! I know this is really rough. This site has some great threads on things you can do to prepare for chemo; supplies to purchase, etc. I found it a great resource before I began treatment. I hope you get some great responses and I wish you all the best.",
      "MessageIndex": 1,
      "PostDate": "14/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/810936",
      "Title": "Scared and Anxious. Looking for support/advice Jaybird26 Jaybird26"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "Apr 22, 2016 10:42PM AryaS wrote: Brookside, my husband and I were just talking about me seeing an allergist last night. I think that is a great idea and I am going to look into it. Thanks.",
      "MessageIndex": 3458,
      "PostDate": "22/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "Apr 22, 2016 01:26PM AryaS wrote: Thank you!",
      "MessageIndex": 3454,
      "PostDate": "22/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "Aug 11, 2013 04:36AM AryaS wrote: My Onc gave me a prescription mouth rinse. It's called \"Duke's\" or something like that. It really helps with the burnt tongue feeling.",
      "MessageIndex": 1,
      "PostDate": "11/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/809084",
      "Title": "Suggestions for 'burnt tongue' feeling on Taxol? ggtexs SheilaB330"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "Apr 22, 2016 10:12AM AryaS wrote: Hello- I am writing to you because I saw my oncologist today and we discussed the problem I have had with anti-hormonal drugs. I seem to be allergic as I swell and have breathing problems on top of the typical side effects associated with the drugs. I lasted 8 months on Tamoxifen and it gave me a huge ovarian cyst and a uterine polyp as well as really terrible asthma I was on Arimidex for three months until it made my tongue swell to twice it's normal size. It's been the same story with all of them but I have managed to accumulate about 2 years on anti-hormonals. Today, after another failure,she suggested we try something \"out of the box\" She wants to start me on injections of Faslodex beginning next week. We need to get approval from my insurance because it is traditionally used for Stage 4 but she thought insurance might give me a go considering my stage 3C diagnosis and 35 positive lymph nodes at surgery three years ago. I have been reading about the drug and I am skeptical simply because the side effects seem to be the same as the other anti-hormonals only now there is injection site pain too and if I have a bad reaction, it's not like I can stop taking it since it is a long lasting injection. At the same time, I am willing to try anything if it can possibly help me. I know it would probably be more effective to post in the Faslodex thread but since I am not Stage 4, I want to respect the group and am posting here. I would love any insight and perspective from those of you who take this drug. Is there a way i could get permission to post my question on the Faslodex thread? I really need advice and insight and i would appreciate any help. Thank you for your consideration.",
      "MessageIndex": 3451,
      "PostDate": "22/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "Aug 31, 2014 10:02PM AryaS wrote: I just had my OBGYN get ready to schedule my ovary and tube removal.  I have a complex cyst on my right ovary that is causing some cramping.  I am 42 and post menopausal since chemo.  My FSH is 60.  I am on tamoxifen but am not tolerating it very well. Will my menopause side effects increase once my ovaries are gone or is what I've been feeling (hot flashes and such) all there is?  Any post menopausal women who then had ovaries out care to share your experience? I was set on getting this done but after reading this thread am having second thoughts.  My tumor was high er+ and pr+.",
      "MessageIndex": 26,
      "PostDate": "31/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/819405",
      "Title": "Should I get a prophylactic oophorectomy? surfette Brip1geneticmutation"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "Apr 10, 2013 10:27PM AryaS wrote: I am going to have the expanders put in on the day of the surgery. I will lose both nipples and the aereola at least on one side. They tattoo the aero las at the end of reconstruction, like a year down the line. I found that little factoid surprising. The MRI was not bad as long as you find a way to distract yourself. I meditated and counted my breaths trying to push out all other thoughts. It worked mostly. I also imagined myself in a secret cave in a forest. Cheesy, I know. The contrast was not a ton of fun but the technicians were really nice to me. They say most people do not get sick from the contrast but I did. I was embarrassed but they told me I was fine as long as I didn't move my boobs. I put my head back down and we finished ok. The frustrating part for me is that the MRI could not discern between dense breast tissue and possible cancer so it was fairly inconclusive. My bio mom said she was never offered an MRI so I feel pretty fortunate I got one. This is really serious stuff. Most of the time I try to be strong. My surgeon said that with my age I will most likely need chemo and that threw me for a loop because the oncologist was withholding judgement on chemo until the surgery is done and the nodes and Onc score come in. The oncologist prescribed me Ativan to help with stress and sleep. I truly do feel better having one a day. I am trying to be prepared. I'm just waiting for my surgery date. I'm ready to get going on kicking this cancer's butt. At the same time, I'm terrified. Hugs to all of you going through this. I joined here the night before my mammogram and this place has been a great source of information and comfort.",
      "MessageIndex": 3,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/803108",
      "Title": "Diagnosed last week AryaS dwill"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "AryaS wrote: Hello This has all felt like a whirlwind.  I met with my general practioner last Friday 3/29 because I had itchy nipples and my right nipple had inverted.  My doctor told me she didn't like the look of the nipple and sent me to the main office for a mammogram and ultrasound.  I had that done on 4/1 and they found a mass behind the right nipple.  Needle biopsy was done right then and the next day I received my diagnosis.  That Tuesday evening, I met with my \"Nurse Navigator\" for about three hours. She gave me a rundown of the process and my options.  I had bloodwork done (normal), took the BRCA test (I am 40 and my bio mom went through breast cancer last year) and took a chest x-ray (clear). That Thursday I spent the morning having an MRI of both breast and then later that day I met with my Plastic Surgeon (my surgeon was on vacation last week) and that evening, I met with my Oncologist.  Lots of information.  Lots of options.  My tumor is very similar to my mother's tumor except that mine is \"well differentiated\" and hers was much more agressive.  We have the same receptors.  I met with my surgeon yesterday.  We are starting the ball rolling on a double mastectomy with reconstruction.  She said it will take a couple of weeks to coordinate the schedule.  I should expect to have my surgery at the end of the month.  I was actually hoping it would be sooner.  She told me that due to my age, i should expect to get chemo and depending on my nodes, radiation.  The ultrasound showed the tumor to be around 2cm however due to my dense breast tissue, the MRI says it could be up to 5cm.  This has me confused.  Which test is more trustworthy?  The doctors all keep telling me that this is \"Highly Treatable\" but I am still really scared.  I have two boys age 7 and 11 and I worry for them.  I guess I am just looking for support. I started a blog for my friends and family but I think they are just so shocked by all of this.  They tell me I am strong and fiesty and that I will fight through this...but I don't feel strong.  I just feel scared. 4/2/2013, IDC, ER+/PR+, HER2- Dx 4/2/2013, IDC, Stage IIIC, Grade 1, ER+/PR+, HER2- Surgery 4/18/2013 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Chemotherapy 5/28/2013 AC + T (Taxol) Radiation Therapy 10/1/2013 Breast Hormonal Therapy 11/20/2013 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/803108",
      "Title": "Diagnosed last week AryaS dwill"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "Apr 11, 2013 09:48AM - edited Apr 11, 2013 09:49AM by AryaS I am so sorry that so many of us have to go through this. Keanna- I would find another surgeon. All of my team have been quite optimistic. They give real facts but Ifrom what I've gathered we are all on board to fight this. A \"death sentence\" is not helpful for you. :(. I am sorry someone said that to you. My husband was surprised that I was opting for a double mastectomy until my oncologist said that we only have this one shot now to cure this. After that, my cancer will only be treatable. Yikes. And for clarification, I saw the breast surgeon Tuesday and she is the one who suggested that I will need chemo and possibly radiation because of my young age. The Plastic surgeon had no opinion on post op treatment. Now the really stressful part is waiting for my surgery date. I really want to get this done and get some answers.",
      "MessageIndex": 6,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/803108",
      "Title": "Diagnosed last week AryaS dwill"
    },
    {
      "AuthorID": "AryaS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175123/profile",
      "Content": "Apr 12, 2013 11:07PM - edited Apr 12, 2013 11:08PM by AryaS I'm so sorry you have to take the semester off. I totally understand how you are feeling. Really, your only job right now should be to get through this. My surgery was just scheduled. Double mastectomy and reconstruction on this coming Thursday. I will be glad to move to the next phase and have questions answered but I am scared. I've never had major surgery where I was fully sedated before. I am freaked out by that alone! This is scary stuff we are dealing with. I was just sitting here and realized that my life will never be the same again.",
      "MessageIndex": 15,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/803108",
      "Title": "Diagnosed last week AryaS dwill"
    }
  ]
}