{
  "AuthorID": "aspen04",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81559/profile",
  "Posts": [
    {
      "AuthorID": "aspen04",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81559/profile",
      "Content": "aspen04 wrote: Hello everyone,   I have read all your posts and find them informational. My heart goes out to all of you. I am reaching out to see if anyone has any information on the symptoms I am having. I am very nervous but dont want to worry my family or husband. I am pretty young 30 and I have found a hard bumpy lump on the inner left breast. It is not painful and does not move around. I have read that most lumps are nothing to worry about esp in my age group. However, I have always had a few complications with my menstral cycle or lack of one. It has never been unusual for me to go 6 months between cycles. I was told by a dr several years ago that my body had low progeterone and that after I had a child things make work themselves out. They didnt and I had a child 5 years ago. It has now been, that I can for certain say, 18 months since my last cycle. (I kept telling myself I needed to get into the Dr, but time has escaped me). I have read and been told that high lvls of estrogen can increase your risks for cancer. Now I am very nervous and all I think about is this CRAZY lump that is prob nothing and mad at myself for not getting into a dr sooner. So if any of you have experienced any of these symptoms please share.  AHHhhh hurry up dr apt. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731597",
      "Title": "Seeking information re symptoms. aspen04 Nichola"
    },
    {
      "AuthorID": "aspen04",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81559/profile",
      "Content": "Mar 28, 2009 11:59PM aspen04 wrote:   Hello everyone,     I have read all your posts and find them informational.  My heart goes out to all of you.  I am reaching out to see if anyone has any information on the symptoms I am having.  I am very nervous but dont want to worry my family or husband.  I am pretty young 30 and I have found a hard bumpy lump on the inner left breast. It is not painful and does not move around. I have read that most lumps are nothing to worry about esp in my age group.  However, I have always had a few complications with my menstral cycle or lack of one.  It has never been unusual for me to go 6 months between cycles.  I was told by a dr several years ago that my body had low progeterone and that after I had a child things make work themselves out. They didnt and I had a child 5 years ago.  It has now been, that I can for certain say, 18 months since my last cycle. (I kept telling myself I needed to get into the Dr, but time has escaped me).  I have read and been told that high lvls of estrogen can increase your risks for cancer.  Now I am very nervous and all I think about is this CRAZY lump that is prob nothing and mad at myself for not getting into a dr sooner.",
      "MessageIndex": 8,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731466",
      "Title": "Worried and felling alone saintmelissa saintmelissa"
    }
  ]
}