{
  "AuthorID": "ASPtrip",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133963/profile",
  "Posts": [
    {
      "AuthorID": "ASPtrip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133963/profile",
      "Content": "Aug 9, 2011 06:26PM ASPtrip wrote: Marybe: Ixempra is not so tough. I had few problems. slight fatigue for a few days, almost no nausea- but did have slight constipation. The thing that bothered me the most was the disgusting taste that stayed in mouth for like a week 1/2 after infusion. I could not stand to eat or drink anything but water and pancakes for some reason. I sucked on a lot of Ice breakers, and it helped a bit. I lost nearly everybit of my hair, except for wispy on sides and back, but a little thicker on top.",
      "MessageIndex": 484,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "ASPtrip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133963/profile",
      "Content": "Aug 14, 2011 12:50AM ASPtrip wrote: Well I suppose I will be starting Halaven 8\\22, since the parp trials are pretty much all closed now to new participants. Oh well. I refuse to let anything get me down these days. I really haven't seen anyone who is trip neg do very well on Halaven, but my doc says its worth a shot. Doesn't sound real promising, but who knows. mbmoss: sorry it did not work for you. I see you also are trip neg. I am curious to see how Navelbine does for you. Hope it kicks cancer butt for you. Keep us posted. Have you tried Ixempra? It worked for me for a few months.  I also would like to know what chemos have worked for you in the past. Janetwit: Very good info on the celldextherapeutics. Keep us posted as well on your progress with that. FightnF8 & jneuman: so glad to hear Halaven helped you both.",
      "MessageIndex": 493,
      "PostDate": "14/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "ASPtrip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133963/profile",
      "Content": "Aug 9, 2011 07:38AM - edited Aug 9, 2011 07:43AM by ASPtrip Hi, I just read thru this whole post, and there is a lot of good info here about Halaven. I have been on Xeloda and Ixempra since May 5, and after the first two cycles my scan showed complete NED. I was thrilled and amazed. Now I find out today after cycle 5 It has showed up again in the liver, spot on spine, IM node, and now 5 mm lung nodule. My cancer grows so fast. We have to stay on top of it.  Im triple negative, therefore I have less options and difficult to get under control. However, my onc wants me to try Halaven now or a parp trial. It seems what I have heard hear is that Halaven is not too difficult with SEs. Hair loss maybe? Neulasta maybe? premeds maybe? Is there anyone here that is Triple negative and how is it working for you? because it seems that only a small percentage had good luck. My main concern is liver and lung. Did anyone have it shrink those tumors? Also thanks to everyone on this forum. It helps so much. Theres times when I learn more here than from my doc.(not that he's not great) And to all who have shared their Halaven story and it did not work out well for you, I certainly hope the very next thing you try is your answer.",
      "MessageIndex": 480,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    }
  ]
}