{
  "AuthorID": "Astrid",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
  "Posts": [
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Nov 7, 2018 07:22AM Astrid wrote: deep breath wigging... we are all here waiting with you. I am keeping you close in my prayers. good time to shout yourself a massage? think about your mental and spiritual well being and make a little plan to take good care of yourself. whether that be some uplifting reading material, a yoga/ meditation type practice, or just 10 minutes a day of prayers, breathing and stretching..(guided meditation CD's are really good...you just lie down and follow the voice.) A daily practice will hold you in good stead through this next journey you are on. Picture yourself being loved, cherished and protected...always...because you are. cyber hugs to you.",
      "MessageIndex": 6,
      "PostDate": "07/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868170",
      "Title": "Waiting for MRI and other tests...dark thoughts! Wigging2000 Wigging2000"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Oct 12, 2018 05:57AM Astrid wrote: reading again, it looks like they are saying there is no evidence of it's own blood supply. (the suspect mass) however, there is a blood supply adjacent to it. unclear if it is supplying suspected nodule or not...nothing 'definite' thus biopsy will help clarify and identify. hope that helps a bit. ",
      "MessageIndex": 3,
      "PostDate": "12/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867731",
      "Title": "Question on Ultrasound Report TwelvePaws TwelvePaws"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Oct 11, 2018 11:03PM - edited Oct 11, 2018 11:03PM by Astrid Hello 12paws. Firstly, Sorry you are going through the anxiety of tests and the unknown. Could it be veins re 'crossing vessel'? I think the most important thing here is yes... 1/Have the biopsy 2/ Don't overthink it 3/ Trust the experience of professionals and experts in the field with years of experience. Best of luck Let's hope for a good result for you.",
      "MessageIndex": 1,
      "PostDate": "11/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867731",
      "Title": "Question on Ultrasound Report TwelvePaws TwelvePaws"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 8, 2016 12:44PM Astrid wrote: hey gals, this rib thing i have.. It definitely starts up after ten minutes or more walking..then is like a very bad stitch. a few times i have noticed it as a dull ache. this couple with both arms playing up with aching and swelling.. I've decided I should act on it. my gut tells me maybe arthritis or osteo porosis in ribs.maybe stress fracture from this.. but you know..mr naggy head monster in my head tells me 'uh 'oh'.... not really listening to old naggy head though. I know I need to get this looked at. I'm thinking my chiropractor might be able to get me a bone scan, so i will ask her. its less scary coming from her than surgeon or onc. (yes, I am a big fat fraidy cat!!!!) darn. wish it would just go away!!!  love astrid. ",
      "MessageIndex": 3655,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 8, 2016 02:00PM Astrid wrote: thanks so much zarovka. I appreciate your reply very much. astrid",
      "MessageIndex": 3662,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 11, 2016 04:09PM Astrid wrote: sorry to hear bout your node too fraidycat. best of luck with ct. astrid",
      "MessageIndex": 3676,
      "PostDate": "11/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 15, 2016 09:39PM Astrid wrote: Hi Barbe, I see we are sisters in birth year. I am November of 1958. I am unfamiliar with papillary breast cancer, and will look it up for info. I too am sorry you had a recurrence. Forgive me, but your info has confused me a little. Have you had a local recurrence of papillary form in the other breast? Have you had further spread than the local recurrence? I know it says stage 4, but when you look at the notes, (I hope!!) it is a local recurrence only? I'm posting to update a little on my rib pain saga. I had an xray done through my chiropractor, whom I was way overdue to see. She has xrays done every few years anyway, as a check on how your spine is looking, so we got rib views looked at as well. Today, I received the report. No evidence of right sided rib fracture. 9 x 4mm oval shaped opacity is seen in projection of the left scapula/left third anterior rib, only visualised on the frontal view. On the right rib x-ray and lateral view this opacity is not clearly visualised within the scapula or ribs and therefore might be located within the left lung or anteroposterior chest wall. If this lesion is new, further work up with ct chest recommended. Well, I spent an hour looking up wording, and checking all my previous ct, xray and bone scan notes. Nothing mentioned about a nodule in them, soooo...I will book an appt tomorrow with surgeon(overdue for checkup..)ask for ?? As rib pain is still bad, I guess ct of chest wall, and bone scan? astrid ",
      "MessageIndex": 3688,
      "PostDate": "15/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 23, 2016 11:37AM Astrid wrote: update:saw my breast surgeon this morning. she is referring me back to the oncologist. her reason being that it comes under her jurisdiction as no breast lumps etc, and she doesn't want to order multiple tests when I could possibly get it all checked with a PET scan. soooo back to the waiting room for me. astrid ",
      "MessageIndex": 3701,
      "PostDate": "23/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 26, 2016 10:15AM Astrid wrote: so interesting, thanks! astrid",
      "MessageIndex": 3710,
      "PostDate": "26/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 8, 2016 12:54PM Astrid wrote: Hi zaroyka, i don't know if you were posting to me or Quinn, or both, but.. i like to do all the things you mentioned. trouble is, the walking is now bringing on rib pain. i think i need to rule out a stress factor yeah? if ct/bone may not show anything..would a pet scan do it? or as you say..if it doesnt show..no need to bother about it? ",
      "MessageIndex": 3659,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Jul 30, 2016 05:45AM Astrid wrote: Hi, 3-16-20011 I think your post was a few years back now, but...you have pretty much the same original dx as me, and treatment..ecept i had bi lateral disease. I'm posting here because my body is a bit haywire at the moment. The rib pain , worse with movement is how I would describe mine. My right side cancer came back, 2012, but was a different type(lobular) from 1st dx. i am a tad concerned. I have had costochondritas, post rads, on left and right ribs and know what it feels like. this is more sharp. Too early to act on it I think. (a little concerned I admit) Could be stress fracture maybe..as I have osteopenia. astrid. ",
      "MessageIndex": 3608,
      "PostDate": "30/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 8, 2016 12:46PM Astrid wrote: Hiya Quinn, I too am relieved they say 'fluid filled' but... i would get the ct scan... when you are ready of course!  love astrid.",
      "MessageIndex": 3656,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 9, 2016 11:25AM Astrid wrote: Hi Qinncat, yes. I find ibuprofin helps a lot. the panadol osteo doesnt do much. I have to say it was worse yesterday. definitely time to get to the bottom of it. Almost certain it isnt chostro.as it feels so different to that. As it is not worse at night, and not waking me from sleep..no big weight drop, I'm not thinking the worst. I'm thinking strong possibility of stress fracture..or bad muscle strain?? oh dear..I 'd like to crawl back to bed and hide for awhile quite honestly!!!  astrid (will keep you posted with scan news..I know there is radiation from scans, but in the bigger picture...well...you know! sending a gentle hug your way)",
      "MessageIndex": 3667,
      "PostDate": "09/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 12, 2016 10:57AM Astrid wrote: I'm so, so sorry for your news GG. Having a plan and a routine will help steady the ship. sending gentle hugs and prayers your way astrid. ",
      "MessageIndex": 3681,
      "PostDate": "12/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 18, 2016 10:43AM Astrid wrote: Thanks so much ,I will Barb. That is so different to how we call it here. i have had two recurrences..one in my left breast post mast. in 2002, and then one in my right post mast. in 2012. I didn't realise that was called chest wall ..but maybe because I had skin sparing double mast. in 2002, it wasn't dx'd that way? It wasn't even called stage 3 for local recurrence, neverlone stage 4! i thought stage 4 was only for distant mets like to the bones or organs. Anyway, at the moment I'm just hoping my pain is no biggie! i see my surgeon on Tuesday. astrid ",
      "MessageIndex": 3691,
      "PostDate": "18/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 19, 2016 03:22PM - edited Aug 19, 2016 03:23PM by Astrid Hi Daczahow, I soo hope the PET is right, and the MRI wrong. How awful to have to wait! you have done everything right with treatment, yet still you had that supraclavicular node show up.Rotten luck. Let's hope it's arthritic stuff showing and not mets eh? Sorry no experience of this to offer, but just wanted to send love and prayers your way. astrid",
      "MessageIndex": 3694,
      "PostDate": "19/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Jul 31, 2016 12:18AM Astrid wrote: Thanks dlb, yeah, I'm gonna wait a bit longer, and if it is still worsening with movement, I'll ask for .. ooh..x ray or bone scan? maybe both? astrid.",
      "MessageIndex": 3612,
      "PostDate": "31/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Aug 23, 2016 02:43PM Astrid wrote: pass the out of date magazine to me Daczahow! hope you are holding up alright. astrid",
      "MessageIndex": 3703,
      "PostDate": "23/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Nov 15, 2018 05:46PM Astrid wrote: It seems too fast...no time to observe for any complications etc. I was in for 5 days I think..skin saving but no reco at that time. I had double complete axilla removal as well though...maybe that was why and I had assumed it was bmx.... Whichever way you look at it..seems to me that doing this as an outpatient op. totally dismisses the mental, emotional and physical effects of losing both breasts. It seems undignified and callous if not plain bad practice. (Just my take) I wonder if this varies across U.S states. And Canada? Is that different? Anyway...how are you doing today Oya. Do you have drains? Please take it very easy. Sending love and a gentle cyber hug.",
      "MessageIndex": 20,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868244",
      "Title": "Surgery soon... lumpectomy or dbl mastectomy? Oya80 HopeBry"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Nov 15, 2018 01:47AM Astrid wrote: wow! You are an inspiration Oya. I feel for you though. Keeping you in there a few days for a well deserved rest...when you have a very little one and a couple of middling age... Cudos to your husband...yes thanl goodness for his support and your eldest one. Well...do sing out here if you need to vent or anything at all really. Very pleased no node involvement. Will make recovery a lot easier. Still not easy..but better.  ",
      "MessageIndex": 15,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868244",
      "Title": "Surgery soon... lumpectomy or dbl mastectomy? Oya80 HopeBry"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Nov 16, 2018 01:02AM - edited Nov 16, 2018 03:13AM by Astrid mmm. Yes...I guess...however a couple of nights in hospital followed by nurse visits to check drains etc would be minimum good practice. (If I ruled the land.)",
      "MessageIndex": 22,
      "PostDate": "16/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868244",
      "Title": "Surgery soon... lumpectomy or dbl mastectomy? Oya80 HopeBry"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Nov 14, 2018 10:33PM Astrid wrote: Hi Oya80 I noticed your reply in Love's thread...just quietly posting that you too were waiting in dr's...for pre-op which you haVe now had...there you were encouraging Love whilst waiting ahead of a major surgery. Speaks volumes about your courage and your character. I take my hat off to you. Bravo sister. I just had to post and tell you how fabulous I think you are and what a brave warrior...facing all of this very quietly. I was shocked to see you had bmx as an outpatient procedure? Can I ask where this was? Is this a normal experience ladies? The other puzzling thing was no mention of even sentinel node removal to check axilla region? I mean..quite a large tumour. I have had your dx in my left breast originally...er,pr, her 2 neg..which it turns out Love has as well. I did have a positive node with extra spill toward next node...no doubt they have checked the nodes for cancer Oya? I don't know how you can manage going home straight away...but there you are doing it!!! No doubt they send daily nurse care? I am thinking of you and sending my love, prayers and best wishes for this to be all there is to your journey with BC. With 4 kids ...sent home pronto....my mind reels I feel for you. Big cyber hug. Astrid.  ",
      "MessageIndex": 13,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868244",
      "Title": "Surgery soon... lumpectomy or dbl mastectomy? Oya80 HopeBry"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Nov 25, 2018 02:02AM Astrid wrote: oh thank goodness. What a relief for you! Sending hugs. Xx ",
      "MessageIndex": 14,
      "PostDate": "25/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867781",
      "Title": "a bit concerned and I don't want to worry anyone I know jsdbsn Astrid"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Oct 28, 2018 06:11AM Astrid wrote: so glad you are underway with getting some anwers jsdbsn. Whatever it is I think it is always good to get some answers sooner thsn later where possible. Being On Monday also doesn't allow you too much time for fretting. Please let us know how it goes and we are all thinking of you amd hoping for the best outcome. :)",
      "MessageIndex": 8,
      "PostDate": "28/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867781",
      "Title": "a bit concerned and I don't want to worry anyone I know jsdbsn Astrid"
    },
    {
      "AuthorID": "Astrid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164829/profile",
      "Content": "Nov 7, 2018 06:22PM Astrid wrote: me too js....hoping for a very positive NO cancer. :)",
      "MessageIndex": 12,
      "PostDate": "07/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867781",
      "Title": "a bit concerned and I don't want to worry anyone I know jsdbsn Astrid"
    }
  ]
}