{
  "AuthorID": "Atl1967",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288053/profile",
  "Posts": [
    {
      "AuthorID": "Atl1967",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288053/profile",
      "Content": "Jun 1, 2019 08:51AM Atl1967 wrote: Good luck to everyone with their treatments! I have had 6 of 16 (plus 4 boosts) so far. Seems as though everyone has their own favorite cream and I have had lots of different ones recommended to me. I asked the doctor about them all, and they said they had done a study and determined that the low dose steroid they prescribe has a very good track record in preventing significant sun damage. I put it on after work and in the evenings, and then, since my treatments are in the morning, I wash it off during my morning shower. The doctor did say to put it on my back if I saw any signs there (freaky to think of the back getting burned!). I have very sensitive skin and developed a very painful rash after my surgery so am quite nervous about what will happen. I experience a sort of mild disorientation after each one - very, very slight, but noticeable. It wears off during the day and I don't have it on weekends. The first night I also felt shooting pain in my breast, which the nurse termed \"zingers\", which I think is a perfect description. I mentioned this to my doctor (hugely empathetic wonderful woman) and she said it made sense I would feel both the disorientation and the shooting pain as the radiation is doing damage to your body. She thought the zingers were nerve endings. A week later I saw a different doctor, and while he did not dismiss me, he essentially said it was psychosomatic (male. . . draw your own conclusions). The zingers have not occurred every day and when I massage them, it helps. I also had it on my left breast, and I do the breath hold. I have a great deal of anxiety about holding it long enough, but the technicians are all super nice. I made it a point of learning all of their names (not a strength of mine) as a little bit of a game to distract me and it's worked - I like greeting them each morning. I also do minimeditations to help. The nurse and doctor told me fatigue would not hit, if it does, until two weeks in. I have a lot of work events coming up, so am a bit nervous about that. Trying to get lots of exercise. I spoke to one woman who said, \"I didn't have any fatigue at all!\" from her radiation - and then she told me later she went to bed at 8 p.m. every night! We should all give ourselves lots of grace - seems to me this is like a lot of things where our bodies will all experience it differently.",
      "MessageIndex": 30,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Atl1967",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/288053/profile",
      "Content": "Atl1967 wrote: All: I had a lumpectomy and breast reduction on April 17th. The incisions are still healing, although I am making progress. I hope to start radiation no later than May 27th because of a family vacation I have the first week of July. (I will be doing four weeks of radiation). I asked for and got a date for a planning session on Monday, May 13th. if I am not all the way healed for that session, can they still do the planning? Anything I can do to accelerate healing? (I am eating protein). What was your experience in starting radiation? Thanks so much for advice! Diagonsis: ILC, left breast, 1.8 cm. ER+, PR+, HER2- (FISH) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871419",
      "Title": "Healing before radiation? Atl1967 Moderators"
    }
  ]
}