{
  "AuthorID": "aussierockc…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250099/profile",
  "Posts": [
    {
      "AuthorID": "aussierockc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250099/profile",
      "Content": "Sep 4, 2017 01:15AM aussierockchick wrote: I loved my symetrical DD pair and If there had been any way I could have avoided my mx I would have. Having said that I am already reconstructed and not even 6 months later quite used to my new nippleless and not quite symetrical look.Looking forward to new nipple and tatoo coming soon. I can wear a bikini and you cant tell. I still have the worry of it coming back in the other breast but if it did I would still choose lx for that one if I could. Once the breast is gone it will never return. I was guided by my surgeons recommendations and would be again of course.He said I should have a silicon implant since I didnt need rads this time. If I need my tummy tissue in the future it will still be there, whereas if I had diep this time I would have less future options. Hope future options wont be needed but I thought it was a sound theory. Its a very personal decision that only you can make.",
      "MessageIndex": 13,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858353",
      "Title": "Need advice on choosing a surgery Albion MTwoman"
    },
    {
      "AuthorID": "aussierockc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250099/profile",
      "Content": "Jul 8, 2017 09:56AM aussierockchick wrote: I had aerform te removed and silicon implant on my rhs on 4th july. Healing well, resting at home and looking very even. Would never hav thought i could feel this happy again after initial dx but here i am. Such a relief to say goodbye to the expander. Good luck to you all. This is not fun. X",
      "MessageIndex": 59,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855762",
      "Title": "July 2017 Surgery kae_md99 53nancy"
    },
    {
      "AuthorID": "aussierockc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250099/profile",
      "Content": "Jul 9, 2017 12:24AM - edited Jul 9, 2017 12:25AM by aussierockchick",
      "MessageIndex": 65,
      "PostDate": "09/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855762",
      "Title": "July 2017 Surgery kae_md99 53nancy"
    },
    {
      "AuthorID": "aussierockc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250099/profile",
      "Content": "Jul 9, 2017 12:21AM aussierockchick wrote: Hi kae md I waa lucky i didnt need anyrads or chemo thank goodness. Which sped up my process The expander was in fior 3 months and 1week. I had aeroform expander with a compressed co2 cylinder inside and i did the fills at home myself up to 600 cc via a remote control device no pain as it is many small fills of air no needles. It was very hard and sat high up on my chest. The bigger it got the more obvious the difference between the te and my natural breast . And it was uncomfortabl but definitely worth it as a means to an end I had a 625 cc implant and it looks a pretty good match so far.5 days out. And feels so much softer. I will not be having any adjustment to my good breast i hav decided for now. i would rather be slightly assymetrical than have them alter it. I know this should probably be in the 1300 + page exchange city thread but hey it is still surgery and i hope i can give some encouragement to others facing unilateral recon. Cheers..... aussie",
      "MessageIndex": 64,
      "PostDate": "09/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855762",
      "Title": "July 2017 Surgery kae_md99 53nancy"
    },
    {
      "AuthorID": "aussierockc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250099/profile",
      "Content": "Jun 19, 2017 11:44AM aussierockchick wrote: hi im having a right side silicon implant on 4th july. Its not a holiday here in oz. Will be great to get this expander out and feel closer to the end of this journey. Im really excited as well as scared and nervous. All rolled into one.",
      "MessageIndex": 17,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855762",
      "Title": "July 2017 Surgery kae_md99 53nancy"
    },
    {
      "AuthorID": "aussierockc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250099/profile",
      "Content": "Jul 26, 2017 03:02AM aussierockchick wrote: i had 2 yearly mammos from 40 years old. I had told the gp my mother took the drug des during her pregnancy with me but no one ever mentioned that this meant i shouldve been having yearly mammos. The mammo operaters often said i had very dense breasts but it was said more like a compliment like my breasts were young for my age. Like it was a good thing. No one told me the density would make detection of bc more difficult. Thus even if i hadve been having yearly mammo it would not have helped much. Now the very scary part. This january i was recalled for 2nd mammo due to 2 microscopic areas like a few grains of sand they wanted to check just in case. Nothing at all could be seen on ultrasound. 3 specialists were unable to feel any lump. There was no pain no discharge my breasts were very symetrical. I was a dd cup but not overweight. Biopsy showed 2 small areas of high grade dcis with comedonecrosis. Just before scheduled lumpectomy my brother in law who is a doctor suggested i should have an mri. Mri showed..... 90mm x 70 x25 mm area of dcis. An area the size of a clenched fist which could not be felt or seen by any other diagnostic method. I had to have mastectomy . Mri did over diagnose as final pathology said 70mm dcis. Which is HUGE. Our system hrre is different to yours and i wont go into all the details. It seems like the mammos were a waste of time but at the end of the day they did detect the calcifications. Lucky for me and i mean lucky my dcis had got that big without any invasive cells developing or i couldve been in BIG trouble. Ironic thing i am fanatical about testing having had cin 3 dysplasia on my cervix at age 30 that was found on a routine pap smear. If i had known the facts i would happily have paid for biannual mri out of my own pocket. And will do in the future for remaining breast. It is scary alright. ",
      "MessageIndex": 44,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/634136",
      "Title": "Cancer missed by mammogram? joanne_elizabeth HoneyBeaw"
    },
    {
      "AuthorID": "aussierockc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250099/profile",
      "Content": "Sep 3, 2017 11:21AM aussierockchick wrote: Hi there i had right mx and recon with no other treatment. I never even met an oncologist. I was very suprised that even tamox was never offered or discussed with me. When i asked why they said ' because you dont need it' and that was that i plan to ask how that decision was made at my next appointment.. not that i want to take it but all my reading suggested it would probably be benefical to me for protecting the other side. I think im having yearly mri for the next 5 years havent been to my 6 month follow up yet. I asked this question on here a while back and beesie wrote a really good reply that put my mind at rest. I \"only\" had dcis tho so a bit different to you. Cheers x aussie",
      "MessageIndex": 10,
      "PostDate": "03/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858290",
      "Title": "Nothing after Surgery??? GreenEyes81 Irony"
    }
  ]
}