{
  "AuthorID": "automartin",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284581/profile",
  "Posts": [
    {
      "AuthorID": "automartin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284581/profile",
      "Content": "automartin wrote: Hello New here today. I had a 3D mammogram done on Monday and got the results this morning. I was referred to our cancer center for a diagnostic mammogram and ultrasound, which they've scheduled for Friday. I'll be there for 2-3 hours, as they have a radiologist on staff to read results and give them to me right away. Which is awesome. My paternal/maternal aunts have had breast cancer. I had a mammogram in 2008 which was normal, and my first annual mammogram last year, which was also normal (BIRADS Category - 2). That one was 2D, and I was told that since I'm heterogeneously dense, I should go for the 3D mammogram, which is what I had on Monday. Here are the radiologist notes. Can anyone help with more info or what a focal asymmetry means in relation to my two previous normal screenings? And does someone have a chart that shows me where the asymmetry is located? I know it's in the back of my left breast, but if it were a clock (looking at it from the front), what time would it be? :) TECHNIQUE: Bilateral screening mammography, producing direct digital images and bilateral screening digital tomosynthesis, all views, with computer-aided detection (CAD). COMPARISON: Prior mammograms dating back to 2008 INDICATION: Encounter for screening mammogram for malignant neoplasm of breast. Breast Density: The breasts are heterogeneously dense, which may obscure small masses. Combination mammography/tomosynthesis was performed of both breasts. There is a focal asymmetry in the far posterior lateral left breast seen on the exaggerated lateral craniocaudal view. Further evaluation is recommended with tomosynthesis in the mediolateral and spot compression exaggerated lateral craniocaudal view. Ultrasound may be necessary for complete evaluation. There is no significant change in the appearance of the right breast. Impression: Left breast finding requires further evaluation. Recommendation: Diagnostic Mammogram Left with Left Breast Ultrasound. Betty Ford Breast Care patient navigator will place an order for a Left Diagnostic Mammogram with Left Breast Ultrasound per my direction for the additional diagnostics needed to evaluate the area(s) in question as noted in my assessment and impression above. Our navigator will ensure the appropriate follow-up appointment is scheduled. Follow-Up Interval: NOW. The \"NOW\" in all-caps freaks me out. Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869380",
      "Title": "3D Mammogram - \"Focal Asymmetry\" found in left breast automartin Egads007"
    },
    {
      "AuthorID": "automartin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284581/profile",
      "Content": "Jan 19, 2019 01:31PM automartin wrote: Thank you for checking in! Mammogram was clean - they think it was tissue folded upon itself. So relieved. I hadn’t realized how terrified I was. Thankful this community is here for women like me. Thank you",
      "MessageIndex": 5,
      "PostDate": "19/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869380",
      "Title": "3D Mammogram - \"Focal Asymmetry\" found in left breast automartin Egads007"
    },
    {
      "AuthorID": "automartin",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284581/profile",
      "Content": "Jan 18, 2019 04:18AM automartin wrote: Thank you! This helps so much. I’m actually getting ready to leave for the Lemmen Holton Cancer Pavilion in about 30 minutes, I’m assuming that’s part of the Betty Ford conglomerate? I’ve known a few people have been here and said that they are wonderful. So thankful I’ll know something today!  These charts really helpful, I am very curious to find out where this is located, because I don’t think I can feel anything, but my breasts are very dense and rope-like.  I’ll update here when I get done",
      "MessageIndex": 3,
      "PostDate": "18/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869380",
      "Title": "3D Mammogram - \"Focal Asymmetry\" found in left breast automartin Egads007"
    }
  ]
}