{
  "AuthorID": "Azie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162986/profile",
  "Posts": [
    {
      "AuthorID": "Azie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162986/profile",
      "Content": "Azie wrote: Hi my I was a two time breast cancer sutrviver until resentily. I first got dignoced at age 36 2002 di all the nine yard the mesctomy chemo. But got back again at 2005 again fought hard six month chemo follow by seven weeks radiation. I thought I am done, for my surprise a few weeks ago I went to ER with bad stomack pain the pain was really bad they end up doing a catscan , that's when they found out a mass in my long nothin to do in my stomack. I am a very positive person the first two times when family and friend ask me why I am not mad or quash ion this happen I use to tell them why not me. I always to see the people who has it worst than me sushi ally the little kids when i get sad or upset I remind myself that and I thank god for the life he gave me. But now I am having a hard time I am still thankfull it's only in my lung but I am not as healthy I was a few years back I think all the chemo I took a tool on me. I am having a very hard time if I am going to bit this again or what. Anybody out there face a halenge like mine have any adivice how to cope? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795321",
      "Title": "Metastatic Breast cancer Azie Chickadee"
    },
    {
      "AuthorID": "Azie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162986/profile",
      "Content": "Nov 20, 2012 04:40AM Azie wrote: Hello everybody, I was wondering if any of you have to deal with a choice chemo or a oral tablet. The oral tablet is Xeloda and the chemo is Abraxane with Herceptin. The last two time I took chemo I didn't have this choice I didn't even know its existe. I am not sure which is better for me I have still some cancer that they couldn't take out because it is too risky. Pleas if any of you took the oral tablet let me know. I would like to know if it's really effective. Thanks Azie",
      "MessageIndex": 24,
      "PostDate": "20/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795321",
      "Title": "Metastatic Breast cancer Azie Chickadee"
    },
    {
      "AuthorID": "Azie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162986/profile",
      "Content": "Oct 22, 2012 11:08PM Azie wrote: Thank you So much for all your advice. I will try to answer for all the quation you ask me. Ye s I eat very healthy Orbganic deliver to my house to form the Amish farm and the milk from the creamery. That's why I don't understand why this happen for he third time. I don't drink or smoke. I did do the pet scan twice to check if the ER report is right which it is and did biopsy to confirm everything. I am doing my surgery next week I am hoping they will get everything. I have a 13 and 15 year's old. I hate the tought of not seen my kids grew. And gain everybody thank you for reaching out. I never did this before I am glad I did. Thanks Azie",
      "MessageIndex": 9,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795321",
      "Title": "Metastatic Breast cancer Azie Chickadee"
    },
    {
      "AuthorID": "Azie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162986/profile",
      "Content": "Oct 25, 2012 06:33AM Azie wrote: Hello again I have a quation or advice I gus. I saw my surgeon today one more time befor the surgery which is a week from today. To finalize what is the best thing to do for me. In the binning it was only one Nogel in my long that we biopsy and saw in the cat scan but since now we found out after the pet scan there is another two in the same Lang, the surgeon sayed she can take the one we know it's a cancer and also another one she is woried about. But the one in the lower Lomb is very faint and hard to get to it. She gave me a choise to take it out, but she said it can be a infection or nothing then if i do that I lost a healthy lung tissu for nothing.So I decided to wach it for the next couple of month if it change the character. But I can't help wondering if i am doing the right thing. Thanks again for all your respond Azie",
      "MessageIndex": 16,
      "PostDate": "25/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795321",
      "Title": "Metastatic Breast cancer Azie Chickadee"
    },
    {
      "AuthorID": "Azie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162986/profile",
      "Content": "Nov 5, 2012 10:17PM Azie wrote: Hello The surgery went well , I just got home today I stayed in the hospital longer than I thought. The pain at my chest and between my shoulder blade is not going away, is anybody experience that? Thank you Azie",
      "MessageIndex": 21,
      "PostDate": "05/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795321",
      "Title": "Metastatic Breast cancer Azie Chickadee"
    }
  ]
}