{
  "AuthorID": "azlisa",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182077/profile",
  "Posts": [
    {
      "AuthorID": "azlisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182077/profile",
      "Content": "azlisa wrote: Hi, I have had a sterotactic biopsy and core biospy on my left breast for calcifcations and a couple of cysts. The cysts turned out to be nothing. The calcifications report states: Sections show needle core biopsies of fibrofatty breast tissue. There are areas of sclerosing adenosis. There are some dilated ducts present/small cysts. Intraluminal microcalification is noted. There is columnar cell alteration present.There is a small focus of atypical ductual hyperplasia present. Fast forward, on the above mentioned report the surgeon opted for an open excisional biospy. I had this done last Thursday. Went in today for results and surgeon stated that pathologist is doing more testing on additional samples since he saw something suspisious. She (surgeon) stated that he is checking for ALH and DCIS. I have to wait until Friday for results unless it comes back as cancer and then she will need to see me again. Reading everything online on ADH and ALH, is one worst then the other? I am nervous and concerned also since I am on HRT (patch) and surgeon is aware and I have asked if I should stop and she stated no. Any words of wisdom? Thanks, Lis Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/806415",
      "Title": "Actually waiting on results azlisa azlisa"
    },
    {
      "AuthorID": "azlisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182077/profile",
      "Content": "Aug 22, 2013 06:26PM azlisa wrote: I totally can relate to all that is posted here. I never thought 5 months ago I would be posting on a BC site. Quick breakdown, I have had 3 core biopsies and a sterotactic biopsy and a open excisional biopsy. First the left breast found ADH in the first 2 biopsies and then had open excisional biopsy and found ALH and LCIS also in left breast. BS requested for me to have an MRI on both breasts, which then had to have core biopsies on both. Findings were on Left breast more ADH and now right breast has all 3 too. Going to have another open excisional biopsy now on both in the next month. BS has suggested 2 options after biopsy, go on Tamoxifen or have mastectomy. I have opted to not have the mastectomy. So once I have the next 2 biopsies it will be medication and yearly MRI's and every 6 months mammograms. No history in my family of BC and never had any problems in the past. So I guess it is just a wait and see thing now.  So glad to have this site to vent since I dont have anyone that understands the emotions you go through with all of this.",
      "MessageIndex": 175,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "azlisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182077/profile",
      "Content": "Jun 20, 2013 06:38AM azlisa wrote: Thank you and I will do that. This all has been so unnerving and stomach in knots. Lis",
      "MessageIndex": 2,
      "PostDate": "20/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/806415",
      "Title": "Actually waiting on results azlisa azlisa"
    },
    {
      "AuthorID": "azlisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182077/profile",
      "Content": "azlisa wrote: I have not posted in a couple of months and so far this year I have had 7 biospies including the 2 I had last week (open excisional biopsies on both left and right breast). The pathology report states the following; A.  Leftbreastneedle-localizedbiopsy: •  Lobularneoplasia,rangingfromatypicallobularhyperplasiatolowgradelobularcarcinomainsitu. •  Proliferativefibrocysticchange. •  Atypicalductalhyperplasia. •  Fibroadenomatoidmastopathy. •  Radialscar. •  Microcalcifications. •  Woundhealingconsistentwithpriorbiopsysite. •  Lobularneoplasialessthan0.5mm fromsuperficialmargin. B.  Rightbreastneedle-localizedbiopsy: •  Lobularcarcinomainsitu •  grade2. •  0.5cmgreatestdimension. •  0.5cmfromthedeepmargin •  Extensivelobularneoplasiarangingfromatypicallobularhyperplasiato lowgradelobularcarcinomainsitu. •  Fibrocysticchange. •  Atypicalductalhyperplasia. •  Sclerosingadenosis. •  Microcalcifications. •  Chronicwoundhealingconsistentwithpriorbiopsycavity. •  Lobularneoplasialessthan0.5mmfromsuperficialmargin. Right now I have a break from it all and dont have to go back for 6 months when I have to have another MRI. I have seen 2 oncologists, one who I was referred to for a second opinion and one my dr sent me too. The one I was referred to is a radiology oncologist and he stated since I still have my uterus I should go on raloxifene since Tamoxifene is higher risk for me for uterus cancer. The second oncologist who is a medicine oncologist dismissed what the other doctor and put me on Tamoxifene. I think I am going to check into another oncologist on the matter since I dont want any more problems. Also surgeon and primary doctor keep asking about me having both removed. I feel that is totally radical to do at this point. As my surgeon stated on yesterday it is not a matter of if I will get cancer but when! she also stated the pathologist told her why am I not getting them removed since LCIS and atypia is all over both breasts. I really dont know what to think and this is way overwhelming. Any thoughts?? Thanks for listening, Liss Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/813051",
      "Title": "Another biopsy azlisa awb"
    },
    {
      "AuthorID": "azlisa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182077/profile",
      "Content": "Aug 29, 2013 02:38PM azlisa wrote: Congrats on the wonderful news mvspaulding. So happy for you!",
      "MessageIndex": 189,
      "PostDate": "29/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    }
  ]
}