{
  "AuthorID": "Azz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111876/profile",
  "Posts": [
    {
      "AuthorID": "Azz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111876/profile",
      "Content": "Azz wrote: My radiation oncologist has told me NOT to have any kind of massage while I'm going through radiation. I had planned to work with my terrific MLM therapist through the treatments. Does this make any sense to you? Did any of you have massage during radiation? Or are  you having it now as you are being treated? The scars on my breast and armpit feel like lumps of coal and I want to massage and try to break them down... when I walk around the house without a bra on my \"surgery\" breast feels as though there's a rock in it... kind of bumps along as I walk and it hurts. I am in such a negative place right now because the treatments and information I'm getting just don't seem rational - it's as though there is a standard course of treatment and once you're on the treadmill you go through the same process as everyone else no matter what your personal case may require. Oh well, I guess I should go to bed - I'm so cranky. By the way, has anyone read \"The China Study\" by T. Colin Campbell- quite an eye opener regarding cancer research and the vested interests of big pharma and other industries.... I'm sure this book is contributing to my increased scepticism. Azz Dx 9/5/2010, ILC, 3cm, Stage II, Grade 2, 2/10 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762930",
      "Title": "Lymph Massage or Ordinary Massage during radiation Azz Azz"
    },
    {
      "AuthorID": "Azz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111876/profile",
      "Content": "Jan 19, 2011 11:58PM Azz wrote: Hi Binney... Thanks for the \"very gentle hugs\". Radiation ends tomorrow - thank goodness. I almost quit half way through and then decided that was just stupid. I sure didn't react well to the procedure - very painful, lots of swelling, redness and pimples too - YUK!  So far no signs of lymphedema and will resume massage next week. I'm going to ask about a compression garments for skiing and flying etc just to help prevent any future problems. Now onto the next problem - aromatase inhibitors - have written about that elsewhere. Cheers and thanks.",
      "MessageIndex": 3,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762930",
      "Title": "Lymph Massage or Ordinary Massage during radiation Azz Azz"
    }
  ]
}