{
  "AuthorID": "B055W0man",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284676/profile",
  "Posts": [
    {
      "AuthorID": "B055W0man",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284676/profile",
      "Content": "B055W0man wrote: Hello everyone! New here but I have a big concern with my breast heath. Breast cancer is a big thing on my mothers side of the family. To date my mother, grandmother, and two out of three aunts have been diagnosed with HER2+ breast cancer. Not to mention my mother also had IBC in her left breast at the time she had HER2+ cancer in her right. I started having issue about 3 years ago. Found lumps in my breast and in my armpits. Doctors did ultrasounds given my age at the time was 25. And said it looked like nothing but “just watch it”. Well within the last few weeks my left nipple has become flatter/pulling in and almost purple in color. Went and had another ultrasound which they said was normal but thank goodness my mother spoke up and wanted me to have a mammogram regardless due to her IBC not showing on a ultrasound. The doctor once again said it looked normal but what I saw of my left one did not look “normal”. I know what a normal mammogram should look like and my left did not look normal. Should I seek a doctor that is more willing to hear me out despite my age? I am still only 28 but all these red flags keep pointing me to Paget’s disease of the nipple. I would appreciate any input! And thanks for letting me vent lol Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869424",
      "Title": "Should I get a second opinion? B055W0man B055W0man"
    },
    {
      "AuthorID": "B055W0man",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284676/profile",
      "Content": "Jan 21, 2019 07:17PM B055W0man wrote: djmammo, There was a bright white spot behind/on my nipple area with bright white “vein” like sections coming off from that. Only saw the picture on the screen for a few seconds. Never saw films again, But doctor still said it was normal but very lobular, if that makes any sense.",
      "MessageIndex": 6,
      "PostDate": "21/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869424",
      "Title": "Should I get a second opinion? B055W0man B055W0man"
    }
  ]
}