{
  "AuthorID": "b_cherry",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204212/profile",
  "Posts": [
    {
      "AuthorID": "b_cherry",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204212/profile",
      "Content": "Aug 21, 2014 01:45PM - edited Aug 21, 2014 01:52PM by b_cherry Hi everyone, I too am in similar situation, I have a palpable lump felt by my Dr. and the tech that did the scan but nothing has come up on my ultrasound. I asked for further tests as I am anxious to know exactly what it is and my Dr. agreed readily so that was helpful. I have been referred for an appointment with a breast specialist with a second ultrasound, palpable guided biopsy and possibly a mammogram. A bit about myself: I’m 26 with no history of BC in the family. The odds are in my favour for sure but obviously I can’t help but worry. Also, my lump is described as mobile but ‘ropey’. I tried to do some research on lumps like this but didn’t find much, which is why I wanted to post my story so that this info will help someone else. I’ve made a promise with myself to check it every week and diarize everything so that I have this information (f it is benign it will have to be monitored anyway). I personally think this will be good habit to get into though once a week might be too much? I will keep you lovely ladies posted! B xx p/s if it is not too much trouble Jaqui and Newbury, it would be great to hear how the follow up went (fingers crossed for us all).",
      "MessageIndex": 16,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823537",
      "Title": "Lump palpable but not visible JacquiW mel147"
    },
    {
      "AuthorID": "b_cherry",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204212/profile",
      "Content": "Aug 28, 2014 09:16AM b_cherry wrote: Hi Jacqui - excellent news about the scan! Really pleased for you. I was just re-reading this board and I have to agree that this site has definitely helped me stress a little less. How about requesting a biopsy to see if they can get to the bottom of it? I actually don't have my appointment yet! It's probably time to put on my big girl pants and follow up.   Best of luck to rest of you ladies. B",
      "MessageIndex": 21,
      "PostDate": "28/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823537",
      "Title": "Lump palpable but not visible JacquiW mel147"
    },
    {
      "AuthorID": "b_cherry",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204212/profile",
      "Content": "Aug 22, 2014 12:57PM b_cherry wrote: Hi KLL85 Sending lots of happy and positive thoughts your way.  It is crazy how waiting is such an anxiety inducing feeling. Just remember you're not alone in being worried, it is a rather normal reaction. After seeing my doctor I had to wait 2 weeks for an ultrasound (I am 26 so this is usually first thing they do). I then had to wait a week for the results only to be told that nothing is conclusive so now I am now waiting for another appointment for more testing! So I really know how nail-biting waiting is but the main thing is to concentrate on positive thoughts and not to worry, and worrying really doesn’t make a difference at the end of the day. Remember the majority of lumps found are benign and a lot of tests are done just to be on the safe side not because they think you have BC, All the best, B",
      "MessageIndex": 5,
      "PostDate": "22/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823862",
      "Title": "Lump in right breast KLL85 Beesie"
    }
  ]
}