{
  "AuthorID": "babyblooeyes",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230312/profile",
  "Posts": [{
    "AuthorID": "babyblooeyes",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230312/profile",
    "Content": "babyblooeyes wrote: Let's just jump to the questions. About 2 years ago I had a pretty nasty infection in my left breast. It was drained using a needle and was placed on antibiotics. It healed and I went about my merry way. About 3 months ago my left breast started itching like mad. I couldn't get the itch to stop it was/is on the inner quadrant to the left of the areola and at times involves the nipple and areola. The nipple isn't retracted. It is the exact opposite it doesn't even retract or get flat it always stands tall so essentially I always have one headlight on. This occurred at the same time the itching started. I would try to self treat with creams, lotions, even steroid cream. The steroid cream would actually help for a few hours, but enough to help me to get to sleep. Along with the intense itch there would also be a shooting jolt that would pretty much run along that large vein to my nipple. This could happen at any time it didn't matter what was going on. I would wake with bruising from scratching in my sleep apparently. Man I tried everything from changing detergents, new bras, cleaning bras more frequently, etc. However, it is only this one breast. At my annual exam I talked to my doc about it and it was time for a mammo so we did a screening. It showed focal asymmetry practically right around that area that had been bothering me which really is also the same location or close to the same location as the infection. Scheduled for a diagnostic mammo +/- ultrasound. Well, no mass seen on diagnostic mammo but a mass was picked up on US. I have very dense and very large breasts. It is estimated to only be about 4-6mm. When I asked the radiologist about the location of the mass and the itching being in the same areas he said he never heard of anything like that. I asked about if this could be from the infection I had 2 years ago and he said it was unlikely. The mass is solid. I think they mentioned a possible lymph node as well but I am not sure because I was there with the attitude that it was probably from the previous infection and only heard 75% of what the radiologist was telling me. Having an ultrasound guided core needle biopsy on Friday. After some research I noticed that progesterone can actually be a treatment used in inflammatory breast cancer. I was started on oral progesterone for irregular periods about 1 month ago, then a progesterone IUD was placed. I became severely anemic with the constant bleeding and was told no biopsy of the cervix unless the progesterone failed. About 1-2 weeks ago I noticed an improvement in the itching and was thinking well I must have just needed a better balance of hormones. Well, the itching is back today but not nearly as bad as it had been so I went looking and found that progesterone may temporarily improve symptoms in inflammatory breast cancer same as steroids (which I am on) and steroid creams which I have used. I also notice that the tissue may be a little thicker but it also lacks as much feeling. More or less it is just rough and a bit flaky like it is dry and the nipple is simply a nuisance. I guess what I was wondering is would the person who is doing the biopsy of the mass also be willing to do a full thickness biopsy of my skin in that area or do I need to set up an appointment with a dermatologist? Should I mention to the person doing the biopsy that I had some symptom improvement in the itching with the start of the progesterone? If the lump comes back as nothing do I still persue the intense itching? I would assume if this was inflammatory breast cancer I would probably have more issues at this point but it just seemed oddly coincidental that the location of the mass is just under the area that has been bothering me and that once I started progesterone the breast issue seemed to improve by 60%. Please let me know your thoughts.Theresa Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "16/03/2016",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/842259",
    "Title": "Lots of questions babyblooeyes babyblooeyes"
  }]
}