{
  "AuthorID": "BabyRuth",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
  "Posts": [
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jun 19, 2017 06:29PM BabyRuth wrote: Thank you so much for sharing. Your words are beautiful and a great tribute to your mother. I am very sorry for your loss. I am sure she is eating many vanilla ice cream cones now as she watches over your family.",
      "MessageIndex": 7,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856243",
      "Title": "My mom slipped away from us Emilylaughed Micmel"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Dec 1, 2016 02:23PM BabyRuth wrote: LuAnn-Thank you for coming back to update us. We all want to hear the positive stories. Thank you so much for giving us the inspiration to keep looking forward!",
      "MessageIndex": 19,
      "PostDate": "01/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/850156",
      "Title": "My most recent update - LuAnnH LuAnnH Nico1012"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "May 23, 2017 12:37PM BabyRuth wrote: Louis- your princess can now rest in peace. Thinking of you and your boys as you go through this difficult time.",
      "MessageIndex": 5029,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Oct 17, 2015 11:02AM BabyRuth wrote: They have talked about ablation so that might be an option. Were they able to remove all of your tumors and are you now considered NED? I would really like the surgery option but it scares me a little too. Once I find out for sure, I would love to talk to you in more detail.",
      "MessageIndex": 2355,
      "PostDate": "17/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Mar 16, 2016 03:14PM BabyRuth wrote: I never came back and updated after my Y90 procedure. I had 2 liver tumors before the procedure and now I just have one. The one that is still there has shrunk a little bit. I am still doing treatments of herceptin and perjeta every 3 weeks. I also started on faslodex about 6 weeks ago. I am feeling stronger and better each day. I have not been posting but I am keeping up with all you wonderful ladies. Welcome to all the new ladies. There is so much to learn on this thread and so many people who can share so much knowledge.",
      "MessageIndex": 2942,
      "PostDate": "16/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Feb 13, 2017 01:37PM BabyRuth wrote: I have not been on this thread in a while. I see that there are a few of you looking into the Y90 procedure. I did that procedure in December of 2015 after chemo failed to shrink my 2 liver tumors. The procedure itself was not very hard but the recovery was much more difficult than I was prepared for. Lots of nausea and extreme fatigue for weeks. Most people that I have talked with have had the same recovery issues. I do feel the procedure was a success as it got rid of one of my 2 tumors and shrank the second one. There is only one drawback from my procedure that just happened to me the past month. I had a gallbladder attack and had to have it removed. They did a pathology report on it and the exact wording is below. \"The etiology of the spherical foreign bodies is unclear, but may be related to prior procedure or treatment\". I do believe my healthy gall bladder was damaged by this treatment. Do I consider the Y90 a success? Yes of course since I have one less tumor over a year later. Would I do it again? Not so sure. I would have to think about it really hard. .",
      "MessageIndex": 4368,
      "PostDate": "13/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Mar 30, 2018 01:38PM BabyRuth wrote: It is just devastating to hear of the loss of Artist. I kept hoping for the best but was so worried when we did not hear from her. The losses just keep piling up. Like Zarovka said we have to keep going forward. We have to do it for ourselves and those we have lost.",
      "MessageIndex": 8055,
      "PostDate": "30/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jan 12, 2017 03:05PM BabyRuth wrote: So sorry to hear of the progression Kandy. Hearing those words are horrible and no matter what you can not totally prepare for the outcome. I hope your MO comes up with a plan you are confident in and if not go for a second opinion. It is always good to consider your options before you make your decision. Sending many prayers your way!",
      "MessageIndex": 25,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Oct 8, 2017 03:24PM BabyRuth wrote: Oh no Kandy. You can not seem to catch a break. Sending prayers that they can get your pain under control. We are all here supporting you.",
      "MessageIndex": 755,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Oct 21, 2017 11:03PM BabyRuth wrote: Mom- I can not imagine having rads anytime soon after completing the Y90. I was in no shape to have been able to do that. When will the mapping for the Y90 be done? I hope it will be soon so she can get this step behind her. I do remember the IR saying not to be in contact with small children but my kids are teenagers so I did not think too much about it.",
      "MessageIndex": 6299,
      "PostDate": "21/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Oct 22, 2017 08:00PM BabyRuth wrote: Mom-it took me quite a while. About 6 weeks to be exact. Not everyone recovers at the same pace. It may be much easier for her. My IR also went through an artery in my left wrist instead of my groin. I have not had any issues with faslodex. I get the shots one at a time and make sure to take the weight off the side receiving the shot. I try to walk around a little before getting in the car as that seems to help with the soreness. I also use a low temp heating pad to ease any pain. I will be thinking of you and Dani this week.",
      "MessageIndex": 6304,
      "PostDate": "22/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Oct 16, 2015 09:13PM BabyRuth wrote: leftfootforward-when did you have your liver surgery? My MO is presenting my case to the tumor board to see if I am a good candidate or not. I should know next week. What has the recovery been like?",
      "MessageIndex": 2353,
      "PostDate": "16/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Oct 17, 2015 02:04PM BabyRuth wrote: Worrieddaughter91-Thank you so much for sharing your mothers story. It sounds like she is doing really well and I pray that she remains stable. I will find out later this week what the doctors recommend. Prayers to your family also.",
      "MessageIndex": 2358,
      "PostDate": "17/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jan 24, 2018 02:54PM BabyRuth wrote: Grannax-so sorry about your wreck. Life is so very stressful. Praying you get great results tomorrow rpoole-I hate to hear that you are still having issue with your platelets. We all understand the hair issue. It is not a small matter. I lost my hair 3 times on chemo and wish with the last chemo that I had tried the cold caps. Some people have great success with them.",
      "MessageIndex": 7269,
      "PostDate": "24/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Oct 9, 2017 01:20PM BabyRuth wrote: Z- you are an amazing source of knowledge for all of us here. Being able to follow along on your treatment in Japan is so cool. Thank you for including us and sharing the pictures of your daughter.",
      "MessageIndex": 6164,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Oct 20, 2017 11:16AM BabyRuth wrote: Mom- I did the Y90 procedure in Dec 2015 for 2 liver mets in my right lobe. It was successful for me and I have been stable since then. I had a hard time with the recovery and had a lot of nausea and was very tired. It took me a good 6 weeks to fully recover. Grannax seemed to have a much quicker recovery than me so it varies by person. I continued with the perjeta and herceptin and started on faslodex the month after. My MO suggested the Y90 because the taxotere had not shrunk the mets at all. For me it worked and for that I am grateful. I will be happy to answer any questions you have.",
      "MessageIndex": 6278,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Nov 6, 2017 11:46AM BabyRuth wrote: You are right Z- That is a lot to handle. Thinking of you Dani and mom. Prayers for strength to get you through this. Stay strong ladies.",
      "MessageIndex": 6474,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "May 19, 2017 02:26PM BabyRuth wrote: I do not post much here but I read and try to keep up with everyone. Thinking of you all today. Louis-my heart is with you...hoping for the best for you and your princess. So sorry artist to hear of your progression. Try to enjoy your summer and take time to regroup. I too try to figure out if I should keep working or not but just can't seem to let it go. I think somehow I will know when the time is right. My goal for tomorrow is to get my flower garden planted. They also bring me so much joy! I had scans yesterday and am again waiting on results. Hoping to continue down the stable road for as long as possible.",
      "MessageIndex": 4972,
      "PostDate": "19/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "May 16, 2018 09:45AM BabyRuth wrote: I am simply heartbroken by the losses of our dear friends. I am never prepared to hear the news. It always causes me to gasp when I read it. So sorry for the families and prayers of comfort and peace as we all deal with the news.",
      "MessageIndex": 8780,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Oct 2, 2018 01:25PM BabyRuth wrote: Grannax- so excited for you! You will rock the runway pretty lady!",
      "MessageIndex": 9865,
      "PostDate": "02/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Oct 16, 2018 10:46AM BabyRuth wrote: I have been off the boards for a while. Grannax-your pictures are amazing. It looks like you had a great time and you are beautiful! I am so sorry to hear about Babs. It is so heart breaking to lose our friends over and over again. Prayers for her sweet family.",
      "MessageIndex": 9998,
      "PostDate": "16/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 11, 2013 11:13AM BabyRuth wrote: soriya123-My oncologist gave me a prescription for the Emla cream.  I can not survive without it!  It made my life so much easier when I started using it before they accessed my port. sweetheartinTX  - I hope you are feeling better today. ",
      "MessageIndex": 230,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 17, 2013 01:42PM BabyRuth wrote: Soriya123 and Rambo50-thinking of you both today as you begin your first treatment.  I hope everything goes as well as possible and that you can both get some rest when you are done.  Saying prayers for you both.  Let us know how your day goes. Soriya123- it is probably the steroids that are keeping you awake.  I sleep very little when I take those. Tomorrow is my day.  Anyone else starting tomorrow?",
      "MessageIndex": 355,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 1, 2013 02:42PM BabyRuth wrote: Hannahriggs-what a cute name July \"firecrackers\".   I think we will all \"sparkle\" like sparklers!  When I see the fireworks this week I will think of you all here.  I guess if I have to be in a chemo group I am glad to be in the firecracker one! I can tell you a little about my chemo experience from 4 years ago.  I was really scared when I went in for my first treatment, so much that I burst into tears in my oncologist office.  She had never even seen me cry but said that was a common reaction because we are so afraid of the unknown.  I never got sick but I was very tired.   Chemo brain was a big problem for me.  I could not remember anything and had to make list of things.  I do not know how many times I left my keys in the car.   I had a really great natural hair wig that I got from a lady that has a boutique here in Atlanta.  She matches it to your current hairstyle and color before you lose your hair.  It looked perfect and there were many people that had no idea I had lost my hair.  I only wore it to work and if I was out with my kids.  At home I just went natural. Let me tell you, bald does not look good on me! I was very tired and would go home and take a nap everyday after work.  Then I would make myself get up and take a walk.  Believe it or not the walking helped so much.  The whole chemo process can seem so overwhelming.  Even though I have been through it before I am still scared this time around. I am doing a different chemo this time so I have no idea how it will affect me. This is my second recurrence and I am starting to wonder what is the point?   I am glad we have a group to support us here even though I wish none of us had to be here for this reason.  Marsha- so sorry you are facing this again.  I can relate to you saying you want your life back.  I feel like I am being held hostage by this cancer.  Karen     ",
      "MessageIndex": 25,
      "PostDate": "01/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 10, 2013 08:41AM BabyRuth wrote: Welcome to all the new people in our Firecracker month!  Sorry that you had to be here.  It is important that we all support each other as we all start our chemo adventure.   I have an appointment with my PS today to take the bandages off my new nipples!  I can't wait to see them...from what I can see they look great!  It is simply amazing what the PS can do!  I am a week and one day away from starting my chemo.  I have a lot to get done before then.  I am supposed to go tomorrow to meet with the lady who helped me with my wig last go around.   She has a boutique here and works with cancer patients.   I have decided to go short and sassy!  I am just going to have to work on getting that sassy attitude to match! For those who just had their ports placed.  You will be sore for a few days but after that I do not really notice mine.",
      "MessageIndex": 207,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 18, 2013 12:34AM BabyRuth wrote: Dxat32-I enjoyed reading your blog. You have great support from your family and friends. You are ER+/PR+,HER2+ like I am. I am doing a different treatment plan as I am treating a recurrence. I will be doing perception,taxotere, and perjeta. I start my chemo tomorrow and I am very ready to get started. There is a wonderful lady that owns a hair boutique here in Atlanta who specializes in helping chemo patients with wigs. I used her last time and she matches your current hair color and style. I got a human hair wig from her that I wore only to work and there were many people who did not realize I had lost my hair. I did find it funny that my boys hated it when I wore my wig. They always preferred me to go natural. Do whatever makes you feel comfortable.",
      "MessageIndex": 371,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 24, 2013 10:33PM BabyRuth wrote: Rambo- so sorry that you have had such bad day. It really sucks and some times it feels like we just can't get a break. I hope your WBC get better soon and they you continue to feel better. Do not ever apologize for feeling bad or negative. We all consider this a judgement free zone and we are all here to support each other. Sending you and your daughter tons of hugs!",
      "MessageIndex": 557,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 30, 2013 05:30PM BabyRuth wrote: Just heard the results from my FISH test and it turns out I am still HER2+ and I am not HER2- like the IHC test was showing. That means I am back on for my chemo regimen that had already been approved. I will be starting on August 1st and while I am nervous about beginning, I am so ready to get going and kick cancers butt! My oncologist is taking my case back to the tumor board in the morning just to make sure everyone is in agreement but I do not think that anything will change. I have been keeping up with all the firecrackers who are in the middle of chemo and let me say I am impressed with you all. There may have been a few bumps in the road but you all have kept on going! we are a strong group!",
      "MessageIndex": 723,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 4, 2013 06:31PM BabyRuth wrote: Brook21679- I start my treatments on the 18th also. We can be chemo-partners! I know what you mean about wanting to bawl. It can be so hard to try to be positive all the time. Rambo50- I live a little North of Atlanta and use the Northwest Georgia Oncology center in Marietta. How about you? Where are you doing your treatments? Our 4th of July has been full of rain! Most of the fireworks have been canceled. I will miss all the beautiful lights in the sky! I hope all of you that have started your treatments are feeling okay. I wish you all a spectacular firecracker night!",
      "MessageIndex": 85,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jan 2, 2018 04:22PM BabyRuth wrote: I was diagnosed with liver mets in June 2015. After chemo and the Y90 procedure I am currently NEAD. I hope to continue my good run for a long time!",
      "MessageIndex": 8,
      "PostDate": "02/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861180",
      "Title": "Any long time liver metsters? SandiBeach57 Kjones13"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 18, 2013 06:53PM BabyRuth wrote: Sending prayers to you. So sorry for your recent loss and now your cancer battle. I am glad your daughter is close by to help.",
      "MessageIndex": 8,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/807919",
      "Title": "Hubby died of cancer 3 mo. ago, now I have breast cancer. Evelou40 bevin"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 16, 2015 08:33AM BabyRuth wrote: Freygea-How have you been doing on your chemo? Any problems or issues that you can forewarn me about? Woodylb-So happy that you are NED. I hope I get the same results as you did! Dunesleeper-I have not had any pain or swelling in my liver either. I hope it stays that way. Isy-Sorry that you are having pain and swelling. I hope you can get some relief soon. I think telling friends and family is one of the most stressful parts of cancer. Today is my first day back in the chair. I am hoping for an easy day with no issues. Thanks for all the support ladies.",
      "MessageIndex": 2089,
      "PostDate": "16/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 15, 2015 03:30PM BabyRuth wrote: I found out a few weeks ago that I have liver mets. I have been feeling fine but my MO does 6 month scans due to my history of recurrences. My liver showed up with 2 lesions and I was sent for a biopsy. The results came back that it was breast cancer and was same path as the other 3 times...Triple positive. I will start the chemo concoction of taxotere, herceptin, and perjeta tomorrow. It has been a long couple of weeks getting everything ready to start back with the chemo. I have been encouraged reading through this thread of all you awesome ladies fighting this battle. I am trying to stay optimistic but as you all know that can be difficult. Just taking it one day at a time for now!",
      "MessageIndex": 2080,
      "PostDate": "15/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Apr 8, 2018 09:55AM BabyRuth wrote: Lisajo-My MO recommended the Y90 for me and set up my appointment with the IR. It was the right decision for me as I am almost 2 and 1/2 years stable. I would recommend going to an IR on your own and discussing the options they think are right for you. The Y90 is not for everyone but the IR should be able to give you options to consider. Sandi-Great news! We are all celebrating with you!",
      "MessageIndex": 8230,
      "PostDate": "08/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Apr 9, 2018 03:13PM BabyRuth wrote: KC1010-I sure hope that you can get the Y90 approved. I also have BCBS and the Y90 was approved for me. What is their reasoning for denying the treatment? Z- I have been thinking of you today and praying that your treatment goes well. The fasting information is so interesting.",
      "MessageIndex": 8248,
      "PostDate": "09/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Apr 10, 2018 10:30AM BabyRuth wrote: lisajo-you are not alone at all. You have all of us here supporting you every step of the way. I hope your CT scan on Friday comes back with no progression and that your trip to the dentist provides the answers about your numb chin. If not, continue to seek out help. Sending you many hugs and prayers.",
      "MessageIndex": 8268,
      "PostDate": "10/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jun 27, 2013 11:13AM BabyRuth wrote: I will be starting chemo on July 18th.  Just had my port put in yesterday.  I did chemo 4 years ago but this time I will be doing a different one.   Not looking forward to it but ready to get started. ",
      "MessageIndex": 6,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 3, 2013 12:01PM BabyRuth wrote: I have a love hate relationship with my port.  I love that it saves me from so many needle pricks but I hate the way it looks under my clothing.  You can definately see mine under certain shirts or blouses that I wear. It also feels weird when I exercise.  My first one was on my left side down really low, and this one is on the right side up near my collarbone.  It does make driving much easier as it does not rub with the seat belt.  I highly recommend to ask for some EMLA creme to put on before you go for your chemo.  I put mine on about 1 hour before treatment and it helps to numb the site so you do not feel them accessing your port.   I have a very low pain tolerence so I need all the help I can get!  The chemo nurses used to just grin when I walked in because I would slather the creme on me. I did not want to feel a thing!",
      "MessageIndex": 64,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 14, 2013 01:04PM BabyRuth wrote: Marsh1970-so sorry you are feeling alone at this time. I wish I lived close to you because I would be more than willing to help with whatever you needed. I know what you mean about it being hard the second time around. People do tend to respond differently and are not as quick to offer to help. Is there someone who you are comfortable asking for help? They may not realize that your son is out of town and that you are alone. I will be thinking of you and sending good thoughts your way. Tea- if your cancer is Her2+, you will probably need chemo no matter what. I am not sure how much information you have yet but just know that you can do it. While chemo is not fun or easy it is doable. Keep us informed after your appointment on the 16th. My chemo start date of the 18th is fast approaching. I am ready to get started but still a little scared. I hope all of you that have started are hanging in there. Stay strong firecrackers!",
      "MessageIndex": 293,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 14, 2013 02:09PM BabyRuth wrote: soriya123- I am right behind you! You lead the way and I will bring up the rear! Kathie100- Try to go for a walk if you can. It will really help you feel better. Also, try to drink a lot of water.",
      "MessageIndex": 296,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jul 18, 2013 11:30PM BabyRuth wrote: I am so confused. I was supposed to start my chemo today but when I got there my fish test results were not what the doctor was expecting. My results were HER2-. That means this is not a recurrence but a new primary cancer. That also means that I could not do the chemo treatment that had been approved for me. We are requesting a retest so everything is on hold until Aug 1st. I am so disappointed that everything keeps getting delayed. I am also getting really frustrated with all this confusion.",
      "MessageIndex": 400,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jan 18, 2018 10:48AM BabyRuth wrote: Prayers for you and your family Kandy. I hope you can find relief from the pain.",
      "MessageIndex": 1093,
      "PostDate": "18/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jan 23, 2018 09:51AM BabyRuth wrote: TarheelMichelle - Thank you so much for sharing your experience and signing the guestbook for us. We were all there with you in spirit. It is so sweet that Krista remembered you. You must have made a big impression on her. Thank you again for representing us so well.",
      "MessageIndex": 1157,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Aug 3, 2017 05:46PM BabyRuth wrote: Praying for you Kandy. It is shocking and scary how fast things can take a turn. Praying that you can get this turned around and headed In the right direction. Thank you so much for always taking the time to post and keep us informed.",
      "MessageIndex": 549,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Aug 12, 2017 02:20PM BabyRuth wrote: I also had Versed and had to have some one to drive me home. The procedure and recovery took about 4 hours before I was released. I had a CT guided biopsy and it was easy for me to tolerate. After resting that evening, I felt good the next day. Prayers that your procedure will be easy to tolerate. Keep the faith Kandy!",
      "MessageIndex": 615,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Jun 18, 2014 01:14PM BabyRuth wrote: Kelly-sending you hugs and prayers.  I am so sorry you are having to go through this.  You have found a great support system here at BCO.  Let us know what your find out after your visit with the oncologist today and what your treatment plan will be. ",
      "MessageIndex": 24,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822044",
      "Title": "It was confirmed today (33 years old). Kelly1217 whatnow"
    },
    {
      "AuthorID": "BabyRuth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106370/profile",
      "Content": "Mar 24, 2017 01:38PM BabyRuth wrote: Kandy-Hoping your new plan works wonders for you and that you get some relief from the pain. Been thinking about you and sending many hugs and prayers your way.",
      "MessageIndex": 204,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    }
  ]
}