{
  "AuthorID": "badboobiesu…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247966/profile",
  "Posts": [
    {
      "AuthorID": "badboobiesu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247966/profile",
      "Content": "Mar 3, 2017 12:03PM badboobiesurvivor wrote: i am now 3 weeks post savi catheter!! was a little rough and uncomfortable but i knew it was the better choice. whole breast radiation really scared me. still sore and get pains here and there but a tleast my skin is not damaged!!! the removal was really nothing. it didn't hurt anymore than the cleaning they did when they had to move the wires around. i didn't even know she took it out at first. i actually thought she just moved it a little to prepare to take it out. i braced myself for it and she was like \"its out\" glad the whole ordeal is over now its just follow up visits. i would make the same choice again if I had to do it all over.",
      "MessageIndex": 97,
      "PostDate": "03/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "badboobiesu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247966/profile",
      "Content": "Mar 3, 2017 12:07PM badboobiesurvivor wrote: i had the savi catheter and found a way to shower. i used a small garbage bad and taped it all around the area with medical tape. then i took another small kitchen bag and made a holes in it for my head and arms and put it over (like a little rain coat) was able to wash my hair and most of me. when i got out i just used a wash cloth for the area covered by the bag",
      "MessageIndex": 98,
      "PostDate": "03/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    }
  ]
}