{
  "AuthorID": "BadLuck",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280740/profile",
  "Posts": [
    {
      "AuthorID": "BadLuck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280740/profile",
      "Content": "Oct 8, 2018 04:39PM BadLuck wrote:",
      "MessageIndex": 7095,
      "PostDate": "08/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "BadLuck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280740/profile",
      "Content": "Oct 8, 2018 04:37PM BadLuck wrote:",
      "MessageIndex": 7094,
      "PostDate": "08/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "BadLuck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280740/profile",
      "Content": "Mar 11, 2019 10:11AM BadLuck wrote: To MyMomsGirl & Green Harbor - My radiology/oncologist never offered me the option of the face down procedure or the deep inspiration breath hold. I found this out on my own when reading about better ways to give radiation to the left breast. It was on the first day of radiation Sept 4th, 2018 that I asked about these procedures & if I could try them since I was worried about my heart & lung. He told me they weren't set up for those procedures but would think about trying them in the near future. They also told me that I definately will get some radiation to my lung & heart!!! Now just another problem to worry about down the road. 🤔",
      "MessageIndex": 15766,
      "PostDate": "11/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "BadLuck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280740/profile",
      "Content": "May 29, 2019 09:40AM BadLuck wrote: Hi Cassie - you sure got me in your questions. I didn't know what questions to ask about my newly discovered tumor in my head. My MO said she was 99% sure that my Meningioma tumor was benign as the majority of them are. But she thought it was best to send me to their neurology/oncology specialist in central WI., to look at the MRI results & see what they suggest I do with it. She told me if she had one she would just leave it there as long as it wasn't causing any problems. Told me I could live a long prosperous life with it & die from another cause. But this neurologist she sent me to threw me in a state of shock! He was very cocky a short well! The last question he asked me was \"any questions or concerns?\" I asked if I should get another opinion & if he could refer me to Mayo. He didn't like what I asked & said Mayo can't do more for you than we can",
      "MessageIndex": 15802,
      "PostDate": "29/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "BadLuck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280740/profile",
      "Content": "May 25, 2019 01:27PM BadLuck wrote: Stage 1 sounds so lucky to have being easier to treat in most cases but it doesn't mean your out of the woods when treatment is over. Last June it was breast cancer & this May it is brain cancer! Please read my post under \"recently diagnosed'. I need answers & im a mess",
      "MessageIndex": 15795,
      "PostDate": "25/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "BadLuck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280740/profile",
      "Content": "May 25, 2019 09:31PM BadLuck wrote: Cassie - Thanks for some much needed answers!My rare but easy to cure breast cancer confirmed last June was enough for me to go through & now on a 5 year treatment plan of Anastrozole. At the same time I figured the cancer was growing, I kept complaining of the left side of my facial muscles tightening, twitching & pulsating. No doctor including a neurologist had an answer. Then this year on one of my 3 month visits to my MO I insisted that my facial muscles on my left side (same side as my lumpectomy) is related in some way since they come at the same time. I told my MO that I have a strong feeling that it's a brain tumor. She insisted that it wasn't & if it was then it would effect the opposite side of my face. I started crying & told her I can't go in living not knowing what the muscle spasms are. She then sighed & asked if I wanted her to order an MRI of my head. I told her she was the doctor & I'm the patient so please listen to me & I k ow it's a brain tumor. She ordered it & what did they find?! A large mass Meningioma tumor on my meninges which covers the brain! She said most of these tumors are found by accidents & they are common. Said she would just leave it there & do nothing about it since the risk of surgery is too great. Said many people with these tumors live a long prosperous life & die of other causes. This is just my luck!!!!",
      "MessageIndex": 15797,
      "PostDate": "25/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "BadLuck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280740/profile",
      "Content": "May 25, 2019 09:32PM BadLuck wrote: Cassie -So then they sent me to their neurologist specialist in central WI & although my MO told me these brain tumors are all benign (non-cancerous), the neurologist I saw told me he hates the words benign because it's misleading & \"ALL\" tumors are cancer! He said there are fast growing they call malignant & slow growing they like to call benign (non-cancer). Again, he told me there is no such thing as a benign non-cancerous tumor! It through me in a state of doom & gloom. List all hope to live on. All my dreams gone. He gave me an option to monitor it or have something done soon. I told him I'd choose the option to come back in 6 months for another MRI to see if it grow more. He had no answer about my left side of my facial muscle tremors & told me that it's unrelated to my brain tumor. So does anyone out there have suggestions or know if I have metastatic breast cancer that is spreading? He kind of suggested that tumors grow out of control once you get one. Anyone have hope for me? Please help me find answers",
      "MessageIndex": 15798,
      "PostDate": "25/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "BadLuck",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280740/profile",
      "Content": "May 28, 2019 11:46PM BadLuck wrote: Cassie - thank you for your wise words & reassurance. I'm just so confused & scared. I feel like I'm in a dream & this just can't be happening to me. When that neurologist was telling me all tumors were cancer he also was indicating to me in his drawing how tumors start & then metastasize & spread to different parts of the body. I was guessing that he was telling me that maybe my breast cancer developed from my Meningioma tumor in my head since it looks like it's been there for a very long time & looks like it's starting to calcify. My MO said she would just not do anything & just leave it there. Claims that many people with these tumors can't live a long prosperous life. I think she just didn't want to tell me about the terrible risk of having the surger",
      "MessageIndex": 15800,
      "PostDate": "28/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}