{
  "AuthorID": "badyear15",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213656/profile",
  "Posts": [
    {
      "AuthorID": "badyear15",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213656/profile",
      "Content": "Apr 11, 2015 08:03AM - edited Apr 11, 2015 08:10AM by badyear15 I am new to the forum but have benefited from reading the comments. \"SpecialK\" yours was the most inspiring and has helped me put things in perspective. I am IIa with 1/3 positive nodes and had a lumpectomy. Other than the actual cancer diagnosis and fear of dying, the hardest part of this whole thing has been making all the decisions about what type of treatment to get. Every doctor has a different opinion and every chart/graph/study shows a different outcome. My Onco score was an 18 which showed there was no statistical benefit of chemo+ hormone over hormone alone so after many long, agonizing discussions, my husband and I decided NO to chemo because the benefits did not seem to outweigh the risks. I am finishing up radiation now and am on hormonal therapy but found myself worrying constantly...did we make the right decisions, has the cancer spread, will it come back, how will I know?? The worrying was going to kill me quicker than the cancer! Then I read your comment - the risk of recurrence is either 0 or 100% - and I realized that was how I would go forward with my life. It will either come back or not and as long as I lead a healthy lifestyle and get regular check ups, I will be doing all I can in my control to affect that. The rest is up to fate and I cannot spend my days and nights worrying about that. We made the best decisions we could with the information we had and have promised each other we would not look back and second guess ourselves. So ....thank you!",
      "MessageIndex": 2225,
      "PostDate": "11/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "badyear15",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213656/profile",
      "Content": "Apr 15, 2015 06:27PM badyear15 wrote: Has anyone had experience with chemo that does not make your hair fall out? One doctor told me CMF (Cyclophosphamide, methotrexate, Fluorouracil) will cause hair thinning and in rare cases, hair loss, but another doctor told me that it does cause hair loss so I don't know which is true. Also, I have been reading about something called Liquid Biopsies (from a company called Biocept in San Diego, CA) that help detect the reappearance of cancer earlier and more accurately than a tissue biopsy. Has anyone heard of or had this done?",
      "MessageIndex": 2228,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    }
  ]
}