{
  "AuthorID": "bailey1958",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
  "Posts": [
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 21, 2010 06:18AM bailey1958 wrote: I am so grateful to you and all the wonderful women on here who stay around to show us there is life after breast cancer. Thank-you for taking the time to share your exciting news - may you have many more 10 year anniversaries!!!",
      "MessageIndex": 15,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/755284",
      "Title": "10 Year Anniversary Today! LindaLou53 gutsy"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jun 30, 2010 02:42PM bailey1958 wrote: Hello, I can imagine how scary this is for you, I am a little ahead of you - had surgery in June and am waiting for radiation - I have family support and good friends but can't imagine going through this without support. This site is great but it can also be scary because there is a lot of information and it took me a bit of time before I could read it without getting overwhelmed. I made an appointment right away with a counsellor who works with women who have  breast cancer at the BC cancer centre and I also talked with a couple of women with breast cancer through work who had really good outcomes and were so supportive. My family doctor was also great and gave me a really positive lecture and some medication (ativan) which helped with the anxiety initially.  There is a peer support program you can access through the cancer centre in Canada - I'm sure they exist in other countries. I think it is so important to have people to talk to - the people who I thought would be the most supportive (my sister) hasn't been able to help at all - I think she's too scared and the people who I thought would be no help have been great, Is there anyone you can reach out to just to listen to your fears and maybe go with you to appointments? Sometimes people who aren't family are a bit calmer and grounded and that can help you get grounded. I have heard so many amazing stories from people who were diagnosed really late in the process and have been cancer free for 18 years, one for 21. A woman in my home town had breast cancer in 1929, had her breast removed, no other treatment back then and died at 102 years of age - of old age. We have no idea what is going to be our outcomes and what is important to remember is that you will get through the surgery, get treatment, recover, fight to stay healthy and live a long and amazing life. I still have bad periods when I feel sorry for myself but ultimately I know that no amount of worrying will make the outcome different than what the outcome is going to be - and I have no idea what that is going to be. I also try not to get ahead of myself, this is a journey and it will take time and as much as i would like to skip ahead - I can't. This is a difficult life circumstance and there is no right or wrong way to go through this - we just have to take it one minute at a time. I have a real close friend who has been sick her whole life - chronic lung inflammation and crohns disease - when I asked her how she copes everyday with not knowing what her outcome is going to be she said \"I just ask myself when I get scared - am I ok right now? and I am - so that's what I focus on\" Hang in there! There are amazing, strong, incredible women on this site. I am so grateful to read and learn from them.",
      "MessageIndex": 3,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754765",
      "Title": "Surgery Tommorow : No family support Ondagrow Renrel"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 13, 2010 11:14PM bailey1958 wrote: Gena you are going to be ok. The reality is that many women get those calls and after the full set of tests to make sure there is nothing to worry about they get the - \"it's benign\" call. You need to keep your focus positive and though it is scary and hard to go through this - the waiting is the worst. It is good they are on top of this and they are checking you thoroughly - that is the most important thing. I am 52 with fibrocystic breast tissue and have had sore and lumpy breasts my whole life - I've had so many biopsies over the past 20 years I've lost count - I think at least 8 - until my diagnosis in May - they were all benign. Every time I got the call back or the request to come for a biopsy I felt that scared feeling - hang in there - chances are you will be breathing a huge sigh of relief in another week. Bottom line is - whatever the outcome you will do what you need to do to get through this - in the mean time you don't know anything right now - no amount of worrying is going to change tomorrow - get some sleep - breathe, think of a beautiful place you've visited, and visualize yourself there with positive white light surrounding you.",
      "MessageIndex": 1,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/755322",
      "Title": "33 and scared Gena2525 Halah"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 8, 2010 09:35PM bailey1958 wrote: HI again, Got my call today to go Monday and have my CT scan and tattoos??? done - also going to have blood work to determine if I am peri-menopausal so they can decide on hormone treatment for me and I will also have my follow-up ultrasound to rule out another suspicious area that was spotted on my breast MRI back in June. Oh when will the good times end? ",
      "MessageIndex": 49,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 14, 2010 05:27PM bailey1958 wrote: Love  Cranes - thanks for support and hugs. Good news for me today - my ultrasound did not show anything in the area picked up on the MRI. I must say I am enormously relieved. I have also heard I have my first treatment on Tuesday. Feels nice to have all of you to go through this with. ",
      "MessageIndex": 68,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 20, 2010 09:33PM bailey1958 wrote: I'm with you Donna. Today the young radiation technologist told me that my skin could dry, crack and open with weeping as a side effect - so good to know :O  OMG seriously hope that will not be my response to radiation. Letting it all hang out tonight hoping the air will encourage the resilient skin gods to bless me with no skin cracking side effects. ",
      "MessageIndex": 92,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 23, 2010 08:51PM - edited Jul 23, 2010 08:55PM by bailey1958 Hello Ladies, Well week one is over and I am feeling pretty glad about getting a break. I work as a counsellor in a school and so I was fortunate to have this happen now because I don't have to work through it like so many of you (school teachers have babies in the summer, I have cancer) go figure!. Thankfully I can have this out of the way before September - but I really feel for all of you struggling with bras, drooping, etc. Hang in there !! Marilyn and Bennybear - I just can't imagine how difficult chemo would be to go through and I'm thinking without the support of family and friends helping with the day to day it would be so hard.  I certainly feel like I will support people who are dealing with illness much differently now that I have had this experience. I definitely am trying hard not to be hurt as I realize that when you seem \"well\" even though you've had cancer that it is probably easier to just see the person as better. It's weird -  cancer - cause people can look really well - I've made massive changes to my diet and level of fitness and the results are showing in a positive way - I think many friends think I'm doing really well and for the most part I am but it can still be lonely late a night when everyone else is asleep or when your mind is racing with thoughts like - maybe I should update my will, no it's ok I have time, I wonder if the radiation is killing the cancer cells or if their still in there resisting??? etc.etc.etc. Sometimes when I let my inside voice say outside voice things - people just look horrified - then I say something terribly witty and we all move on - maybe that's why my poor friends are avoiding me  Have a good weekend everyone and really glad you are almost there bennybear! Also so sorry you've had to go through this with your own battle but also with your brother. That's tough stuff!",
      "MessageIndex": 114,
      "PostDate": "23/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 26, 2010 11:49PM - edited Jul 26, 2010 11:52PM by bailey1958 Hi Everyone,. It's so nice to hear all your stories. I just finished day 5 today and I am starting to feel a bit of tightening and see a little tightness and swelling in and around my collar bone and incision. I've been using aloe, emu oil and calendula ointment. I've been eating quite healthy and juicing - so I seem to have a lot more good energy than I did before cancer this is related to the massive improvement to my diet.   I've been walking to treatment and home again (about an hour and a half in total) and seem to still have energy to do that. THAT all being the good news  - here is where my problem lies - reading some of your very recent talk about being foggy etc.- that some of you feel may be related possibly to chemo and radiation, I must report - since diagnosis, I have managed to:  cut a chunk out of my thumb - now very numb and quite sensitive, rip the skin off my shin which has left a lovely purple scar, and spilled hot water on my leg while removing the lid of a travel mug to put a tea bag in the newly boiled hot water  and now have a large water blistered burn on the upper part of one leg (I am quite a sight) actually people should really run in the opposite direction from me to stay safe) I know my family keep reminding me to pay attention - I actually feel like a bit of a senior (no insult intended given it appears I may be approaching sooner than expected). Additionally, I forget regularly and today I went to pick up my sister at the airport at the right time but unfortunately a day early! I have a sense people in my life may soon begin to question if I may be deliberately trying to harm myself. At this rate I may not have a brain in 16 more sessions. Perhaps they are actually radiating my brain and not really my remaining breast tissue!  Susan - I read your post tonight and I am in awe! You are an inspiration - you seem to have found the right place in this thread because there are a lot of strong, amazing women on here who are doing whatever it takes to get their/our lives back. Welcome to all our new joiners! Hope your day is good tomorrow - I will be going to the airport! Better go check her email and make sure!!! Nighty night. ",
      "MessageIndex": 140,
      "PostDate": "26/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 1, 2010 07:00PM bailey1958 wrote: I feel so bad for everyone. I'm so sorry to hear so many of you are having itching and soreness and really feel bad for you Karen. I hope you are doing ok tonight and can mange your treatments this week with such tender skin. I continue to be super tired and am grateful for the three day weekend - though I have a bunch of out of town  company and have been feeling like just going to bed. My skin is definitely tingly and numb - but overall I seem to be managing ok. Hang in there ladies - we will get through. Sonia ",
      "MessageIndex": 175,
      "PostDate": "01/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 3, 2010 01:46PM bailey1958 wrote: Thank-you Kim and Linda for your support and hugs. I am definitely feeling blue. Quite tired and counting down to the end of radiation. It seems kind of silly to do that given your right Linda - now it's five years of tamoxifen for me too - I realize so many of you who have reconstruction on your plates must feel as though the journey is endless. I am sending hugs right back at all of you. I am once again grateful to be able to write down my thoughts and feelings on this thread and know there are women who are travelling with me and who understand - sometimes I just feel so alone. Thank-you for being here with me. Think I will go and nap.  Sonia ",
      "MessageIndex": 188,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 4, 2010 11:02PM bailey1958 wrote: Oh Linda I feel so bad for you - I hope things will start to improve for you. I definitely share the sore throat side effect with you but not to the degree you are experiencing -  sending healing thoughts your way. Karen - I too have had a few really sharp pains in and around my my tumor site this week - also in my arm pit area. They seem to happen after the radiation and then disappear as the day wears on. Eileen - I agree with Karen - we all need a place to land everyday and the degree to which we have been affected by cancer is irrelevant when it comes to needing support - though I do feel much like you about how much many of you have gone through compared to me and my heart goes out to you all. It also helps me put my complaining into perspective. Brenda - I bought emu oil in an independent health food store in Vancouver. I find it very oily and tend to use it at night with lotions and aloe throughout the day. Pat - you look great in your avatar - I bet it's so nice to start seeing your hair show up again. I can't imagine having to have gone through chemo first before radiation - I will try to follow your lead and celebrate the benchmarks. I do have the half tan tanned body thing going on - it's starting to look really funny. Julie - I'm so sorry you've had such a profound loss in the same year that you are battling this - I lost my mom to cancer 5 years ago and feel her presence in my life everyday - I know people say it gets easier but I miss her just as much today as I did when I first lost her. I hope you have people in your life who are supporting you the way she would have.   Thank-you to all the lovely women who are on this journey with me - may your skin and nipples give you no grief tonight.  Sweet dreams and good-night my cyber friends, Sonia ",
      "MessageIndex": 207,
      "PostDate": "04/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 13, 2010 10:32PM bailey1958 wrote: Hi Everyone, TGIF - two days off. The techs gave me a recipe for the angry rash on my chest today - Boil 1 litre of water add one and one half tablespoons of salt to the boiled water stir till it is dissolved and cool to room temperature. Pour over a clean washcloth and place cloth on the irritated skin a few times a day - make a new batch each day. It has been quite soothing for the itchiness - though the salt is a bit stingy initially.  Thanks for the suggestion on how to take tamoxifen Marita. I will definitely give that a try when I start taking the pill - I'm thinking I will start next week after I finish radiation. It must be really tough to be going through this in a foreign country - I hope you have all the supports you need there.  I'm with you Donna - (glad to hear you are done with tx and recovering) couldn't agree more - would love to be chatting about anything other than treatment issues. It seems like this is all I talk about. I feel like a Debbie Downer with my friends and family.  Thanks for the positive words - I am glad to have nowhere to go tomorrow and am going to watch season two of True Blood this weekend as my diversion. Spendy - glad to hear someone say they aren't having side effects from tamoxifen. My mom took tamoxifen for 5 years and never complained about any side effects. I holding out for no side effects too!! Thanks for giving me hope.    Good-night ladies, Sonia ",
      "MessageIndex": 285,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 15, 2010 09:27PM bailey1958 wrote: Hi All, I've been feeling the ghost of worry this weekend creeping up behind me. I've been trying to think about moving forward from here (wednesday when I finish rads) and letting go of what might happen in the future.  Marilyn, your post reminded me that I too will soon be back at work with all of those \"keep busy things\" on my schedule. Maybe that will be the exact diversion I need to keep that hungry worry ghost at bay. I am certain your staff are more than happy to pick up the slack - though my sense is you probably do way too much anyway. Livia it sounds like you have a wonderful support team and that your journey has been a very tough one - I've said before I just can't imagine doing chemo and radiation.  This has been a really long few months for me and it seems many months for some of you. I haven't had the same situation as many of you managing families, a job and treatments - being off of work for the summer I have had a lot of empty hours to fill and many of the people who love me seem to have gone back to their own lives (as they should) but I am a little lonely and a lot afraid for the future. It helps to read many of your positive posts to remind me that it is possible to get on with things. Thanks for the cheer Linda - I saw the Dr. I terrorized on Friday - I think when he saw me he had to work really hard to not run in the other direction ( I think I scare him )  Thanks to all of you who are here in the trenches with me. There is comfort in having companions in the \"same boat\". I am grateful tonight to have three treatments left. My skin is certainly ready to be done.  Sonia",
      "MessageIndex": 293,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 18, 2010 01:47PM - edited Aug 18, 2010 01:51PM by bailey1958 I'm done!!!! Sitting here nude from the waist up hoping to dry out all the gross sores on my chest. Just got home with my three months supply of tamoxifen - provided without cost thanks to the taxpayers of British Columbia - that's a relief. Going to start tonight. I am wishing you all no acid-reflux, itch-less, no sore anything, symptom minimal days as you continue through your radiation. l am not sure what I would do without my fan all night and the help of ativan or the lovely blue sleeping pills my doctor gave me to deal with the nights I can't fall asleep even though I am so bone tired it's ridiculous.Healing thoughts to you all!!! Sonia ",
      "MessageIndex": 324,
      "PostDate": "18/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 19, 2010 10:48PM bailey1958 wrote: Donna, I've had kind of sharp pulling pain and burning pain around the area where I'm being radiated - mine is high above my breast and runs down into it deep in the tissue (remember I'm not getting my breast radiated for the pain coincides more with where I'm being radiated). I don't have it all the time but it comes and goes. Ditto for finding all of you as the silver lining - it really has helped me to feel normal - oops there's that word again.",
      "MessageIndex": 347,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 25, 2010 08:06PM bailey1958 wrote: Hi Everyone, Congratulations to those of you who have finished up - Linda and Kim and to those of you I've missed. Today I am one week out from radiation and this is the first day that the itching hasn't gotten worse. I have been still having a bit of a sore throat off and on - almost like a tiredness in my throat. The darkness and sores are still there but I have a feeling I was a tiny bit better today - the swelling has also come done a bit. Do hang in there, I think things can only get better (thank god!!!).  Linda - your family sounds lovely. I'm so glad you are surrounded by love. Kim, glad you won't have the drive - I bet you won't miss that.  I've been struggling with this feeling - I wonder if others have felt this - it's this sense of having lost my freedom. I realize that the people around me who haven't had to face this - they have a carefreeness about them, a freedom and innocence - like nothing bad will ever happen to them. I just feel sad in a way and I'm having trouble putting my finger on what it is but it's like I've just discovered that I will never feel worry free again. I think the only way to describe it is as the loss of freedom. I feel like everyone feels sorry for me - without saying it - who am I kidding - I feel sorry for me. Think I need to go back to work - maybe that will help??? Donna and Brenda - reading your posts make me wonder if I am ready or not. Brenda, your comment about needing to learn your not in control really resonates with me - thats a tough one - I think that also relates to this fear feeling and sadness I'm having - tough lessons this cancer thing doles out - yuck!!! Take care everyone, really glad your here. Thanks for starting this thread Kim. Don't know what I would do without you wonderful women. Sonia ",
      "MessageIndex": 391,
      "PostDate": "25/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 26, 2010 10:21PM - edited Aug 26, 2010 10:28PM by bailey1958 I feel so thankful I can come here each night and read your comments. Thank-you most especially for your comments and sharing around how this has changed you too! Brenda, what you said about observing and not participating really hit home for me. Sometimes I will be sitting in a room (tonight) with 20 people and feel completely alone - not at all in a bad way - but it is such a peculiar feeling -- just feeling like I live in a parallel universe to the one everyone else in my life lives in. I definitely feel like I am grieving - though I may seem like I have it together. I certainly feel like I protect everyone I love from those dark thoughts that come at 4 AM.  Kickon2it - what you said about cutting through fluff - it's so interesting to me how present I feel with myself - really for the first time in my whole life - I'm just so present in my body, feeling every itch, a complete awareness of what I must do to stay healthy, focused on what is good for me, what I can and cannot do anymore, trying to be true to myself and also to stop feeling like I have to take care of everyone else, just living in the present moment and like what so many of you said about not being able to focus on the future but actually trying to just live today. When I get really scared I ask myself \"are you ok right now?\" and \"are you dying today?\" and of course I am not -  I am trying really hard not to let myself spiral into those scary thoughts. You know Kim, I have that same feeling sometimes with my family, like they just don't want the details or they seem so shocked or confused by the details I've shared and they seem not to remember or they can't process what they know I've gone through - it seems easier for them not to know - maybe it's self-preservation? I'm not sure - but it kind of makes me go inside myself and disappear a little. I  think that's when this feelings of separateness / aloneness / 4 a.m. scared can come up.  Anyway, enough rambling and self-therapizing for tonight. Thanks for taking the time to be here - I know it is really important to me that you are. hugs and sweet dreams, sonia  I had Donny, the Osmond Brothers, Bobby Sherman and The Jackson 5 on my ceiling. Seems like a hundred years ago. ",
      "MessageIndex": 401,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 30, 2010 08:12PM - edited Aug 30, 2010 08:13PM by bailey1958 So glad you're through Spendygirl - let the healing begin - Yay!!!! Linda - your story made me teary! Kim - like Karen with her cabbage soup disclaimer - I am going to recommend some books but please look through them first as they may not be a good fit for everyone.   When I was first diagnosed I read two books that really helped/changed my feelings about what was happening to me \"What Matters Most - Living a More Considered Life\" by James Hollis PHD. I found the book very powerful and it helped me a great deal with my fear. The second book I was very impacted by was \"Close to the Bone - Life-threatening Illness and the Search For Meaning\" written by Jungian Analyst, Dr. Jean Shinoda Bolen.  There were parts in the book that I found profound. She describes cancer as a liminal experience - something that changes us, initiates us into knowing something at a body level we never knew before and that when we have these experiences we are changed at a soul level. It has a lot of mythology, goddess, archetypal language in it so it isn't a book that will speak to everyone.  The books about food and diet that I have found very helpful are: Foods That Fight Cancer - Richard Beliveau and Denis Gingras. They are Canadian Cancer Researchers. I love this cookbook - The Cancer Fighting Kitchen by Rebecca Katz with Mat Edelson. Hope you are all feeling ok - I really am growing to love you guys - hopefully we can stay connected Lickon2it and will meet on the tamoxifen thread too! Sonia ",
      "MessageIndex": 429,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 31, 2010 07:58PM - edited Aug 31, 2010 08:00PM by bailey1958 Hey Ladies, Had a great day out today - amazing how when I'm out shopping and spending money I rarely think about cancer. I am struggling to find things to eat since i have radically changed my diet since the beast arrived. I went out and bought a book on balancing hormones through diet called \"the hormone diet\" and also picked up a book called the China Study. I've been hearing a lot about it in the natural girls thread and decided I would look for it. It looks quite interesting.    Julie, it is unbelievable to me how unjust things can be - you seem to have had so many stressors in your life - I can't believe what a sense of humor you have - it is obviously what allows you to keep moving forward. You seem like a very strong woman. Brenda, how great that you have found a workplace where there is compassion for your situation and you can feel comfortable talking to others who have been in your shoes. It sounds like a really good place - I'm with you  - I think things come our way somtimes when we really need them.  Kim, sure wish I could help you with your Tamoxifen dilemma - I certainly know the feelings and fears you are having - I am also finding some of my hot flashes pretty toasty!!I also am still itchy - it does seem to be better each day but I am certainly still a ways away from \"NORMAL\"!!!  Hey Patty hang in there you are almost through. I remember the pain and itching in my collar bone. It has cleared up completely - though the area around my incision is still terribly itchy - but it does get better. I am working really hard on getting as many anti cancer foods in each day - it is the one thing that helps me worry less about re-occurance.The cookbook is a great one - it lists all the nutritious food we can eat and what each food does for our body. It is definitely helpful in understanding why nutrition helps keep rogue cells under control. Hang in there everyone. We are almost through this phase. Sonia ",
      "MessageIndex": 438,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 3, 2010 02:58PM - edited Sep 3, 2010 02:59PM by bailey1958 Claire - thanks for checking in - it really helps to hear from women who are ahead of you on the cancer train. My skin is taking longer than I thought it would to peel. Trying to moisturize and be patient. As you said Deb, reading others process through the different treatment, side effects, emotional roller coaster really is so helpful. Julie and Patty hope you two are doing alright - bet you are looking forward to the weekend. Enjoy - even though i remember wanting to go straight through so i could get done. Donna I am interested in hearing about the embracing uncertainty book - lets us know what you think.  Really related to your comment Pat about the loss of unlimited future vision- the change in my focus has been enormous and the idea of the future and all that it holds seems so unknown now. I was thinking yesterday when I was looking through things I have kept for sometime in the future?? or when I think about getting a cat sometime in the future - that the future is here right now and if I want to do something, achieve something, go somewhere - whatever it is I want - it's time to do that and stop waiting for the future. I guess in a way it's also kind of freeing. Hope you all are doing well, have a safe and restful long weekend if your traveling (Pat).  Sonia ",
      "MessageIndex": 457,
      "PostDate": "03/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 28, 2010 10:01PM - edited Aug 20, 2013 02:50AM by bailey1958 Hi Friends, Been having a lot going on for the last couple of weeks. My daughter's were here visiting and we had a big birthday bash with friends and relatives given it was their 30th. My dad was very high maintenance but I survived and he is safely back in his own home. I feel as though I've so busy that I haven't been able to concentrate and focus on all of what has been happening in your lives. I'm relieved you had a clear bone scan Karen. I can imagine the weight of the wait and know when I have to wait for results I always feel sick and suffer stomach knots. I think about that a lot now knowing how each of the tests coming in the next few months are going to be accompanied by that feeling of fear.   Julie I am so sorry you aren't feeling well and all your preparations for your time with Jim are not going to be as fun because your sick. Get better and maybe you can spend the time curled up in bed with him resting and taking care of yourself. Also thank-you so much for sharing about your feelings for your mom when you were taking care of her. Sometimes I feel so mean saying what I do about my dad but he really is such a grumpy guy and revels in pushing people's buttons.Take care of yourself and enjoy what you can of your trip. Brenda - I am so sorry you are sick. All you said about stressing about work and being sick sounds really hard. I'm find myself getting lost or vague around things that I would never had a problem with before  - my attention to details has been lost.  Sometimes I feel like I am such a different person, I feel really raw and tender emotionally and feel like I care so little about things that used to be important to me. It's been really weird. Tracye - sending you cyber positives!!! Donna - when I read your line  mostly going through the motions - it completely resonated with me. I feel as though some things don't even get near touching me. I feel so distant from things - it's not a not caring feeling so much as it just seems like so many things are so unimportant anymore and then other things seem so meaningless. I feel so disconnected from people who were my friends. I talk to friends and I feel so far away from them emotionally. I feel so unseen by them maybe??? I'm not sure I can't seem to figure this all out yet. Sorry for being so rambly - it feels like I've been held hostage for weeks by aliens. Sonia ",
      "MessageIndex": 619,
      "PostDate": "28/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 7, 2010 06:38PM bailey1958 wrote: I was being sarcastic about the side effects being good news. Sometimes I wonder why I am taking any of these things - the side effects just feel all around bad to me. ",
      "MessageIndex": 677,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 7, 2010 06:38PM bailey1958 wrote: UGGGGGGGG!!",
      "MessageIndex": 678,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 19, 2010 04:19PM bailey1958 wrote: Hey you guys, Julie - I'm so sorry to hear about the hard time you're having. I went through what seems like a very similar situation with mom before I lost her 5 years ago. It was such a difficult time in my life so when I think about you going through cancer and supporting your mom it seems almost inhumane for anyone to have to deal with all of that. I wish I could fast forward to after your results so the wait was over - hang in there and try to take care of yourself. I know you're really worried about getting started on your pills but if I had to say life has changed much because of tamoxifen it would really be only an increase in hot flashes. Unlike you Karen I do worry that it is already growing back under the area where the margins weren't really clear because there was no other breast tissue to take - so although I am also dreading my breast MRI in December and scared I will have to do this again I feel like that is where I am going to run into trouble. It's awful  ins't it - that all of us have been through so much and now we feel a little like sitting ducks waiting for it's return. I guess in a way my busy ness helps me keep my mind off these thoughts. I don't have any pain like you're describing Kim but I have to say my itchiness is horrible - last night I could hardly sleep for the itching. Hope you all had a nice day. Talk to you soon. Sonia ",
      "MessageIndex": 717,
      "PostDate": "19/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 9, 2010 10:33PM bailey1958 wrote:",
      "MessageIndex": 866,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 28, 2010 09:51AM - edited Dec 28, 2010 09:52AM by bailey1958 Good Morning Everyone,  Just got back from Palm Springs - it was so lovely and great to have a change in venue. I am feeling for you Tracye - I hope everything goes well this week and like me your previously lite up areas no longer light up. Julie - I have very achy joints/body and find it helps to walk regularly - I also find the cold makes things worse - so in Palm springs everything felt a bit better. Almost 2011- I am certain we are all going to have a better year! Bring it on. Sonia ",
      "MessageIndex": 935,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 28, 2010 09:02PM - edited Dec 28, 2010 09:04PM by bailey1958 I'll second that!!",
      "MessageIndex": 939,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 6, 2011 04:02PM bailey1958 wrote: awesome!",
      "MessageIndex": 980,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 12, 2010 10:03PM bailey1958 wrote: Hi Donna, Thanks for the hug. Went out to a movie for a distraction and feel a bit better. I think The waiting game is pretty tough that's for sure!!! The impression I got today was they were having a problem finding what was seen on the MRI. My radiation oncologist was very negative about MRI's - I think the thing that I have learned in this process that has been the most surprising is just how imperfect the screening tools are (MRI, ultrasound and mammogram) and how critical it is they be used together in order for dense breast tissue to be really \"seen\" clearly. There really is no way around this - cancer sucks. ",
      "MessageIndex": 59,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 18, 2010 11:14PM bailey1958 wrote: I am thinking of all of you tonight - feeling a bit sad like you Kim. Good luck to everyone tomorrow - I start on Tuesday and wish it was over already. I feel scared - not of the process but because of what it does to our bodies - it feels kind of inhumane. So, I should try not to think about that and probably keep my inside voice from speaking through my fingers so I don't drag others down into the pity pit with me and just be grateful there is a treatment for us. UUUGGGG!!! Sleep well warrior women - we will thrive. Sonia ",
      "MessageIndex": 78,
      "PostDate": "18/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 28, 2011 06:53PM bailey1958 wrote: I sure wish I had something to say that could help you through this Trish. I am so sorry for you that this is happening but relieved it was found and you are going to get the bugger out of you - I hope the process is quick and that you will be on the road the recovery very soon. I know you have probably found a number of stories by women on these boards who have had this happen to them too -  2X and 3X and now are years out in good health.  Karen - I am so sorry to hear how badly you're feeling and the burden of guilt you are feeling. Please know this is not yours to carry. I have been watching a video that helps ground me when I get ahead of my self with my fears. I would highly recommend watching it - I have found it very grounding - do check it out. http://www.gratefulness.org/brotherdavid/a-good-day.htm ",
      "MessageIndex": 1052,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 30, 2010 06:06PM bailey1958 wrote: Hey Ladies, Long weekend in Canada - so three days off from radiation - YAY! I am definitely much more tired than usual - feel like I really start to drag mid-afternoon. Skin feels fine today but raspy voice thing definitely related to rads. Chicago1018) - the technicians asked how I was today and I told them I am experiencing raspy voice everyday in the morning, they (very RELUCTANTLY) said it's possible a very small area of my throat is being affected -  it does seem to improve after I talk and warm up the vocal cords. Otherwise 9 down - 11 to go. Have a great weekend everyone. Sonia ",
      "MessageIndex": 166,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 3, 2010 05:56PM bailey1958 wrote: Hello Everyone, I am continuing to drag my butt this afternoon feeling so tired and EEEEmotional that I have to believe it is the effects of the radiation and reading your responses have really brought on the tears. I think trying to hold it together for the past few weeks has really come to a head this weekend.  Karen your comment about your friends and reminding yourself it's not their fault you have cancer really struck a nerve. I have so many really good friends and family who for the most part they have all just resumed their lives and there are days when I feel so mad at them for that. I have to remind myself it's not their fault they have lives and other things to do other than sit by my side. But there is an aspect of their getting on with things that has been really hard for me to accept - and realizing this is not over anytime soon is really hard to take. Thanks so much to all of you to letting me know that you are feeling similar things - it helps so much to know I'm not alone. Sonia ",
      "MessageIndex": 191,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 8, 2010 09:53PM - edited Aug 8, 2010 09:55PM by bailey1958 Sorry to hear about your blisters spendygirl - I hope things don't get worse for you and you can continue through treatments. Felt very itchy all weekend and things didn't improve as much this weekend compared to how much they did after two days off last weekend. I am really excited to be done - but dreading the week given how uncomfortable my skin feels after two days off.  Julie I was called with an appointment time for a follow-up breast MRI for December - I assume that will be the first scan I will have done after my treatment.  My cancer was on the edge of the breast tissue and outside the breast tissue that is scanned during the mammogram.  I assume that is why they are doing a breast MRI - Is that what others are having as follow-up or are you having mammograms? Hope you all had a nice weekend. Hope it is a torture free week for you all - hang in there! ",
      "MessageIndex": 243,
      "PostDate": "08/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 16, 2010 09:17PM - edited Aug 16, 2010 09:18PM by bailey1958 I have been quite busy today with guests and was really looking forward to getting here to see how you are all doing once they left. I laughed so hard at your post Karen - I can imagine your/my technicians all saying in unison - \"you must have had a congenital defect in that breast of yours Karen because it sure couldn't be the radiation that caused that explosion of your breast\".  Saw my surgeon for my follow-up today - she assured me I am doing really well 3X's - when I asked her to tell me what it was about me she saw that indicated to her I was doing well - especially as she was looking at my red, encrusted surgical scar with a stitch abscess on either end of it, surrounded by oozing skin sores when she said it - she kind of just stared at me and repeated - you're doing really well! I have accepted that I must need too much reassurance and am clearly a handful for my doctors.    Two left! UUUUGGGGGG!    ",
      "MessageIndex": 304,
      "PostDate": "16/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 17, 2010 05:06PM bailey1958 wrote: Good afternoon everyone, I can't believe tomorrow is finally my last day. I want to let you who are earlier into the journey know that many of the symptoms you all are describing are ones I have had at some point along the way. Julie - heart palpitations (I am also iron deficient and that is also a side effect of iron deficiencies. I have been sleeping better since the tiredness descended Julie - so sorry you are having such poor sleep. Kim - I have the little pimples all over the area being radiated too - they started in week two/three - they called them skin dermatitis and gave me betaderm for them. They haven't got worse but they also haven't got better. I imagine that will improve after radiation ends. I have also been getting more and more of those electrical currents and burning. The tiredness was really bad the last 8 sessions for me.  I met a little girl today who is 4 getting radiation. She has to be put to sleep before each of her sessions - her family looks exhausted and said it has been very difficult. What a nightmare. Made me feel like a whiner. I am imagining that for many of the rad techs - my journey does seem pretty normal compared to hers.  For those of you who have to take tamoxifen - which thread are you going to join? I think I am going to stick around for awhile and see how taking the dreaded \"T\" goes and want to join a thread but there seems to be a couple going at the same time. I am sending healing thoughts your way - hang in there everyone. Sonia ",
      "MessageIndex": 316,
      "PostDate": "17/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 6, 2010 09:25AM - edited Sep 6, 2010 09:26AM by bailey1958 Hi Everyone, Pretty quiet around here. I've had a busy weekend with company and preparation to go back to work. For those of you who are hitting the wall with poor energy - I had a B12 shot at my naturopath a week ago and I have to say it certainly seems to have given me more energy and I haven't hit the wall as some of you have described a couple of weeks after radiation. My skin continues to be itchy and the peeling is still apparent but the skin is mostly starting to look normal. Trish my DH has had a basal cell removed a couple of times from his nose and when they did the surgery it was a huge hole on his nose and took some time to heal but evidence is completely gone except when he gets sun on his face and the rest of his skins gets a bit tanned but his little spot stays quite white. I know it was worrisome to him and I when it happened but it really has been fine. My brother also had one and he has had no further trouble. I think the word - cancer has become so loaded with negative meaning that just hearing it feels like a death sentence. Hang in there!! I am reading \"The China Study\" as I have said earlier and there is some pretty crazy stuff in there that kind of freaked me out. First - he is a huge proponent of plant based food and says cancer, even once you've had it can be managed to a large degree by diet. There are multiple studies they have conducted and replicated that associates animal protein with an increase in cancer once it has been established in the body from exposure to some type of carcinogen exposure and says \"Foci growth could be reversed, up and down, by switching the amount of protein being consumed, and in all stages of development\" and that cancer insults to the body in a dormant phase can be reawakened to form foci with more that 20% animal protein ingestion. Bottom line of their studies - \"These studies showed that cancer development is modified by relatively modest changes in protein consumption....foci did not develop with up to about 10% protein ingestion ..beyond 10% foci development increased dramatically...\" For the experiments they used casein, which is made up of 87% cow's milk protein and when they did the study with plant protein it was not implicated at all. It is the best argument I've read so far for staying away from dairy and meat. It has been fascinating so far - sorry if I am boring you all with it but I wondered if any of you have read the China Study or if you have thoughts about this material. All of this said - I am still sitting here drinking coffee with cream - so hard to give it up. Hope you had a great weekend of healing and rest. Sonia ",
      "MessageIndex": 470,
      "PostDate": "06/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 13, 2010 06:27PM bailey1958 wrote: Happy Birthday Julie!!! It is definitely a week to celebrate for you.   It's so nice to know that everyone is done - as of tomorrow. I will miss you all and your posts. My skin is almost done with the peeling and looks almost normal - though I do feel intense itching at times - especially at night. I am quite nervous that now we are all done you will all disappear into different threads and i won't be able to find you. I feel scared to be alone with my worries and it is a comfort to put them out here and have people respond. It's so weird that it's all over and you have to just go back to living. I guess I'll get back to NORMAL sooner or later.  Brenda - diamond earrings - yay!!! Good for you.  I wish you lived near me Kim, boy would it be nice to have any/all of you around - but that said Vancouver is a bit of a ways away from your corner of the USA. Take care all, Sonia ",
      "MessageIndex": 516,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 14, 2010 06:26PM bailey1958 wrote: I just love you guys.  Julie - you're done!!!! I feel so bad for you and all you've been through losing your sister. I was just reading about people's grieving rituals after the loss of a loved one and shed tears over the loss of my mom - again!! I feel like I miss her more each day and it's been five years - so I can only imagine the profound loss you feel right now.I agree with KIm - \"A\" or \"T\" who cares - you're with us - stay with us please - don't want to loose your great energy.  Spendy - I worry constantly about reoccurance - though I will not let myself search outcomes anymore. I feel scared but more than scared I think I feel really sad. I also feel like I've experienced the death of a part of me through this process and it feels like I am grieving for myself right now - so I can totally understand not feeling like celebrating Julie.  Claire - thanks for coming to check up on us and including us in how things unfold as time goes on. I agree with you Karen and Claire - finding someway to celebrate or mark this occasion seems really important. My daughters are flying me to meet them in San Diego this weekend to celebrate their 30th birthdays with them. They booked my flight and called me after - said they wanted to have me with them when they woke up on Sunday and to have me around to celebrate with that day. My sense is they are terrified I'm about to drop dead and won't be around forever to celebrate birthdays - but I feel so blessed and touched by their actions. Makes me feel a bit melancholy and worried I may not be around to see them have babies etc. I am on facebook - rarely go there but would if you all wanted to connect that way. Take care everyone - thanks for your support!!!",
      "MessageIndex": 531,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 25, 2010 12:04PM bailey1958 wrote: Hi Karen, When I went for my scan they kept me an extra 25 minutes doing additional scans they initially said they didn't have to do. They said they were being extra cautious and thorough because of the cancer diagnosis. I was given my result after a week and I had arthritis activity in my wrists and neck. No METS - hang in there - I bet they are just being really thorough and cautious with you. Sending you a million hugs and positive vibes. Sonia ",
      "MessageIndex": 594,
      "PostDate": "25/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 26, 2010 10:51AM bailey1958 wrote: Good Morning Everyone, Well today is the day - if I can get through it, I will have avoided going to prison for homicide. I know you all don't know me so I will keep all my mean inside thoughts on the inside so I don't shock you. But let me say this - my mother was a saint. Wherever she is in the afterlife - she has earned the prize for endurance (59 years of marriage). KIm I am with you, I actually feel some anxiety about cancer lately given every time I turn around there is some public service announcement regarding cancer. I hope it's over soon. I went to a party last night with a large group of people = most aware of what happened to me - it was also very weird - people look at me with such pity - it makes me sad - almost like I want to defend myself - so I start trying to convince them I am going to be ok. It really sucks. This has been a tough weekend that's for sure. I feel a lot of dread about the upcoming tests and doctor visits I will have to do in October. My surgical, radiated area is so itchy and it really has been 6 weeks since finishing. I am going to try and get all the tests and screening you all are talking about. Just hope things go well for all of us. I really have a knot in my stomach today - different than the numbness I was talking about - this is such a roller coaster. Enjoy your sunday - going to go find somewhere to hide in my one room loft apartment  ",
      "MessageIndex": 601,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 4, 2010 06:23PM - edited Aug 20, 2013 02:52AM by bailey1958 Hey Ladies, LONNNG day today and feeling really tired and it's only the start of the week.  Yesterday was run for the cure and it was a really emotional day for me - it's was really weird to know people were out running with my name on their chest - I just couldn't face it.  An another note, do any of you continue to have really deep itchy skin where you had surgery and radiation. I feel as though my skin is more itchy now than it was a month ago. I have my followup this week with my radiation oncologist and I am really nervous. I feel after all the testing you are all having that I should be getting the tests on liver, eyes, cervix etc. etc. and kind of don't want to bring it up because I can't tolerate waiting for results. I can remember those days tracye of waiting with my eye on my cell phone for a call that felt like it would never arrive. Hang in there - am I ever sending all of you NO MORE NOTHING NO BAD EVER AGAIN thoughts. All your talk about sleeves is making me wonder about a trip I'm taking to India in November and if I should be thinking about that to. I think I will check with my radiation oncologist this week when I meet with her. Take care everyone. Sonia ",
      "MessageIndex": 647,
      "PostDate": "04/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 12, 2010 06:41PM bailey1958 wrote: Hi Ladies, Got my blood test results about my platelets and all is ok. Doctor says she will keep me on tamoxifen and check my levels again in February. Glad I don't have to change anything. I have discovered something positive that is happening that I realized in the shower today - my leg hair has stopped growing. I think that may be the most positive side effect ever. I've been really tired, emotionally drained by the end of the day and happy to get into bed early. Feel I have to actively work to keep the negative thoughts from creeping in. Having these intrusive thoughts that I won't share so I don't plant ideas in any one's head but really don't like some of my thoughts. I know for those of you who are contemplating counselling or support group, that I really have appreciated seeing a counsellor through this process. She is a cancer counsellor and she really does have astute and helpful things to say to me. If you are unsure - give it a try - you may actually find it really helpful to keep a handle on the depression. I am going to go walk on my treadmill - exercise is one of the things I am having the most difficult time incorporating into my life. YUCK. Take care friends. You give me strength to go on. Sonia ",
      "MessageIndex": 696,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 13, 2010 05:18PM bailey1958 wrote: Karen - I definitely have had long periods of time when I don't think about cancer. Hours for sure. I have a work password that is cancerfree and I've realized that I need to change it because every time I type it I am reminded and have realized I don't think about it as much lately so don't want to remember when I don't have to. I know???? what was I thinking when I set my password - who knows?? I thought it would be a positive affirmation but it actually has worked the opposite.  ",
      "MessageIndex": 704,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 15, 2010 05:39PM bailey1958 wrote: I agree with Karen, Pat. I checked out that site early on and mostly just felt confused by what it was saying. Don't let it keep you down.  I went to my counsellor today and told her about how disconnected and foggy I feel. She said most women who see her after cancer have the same description and that there is a new book she thought called brain fog that describes the phenomenon and suggested I read it. She said they are no longer attributing this effect to chemo but in fact it seems to hit most people and they say there may a number of factors that could cause it including radiation, hormone treatment, the surgery, stress and perhaps even something that the tumor releases. Crazy! Have a great weekend everyone. ",
      "MessageIndex": 707,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 21, 2010 05:03PM bailey1958 wrote: Please take care Julie - I'm so sorry your mom is suffering - sending you cyber hugs and prayers. Sonia ",
      "MessageIndex": 726,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 24, 2010 09:30PM - edited Aug 20, 2013 03:00AM by bailey1958 Hi everyone, Just typing through a hot flash - having so many of them I am taking it as a sign that there is no more estrogen in my body. I have been doing a lot of research and reading and found a link to a research summary about nutrition that really spells in out. If any one is interested I've included the link  cancer.ucsf.edu/_docs/crc/nutr... I also found this article on dairy and why we shouldn't eat/drink it - if you have no interest in giving up the cream in your coffee - DON\"T READ THIS - http://www.rense.com/general26/milk.htm Tracye - I wish that I could say something profound that would help you with the situation you're in. I know when there was some talk that I may not be able to take tamoxifen and that I may have to \"loose the ovaries\" I felt pretty attached suddenly to them.  Hang in there. Julie - I hope you are surrounded by all the love and support you need during what is such a sad time. I miss my mom everyday - I think actually more everyday because each day without her that goes by just makes me miss her more. It's so hard at times when one of the most important people in your life passes and leaves a big hole where she once was - I will always miss my mom as I am sure you will too.  Welcome back Donna. So glad your trip was cancer free - that makes me look forward to my trip in November. It is nice to feel regular again - though those weird pains and itches could stop any time. Try not to worry too much about your skin tag/mole. My DH has them removed regularly being a freckled guy and it always surprises me how something so small can take 3 stitches to sew up.  I am certain it will be fine - he has so many and they always come back benign. Sending you good mole vibes. How have you been feeling Kim - I know you said you were feeling pretty blue - are things staying the same or are you starting to rebound?  Have a good week everyone - there is so much going on for all of you. Sometimes I talk about you to my friends, family, colleagues and they look at me like I'm loosing my mind. It goes something like this - \"one of the women I talk to online who has been through breast cancer like me says..........\" and they look at me like WHO?? are you talking too? You've become friends - seems strange not to know what you all look like but it really doesn't matter - maybe one day we will have to meet somewhere.   Sonia ",
      "MessageIndex": 743,
      "PostDate": "24/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Nov 10, 2010 07:05PM - edited Aug 20, 2013 03:09AM by bailey1958 Hey Lovely Ladies, You guys make my day almost every day. Thank God for you. I am really super excited for my trip although I will be in Hong Kong alone for two days before I meet up with my daughters and the group we are traveling with. Hopefully my brain damage from tamoxifen won't get in the way and I will remember who I am, where I'm going and how to get back to the airport or I won't have to worry about eating because will find myself lost after taking a wrong turn, get abducted and sold into the sex trade. I suppose things could be worse - I could have cancer!!!! ",
      "MessageIndex": 783,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Nov 16, 2010 08:55PM bailey1958 wrote: HI Everyone, Just want to let you all know I will be leaving tonight to India and not back for a couple of weeks. Take good care of yourselves while I'm away. I hope everything goes well for you Tracye - I will be visualizing you coming through your procedure with flying colors and benign results. I know Friday will be a big day but it will be out of your way and then you can get on with your recovery. I am going to miss you all and hope you take good care of yourselves. I know winter is settling in for many of you, keep warm. You are all inspirations to me - I will miss keeping up with your day to day. Here wishing you healthy days, no new worries and lots of cancer free thoughts and experiences. See you all soon. Sonia xoxox ",
      "MessageIndex": 816,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 1, 2010 06:44PM bailey1958 wrote: Hi Everyone, Well I have been in a whirlwind of travel and am finally home. India was pretty crazy - very intense, chaotic, challenging, noisy, sad, and amazing. Hong Kong was a giant shopping mall but had an amazing experience there seeing a Giant Buddha and visiting a monestary. Had a number of incredibly cool experiences and saw amazing dieties from 7th century carved into cave walls, boat trip on the arabian sea,  beautiful temples, ancient cities. I kept thinking about how amazing it was that all these things exisited before us and how insignificant we all really are. Made me feel really grateful and lucky when travelling in India. In comparison to what women have to deal wth there - I felt really lucky. I ate anything I felt would be safe in India - absolutely no fresh vegetabels and fruit - didn't feel guilty but had to keep reminding myself that I wouldn't die of cancer from a couple of weeks of normal eating. Then, On the way home I started to have anxiety and am now feeling the chronic presence of it in my body. The triggar - I have a breast MRI on the 13th and feeling terrified. Mad that I let myself be roped into an appointment before Christmas and also feel like it will just be like the last one with areas that need to be checked out. Now that I've read about your recent mammo experiences -  I am feeling like I am going to have to deal with similar experiences - things hanging over my head for another 6 months. I have had no check-ups since finishing treatment and haven't had a mamo since diagnosis. I keep thinking I should be getting one but know that an MRI is more than enough. Do you guys think I should also get a mammo as well? God I hate this - I'm with you Karen - I HATE CANCER - please go away and don't come back - it really is such a downer. I just want to forget and just when I've started to feel better - I started to run into follow-up appointments in my day timer. I have a chronic knot in my gut.  I really missed all of you and I am so sorry to hear about your pain Tracye - I hope the procedure will set you up for less problems and that your health/body heals very soon. Glad to hear your reports are positive Kim. I know this stuff is really so hard for all of you - but thank-you for being here and being a part of my support team. I couldn't wait to get on here tonight and read your posts. Sending you all hello, thank-god your here hugs! Sonia ",
      "MessageIndex": 846,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 7, 2010 07:17PM bailey1958 wrote: HI Friends, I've been having a hard time writing something to you. I am so nervous about my health and hearing about Elizabeth Edwards is just making things more difficult. I feel scared about my MRI appointment next week. Thought about cancelling it everyday this week and putting it off until after Christmas. That doesn't seem like it will make me forget what is hanging over my head so I am trying to think of it as needing to just get it over with and deal with whatever comes from it. I just can't seem to convince myself a clean bill of health is possible - I feel like I will never be safe again. It's funny - no one knows I have a test coming up and I've decided to just go it alone - it seems like you guys are the only ones I can say it to - I feel like such a freak - all the things I'm saying to myself -  stay positive, no way something could happen so quickly - I should get at least five years without a reoccurrance - are coupled with - this feels like a lump, what if it's spread, what if it's in my ribs, stomach, liver, bones BLAH BLAH BLAH. Sometimes I just hate this. I'm resisting erasing this. UGGGGGG ",
      "MessageIndex": 859,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 3, 2011 06:58PM - edited Feb 3, 2011 06:59PM by bailey1958 By the way Kim, talked about the study that said that tamoxifen wasn't as effective with lobular cancer and my radiation oncologist said that was ridiculous and it was in fact extremely effective with ILC, even more so than chemo. ",
      "MessageIndex": 1088,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 4, 2011 09:34PM bailey1958 wrote: I just pm'ed you Brenda.",
      "MessageIndex": 1102,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 11, 2011 07:18PM bailey1958 wrote: Just wanted to stop by and say hi and let those of you who haven't joined us on facebook know that we miss you and hope you will be joining us soon. ",
      "MessageIndex": 1123,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 11, 2010 11:23PM bailey1958 wrote: I'm with you Love Cranes. I am feeling relieved to be going for the prep for my rads tomorrow but I am feeling very anxious about my ultrasound follow-up that is also happening tomorrow. I keep thinking if they find more cancer with the ultrasound that it doesn't change anything - cancer is cancer at this point - if I suddenly have more than I guess I just have to deal with it - I hope they can tell me right away and I I don't have to wait beyond tomorrow. I feel like the more I wait the more I second guess every decision I've made to this point. ",
      "MessageIndex": 51,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 20, 2010 10:05AM bailey1958 wrote: Thanks for your kind works Pat. Off to my first treatment - wishing you all a problem free day. Thank-you all for being a part of my support team. Sonia",
      "MessageIndex": 84,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 21, 2010 07:25PM - edited Jul 21, 2010 07:26PM by bailey1958 sorry to hear about all your sore nipples - glad mine isn't being radiated but even after two sessions I can already see the area that is being radiated is starting to look darker. I really feel for all of you. I am hoping my olive skin, easily tanned skin will be ok but I think I may be in denial. You know it's only been day 2 for me but when they leave you in the room because it's unsafe for them to be in there - it is such an odd feeling - can't imagine this can be good for your skin and all I am hoping for is getting through without the skin breaking open etc. Leklovessrk - I think it is going to end up being much darker on one side of my chest than the other - sounds like tanning the other side may well be what I have to do too!! It must be really hard to deal with this with kids at home. How old are your kids?  Kim - I asked about the type of radiation I'm getting - it's called electron radiation and it spreads out like a flashlight they said so the actual area it covers is similar to yours 8X7.. They said the same thing to me about that pad thing - but they are putting on my everyday - horrifying really!!! I think it would be better to be in denial - ask less questions and just be surprised by what happens.   hoist123 - so sorry you have to go through this again - how are you doing with this - have the treatments changed much in 10 years?  Spendygirl - so sorry you've had all the crappy side effects you've had. I had a hematoma after my breast reduction surgery and remember my breast being much more tender than the other breast - have some numbness that never went away on that side too - always chalked it up to having a huge hematoma that had to be drained 2X. ",
      "MessageIndex": 99,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 22, 2010 06:39PM - edited Jul 22, 2010 06:40PM by bailey1958 Hi Ladies, Hope the day went ok for you and your treatments weren't too awful - mine was still painless though my skin is starting to look a bit tight and puckered - scary!!! Hope all your swelling, chaffing and irritated parts are not getting worse. It's interesting how many of my friends who I thought would be with me all through this have kind of lost interest???  I feel as though more than anything people are kind of scared and it's easier to just see me as strong and getting on with it - and so they seem to think things are all back to normal. It's hard to be vulnerable with them and let them know how scary it is to be in my head sometimes and how hard it is to have fears about the future - get lots of comments like - don't worry everything will be fine!!.   Hindimetfan - I've got lots of crazy comments too! Sometimes it's just easier to keep it surface to avoid everyone's uncomfortable, though I'm sure well intentioned remarks. How old are your twins Patty? I have twin 29 year old daughters - they've been wonderful and so supportive. I, like you have enjoyed having them around to have some fun with this summer though they have just left to go back to work. Hope you are all well - good luck tomorrow - then two days off!!! Yay - the weekend. Sonia ",
      "MessageIndex": 106,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 24, 2010 07:47PM - edited Jul 24, 2010 10:47PM by bailey1958 I've been in a conference for the past two days and I've found myself waiting all day to come home - first thing after I kiss my guy is to get online and read what you have all written throughout the day. I am so grateful for all of you - you make me feel so normal and I truly feel like you've become so important to me and even though I wouldn't know your beautiful faces or recognize your hairy or hairless heads -  somehow you've become a bit of a lifeline to me. It's weird - today I kept thinking - I wonder if anyone else in here (25 women plus 4 men) have had cancer, do they all have their breasts or have they had to have mastectomies, can they see my incision, I wonder if they can tell there is something different about me (we've been in a training program for a year together) I've lost some weight and one of the women asked me yesterday if I had been pregnant OMG  - I wanted to blurt - nope just cancer! But  I contained myself - it just felt like it would be way too horrible of me. Pagowens - love the aloe straight out of the fridge onto the breast tissue - nice and cool - though my skin is so numb it takes a bit before I feel it.   Take care of yourselves warrior/super women, you are fighters, gritty awesome and inspirational to me - thank-you for your stories tonight - I am not really talking about this with anyone anymore except my wonderful guy but it's this place we've created together, that is my safe place to land in at the end of a day of keeping it all in inside of me - it helps me so profoundly. Thank-you for being here. ",
      "MessageIndex": 120,
      "PostDate": "24/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 11, 2010 07:29PM - edited Aug 20, 2013 03:23AM by bailey1958 You guys are so amazing. Thanks for the great support, the hugs, words of encouragement and holding me in your thoughts. I am definitely back to waking up and having trouble getting back to sleep. Lots of anxiety dreams. Tracye - I certainly feel my breast is still swollen - and much of it is along the side of the breast below where I had my sentinal node biopsy. If I feel it long enough it feels like a circular area that I can start to feel panic about. My breast is definitely a bit bigger on the treated side. I am glad the MRI will look at both my breasts. I am due for my yearly mammogram but I've decided this test should be sufficient. I will check that out on Monday. I have a follow-up appointment early January to see my breast surgeon and I have also decided to request a referral to a medical oncologist (not sure if that's what they're called) - I currently see a radiation oncologist but I am thinking quite seriously about shutting down my ovaries and changing to an aromatese inhibitor instead of tamoxifen. I was reading a study that said with my type of cancer it isn't as effective - so I want to talk to someone about this. I was quite concerned about endometrial cancer as a side effect but there is a doctor who has been working in the area of breast cancer treatment who has said in an article I was reading that since the 80's he has only seen 3 women develop endometrial cancer - that made me feel relieved but I want to find out more about the tamoxifen/lobular cancer issue. I hadn't heard that tomoxifen reduces breast density Kim, I am the queen of dense breasts - I've been taking iodine since July and it is also supposed to reduce density - I guess I will find out soon enough if it has worked for me - but if it hasn't for those of you with dense breast tissue - likely it won't have made any difference. I think the holidays have also had a negative effect on me -  it is a time of year my mother loved and it just hasn't been the same since she died. I think with everyone getting tests and results right now it is a bit of a downer. I used to read the obits after my mom was diagnosed with cancer and feel overwhelmed if there was anyone who was her age or younger. I avoid them now at all costa - though I feel like all anyone ever talks about is cancer -on the news, in the staff room - it makes me feel crazy.  I am happy to be going away with my guy for Christmas - we are meeting my daughter's in Palm Springs - going to lay around the pool, read, hike and ride bikes - and shop. I have 3 weeks off for Christmas and I am hoping this test doesn't interfere with any miserable results. I think you are all so amazing and it is because of you guys coping with these wait and see results  - I realize I will have to try to accept any results I get as gracefully as the rest of you have done. I think I will try and read \"picking up the pieces\" sounds like something I need to check out - thanks for the suggestion Brenda.    Thanks again everyone, Sonia ",
      "MessageIndex": 874,
      "PostDate": "11/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 2, 2010 09:13AM bailey1958 wrote: Good-Morning Kim - I know that the type of radiation(electron) I am getting is only treating a specific area according to the technicians. As I understand it - this is not a systemic treatment - so other than the area being treated - the rest of our bodies aren't being affected??? Look forward to what you get as an answer. Hope everyone has a symptom free day. Sonia ",
      "MessageIndex": 177,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 2, 2010 08:44PM - edited Aug 2, 2010 08:46PM by bailey1958 Hi Everyone, I've had a houseful of guests off and on for the last week. Said goodbye tonight to most and my sister leaves tomorrow. Feeling very PMS ish today - really on the verge of tears with a big anger ball inside. I feel as though I have to be normal or everyone starts looking at me (when I'm being honest or say anything about my treatments)  like I might die at any moment - they all have those eyes that say how sorry they feel for me. Makes me feel like crying so it's easier just to act like all is well. - but have to say - feeling a bit vulnerable tonight - me and my cancer - hope this radiation is killing it all - don't like feeling this way. Feeling pretty alone - even in a houseful of people. Glad you're on this board. You make me feel more normal.  Sleep tight! Sonia ",
      "MessageIndex": 182,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 3, 2010 12:33AM bailey1958 wrote: Thanks for the kindness and support Linda. It's funny tonight I realized how \"present\" I feel in my body. Everything is so in my face - my health, my future, my mortality, every ache and pain - it all is so a part of what I have going on in my head. I feel like so many people in my life are so distracted by their lives - and inside my head I feel so intense and life seems so immense right now. Saw a little girl today - about three wearing a t-shirt that said \"It's All About Me\" god - I feel like I am so self-asorbed but that t-shirt is a reflection of my inside life even though on the outside its business as usual - taking care of people, cooking, entertaining - being the good \"girl\". Not rocking anyones boat or causing any discomfort. I see these beautiful women at the Cancer Centre everyday, little kids, old people and so many are sick and struggling - those of you who have had chemo - god I am stunned by your courage, I just don't know how you've managed this, I just feel so bad and mad at myself for feeling sorry for me and so I just push forward and try to ignore just how huge this is and how hard it is to know that it will always be a part of my life - waiting for the next check-up. I know it gets better because it already has  - but the realization that so much in my life has changed and the people in my life really have no idea how difficult this is - and some days like today, I just feel so mad at everyone for having their life of distractions when no matter how hard I try, I just can't be/nor do I want to be distracted by the things that used to be important to me. I feel like I am in the middle of this huge life change and I am doing it all alone - kinda scary. I realize I'm probably being a bit melodramatic and should probably go get some sleep. Goodnight ladies.",
      "MessageIndex": 184,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 15, 2010 06:50PM - edited Aug 20, 2013 03:24AM by bailey1958 Sending you a big hug and healing thoughts Julie. This is a tough season and the end of a really horrible year for you. I agree - let's get it over with and move into a new year. Here's to a year of health and happiness - hang in there. I have to agree with you - lately I've been thinking I would feel so much relief if both my breasts were gone. I think that isn't probably the case though - I wonder if we would worry anyway. It seems to be the nature of the beast.",
      "MessageIndex": 889,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 16, 2010 09:03PM - edited Aug 20, 2013 03:25AM by bailey1958 Hi You Guys, Just got back from my staff Christmas party - I ate cheese cake, strawberries dipped in chocolate and cheese - I KNOW!!! - do I have a death wish - seriously - I didn't eat any regular food - no vegetables, no healthy vegan options - actually didn't even look for anything healthy - just headed for the deserts. It was awesome!    No news on the MRI Karen - I don't expect anything until next week - I have been really busy and I am reading the picking up the pieces book - section on fear has helped - trying to stay in the present. One of my colleagues just had an oral tongue cancer relapse and it has spread to her lymph nodes - she came to speak to me tonight - someone walked by and asked her how she was doing - she said \"I'm fine, I think that's what I'm supposed to say right, wouldn't want anyone to be uncomfortable\" I just wanted to wrap my arms around her and hug her so much. She just reeks anger - I told her when she asked how I was managing that the only people who I really talk to is you guys cause it seems like no one really understands the daily coping required. She asked if I thought I would ever stop worrying and I said I didn't think so.  I'm sorry to hear about your having to deal with truncal LE Kim and Donna. I am noticng swelling in my breast - I am more focused lately on feeling for lumps and wonder if I just noticed because of that or if the swelling has just come up lately - but here I go again. Going to stop now - I'm ok right now - that's all I am going to focus on.  Why look for more trouble. Inconclusive results - Embracing uncertainty - NO KIDDING!!!!!! Later ladies.",
      "MessageIndex": 893,
      "PostDate": "16/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 2, 2011 02:14PM - edited Jan 2, 2011 02:15PM by bailey1958 I am flooding with emotion - I think I am completely irrational - but then I read your post Kim and think \"this is normal\". I've been feeling so mad - it's like once I iopen the door for it to come out I have a hard time closing it again - I think my DH thinks I'm completely insane. Maybe I am.",
      "MessageIndex": 960,
      "PostDate": "02/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 7, 2010 10:55PM - edited Aug 7, 2010 11:04PM by bailey1958 Hey Ladies, Been having a restful rainy Saturday - watched movies, read and rested. My day was good for the soul - hope you all had a nice day too! I appreciated hearing from some of you on your experiences with the Doctors you've had treating you through your healing process . My sense is many doctors are very specialized in their areas of expertise and many just don't have the time, the resources, nor perhaps even the inclination or interest in learning more about alternative ways to approach healing from cancer.   Certainly I would think a holistic approach to recovery, including immune system boosting, recovering from the standard treatments for cancer - surgery, radiation and chemo and including the next five year journey of hormones many of us are going to be on, would be a part of their plan for us. It seems that the standard treatments for cancer kick the shit out of everyone and I think it's really important to develop a plan to continue the process of recovery. It is stunning to me that many Doctor's just don't have up to date knowledge about many alternative treatments including but certainly not limited to nutrition, exercise, supplements, meditation, associated deficiencies or imbalances etc. I have been so inspired by the many women on these boards who are so well read about cancer recovery and have used research to make decisions going forward in their lives. Whether the doctor's I meet are able to answer my questions about alternative ways to support myself health wise or not, I thank goodness there are so many women on here who have provided me with a ton of knowledge, resources and ideas about how to go forward in a way that allows me to at the very least feel like I have something positive I can focus on. I feel like the only way I am going to be able to move forward in my life in a \"normal\" way is to at the very least, feel like I am doing as much as possible to get well and STAY WELL. I think the most difficult thing for me to overcome is this belief that the medical model of health is the best one. Although I am really grateful that the treatments I've had are available to me, based on what I am reading, there are a lot of alternative things I can do to get healthy and stay healthy so I can support my body to keep cancer away. I know there are many women who have re-ocurances and if I have to prepare to deal with that on my journey than I want to be as healthy as I can so I am able to deal with what might be a chronic illness for me - God forbid - knock on wood!!. One thing is for sure 13 treatments of radiation down - I don't plan on cancer being my life story. I am going to do whatever makes sense and is manageable to make sure this stupid illness never comes back! Stay strong cyber friends - we can get through this! Thanks once again for all the support this past week - it was a tough one and I am anticipating more tough days ahead. Sonia ",
      "MessageIndex": 235,
      "PostDate": "07/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 3, 2011 02:14PM bailey1958 wrote: tracye and Julie - I hope you're hanging in there. Thinking of you two, sending positive thoughts your way. Brenda, Kim, and Karen - I am so with you on all you're saying. It feels like my \"me\" is buried so deeply inside me - sometimes I wonder if I'll ever get me back again. I think I go between highly disassociated or irrational/obsessed. Can't seem to find much of an in between.   ",
      "MessageIndex": 966,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 9, 2010 09:12PM bailey1958 wrote: Hi All, Hope everyone had a decent day. You're a day ahead of me Eileen - I will finish on Wednesday and cannot wait!!   Think the radiation is responsible for the tiredness and fog lovecranes - hang in there. I just booked a holiday for a week after I finish rads. Hope I will be awake for the trip. Good day tomorrow everyone!",
      "MessageIndex": 250,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 8, 2011 10:30AM - edited Jan 8, 2011 10:31AM by bailey1958 Neurosis - I don't think anyone on these boards experiences neurosis - I mean seriously what ever would we have to feel neurotic about? In all seriousness, I felt about five minutes of relief after the MRI and now I feel as though the serial killer is just waiting in the wings again. I had a long session with my counsellor yesterday and was telling her yet again about my mood swings and she was really reassuring - she works with breast cancer survivors (I hate that word) and says all the women including those of us who have not had chemo but been through treatment and are now on tamoxifen/AI's describe similar feelings, fogginess, tiredness, and in fact a woman who was finished her tamoxifen for five months was in her office and described feeling like herself for the first time in five years. I have to say, although I was horrified I could actually feel this way for five years - I was relieved there may be a light at the end of the tunnel. I hope you are all having a great first week of the new year. ",
      "MessageIndex": 983,
      "PostDate": "08/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 11, 2010 09:44PM bailey1958 wrote: I just read your post KIm - I am sending you a gigantic hug. I know I am in and out of those exact feelings that you are having tonight - I try to remind myself that I don't have cancer anymore and nor do you - it is gone, cut out and has been radiated to death. You DO NOT HAVE BREAST CANCER ANYMORE. Don't own it - it is in a petrie dish or under glass slides in someones lab - but not in your body and won't be ever again. This is a very tough life circumstance - but right now all of us are stepping up and doing everything we have to to get well. All the people in our lives are watching us and one day when someone you love and/or one of your kids need an example of how to deal with a very tough life circumstance - they are going to go into the filing cabinet in their minds and in it is going to be a file that you put in there on how to overcome difficult life circumstances with strength, courage and grace. You are not alone - it's ok to feel sad - this is really hard.  I think we should totally start a thread or join one to go through this process together. I realize I process way too much when I write and probably am already driving people crazy with all my thoughts but this tamoxifen thing is making me feel nutty and I haven't even started yet. I have been trying to convince myself that I can handle the next five years of tamoxifen and I will handle the SE's just like I have managed the \"idea\" of radiation being aimed at my body 21 times while everyone else waits outside the room in their safe zone. I am presently directing my anger, frustration and sadness toward all Doctor's who say things like \"you need to relax\" (about tamoxifen) and who ask to see the underside of my breast when my breast isn't being radiated for the second time in two weeks (my radiation oncologist is away and the doc covering is so patronizing he makes me want to spit). UGGGGGG I actually think I scared him today when I refused to allow him to look at my breast and requested a referral to a medical oncologist because I was unhappy with the fact I have only seen my radiation oncologist once and said that I needed to speak to someone who could answer my questions given he couldn't and that I needed to have a relationship with the people who were going to be included on my support team.. I must say - I am actually enjoying my anger today.  Hang in there \"women in arms\" we will overcome. (god I'm long winded!)",
      "MessageIndex": 264,
      "PostDate": "11/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 14, 2011 09:05PM - edited Jan 14, 2011 09:11PM by bailey1958 Brenda, When I went looking for the book info on author Mark Nepo who wrote the book I asked about, I found this poem on his website that he had written in a book of poetry about surviving cancer. Wow. Felt like he was in my head.   Thoracic Surgery It was like jumping with full consent into an empty well so deep I only remember falling in the dark till falling without direction put me to sleep. Then I woke broken and battered with no memory of impact. Ever since, it’s been Impossible to let go and I tire and ache. When I do sleep, I wake with this shoulder burning or that flank of muscle bound or the veter- brae in my neck locked. Afraid to let go. Never knowing how or if I’ll wake. And true, the trauma and pain echo smaller and smaller. But I’ve had to redefine normal like putting grit in paint. For to breathe is sore; to inhale, in-sore; to exhale, out-sore; to dream, bright and sore. And now after 12 injections of morphine and 180 capsules of codeine, I fear the unanesthetized days. Now I’m told a side effect is depression—the heart grown sore. Now I must strip the medicine like clothes. The depression, like a zippered cloud around my head. Must nakedly with full consent jump back into the world. Everyone’s saying— C’mon. Let’s go. But I entered this and nothing’s been the same. How can I jump on out and not fear the world is a broken cage?",
      "MessageIndex": 1005,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 24, 2011 05:42PM bailey1958 wrote: Hi All, Tracye your ankle sounds like arthritis to me. I would think cancer would stay static whereas the more you walk during the day, the more arthritis swells. I am deeply paranoid about my back and rib cage right now - I have this very strange sensation that is likely muscular but it's all I think about in the middle of the night when I should be sleeping. The fears are so hard to deal with - I can sure understand why you feel worried. Brenda I bought the Mark Nepo book and I'm finding many of his metaphors helpful. Just got started and I'm trying to catch up to do a reading for each day so I can sit with some of his thoughts. Karen, your news makes me feel like I should go get checked. My eyes feel a little blurry quite regularly - I've been thinking I need to get a check up.. I hope it's nothing for you and certainly hope it's just normal aging for me too!! Good luck with your exchange Chicago. I've been thinking lots about reoccurance - oh wait what's new with that.??? I feel like it's chronic right now. Maybe because I have a bunch of doctor's appointments this month.  It just never seems to end. Hope you guys are getting through this better than me - I am so SICK of my thoughts. Maybe I'll go shopping for new sheets too Brenda - at least I'll feel good when I lay awake and worrying!!! ",
      "MessageIndex": 1029,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 18, 2010 06:34PM bailey1958 wrote: Oh Kim and Julie - I really feel for you. Kim - your lorazepam is Ativan - take it tonight - try it out - seriously even if you take it a few times over the next couple weeks or so you will be fine - addiction can happen but not if you are taking it very irregularly and very short term. The sleeping pill I take - I cut in half and when I take it the following couple of days after i also sleep really well. My sister who is a sleeping pill expert (30 years of insomnia) agrees that this also happens for some reason - ask your doctor for one of the new ones that doesn't leave you drowsy in the morning. When I take a half I swear I sleep 6 or 7 hours uninterrupted which is very unusual for me even in the best times. There is a possibility of rebound insomnia when you start using them regularly and once you stop you can have difficulty sleeping - but again as long as it is just short term and irregular I have a sense you'll escape being an addict. I realize I must sound like a pill pusher - I am actually very anti pill but I feel like this is a really difficult time and if there is a time to do it - certainly cancer/radiation qualifies -especially given how uncomfortable our bodies are right now.  Sonia ",
      "MessageIndex": 330,
      "PostDate": "18/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 30, 2011 05:30PM bailey1958 wrote: Hardly pathological - but if so add me to that list. Not going to lie - shopping feels good.",
      "MessageIndex": 1065,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 19, 2010 12:00PM - edited Aug 19, 2010 12:00PM by bailey1958 So glad you're done Eileen and waltersren. Start the healing process for yourselves. How are the rest of you? - hope things are going smoothly. I have a sense given I've had a sore throat all the way through that by extension a cough could come from that - no?? Glad you got some sleep Julie. It was so nice to stay home this morning with no where to go, just back and forth to the coffee maker.  Super itchy skin today - even more than yesterday.   Thanks for joining us Susan, I have joined the August thread for Tamoxifen. Took my first last night - I think it was ok - maybe slight lightheadedness. Sonia ",
      "MessageIndex": 338,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 23, 2010 05:18PM bailey1958 wrote: Hi Ladies, I am five days out of treatment. Kim, I am sad to say even with hydrocortisone cream I am more itchy today than I have been throughout the treatment. The effects continue to worsen for me - my skin is darker, each day and though the sores have stopped forming they are certainly very itchy. I am also as of yesterday starting to have really sharp pains from my collarbone all the way into my breast no arm pain though Julie - probably because I wasn't radiated in my arm pit. Yuck - sorry to bare bad news - maybe others who are done have had better luck.  Sonia ",
      "MessageIndex": 375,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 3, 2011 08:07PM bailey1958 wrote: I'm totally in for facebook but would prefer to keep it a private group - definately don't want to mix my public page with breast cancer recovery stuff.  Kim, my conversation with the onc today really helped me - she and my family doctor slapped me up side the head emotionally. Told me to stop making space for cancer in my head. I said I wanted to have an endometrial  ulrasound and she looked at me with a stunned face and said \"WHY? I said to get a baseline and she said - if you have spotting I will send you for one and the baseline will not be useful at that point - besides I have never had a patient who has developed this type of cancer - (she is in her late 40\"s). ",
      "MessageIndex": 1092,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 4, 2011 03:29PM bailey1958 wrote: I think you should Amanda - it won't be the same without you.",
      "MessageIndex": 1098,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 27, 2010 07:08PM bailey1958 wrote: Hi Everyone,  Nice to hear you're all getting through. I had a full day out today and didn't reapply till tonight and actually can say i wasn't really itchy - YAY!! Things are getting better but my skin is still really dark. Linda, I feel sad that your girls are both away for school and you are feeling so bad. I know how you feel - mine travel for their work and couldn't spend a lot of time with me through this - they both have been feeling really bad - my sense is your daughters were probably really glad they could be there to support you all summer.  It will be thanks-giving before you know it and you also have the rest of forever to spend some fun and quality time with them, Karen, I also had David Cassidy - in fact loved him too. I have read the anti cancer book - really liked it and found it very helpful. Have you read Crazy Sexy Cancer Tips? It is written by a very inspiring much younger woman than me but it is a delightful, laugh out loud at spots, very good book. Lighter somehow but just as good. I also have read some others i would recommend if you are interested in others. Here's my story of the day:  I was out trying on some new clothes for the start of the school year (work in a school) and the sales clerk was adjusting my top as i came out of the change room and saw my scar and radiation sunburn - she looked horrified and said \"did you just have surgery?\" followed immediately with \"do you have breast cancer - my husband is a radiation oncologist.\" I felt horrified and said \"yes actually\" - she looked overwhelmed and I said \" I am a bit uncomfortable with a lower cut top - kinda feeling like I want to cover up my scar until it heals\" and her response to me was \"I think you have more serious things to worry about than that\" I actually didn't know how to respond in the moment (radiation brain) and left the store even though I really liked two things but couldn't pull myself together to buy them. Sometimes people are just so helpful at helping contribute to those crazy scary worries I can think of on my own without any help from them. My DH who was waiting for me was horrified.  Hang in there dear cyber friends, Hugs to you all, Sonia ",
      "MessageIndex": 409,
      "PostDate": "27/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 9, 2011 12:06PM bailey1958 wrote: Patty, I just sent you a private message with my information so you can search for me on facebook and join the group. Sonia",
      "MessageIndex": 1121,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 15, 2011 05:54PM bailey1958 wrote: Hey Guys, If you set up an email address with gmail or yahoo and then sign up to facebook with that email address you can keep your personal life separate and then join us!!! I feel bad leaving anyone behind. I really wish we could make this happen. I am truly finding myself ruminating so much less now that I rarely come here and read. ",
      "MessageIndex": 1130,
      "PostDate": "15/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 29, 2010 05:42PM bailey1958 wrote: Hey Everyone, I was away this weekend to visit with my kids - it was so nice to have something else to focus on besides me and cancer. I feel like where ever I go I meet someone who has had cancer and has recovered, moved on and has years behind them. It makes me feel better and then the fear of re-occurence and mets enter my brain just like what you said in your post Spendy.  I am hoping that when I return to work, I will think less about that. That said, it pretty much is always somewhere close by, haunting me like a ghost. Glad to hear everyone is nearly done! Very little itching left but still quite dark and now white in spots - looks like a bad case of pigmentosis or whatever it's called when you have some areas of your skin that doesn't have pigment. Spendy, there is a September thread for \"t\" that Kim has started. Just three of us on it so far. Hope we can all be in one place. Have a good sleep tonight and best wishes for the week ahead. Sonia ",
      "MessageIndex": 418,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 13, 2010 06:25PM bailey1958 wrote: Happy Birthday Julie!!! It is definitely a week to celebrate for you.   It's so nice to know that everyone is done - as of tomorrow. I will miss you all and your posts. My skin is almost done with the peeling and looks almost normal - though I do feel intense itching at times - especially at night. I am quite nervous that now we are all done you will all disappear into different threads and i won't be able to find you. I feel scared to be alone with my worries and it is a comfort to put them out here and have people respond. It's so weird that it's all over and you have to just go back to living. I guess I'll get back to NORMAL sooner or later.  Brenda - diamond earrings - yay!!! Good for you.  I wish you lived near me Kim, boy would it be nice to have any/all of you around - but that said Vancouver is a bit of a ways away from your corner of the USA. Take care all, Sonia ",
      "MessageIndex": 515,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 14, 2010 07:06PM - edited Sep 14, 2010 07:07PM by bailey1958 Finally finished writing my long winded response and by then a number of you had already posted responses. Really feel Normal when I read what you've written. I feel like so many of you say what I feel. Oh Karen, what you said about looking at stage IV threads to see where people started out - that's me!!! I can actually work myself into a crazy place if I let myself go - I also look to see what kind of cancer and compare myself that way to. It's so awful what we do to ourselves. ",
      "MessageIndex": 534,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 17, 2010 11:18PM bailey1958 wrote: Hi Everyone, Off to bed and then away for the weekend. Thanks for all your support the last few days. My leg seems to be about the same - chalking it up to SE's from the tamoxifen. Have a restful weekend - I'll miss checking in with you over the next two day but am I ever glad to know you will all be here when I get back. Good sleeps, worry free days, rest and healing to you all. Sonia ",
      "MessageIndex": 554,
      "PostDate": "17/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 23, 2010 11:45PM - edited Aug 20, 2013 02:48AM by bailey1958 I just wrote paragraphs of comments to each of you, an update and review of my weekend. It has just disappeared. Not frustrated at all. It may have happened because in it I threatened to terminate my father by suffocation while he sleeps (he is here visiting me) and as a result my karmic penance is to have to start over. My 87 year old dad is perhaps the orneriest, healthiest and grumpiest human being on earth and he just spent the evening revelling in how he drank(alcoholic) his whole life, over ate, smoked three pack of cigarettes a day for years and somehow has managed to outlive everyone and now he has to be a pallbearer at everyone's funeral. If I don't suffocate him by Monday I may very well loose my mind.  My weekend was awesome, my daughter's are both lovely, generous, sweet and funny. They entertained and cared for me all weekend and I was able to forget cancer - though of late I feel like I am in some kind of fog. It's the strangest feeling - it feels a bit surreal almost like I'm floating through my life - I feel disconnected, almost like I am outside my body watching me live. I am really sorry for all of you and all you are going through right now and what you have gone through to find yourself here on the cancer path with me. I wish this hadn't happened to any of us. On days like today I wonder if I will die and my dad will out live me too. I wish I could leave this all behind and go back to the life I used to have. It's strange how joy is different now. Everything is different now and I feel as though the before Sonia is AWOL and all that's left is this weird feelingless Sonia. I don't feel like much of a survivor - certainly don't feel like I'm cured - mostly I just feel numb - both inside and ironically out. I am accident prone, forgetful and feel as though I've become my children's kid they have to feel sorry for, take care of and worry about. I will try for more positivity tomorrow. S",
      "MessageIndex": 588,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 7, 2010 06:36PM bailey1958 wrote: Hi Ladies, I had my follow-up today and when sharing some of my side effects I told my Doctor I was getting big bruises and she seem concerned and said that I needed to have my platelets tested and it sounds like it's the liver test like what you had Kim. She says if I am too low she will have to take me off of tamoxifen because it is one of the negative side effects of Tamoxifen. Then I will need to have my ovaries shut down with injections because my body is still producing too much estrogen for the post menopausal aromatase inhibitors to be effective for me. Once that is done my ovaries would no longer be producing estrogen. I'm not quite sure what to feel about this. The good news is that the side effects for the AI's are heart and bone issues rather than more cancer and blood clots you can get from tamoxifen. Oh will the fun ever end? I've feel like I've finally accepted my fate with tamoxifen so I'm not sure what to think. I guess it is what it is and whatever is decided I just need to accept. Not liking this - just saying! Glad to hear all is well for you Julie. Hope you are all hanging in there.  Sonia ",
      "MessageIndex": 676,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 22, 2010 03:48PM bailey1958 wrote: My thoughts and prayers are with you Julie. ",
      "MessageIndex": 732,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Nov 5, 2010 07:09PM bailey1958 wrote: Yes Karen - that was the one. Scared the bejeezus out of me. Been feeling around for days looking for lumps - kinda feel crazy. I have been formulating a plan about changing my life. Thinking about starting a private practice and working in a more part time way as a counsellor rather than 6:00 am mornings - crazy days at school and not finishing until 5:30. I really find that things that would have upset me at work or would have motivated me to keep up a frenetic pace are no longer able to. Nothing can keep me awake at night anymore - ha!! I love that part - just not caring about work as much. Something happened right after my diagnosis in may at work and came back to haunt me in September. I actually said to the headmistress of our school that my give a shit was broken while we stood discussing it on the way into work (it was early and I hadn't put my work face on yet - actually may be a side effect of tamoxifen) and she looked so stunned that I would say such a thing that by the time she recovered I was in my office. She suggested to my immediate supervisor I may want to adjust my attitude. I told her my attitude had already been adjusted - by cancer.  I really no longer care about work the way I used to that is a for sure.",
      "MessageIndex": 765,
      "PostDate": "05/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Nov 8, 2010 09:12PM - edited Aug 20, 2013 03:08AM by bailey1958 Karen, do you get a sense they will prescribe the metformin in addition to the hormone therapy? I am starting to hate the way I feel with tamoxifen. I have been having a lot of aches and pains - joints aching, muscle aches, loosing hair, tons of hot flashes. Are any of you having these kinds of side effects? I swear the longer I'm on this gross drug the more seriously bad I feel. It makes me feel really old and achy. I've been considering talking to my Doctors about going off. I wonder what % of decreased risk I have given my stats.  Sometimes feel like my fear of endometrial cancer is growing. Wonder if I would be better off to have my ovaries shut down and not take anything. Feeling pretty miserable at times and when I read women are having re-occurances even with it - it makes me feel a little crazy. Wonder what I am doing to my body.",
      "MessageIndex": 770,
      "PostDate": "08/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Nov 12, 2010 01:54PM bailey1958 wrote: I am so sad to read about how hard things are for you Julie. I realize when I read your posts how fortunate I am right now - to be only dealing with one challenging event. I can't imagine how difficult it must be for you to loose your sister, your mom and have cancer in one year - I'm glad Jim is there taking care of you. I remember trying to get through my mom's things right away after she died and to be perfectly honest - I wish I could have given myself permission to do it when I was more ready and not in the throws of grief. I think we may have done things differently but my dad wanted her things gone immediately. Take your time with these things Julie, time allows you to process things differently. Chicago - you have every right to have a meltdown - your are trying to deal with a complete transformation that has happened to your body and your husband is so likely unable to understand how profound this is to you that his response to it is to minimize this because he has no idea how to help. I don't think men's brains are capable of understanding how much women are impacted by the loss of their breasts, and their hair. I think breasts and hair are so attached to our feelings about ourselves, the media and our culture put such an emphasis on them and so to have to deal with this complete change in who we are takes time. I have had so many meltdowns in the past months - although I'm sorry you are feeling bad I am grateful you shared because it certainly helps me to realize I'm not the only one struggling with the changes in my body/aging in my case and feeling old and achy. I think until something happens like this to men - loose the symbols of their maleness - oh wait isn't that why they have mid life crisis' and buy fancy cars and have affairs??? they can't really understand. My guy has been great but he doesn't always get it - I'm mean he wears the same version of the same t'shirt everyday - just a different color.",
      "MessageIndex": 793,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 17, 2010 06:03PM bailey1958 wrote: Oh Tracye - that makes me so sad for you. Lemon Drop wasn't just a bird - she was obviously a part of your family. I am so sad for you - 19 years is a long time. I had to put my favorite cat to sleep a year after my mom died. I was brutally sad for a long time - seriously don't under estimate the loss of your bird. A loss is a loss. Enough already I say - time to get some good news - anyone??????? Hugs to you and take care of yourself - at least your getting some of those feelings out that I know have been building up in me so I imagine we are all the same. ",
      "MessageIndex": 897,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 20, 2010 09:43AM bailey1958 wrote: Good Morning All, Well it seems the Christmas Season is upon us. I am getting ready to leave for a few days and really looking forward to the change in venue. I haven't heard anything about my MRI as of today but I am in cue for a diagnostic mammgram and ultrasound anyway - so it won't be over for a few weeks. Trying to get used to this uncertainty. I read the Stage three thread of women who are checking in with NED after five years. It was very inspirational. I am trying really hard to use the suggestions in the book I'm reading so all in all hanging in there. I am trying real hard to think like you Julie - lucky it was early. I have to say though - I wonder if no matter what you have had done Chicoago, you think you should have done something different - just to be sure. I was thinking about that reading the stage three thread \"well if only I had got chemo - then maybe I wouldn't be so worried\". When I saw the on call Dr. to get referred for the mammo she said during the course of our conversation \"tamoxifen is your chemo\" - I think it is making me resolved to stick with it.   Brenda - do it! You have completed the most challenging thing of your life and I think you deserve the time off to recover and discover - maybe that's what we all need - I really am trying to figure out who this new person is that is inhabiting my body.   Karen - I think Tai Chi sounds great - my mother in law does it and dance classes (she's 76) loves them both. I think I am going to try mindfulness meditation after the break - I wonder if I should go to boxing classes instead - maybe rouse my fighter.  Kim, I spoke to my Dr about the risk for endometrial cancer and she said she would send me for a baseline endometrial ultrasound that measures the lining so if there are changes that fall out side of normal ranges they can then check. Have any of you had one of those? Chicago - I interested in hearing about what you decide about shutting down your ovaries - are you on tamoxifen as well? Would you then do both? Well off to do some baking.  I have definitely not been sweating the food thing right now - I am so well behaved all the time it feels really ok to eat a little outside the box. Hope you are all keeping warm. ",
      "MessageIndex": 912,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 21, 2010 02:58PM - edited Aug 20, 2013 03:27AM by bailey1958 Hi Everyone, No call today from the Doctor this morning, so I walked into the records department at the BC Cancer Centre this afternoon and requested a copy of my MRI. Decided I needed to know - no matter what the result was. They had me sign a release of information and handed it over. My relief is immense - no radiological evidence of malignancy identified, no enhancing lesions in either breast and no evidence of lymphadenopathy in all regions (I think that means my lymph nodes are all normal looking. YAY!!!!!  Thank-you for all your love and support. I am going to eat sugar to celebrate. I am off to Palm Springs tomorrow - so I am wishing you all a restful and love filled Holiday. I know we have all been through so much and for today and the next week I am vowing no cancer rumination. I hope all of you can do that too! You have been my life savers this year and I know you will always be a part of my support team - I am so grateful for all of you - please take care and may all your Christmas wishes come true. Sonia ",
      "MessageIndex": 916,
      "PostDate": "21/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 30, 2010 03:50PM - edited Dec 30, 2010 03:50PM by bailey1958 Hang in there, Tracye and Julie - I am sending good thoughts your way. I am setting my sights on a great year for all of us and it is just around the corner. So glad you had a great trip with your son, Donna - your certainly deserve the much needed rest and having fun is just the medicine we all need. To all my new sister's in arms - I hope your New Year is full of laughter, good health and an abundance of joy - AND NO MORE BAD!!!  ",
      "MessageIndex": 947,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 6, 2011 10:02AM bailey1958 wrote: Tracye and Julie - glad to hear your results were good. It seems we have started the \"getting on with it phase\" - sure is easier said than done when the next round of tests always seem to be looming in the horizon. I've been trying to avoid feeling my lumps - seems anytime I do I find something. Worrying about the aches and pains in my body seems to be my main priority - trying to keep it simple and just worry about metastisis instead of more breast cancer.  ",
      "MessageIndex": 975,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 13, 2011 10:41PM - edited Jan 13, 2011 10:46PM by bailey1958 Brenda, can you post the name of that book - I really like the concept of the door too. Was the book worthwhile?  Chicago - I had an MRI before surgery - there was an area that lit up and required a f/u ultrasound where they couldn't find anything suspicious. I believe it was the radiation oncologist who decided to order the MRI for my six month check-up and it was booked right after the ultrasound I had in July - I wonder if it was because my concerns about my tumor were ignored for two years and then there was this false positive that required the f/u ultrasound and she may have sent me just to be thorough and close the door on any further concerns. I will ask when I see her in February if it is protocol at the BC Cancer Centre to do a f/u MRI at 6 months. I feel really frustrated for those of you who would like to have one and are being put off. When my surgeon went over the result with me - she said I should feel relieved but she also feels the mammo and ultrasound are important to get as well though.  They all see something different is what she said. I am not sure if I will ever let anyone biopsy me again. I agree with you Donna about active recovery versus this emotional rollercoaster we are on. Sometimes I feel just downright crazy - I think I was a lot more focused when I was in active treatment. I also feel like tamoxifen is turning me into a shriveled old woman - shriveled up/parched batwings, muffin tops and butt - it's just not very pretty is it?  ",
      "MessageIndex": 1001,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 17, 2011 09:20PM - edited Jan 17, 2011 09:21PM by bailey1958 I have a lot of trouble with decisions too Brenda.  I feel much less decisive and unable to think quickly, no ability to multi-task and find it hard even to focus on one thing well, problems making decisons in all areas and this includes driving, my focus is off, it's like I don't hear well, feel more needy, want others to do things I would have done before without a thought, hesitant, nervous, uncertain, afraid I'll make a mistake and let someone down, can't concentrate like I used to on something, feel like I am in a tunnel, or under water a lot of the time and sound is coming from a far away place. Less committed, less connection. I wasn't ever a fan of Michael Douglas and now I feel obsessed with anyone who has had cancer including him - insisted we watch entertainment tonight this evening so I could see him on the Golden Globes. He got a standing O and I started to cry. I feel like I am living in slow motion and everyone else has sped up. ",
      "MessageIndex": 1011,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 18, 2011 06:28PM bailey1958 wrote: You are completing accurate with the freezing response Brenda. I am a therapist and use an approach called sensorimotor psychotherapy which is about working through the impact of trauma using the wisdom of the body in the process.  As far as I can tell cancer has been a trauma for me and the exact description of trying to run, turning and fighting and ultimately not being able to escape and freezing feels really accurate to me - not much can happen in the brain when your frozen. That would be me too!! Tracye and Karen - you go GIRLS!!!! Raincoats, cars - how about my new florintini and baker leather boots that were soooooo expensive I'm too embarassed to admit how much. You guys just made my day ;) ",
      "MessageIndex": 1017,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 31, 2011 09:09PM bailey1958 wrote: Dear Nil, I very seldom post, often feeling like I have very little to offer given how many beautiful, big-hearted women seem to say all the most wonderful and supportive things. Tonight reading your post - I feel heart broken for you - wondering if you have a mom and dad, friends, a life partner - anyone that is supporting you in person. I have two beautiful daughters your age and I just cannot imagine they would have to go through the fight of their lives without love and support.  You are in my thoughts and prayers and will be while you recieve your treatment - and I am certain like so many of the amazing women on this site you will get through this. I want you to know that you have touched me with your story and though you don't know any of us - tonight you are in my heart.",
      "MessageIndex": 26,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764173",
      "Title": "28 YR Old Is Looking For Support from You wwaterlilyy ibcmets"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 5, 2010 10:59PM - edited Jul 5, 2010 11:00PM by bailey1958 Hello July Women, I have been informed that I am in the cue to start my radiation - I am hoping this month - though I may end up in August. I am from Canada and it seems my treatment is different than those of you from the USA. I have been told I will have 16 treatments with 4 boosts to the tumor site - my tumor was very high on my chest wall where very little breast tissue exists and as a result my surgeon couldn't get a clear margin - so the boosts are to ensure this area gets \"cleaned up\".  I am feeling a bit nervous about not having a OncoType test but if I choose to pay or join a study I can get one. I am feeling a bit conflicted about what to do. Everything I read about my highly receptive ER+++ tumor suggests that the hormone therapy is the best course of action. Do any of you have any thoughts about that?",
      "MessageIndex": 40,
      "PostDate": "05/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 12, 2010 06:29PM bailey1958 wrote: Hi Everyone, Had my prep for my radiation today and it seems I may be starting on Monday. That said I had my follow-up ultrasound and it was a miserable experience. They cross referenced with my MRI and I felt pretty beat up when they were done with me. I was feeling pretty overwhelmed by the time I got to my prep as the ultrasound technician couldn't tell me anything. First thing I did was start to cry. I'm not sure who I was feeling more sorry for - me or the poor guys who were measuring me for my radiation treatments! Still feeling pretty upset - so worried that I have just gone through all of this and I am going to have to start over if there is more found. I feel pretty overwhelmed and vulnerable today - I think going to the cancer centre just really makes everything so real and scary. I sure hope my surgeon and radiation oncologist's lack of concern about the MRI are correct but that said I was also told my initial lump was nothing to worry about and it turned out to be cancer. I think I need someone to give me a slap to snap me out of this. Oh the waiting game - I just hate it.",
      "MessageIndex": 54,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 4, 2010 11:08AM - edited Aug 4, 2010 11:09AM by bailey1958 Hi Everyone, Having a slow morning, getting ready for #11 - which is the other side of half way for me. I am so glad you had such a wonderful healing trip to the mountains Brenda, I know that feeling of healing and connection when you are in the mountains, having grown up in the foothills of the Canadian Rockies. I agree with all you said and everyone else who have been so supportive over the last few days - this is a hard path and one that not everyone can see -especially because we are all trying so hard to not let this own our lives and also trying so hard to make it ok so our loved ones don't have to worry about us.  Donna, what are you doing today instead of going to radiation? I'm sure it will be really strange to just go back to regular life without an active event each day to fight cancer, but - I agree with what others have said - our recovery is about taking good care of ourselves, making changes in those things that may require changes in order to stay healthy. I know I have been focusing on really taking care of myself for the first time in my life, actually feeding my body in a healthy way, taking time to rest, letting people know when I can't do something and not feeling guilty - allowing myself to just slow down and be present - really appreciating what is good in my life. This journey really has been so life changing. I, in so many ways feel profoundly lucky. Today I am trying to refocus on remembering that recovery isn't a goal but a process.  Have a good day today everyone,    Sonia",
      "MessageIndex": 198,
      "PostDate": "04/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 10, 2010 05:35PM bailey1958 wrote: Oh Pat that procedure sounds like it was awful - I'm amazed you can have a sense of humor in the middle of all that. . Hope you're recovering nicely. Chicago - what kind of alternative treatments have you been offered as part of your integrative care. How many of you are moving on to hormone therapy? Do you have any thoughts or advice about using supplements or natural remedies to cope with the side effects - I am finding the hot flashes that are a part of me being in peri-menopause horrid - I just can't imagine them getting any worse then they are right now.  Take care everyone. Be good to yourselves.",
      "MessageIndex": 257,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 12, 2010 05:14PM bailey1958 wrote: i feel old and itchy.",
      "MessageIndex": 275,
      "PostDate": "12/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 19, 2010 06:42PM bailey1958 wrote: Hey ladies, Almost the weekend and break for you all. It seems Karen and I are on the August Tamoxifen thread already. I would like to stick together - so I will post where ever you all are. I am sticking around here till you're all done and if the consensus is to start our own thread that's ok with me. I would like to feel like I'm getting to know a core group because it's easy to get lost on here - there are so many of us.  Glad to hear you slept better Julie and KIm - wishing you another. ",
      "MessageIndex": 344,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 21, 2010 07:36PM bailey1958 wrote: Hi All, Hope everyone is resting and taking care. It has been three days since I finished - weird thing is my skin is getting darker and more itchy as the days go by - they really do mean it peaks 1 week after. Is anyone else having or have had the same type of experience? Serious stuff this radiation! Healing wishes, Sonia ",
      "MessageIndex": 358,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 20, 2010 04:43PM bailey1958 wrote: Hi to everyone, Had my first appointment today  - it was a bit long as my whole treatment was changed because the tumor I had removed was not in my breast and so they decided for obvious reasons there was no point radiating my breast but rather to focus on the chest wall around the tumor site. The area I had radiated today is already a different color - is that typical for everyone on the first day? It looks like I already have a little square tan. Curious if this is typical or different for me because the amount and type of radiation is different because they are doing it from a further distance as a result of how it is placed. Hope you all had a issue free day. Sonia",
      "MessageIndex": 86,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 20, 2010 08:53PM bailey1958 wrote: Hi Kim, My tumor was just on the edge of my breast tissue about two inches below my collarbone - 12 oclock and the anterior margin against the chest wall was not clear. They said they couldn't get a clear margin there because there was no more breast tissue left to take out. My radiation is now - as of today 21 treatments - 20 to go. They were going to do 16 with 4 boasts but now they will all be considered the same - no boasts. They said today that I will have a higher dosage because they had to pull the machine further back from my body in order to not have it running into my face - they also strapped this jelly pad to my chest \"to fool the machine into thinking there is more flesh there\" - didn't understand?? I think the area they are radiating is about 5X4. The actual radiation was 50 seconds but I was told that I wasn't getting standard xray radiation but another kind - can't remember right now what they called it but I will ask again tomorrow. Feel a bit weirded out by the fact my treatment is so different than everyone elses treatment. I also feel a little scared they aren't radiating my breast even though my breast wasn't anywhere near the tumor site.  ",
      "MessageIndex": 88,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 20, 2010 09:12PM bailey1958 wrote: Hi Patty, The adjustment post surgery, radiation etc. is a bit tough to take. Trying to adjust to my scar but today I met a 10 year old boy having radiation for brain cancer - he was a pretty cool kid - seemed to be taking things in stride - I have a feeling I will learn a lot in the next while - certainly felt grateful for my current situation and appreciative too. ",
      "MessageIndex": 90,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 28, 2010 08:35AM bailey1958 wrote: Hi Everyone, Sounds like everyone is doing as well as can be expected. I definitely felt really tired last night after treatment #6 - and still that way this morning. I do think I am starting to feel the effects though the weather is very warm and I think that is contributing to feeling a bit lethargic My skin hasn't discolored but it does feel a bit tight - much like after my surgery too Kim. Just want to say, this is a lot to manage - try not to be too hard on yourself about not doing mothering perfectly right now.  I'm really interested to hear about your mammosite radiation Michelle. It will be so great to have it done in a week. I think that is what is so daunting about this part of the treatment - it just seems to go on forever. Sounds like the run in August will be a bonding and supportive experience for you.  My sister is here and it is really nice to have the emotional support right now - I hope all of you are well and doing something nice for yourself everyday. Have a good day.  Sonia ",
      "MessageIndex": 147,
      "PostDate": "28/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 15, 2010 05:28PM bailey1958 wrote: I don't know Tracye - I have had a lot of new joint pain in my hands since starting tamoxifen but this leg aching is really new and I haven't checked the side effect list to see if body aches are a part of the side effects. I think the most difficult thing for me was emotionally - I just feel so done with being poked, ultrasounded, cut, medicated, radiated and I was just starting to feel normal and this just shot me back into feeling really sorry for myself - almost felt more upset today than I had since early diagnosis days.",
      "MessageIndex": 541,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 29, 2010 09:19AM bailey1958 wrote: Hi Gang, Having a nice visit with my sister. Feeling very tired in the evening and am waking up with a bit of a raspy voice and a titch of a throat irritation - is anyone else having that experience?. Skin looks like I'm tanning a 8X7 inch square - no irritation yet. Hope your day goes well.  Sonia ",
      "MessageIndex": 153,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 6, 2010 09:19PM - edited Aug 6, 2010 09:19PM by bailey1958  Thank-you to those of you post rads - it's really good to know what's coming. I find this is the best place for me to get information, Had a doctor check-in this week - my radiation oncologist is on holidays and the doctor covering for her wasn't able to answer any of my questions - after a series of questions about hormones and the research I've been doing to find answers about balancing my hormones he said \"you just need to be happy - that will give you the best chance\", I actually started to cry and he apologized for \"making me sad\". I was actually quite frustrated and felt a bit patronized - all in all he wasn't able to answer my questions. I sure will be glad when this part is over 13 down - 8 to go. Hope you all have a restful weekend - take good care of yourselves. Sonia    ",
      "MessageIndex": 225,
      "PostDate": "06/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 13, 2010 09:55AM bailey1958 wrote: Good Morning, Well I have officially hit the wall. I am soooooo tired - was in bed for 13 hours last night something I haven't done since I was a teenager (a long time ago). My skin is covered in heat rash - the good news is one more today and three more next week and I am done this part of the journey. Once again I want to say to those of you who have done chemo before radiation - you must be the most courageous and strong women because I just can't imagine what that must be like. I consider myself a very strong person - but I tell you this is kicking the crap out of me this week. I was told yesterday that the effects from radiation peak a week after finishing (oh joy, oh bliss). I considered telling them today that I want to quit. What difference does it make if I do three less - but I know I have to finish given I have come this far. I also have had a headache for a couple of days - I wonder if it is just the heat or if any of you are getting headaches? Thanks for the suggestions Julie about hot flashes. I personally live with a fan attached to the end of my bed. It slays me how your skin can feel cold and the inside of you is on fire. Hormones - too much cause cancer and yet to little of them to regulate my body - it just doesn't make sense to me. Have a good day everyone. Thinking of you all - helps me keep going. Sonia ",
      "MessageIndex": 281,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Nov 5, 2010 04:20PM - edited Aug 20, 2013 03:06AM by bailey1958 Well happy friday to you all. I haven't been poking around for the the last week and so haven't been up to posting - I'm just so tired and sleeping 12 hours every night and it just doesn't seem enough. I am feeling tired of things too. TIred of working so hard, tired of the endless chatter and meaningless stuff. I could go on but I won't. I am feeling much calmer about things in my life - that is  until I read a thread a few days ago about one of the women on this site who had a reoccurance after 4 years - pretty much my stats  and it has really freaked me out. I am having a terrible time with my thoughts again. I realize I shouldn't read things that I know will upset me but I find my empathy for everyone here over rides my common sense and sense of self-protection. I think when that happened this week it made me avoid the site for days. I feel like sometimes I am much better when I don't come here but then I miss you all and I want to know how everyone is doing and I feel like I can't stay away in case there is something you say that I might need to know. It's like I can't live with the information and can't live without it. I know when I just come to this thread I do really well but I obviously didn't stick to that rule this last time. I am finding so much comfort in what you say - about work, how family is treating you, what you're going through - it just is so helpful and so important to my healing. I am going to try to just connect here and on the tamoxifen thread - So glad to have caught up with you - read all your posts.My heart goes out to all of you. Sonia ",
      "MessageIndex": 763,
      "PostDate": "05/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 21, 2010 08:34PM bailey1958 wrote: Thanks for the information Donna. It helps to know I'm \"normal\". Gosh it's itchy though - makes me want to scratch and pick. You're bang on about the path of destruction - I guess that should make us all feel better - what could possibly survive under there. ",
      "MessageIndex": 360,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 29, 2010 07:35PM bailey1958 wrote: If you're still up Karen - here is a gigantic cancer free hug from one who has recovered to another! Sonia ",
      "MessageIndex": 421,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 9, 2010 04:39PM bailey1958 wrote: Congratulations Marilyn - I'm so glad you're done!!! Julie, I am really glad to hear your end date is next - it is so nice to move on from the daily regime. I've been back at work and although the thoughts creep in like the ones many of you are having - I've been able to focus on other things other than cancer this week thank-fully. I found out one of my colleagues just had a tongue tumor re-occurance today and I have to say that made me feel a bit of panic - cancer is scary - I just don't want it back ever. Spendy - I have quite a few tattoos and have decided that I am going to get one to commemorate this time in my life. I wanted to get it over the scar but I've read that you are to wait 5 years before you can do that - so I'm rethinking where I may get it. Hope you are all resting and healing. Sonia ",
      "MessageIndex": 495,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 9, 2010 10:32PM bailey1958 wrote: Thanks for all your encouragement everyone. I am trying to hang in there. Guess I don't really have a choice. Donna - I don't understand why they didn't check both sides. Is that because it's a follow-up? Here's my fear - it's like the never-ending follow-up to be followed-up by the follow-up to follow-up the follow-up. I realized driving today - when I potentially do my best ruminating that like many of you have said - suddenly I realize this is going to be my life and I can't believe this is actually my life. Have any of you heard about the tv series called \"the big C\" you guessed it ladies - a show about living with cancer. AHHHHH. Who will watch that - Cancer makes me sick to my stomach. Sonia ",
      "MessageIndex": 865,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 13, 2010 06:06PM bailey1958 wrote: Hey Everyone, Brenda - thanks for telling us about your appointment and preparing me for my results which will probably not be available for at least a week. - I am anticipating suspicious results from the MRI I had today.  My breast surgeon's office said I need to see my family doctor to get the referral for a diagnostic mamogram and ultrasound since it is time for my yearly screening and have a follow-up with her in January and they say both will be needed especially given the MRI probability of finding false positives. I will be looked at in every possible way - so I am just assuming something will come back with a similar result to all of your birads 3 which I haven't heard used in Canada.  I am really trying to let go of all my fears - if there is something to find then so be it - let them find it, so I can get on with getting rid of it. I thought while I was at it I mays as well do a pap and go to the dentist. My gums are receeding, my memory is shit - as I see it, I may have early onset alzheimers and won't have to worry about anything. Brenda - I've started \"Picking up the Pieces\" and I am actually going to try to get started with the daily reflection questions and mindfulness walking once I finish work on Thursday and then I can focus on picking up the pieces in my own life. I think it may be really helpful. I think it's easy to focus on the fear and worry but the questions really force you to see that you do have a lot of other things going on and not all negative. I've realized that I have been so focused on getting on with my life but in the initial reading I'm doing - I realize figuring out how I've been changed and then how I move forward as this new person I am going to discover and define may be a good focus for me. I also have started looking for a course in MIndfulness Meditation to start in the new year.  I am so sick of worrying. I am determined to enjoy the holidays. I so sorry I complain so much, blah, blah ,blah about myself - I would be sick of me if I wasn't me cause I am sick of me being me. I am really going to try and be less whiny. Thanks for reading this - it really does help me to get it onto the screen - you guys are my saving grace. Sonia ",
      "MessageIndex": 877,
      "PostDate": "13/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 15, 2010 05:03PM - edited Sep 15, 2010 05:05PM by bailey1958 Julie you have been a huge part of this circle of support  - and I am comforted by you and everyone else and again so very grateful to have this soft place to fall. Was assessed for a blood clot today - everything is clear but I am having serious aching in my leg - posted on the Tamoxifen thread about my day. Feeling pretty vulnerable today.",
      "MessageIndex": 539,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 14, 2010 06:48PM - edited Aug 20, 2013 03:24AM by bailey1958 Thank-god you guys are here. I know that feeling of surging anger - while having what seems like a concious voice deep inside saying \"good god what am I doing\" but not being able to stop yourself. I had one of those in the grocery store with my DH who stood patiently staring at me in horror while I freaked out and people were walking by with their carts of grocieries. I completely lost my mind and could not stop. It makes me laugh now to think about it.  I have found the book really kind of helpful - I think you guys might like it - it really does a good job of putting things into perspective - don't you think Brenda? Chicago I haven't had a period for three years - but my doc says my hormones were still in perimenopausal levels when tested. Given the night sweats and hot flashes it is hard to believe I have any hormones left. I'm really glad to hear your appointment went well - it nice to hear your results were good. You know Brenda, your so right about people just not realizing how hard this is. I really had no idea what a heavy thing it is to have this hanging around no matter how much we are encouraged to just get on with our lives.  Kim, I found the lobular cancer/tamoxifen article in one of the threads in the lobular cancer threads - I will go look for it and PM you with the link. Thanks for the encouragement Karen, I do feel entitled to be a bit whiney but it gets old really quick. I just wanted to comment about taking time off to go through this. My timing was impecable - I was finished school for the summer when I went through treatment. I just can't imagine how you have coped with working, treatments and recovery - Donna is right - take care of yourselves. This is a tough time of the year - everyone feels excited about holidays, are eating decadent meals/baking/chocolate constantly, it feels as though everyone is trouble free and there is a lot of pressure to feel good, lucky etc. I'm not going to lie - it's kind of a stretch right now for me to feel happy and that makes me feel guilty too. In the Picking up the pieces book there are quotes from lots of people of different ages and it is actually a relief to read other people's words. we have been through a tough year - I'm with you all - bring on 2011.",
      "MessageIndex": 886,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 16, 2010 06:53PM - edited Sep 17, 2010 09:18AM by bailey1958 Hi Everyone, My leg has been pretty sore today - I'm really feeling the wear and tear of the last few months on my brain and body this week that's for sure. I am relieved I don't have to deal with figuring out how to manage a blood clot curve ball - but I really am hoping this is the end of physical worries for me - now and forever.   Brenda people are just so clueless about this very difficult journey you've just been through. I can't believe they would be so insensitive to say that to you. You take good care of yourself - you've just been to hell and back and it takes time to heal. Work will always be there waiting for you. I really feel like such a different person -  I was reading the how cancer has changed you thread and still can't put into words just how different I feel but i feel like I am a totally different person than I was four months ago - who knew. I'm excited to get out of here Saturday and hug my kids. Sleep well everyone. Sonia ",
      "MessageIndex": 547,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Sep 30, 2010 10:46PM - edited Aug 20, 2013 02:51AM by bailey1958 Hi Everyone, Wow so much has happened this month to all of us. September has been a very challenging month for me. I discovered something about myself this week. Had a tough one at work with a situation that normally I would have ruminated about for weeks and let it make me feel really bad, lose sleep over and just generally beat myself up over. I started out having what would have been a typical response to a challenging situation and then I found myself in the middle of it and realized that I just didn't care about it and that my need to prove myself was gone. I have this sense of calmness and I've had this distinct realization how little importance something I would have thought before cancer was terribly important is now post cancer just not. I am stunned by people's insensitivity and disconnection from their lives - I feel like people just race aimlessly through life blind to the things that really matter. I feel like I have to reevaluate my work life. I also have realized how much more I want real, authentic connection with people and yet I am surrounded by people who aren't awake. Weird stuff going on for me. I don't work Friday so I am really grateful I have three days off to get a break from a mid-life post cancer crisis. Thanks to all of you for giving me a place to be real and a group of people who make me feel normal (sorry Julie).",
      "MessageIndex": 627,
      "PostDate": "30/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 5, 2010 09:54PM bailey1958 wrote: Hey Ladies, Just checking in to see if Donna and Tracye got their GOOD news today. I holding you both in my thoughts with all good things coming your way tomorrow if not today. I have a longing to have a dog  and reading all your dog posts make me jealous. I've been a cat person my whole life and have never had a dog. After cancer one of the things I initially thought I wanted to do was to get a new pet. But as time has passed there is a part of me that is starting to feel like I'm having a hard enough time taking care of myself not sure if I am up for caring for a dog. I feel like I am loosing my brain capacity. I've said it before but I really am noticing some processing challenges, can't remember words, disorganized, get kinda off balance, second guessing myself, feel a bit like I have turned into a senior citizen. I wonder if it's the tamoxifen? ",
      "MessageIndex": 657,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 6, 2010 08:49PM bailey1958 wrote: I am SOOOOOOOOO relieved for the two of you - Tracye and Donna. SEE no more bad - let the good news cycle keep on rolling. I know I am constantly stopping negative thoughts about every pain and symptom I have- I was thinking I should get a little shock collar to put around my ankle and every time I think a negative thought I could give myself a little jolt. Today was a weird day - people asking me if I have my health back??? WTF is that. Here is what I find so annoying - I was perfectly healthy and wasn't sick when I found the lump two years ago and when they finally decided to biopsy it I wasn't sick then either. I REFUSE to think of myself that way and when people say that to me I just want to lecture them - DO I LOOK SICK? My health is fine thank-you very much - I feel bitchy about this - it's weird I want sympathy but when they give it I don't like how they give it. I feel like I must seem so grumpy. I have my follow-up tomorrow with my radiation oncologist - if I could remember what I wanted to ask my doctor I would feel better about the possibility that it would be a worthwhile endeavor and not a waste of time. I guess the good news is that I still have time to remember. Maybe I will remember before my appointment.  Right - my memory - I need to ask why I suddenly can't remember anything, speak fluently without stuttering and constantly forget to put stuff in my calendar. Don't worry KIm it could be worse - at least you still know you're forgetful. NIghty night, Sonia ",
      "MessageIndex": 670,
      "PostDate": "06/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 24, 2011 09:32PM bailey1958 wrote: I don't talk about it to anyone except here and in counselling. I know when my kids or guy think I'm worried - they worry - so I keep it to myself.",
      "MessageIndex": 1032,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 25, 2011 07:23PM - edited Jan 25, 2011 07:24PM by bailey1958 Oh Trish so sorry to hear you are in a holding pattern waitning for results and feeling like a pin cushion. It just doesn't seem fair you have to start with tests and Doctors again - it's really a nightmare - hang in there. Don't forget that most findings are benign.  I am full of fear about having to deal with what you are dealing with - my thoughts are with you and I am sending you loads of good thoughts.  Tracye -  I totally understand why you don't want to go and think you shouldn't do anything you don't want to - hello - you have just been through at least two terrible traumas and now have to deal with a very sore ankle and all that will entail. You could say: 1) I am having an issue with my ankle and Doctors have recommended I not attend - period. 2)Personal reasons - no explanation. 3)I don't want to and you can't make me!!!!! I work in a school and have only told a few people. If you don't want to explain or inform your colleagues - you don't have to. Although people may stare at you like they do me when I pick the cheese off my pasta wondering if I have an eating disorder and although I want to shout I just had cancer and I'm trying to avoid reoocurrance by being psycotic about what I put in my body - I opt for them believing I have an eating disorder and not having to deal with all the questions, sad eyes etc. By the way - I was diagnosed with arthritis when I had my bone scan.  It is in both my wrists and I have to say I was relieved and happy when I heard the diagnosis!!! So sick but understandable given our situation. Chicago - anger sounds extremly healthy to me - it is terrible you've been through breast cancer and that you are staring your mortality in the face at age 32 when you should be living a carefree life. Be f$%^ing mad - it feels good and you've earned it!!!  ",
      "MessageIndex": 1039,
      "PostDate": "25/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 29, 2011 09:39PM bailey1958 wrote: I didn't have chemo either Trish. I realize you are preparing for the worse case scenerio - but I'm hoping for the best for you. This shopping spree we are all on is good for us - we deserve it!",
      "MessageIndex": 1058,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Oct 27, 2010 09:19PM - edited Aug 20, 2013 03:02AM by bailey1958 Hi Ladies, Hope you are all feeling well and taking good care of your lovely selves. Just want to say Chicago - I have been scared straight - I am officially vegan now and have been for a full week. Cream was the most difficult thing I had to give up but I feel so relieved that I am not putting any estrogen into my body deliberately, it feels like a relief to have finally given it up. I am finding the reading I am doing about meat and dairy repulsive - I can't believe it took me this long to really understand how much impact my food choices have on my body. Hope you are ok Donna. Sonia ",
      "MessageIndex": 751,
      "PostDate": "27/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Nov 9, 2010 06:38PM bailey1958 wrote:",
      "MessageIndex": 777,
      "PostDate": "09/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Nov 12, 2010 02:00PM bailey1958 wrote: Part II - weird post thing just happened to me???  What is wrong with pomegranates? Just when I think I have it figured out! I do eat flax everyday and soy in the form of tamari which I use in sauces. Patty I am sorry to read you have just lost your mom too. This has been such a tough year for so many. We deserve really good things from here on out - that's what I am going for. Have a good weekend everyone. Sonia ",
      "MessageIndex": 794,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 8, 2010 06:44PM bailey1958 wrote: Thanks guys, Pushing through - trying to keep it in perspective. I do see a counseelor Julie, though she is hard to get in to - too many clients with cancer so my next appointment is after the test - hopefully it will all be good and I will be relieved of this anxiety for the holidays. I know I am cared about and it helps to know you are here for me - I feel the love.",
      "MessageIndex": 863,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 17, 2010 04:41PM - edited Aug 20, 2013 03:25AM by bailey1958 Hey Kim, I was being lazy and instead of going up to get it, I looked on line and found the authors of the book have a website. It looks interesting.    http://www.pickingupthepiecescancer.com/",
      "MessageIndex": 895,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Dec 31, 2010 09:50PM bailey1958 wrote: Happy New Year East Coasters!!! This is our year - no more bad Tracye - keep those negative thoughts out of your head!!! Your almost through, hang in there. Happy 2011 everybody!! ",
      "MessageIndex": 952,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 1, 2011 08:39PM - edited Jan 2, 2011 11:07AM by bailey1958 Thanks for your post Brenda - my dreams have also been quite vivd and compelling of late. I feel like I've had a bit of a breakthrough this week - I think I am just realizing just how big what we've been through this year is and I think I am in some sort of transition right now - I think the ringing in of a New Year is going to be helpful. Told my guy that even though everyone else feels like I am great and fully recovered that isn't how I feel - I think he was shocked - he has in a way resumed his life too. It's funny how badly everyone wants us to be ok and that if you look back to normal then you must be back to normal. So glad I have people in my life who do really understand and don't need to be reminded or helped to understand how my life has changed - I am really trying to focus on moving forward from this but it really is so hard to do - to let go of the worry and just be awake to today with no thoughts to health, reoccurrance rates, treatment etc. and so it is comforting to know you guys are here and understand. We are getting through this - thanks to all of you for checking in and responding, for just being here - I am very grateful. Sonia ",
      "MessageIndex": 955,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 6, 2011 01:49PM bailey1958 wrote: Is there something wrong with asking strangers to feel your breasts for lumps?",
      "MessageIndex": 978,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 10, 2011 06:06PM - edited Jan 10, 2011 06:10PM by bailey1958 Julie - sounds like your baking day did wonders - wish you could send me a care package. Glad to hear your doc said things look good. I had my f/u with surgeon today - said \"MRI's are 99% accurate - some say 100%\". I asked if I could skip the mammo and ultrasound in February - she said no - so the end of Feb more docs, tests and f/u. It seems it will never end. I'm with you Karen - I told my surgeon I wished I would have had a double mastectomy and she said that I was crazy - there was no reason and I should be relieved given my MRI. I responded with it could come back and of course she couldn't argue with me.  No middle ground for me either. I'm glad to hear your memory is flawed Donna - makes me feel better about forgetting nearly everything. Tracye - I have not asked for a PET - don't think they would give me one and I'm not sure I would want one - too terrified about what they would find. I think I don't want to know if it's in me. I'm with you though on feeling accomplished after cleaning - I love the feeling of getting rid of things, cleaning things out etc. It's almost like if I'm not using it, I think what am I saving it for and this seems to be the impetus for getting rid of tons of stuff.    Hope all you wonderful women are taking good care of yourselves. ",
      "MessageIndex": 990,
      "PostDate": "10/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 12, 2011 09:03PM bailey1958 wrote: Very funny Karen - and very alarming. Like you Kim, I've heard the thing about biopsy's which I feel like I've had a hundred of - and don't really want to hear that they cause more problems than potentially the one we already are looking at. It makes me want to scream with frustration - one step forward one step back.   Sorry to hear about your mood swings Patty - join the club. Aren't we a fun bunch.  Sweet dreams everyone. ",
      "MessageIndex": 997,
      "PostDate": "12/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jan 17, 2011 08:18PM - edited Jan 17, 2011 08:19PM by bailey1958 Hey Everyone, Karen, my tumor was also near the chest wall but that is why I had the radiation which they said is how they \"clean up the area\". They said as a result my margin was not good because of its proximity to the chest wall and lack of tissue in that area. I, like you am try not to let it freak me out.  Never had an oncotype - whenever I hear all you USA people compare your scores I do feel like that was a missing piece which then makes me feel like I should have got chemo - oh will this worry ever go away. Definitely feel like I am a radically changed person after spending the weekend with an old friend I haven't see since cancer. I could feel the change in me so strongly - I was surprised. I can only imagine how different I must have seemed to her. The changes have become clearer and clearer to me - I feel like I am just really starting to see and feel the new me. I think the intensity of my connections to others has really diminished. Sometimes I feel pretty alone - even when surrounded by others. Weird.   ",
      "MessageIndex": 1009,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 3, 2011 06:56PM bailey1958 wrote: It's crazy - but I just love you guys. I just can't give you up even though it sometimes seems irrational that I haven't really seen you. I say yes to to the facebook group - how do we get started? ",
      "MessageIndex": 1087,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 3, 2011 02:43PM - edited Feb 3, 2011 02:44PM by bailey1958 Hi Everyone, I've been having my share of f/u appointments and have been given a strong message to get on with my llife - that breastcancer is in the past and I need to stop making space for it in my head. Easier said than done. I realize I spend time on this site -  multple times a day and I feel as though I am carrying not only the burden of my own fears but also at times the stories of all of the women I read about on this board. I was asked today if it might be time for me to let this place go and my doctors wondered if investing energy into breastcancer prevents me from doing that. How do you guys feel about this? The idea of not having you makes me feel scared. I wonder if there are others ways to connect? Sonia",
      "MessageIndex": 1079,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 4, 2011 10:34AM bailey1958 wrote: I have send a few PM's to those of you who seemed to be interested in possibly connecting through facebook. If any of you who are checking in are interested PM me and I will send you my contact info on facebook. I think we should form a little private group and then I know I am going to take this site off my places to go each day. I have decided just the notion of arriving at the breastcancer.org site holds me in this not moving forward place. I feel like this is worth a try and I am really hopeful we can continue to take our friendship group to new levels in a \"normal and healthy way\".",
      "MessageIndex": 1094,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 3, 2011 05:17PM bailey1958 wrote: I feel as though I can't move on without you all agreeing - I can't bare leaving you when we still need each other emotionally. Is there a way we could start a group together  off of this site? Like maybe a yahoo group where we can just check in with each other but where we aren't compelled to stay on after our daily check in and search/read other threads?",
      "MessageIndex": 1084,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Feb 7, 2011 05:29PM bailey1958 wrote: Hi Everyone. Trish please don't think you are bringing anyone down. I want to be able to support you and  to know if this happened to me - that you guys would be here for me. We would love to have you in the group - please know you are welcome. For those of you who want to join us on facebook - I have opened my privacy settings up so I am searchable and easy to find - let me know if you want to join and I will pm my information. ",
      "MessageIndex": 1112,
      "PostDate": "07/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 20, 2010 09:24PM bailey1958 wrote: Thank-you Lisa, Everything went well with radiation today - 1 down 20 to go. Hope you have a positive report tomorrow Kelsey. Let us know how you are. Hope the recovery from surgery has been easy.  Sonia ",
      "MessageIndex": 15,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754856",
      "Title": "Anxiously waiting Kelscs Kcscared"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 8, 2010 09:23PM - edited Jul 8, 2010 09:25PM by bailey1958 Hi Kelsey, I know the wait for tests and results is such a difficult thing - you of course never think about how the result could be positive - you only seem to focus on the worst. I am waiting for a follow up ultrasound on the breast MRI I had in June. I have been diagnosed with ILC and have had surgery and am going to start the preparation for radiation on Monday and feel like there is still this thing hanging over my head so I can totally relate. I want you to know that you, like so many women who post here will probably have a b9 result - but the waiting is so difficult, the idea of cancer so terrifying. I can't believe I am writing this but, I actually am pretty much back to feeling like myself again. I really have come through this dark place of being so scared, facing my worst fears to now really recognizing that I can recover from this and the most important attitude I can have is one of courage and strength and trying to be as positive as possible. Even though it sucks, it really does get more manageable. I wouldn't wish this on anyone and I know there are so many women on here that have things so much worse than I do/did. but I realize that if I can get through this, I can get through anything. Keep thinking b9 thoughts, visualize a healthy outcome, try to distract yourself, HANG IN THERE!!! I am keeping you in my thoughts. Sonia ",
      "MessageIndex": 4,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754856",
      "Title": "Anxiously waiting Kelscs Kcscared"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Jul 16, 2010 08:59PM bailey1958 wrote: Hey Kelsey, So glad to hear your doc is saying such positive things - thanks for asking about me - things are moving forward so I am greatful about that. I had a followup ultrasound because I had an area of concern that had to be checked after my breast MRI and it has come back clear - so yay that!!! I start radiation on Tuesday and I am anxious to get started but anxious about getting started - the idea of radiation scares me but I had a very oddly placed tumor far up on my chest wall and as a result the anterior margin was not clear so radiation is a must in my case. The doctors have changed the radiation plan for me as of yesterday because they were going to radiate my whole breast which didn't make sense because my tumor site is no where near my breast - so now they aren't going to radiate my breast but will focus the radiation on the tumor site. So I am feeling better about that as that means not as much of my lung will get radiated. I happlily don't work in the summer so I will be able to rest throughout this next phase of treatment and get it out of the way before I go back to work in September. So, I am trying to count my blessings. YOU, are going to be ok. Hang in there. Sonia",
      "MessageIndex": 13,
      "PostDate": "16/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/754856",
      "Title": "Anxiously waiting Kelscs Kcscared"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 3, 2010 12:23AM bailey1958 wrote: Waiting sucks!!! Hang in there!",
      "MessageIndex": 2,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/756232",
      "Title": "I found a lump last week jeaclark bluesgrl"
    },
    {
      "AuthorID": "bailey1958",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103911/profile",
      "Content": "Aug 20, 2010 02:43AM bailey1958 wrote: Hey Tina, I was given three injections the day before the surgery. It burned while the liquid was going in but it was over quick and I was allowed to leave right away. So my experience was quite different from Isla's. I had my sentinel node biopsy on a Wednesday and was back at work the following Tuesday. I could have went Monday but I wasn't allowed to shower until Tuesday so I didn't want to go to work feeling nasty. I had 4 nodes removed. I work as a counsellor so I was able to just sit and relax. I started the recommended exercises the second day and I have had no issues and have had a full recovery with only one minor post operative issue - a stitch abscess that emerged during radiation but cleared within a couple of days. It was just a stitch that didn't dissolve properly. I know this is a really scary and overwhelming time, but it really is going to be ok - you'll get through. Hang in there. Sonia ",
      "MessageIndex": 3,
      "PostDate": "20/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/756963",
      "Title": "Sentinal Node Biopy Questions PinkSurvivor TifJ"
    }
  ]
}