{
  "AuthorID": "bam320",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283779/profile",
  "Posts": [
    {
      "AuthorID": "bam320",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283779/profile",
      "Content": "bam320 wrote: Hello, Unfortunately I am a new member of the club. I have already gotten a lot of reassurance and information from this site and am coming forward to make it official. I was diagnosed with IDC on Dec 5th after having had my regular mammogram on Nov 7th. Such a horrible month of waiting which included the call to come back for more imaging/ultrasound, then to come back for biopsies to finally getting the news. Here is the details: Right, <1cm, Stage IA, Grade 1, ER+/PR+, HER2- I met with my surgical oncologist on the 18th and I will be having a mastectomy due to having a few spots that are not close together. The pathology report mentions IDC but also says DCIS. Not sure what that means as I thought they were two different diagnosis but regardless it is early and treatable with the largest spot being .5cm. At this time he does not think it has gone to any lymph nodes but obviously won't know until surgery. Yesterday I met with the plastic surgeon and I have pretty much decided on the diep flap surgery. I need to make the final decision and call them for it to get scheduled which will be sometime in January. A little about me....I am 52 and have a 16 yr old daughter and 13 yr old son who do not know about this yet. My husband is currently going through treatment for colorectal cancer so I dread telling them that their other parent is \"sick\" too. My comfort is that I am otherwise very healthy and feel confident that all will be well by this time next year and I believe that I will be able to get back to the activities that I love to do. Thank you already for the information and reassurance that I have gotten from you all. Dx 12/3/2018, IDC, Right, 1cm, Stage IB, Grade 1, 8/33 nodes, ER+/PR+, HER2- Chemotherapy 4/2/2019 AC + T (Taxol) Surgery Lymph node removal: Underarm/Axillary; Mastectomy: Right; Reconstruction (right): Free TRAM flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869018",
      "Title": "Joining the club bam320 bam320"
    },
    {
      "AuthorID": "bam320",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283779/profile",
      "Content": "Dec 30, 2018 05:44PM bam320 wrote: Thank you all for the welcome. My next step is to get this surgery schedule after meeting with another plastic surgeon. Once scheduled we will tell the kids and keep it moving!",
      "MessageIndex": 5,
      "PostDate": "30/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869018",
      "Title": "Joining the club bam320 bam320"
    },
    {
      "AuthorID": "bam320",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283779/profile",
      "Content": "Jan 17, 2019 06:03PM bam320 wrote: Weclome Fauxmaven. Keep us posted on to your experiences! I guess we are all learning from each other.",
      "MessageIndex": 7,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/869018",
      "Title": "Joining the club bam320 bam320"
    },
    {
      "AuthorID": "bam320",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283779/profile",
      "Content": "Mar 16, 2019 05:43PM bam320 wrote: I start four rounds of A/C on April 2nd followed by four of Taxol. Will have radiation after that. Looking forward to getting this show on the road! Positive thoughts going out to all!",
      "MessageIndex": 2258,
      "PostDate": "16/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "bam320",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283779/profile",
      "Content": "Mar 17, 2019 05:18PM bam320 wrote: Thank you Solobroker and Belleas mom too!",
      "MessageIndex": 3,
      "PostDate": "17/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/870410",
      "Title": "Port placement after masectomy bam320 DodgersGirl"
    },
    {
      "AuthorID": "bam320",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283779/profile",
      "Content": "bam320 wrote: I am getting my port in about two weeks and forgot to ask this when I met with my medical oncologist. I had a right masectomy with reconstruction via diep flap. I had axillary lymph nodes removed too. I know that ports are typically placed on the right side but is that possible in my case with the reconstruction as well as lymph node removal on that side? Would it being on the right side increase my chances of lymphedema? So afraid to end up with that! I plan to call their office on Monday but you are all such a great immediate source of info! Thanks~ Dx 12/3/2018, IDC, Right, 1cm, Stage IB, Grade 1, 8/33 nodes, ER+/PR+, HER2- Chemotherapy 4/2/2019 AC + T (Taxol) Surgery Lymph node removal: Underarm/Axillary; Mastectomy: Right; Reconstruction (right): Free TRAM flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/870410",
      "Title": "Port placement after masectomy bam320 DodgersGirl"
    },
    {
      "AuthorID": "bam320",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283779/profile",
      "Content": "bam320 wrote: My surgery is on Feb 21st and this week I had my pre-op assessment and tests as well as appointments with the plastic surgeon and the surgical oncologist. At these appointments they went over the surgery again as well as all the post op teaching. Even though I had heard most of the surgery information the first time we met, after hearing all this information again as well all the do's and don't for before and after, I am completely overwhelmed. I had been feeling pretty confident until getting all this information and of course hearing the worst case scenario information that they give before any surgery has me freaked out. Please tell me you felt this way too and everything worked out okay. My head is swimming right now. Dx 12/3/2018, IDC, Right, 1cm, Stage IB, Grade 1, 8/33 nodes, ER+/PR+, HER2- Chemotherapy 4/2/2019 AC + T (Taxol) Surgery Lymph node removal: Underarm/Axillary; Mastectomy: Right; Reconstruction (right): Free TRAM flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869739",
      "Title": "Starting to get very nervous bam320 applejuice"
    },
    {
      "AuthorID": "bam320",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283779/profile",
      "Content": "Feb 10, 2019 01:48PM bam320 wrote: I have no experience with what you are giing through but wanted to wish you the best with cardiologist appointment. I can only imagine how frustrating it was to be ready for this only to find out you must wait but sounds like it was for very good reason. Keep us posted on the results of your appointment.  ",
      "MessageIndex": 1,
      "PostDate": "10/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869726",
      "Title": "Delayed Surgery/heart failure 36andcounting Meow13"
    },
    {
      "AuthorID": "bam320",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283779/profile",
      "Content": "Mar 7, 2019 08:19PM bam320 wrote: Hi there, I had a right masectomy two weeks ago with diep flap reconstruction. I too have this under arm boob area now. My plastic surgeon says it is from swelling and will go down. I am trusting him at this point because everyone has told me that he takes the aesthetics of his work very seriously. I don't know if you have had your follow up appointment yet but when you do, please ask. I would like to know what your surgeon says. Betsy  ",
      "MessageIndex": 6,
      "PostDate": "07/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870182",
      "Title": "Drain concern and \"fat flap\" question. Nighthaven bam320"
    },
    {
      "AuthorID": "bam320",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283779/profile",
      "Content": "Mar 29, 2019 09:43PM bam320 wrote: knmtwins I have used Nuun tablets in water in the past for hydration. I don't think they are acidic. They come in different flavors and can be found where you would buy running shoes. I think there web site have a vendor search link. I might have to stock up as I start treatment next week. Good luck!",
      "MessageIndex": 306,
      "PostDate": "29/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    }
  ]
}