{
  "AuthorID": "Banita",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211576/profile",
  "Posts": [{
    "AuthorID": "Banita",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211576/profile",
    "Content": "Feb 18, 2015 06:03PM Banita wrote: My OB/Gyn referred me to a breast surgeon for my biopsy since the radiologist who reviewed my mammogram and ultrasound results was highly suspicious of breast cancer. The surgeon is the one who gave me my results and reviewed the biopsy with me and made a recommendation based on the pathology report. As others have shared, it really depends on the type of cancer, the stage, grade and location as to what is recommended. My surgeon works very closely with a team of other professionals all at the same facility, and since my case was pretty straight forward (IDC 1.1 cm, stage I, grade II, HER 2+, ER-/PR-) and I had been reading alot about options, when he recommended a lumpectomy and radiation, I agreed with his recommendation and made my decision that day so we could go ahead and get the surgery scheduled. He referred me to medical oncologist for chemo once the surgery was done and a second pathology report and lymph node biopsy came back. After my chemo was almost over my medical oncologist referred me to the radiation oncologist. I thought it was wonderful that they all work in the same cancer center. There were times when I started second guessing my decision when I heard that others with stage 1 cancer had opted for a mastectomy (this was after chemo when I learned more about radiation and the side effects). I wondered if breast conservation surgery was the way to go if there was a possibility the breast I was left with would be harder, smaller, permanently a different color, etc.. But aren't there disadvantages to a mastectomy, as well? What I realized is that this is a very personal decision and everyone is different. There is no one right way to go! I wish I had known more about radiation before I made my decison regarding the surgery, but I believe I would have made the same decision. I really trust the team of doctors. I'm almost done with radiation (only 6 more treatments), and it really hasn't been too bad.",
    "MessageIndex": 12,
    "PostDate": "18/02/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/828594",
    "Title": "question about which MD will be first windingshores"
  }]
}