{
  "AuthorID": "Barbjc",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
  "Posts": [
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "May 22, 2019 10:59PM Barbjc wrote: Spiralforest...nope I tried hitting the edit button but I can only edit my post not the topic name, oh well… Technology! I also have smaller breasts...I had the bilateral Mx with reconstruction but I did not go very large...about a small B cup.. my biggest worry right now is what the radiation is going to do to the tissue surrounding the implant... I have to be doing several gentle breast massagesdaily to keep tissue moving so we'll see well let's get through this together !",
      "MessageIndex": 6,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "May 23, 2019 09:57AM Barbjc wrote: Laurenashley, nothing is in your head, maybe the nausea was from feeling anxious about the first treatment...glad you are better now ! Haliday... I slathered lotion on my boob for weeks before radiation also we'll see if it helps! Just finished my 4th treatment and it seemed shorter this time maybe I'm just getting used to it… I don't leave the treatment center until I slather the steroid cream all over and then when I get home I put more Aquaphor on and I sit topless at home as much as I can! ha! Or i just go braless with a big tshirt on that is getting Aquaphor stains on it! Whensleeping, are you all wearing a bra or going braless? trying to figure out what's best .. Right now I have a very comfy bra while I sleep and I slather on the Aquaphor and put a gauze pad over it, but wondering if the pad is soaking too much of the Aquaphor and I should just go braless...it just feels so sticky to sleep though good luck to all, we can do this!",
      "MessageIndex": 11,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "May 22, 2019 10:24PM Barbjc wrote: Hi there and thanks for your reply! Good idea on changing the topic name except I have no idea how to edit that! Let me know if you do. I finished my third day of treatment today and so far so good ...I've been slathering Aquaphor on my boob all day long and I am also using a steroid cream they gave me. My arms and hands completely fall asleep and go numb when they are above my head during treatment and I am on the table for about 20 minutes since they are doing x-rays every day and I'm using that deep breathing technique because it is on my left breast. I guess that bolus is to keep the treatment toward the skin surface because I have the implant underneath… And yes I do experience that hot feeling once in a while on my skin... but I've been working out and doing yoga… No problems… When I do wear a bra I put a couple of those breast-feeding nursing bra liners in there because I have Aquaphor on! I will be doing 33 treatments total… 6 1/2 weeks… It would've been 4 1/2 weeks but since I have the implant from reconstruction they are giving me less dose each day for a longer time period! Stay in touch and good luck tomorrow...",
      "MessageIndex": 2,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "May 22, 2019 10:43PM - edited May 22, 2019 10:44PM by Barbjc Cowgirl13.. so good to hear that you are 10 years out with no problems! I just cringe when I hear that radiation machine go on because I'm afraid it's going to damage my heart and lungs… So thanks for your post ... and that's what I have on right now a big T-shirt no bra and Aquaphor slathered so it's kind of sticky",
      "MessageIndex": 4,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "May 26, 2019 09:57PM Barbjc wrote: Mom2-3girls, Sorry that you are feeling nauseous, that's hard to deal with. 22 treatments done though, you are more than halfway there! Is there something they can give you for the nausea? I haven't felt any nausea yet but I've only had 5 treatments Mylast day of radiation is July 3… What is everybody else's last day we need to start a countdown! Hang in there everyone",
      "MessageIndex": 22,
      "PostDate": "26/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "Barbjc wrote: Hi all! I began radiation today, wanting to connect with others beginning this month to compare treatment recommendations and progress...assume there are lots of you out there! I had a bilateral MX Feb. 2018 with reconstruction. I had DCIS with microinvastion. Turned down tamoxifen due to uterine cancer running in my family, but thought I'd be ok. I found a small pea size lump March 2019 and had it removed, turned out to be DCIS again so I'm doing 6 1/2 weeks of radiation! Since it's on my left breast, they are having me do DIBH (deep inspiration breath hold)..where I take a deep breath in and hold my breath during treatment to avoid exposure to heart and lungs. When I did my first treatment today, they used a Bolus over my breast. They said it will deliver more focused treatment to skin area...anyone have that also? I needed to stop googling because all I'm finding is that it makes skin irritation worse, ugh! They are also putting me on the med Singulair to help prevent capsular contracture with my implant. Hope it works. Trying to stay positive but afraid of bad skin reactions, arm cording coming back, and messing up my implant. Day one done! Peace and gentlehugs to all, barb:) Never be ashamed of a scar. It simply means you were stronger than whatever tried to hurt you. Dx 12/20/2017, DCIS, Left, <1cm, Stage 0, Grade 3, 0/2 nodes, ER+/PR+, HER2- Surgery 1/15/2018 Lumpectomy: Left Surgery 2/27/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "20/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "May 23, 2019 06:29PM - edited May 23, 2019 06:29PM by Barbjc Thanks Cowgirl13, I will try sleeping braless tonight with a big tshirt on",
      "MessageIndex": 13,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "May 26, 2019 09:46PM Barbjc wrote: SLLO... Nope I don't put the Aquaphor on right before radiation. They told me not to put anything on two hours prior to the treatment... last week my treatments were at 8:20 AM so I would go right after I showered… Next week (and until the end), my treatments are going to start being at 3:40 PM so I will probably have Aquaphor on from all day putting it on, but i won't put it on 2 hours prior. good luck and stay in touch",
      "MessageIndex": 20,
      "PostDate": "26/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "Jun 1, 2019 10:25PM Barbjc wrote: Hi all... Well I've finished 9 treatments and no issues yet...no redness and I haven't been tired. We'll see what week 3 brings me. I put on the steroid cream right after treatment...after doing the aquaphor during the day and then at night at before bed. I've not had any 'zingers' some of you spoke of, but perhaps it's because I had the bilateral Mx last year with reconstruction, so nerves aren't what they used to be in that area. I do like the 3:40pm treatment time much better than the morning time...it's nice to go home right afterwards, rather than heading to work on my work days. On Tuesday of last week, the first day of beginning the 3:40 time, I entered the back waiting room and found 4 women laughing up a storm! I told them the afternoon group was much livelier than the morning group! They were hysterical...all waiting for treatment because the office was running...wait for it...an hour and a half behind that day! Yeppers...I was supposed get treatment at 3:40, but went back at 5:15pm. But here's what's true...no one was complaining or angry or mad...we all just chatted and laughed the entire time, and thoroughly enjoyed our time together...sitting in our pink robes. Life is good when surrounded by good energy and kind people. And...Friday, I made the decision to begin riding my bike to treatment! It's only 3 miles away, so the 6 mile round trip is a perfect way to frame some fresh air and nature surrounding my appointments. I'll be doing that every day, weather permitting. I'm doing yoga and stretching every day, and began PT...determined for this radiation NOT to mess up my reconstruction. Been spending the day in a big t-shirt with no bra and aquaphor all over my boob, you know the drill! Will keep y'all updated...good luck everyone and hang in there! ",
      "MessageIndex": 34,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "Barbjc wrote: Hi all! I began radiation today, wanting to connect with others beginning this month to compare treatment recommendations and progress...assume there are lots of you out there! I had a bilateral MX Feb. 2018 with reconstruction. I had DCIS with microinvastion. Turned down tamoxifen due to uterine cancer running in my family, but thought I'd be ok. I found a small pea size lump March 2019 and had it removed, turned out to be DCIS again so I'm doing 6 1/2 weeks of radiation! Since it's on my left breast, they are having me do DIBH (deep inspiration breath hold)..where I take a deep breath in and hold my breath during treatment to avoid exposure to heart and lungs. When I did my first treatment today, they used a Bolus over my breast. They said it will deliver more focused treatment to skin area...anyone have that also? I needed to stop googling because all I'm finding is that it makes skin irritation worse, ugh! They are also putting me on the med Singulair to help prevent capsular contracture with my implant. Hope it works. Trying to stay positive but afraid of bad skin reactions, arm cording coming back, and messing up my implant. Day one done! Peace and gentlehugs to all, barb:) Never be ashamed of a scar. It simply means you were stronger than whatever tried to hurt you. Dx 12/20/2017, DCIS, Left, <1cm, Stage 0, Grade 3, 0/2 nodes, ER+/PR+, HER2- Surgery 1/15/2018 Lumpectomy: Left Surgery 2/27/2018 Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "May 22, 2019 11:42PM Barbjc wrote: big thanks for changing that",
      "MessageIndex": 8,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "May 26, 2019 10:50AM Barbjc wrote: SLLO, Since you just had the bilateral MX a month ago, maybe ask your surgeon about what creams would be OK to put on, unless you are all healed up. I started applying aloe two weeks prior to radiation every day and every night… I am a week into radiation and now I use aquaphor and a steroid cream ...I apply Aquaphor in morning amd throughout day and at night...and I put the steroid cream they gave via prescription on right after treatment. The Aquaphor is super sticky so I don't wear a bra most of the time and I bought some cheap oversized camisoles that I wear (will toss when done since aquaphor stains) and then a oversize shirt over that. When I go to work I actually do wear a bra but I bought some nonstick pads that I put inside my bra to help with Aquaphor stickiness. Not the most comfortable but not forever! Do you have expanders in or did you opt for no reconstruction good luck and hang in there",
      "MessageIndex": 17,
      "PostDate": "26/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "May 26, 2019 09:54PM Barbjc wrote: Kstinekd, I have that chest mold thing placed on top of my chest during radiation also ...they told me it is called a \"bolus\" but I have it on every time ... they told me it helps target the dose closer to the skin where it needs to be… I am hearing that it can make your skin get more irritated, nothing so far on me but it's only been 5 treatments... What is this about putting lotion on your back also! ? thanks for the heads up because nobody told me to do that ...are you getting red on your back also? Hang in there, we all got this",
      "MessageIndex": 21,
      "PostDate": "26/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/871636",
      "Title": "Radiation May 2019 Barbjc Barbjc"
    },
    {
      "AuthorID": "Barbjc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267351/profile",
      "Content": "Apr 5, 2018 09:25AM Barbjc wrote: Not sure if this information will help anyone because I'm sure all individual issues have different causes … Ever since my bilateral Mastectomy 2/27/18 ( with tissue expanders placed), I have had collarbone and upper left shoulder and shoulder blade pain , and left underarm pain with limited range of motion ( left side is where they took 2 lymph nodes) I've been to therapeutic massage, chiropractor, and most recently I saw a physical therapist last week. All agree that my 1st rib (which is located up by the collar bone) is out of place, which is causing muscle knots by my shoulder blade and almost a tug-of-war between the out of place 1st rib and muscle by the shoulder blade. Plus I have a mild case of cording (axillary web syndrome) under my left arm pit. The tissue expanders are under my pectoral muscle, so all the stretching going on is related to all of these issues ! Due to the tissue expanders being in place, my chiropractor can't do her normal adjustment to fix this 1st rib, so the PT will manually have to adjust it back into place over time, and the PT will also be doing a specific stretching PT massage for the cording issue ... anyways! my suggestion to anyone with shoulder or collarbone pain is to see a physical therapist that specializes in post breast cancer surgery treatments, they are fabulous and even after one treatment with him I feel slightly better… I'm scheduled to receive PT 2x/week for the next 6 weeks ...hopefully my issues will be resolved soon because I can't take this pain much longer and I am so tired of taking painkillers and muscle relaxants! Hang in there everyone... I keep repeating my mantra \"I HAD cancer, cancer never had me!\" Fight fight fight!",
      "MessageIndex": 14,
      "PostDate": "05/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/800950",
      "Title": "Collarbone pain kk12903 Barbjc"
    }
  ]
}