{
  "AuthorID": "Barbmak",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
  "Posts": [
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Jun 20, 2017 02:04PM Barbmak wrote: Hi everyone. SAVI was put in at surgeon's office and now I wait. I need to let it \"rest\" for a day then go for scan on Thursday. It was not as bad as what I thought it would might be- however toward the end I started to get nauseous and felt like I was passing out....very weird...got over that with their help and thank goodness, didn't pass out....I wasn't in pain and honestly I usually keep my eyes closed with stuff so I don't have to see anyone coming toward me with sharp objects!l lol. I was asked if I wanted to see what they were putting in and I did take a look at it- so just maybe subconsciously that's what did it for me! My suggestion? You don't need to see it! I am all taped over as the ends are taped under my right breast...I was told not to take my bra off until I go to RO for scan.",
      "MessageIndex": 120,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Jul 3, 2017 10:13AM Barbmak wrote: Hi everyone...It's now 3 days since Savi was taken out. I had a difficult weekend with lethargy and nausea. (shower was great though). I am better today but the lack of energy is concerning as I am scheduled to go back to work on Wednesday. In addition, the steri strips covering the wound for the savi loosened up on day 2 which bothers me also, although my husband says it looks like it is healing to him. My breast is hard, thickened and discolored...Anyone else feel this lethargy and/or have the breast look/feel like this....I've been pretty down because I expected to feel better after the radiation was over and the savi was out.",
      "MessageIndex": 129,
      "PostDate": "03/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Jul 11, 2017 08:29AM Barbmak wrote: Kira1234, I'm sorry you had to go through all of that. Unfortunately, they don't tell us all of the possible side effects for this type of radiation; the nurse kind of alluded to that when I was in so much pain that week. Hope you are doing well now. Ceanna, I am doing much better. My energy level seems to be close to where I was pre surgery. Still 'leaking' but not as much and little to no real pain, thank goodness! ",
      "MessageIndex": 135,
      "PostDate": "11/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Jul 27, 2017 04:53PM Barbmak wrote: Pyrrh, I also had no adhesives during radiation. I was afraid that all the gauze wouldn't stay in place- but it did! Ceanna I also wore a cottony bra that opened in front for radiation and I am still wearing it at night for some support. I just posted on the lumpectomy lounge about my recent issues. The radiation totally weakened my surgical incision which had been healing so nicely. I had follow up with RO last week and he did not like how it looked. I went to surgeon for a follow up after the seroma visit on Tuesday, and she told me that I needed a wound specialist...the white \"stuff\" that I thought was from an infection is actually my breast fat not being contained by this wound that won't heal. I have a protocol 2x a day now and I see wound specialist next Tuesday again. I still work full time and it seems like all I do are visit doctors and work! Staying positive though and counting my blessings because there are women on these boards who are dealing with a lot worse than me. Just hoping that it heals soon.",
      "MessageIndex": 139,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Aug 4, 2017 05:36AM - edited Aug 4, 2017 12:55PM by Barbmak Irishgirl, there are so many people that have no issues with this type of radiation. Even knowing what happened to me I would probably still opt for it so as not to have to radiate the whole breast for 35 days! No doctor has given me an actual answer about why my incision opened....BS said radiation/ RO said possibly the device pushing on incision/ another doctor at the wound place said Methylene dye can do this. I asked my BS on phone last night and she said yes sometimes it can be a combination of radiation and the dye used in the surgery in certain people. I really think my situation is just an exception...so I wouldn't worry. I bought some cotton fruit of the loom -open in the front -racerback bras and still wear them at night. They were easy to get on and off for Radiation twice a day and didn't hurt my SNB incision under my arm. Take care of yourself. Especially during the week of radiation. Hang in there!",
      "MessageIndex": 146,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Sep 29, 2017 05:38AM Barbmak wrote: Just a follow up - I had to have a second surgery yesterday to close my original surgical incision. I posted in early August about the issues I'd had with this opening up. I was seeing a wound specialist and although it was getting closer it was not healing. So I asked for a surgical solution as I was so tired of the dressings and going to wound specialist weekly. Apparently BS had to do something (scrape it) to create some blood flow and then stitch it from inside and out? I'm not really sure- I just know I wanted this hole to close. I am in quite a bit of pain today from this but hoping that when I can take off the bandage on Sunday I will see that that is healing...It's been a long road since June 7th when I had original suregry.",
      "MessageIndex": 164,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Jun 13, 2017 05:29PM Barbmak wrote: Had my post op appointment today after lumpectomy last Wednesday and am happy that I have this option available to me. I will have Savi put in next Tuesday. Not looking forward to that, but the alternative is 30 days of radiation. I asked BS what she would do and she said why would you want to do that for 30 days over the summer? Reading this forum has been so helpful in easing my fears about this. Does everyone get an antibiotic when device is implanted?",
      "MessageIndex": 115,
      "PostDate": "13/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Jun 19, 2017 07:41AM Barbmak wrote: Hello, Ceanna- thanks for sharing your experience. I go to BS tomorrow to get it put in...I'm nervous about the whole thing...I'll keep you posted. Juani66 I hope you got the answers you need...and are feeling better.",
      "MessageIndex": 119,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Jun 30, 2017 04:03PM Barbmak wrote: Well all 10 treatments are done and the device is out as of 4:30 this afternoon. Another 24 hours and I can shower!! YAY!!!! I was so worried about the pain of the device coming out- and I should not have been. The doctor put a numbing ointment around incision, waited a minute or two and the next thing I knew the device was out. It was great- so if anyone else is worried about that, this should ease your mind! I still have a small fever and if it gets worse I have to call RO over the weekend.....but I really just think my body did not like this foreign object in it!",
      "MessageIndex": 127,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Aug 4, 2017 12:54PM Barbmak wrote: Gogrannygo- I think it just takes time. Your breast has gone through trauma and is still going through trauma with the radiation - even though you are finished the actual radiation therapy. My RO said radiation is doing its work inside my breast for 6 weeks after it is over...Hang in there. By the time you go back on the 28th it may be feeling better.",
      "MessageIndex": 149,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Jul 4, 2017 06:47AM Barbmak wrote: Ceanna, I've been feeling stronger each day and nausea has gone away. I do have 3 follow up appointments with RO. I intend to go to work tomorrow and if necessary I will leave early. Thanks for listening and being there. It helps!",
      "MessageIndex": 131,
      "PostDate": "04/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Oct 10, 2017 04:47PM Barbmak wrote: Hi Irishgirl....unfortunately, my wound is \"leaking\" again...I told doctor it started last Saturday when I was with my grandkids...she asked did you lift them? Yikes...yes I lifted one 3 year old onto a swing...no one told me not to lift...bottom line she did ultrasound...said I do not have the same \"hole\" that I had...I have to take an antibiotic (which her office failed to electronically send to pharmacy today...so annoying) and I need to go back on my regimen for the dressing I was using...I go back again in a week for her to look. Thanks for asking about me :)",
      "MessageIndex": 169,
      "PostDate": "10/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Jun 21, 2017 08:45AM Barbmak wrote: Ceanna- yes as far as I know I start radiation on Friday...I will definitely ask about cleaning the incision...thanks- good advice. I do have an antibiotic that I started yesterday.",
      "MessageIndex": 122,
      "PostDate": "21/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Jun 29, 2017 02:07PM Barbmak wrote: Hi everyone. I was originally told by BS office staff that radiation would start on Friday. When I got to RO for scan and plan last week they said they do not start on Fridays. They don't like to have a weekend interrupt treatment. So I just finished day 4. I had a lot of pain Tuesday night until this morning. They said that was not normal. Looking at breast today it was red and doc believed infected. It was not red from radiation. However this afternoon much much better. It comes out tomorrow afternoon. IKeep you posted!",
      "MessageIndex": 125,
      "PostDate": "29/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Jul 10, 2017 04:28PM Barbmak wrote: Thought I would post this experience in case anyone else comes across this situation. 5 days after radiation was done and the Savi was out, I went to take my bra off to go to bed and I had saturated 2 thick gauze pads and my padded sports bra. Not only that but it was just continuously leaking out of my surgery incision (not the Savi incision) & didn't look like it was going to stop. I called surgeon and was told to come in the next day. Apparently, I have a seroma and the radiation weakened my incision enough to open it up...Doc put me on different antibiotics & told me to keep antibiotic ointment on it. I've been sopping up fluid- but I actually think it is slowing down a little. pain is better today. It's been kind of a rough road with the brachytherapy....but then I think that I could also still be doing regular treatment instead of being done with it. Hoping that anyone else who finds this doesn't have to deal with this situation...but in case it happens- you're not the only one so call doctor and hang in there!",
      "MessageIndex": 132,
      "PostDate": "10/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Aug 24, 2017 12:54PM Barbmak wrote: Irishgirl, I had the same experience with them getting the fluid out with the first CT scan. My technician also held my hand! Thank goodness for the compassionate people who work in this field! I did have one other time- mid week that the RO had to again manipulate the savi and get fluid out again....it is definitely uncomfortable but hopefully you will not have to go through that again. I had no pain at all with the Savi removal...I was so worried about it- and had myself worked up- so was pleasantly surprised when it came out with no pain. Also NO pain for the treatment itself. It's just a matter of patience while they get you set up each time and when then leave the room as the treatment occurs. I would just close my eyes and go to my \"happy place\". Good luck and keep us posted. Sending positive thoughts and healing vibes as you go through this next phase.",
      "MessageIndex": 156,
      "PostDate": "24/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Aug 23, 2017 05:14PM Barbmak wrote: Irishgirl- wishing you well with your savi insertion and therapy. It's not the most comfortable thing in the world- but it is short term. Stay positive.",
      "MessageIndex": 153,
      "PostDate": "23/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Sep 29, 2017 09:20AM Barbmak wrote: Thanks, Irishgirl. I will keep you posted.",
      "MessageIndex": 166,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "May 10, 2018 06:07PM Barbmak wrote: Hello everyone- just a little update. everything is healed and doing well. Doesn't look very pretty...but I'm really ok with that. I will be scheduling second mammogram post surgery for June. December tests were good thank goodness. Hope everyone is doing well.",
      "MessageIndex": 172,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Barbmak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253447/profile",
      "Content": "Aug 17, 2017 04:44PM Barbmak wrote: I have been dealing with an open wound since finishing my brachytherapy. Surgical wound was healing beautifully and then it opened up (seroma ) Every doctor has a different reason why it opened. Radiation/ radiation device (savi)/ methylene blue dye...at this point I don't care what did it, I just want it healed. My surgery was 6/7; finished radiation on 6/30. Seeing a certified wound specialist since 7/25. Have had debridement a few times and am on my second round of the vacuum dressing. I am working and having a hard time with the little \"pump\" I have to carry around in my pocket. Today surgeon said it looked better....but I've been taking pictures all along the way and I think it looks horrible...I just want it to close! It is depressing. Taking a multivitamin for 50+; Biotin; extra 500 mg of C; not sure what else I should do...any ideas?",
      "MessageIndex": 15,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856334",
      "Title": "So many complications eschofi Barbmak"
    }
  ]
}