{
  "AuthorID": "BarbaraT54",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245274/profile",
  "Posts": [
    {
      "AuthorID": "BarbaraT54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245274/profile",
      "Content": "Aug 26, 2018 05:42PM BarbaraT54 wrote: Thanks for replying. It’s so frustrating to be in pain like this. People have no idea, and I hate dwelling my family. The dr had me on 1800 mg gabapentin. Just mad me feel weird. I don’t have implants to remove, but it feels like I need to take off this super tight bra and girdle :) Are you BRCA positive? I took Tamoxifen for about 4 years prior to the mastectomy, before my high risk oncologists recommended it. I’ve thought about hypnosis- do you think it’s been worth it? I feel your pain :) - it so sucks. I’m glad you didn’t get the FLAP, because if you are prone to this pain as a result of surgery, then you would also have the abdominal pain. I asked my Drs about nerve blocks and Botox, but unless they can numb my entire torso wouldn’t help. The one silver lining is when I’m dwelling on this, it distracts me from my next CA125 blood test for ovarian cancer! I try to focus on the positive and happy to be here every day- but I would love to feel “normal” again. One thing I have learned is you can’t get enough opinions. If your intuition is telling you not to wait, maybe seek out a dr at another hospital. Where do you live? I’m in Philadelphia and had the “ top Doc” do my surgery. He was so arrogant. He told me he could “ Lipo” the swelling away and said “ no such thing as breast lymphedema” existed. Aesthetically, he did a great job and that’s all he cared about. No interest in after pain. But, after 5 years I’ve almost let that go. Like the 5 Drs who missed my ovarian cancer. 😳 Praying for you to enjoy some pain free time ! Best, Bar ",
      "MessageIndex": 1703,
      "PostDate": "26/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "BarbaraT54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245274/profile",
      "Content": "Jan 12, 2017 09:23AM BarbaraT54 wrote: Hi Ladies- I am so happy to have found a place to vent my frustration to people who understand and literally feel this pain that I do. I have BRCA2 mutation and had ovarian cancer in 2009 and recurred in 2014. In July 2013, I had a prophylactic double mastectomy with FLAP reconstruction. To make a very long story shorter - it was only 8 months after surgery, I had the second abdominal cancer surgery and a second hernia repair. I have had 34 rounds of chemo, for cancer treatment and in a clinical vaccine trial. I have not had ONE painfree moment since the breast surgery. My PS never discussed potential pain issues, regarding all of my surgeries and scar tissue when he pushed for the FLAP and my \"free\" tummy tuck. Nothing is free I have learned. After a breast rehab physician diagnosed breast and abdominal lymphedema, he said \" there is no such thing\" and offered liposuction - great idea to inflame an already inflamed area. I never saw him again. I add he is Chief of PS and I have read articles by him on this website, which is what motivated me to write this - as he never mentions the remotest possibility of pain complications connected particularly with the FLAP. Since the fall of 2013, I have tried everything, except a nerve block - I have constant pain, pressure, tightness, etc from my shoulders to my fake belly button. Even in my sleep. Ironically, my breasts look great and my abdomen is very flat- I certainly don't regret the mastectomy, but if he hadn't pushed for the FLAP, I wouldn't have all the abdominal issues. Pain killers, Cymbalta, neutontin (1800 mg) do nothing. Currently, I am having PT for abdominal pain, Lymphedema therapy, ( she uses massage, lights and the Lymph Star machine). I do self massage, an entire stretching program, see a chiropractor and get Reiki massage on a regular basis. I see an Integrative MD and take immune building supplements and have taken a Mindfulness course to deal with this stress. I am so angry, because it isn't the ovarian cancer right now that interferes everyday with my quality of life, but the ego of my PS who never even mentioned that all the abdominal surgeries could impact my long range pain issues. I am sure he learned about connective tissue pain in med school. After surgery, he actually seemed angry I had so much scar tissue it was like \" ploughing through corn rows.' The Chief of Pain at the University of Pennsylvania said simply all the pain is from all the cutting. He prescribed Lidoderm patches, which do not help and discussed Lyrica and Methadone. No thank you. Thanks to all of you who took the time to read this book :) All suggestions greatly welcomed. Barbara   ",
      "MessageIndex": 1576,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "BarbaraT54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245274/profile",
      "Content": "Jan 14, 2017 06:41PM BarbaraT54 wrote:",
      "MessageIndex": 1580,
      "PostDate": "14/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "BarbaraT54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245274/profile",
      "Content": "Aug 29, 2018 09:43AM BarbaraT54 wrote: My plastic surgeon was so arrogant - denying breast and abdominal lymphedema even existed. He just dwelled on my scar tissue like it was my fault. Meanwhile, he repaired a hernia caused from ovarian surgery and it was back in 6 Months. He never recommended PT or massage or seeing a breast rehabilitation dr, although there was one in the same building. Living with this pain nonstop since July 2013 is very frustrating when nothing helps. It is great to read some women get relief. I do see an energy healer, which overall does make me feel a little lighter mentally and physically. Have you ever seen an integrative MD regarding the cancer and pain? Barb  ",
      "MessageIndex": 1716,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "BarbaraT54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245274/profile",
      "Content": "Aug 18, 2018 11:05AM BarbaraT54 wrote: Thanks so much. The cannabis is becoming legal in many states here. Hopefully,in Australia soon! ",
      "MessageIndex": 1696,
      "PostDate": "18/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "BarbaraT54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245274/profile",
      "Content": "Jan 16, 2019 09:55PM BarbaraT54 wrote: yes. I have a medical marijuana card and use not CBD oil, that didn’t help my pain, but Cannabis oil with a hybrid combination of Sativa and Indica strains. My pain is a constant 8 to 10. The problem is the effects of the THC , so I only use it at night. I had ovarian cancer twice- I am BRCA2 positive and had a prophylactic double mastectomy with FLAP reconstruction. My pain is in my entire torso. The FLAP was a huge error. My PS convinced me “best” thing to do. I have massive scar tissue in my entire torso, plus flare ups of Lymphedema. The cannabis oil does help sometimes. I’ve tried everything.,. Bar",
      "MessageIndex": 1752,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "BarbaraT54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245274/profile",
      "Content": "Aug 17, 2018 06:17PM BarbaraT54 wrote: hi fellow lady sufferers ! I have not had a pain free moment since July 2013 when I had a prophylactic double mastectomy and flap reconstruction, as I am BRCA2 positive and was dx in 2009 with ovarian cancer and again in 2014 ( 8 months after mastectomy). To make a very, very long story short( impossible) as a result of my first ovarian cancer surgery- 8 hours of debulking surgery, then the 10+ hours of breast surgery with a hernia repair. ( The plastic surgeon never saw so much scar tissue in his life he said ), I the 2014 ovarian cancer surgery 8 months after mastectomy, with the same hernia being repaired again, I developed lymphedema and PMPS The head of pain management at Penn said my pain is from “ all the cutting.” I dx myself in 2013 with breast lymphedema and post mastectomy pain syndrome. I’ve seen MDs who are more than happy to prescribe opioids (they don’t work for me) I’ve tried 1800 mg of neurontin - did nothing! The dr offered Lyrica, then Methadone - no thank you I’ve tried ice, dry needling, acupuncture, physical therapy ( I’m on my 8th physical therapist), lymphedema therapy, Lymph Star, laser, massage, lotions, pain patches, compression garments, tape, etc etc etc My pain is my entire torso - even in my sleep. However - Medical marijuana has actually been helping a little! I take the edibles in a hybrid of Sativa for pain and the Indica strain for pain as well as an anti cancer element. My drs are very encouraging and my oncologist thinks it’s been helping the cancer to not recur. I also was in an immunotherapy trial for 34 months. With ovarian cancer, one is never considered cured- just praying for the next test to be okay - AS WE ALL ARE!!! Good luck ladies - try the cannabis ! Even for a few precious hours, it is wonderful to feel a little better. Barbara       ",
      "MessageIndex": 1694,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "BarbaraT54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245274/profile",
      "Content": "Aug 29, 2018 03:58AM BarbaraT54 wrote: Hi- I am so sorry for what you are going through. My pain and lymphedema are a product of a prophylactic double mastectomy with a FLAP, as I had ovarian cancer twice and am brca positive. I’m sure your Drs would never admit the role the surgeries had regarding your recurrence. My plastic surgeon told me he could fix my pain and swelling with liposuction. I’ve tried everything too- medical marijuana helps a little at night. Have you tried ? My thoughts and prayers are with you. Best, Bar",
      "MessageIndex": 1713,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "BarbaraT54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245274/profile",
      "Content": "Jan 17, 2019 07:48AM BarbaraT54 wrote: Thank you for your kind words. I'm on my 9th practioner in addition to acupuncture, dry needling etc etc. etc But, actually my newest massage therapist is using a “face\" blaster tool that has loosened my abdomen a bit. The Lymphedena is not an issue right now, it's the massive tightness and actual breast pain that is so unbearable. I thought maybe the cryotherapy I triedwould help, but I was told it's not a good thing if you've had cancer. For 5 1/2 years I've been on this quest to find something for this often unbearable pain. But, I am so grateful to be an almost 10 year cancer survivor I have learned to “suck it up\" 🤗 Thanks again, Bar    ",
      "MessageIndex": 1755,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "BarbaraT54",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245274/profile",
      "Content": "Jan 17, 2019 03:43PM BarbaraT54 wrote: hi- I do totally get it. The degree of pain can be so intense and I try not to dwell my family, but sometimes it is so hard to be faking it. I took 1800 mg of Gabapentin- all it did was make me feel weird, without lessening the pain. I stopped it cold turkey. This pain has truly been more challenging than the 34 rounds of chemo I had. The breast pain at least has a purpose, but the abdominal pain is truly the fault of my plastic surgeon who totally pushed the FLAP with no warning about potential pain from my past or possible future ovarian cancer surgery. Unfortunately, the ovarian cancer recurred 8 months after the mastectomy so I had an additional surgery. If medical marijuana is legal in your state, I recommend it. It does bring some relief. Did you have reconstruction? Best, Barbara",
      "MessageIndex": 1757,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    }
  ]
}