{
  "AuthorID": "bareclaws",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
  "Posts": [
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 15, 2017 06:05PM bareclaws wrote: BMX this morning, nomreconstruction. Piece of cake. Two drains. No pain, just a bit of soreness. Looking forward to blowing this joint tomorrow. Starting arm exercises and walking tomorrow. My kids are all in town for a few days and I'm using them to do all kinds of jobs I can't, or don't want to do.",
      "MessageIndex": 239,
      "PostDate": "15/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 24, 2017 04:51PM - edited Mar 24, 2017 04:51PM by bareclaws Yvonne, I had drains out yesterday and just have a bandaid over the holes in my chest, so no more drainage that way to speak of. After I took the ace bandage off for a shower and then rewrapped it, the arm twinges stopped. I think the nurse had done it too tight.",
      "MessageIndex": 407,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 25, 2017 08:33AM bareclaws wrote: Ten days post BMX and I walked three miles this morning, then back out with the dogs for their short walk. It feels so good to sweat!",
      "MessageIndex": 417,
      "PostDate": "25/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 30, 2017 01:26PM bareclaws wrote: raven4mi, WHat?! 25cc and he still won't take them out? I'd be pissed, too. Hoping you dry up over the weekend.",
      "MessageIndex": 539,
      "PostDate": "30/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 4, 2017 02:45PM bareclaws wrote: lovepugs77, I'm so sorry you got that news. Now you know and can go forward with a plan. In the meantime, love the pugs. I know my dogs are sometimes the only things that keep me going.",
      "MessageIndex": 642,
      "PostDate": "04/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "May 7, 2017 08:33AM bareclaws wrote: MariH, you are funny! I know about those wee hours of the morning. Cray time..",
      "MessageIndex": 891,
      "PostDate": "07/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 17, 2017 07:23AM - edited Mar 17, 2017 11:14AM by bareclaws I'm 24 hours post-BMX (no reconstruction) and can honestly say that this hasn't been a huge deal. I unwrapped the ace bandage this morning and and took a full on shower. Got a good look at my incisions. Longer than I would have liked but whatever. I wiill be able to wear a tank top, even v-neck. Scars may show a little bit under arms but I don't care. The two drains are a PITA but with an empire top, or something with lower bodice gathers, they're camouflaged. No pain meds needed. Experiencing a bit of muscle soreness when I do the arm exercises but nothing remotely bad. Walked a bit yesterday and I will do more today. I guess my message to those of you who haven't had your surgery yet is, don't fear it. Surgeon just called with lab reports. Clear margins. Some lymph nodes came out with the tumor on left side and they were negative. There was small residual tumor on left side and more diffusedcancer on the right, but non-invasive. I really don't think this could have been any better for me, unless all the cancer had disappeared. It's gone now. So why didn't my surgeon sound upbeat and positive? Maybe I was expecting too much.",
      "MessageIndex": 255,
      "PostDate": "17/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 20, 2017 09:50AM bareclaws wrote: DiV, I'm thinking of you and hoping for a good outcome. You've had so much to deal with",
      "MessageIndex": 298,
      "PostDate": "20/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 23, 2017 01:01PM bareclaws wrote: Today was first post-op appt after my BMX and I accomplished my goal-to leave that appt without those two suckers, i.e. drains! Woohoo! My wardrobe possibilities have expanded exponentially. And I'll be able to walk the neighborhood without the funny bumps at my waist. My recovery has been very easy. No pain whatsoever. No fatigue. I've been concentrating on getting rid of the weight I've gained on chemo so far and have had some success. I think it will be about two weeks before MO starts me on Taxol/Herceptin. I, too, missed the \"no dogs\" caution. That might have been a game changer. My dogs are my only daily companions and while they don't actually get in my bed (unless there's a thunderstorm), they're pretty much are all over me, which I welcome. I need them as much as they need me. Jada, thinking of you. We have similar diagnosis. You (we) wil get through this.",
      "MessageIndex": 382,
      "PostDate": "23/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 24, 2017 08:52AM bareclaws wrote: I walked 2.25 miles, slowly, three days after BMX, and the same distance today (9 days out), but much faster. Can't wait till I can start running a bit, at least on the downhills. I didn't even ask the BS but am figuring she would say no until next post op appt. Careful look at my uncovered incisions this morning, a lump here, a bump there. Please tell me that this will all even out in time. And uncovered, the numbness of incision area and around them is disconcerting. I do have feeling at center of breastbone. Does any of this come back? Another thing, I had a total of seven lymph nodes removed on left side. Five of those came out with the left breast tissue. The sentinel node and another one tangled up with it had been taken a few months ago. So today, no drains and ace bandage only, I'm starting to feel little twinges on the underside of my upper left arm. Could this be the first warning sign of lymphedema? Could the tight ace bandage cause that?",
      "MessageIndex": 400,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 10, 2017 03:17PM bareclaws wrote: BMX is scheduled for the 15th. I saw a Patient Navigator this week and she went over the bandages, drains,etc, and gave me two pages of arm exercises to start the day after surgery. She also said to start walking the day after surgery to help clear the anesthesia out of my system.",
      "MessageIndex": 158,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 6, 2017 03:50PM bareclaws wrote: mommaB24, you are certainly not alone. Negative nodes and bone scansare good! Try to focus on that good news.",
      "MessageIndex": 684,
      "PostDate": "06/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 28, 2017 09:50AM bareclaws wrote: Sjsparks, good luck tomorrow and don't go looking for trouble. You may not have pain. I had zero pain from BMX. Nada. Not even a Tylenol. I know everyone's body acts differently but pain is not necessarily a given.",
      "MessageIndex": 492,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 28, 2017 12:56PM bareclaws wrote: Sjsparks, if you have a port, make sure your BS orders your fluids, IV, everything be given through that. It has to be ordered, or they won't do it. No sense in sticking veins if you have a port. And you can to the lidocaine over port yourself before you leave for the hospital. Most of my pre op verbiage was done over the phone. I did go in for a blood donation, taken bya dingbat who left me bruised and battered. How come the only people who know how to draw blood are the phlebotomists at my cancer center?",
      "MessageIndex": 502,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 29, 2017 09:25AM bareclaws wrote: KimE, I'm sorry. That sucks. I know you are terribly upset and rightfully so, All you can do is move forward with the better knowledge gained from the lumpectomy. I, too, learned that imaging doesn't tell the whole story.",
      "MessageIndex": 856,
      "PostDate": "29/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 7, 2016 06:36PM bareclaws wrote: I think the walk was very important, mentally as much as physically. About 24 hours after the infusion I felt pretty bad but one Compazine and a Claritin D and ginger tea straightened me out. I woke up at 3AM feeling good, like the drugs were wearing off. Got up and ran (slowly) four miles this morning. I wanted to do five, but decided not to push it. It wasn't a great run, but I've had worse. Lost two lbs of water weight overnight and hope the rest is soon gone.",
      "MessageIndex": 122,
      "PostDate": "07/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 20, 2016 12:12PM bareclaws wrote: I got another IVIG yesterday, converted to oral steroids, my platelets shot up to 74 and the dr on call came in in the evening and sprang me from the joint! I screamed and jumped up and down when she told me I could go home. I just now walked 2.5 miles and am about to go get my dogs. Feelingalmost human. Blood work tomorrow.",
      "MessageIndex": 236,
      "PostDate": "20/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 13, 2017 02:38PM bareclaws wrote: It's now one week after starting over with AC. Days 5 and 6 were the worst but even they were so much easier on my system than the TCHP I started with. I can definitely do three more. I had fluids and anti-nausea meds the day after chemo, but still the only thing that unclenches my gut muscles after I eat a meal is two hits of weed from the vape pen. That works immediately every time. (According to Jeff Sessions, good people don't smoke marijuana. Whatever...) My mouth started getting sore yesterday but so far it's manageable and I can still eat. Haven't lost all of my hair yet but it looks pretty bad. Maybe another week til shave time? Big tumor on left side is less than half the size it was and can't feel the right side one at all. Something's working. I feel like I've now been able to crawl out of this deep dark pit of despair enough to at least peer over the edge and see daylight.",
      "MessageIndex": 443,
      "PostDate": "13/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jul 14, 2017 04:48PM - edited Jul 14, 2017 04:50PM by bareclaws misteyes, we will just have to keep each other company. I'd have been done with Taxol by now but had to take three breaks along the way. And the month off in the middle for BMX. This is not a marathon but an ultra-marathon. I always wanted to do one, but not like this.",
      "MessageIndex": 896,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 27, 2017 07:35AM - edited Jan 27, 2017 07:36AM by bareclaws NotVeryBrave and mistyeyes, I found that any type of weight-bearing exercise helps immensely with gas, reflux, burping, etc. Running, walking briskly, jumping rope, cardio, anything where you come down hard on your feet. It moves the gas out, one way or the other. Think slamming the cake pan down on the counter to get the gas bubbles to rise to the top and escape. Same concept! You may not feel like doing it, but it beats taking more drugs, in my opinion.",
      "MessageIndex": 531,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 28, 2017 07:27AM bareclaws wrote: I want to share a mouth treatment that I learned from a nurse practitioner at my treatment center and it has worked for me when nothing else did. I tried the baking soda/salt rinse and that did nothing for my \"burnt\" mouth tissues. What has helped? Aloe Vera juice. I don't swallow it, but you can. I rinse with it. Get a brand that's just pure juice, nothing else.",
      "MessageIndex": 538,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Feb 2, 2017 12:19PM - edited Feb 2, 2017 12:20PM by bareclaws https://www.verywell.com/fingernail-disorders-during-breast-cancer-chemotherapy-430259 This article says to avoid colored polish. But it doesn't say why.",
      "MessageIndex": 575,
      "PostDate": "02/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 7, 2017 05:28PM bareclaws wrote: Jezikah, kudos to you! For a great follow up but especially for your race plans. One year ago this month I ran my second marathon, and a third one in August. Itseems like decades ago. I hope I will be able to race again someday.",
      "MessageIndex": 846,
      "PostDate": "07/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 13, 2016 05:06AM bareclaws wrote: scgirl50, I feel your pain. Marginally better today. I'm about to go get more blood work to check for platelet drop as I had a 9-hour nosebleed yesterday. (In retrospect, I think it's likely that running had something to do with that.) Gas-X helped my gas pains at night issue a little, so you might try that. Also a heating pad over your abdomen. And middle of the night yoga moves in bed to help release trapped gas. Of course, no gassy foods for dinner-my hardest lesson to learn. As a vegetarian/pescatarian, I've depended on beans and legumes to anchor my menu. Not anymore. ",
      "MessageIndex": 173,
      "PostDate": "13/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 13, 2016 03:09PM bareclaws wrote: It appears my platelets dropped like a rock. I ended up at the hospital today getting a platelet transfusion and now am on prednisone to bring the counts up further. Back tomorrow for another blood draw. My right arm looks like an addict's. I have true admiration for you gals who work and/or take care of young children through chemo and treatment. You amaze me.",
      "MessageIndex": 179,
      "PostDate": "13/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 19, 2016 11:21AM bareclaws wrote: Jezikah, I have a hard time with plain water, too. Iced tea (unsweetened) goes down easier and also coconut water, something I would normally not drink. I guess it pays to try lots of different things.",
      "MessageIndex": 225,
      "PostDate": "19/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 20, 2016 06:55PM - edited Dec 20, 2016 06:55PM by bareclaws Scaredashell0, my mouth has been a mess since the December 5th chemo. Both dry and inflamed. I've used various mouthwashes and am manic about keeping my teeth and gums floaaed and brushed, using a soft toothbrush. I find it difficult to eat anything that's crunchy. Warm spices, like cinnamon and ginger, burn like fire. Sometimes feel the beginnings of a sore throat but it's never really turned into one. I thought this SE was supposed to wane but mine has not, so far.",
      "MessageIndex": 243,
      "PostDate": "20/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 3, 2017 07:25PM bareclaws wrote: I had no idea how raw and hurt the inside of my mouth would be. Mouthwash didn't begin to address the pain and problems with eating and drinking.Ginger, which everyone recommends for nausea, was impossible. And cinnamon and mint. I had to get toddler toothpaste. No one told me that! I've since learned that sucking on ice during infusion is supposed to help.",
      "MessageIndex": 354,
      "PostDate": "03/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 24, 2016 03:58PM bareclaws wrote: scaredashell07, I have to agree with SCGirl50, that it really isn't relevant what you eat or supplement with at this point. You can't put the genie back in the bottle. I was organic before organic was a thing. I was the healthiest 64 year old you can imagine, running three marathons and several halves this last year. With bilateral breast cancer. I'm not saying that it's not environmentally triggered, because I think It may well be, but those are larger issues not within our personal control-our water supply, poisons in the air we breathe, etc. I see a lot of crazy ideas here. Our bodies need a balance of protein, fats and carbs (yes, carbs! High quality, though, I'm not talking about sugar) to repair the damage done during chemo. Cutting one of those drastically is not going to be helpful and may harm. Personally, I find that I'm eating a lot more calories and not gaining weight at all because it's being used. Balancing all of these heavy hitting drugs is a tightrope act for the doctors. Add everyone's personal mix of OTC supplements to that and it becomes that much harder to keep everything in sync. My strategy is going be to eat well, keep exercising as much as possible, rest, and trust the doctors as much as my control freak self can",
      "MessageIndex": 274,
      "PostDate": "24/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 5, 2017 08:05AM bareclaws wrote: I also had runny eyes and nose with TCHP. Constant wiping away tears and ended up with conjunctivitis. So be careful! Starting over today with AC and hope that SE doesn't manifest itself",
      "MessageIndex": 375,
      "PostDate": "05/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 9, 2017 07:16PM bareclaws wrote: Can someone tell me the reason for painting nails dark during chemo? Is it just to disguise nails, themselves, turning dark? or is supposed to prevent them from turning dark? If so, how",
      "MessageIndex": 415,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 14, 2017 06:13AM - edited Jan 14, 2017 06:22AM by bareclaws Thank you StayMom, Ginkoleaf12 and Pamela 23! I haven't been able to lay my hands on the CBD oil yet, although I really, really want it, not for side effect relief but for possible benefit of preventing metastasis. It's absurd that this is now unavailable to us (at least in my state). It doesn't make you high. Big Pharma has a long reach. Forgot to mention that all my doctors and nurses (and even pharmacist) know that I'm using mj for nausea relief. While they can't recommend it, no one has said don't do it, and one nurse told me it does no harm to breast cancer patient. They know. But their hands are tied. I really don't care who knows. Come and arrest the small white-haired (soon to be bald) widow who has bilateral breast cancer and is on chemo. That will play well online.",
      "MessageIndex": 447,
      "PostDate": "14/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 20, 2017 06:33PM bareclaws wrote: scaredashell, my son-in-law is a cardiologist. He has patients that are suffering with the heart effects of adriamycin. He says keep moving, running, exercising, keep your heart muscles working.",
      "MessageIndex": 497,
      "PostDate": "20/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 31, 2017 05:16PM bareclaws wrote: I just looked and mine does have citric acid and mold inhibitor. Some brands have lots of other stuff in them, like sugar. Mine came from grocery store but it was in the supplement section, \"super foods\". Anyway, I just rinse with it and it does burn and tingle for a few seconds, but then it makes my mouth feel good, I start the day able to eat acidic fruits but by day's end can't do it. Like strawberries. And oranges. I'm learning that timing is key. Eating most of my calories by lunch time. I met with oncologist/hematologist today. She isn't my main dr, but the one I picked up when I had the ITP after first chemo. So I really get a \"two for one\" as they work together on my treatment, which they're still trying to figure out. Current thinking is that Herceptin may have caused the problem, But, I need Herceptin. So after AC is finished,they may give me a tiny dose of Herceptin alone and see what happens. If no relapse, then continue with Herceptin and Taxol. If Herceptin causes my ITP to come roaring back, I'll have to have my spleen removed. In any case, I'm glad to know there's a plan, and options for different scenarios,",
      "MessageIndex": 561,
      "PostDate": "31/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Feb 1, 2017 03:52AM - edited Feb 1, 2017 04:05AM by bareclaws Thank you, Pamela23 and Summer2016. While I often just feel like crawling under the blanket fort and staying there for the duration, I've come to the realization that I'm just too mean and nasty to do that. (The political climate has given me a target for my rage, other than my own personal situation. There are certainly others out there who have it far worse.) And I fight for my kids, who have had way too much to deal with in recent months. For some reason, they think they still need me. It helps me to focus on the now and plan only a little bit for the future. Thinking too far ahead has been counterproductive as things tend to change quickly. I'm going to run this morning, third time this week. That's huge. I've been such a slug for the last eight weeks and my weight is creeping up with the steroids and crazy eating patterns. Not being able to smell or taste much has made me eat MORE, not less. Nothing satisfies. But I am tapering the steroids so there's hope to get off of those eventually. Scared witless about Taxol coming up and the possible neuropathy SE. I should chill, but. Running. I would be devastated if that became impossible. (I'm a barefoot runner.) Also fingers. I supplement my income (and keep my brain working) with fiber/yarn creations. Need. My. Fingers. Those are the things left that make me happy, make me keep going. Jezikah, worried about your hand. Keep us posted on that.",
      "MessageIndex": 566,
      "PostDate": "01/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Feb 2, 2017 05:31AM bareclaws wrote: Would someone please point to a study or any science that supports dark nail polish preventing nail problems? Until then, I'm of the opinion that it just camouflages the SE of nails turning dark. I could be wrong. Please educate me.",
      "MessageIndex": 571,
      "PostDate": "02/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Feb 5, 2017 09:03AM bareclaws wrote: I feel the same about sucking on ice. Just the thought makes me me nauseous",
      "MessageIndex": 581,
      "PostDate": "05/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Feb 14, 2017 08:30AM - edited Feb 14, 2017 08:31AM by bareclaws I hear your concern about neuropathy. I have the same worries and took that to my onc a couple of weeks ago, since I will be starting the 12 week Taxol stint in about 6-8 weeks from now, along with Herceptin , which will continue for a year. Neuropathy seems to be a common SE. I told her that it can. Not. Happen. For reasons. We will definitely Ice but she also gave me prescription for a B complex vitamin called Metanx. I'm taking it now, in advance. You might look this up and ask about it. I will do anything to avoid neuropathy",
      "MessageIndex": 650,
      "PostDate": "14/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 24, 2017 08:59AM bareclaws wrote: Ginkoleaf, I have also been surprised at the continued numbness in my face. Weird. And yes, it seems almost everyone loses their eyelashes and eyebrows after chemo. I finally just plucked out the last few old ones yesterday but thankfully there are fine new ones coming in!",
      "MessageIndex": 789,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 4, 2016 06:30PM - edited Dec 4, 2016 06:30PM by bareclaws I'm starting Herceptin tomorrow but didn't have that test, only the echo",
      "MessageIndex": 84,
      "PostDate": "04/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 11, 2016 02:57PM bareclaws wrote: Day 6 after first chemo and I'm still feeling pretty bad, maybe worse. I had labs on Friday (day before yesterday) and they were all good. But my guts are a mess. Terrible gas pains at night, to the point that I'm afraid to eat anything. And I've lost weight this week, so am feeling weak and puny anyway. I did try to run a half marathon today that I had signed up for many months ago. 5.5 miles into it, I had to quit, which was a huge disappointment. My stomach was so queasy that I was afraid I'd end up puking by the side of the road. Much crying about that. I've never dropped out of a race before. Demoralized, hungry, achy, tired (little sleep).",
      "MessageIndex": 151,
      "PostDate": "11/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 12, 2016 05:55AM bareclaws wrote: Shell72, nothing brave about it, I agree. You mentioned nose sores. I got up today with a new side effect-bloody nose. I was plagued with them as a child but rarely had them as an adult. My sinuses are always the worst this time of year, with mountain cedar allergies, dry heated house. So let's add this up. Can't sleep, can't eat, cant run,can't breathe. WTF chemo?",
      "MessageIndex": 156,
      "PostDate": "12/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 18, 2016 07:12PM - edited Dec 18, 2016 07:25PM by bareclaws ILSunrise and Scaredashell, thanks for asking. This will be my 5th night in the hospital. They can't get my platelets to go up and stay up. The highest they've been so far is 47 but then drop back down the next morning. The steroids (solumedrol) make me feel like a zombie. Can't sleep, agitated, myriad of other side effects. My DIL brought me dinner tonight from a favorite Mediterranean chain, so that was a nice change of pace. The food here is not as healthy as what I would ordinarily eat and that's taking a toll. I have had no exercise in a week now. Haven't been outdoors. Drinking dandelion tea at the moment in an attempt to flush some of the extra fluid buildup from steroids. And of course holidays, so I don't feel like I'm getting the continuity of care that one could expect otherwise. The oncologist on call today told me that any drug can cause ITP. But of course they don't know which one caused mine. This compromises future treatment. As you can tell, I'm pretty discouraged. PS to all who worry about getting a port. I can't imagine how much worse all of this would be right now if I didn't have the port. While the onc lab didn't use it and my right arm suffered for it, the hospital does everything through the port and so far there's been a LOT of everything. You just never know what chemo is going to do to you, so get the port! ",
      "MessageIndex": 221,
      "PostDate": "18/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 21, 2016 12:33PM bareclaws wrote: Thanks for all the encouragement, ladies. Platelets up to 129 this morning and I am tapering the steroids, for which I'm exceedingly grateful. They have their own nasty SEs, the most concerning one (to me) being blurred vision. Hair starting to shed, even with cold capping. I knew it would, but my goal is to avoid permanent hair loss.",
      "MessageIndex": 251,
      "PostDate": "21/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 30, 2016 05:38PM bareclaws wrote: BCS2016, when I had Taxotere at first session, the chemo nurse just brought the ice packs for feet and hands, taping onto feet, instructing me to dig my fingertips into the ones for hands. It wasn't questioned or discussed, just do it. They do the same for Taxol. I think they know what works, But wish I had known to suck on ice to help with mouth sores, which is the same concept.",
      "MessageIndex": 325,
      "PostDate": "30/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 6, 2017 06:39PM - edited Jan 6, 2017 06:44PM by bareclaws Ginkoleaf12, yes to the belly bloat! I hate to catch sight of myself sideways in the mirror. And I'm on steroids to combat ITP, caused by the first chemo I had. Makes it worse. Dandelion tea helps. And probiotic foods probably help, too. Yogurt, kefir, sauerkraut, miso, to name a few.",
      "MessageIndex": 385,
      "PostDate": "06/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 27, 2017 04:46PM bareclaws wrote: Summer2016, good for you doing the dreadmill! I have to kick myself in the butt to get outside and walk/run, but feel like I'm coming back, very slowly. No, I'm nowhere near done. After a bad start, I had a month's delay, then switched to AC, of which I've only had two so far. So two more, then surgery, then Taxol for 12 weeks, then radiation. I still have a long road ahead of me.",
      "MessageIndex": 534,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 7, 2017 01:34PM bareclaws wrote: hey Dizzy, I'm another one that will have Herceptin weekly. Platelets issue.",
      "MessageIndex": 844,
      "PostDate": "07/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 4, 2016 06:21PM bareclaws wrote: Starting tomorrow, TCH + Perjeta. Using the Dignicap. Let's get this show on the road...",
      "MessageIndex": 83,
      "PostDate": "04/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 6, 2016 10:30AM - edited Dec 6, 2016 10:38AM by bareclaws I join OhHeyItsDeeDee in having just completed day one of chemo yesterday, pretty much the same regimen, although I am using Dignicap. It was 9 hours at the infusion center, mostly extra time for cap fitting, adjusting and the extra cooling after infusion and slow first time infusions to watch for reactions (none). So next time should go faster. I was really tired by the time it was over, came home, ate dinner, fell asleep in a chair watching Rachel Maddow and gave it up. The good thing is I DID sleep for at least a few hours last night. Physically, today I just feel sort of odd, off, if you will. Dry, fuzzy mouth and I am addressing that. No GI issues, but I consume a lot of probiotic foods already, like miso, sauerkraut, kombucha, kefir, etc. Adding more of that kind of thing is no problem for me. I'm going to try a three mile walk here in a few minutes. Tomorrow, after this damn Neulasta bomb goes off-a short run. I've gained four lbs from the steroids. AAGH!! Editing to add that I was petrified of having the port. Honestly, its not that big of a deal. I'm glad I got it. I'm scheduled for six major chemo infusions then Herceptin for a year and I can't imagine them digging around for a vein each time. (I have small ones.) Get the port.",
      "MessageIndex": 106,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 8, 2016 03:14PM bareclaws wrote: My chemo nurse told me that the third day after chemo would be the worst. She was right. I've felt like a wet dishrag all day. Last night was bad and it was my own fault for eating something way too spicy for the state of my intestines. Bad cramping. Even my dogs were worried. But it eased up by morning and I've just been really tired.",
      "MessageIndex": 128,
      "PostDate": "08/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 15, 2016 03:17PM bareclaws wrote: I had to come to ER last night with an all day bloody nose that had me freaked out. They admitted me, tested platelets yet again and I got my third platelet infusion in three days. Now they've decided I have ITP. Can't keep shoving platelets into me so now starting on more powerful steroids, followed by immunoglobulin to convince my body to stop killing off the platelets. And they need to figure out which drug did this. And fix it. Looks like a three day hospital stay.",
      "MessageIndex": 196,
      "PostDate": "15/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Dec 27, 2016 05:54AM bareclaws wrote: argynis, I'm on the same regimen as you (started Dec 5) and had the same issues. Turns out the cramping was from terrible gas, and I've found that walking helped relieve some of that. If you go out for a walk and find yourself burping the whole time, that's a good thing! Less trouble in the gut later that night. Also, probiotic anything, from sauerkraut and pickles to probiotic drinks like kefir and yogurt. Replace the good gut bacteria.",
      "MessageIndex": 291,
      "PostDate": "27/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 10, 2017 04:56AM bareclaws wrote: argynis, thanks for reply. I thought that was the case. My center does cold packs for feet and hands during a Taxol (and also Taxotere). No one mentioned ice for mouth when I had theTaxotere, even though I was sitting under a cold cap and had ice packs on extremities. My mouth was Destroyed. When I started over a month later with AC, I sucked on ice for the Adriamycin push. So far, so good. No mouth sores or pain.",
      "MessageIndex": 417,
      "PostDate": "10/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 18, 2017 11:25AM bareclaws wrote: I, too, have been plagued with fluid retention, which I had attributed to steroids but it could be Taxol. Manically eating all the high potassium foods: greens, mushrooms, potatoes, acorn squash, tomatoes, etc.. and no addedsalt, which I'm gettting used to. This all helps but it seems to take a couple of daysnto get sorted out.",
      "MessageIndex": 854,
      "PostDate": "18/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jul 14, 2017 12:55PM bareclaws wrote: am I the only one here still in chemo? One more Taxol to go, then Herceptin weekly for rest of the year, and 7 weeks radiation, then 10 years of Femara.",
      "MessageIndex": 894,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Aug 17, 2017 07:36AM bareclaws wrote: JoaniePA, thanks for letting me know that. Did you have chemotherapy? I read on another site that a study is about to be done on chemo-related hearing loss and tinnitus. Apparently it's a thing. Great. I'm not looking for trouble, but it seems to find me anyway.",
      "MessageIndex": 150,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Aug 12, 2017 08:00AM bareclaws wrote: I'm asking this here, even though my radiation just started this week, hoping that some of you who have finished will enlighten me. I've had exactly two sessions. Both days, within a few hours, I've had an episode of tinnitus. This is not something that I have usually had, maybe once or twice in my life. Is it related to radiation? Also, feeling a new sensation in my leg, below the knee, on the radiation side. Like burning in the vein, but not painful. This is also kind of scary. I run a lot, so think my leg muscles and veins are in pretty good shape. What the heck",
      "MessageIndex": 127,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jun 6, 2018 06:30PM bareclaws wrote: I also had radiation (25) after double MX and both neoadjuvant and adjuvant chemo. No positive nodes. But a large tumor, two types of cancer in the left breast, not a complete response to chemo. Having the radiation was insurance. I didn’t have reconstruction, making radiation less complicated, easier to tolerate. Other than having to show up five days a week, it was no big deal.",
      "MessageIndex": 4,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864661",
      "Title": "Radiation after Mastectomy Walden1 Walden1"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jun 7, 2018 01:00PM bareclaws wrote: No lymphedema here. I did experience some hand swelling one day when I was hiking at altitude, which scared me silly. Even ”normal” people get that in the mountains. I bought trekking poles to use from that point on. That’s one way to keep arms elevated while walking/hiking.",
      "MessageIndex": 6,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864661",
      "Title": "Radiation after Mastectomy Walden1 Walden1"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 3, 2017 09:45AM bareclaws wrote: What I'm getting from some recent posts is that it's not OK to grieve the loss of hair, which may or may not grow back, and may never look the same as before. Well, I'm sorry, but my hair was a much bigger part of my identity than my breasts ever were. I am living flat and am just fine with that. No hair? Not fine with that. Wigs are not an option. I got two and hate them both. Covering with a scarf is hot and sweaty. I hate it. I may have my life, but if I hide in the house from the humiliation and embarrassment for the rest of my life, what's it worth? So yeah, I do need an attitude adjustment, but there also needs to be a recognition that this is a big effing deal and it has affected my life, and possibly future, far more severely than the loss of my breasts.",
      "MessageIndex": 25101,
      "PostDate": "03/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Mar 24, 2017 11:33AM bareclaws wrote: Thanks for that eyelash info. Mine are about 3/16\" long today, but an almost invisible color. Maybe the next batch will be darker? I hate wearing mascara. I have (had) naturally white hair but my eyelashesand brows were brown. ",
      "MessageIndex": 25055,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 3, 2017 10:34AM bareclaws wrote: Dianarose, thanks for your reply. \" ...embarrassed or ashamed. I don't want to be stared at or have anyone ask questions.\" For me, these are the same thing.",
      "MessageIndex": 25103,
      "PostDate": "03/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 9, 2017 07:37PM bareclaws wrote: Coachvicky, so maybe the higher public hair will meet the new hair on our chins in the middle and we'll have hair on our chests",
      "MessageIndex": 25169,
      "PostDate": "09/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "May 31, 2017 06:26PM bareclaws wrote: I know I could still lose it again, but so far, so good. It feels strong and I brush it and massage my scalp vigorously.",
      "MessageIndex": 25388,
      "PostDate": "31/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jun 30, 2017 10:17AM - edited Jun 30, 2017 10:18AM by bareclaws Gorgeous!",
      "MessageIndex": 25485,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jun 30, 2017 03:24PM bareclaws wrote: It's cute. Suits you well.",
      "MessageIndex": 25488,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Sep 29, 2017 09:51PM - edited Sep 29, 2017 09:52PM by bareclaws I got my first professional cut since BC. Finished hard chemo in July, still on Herceptin. Top is slow growing, but the sides and back have been buzzed several times. I love my new fauxhawk. My stylist was able to minimize the curl with the hairdryer and also clay product, which I promptly bought.  ",
      "MessageIndex": 25757,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 14, 2017 08:10PM bareclaws wrote: seq24, I hear you! I was happy with my body, and it's never going to be the same. I can never forget that the changes were unexpected, unplanned, unwanted. But I am Trying to look at it as an extreme makeover. Hair will definitely be different, body, too. But I can embrace a crazy spiky hairstyle, and work on a boy-silhouette body. Wardrobe is going to be different now, which is kind of fun. I don't know the answers. Just trying to muddle through it.",
      "MessageIndex": 25206,
      "PostDate": "14/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Sep 10, 2017 05:31PM bareclaws wrote: I lost mine at beginning of AC, and they started growing back immediately. They were all in nicely, and I went through one month between AC and Taxol for surgery. Lost eyelashes and eyebrows a second time about six weeks into Taxol. I'm seven weeks post Taxol and they're holding on and growing. My head hair held on and grew throughout Taxol, after losing it early during AC.",
      "MessageIndex": 25682,
      "PostDate": "10/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 2, 2017 08:38PM bareclaws wrote: seq24, I totally agree. I feel the same as you. I don't want to live without my hair",
      "MessageIndex": 25091,
      "PostDate": "02/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 6, 2017 07:55PM bareclaws wrote: serenity, I've had the same question about their wigs! And how does she get all that natural hair under a short wig?",
      "MessageIndex": 25147,
      "PostDate": "06/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "May 31, 2017 04:32PM - edited May 31, 2017 04:35PM by bareclaws I lost my hair with AC but it immediately started growing again, as did eyebrows and eyelashes. Now I'm on Taxol (6 so far) and hair has continued to grow, albeit slowly. The only supplement I take is Metanx, to head off neuropathy, but it probably helps hair growth as well. I don't take biotin supplements but could be the poster child for biotin rich foods. That's my normal diet. I've also continued to use my pre BC shampoo, Theraneem, as it gave me the healthiest scalp I've ever had, after a bad bout of scalp psoriasis. I ditched th scarf this last weekend. And buzzed some straggly stuff off of my neck. Oh yeah, what I have now is exactly same color, same texture as what I had before. I was expecting something different from all I've read here, but no, it's the same. ",
      "MessageIndex": 25385,
      "PostDate": "31/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Sep 30, 2017 02:22AM bareclaws wrote: Thank you! I’m grateful to have hair. No special potions. I kept using my regular shampoo throughout: Theraneem Scalp Therapy, even when I had no hair at all, just an itchy, irritated scalp. Lots of scalp massage and I used a rubbery dog shampoo brush on the early growth. The stylist was wonderful. I let her do what she wanted and tried not to be alarmed at the hair that was all over the floor. I think I’ve convinced her to move to Denver with me.",
      "MessageIndex": 25759,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Sep 30, 2017 01:30PM bareclaws wrote: LEGOmaster, it’s gorgeous! I have a matching radiation \"burn\". Thank you all for nice comments CoachVicky, yes, my hair is and was white. Started that at age 16. I haven’t dyed it since high school.",
      "MessageIndex": 25767,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jul 24, 2017 12:47PM bareclaws wrote: My RO recommends green tea as a spray, 4 x a day. Twotea bags per 1/4 cup boiling water, steeped for at least one hour.",
      "MessageIndex": 17,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Sep 8, 2017 12:01PM bareclaws wrote: VLH, yes, it does sounds like we're in the same system, Texas Oncology. I'm in the Grapevine location. I just pull off tee shirt and spray the green tea, air dry, it will stain clothing if you're not careful. (The tannins in tea are known to natural dyers as a great dye assist.) I had same concerns as you about seeing how the beams were missing my heart and lungs.",
      "MessageIndex": 376,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jul 31, 2017 07:16PM bareclaws wrote: mmb, reading about your treatment distance so far from home humbles me. I complain about everything, but am only ten minutes from the cancer center. I even refused to go to the more well-known and maybe more cutting edge facility in the city because I just couldn't fathom driving back and forth through city traffic, especially when it came to the radiation part of treatment. At least I have choices. I know many of you probably don't. But then again, I don't have anyone to drive me.",
      "MessageIndex": 57,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Aug 11, 2017 01:31PM - edited Aug 12, 2017 08:46AM by bareclaws I got four more tattoo dots today (six total), due to my complaining about the Sharpie road map on my chest. Not a great fashion statement when wearing a tank top. In fact, my last words to breast surgeon before my BMX, were \"tank top\". No one notices my lack of breasts, but they wonder if my grandkids have been drawing on my chest. Oops, seven dots. I have so many moles and freckles that it's hard to tell. ",
      "MessageIndex": 140,
      "PostDate": "11/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Sep 7, 2017 10:08PM bareclaws wrote: Triamcinalone 1% cream after treatment. Green tea spray, if I think of it, which I don't often do. RO also recommended another cream, from Japan, to use at night, but it's greasy and I stopped using it. ",
      "MessageIndex": 361,
      "PostDate": "07/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jul 23, 2017 12:59AM bareclaws wrote: I have mapping next week, starting rads in about two weeks. Last Taxol was yesterday. I will continue with weekly Herceptin at least until end of this year. I had a BMX in March, with clear margins and clear nodes but due to three types of breast cancer involving both breasts, a \"suspicious\" but inaccessible lymph node behind the breast bone, large invasivetumor and compromised chemo at the beginning of treatment, I still get five weeks of rads. Bummer.",
      "MessageIndex": 6,
      "PostDate": "23/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jul 23, 2017 01:29PM bareclaws wrote: Rads only on the left side. Right breast was DCIS only. Left was IDC and mucinous.",
      "MessageIndex": 8,
      "PostDate": "23/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Aug 11, 2017 06:33AM bareclaws wrote: LeesaD, I'm so happy to hear that you're still running through rads! I am up at 4:30 to get in a run in the dark before I head out to my own rad and Herceptin treatments this morning. I may not be able to do anything else the rest of the day, but I WILL do that.",
      "MessageIndex": 136,
      "PostDate": "11/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Sep 7, 2017 07:18PM - edited Sep 7, 2017 07:19PM by bareclaws I've done 20 of 28 rad sessions and just today started to feel a little bit of localized itching. I had a BMX, no reconstruction, but still get the rads. Lucky me. No other side effects related to rads and my energy is slowly returning since chemo.",
      "MessageIndex": 359,
      "PostDate": "07/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Sep 14, 2017 02:59PM - edited Sep 14, 2017 03:00PM by bareclaws I finished today, too. After reading all the \"hair on fire\" posts in some other places here, I was quite anxious at thestart , but it turned out to be a nothing burger. 25 sessions, no bolus, no boosts. I had a BMX with no reconstruction in March, so I'm sure that simplified matters. My skin is red in the area of the electron radiation (I had three different fields) but no pain or skin break down. The only thing I used with some regularity was the prescription steroid cream, triamcinolone 1%.",
      "MessageIndex": 415,
      "PostDate": "14/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857111",
      "Title": "Starting Radiation August 2017 Legomaster225 2017sanam"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 31, 2017 08:49PM - edited Jan 31, 2017 08:53PM by bareclaws After first round TCHP, I ended up with acute ITP (very low platelets, 2 in my case) that wouldn't come up with platelet infusions (3x). Landed in hospital for five days and two IG infusions. The two oncologists ( one is also a hematologist)gave me a month off and then switched me to AC for now. After that's done,,they're going to try Herceptin alone to see if that was the culprit. Because I need the Herceptin. In the meantime, lots of blood labs to watch platelet count. It was scary for awhile. If your nose starts bleeding and won't stop, go to the ER. But that is rare.",
      "MessageIndex": 8,
      "PostDate": "31/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/852251",
      "Title": "HELP Low Platelets count HoneyBeaw Leonarsu"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Aug 5, 2017 12:38PM bareclaws wrote: I had BMX, no reconstruction and it was no big deal, compared to chemo. You may not have pain or need pain killers at all after you leave the hospital. I didn't. DO the exercises. My BS had me doing them the very next day. It was hard the first day but worth the effort to quickly regain full range of motion. My biggest problem was dealing with the compression bandage, which I could not wait to ditch, along with the drains. You should have no trouble caring for your little dog. He will be a comfort for you. Oh, after the bandages came off, I just wore a cotton camisole for a few weeks.",
      "MessageIndex": 14,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857555",
      "Title": "Caring for yourself after bilateral mastecomy georgia67 KCMC"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 5, 2017 01:58PM - edited Jan 5, 2017 02:07PM by bareclaws Serenity now, I don't think there is a \"usual\". It depends on which drugs/protocol you are getting. I started with TCHP, supposed to be every three weeks, but due to bad reaction, I'm now doing AC every two weeks x 4, then Taxol every week x 12. Started the AC today and it went swimmingly. Of course, I don't know what the next week will bring.  Ang905, thanks for reminding me of the water. I just got up and retrieved a bottle, forcing myself to drink it. I sucked on ice during the Adriamycin, but it was only a 7-minute \"push\", so no big deal. Hope it helps. I'm only now starting to get my taste buds back from the first chemo a month ago (TCHP). I go back in tomorrow for anti-nausea fluids and the Neulasta shot. Hated wearing it on-body. But I had no pain associated with it. Hear a lot of people talking about bone pain, but not everyone gets it. I took one Claritin last time, but think I'll skip it this time around.",
      "MessageIndex": 134,
      "PostDate": "05/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851197",
      "Title": "Starting Chemo January 2017 M0221 ML1209"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 8, 2017 06:15AM bareclaws wrote: Today is third day after first AC. I have found it much easier to weather (so far) than the TCHP that I started with in December. (I felt good enough yesterday to go car shopping. My chemo/cancer consolation prize?) I still have most of my hair, though much thinner from the TCHP and hope to get stuff done before it all comes off and I retreat into my cave. I started out with using the Dignicap (cold cap), but they booted me out of the trial program when I had to switch to AC. Anyway, bloating from chemo, steroids, Neulasta. I hate that. Measured my waist yesterday and it was 2\" over my normal measurement. I should be grateful that I have no pain from Neulasta. Even without Claritin. Lilo and Positive2strong, I am hearing you about your husbands. My husband of 44 years died unexpectedly in August, and I am so glad he's not here for this. It would have made it harder in many ways, although it would be also good to have someone to share this burden with. As it is, I dump it on my kids and their spouses. They willingly accept that but so much in their plates too with the death of their dad. All we can do is put one foot in front of the other and try to move forward. I have nothing but admiration for those of you who are working and taking care of children through this. Trying to remind myself that my life is easy by comparison. Stay strong",
      "MessageIndex": 172,
      "PostDate": "08/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851197",
      "Title": "Starting Chemo January 2017 M0221 ML1209"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Feb 3, 2017 05:00AM - edited Feb 3, 2017 05:02AM by bareclaws MexicoHeather, shout out to another Pfaff lover! I think I have three here right now, including the one my mom bought in 1951. Trying to get back to sewing, too. It's a good distraction. Third AC today. Looking forward to having that in my rear view mirror. Ports are a good thing. I can't imagine dealing with any sort of complication without having had the port. It saved me.",
      "MessageIndex": 305,
      "PostDate": "03/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851197",
      "Title": "Starting Chemo January 2017 M0221 ML1209"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 20, 2017 04:55AM bareclaws wrote: jadisn, I was told the same about nails and Taxol, not AC, and my center is very proactive about that stuff. I'm sorry you got a nurse with attitude. There are a few out there and you do not have to take it. Ask to talk to her supervisor. Be assertive, because if not now, then when? (I'm getting my second AC this morning.)",
      "MessageIndex": 251,
      "PostDate": "20/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851197",
      "Title": "Starting Chemo January 2017 M0221 ML1209"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 17, 2017 01:45PM bareclaws wrote: MexicoHeather, did you ice fingers and toes during Taxol infusions? Also, what does mild neuropathy feel like?",
      "MessageIndex": 354,
      "PostDate": "17/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851197",
      "Title": "Starting Chemo January 2017 M0221 ML1209"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 6, 2017 06:36AM bareclaws wrote: I sincerely hope people don't abandon this forum for Facebook. For selfish reasons. I don't \"Facebook\" and would hate to lose touch with you all",
      "MessageIndex": 146,
      "PostDate": "06/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851197",
      "Title": "Starting Chemo January 2017 M0221 ML1209"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 8, 2017 06:27AM bareclaws wrote: Does anyone here suddenly find the taste of their regular water to be intolerable? I don't know if that's a thing with AC but it was with TCHP, for me. Just thought I'd mention that I discovered a couple of solutions. One is to add a splash of tart cherry juice or some other juice to the water, or even make ice cubes with it. The other is to try different brands of bottled water. I found that the high PH waters taste better. Worth the expense if it gets more fluids into me.",
      "MessageIndex": 173,
      "PostDate": "08/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851197",
      "Title": "Starting Chemo January 2017 M0221 ML1209"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Apr 18, 2017 10:16AM bareclaws wrote: I just started Herceptin three weeks ago and they added the Taxol last week. I'm hyper-vigilant about the neuropathy and will scream bloody murder to my MO if I have signs of it. She prescribed Metanx about six weeks ago for me to take leading up to this and after as well. It's a souped up B complex that is often used for diabetic neuropathy (I don't have diabetes). Anyway, I'm icing as well. And getting as much feet on the ground exercise as I can, 4-5 days a week of walking/running, 3-5 miles each.",
      "MessageIndex": 359,
      "PostDate": "18/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851197",
      "Title": "Starting Chemo January 2017 M0221 ML1209"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 1, 2017 02:53PM bareclaws wrote: Please add me to the January list. I did have one treatment of TCHP on December 5th, but due to bad reaction and developing ITP from it, my Drs have changed the protocol to AC +T, starting Jan 4th. So I feel like I'm sort of starting over. I'm glad I had that one, though, as I have bilateral BC and they are entirely different. A mixed bag to treat, so maybe a mixed bag of treatments will work out for the best. I still have most of my hair, four weeks out, as I was in a Dignicap program. They justbooted me out of that, because it was a trial program and the hair retention results for AC are not as good and they only want good results. I just ordered a bunch of wigs to try, hoping to find something similar to my own hair. Not so easy, I'm discovering. I'm too old to rock the bald, though I admire women who do it. ",
      "MessageIndex": 94,
      "PostDate": "01/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851197",
      "Title": "Starting Chemo January 2017 M0221 ML1209"
    },
    {
      "AuthorID": "bareclaws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242778/profile",
      "Content": "Jan 19, 2017 03:17PM bareclaws wrote: Hydeparkgal, I had similar experience with TCHP. I only had it once and ended up in the hospital for five days. Started over with AC (second one tomorrow) and it was much easier to tolerate. I know my onc would have preferred me to do the TCHP for the triple positive left side, but if it kills the patient, what's the benefit? But trying to find something positive here-my tumors shrank dramatically after that one TCHP. Also, you do learn a little bit how to cope and deal with the side effects as you go along.",
      "MessageIndex": 245,
      "PostDate": "19/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851197",
      "Title": "Starting Chemo January 2017 M0221 ML1209"
    }
  ]
}