{
  "AuthorID": "barsco1963",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
  "Posts": [
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 28, 2012 02:52PM barsco1963 wrote: Anne - Giving up a job that you obviously like is a tough decision to make. Is there any chance that another sub can step in when the current one is done? Any possibility of short term disability until you have healed a bit more? Getting up at 5:30 would certainly take some reconditioning. I am assuming that it would be for the month of June only that you would need to do so. (I'm assuming school is done at the end of June) But that could make for a very long month for you. If you were to quit your job, is there any volunteer opportunities nearby that could help fill your days? Maybe at a seniors home, the library, the school etc.",
      "MessageIndex": 1,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786610",
      "Title": "Working for a living....taking what they're giving... CoolBreeze Linda1966"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 11, 2012 07:19AM barsco1963 wrote: Awsome news Katie!!!  I love good news - very encouraging. Thank you for sharing.",
      "MessageIndex": 61,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780765",
      "Title": "Good news from me katie31 rosasmommy"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 26, 2013 04:34AM barsco1963 wrote: LOL - not sure what I was expecting but that wasn't it. Thanks for the smile/chuckle this morning!",
      "MessageIndex": 6,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806712",
      "Title": "OT - Just Sayin' redwolf8812 barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 13, 2012 04:59AM barsco1963 wrote: Sooooo happy to hear your news soleil!! I can hear the joy in your post - absolutely wonderful!!!",
      "MessageIndex": 39,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789002",
      "Title": "Happy Tears Falling Falling! soleil505 Brendatrue"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 19, 2013 05:55AM - edited May 19, 2013 05:58AM by barsco1963 suecolo2 - nausea is sometimes difficult to deal with. I have been dealing with it for well over a year now. I have tried a few anit-nausea meds. Some didn't work for me and some did for a while only to give way once more to the nausea. I too have lost a lot of weight but am now trying another med that is doing ok. Not a complete reprieve but it does help. It might be worth it to talk it over with your dr to see if there is another med which you could try. I also drink a lot of ginger tea and that seems to settle things quite a bit. I just peel and cut up a small bit of ginger root and add it to boiling water.  I sure hope you find something to help you out. (edited) Just a note to say that I am still on tamoxifen which is what I believe is causing my nausea. However, not willing to give up the tamo as it is doing wonders at keeping me stable.",
      "MessageIndex": 3,
      "PostDate": "19/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804855",
      "Title": "Nausea after chemo (how long) sueco SPAMgirl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 20, 2013 12:58AM barsco1963 wrote: I love weddings! What a great idea -  Enjoy your sons big day - hope you have lots of energy for that first dance! (do they still do that?)",
      "MessageIndex": 6,
      "PostDate": "20/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803499",
      "Title": "Decadron bhd1 Leah_S"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 19, 2014 02:28PM barsco1963 wrote: And true to human nature, we come together to support, encourage and help one another through the darkest of day so that we may appreciate the brighter days so much more.",
      "MessageIndex": 2,
      "PostDate": "19/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820316",
      "Title": "We are our own Natural Disaster Mzmerz critterzmom"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 3, 2013 05:16PM barsco1963 wrote: Marcia - This site has been a godsend for many women and men. I hope that your appt was informative for you today and that you are a bit more knowledgeable about what your next step may be. Keep us posted on how you are doing.",
      "MessageIndex": 3,
      "PostDate": "03/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815273",
      "Title": "Glad to know this site exists rabbitvelvet rabbitvelvet"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 3, 2013 05:03AM barsco1963 wrote: Curveball - I was dx with numerous liver mets from day one, therefore not a candidate for surgery. I have been on tamo and zoladex injections from the beginning and that combo has shrunk the mets down to where only a couple of them are visible on scans these days. Those that remain have been stable for months now.   Anko - I too had a very painful biopsy (no freezing or sedation) that was inconclusive. So onc decided another was in order - I  requested that it be done at a different hospital due to bad experience. Thankfully that was an option for me. I was sedated for the 2nd one and felt absolutely nothing. Was like night and day - amazing.",
      "MessageIndex": 10,
      "PostDate": "03/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802665",
      "Title": "Who had mets in liver only or liver first? curveball curveball"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 30, 2013 12:14PM barsco1963 wrote: survivor - I also have experienced a weight loss and nausea which I didn't seem to have any reason for. I was pretty sure from the beginning that it was the tamo that was causing nausea. However, onc would not agree with me until lately after testing for everything else under the sun. I tried various anti nausea drugs to no avail. I am now on an anti depressant along with an anti nausea which seem to be helping. The nausea is not as prominent as it was. Still having some digestive issues but things are much better. I didn't think that it was a psychological issue but, am now wondering about that. I was at one point afraid to eat anything with sugar, or dairy or soy and wasn't sure what I could eat....so I ate little. Once I realized that I needed to get nutrition of some sort into me, I found that smoothies went down easily - just mixed a bit of greek yogurt for protein, some milk, and fruit/fruit juice. Also soups, oatmeal & ice cream/frozen yogurt, rice, pasta. Nutritionist advised to stay away from the Ensure and Boost shakes due to the soy content. There is a Boost fruit drink that she suggested. Take it one day at a time and try not to think about your weight, but rather about eating healthy so that your body has the energy to deal with whatever comes along. Good luck - let us know how you are making out.",
      "MessageIndex": 6,
      "PostDate": "30/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799651",
      "Title": "Help, having trouble eating. Survivor46 kayrnic"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 29, 2012 04:36AM barsco1963 wrote: kita - Crossing fingers, toes and anything else I can that you get good news on the biopsy and trial! Keep a tight grip on that towel. It's all yours and no one can take it from you. ((hugs)) and best wishes to you.",
      "MessageIndex": 52,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793997",
      "Title": "tumors showing, chemo not working, turning 25 kita barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 20, 2013 06:18PM barsco1963 wrote: Sending you (hugs) and warm wishes.",
      "MessageIndex": 46,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800671",
      "Title": "the blankets are officially pulled over my head lukejessesmom"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 22, 2012 05:44AM barsco1963 wrote: Stella - Try to keep the panic mode on hold. Sounds like your dr likes to keep on top of things - my dr is similar. She likes to refer, order tests etc with any new symptom or concern. Can be worriesome, but I would rather get things checked out than let them linger and cause further worries. Hang in there - as Alesta mentioned - we are here for you no matter what.",
      "MessageIndex": 11,
      "PostDate": "22/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789462",
      "Title": "If it's not ine thing it's always something else stellaratovsky stellaratovsky"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 21, 2014 11:11PM barsco1963 wrote: Ugh! It gets worse every year. Why can't people do something that will actually educate and generate funds/donations for research?? Perhaps we should don t-shirts for crashing the party just in case they confuse us with the \"besties\". ",
      "MessageIndex": 2,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823831",
      "Title": "First Puketober sitings! surfdreams sas-schatzi"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 13, 2013 06:17PM barsco1963 wrote: Blossoms - sending you healing vibes and lots of ((hugs)). You are going through a very scary time and your fears are very real. We all have our pity partys - we can't hold it together all the time. We need to cry, yell, scream and vent. Then we carry on. If you wear a shirt or jacket with big pockets we can all jump in and accompany you to your appointments. No one here has to go it alone. We are with you all the way. Hang in there - hoping that the rads will get the chest tumor under control for you. Keep us posted.",
      "MessageIndex": 11,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800435",
      "Title": "I am really really scared and hoping for support.... Blossoms Blossoms"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 4, 2014 02:04PM barsco1963 wrote: Belinda - hope that swollen node is due to infection and not cancer. Try to hang in there and keep us posted on the results. We're all here for you.",
      "MessageIndex": 3,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825978",
      "Title": "terrified of postive metastatic cancer result belindarev barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 3, 2013 05:28PM barsco1963 wrote: We all have our pity party's now and then. How can we not when there is so much to deal with. Thank goodness that the pain was not cancer related, but that doesn't make it any more bearable. When you hurt, you hurt - no matter what the cause. Sending you healing thoughts and ((hugs)) - I hope each day has you feeling more comfortable.",
      "MessageIndex": 6,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/812186",
      "Title": "Tough Two Weeks kayrnic listee"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 12, 2014 12:43PM barsco1963 wrote: I like to refer to such wonderful people as Earth Angels. Hope her nose is right on the money!",
      "MessageIndex": 10,
      "PostDate": "12/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823604",
      "Title": "My Chaplain sueopp justjudie"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 20, 2013 05:33PM barsco1963 wrote: Below is a couple of links to articles that I came across - the first one in part addresses \"forcing optimism\" and the second one offers ways in which you can help oneself to get through those days when you are feeling down.   http://www.psychologytoday.com/blog/pink-ribbon-blues/201302/every-silver-lining-has-cloud http://www.psychologytoday.com/blog/turning-straw-gold/201302/when-youre-down-and-out-how-get-through-the-bad-days",
      "MessageIndex": 57,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 29, 2013 06:39PM barsco1963 wrote: rinneron - I really like your signature line about positivity. So true.",
      "MessageIndex": 110,
      "PostDate": "29/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 7, 2013 03:45PM barsco1963 wrote: BB - ((hugs)) to you. The ups and downs really take their toll huh? Sure sucks that X didn't stick by you. Hoping that the Femara turns out to be a better fit. So sorry that your heart has also taken a hit - life is neither fair nor predictable. Wishing you brighter days ahead. xo",
      "MessageIndex": 119,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 26, 2013 05:03AM barsco1963 wrote: BB - Glad to hear that Reggie is hanging out with you again. He and Stableboy are some decent dude to hang with! Fear is a constant with us all I think, but it is good to be able to push it to the back burner if you can. A baby bunny sounds like it might be just the thing to get your spirits back up.",
      "MessageIndex": 113,
      "PostDate": "26/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 18, 2013 06:13AM barsco1963 wrote: I am a positive person by nature and that is one thing that cancer has not taken from me and I hope that it never does. However, I do have days when I think about the down side of everything - it is scary and we all have every right to feel sad, depressed, and angry at times. Just like everyone else in the world. Some people just never \"get it\". One coworker insisted on telling me that I \"looked to good to have cancer\" on more than one occasion. I finallly told her that the ugly was \"all on the inside\". She has asked more than once how long tx will be. And the topper? At a friend's b-day party the conversation came around to bc and after some discussion, she said \"You're not going to die.\" I should have asked her to put that in writing but I didn't want to ruin the party mood so I just smiled and moved on. Cancer does not give anyone reason to be happy, grateful, or blessed. It is not a gift. But we do have to remember that we are more than just a \"cancer patient\" There are other things in our lives that we can be thankful for. And that is what I try to concentrate on. BB - I hope that the Xeloda is what it takes to knock back the progression and that Reggie has just stepped out for a short walk. Wishing you brighter days ahead. ((hugs))",
      "MessageIndex": 9,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 16, 2013 06:29PM barsco1963 wrote: Found this poster on fb - thought it fit into this discussion quite well. Sometimes we need to \"just be\" ",
      "MessageIndex": 75,
      "PostDate": "16/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 29, 2013 05:48PM barsco1963 wrote: susan - great article. Kind of supports the \"Hope for the best - Expect the worst\" thinking. It makes sense that being pessimistic or a \"realist\" like Mrs M helps one to be prepared for the outcome. BB - Happy Birthday! I was never really one to worry about b-days and how old I was. Now I tell people that I am more than happy to be getting older! It's better than the alternative right? I can't believe the soy story. Sometimes public servers just need to accept that when you ask for something, it is up to them to provide it without prodding or pushing. Sometimes it takes a straight up, in their face response such as \"I am positive - positive that I have stage IV cancer and it will kill me eventually.\" to make them stop and listen. Perhaps instead of the fuzzy pink mascot costume, you could make up a \"Positively Pink Poker\" for negative reinforcement. Every time someone gives you advice or tells you that you need to \"just be more positive\", you could give em a big old poke in the ribs (or elsewhere). Maybe that would get the message across? lol I hope that this coming week will provide you with some relief from the pain and fatigue that you are experiencing.",
      "MessageIndex": 83,
      "PostDate": "29/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 28, 2013 05:39AM barsco1963 wrote: Awesome! I am sure that stable boy understands your preference to Reggie.",
      "MessageIndex": 104,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 31, 2013 05:45AM barsco1963 wrote: Fitz - Your comment \"Shit happens, wipe off your shoes and walk on\" gave me a chuckle. thx. I may use that some day.",
      "MessageIndex": 89,
      "PostDate": "31/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 4, 2013 02:33PM barsco1963 wrote: Excellent news Amy!",
      "MessageIndex": 5,
      "PostDate": "04/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/812260",
      "Title": "Good Scan Results! AmyJM cmhartley"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 18, 2013 05:48PM barsco1963 wrote: Hi everyone. I have been a member for a while now and really find that these boards are a great treasure. I am 49 years old and was dx stage IV (liver mets) from the start. I was so naive in the beginning but have learned a great deal from everyone here. I am married (21 yrs now) to a man who loves me with all of his heart, and we have a 19 yr old son who is our pride and joy. I have a great support network in my family. With 5 sisters and 2 brothers, there isn't often a day that goes by without some sort of communication. The mets have mostly been taken care of with tamoxifen and zoladex. Had 8 to start with and now only measuring 2 on the scans. They have been stable for 6 mos or so now. I look forward to getting to know more and more of you and hanging out for many years to come. Barb",
      "MessageIndex": 144,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798841",
      "Title": "Roll Call 2013 LilSchatzie reader123"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 18, 2014 12:41PM barsco1963 wrote: So glad you found a solution to feeling so terrible. Thank you for sharing.",
      "MessageIndex": 4,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822053",
      "Title": "Interesting steroid use raro Jill49"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 15, 2012 05:47AM barsco1963 wrote: Great to hear your good news Apple! I do hope that you are able to get something \"down the hatch\" and regain some of those lost pounds. Best of luck with your upcoming scans.",
      "MessageIndex": 18,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787468",
      "Title": "onc. news apple ma111"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 7, 2013 05:17PM barsco1963 wrote: Leah - sorry that you are feeling down. Some days the funk just won't leave us alone. I hope that tomorrow brings you brighter thoughts and happier times. ((hugs))",
      "MessageIndex": 5,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809018",
      "Title": "Feeling down Leah_S chrissyb"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 7, 2014 01:45PM barsco1963 wrote: Great post! I was raised to appreciate the little things in life and to treat others with respect and kindness. I suppose a cancer dx might have enhanced my love for life somewhat. It is never a bad idea to try to see things through another's eyes.",
      "MessageIndex": 3,
      "PostDate": "07/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/826081",
      "Title": "Through Different Eyes Freedomchild82 barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 18, 2011 09:29AM barsco1963 wrote: I am a 47 yr old whose original diagnosis (2011) was bc with liver mets. I have learned a lot through the web especially www.mbcn.org and www.metavivor.org both sites are great references. Metastatic breast cancer is scary but it is important to stay positive and strong. Be your own advocate and don't be afraid to ask questions. I don't think anyone can tell you life expectancy. I do know that there are women with metstatic bc that have lived for 15 yrs or more. My treatment is different than I had expected (chemo, then radiation). I am taking Tamoxifen daily and a monthly injection of Zoladex. Every diagnosis and treatment are very personalized. I hope that you continue to check in here for support and to hear of the experiences of others.",
      "MessageIndex": 2,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776652",
      "Title": "stage4 metastatic breast cancer spread to liver sd_whitetulip mary2120"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 20, 2011 01:51PM barsco1963 wrote: So good to hear about your status Cafelovr - thanks so much for your post - really gives me something to reach for!",
      "MessageIndex": 9,
      "PostDate": "20/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776652",
      "Title": "stage4 metastatic breast cancer spread to liver sd_whitetulip mary2120"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 19, 2013 05:03AM barsco1963 wrote: I too have thought about taking a break from the boards, but find that I would miss the love, support and friendship that I can only find here from my cyber-friends who totally understand. Yes, I am completely saddened by the passing of those whom I have found myself connecting with. And I do miss those who do decide to take a break but understand and respect their decision. But I find strength and comfort here and I don't know what I would do without it. I have shed a few tears lately for Laurie as well as another sister who has decided to take a break due to effing cancer. Are we selfish? Maybe - we are all affected by the lives of our dear sisters here and to want them to be here forever is just human nature.",
      "MessageIndex": 2,
      "PostDate": "19/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802014",
      "Title": "How do you get the emotional stamina to stay on the forum? AnacortesGirl ThereseD"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 28, 2012 06:15AM barsco1963 wrote: Very encouraging ladies. I have had liver mets from the get go - 8 months now. I have had great success with Tamoxifen and Zoladex. Is great to hear so many others are doing so well.",
      "MessageIndex": 11,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781719",
      "Title": "Long term with liver mets? mkkjd60 soleil505"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 14, 2011 06:42AM barsco1963 wrote: Hi Jenrio - I know it is hard not to ask the \"what if\" question and worry about what might be. Hopefully the MRI will not show any mets, but your medical team will have the best advice for you. There are so many treatments now. My mets (liver) is being treated with hormone therapy, which is working well I might add. My onco said that right now he wants me to have a better quality of life than what chemo would provide adding that chemo may be something that may come into play at a later date. Hang in there - I know it is hard to wait. Praying for good results for you",
      "MessageIndex": 1,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778075",
      "Title": "Stage IV treatment jenrio jenrio"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 2, 2012 06:48AM barsco1963 wrote: Awsome news banjo!! So happy for you. Dance, dance, dance!!!",
      "MessageIndex": 10,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782026",
      "Title": "WBR results banjobanjo banjobanjo"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 22, 2014 05:29PM barsco1963 wrote: Prayers for a clean scan tomorrow. ((Hugs)) for comfort",
      "MessageIndex": 29,
      "PostDate": "22/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827136",
      "Title": "Say a little prayer for me... Kjones13 KLynn"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 24, 2014 07:16AM barsco1963 wrote: Waiting with you holding onto hope that the scans will show nothing of concern.",
      "MessageIndex": 45,
      "PostDate": "24/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827136",
      "Title": "Say a little prayer for me... Kjones13 KLynn"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 25, 2014 04:58PM barsco1963 wrote: PHEW! So glad to hear that you got the all clear!",
      "MessageIndex": 56,
      "PostDate": "25/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827136",
      "Title": "Say a little prayer for me... Kjones13 KLynn"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 26, 2012 12:01PM barsco1963 wrote: I agree that the title of the post had me holding my breath. Good to hear that you two were able to get together and had a wonderful time!",
      "MessageIndex": 12,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786494",
      "Title": "Unfortuantely apple banjobanjo"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 23, 2013 04:41AM barsco1963 wrote: Hi Missy - good to meet you. Glad that you are doing well - hope to see you more often.",
      "MessageIndex": 13,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799265",
      "Title": "D - Could do better! Missy64 Missy64"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 4, 2013 06:18PM barsco1963 wrote: Super Duper! Very happy for you LuvRVing I like this good news Friday theme.",
      "MessageIndex": 34,
      "PostDate": "04/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804173",
      "Title": "And the good news continues... LuvRVing marymoir"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 5, 2013 07:09PM barsco1963 wrote: Wishing for nothing less than a great report for you. Sending prayers and positive vibes your way.",
      "MessageIndex": 18,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799981",
      "Title": "Scans today Jill49 steelrose"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 25, 2012 05:46AM barsco1963 wrote: Sending you and your family ((hugs)) and prayers for a better tomorrow.",
      "MessageIndex": 10,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781593",
      "Title": "Young and Over Yet (bad PET> Tiger_Blood vickib"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 17, 2012 05:40AM barsco1963 wrote: Michelle - sorry that you are having to join us here. But as you already know, the people here are fantastic! Enjoy your trip to Paris (count me in as one of the jealous ones) and fill us in on all of the fun, food and excitement when you get back.",
      "MessageIndex": 26,
      "PostDate": "17/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787587",
      "Title": "Well, here I am... LuvRVing LuvRVing"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 20, 2012 07:41AM barsco1963 wrote: LizLemon - I too had only a few friends share/like the same photo. Unfortunately not everyone is going to understand the importance of it all. All we can do is to continue shouting and being noisy about stage IV until people start to get it!",
      "MessageIndex": 1,
      "PostDate": "20/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796619",
      "Title": "FB friends wouldn't share the MetaVivor photo for donation! LizLemon DivineMrsM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 27, 2012 07:36AM barsco1963 wrote: I have heard that some women do get mammo on mx side. When I went for my last mammo she noted that there was not enough \"meat\" there also so she wouldn't even try. I had it in my mind that I would refuse a mammo on that side anyway - still quite tender.",
      "MessageIndex": 3,
      "PostDate": "27/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/788119",
      "Title": "Mammogram Question CurlyGirly Flat4them"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 21, 2013 04:09AM barsco1963 wrote: Hooray for Halaven! Hopefully Stable Boy has a good supply in his pockets to keep you well for a long time to come!",
      "MessageIndex": 5,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800795",
      "Title": "Halaven brought the Stable Boy! jcb51 RobinNY"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 3, 2014 03:13PM barsco1963 wrote: Welcome Addie - so good to get to know a bit more about you. We have a black lab who is now 9 yrs old but thinks she is still 2yrs. I think she gets reminded every time she over does the playing, running, chasing activities that she loves so much. I hope you do find a good match in a dog.",
      "MessageIndex": 15,
      "PostDate": "03/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816179",
      "Title": "5 questions - CancerCrusher texasrose361 barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 26, 2012 08:04AM barsco1963 wrote: Very well written - great title! Thanks for helping to educate the public about mbc.",
      "MessageIndex": 29,
      "PostDate": "26/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794020",
      "Title": "My Message re MBC Bestbird Heidihill"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 11, 2012 11:55AM barsco1963 wrote: CELEBRATE!!! Dance, sing and live it up! Sharing in your joy! :)",
      "MessageIndex": 55,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782475",
      "Title": "FIRST TIME WITH NED! MCTHO rosie06ct"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 8, 2014 11:33AM barsco1963 wrote: Hi pugs - wishing we didn't have to welcome you here but you will find tremendous support from everyone along with sharing of knowledge and experiences. I have mets to liver and started out on tamoxifen and zoladex 3 years ago. After an oophorectomy in may of this year I was able to drop the zoladex. Wishing you the same success with your treatment.",
      "MessageIndex": 5,
      "PostDate": "08/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825219",
      "Title": "New to stage IV forum pugsnotdrugs blondiex46"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 26, 2012 05:18AM barsco1963 wrote: Beautiful words - Thank you for sharing!",
      "MessageIndex": 5,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786455",
      "Title": "To all my sisters... myangels sweetangel"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 25, 2013 07:02PM barsco1963 wrote: Sorry that you are having to go the chemo route again. I hope that tx will get you back to feeling better and take care of the mets.",
      "MessageIndex": 26,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811650",
      "Title": "(I Kinda Knew It, But) CRAP!!!!!!!!!!!!!!!!!!!!!!! dbla dbla"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 14, 2013 06:30PM barsco1963 wrote: Smiley2 - I get the zoladex injection every 3 months (for the past 19 months) along with tamoxifen, and it is working very well for me. I haven't had any trouble with kidneys to date. Why do you feel that your kidneys are being affected? I would definitely discuss with your onc and have levels tested again for peace of mind. As for the ooph, please make sure you do your research. It sounds like it would be quite a procedure for you. My gyno will not take my ovaries even though I am stage iv, unless they begin to give indication that there is problem. She is keeping a close eye on them. At present my personal choice is that I agree with her, as I really don't want to have to go through any more procedures than necessary. Best of luck with everything. I hope that you find that your kidneys are ok.",
      "MessageIndex": 5,
      "PostDate": "14/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804667",
      "Title": "zoladex schedule smiley2 barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 28, 2013 12:00PM barsco1963 wrote: Renae - I too wonder if it is all in \"the plan\"  Not sure if it is God's plan, but I too believe in a superior being and I am sure that He will see us through the dark times and make sure that we are able to make the best of the good times also. I always try to see the positive side of things (almost to a fault) and hold onto hope that there are many, many good years yet to come. When did your mets appear - your dx still says stage IIb. You are still young and there are plenty of tx out there which you can still have a good quality of life for a very long time to come. Hang in there! We are all here for each other.",
      "MessageIndex": 1,
      "PostDate": "28/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799565",
      "Title": "Does God have a plan for me? Renae64 Kaelia"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 6, 2014 06:52PM barsco1963 wrote: Sending healing thoughts and prayers your way Redwolf.",
      "MessageIndex": 14,
      "PostDate": "06/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820841",
      "Title": "Back to doctor redwolf8812 nancyh"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 27, 2013 07:01PM barsco1963 wrote: Hi kodapants - welcome to a place where you can laugh, cry, vent and just hang out with a wonderful bunch! Hoping that tx will take care of those mets for you. Come by often for support, encouragement and sharing and lots of love and ((hugs))",
      "MessageIndex": 22,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801111",
      "Title": "New to this Group Kodapants vickib"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 2, 2015 09:09AM barsco1963 wrote: Signed and will continue to share on fb",
      "MessageIndex": 6,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828071",
      "Title": "Change.org petition for metatastic BC Deblc MusicLover"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 30, 2012 07:42AM barsco1963 wrote: tammie - ((hugs)) and prayers coming your way. So sorry that your son is not well. Don't forget to take care of yourself also.",
      "MessageIndex": 14,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791302",
      "Title": "Not making it to 2nd opinion OT tammie bhd1"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 21, 2013 06:49PM barsco1963 wrote: Hoping for good news only Mzmerz. Keep us posted.",
      "MessageIndex": 15,
      "PostDate": "21/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813287",
      "Title": "Fooey! Mzmerz justjudie"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 14, 2014 10:50AM barsco1963 wrote: Beautiful picture - and so true!",
      "MessageIndex": 4,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820153",
      "Title": "May we all find Strength Kandy Kjones13"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 8, 2013 05:03PM barsco1963 wrote: Great questions texasrose. Jena - Thanks for letting us share a small piece of who you are. Definitely not boring. I can tell that you love your family very much. You have a beautiful soul.",
      "MessageIndex": 8,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801470",
      "Title": "Five Questions - J1e1n1a brandall texasrose361"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 22, 2013 06:08AM barsco1963 wrote: Tash - so good to hear that you are feeling so much better. Hooray for stability, pain relief and happy pills! Good luck with the trial! Happy, happy, happy for you.",
      "MessageIndex": 12,
      "PostDate": "22/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811392",
      "Title": "O.K. You were right! tasha_111 justjudie"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 2, 2013 04:32AM barsco1963 wrote: CSMommy - sorry to hear of the progression. Cancer certainly has it's own agenda doesn't it. Crossing fingers, toes, and everything else in hopes that you qualify for the trial and any tx going forward knocks back those little buggers.",
      "MessageIndex": 9,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806856",
      "Title": "Multiple Mets in Multiple Areas CSMommy justjudie"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 27, 2012 05:38AM barsco1963 wrote: Great news! Thanks for sharing - it always gives me warm fuzzies when someone has a good report.",
      "MessageIndex": 7,
      "PostDate": "27/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786537",
      "Title": "Sharing some good news :) momto2angels ibcmets"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 19, 2013 04:37PM barsco1963 wrote: Great news chickadee! I will certainly be doing a happy dance for you if you choose to sit in stunned silence, or I will dance the jig with you. Quite a decision to make, but I am sure you will decide on what you are most comfortable with.",
      "MessageIndex": 11,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814742",
      "Title": "Completely stymied, but also happily surprised. HELP. Chickadee chrissyb"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 7, 2013 09:59AM barsco1963 wrote: Welcome fredntan - Sounds like you have great trust in Dr Dicke. I sure hope he lives up to his reputation and that he can introduce you to NED!",
      "MessageIndex": 5,
      "PostDate": "07/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814151",
      "Title": "introduction and my bone mets fredntan AnacortesGirl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 9, 2013 06:20AM barsco1963 wrote: Huntsco - I was dx with liver mets upon original dx. I am still on first tx and doing well. Stable for over 6 months with a good quality of life. Of course you are overwhelmed right now. It is a shock to learn that you have mets. Hang in there - we are all here for you and for each other. If you post your dx and your tx there are likely some others that have some experience to share with you. Sending ((((hugs)))) and smiles. There will be better days ahead.",
      "MessageIndex": 7,
      "PostDate": "09/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/812533",
      "Title": "liver mets - are you out there? Huntsco Mamita49"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 30, 2012 05:35AM barsco1963 wrote: Awsome! You must be very happy and proud of your son. What a wonderful milestone to celebrate. Can't wait to hear from you when his 30th b-day rolls around!",
      "MessageIndex": 10,
      "PostDate": "30/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789889",
      "Title": "Major Milestone Karen2012 seaperch"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 2, 2013 04:29PM barsco1963 wrote: So very sorry for your loss. Praying that the memories you hold will help to lighten your heart.",
      "MessageIndex": 3,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799848",
      "Title": "My dear cousin is an angel Evans1128 meima-Bev"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 29, 2012 01:36PM barsco1963 wrote: Truly worth a celebration - Enjoy your evening!!",
      "MessageIndex": 4,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794197",
      "Title": "Blessed lukejessesmom LuAnnH"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 23, 2013 05:21AM barsco1963 wrote: Kay - like the others have said. Don't jump to a mets conclusion until all the results are in. Hoping that there is something other than mets causing your pain. We'll wait with you - keep us posted. ((hugs))",
      "MessageIndex": 9,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811479",
      "Title": "Possible Liver Mets kayrnic Chickadee"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 7, 2013 09:38AM barsco1963 wrote: Amy - hope that it turns out to be nothing of great concern. Sending positive vibes your way!",
      "MessageIndex": 5,
      "PostDate": "07/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814134",
      "Title": "something new to worry about AmyJM Heidihill"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 9, 2013 04:14AM barsco1963 wrote: Mzmerz - it's odd how we have such a hard time accepting great news. Perhaps because we deal with so much crap that the good stuff is hard to believe. However, VERY happy for you! Hang onto NED and dance like no one is watching. I hope he hangs around for a very looooooooooong time!",
      "MessageIndex": 5,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798595",
      "Title": "Cautiously Optimistic Mzmerz Sunbunny"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 29, 2013 02:35PM barsco1963 wrote: Best apples EVER!",
      "MessageIndex": 22,
      "PostDate": "29/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811724",
      "Title": "Anybody's knees buckle Chickadee AnacortesGirl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 20, 2012 09:19PM barsco1963 wrote: Good news on the liver! Sending prayers that there is no bone involvement either. Keep us posted!",
      "MessageIndex": 23,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/790566",
      "Title": "moving on to stage IV orlandpark1965 Gitane"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 14, 2013 04:55PM barsco1963 wrote: MrsM - I just wish that the list would be final. Unfortunately I think it will be a work in progress. Thank goodness that we have this forum to chat, share, learn and support.",
      "MessageIndex": 233,
      "PostDate": "14/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 18, 2013 04:52AM barsco1963 wrote: Enjoy your cruise - sending good vibes for a clear scan and se's that will disappear!",
      "MessageIndex": 18,
      "PostDate": "18/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801907",
      "Title": "Me and My Big Mouth kayrnic SPAMgirl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 22, 2013 05:10PM barsco1963 wrote: Veggy!!!! Awesome news for sure! Here's to a loooooong well derserved vacation. CELEBRATE!!!",
      "MessageIndex": 376,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 5, 2013 02:57AM barsco1963 wrote: Warsh. I had forgotten about that one - mostly the older generation that I have heard it from.",
      "MessageIndex": 40,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799912",
      "Title": "OT - Regional Ways of Speaking redwolf8812 HLB"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 28, 2013 04:22AM barsco1963 wrote: MJ01 - I like to tell myself and others \"Don't worry until you know there is something to worry about\" I know that is easier said then done. I agree with the others that you need to call your dr and find out for sure what it is that is causing your symptoms. It may or may not be bc. ((hugs)) - keep us posted.",
      "MessageIndex": 4,
      "PostDate": "28/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799547",
      "Title": "I'm afraid I have cancer. MJ01 beacon800"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 22, 2012 02:23PM barsco1963 wrote: Glad to hear you are doing well! Sending best wishes for a quick recovery.",
      "MessageIndex": 40,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793873",
      "Title": "Scuttlers is having surgery today justjudie nancyh"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 8, 2013 04:35AM barsco1963 wrote: I have often wondered myself. Just when I think I know most everyone, there is a post from someone that I haven't seen before. Not sure how you would get numbers for sure, but it would be interesting to know.",
      "MessageIndex": 1,
      "PostDate": "08/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 12, 2013 04:27AM barsco1963 wrote: MrsM - thank you for starting this thread and taking the extra step to compile a list. I know there are others that I have seen post elsewhere but have not seen them here. Maybe they haven't come across this yet. Moira - beautifully stated. United and defiant. Voices from around the world and coming out of the darkness.",
      "MessageIndex": 201,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 14, 2013 04:57PM - edited Apr 14, 2013 04:57PM by barsco1963",
      "MessageIndex": 234,
      "PostDate": "14/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 24, 2013 03:31AM barsco1963 wrote: PatMe - sorry to have to welcome you here. Questions are welcomed and sharing is encouraged. I hope you come by the various threads often and get to know these wonderful women. Hang in there. We are here for each other.",
      "MessageIndex": 327,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 21, 2013 07:45PM barsco1963 wrote: Oh JTilCT - sorry to hear that those damn mets have found their way back. Of course we will be here for you at anytime that you need to be here - through the good, the bad and the ugly. Just hope that tx will knock em back again and you don't have to hang around for long, if you know what I mean. Hoping that the spot on the ovary is nothing to worry about.",
      "MessageIndex": 373,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 10, 2012 05:23AM barsco1963 wrote: Awsome news! Glad that you and Reggie are getting along so well!",
      "MessageIndex": 21,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791768",
      "Title": "Reggie is still here! 33skidoo 33skidoo"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 23, 2013 07:31AM barsco1963 wrote: hendricks - never feel that you are pulling anyone down - you feel what you feel and we all get that. We have all experienced days that we need to have a good cry and let it all out.  So sorry that the mets have appeared in your brain. Although the drugs don't cross the blood/brain barrier, there are tx that are available for brain mets. I am pretty sure there is a brain mets thread also. You are sure to find others in a similar situation and lots of information and support there. As I have said before - we are here for one another through the good, the bad and the ugly. No matter whether you are here every day or once a year. No one goes it alone! ((hugs))",
      "MessageIndex": 384,
      "PostDate": "23/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 4, 2013 06:50PM barsco1963 wrote: HLB - we are both from small town Ontario - Canada. We seem to have a lot of redneck sayings (can relate to Jeff Foxworthy - lol). \"Never say whoa in a tight spot\" - meaning if you are in a pickle you might as well keep on going! \"I'm so hungry I could eat the a-hole out of a skunk\" (you gotta be hungry to do that) \"The only way I could feel worse is if there were two of me\" Some say things like \"chimley\" (chimney), \"crick\" (creek), \"nother\"\" (other)",
      "MessageIndex": 9,
      "PostDate": "04/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799912",
      "Title": "OT - Regional Ways of Speaking redwolf8812 HLB"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 5, 2013 12:46PM barsco1963 wrote: \"big mom\" - I like that Caryn - while doing crosswords I have had to enter the work \"el\" on numerous occasions. Never really made the connection until reading your post. :)",
      "MessageIndex": 54,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799912",
      "Title": "OT - Regional Ways of Speaking redwolf8812 HLB"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 4, 2013 01:06PM barsco1963 wrote: Redwolf - what a fun topic. Will have to check in later. Time to get ready for work. HLB - lol - my husband always says that he is going to get his \"hairs\" cut.",
      "MessageIndex": 5,
      "PostDate": "04/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799912",
      "Title": "OT - Regional Ways of Speaking redwolf8812 HLB"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 5, 2013 02:32AM barsco1963 wrote: Instead of a couch we have a sofa. I put both ketchup and mustard on my burgers (and relish too). We had a visitor from New Zealand a few yrs back and we found it funny when she would say \"Knock me up in the morning\" (wake me up)",
      "MessageIndex": 37,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799912",
      "Title": "OT - Regional Ways of Speaking redwolf8812 HLB"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 6, 2013 06:28PM barsco1963 wrote: Rosevalley - could feel your embarassment as I read your drug store experiences. As kids we spent a lot of time at my aunts in the summer. When we asked her what was for supper the answer was always the same - \"Sheep sh#t and onions\"",
      "MessageIndex": 77,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799912",
      "Title": "OT - Regional Ways of Speaking redwolf8812 HLB"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 18, 2014 04:14AM - edited Jan 18, 2014 04:17AM by barsco1963 Elisa - As Bon mentioned, it is a good idea to get some tests done to confirm or rule out what might be going on. It could be nerves regenerating ( I still get pain 2.5 yrs out from mx), SEs from tamox or any number of things. Hoping that it is nothing of great concern. Forgot to mention that your gp might be a great resource also. He/She can order tests, scans etc. I often see my gp for symptoms as she is closer to me, and we have a great relationship.",
      "MessageIndex": 1,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817043",
      "Title": "random symptoms - anyone else experienced? elisa7girl elisa7girl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 25, 2012 02:59PM barsco1963 wrote: Welcome kebab - glad you were able to find us, but sorry that you have to be here. You will find lots of terrific resources from all of the supportive women & men here. I too am getting the zoladex injections with great success - I hope they work to zap those mets outta the water for you as well.",
      "MessageIndex": 26,
      "PostDate": "25/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784659",
      "Title": "Introducing myself kebab RavenMc"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 23, 2013 08:54AM barsco1963 wrote: Roberta - you sure have had a lot thrown at you all at once. As Chrissy stated above stage iv is considered terminal but with tx these days, there is certainly reason to hope that you will be here for a long time to come. We are here for you whenever needed - through the good, the bad and the ugly. Keep us posted on how you are doing.",
      "MessageIndex": 2,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806589",
      "Title": "Need help! Diagnosed mets in 5 organs at one time?? Roberta2 Andirod"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 21, 2013 05:25AM barsco1963 wrote: Lots of great news for all of you. It is awesome that your mom can take advantage of early retirement and is doing so well. Wishing you all continued happiness.",
      "MessageIndex": 4,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808038",
      "Title": "Another milestone in my mother’s life alicia_en_madrid Dianarose"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 18, 2012 12:50PM barsco1963 wrote: Hooray for Stable Boy!! Very happy for you.",
      "MessageIndex": 27,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789266",
      "Title": "Good news! Leah_S DivineMrsM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 19, 2012 01:20PM barsco1963 wrote: aic - Sending positive thoughts for great results from your scans!",
      "MessageIndex": 7,
      "PostDate": "19/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796561",
      "Title": "First scans today since I have started treatment.... aic Angelfalls"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 15, 2014 07:03AM barsco1963 wrote: Awesome news!",
      "MessageIndex": 3,
      "PostDate": "15/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/821099",
      "Title": "Good scan results Annie62 Bestbird"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 24, 2013 03:07PM barsco1963 wrote: Another masterpiece! Well done.",
      "MessageIndex": 7,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811477",
      "Title": "New Metastatic Breast Cancer Awareness Video: Use Your Voice EnglishMajor Jill49"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 1, 2014 07:55PM barsco1963 wrote: Superb!",
      "MessageIndex": 10,
      "PostDate": "01/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825919",
      "Title": "MBC Blog Bestbird nancyh"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 3, 2014 03:42PM barsco1963 wrote: Mommy - Constipation and nausea often go hand in hand. A call to your dr or pharmacist might help in figuring out what might best help you to get things moving. I am a regular user of senokot - it does take a couple of doses before it helps so I take it every day to stay regular. If all else fails, an enema might be the answer. Good luck",
      "MessageIndex": 2,
      "PostDate": "03/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/817638",
      "Title": "Constipation/nausea Mommyathome SpecialK"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 21, 2013 04:59PM barsco1963 wrote: Cynthia - the meds were prescribed to see if they would help my mood (although I didn't think I was in a dark place). Dr thougt that maybe I was losing weight due to anxiety - however, they certainly haven't helped out with that. I don't even think that they have improved my mood to the extent that I would consider beneficial.",
      "MessageIndex": 6,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803594",
      "Title": "Anti-anxiety meds and dreaming! barsco1963 justjudie"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 14, 2011 06:22AM barsco1963 wrote: Jackie - Welcome to the group - although sorry you have to join. I will repeat the advice given above - Stay away from stats. I think likely we all make the mistake of visiting Google upon diagnosis. You will find terrific support, friendship, and understanding from everyone here. Best wishes & ((hugs)) sent your way.",
      "MessageIndex": 18,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778048",
      "Title": "Just diagnosed IBC and liver met; I'm scared Jacque1102 ibcmets"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 25, 2014 08:32PM barsco1963 wrote: Happy New Year Ebru! Sending you good wishes and happiness always.",
      "MessageIndex": 2,
      "PostDate": "25/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825747",
      "Title": "Happy New Year (muslim) & wishes.. stagefree Mompsych"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 4, 2012 08:40AM barsco1963 wrote: So sorry to hear of the loss of another sister. Condolences to her friends and family.",
      "MessageIndex": 5,
      "PostDate": "04/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775821",
      "Title": "Brenna FireKracker chele"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 4, 2011 09:46AM barsco1963 wrote: I often think the same - I have been healthy all my life with only overnight hospitalization being when my son was born (he's 18 now) and my mx this past June. Life does throw some weird curves sometimes.",
      "MessageIndex": 2,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779018",
      "Title": "Just a ramble... lynne248 Padiddle"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 11, 2012 06:13AM barsco1963 wrote: Happy Birthday LuAnn!",
      "MessageIndex": 18,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794782",
      "Title": "I made it to the big 50!!!! LuAnnH Annie62"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 11, 2012 08:11AM barsco1963 wrote: dlm217 -  I agree with Ican - try the tamoxifen! You may find that you are ok with it. There are many of us that are taking it with few side effects. Most of them are manageable when you put it into perspective. I think that if it is keeping the cancer at bay (it is working well for me) then I will put up with a few unpleasant SEs. Good luck!",
      "MessageIndex": 3,
      "PostDate": "11/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785635",
      "Title": "Tamoxifen dlm217 sweetbean"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 2, 2012 05:36AM barsco1963 wrote: One yr for me was this past June. I reshape my vision of the future on a regular basis. There are days when I think long and hard about what I should be doing to prepare for my inevitable demise - but not knowing when that will come, I tend to procrastinate about it and tell myself to take it day by day. I feel well most days and that helps me to envision a long happy life ahead. So I will celebrate cancerversaries and birthdays and anniversaries with great gusto knowing that each day is a blessing.",
      "MessageIndex": 2,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792884",
      "Title": "Reflections on \"Cancerversaries\"... what have you learned? K-Lo Fitztwins"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 6, 2012 08:57AM barsco1963 wrote: Stable boy is making his rounds lately. So very glad that he has stopped by to stay with you a while! Continue to enjoy those good moments.",
      "MessageIndex": 13,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791597",
      "Title": "Just Recently I Read One of my Scan Reports DivineMrsM Amyf"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 20, 2012 04:16PM barsco1963 wrote: Sending prayers your way sallyyy. Waiting always gives way for worrying - and most time we think about the worst case scenario.  Hang in there and let us know how you make out.",
      "MessageIndex": 4,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/790849",
      "Title": "tomorrow !! sallyyy shoppygirl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 2, 2014 10:54AM barsco1963 wrote: Connis - sorry for the crap that's been thrown at you this week. I agree with the others that the mental anguish is much worse than the procedure itself. Hopefully they will give you some good drugs to get you through. Keep us posted.",
      "MessageIndex": 10,
      "PostDate": "02/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820723",
      "Title": "have a liver biopsy scheduled for Wednesday Connis RonnieKay"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 22, 2012 09:06AM barsco1963 wrote: Always good to hear of the \"negatives\" - Hooray!! Very happy for you.",
      "MessageIndex": 3,
      "PostDate": "22/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789489",
      "Title": "biopsy yesterday...results today! seivfdPam MamaMiss"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 1, 2014 11:34AM barsco1963 wrote: Great to have options - and one that is more \"doable\" than a nasty sounding biopsy. Enjoy the weekend!",
      "MessageIndex": 8,
      "PostDate": "01/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817553",
      "Title": "Kinky Boots dbla AmyJM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 21, 2013 09:33AM barsco1963 wrote: Thanks ladies - I have decided that the SEs aren't worth it. The benefits are few so I am going to stop taking them and see how it goes. I am totally lightheaded today - thinking from lack of sleep. No good.",
      "MessageIndex": 4,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803594",
      "Title": "Anti-anxiety meds and dreaming! barsco1963 justjudie"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 18, 2012 06:45PM barsco1963 wrote: eag1954 - I also read those stats and kinda freaked out. After reading them time and time again I have decided that I will just have to try like hell to be one of the 20%. I try to stay away from all of the stats out there. They just bring me down and they are not something that I want to dwell on. I would prefer to dwell on the metsers who have been around for 10 or 20 years. That's where I get my encouragement from.",
      "MessageIndex": 49,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765209",
      "Title": "Stage IV-Can you go into remission, or be cured? amontro Landerson3237"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 26, 2013 07:43AM barsco1963 wrote: Roberta - waiting with you. ",
      "MessageIndex": 14,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806589",
      "Title": "Need help! Diagnosed mets in 5 organs at one time?? Roberta2 Andirod"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 21, 2012 05:27AM barsco1963 wrote: Kim53 - hang in there. The wait is definitely the hardest part. I can't comment on the implants as I have none. Praying that everything is B9! When do you get the results? Keep us posted - we are all here for you! ((hugs))",
      "MessageIndex": 1,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790893",
      "Title": "Waiting for results Kim53 Jestea"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "barsco1963 wrote: I have taken a couple of anti-anxiety meds (first one was not effective) and with both have experienced incredibly vivid dreams every night all night long. The dreams make NO sense what so ever - some are just weird and some are downright disturbing. Just wondering if this is par for all or most anti-anxiety meds? I don't think I can handle much more - may be time to stop taking them. It isn't knowing the worst, the worst is not knowing. Dx 5/30/2011, IDC, 4cm, Stage IV, Grade 2, 21/29 nodes, mets, ER+/PR+, HER2- Hormonal Therapy 7/24/2011 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803594",
      "Title": "Anti-anxiety meds and dreaming! barsco1963 justjudie"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 1, 2014 05:45PM barsco1963 wrote: Happy for your good news Amy. Hoping that little \"might be\" turns out to be nothing serious.",
      "MessageIndex": 14,
      "PostDate": "01/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825925",
      "Title": "Scan Results AmyJM barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 21, 2013 09:47PM barsco1963 wrote: Connis - best wishes for a tx that will kick those bone mets to the curb. Glad that the mets were not discovered anywhere else.",
      "MessageIndex": 4,
      "PostDate": "21/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813298",
      "Title": "results of Pet and Ct scan Connis stagefree"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 29, 2014 04:30PM barsco1963 wrote: Tina - so sorry that you are having such a tough time. Going through so many treatments would send anyone to a dark place. I hope that knowing we are all here for you sending healing thoughts and lots of love helps you to feel a bit better. Praying that the tamo and halaven will bring things under control for you. Wishing you brighter days ahead.",
      "MessageIndex": 3,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822385",
      "Title": "Feeling sad Tina72 starbrightlyshines"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 5, 2012 07:41AM barsco1963 wrote: Janis - a wonderful post and tribute to all of the wonderful women & men here at bco. I am also one who doesn't post often but do a lot of reading. I am here at least once a day. I have gained a lot of information, encouragement and support from everyone here!",
      "MessageIndex": 32,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788587",
      "Title": "I wish some of you knew Fitztwins Iwillwinthisbattle"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 6, 2013 08:57AM barsco1963 wrote: Mzmerz - I agree that you should make a call to your onc sooner rather than later. There seems to be something going on that should be looked into. Hopefully just an infection that some antibiotics will take care of.",
      "MessageIndex": 3,
      "PostDate": "06/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/812339",
      "Title": "Seriously....more lumps!! Mzmerz pajim"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 7, 2013 09:40AM barsco1963 wrote: Keeping you in my thoughts and prayers Penny.",
      "MessageIndex": 7,
      "PostDate": "07/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/812400",
      "Title": "MRI Tuesday morning redwolf8812 redwolf8812"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 15, 2014 12:44PM barsco1963 wrote: A great share - thanks Ebru!",
      "MessageIndex": 11,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822777",
      "Title": "YOU DON'T HAVE TO CHANGE A SINGLE THING* A MUST WATCH TRUST ME! stagefree MusicLover"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 5, 2013 08:46PM barsco1963 wrote: nanaphyl - sorry to hear that you find yourself worrying and wondering and waiting once more. This is a great place to hang out and wait however. Lots of experience to gain knowledge from. I have little knowledge on chemos, but I am sure that someone else will come along that will share their experience. Being dx stage iv at the start -  I have only had hormonal tx to deal with the liver mets. No mets anywhere else at this time and the tamoxifen/zoladex combo has been holding everything stable for a few months now.",
      "MessageIndex": 1,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802829",
      "Title": "Lots of questions Crone Crone"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 13, 2012 01:02PM barsco1963 wrote: Great news! Glad that you are doing well. Cheers to many, many more years ahead!",
      "MessageIndex": 6,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782592",
      "Title": "Its been two years, wow... Suebus meima-Bev"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 6, 2011 07:55AM barsco1963 wrote: Hi Bruburn - Not sure what RFA is. Can you pls explain?",
      "MessageIndex": 1,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778858",
      "Title": "RFA - anyone in Canada have it? Bruburn Bernicky"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 8, 2012 12:13AM barsco1963 wrote: Thinking of you today coolbreeze. Sending positive, happy thoughts your way today.",
      "MessageIndex": 73,
      "PostDate": "08/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783699",
      "Title": "PET Results CoolBreeze ruthbru"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 9, 2012 12:12AM barsco1963 wrote: Good to hear! We are all breathing a little easier today after hearing the news. Start planning that graduation ceremony!",
      "MessageIndex": 125,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783699",
      "Title": "PET Results CoolBreeze ruthbru"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 23, 2014 10:10PM barsco1963 wrote: I like that I am always learning here on bco. Not only all of the cancer related info but my vocabulary gets a boost every now and then to. Re: Caryn's reference to sybarite. Had to look it up but now I know! I am a peanut butter fan from way back! I will not likely be giving up my pb on toast every morning. According to this study it may be what caused mets, but maybe.......just maybe it is what is keeping me stable. Who really knows?",
      "MessageIndex": 29,
      "PostDate": "23/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827123",
      "Title": "Peanuts linked to cancer spread? Shutterbug73 Beachbum1023"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 13, 2013 10:15PM barsco1963 wrote: Excellent news! So happy for you!",
      "MessageIndex": 16,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807590",
      "Title": "July 10 PET Scan Results Z28Femme aic"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 8, 2012 12:50AM barsco1963 wrote: Not only does cancer suck, it is downright vicious! I am so sorry that you are having to go through this. Wishing you all the best with WBR and better days ahead. Remember that you have a great support network beside you all the way! ((hugs))",
      "MessageIndex": 56,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 17, 2012 11:55PM barsco1963 wrote: Lisa - thinking of you as you reach the half way mark. Sending warm thoughts and prayers to you daily.",
      "MessageIndex": 141,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 26, 2013 10:32AM barsco1963 wrote: Nancy - what a wonderful relationship you have with Kate. Thank goodness you both returned safely and thanks for sharing your beautiful story.",
      "MessageIndex": 18,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803815",
      "Title": "OT - article about SIL and me at Boston marathon nancyh nbnotes"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 12, 2012 10:51PM barsco1963 wrote: soleil - given the choice, I think most of us would have chosen the \"miracle\" drug. You have some great ammunition to go in with on Thurs when you see your onc. Lots of advice and experience to draw from here. Will be thinking of you on Thursday - hope that you and your onc can come up with a good plan. Sending positive vibes and lots of ((hugs)).",
      "MessageIndex": 40,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793326",
      "Title": "Holding my breath and trying not to worry soleil505 soleil505"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 5, 2013 08:14PM barsco1963 wrote: So sorry to read of the loss of another dear sister. May she rest in peace.",
      "MessageIndex": 55,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801402",
      "Title": "Luke and Jesse's Mom, Cindy...Heaven's Newest Angel SarahsMom vickib"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 17, 2011 01:06AM barsco1963 wrote: Sheila - I am so very sorry to hear this news. I am glad that your husband now is getting treatment to help him through all of this. I also want to say thanks for sharing this - it is sometimes easier to look at our loved ones and just assume that everything is ok, thinking that we are protecting them. Sending ((HUGS)) and prayers to you both.",
      "MessageIndex": 9,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778183",
      "Title": "STAGE FOUR NIGHTMARE. AussieSheila ibcmets"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 26, 2013 01:36AM barsco1963 wrote: I have posted this on my facebook - Have also sent a letter to our local monthly paper titled \"Are You Aware?\" with the subject being metastatic bc.",
      "MessageIndex": 3,
      "PostDate": "26/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811658",
      "Title": "Empty Promises DC197 leggo"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 19, 2012 11:39AM barsco1963 wrote: I have numerous liver mets and have been on tamo and zoladex for about 6 mos. The combination has worked well for me with all lesions shrinking in size. I still feel great (thankfully) aside from a few SEs.",
      "MessageIndex": 13,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766826",
      "Title": "Any one with liver mets on hormone treatment only? Suebus barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 19, 2014 05:13PM barsco1963 wrote: Karen - sending good thoughts and ((hugs)) your way as you move on. Hoping the Red Devil kicks cancers ass but treats you with gentle hands.",
      "MessageIndex": 36,
      "PostDate": "19/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820289",
      "Title": "Progression in CT Scan too Karen2012 barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 8, 2011 08:49AM barsco1963 wrote: SammyDee - just wanting to pass along some {{hugs}} and best wishes for some good results on Thursday. Hoping that you can find out what is going on and be able to start treating it so that you can feel better.",
      "MessageIndex": 6,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777729",
      "Title": "Warning: I'm a \"well-developed\" writer SammyDee SammyDee"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 19, 2013 11:52PM barsco1963 wrote: Chickadee - so sorry that you are dealing with crap on top of crap. Thinking of you and sending thoughts and prayers for great results with WBR.",
      "MessageIndex": 34,
      "PostDate": "19/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813118",
      "Title": "Don't even have a title for this crap Chickadee lulubee"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 19, 2012 11:52AM barsco1963 wrote: I have always been an optomist and am a little miffed that mbc has taken some of the rose colouring from my glasses. I have days when I am very optomistic - I feel good, the sun is shining and test results have been positive and I am so very glad to be alive. Then there are days when I start to think about what lies ahead - how long will I be here, when will the other shoe drop, should I start purging my closets and posessions so that my DH and DS don't have to deal with it when I am gone? I am in a constant state of confusion.",
      "MessageIndex": 27,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792176",
      "Title": "Stage IV Breast Cancer feels like . . . radiant Sanibelblueyezz"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 5, 2014 06:07PM barsco1963 wrote: HI luckydog - I also had single mx (no recon) with quite a few nodes removed. The drains were pretty uncomfortable and I was sore for a while. Don't skimp on the pain pills if you need them. Make sure you do the exercises they give you (once you have the ok to do so). That will help with recovery. I am 3.5 yrs out and no sign of LE to date. Wishing you a successful surgery and a quick recovery.",
      "MessageIndex": 2,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826046",
      "Title": "Good stories Luckydog42 alizbeth"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 11, 2012 09:29AM barsco1963 wrote: diana - sending more positive vibes your way. Hoping all goes well.",
      "MessageIndex": 15,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793327",
      "Title": "Biopsy tomorrow T 4 diana50 CoolBreeze"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 26, 2012 09:54PM barsco1963 wrote: It is wonderful that you are so busy enjoying life! Sounds like there is never a dull moment at your household. Here's to many, many more forgotten cancerversaries!",
      "MessageIndex": 13,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786439",
      "Title": "I forgot my 2 year anniversary! 3littlegirls steelrose"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 15, 2013 03:15PM barsco1963 wrote: I have never heard of anyone with cancer having an \"odor\". Regardless, I can't imagine anyone being asked to not attend any events or even become banned from the property because of any odor that may be deemed offensive by a couple of people. As mentioned could it be any worse than some of the colognes or perfumes that some people insist on wearing even though so many places are now scent free. Has anyone ever asked a farmer not to come within \"smelling\" distance after they've put in a long hard day in the barn. How about those who eat a lot of garlic, or curry or other foods that permeate the skin? The list could go on. I feel for the girls who will now likely be the brunt of bullying and jokes from their peers. Kids can be cruel. Perhaps there is more to the story that we haven't heard.",
      "MessageIndex": 6,
      "PostDate": "15/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814542",
      "Title": "Chemo treatment gives bad odor? Law828 Padiddle"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 4, 2012 09:05AM barsco1963 wrote: Thank you all for your kind words. It is with the support and encouragement of family and friends (cyberfriends included) that we are able to move forward and enjoy each day as it comes to us.",
      "MessageIndex": 25,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780408",
      "Title": "Some good news! barsco1963 holding92"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 28, 2012 09:14AM barsco1963 wrote: Jan - Too skinny for your skinny jeans! That is not a good thing. Before bc, I too had finally come to the conclusion that I was going to be size 12 or bigger for the rest of my days. I could live with that. Then along comes bc and a weight loss plan that I would never recommend. Hopefully the Gemzar will continue to work well so that you can have an appetite once more and get into those clothes.",
      "MessageIndex": 3,
      "PostDate": "28/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794131",
      "Title": "Well, they say God has a sense of humor... jcb51 LuAnnH"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 6, 2012 09:49AM barsco1963 wrote: I hope that NED has just stepped out to get a newspaper and that he will return with good news only. Good luck - also hoping you can get an US quickly and it shows nothing of concern.",
      "MessageIndex": 14,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788655",
      "Title": "Ultrasound steelrose alesta29"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 5, 2012 09:54AM barsco1963 wrote: thegood5 - Hooray for the good news on your scan!!!!!  Keep the good news coming!",
      "MessageIndex": 34,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780408",
      "Title": "Some good news! barsco1963 holding92"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 14, 2013 08:53AM barsco1963 wrote: I am approaching two yrs in August on Tamo with zoladex injections every 3 mos. MO is mostly concerned with the constant nausea and weight loss. He did mention trying something else a few months ago, but I am not willing to give up on a tx that is working so well on the mets. Weight loss had levelled off for a while, but as of late I am having GI issues and dropped a couple of more pounds. Hoping that it will resolve itself as it has in the past. Seems to go in spurts.",
      "MessageIndex": 21,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807581",
      "Title": "Curious, how many of you have gotten 2+ years on a drug, Fitztwins SAMayoFL"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 25, 2012 08:48AM barsco1963 wrote: 4ever4mom - praying with you that it is something else that is showing up on the liver. But, if it is mets, it can be treated. There are lots of women here that have had liver mets for a long time and are doing well. I was dx with liver mets from the start and they are responding very well to tx. I am sure someone else with experience will come along to help ease your mind. Hang in there. Keep us posted on the results!",
      "MessageIndex": 1,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791075",
      "Title": "Metastatic to LIver 4ever4mom Annemie"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 21, 2013 11:44PM barsco1963 wrote: Thinking of you today chickadee. Good luck as you start WBR - as one member stated on another thread - \"It's a good day to kill some cancer\" Hoping that tx takes care of the mets for you.",
      "MessageIndex": 97,
      "PostDate": "21/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813118",
      "Title": "Don't even have a title for this crap Chickadee lulubee"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 30, 2013 07:01PM barsco1963 wrote: Haven't been here for a while chickadee but that doesn't mean I haven't been thinking of you. Sending you smiles and hugs and wishes for a restful evening.",
      "MessageIndex": 157,
      "PostDate": "30/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813118",
      "Title": "Don't even have a title for this crap Chickadee lulubee"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 9, 2012 05:20PM barsco1963 wrote: So good to hear that you are feeling better and things are looking up for you. Enjoy movie and a pizza on Friday - sounds like a great way to end the week.",
      "MessageIndex": 7,
      "PostDate": "09/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794699",
      "Title": "Do not adjust your set - normal service is being resumed..... alesta29 lulubee"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 26, 2013 07:21AM barsco1963 wrote: Sorry to hear of the progression Soleil. Count me in on the good wishes for you that Gemzar knocks the mets back. Let the tears flow - they are a great release. ((hugs))",
      "MessageIndex": 35,
      "PostDate": "26/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802330",
      "Title": "Back to Chemo....Stupid mets are agressing again soleil505 ldianel"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 5, 2012 12:16AM barsco1963 wrote: Sorry to hear about the progression. I too hope that Xeloda is the one to take care of them for you.",
      "MessageIndex": 26,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783587",
      "Title": "More mets twinsmom96 seaperch"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 7, 2013 09:18AM barsco1963 wrote: nanaphyl - Your DH is funny re - housework! lol Thank you for sharing the video. Is terrific - I had to share on my facebook. I think I too would like to be a hummingbird!",
      "MessageIndex": 10,
      "PostDate": "07/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802829",
      "Title": "Lots of questions Crone Crone"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 16, 2013 07:19AM barsco1963 wrote: Hi Julie - sorry that you have had progression to the liver. I am also a fellow liver metster although ER/PR+ so my tx is different from what you will experience. However, there are lots of triple negs that will be able to share their experiences with you. Keep us posted on how you are doing. We are here for you. xo",
      "MessageIndex": 4,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803373",
      "Title": "Just Diagnosed With Liver Met - Looking for Info Danjulieo ButterflyLady"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 17, 2011 12:05AM barsco1963 wrote: My first scan was also good news. Everything was shrinking. Wishing all the best for you as well Amy!",
      "MessageIndex": 10,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779579",
      "Title": "First scans diagnosis and treatment? Canchaser Canchaser"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 1, 2012 09:17PM barsco1963 wrote: My thoughts and prayers are with Jenny's family and friends. May they find comfort in the memories that they hold in their hearts.",
      "MessageIndex": 2,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791396",
      "Title": "Jenny in New Zealand is an Angel.... Travelingpants2 raro"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 27, 2012 08:27AM barsco1963 wrote: Pam - lots of great suggestions from everyone. I'm sure you would be there for one of your neighbors or friends if needed. You will find that soon you will be comfortable asking for some assistance. You don't want to stress yourself or wear yourself down with having to still do \"everything.\" Concentrate on getting better.",
      "MessageIndex": 9,
      "PostDate": "27/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788135",
      "Title": "I am finding it hard to ask for help pamelahope NWArtLady"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 9, 2013 12:17AM barsco1963 wrote: Allison - sending healing vibes in hopes that those #s will come down so you can continue on with tx. Keep us posted.",
      "MessageIndex": 2,
      "PostDate": "09/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814193",
      "Title": "Too Early For This Freedomchild82 bhd1"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 13, 2012 11:34PM barsco1963 wrote: Lisa - Sending prayers, ((hugs)) and good thoughts your way along with all of your bco family.",
      "MessageIndex": 128,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 27, 2012 11:23PM barsco1963 wrote: Sending positive thoughts and prayers your way. I am thinking that you must be nearing the end of tx - I hope that you are doing well and that the tx is really kicking ass!",
      "MessageIndex": 167,
      "PostDate": "27/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 11, 2013 07:53PM barsco1963 wrote: Sharon - chrissy is right. Try not to borrow trouble. I know that is easier said than done, but it is the best thing you can do. Hope all comes back clean as a whistle.",
      "MessageIndex": 1810,
      "PostDate": "11/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 1, 2013 03:38PM barsco1963 wrote: Kandy - so sorry that you have been dx with mets. Hopefully rads will take care of the mets on the pelvis and tx will keep you stable for a very long time to come. Keep us posted on how you are feeling and how tx progresses. Papillon - Please don't feel guilty for anything. It sounds like you are doing as much as you possibly can to be with your parents during such a tough time. You are sensible in your thinking that you cannot use all of your finances to be with your mom when you, as a mom yourself, need to be there for your children. I am sure your parents understand that you cannot be there 24/7 and I am sure that they do not expect you to be. You say you are in touch on a daily basis, and that is more than some can hope for. Cancer is never predictive and takes it's own course. We just have to take it a day at a time, live for the present and be thankful for each tomorrow that comes our way. Sending you ((hugs)) and smiles and best wishes for comfort and well being for your mom.",
      "MessageIndex": 1853,
      "PostDate": "01/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 13, 2013 04:49PM barsco1963 wrote: raindeer - some great advice from Chrissy. I hope that it is that your body is just letting you know that you need to slow down and rest up. But always a good idea to touch base with your dr when not feeling up to par. Papillon - Hope your mom does well with the new tx. Keep us posted.",
      "MessageIndex": 1881,
      "PostDate": "13/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 19, 2013 06:16PM barsco1963 wrote: Hi Sylvie - glad that you have introduced yourself. Sorry that you have had progression but you couldn't have landed in a better spot. We are all here for each other to support, encourage, share and listen. Welcome",
      "MessageIndex": 11,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799112",
      "Title": "Saying hi... reluctantly justsylvie Annie62"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 9, 2015 07:29PM barsco1963 wrote: Thank you for updating all of us on Rebecca. She is in our thoughts daily. Great advice to contact hospice care for guidance so that your mom can be more comfortable and maybe less anxious. Sending thoughts and prayers for Rebecca and your family.",
      "MessageIndex": 3,
      "PostDate": "09/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828336",
      "Title": "Update on Raro raro"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 13, 2012 09:10PM barsco1963 wrote: Thinking of you today soleil! Go get em....   Keep us posted  -  ((hugs))",
      "MessageIndex": 52,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793326",
      "Title": "Holding my breath and trying not to worry soleil505 soleil505"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 12, 2014 08:39AM barsco1963 wrote: AWESOME news! So very happy that you are finally getting some good news.",
      "MessageIndex": 29,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820034",
      "Title": "I'm Shrinking!! Alli_FLA Iwillwinthisbattle"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 11, 2013 09:14PM barsco1963 wrote: Scuttlers - great post. Chrissy - It is a shame that the thread that you started to help others has been interrupted in such a manner. I believe that it will get back on track once the focus comes back to where it began. I too like that I can come here to share and even learn about the various paths of stage iv.",
      "MessageIndex": 1305,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 17, 2013 08:38AM barsco1963 wrote: Papillon - Have been lurking here a bit and just want to say that I sure hope the new meds help out with your mom's nausea. It is a horrible thing to deal with on a daily basis. Chrissy's idea of smoothies are a great idea, you can add protein powder, spinach, kale, etc. There are also meal supplement/replacements available here, but not sure if you have them where you are. Boost, Ensure, and Glucerna are some of the ones I know of. The boost comes in a smoothie type as well as a juice type. I have also been dealing with nausea for a long while and although not much fun - forcing ones self to eat is sometime necessary (as long as it doesn't cause vomiting). Other options might be - soda crackers, dry cheerios, rice, mashed potatoes, or anything bland tasting. It is sometimes the smell of food that causes one to become nauseated and not want to eat. Try to encourage her to continue eating and drinking throughout the day. Please keep us posted on how your mom is doing.",
      "MessageIndex": 1434,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 16, 2013 07:48AM barsco1963 wrote: jan-m  So sorry to hear that your friend is not doing well. Chrissy has some wise words above. Be present for your friend, help her to be comfortable and try to make those final days together as pleasant as the situation allows.",
      "MessageIndex": 1590,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 12, 2013 12:31PM barsco1963 wrote: Alice - good news that the surgeon is not overly concerned. Hoping for nothing but a lacrimal gland taking a wander. Our bodies do some funny stuff huh? Keep us posted.",
      "MessageIndex": 1635,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 7, 2013 08:57AM barsco1963 wrote: Kandy - I also had a difficult biopsy (US guided) and was given the all clear, but when I questioned it ((I was awake and knew that the dr had a tough time) - they found that the dr who did the biopsy was unsure that he was able to get a good sample. A second biopsy (CT guided) did confirm mets. I would definitely make an apt to go over the report and discuss with your doctor. It is possible that the scan picked up something unrelated to cancer. I sure hope that the biopsy can be confirmed to be correct.",
      "MessageIndex": 1796,
      "PostDate": "07/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 20, 2013 07:45AM barsco1963 wrote: KF - I am not HER2+ but I too had my Dr fill out a form that indicated my life expectancy was less than 2 yrs. Not something that I really wanted to have to do. But as scuttlers said, \"It served a purpose\" and now I can get back to living. Good luck with tx. I hope that the tx provides you with the raft needed to keep you afloat for a very long time to come.",
      "MessageIndex": 5,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800732",
      "Title": "ER- PR- HER2+ with liver mets outlived 12 months? KeepingFaith69 KeepingFaith69"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 5, 2012 09:06PM barsco1963 wrote: Hip Hip Hooray! So very happy that stable boy has taken up residence at your home!",
      "MessageIndex": 29,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788581",
      "Title": "Stay-bill-ity DivineMrsM Jac53"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 29, 2013 10:34PM barsco1963 wrote: Donna - sorry to have to welcome you to the bco boards - and stage iv to boot. You will find lots of great and wonderful people here. There is always someone to bounce things off of, always an ear to listen and always a hand (albeit virtual) to hold. I have had liver mets from dx in 2011 and am still having success with first line tx of tamoxifen and zoladex (ovary suppressant) Had regression for a long while and have now been stable for months. My quality of life is very good. I hope that you will have great success with femara.",
      "MessageIndex": 14,
      "PostDate": "29/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805909",
      "Title": "Anyone out there with stage four treatment with femora only Donna7 curveball"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 4, 2011 09:33AM barsco1963 wrote: I too have been a bit of a lurker - not sure what or when to post. I have never really been one to share my feelings or show my emotions. I was unsure that I would have anything to contribute - everyone seems so much more knowledgeable. So I lurk and learn - lol However, with the support found here, I am becoming more comfortable in sharing my experiences. I can express my fears, ask questions and provide support to others who have \"been there, done that\" so to speak. bobkat - Once again it is proven that we are definately our own best advocate. Glad that you are feeling well. Praying that your scans on Tues are clear. Barb",
      "MessageIndex": 78,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 8, 2011 07:46AM barsco1963 wrote: Clarissa - My treatment was delayed due to testing and retesting. - Started Tamoxifen about 2 months after diagnosis and then added Zoladex about a month later. I too thought that the clock was ticking and wanted to get things moving. I expressed my concerns to my onc and he advised that it was necessary to get diagnosis correct in order to provide best course of treatment. Made sense. Also I must tell you that not only did the cancer not grow or spread further in that time - the lesions shrunk with treatment.  Try not to worry too much although I know that is easier said then done. I hope that you have a plan in place soon. Good luck Suze35 - Praying that the new tx works well for you. Hope you are feeling better soon.",
      "MessageIndex": 92,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "barsco1963 wrote: I just want to share some good news with everyone. I had a CT scan today and it is showing that all of the lesions on my liver continue to decrease in size. It is a great start to 2012 for myself and my family. My wish for all is a peaceful and contented 2012 filled with good health, many new memories and tons of laughter and love. It isn't knowing the worst, the worst is not knowing. Dx 5/30/2011, IDC, 4cm, Stage IV, Grade 2, 21/29 nodes, mets, ER+/PR+, HER2- Hormonal Therapy 7/24/2011 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780408",
      "Title": "Some good news! barsco1963 holding92"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 24, 2012 11:02AM barsco1963 wrote: HOORAY! Embrace the feeling - soooooo happy for you!",
      "MessageIndex": 35,
      "PostDate": "24/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783122",
      "Title": "After 17 months... Amyf lilylady"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 9, 2012 01:08PM barsco1963 wrote: HOORAY!!!!!! Can never ever hear enough good news.",
      "MessageIndex": 3,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790299",
      "Title": "Good News kayrnic ibcmets"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 21, 2014 08:39PM barsco1963 wrote: I'm with you Sassi - I don't post a lot but find comfort in knowing that there is always someone here if needed. I was reading about an online contest for bcam. It was encouraging people to write in about someone you know with bc that inspires you. My first thought was \"my inspiration comes from a myriad of women whom I have never even met\" Those being the women of bco!  ",
      "MessageIndex": 8,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825605",
      "Title": "Hello and Thank you Sassi Aoibheann"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 10, 2013 11:39AM barsco1963 wrote: Sorry to hear the news of progression Tasha. I hope that the next tx will knock it back for you.",
      "MessageIndex": 6,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/812584",
      "Title": "Bone scan not good :( tasha_111 pajim"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 21, 2014 09:10AM barsco1963 wrote: Awesome news!!! What a thoughtful onc you have to realize your anxiety and to help alleviate any fears asap.",
      "MessageIndex": 16,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820375",
      "Title": "I love my oncologist! exbrnxgrl exbrnxgrl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 30, 2011 09:05AM barsco1963 wrote: Hi everyone - diagnosed with stage IV (liver mets) since the get go (June 2011). I have a great supportive husband, son (18) and fabulous family & friends. I am lucky to have them - they bring me up when I am down and share laughs whenever we can. Eva - I feel quite well most days. Some days are just made for laying on the couch though. (lol) I am on Tamoxifen and Zoladex injection (every 3 mos). Tx is working well for me - all lesions have shrunk! Praying that your lungs are clear. Hang in there - we are all here for each other whenever need be.",
      "MessageIndex": 55,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 10, 2012 02:46PM barsco1963 wrote: YAAAAAAAY! Glad to hear that you and Stable Boy aren't getting tired of each other. You might need to pick up some chapstick if you're going to keep neckin' so much. lol",
      "MessageIndex": 24,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783902",
      "Title": "Still neckin' with that Stable Boy dreamwriter nancyh"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 25, 2012 09:15AM barsco1963 wrote: Hi Jibb - Welcome to bco. It is unfortunate that you have to be here, but you have come to the right place for information, experience and support.  I was dx with mets about a wk after my mx so not sure if they would have been a deciding factor in surgery or not (had they been found prior to mx). Chrissy has certainly given some great info. It is very important to be comfortable with your team and your decisions. Good luck - keep us posted. ((hugs))",
      "MessageIndex": 4,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791074",
      "Title": "No surgery? jlbb_1 jlbb_1"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 5, 2012 08:51AM barsco1963 wrote: Ok - so now I don't mind buying my own gifts so much (DH \"never knows what to buy\"). Beats getting an iguana. Ick! I will keep the chicken strips in mind for future reference if needed though - lol",
      "MessageIndex": 14,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791554",
      "Title": "OT - Worst present ever... dormouse72 Iwillwinthisbattle"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 20, 2012 10:23PM barsco1963 wrote: Hi sgupta - sorry that you have been dx with mets. You have come to the right place for support and encouragement. I was dx with liver mets from the start. I too was started on tamoxifen and a month later started to receive zoladex injections which I now get every 3 months. I was concerned about not getting chemo - I thought everyone had to do chemo. But after discussing with my onc, he stated that we were going to start with hormonals and keep the big guns (chemo) for later on down the road. The hormonals are working very well for me - tumors continue to shrink since last year. Speak with your onc for a clearer understanding. Get a second opinion if you are still unsure or uncomfortable with the decision. Good luck - keep us posted!",
      "MessageIndex": 10,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786140",
      "Title": "Best Treatment for Stage IV metastatic breast cancer sgupta EnglishMajor"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 20, 2014 03:46PM barsco1963 wrote: bonita - sending you smiles and hugs. I sure hope that NED realizes what a great hostess you are and returns soon for another stay. Wishing all the best for your Dad as well.",
      "MessageIndex": 5,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824721",
      "Title": "Ned.. has left the Building..!!! What will be next..!!! Bonitaj nbnotes"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 9, 2013 08:11PM barsco1963 wrote: Tina - That is G-R-R-R-R-R-R-E-A-T! It will be even better when you have the report in hand and can read it yourself. Yahoo!",
      "MessageIndex": 2,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809119",
      "Title": "Good PET-CT scan report! Tina2 meima-Bev"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 1, 2013 08:57AM barsco1963 wrote: Kandy - Hoping that you get good news from your onc regarding the MRI. Keep us posted.",
      "MessageIndex": 1762,
      "PostDate": "01/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 5, 2013 08:49PM barsco1963 wrote: papillon - sorry to hear that the lesion on your mum's liver has increased in size. I hope that this new chemo will knock it back for her. Moonflwr - I can't help you out with your question on tx. I only know that tx for stage iv is more about QOL rather than obliterating the beast. Not everyone wants to know the \"what ifs\" or all of the possible SEs of their tx. I encourage you to make sure that your SIL would not be put out if you were to research her tx. However, you can still be a great support for your SIL without knowing all about the tx that she is on. Encourage her to rest if you see that she is pushing too hard, if you think a SE warrants a call to the onc then help her to make the call. As you know, what may be common SEs for one, may be totally different for another.",
      "MessageIndex": 1857,
      "PostDate": "05/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 28, 2013 08:53AM barsco1963 wrote: Hi bak - glad to hear that you are feeling a bit better. Any pain of course causes plenty of anxiety as do scans/tests. Hoping that the pain eases more each day for you. Happy Thanksgiving!",
      "MessageIndex": 1915,
      "PostDate": "28/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 30, 2012 08:15AM barsco1963 wrote: Great news Nancy! I hope Reggie sticks around for a loooooooong while!",
      "MessageIndex": 19,
      "PostDate": "30/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788243",
      "Title": "Thank you for getting me through my fears nbare1952 cheryl1946"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 10, 2012 08:33AM barsco1963 wrote: Tammie - You are in our thoughts and prayers. Best of luck on Monday - waiting to hear B9! ((hugs))",
      "MessageIndex": 19,
      "PostDate": "10/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788868",
      "Title": "5cm mass in lung!!! NOOO tammie Tweety2358"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 25, 2012 08:56AM barsco1963 wrote: Welcome Dana - sorry you had to find us here, but it is a great spot to share experiences, get advice, and to encourage each other. I hope that the tx blows that spot to smithereens!",
      "MessageIndex": 14,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781575",
      "Title": "Just found out.... DanaCox apple"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 21, 2013 10:41PM barsco1963 wrote: C-squared - Sorry to hear of your friend's passing. Condolences to you and to her family.",
      "MessageIndex": 1452,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 10, 2013 12:23PM barsco1963 wrote: Good news Paula! Hopefully you can find something to control the pain from the arthritis though.",
      "MessageIndex": 1496,
      "PostDate": "10/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 14, 2013 08:36AM barsco1963 wrote: 1210donna - sorry that you have so much worry going on. Of course hoping for nothing but the best case scenario for you. Know that we are here for you no matter what the outcome.",
      "MessageIndex": 1584,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 9, 2013 08:00AM barsco1963 wrote: Thanks for sharing Ebru! It is so good to hear that Soliel is soaking up some sunshine in Hawaii. Gave me goosebumps to read such wonderful news! Very happy for her.",
      "MessageIndex": 15,
      "PostDate": "09/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804429",
      "Title": "Happy News from Soleil :) stagefree LuAnnH"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 6, 2013 10:49AM barsco1963 wrote: papillon - sorry that your mom didn't get any resolve on the lack of appetite. It sometimes takes a very concious effort to get any nutrition and some calories into oneself. Sorry I don't have any info regarding the herceptin. I know that others have taken a break from it and other treatments when the body needs to just have a rest. Sending best wishes to your mom. Alicethecat - HOORAY for no cancer found in the gland. Sucks that there are more tests to follow, but it is the only way to get a definite answer. Hoping that there is nothing of great concern found. AlyonA - very happy that no mets were found on your moms xrays/ultrasounds.",
      "MessageIndex": 1685,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 18, 2013 08:48PM barsco1963 wrote: Papillon - what a scare for all of you. Thank goodness your mom is ok. chrissy - looking forward to pics of the wedding. I have faith in you that you will not be attending in your undergarments. lol",
      "MessageIndex": 1738,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 2, 2013 08:55AM barsco1963 wrote: Kandy - ((hugs)) Sorry that the news isn't better. Chrissy and TeheelMichelle have given some good advice. We are all here with you to help you get through the next phase.",
      "MessageIndex": 1769,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 26, 2013 11:13AM barsco1963 wrote: Hi Bak - I too like to garden - it is great therapy. However, I too have back issues (no bone mets) and find that I can only spend short spurts in the garden without my back getting quite sore. Even simple household chores like sweeping, doing dishes etc bother me. I hope that your pain is non-cancer related but as chrissy mentioned, it is a good idea to get it checked out if it doesn't subside with rest and some tlc.",
      "MessageIndex": 1905,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 6, 2013 08:43AM barsco1963 wrote: Papillon - Chrissy is right on when she says that no one knows for sure how long we have. The time with your mom is so precious - concentrate on enjoying your moments that you have together every day. It is good that she doesn't seem to have any pain. Thinking of you and your mom - xo",
      "MessageIndex": 1921,
      "PostDate": "06/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 9, 2012 03:26PM barsco1963 wrote: I had a mastectomy when the cancer was first discovered. Plans were made to beging chemo - then liver mets detected. So taking tamoxifen and zoladex. Cheryl - I have thought the same as you at times. I feel quite well most days and often feel guilty that I am not going through what a lot of other stage IVs are going through. But even though you are not going through the same as some of the others here, you are still dealing with a host of emotions and have a lot of decisions to make. You will find a tremendous amount of non-judgemental support and encouragement from everyone here I hope you continue to check in. You will be glad you did.",
      "MessageIndex": 13,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780694",
      "Title": "Stage IV; no surg,no rads,no chemo cheryl1946 Frapp"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 10, 2012 08:32AM barsco1963 wrote: Gardengumby - Holding onto hope with you that the small nodules spotted are something other than cancer. Keep us posted - ((hugs))",
      "MessageIndex": 152,
      "PostDate": "10/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 10, 2012 03:35PM barsco1963 wrote: Octobergirl - So sorry that you are having to deal with so much right now. It is wonderful that you are able to be with your Mom at this time. I pray that she is at peace and pain free. Instead of calling the onc's office, is it possible to go through your family dr for any testing that might help to explain your symptoms. The cancer center I go to is 2.5 hrs away and going to my family dr is much quicker. She is also very understanding and caring and we have a great relationship. I don't hesitate to call her whereas sometimes I would put off calling the onc. Sending you ((hugs)) and best wishes.",
      "MessageIndex": 290,
      "PostDate": "10/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 1, 2012 09:04PM barsco1963 wrote: velociraptor - a stage IV dx is very scary and often the first thought is that there is not much time. Many women live comfortable with stage IV bc for many years. I hope that your mom is doing well and that she is able to be with you for years to come.",
      "MessageIndex": 412,
      "PostDate": "01/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 7, 2012 10:09PM barsco1963 wrote: Alllison - good luck today - hoping that you get good news! Day - hope you can get some answers soon to what's going on. It is so frustrating at times to try to get an answer in a timely manner.",
      "MessageIndex": 752,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 28, 2012 03:13AM barsco1963 wrote: Interesting to know about the weight loss and liver mets. I do have liver mets - however was not losing weight prior to diagnosis. I have lost a little over 40 lbs (has been gradual) over the past year for no apparent reason. Onc has never mentioned the link between mets & weight loss. He seems to be stumped. Perhaps it is the mets?",
      "MessageIndex": 851,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 6, 2013 04:19PM barsco1963 wrote: reindeer - I am not sure how common it is for no positive nodes to progress to mets, but it does happen. However, the nodule on the lung that is seen is not necessarily mets. It could be scar tissue etc. I hope that you do find this is the case once your dr reviews. Keep us posted.",
      "MessageIndex": 1366,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 26, 2013 07:14AM barsco1963 wrote: So sorry to hear of the loss of another sister. Thoughts and prayers go out to Kimberley's family and friends.",
      "MessageIndex": 9,
      "PostDate": "26/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805206",
      "Title": "Mimi9186 is an angel Latte"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 10, 2014 10:12PM barsco1963 wrote: Love stories and moments like these!",
      "MessageIndex": 5,
      "PostDate": "10/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820961",
      "Title": "Like breast cancer does not exist Mamita49 Fitztwins"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 26, 2013 10:07AM barsco1963 wrote: Mrs M - It is becoming more and more common for organizations to fundraise due to cut backs. However, it can and does get to be overwhelming. We had a babyboom at work and it seemed that there was a baby shower every month. Add that to all of the other requests and I finally had to start saying no. I figured that since the social club gives a gift for babies, weddings etc and I give to the social club each month, then that is my contribution. I don't mind donating to a personal cause such as one of the part timers having an unexpected medical leave for an extended time. As she is single and has no income while off we did a potluck fundraiser for her. I do participate in a couple of events myself each year but will only solicit for one of them at work in a non-obligitory way.",
      "MessageIndex": 12,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801011",
      "Title": "Fundraising: How Much is Too Much? DivineMrsM Brendatrue"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 6, 2014 06:50AM barsco1963 wrote: Hoping that your body is able to regain it's strength so that a new tx can begin.",
      "MessageIndex": 2,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819896",
      "Title": "Plan in place finally debsing chele"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 6, 2013 06:59AM barsco1963 wrote: Wishing you success with the X-factor! May it kick those mets to the curb",
      "MessageIndex": 12,
      "PostDate": "06/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808892",
      "Title": "I'm an X-girl now. kebab NickyJ"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 9, 2011 04:39PM barsco1963 wrote: Keeping the hope alive that treatment will kick in and send this damn disease into submission once again. Sending hugs and prayers for you both.",
      "MessageIndex": 19,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777801",
      "Title": "No Five Alive FiveAlive Traci-----TripNeg"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 13, 2011 03:52PM barsco1963 wrote: mimi9186 - sorry to hear about the lung mets - hoping you can get a tx in place soon annemaloney - welcome. Glad to hear that your body is handling the chemo well. Isn't it funny though how we do consider ourselves \"lucky\" even though we are going through hell at times. It is important to look at the sunny side. Stay positive and best wishes to you.",
      "MessageIndex": 119,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 20, 2011 08:35AM barsco1963 wrote: Mazy1959 - Thank you for your words of encouragement - It means a great deal to myself and I am sure many others here that are struggling to find hope amidst all of the craziness that is going on in our lives.",
      "MessageIndex": 138,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 5, 2012 09:50AM barsco1963 wrote: DawnV - welcome back. Lots of new names (unfortunately) but it is true that this is a place where you can come to find love, support, encouragement. Sorry to hear of the progression to your abdomen. I do hope that the tx works for you and takes care of those invasive cells. Hang in there - keep checking in. Hugs",
      "MessageIndex": 146,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 8, 2012 12:30AM barsco1963 wrote: Thanks for the reminder gritgirl. I have been voting when I remember to do so. Another note to mention is that on Friday March 9, each vote submitted METavivor will receive 10 votes.",
      "MessageIndex": 76,
      "PostDate": "08/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 17, 2012 09:11PM barsco1963 wrote: Beth & MRDRN -  I have multiple liver mets that were discovered through routine scanning. I had no symptoms and still remain asymptomatic. There is a thread started in the stageIV forum that you might want to have a look at - I believe it's titled \"Hey there liver metster\" (sorry I don't know how to create link) Lots of liver metsters giving their experiences. Good luck with all your tests! Keep us posted.",
      "MessageIndex": 194,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 18, 2012 01:39AM barsco1963 wrote: Beth - my mets were discovered about a week after my bc dx. Had been having yearly mammos so everything seems to have appeared within a yr. Although they are not cureable they are definitely treatable! Lots of women/men living for yrs with mets. I am very thankful that I am responding well to tx. Enjoy the day!",
      "MessageIndex": 197,
      "PostDate": "18/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 21, 2012 10:14PM barsco1963 wrote: Cookiegal - Thanks for wanting to include mbc women (and men) in your walk. I take part in the Relay for Life in my community. Our team name was kept the same as always, but this year we decorated our site with the colors of mbc and I was able to get some t-shirts from MBCN.org (they were free). I also had some information pamphlets that I obtained from metavivor.org I don't think that you would be segregating anyone. Awareness and education of mbc is so important. I encourage you to go forward with your idea. PM me if you like - I am also hoping to do a small fundraiser on Oct 13 - mbc awareness day.",
      "MessageIndex": 523,
      "PostDate": "21/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 10, 2012 08:55PM barsco1963 wrote: staystrong - sorry that your mom is going through so much. Chrissy has given some great information and advice. I have nothing to add but do want to let you know that we are all here for you. I hope that the scans are clean and do not show mets. Let us know how the scans go. ((hugs))",
      "MessageIndex": 637,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 30, 2012 08:53AM barsco1963 wrote: paty - sorry that you have progressed to stageIV. If you have not found it yet there is a great thread for Stage IV - come and join us for support, encouragement, information and lots of women willing to share their experiences. It is hard to remain positive all the time so don't be afraid to let your guard down once in a while. IMO I think that others need to see that bc isn't all pink and pretty. We do have fears and can not always be the model of strength that they want/need to see. There are so many treatments available today and I hope that you find the one that will work on that skin tumor.",
      "MessageIndex": 726,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 16, 2012 10:43PM barsco1963 wrote: Hi 7of9 - just want to send you some ((hugs)) and positive vibes. Hoping that the lump you feel is nothing to worry about. Keep us posted.",
      "MessageIndex": 772,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 20, 2012 07:30AM barsco1963 wrote: Just weighing in on the mets topic. Unfortunately cancer has its own regime which is not always predictable. I had cancer in my left breast with numerous nodes affected on the same side. However, the cancer bypassed the bones completely and went straight to the liver. I am still doing well with tx and have a good QOL - stable for 6 mos now!",
      "MessageIndex": 980,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 12, 2013 07:15AM barsco1963 wrote: karody - sorry that you are not feeling well. It was not you that didn't handle the chemo well, it was the chemo that was very rough on you and your body. It is hard not to think of mets every time there is an ache or pain. Often the meds we are given have SEs which cause a lot of aches/pains. I have been told that if the symptom/pain lasts for two weeks or more then it should be checked out. I have just gone through a yr where I was sure that everything was a symptom of progression or new mets. Definitely worrisome. But after all of the scans and testing and now with the help of Ciprilex, I am feeling a bit more relaxed about things. It all takes time and perhaps some anti anxiety drugs to help us enjoy more of the good and push the fears to the back burner. I hope that you are able to get to a place where you are feeling better both physically and emotionally. ((hugs))",
      "MessageIndex": 1119,
      "PostDate": "12/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 29, 2013 10:42PM barsco1963 wrote: Chewy - I have not tried Lupron, but do take an injection of Zoladex every 3 months (along with tamo) to shut down the ovaries. Not sure if this is an option for you or if the SEs would be different for you. I don't have many SEs other than some joint pain. Might be worth asking about. Good luck - I hope that you find some answers and can have a better quality of life soon.",
      "MessageIndex": 1096,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 14, 2013 09:15PM barsco1963 wrote: Hi Nicky - welcome. Sorry that you have any experience with this damn disease. However, I am glad that you did find BCO. It is a wonderful place to meet lots of wonderful people who care. Please join us on the stage iv thread also if you haven't already.",
      "MessageIndex": 1314,
      "PostDate": "14/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 1, 2013 09:19PM barsco1963 wrote: Jenn230 - Congratulations on the birth of your baby girl. What a blessing. You have certainly had more than enough to deal with lately. I sure hope that your oncs lack of concern turns out to be right on the money and that the spot is a cyst as he believes. I am sure the CT is to just confirm his thoughts. Try not to spend too much time worrying (harder said then done, I know). Keep yourself busy with that beautiful baby girl, go out for a walk, etc. Hang in there and come back to let us know how you make out.",
      "MessageIndex": 1213,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 8, 2013 07:09AM barsco1963 wrote: Rain - the \"no nothing\" comment also has me concerned. As the others have said there are many many options out there. I would be running to another dr if your current one is not looking at those other tx. Good luck - keep us posted.",
      "MessageIndex": 1377,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 9, 2013 07:21AM barsco1963 wrote: Rain - glad you clarified things for us. As you can tell we are a protective bunch and really do care about our sisters here. Sounds like your onc is on track with ensuring that you do get the appropriate tx . As Chrissy said, a couple of weeks wait is not going to prove a problem. Hang in there and keep us posted.",
      "MessageIndex": 1385,
      "PostDate": "09/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 16, 2013 08:49PM barsco1963 wrote: JanM - Cecile seems to be at peace knowing that she is nearing her final days. How wonderful that she will have her family and yourself at her side as she makes the transition. You are a wonderful friend to have. And like chrissy said, we are here for you whenever you need us to be. ((hugs))",
      "MessageIndex": 1595,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 18, 2013 07:17PM barsco1963 wrote: C-squared - I will keep your friend in my thoughts and prayers. Hoping that she will be able to fight off the infection and begin to heal. It is sad to know that so many women with young children are having to deal with all of the crap that goes with this vicious disease. Please know that there have been many women who have dealt with terrible illness and have found themselves able to get back to where they are doing well again.",
      "MessageIndex": 1438,
      "PostDate": "18/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 17, 2013 09:41PM barsco1963 wrote: HVV - Here's hoping that you won't be posting in the stage iv thread. Best of luck for good results from the scans.",
      "MessageIndex": 1598,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 19, 2013 08:27AM barsco1963 wrote: Grammy - sorry that you are once again dealing with so much anxiety. Best of luck with the biopsies and as Chrissy mentioned, there are many tx out there to try. Keep us posted on how you are doing. Hoping for the best possible outcome for you. HVV - glad to hear that organs are clear. Keep us updated on results as you go forward.",
      "MessageIndex": 1603,
      "PostDate": "19/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 24, 2013 08:54PM barsco1963 wrote: rachelvk - hope the xray shows nothing of great concern. Fingers crossed for you.",
      "MessageIndex": 1611,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 7, 2013 08:06AM barsco1963 wrote: Paula - sounds like good news to me! Praying the surgeon finds nothing but arthritis!",
      "MessageIndex": 1489,
      "PostDate": "07/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 2, 2013 04:07PM barsco1963 wrote: papillon - hoping that the visit with your mom's onc went well today. I do hope that he has some suggestions as to how your mom might once again be able to eat some of the foods that she once found enjoyable. I have liver mets and struggle with similar issues. I know it is difficult not to have the healthy appetite that was there pre-cancer and forcing oneself to eat is quite a challenge.",
      "MessageIndex": 1667,
      "PostDate": "02/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 4, 2013 08:57PM barsco1963 wrote: Alice - I agree that it is frustrating at times to have to go through so much to get an answer. But it is best to be sure as to what is going on. Hoping to hear from you next that the biopsy confirmed benign. Keep us posted. xo",
      "MessageIndex": 1565,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 28, 2013 09:28AM barsco1963 wrote: Kandy - No offence, but I really don't want to see you on the stage iv threads. I found a post from Dec 2012 regarding sclerotic lesions, which are described as build up of the bone. Here is the link - http://community.breastcancer.org/forum/8/topic/797174  I hope that it helps somewhat. I am hoping that the lesion on your pelvis is nothing more than an old injury. Keep us posted. graceforme - same sentiment goes out to you. I really hope that you aren't making your way to the stage iv boards. I do wish that the medical profession would shake the whole \"bc doesn't hurt\" thing. Mine was quite painful also. So glad that you were persistent in getting it checked. I have heard that chemo can cause ongoing pain for a while after tx is finished. I don't have any experience with chemo so hopefully someone with more knowledge will pop in to comment. Is there a chemo thread with others that have gone through chemo at the same time as you? Perhaps you could post there also. Hopefully the pain will start to ease up for you soon.",
      "MessageIndex": 1755,
      "PostDate": "28/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 13, 2013 07:26PM barsco1963 wrote: Soteria - I too am very thankful that Chrissy started this thread. It is not only helpful to earlier stages, but also to me as a stage iv gal. I have learned a great deal from all of the questions asked and answered. I really think that Chrissy has done an AWESOME job replying to all of the questions with her vast knowledge. My knowledge is limited at this point, but I can give encouragement, support and hugs galore to those in need. After all - we are all here for one another through the good, the bad, and the ugly.",
      "MessageIndex": 1641,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 10, 2013 05:20PM barsco1963 wrote: misswim - That is awesome news! So very happy for you.",
      "MessageIndex": 1805,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 5, 2013 09:18PM barsco1963 wrote: canadagirl - just popping in to wish your mom a stress free MRI. Hope she makes it through with no problems.",
      "MessageIndex": 1679,
      "PostDate": "05/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 17, 2013 08:41PM barsco1963 wrote: Oh dutchiris. Sorry you didn't get better news. Keep us posted on how things go on Monday.",
      "MessageIndex": 1819,
      "PostDate": "17/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 6, 2013 08:52AM barsco1963 wrote: moonflwr - I can tell that you definitely have your SILs health and well being at the top of your list. There has been a lot to deal with in your family as of late. Best wishes to you all.",
      "MessageIndex": 1859,
      "PostDate": "06/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 12, 2012 08:52AM barsco1963 wrote: I think that coolbreeze explained it well. I am relatively high ER+ and am on tamox as well as zoladex to suppress ovaries. It is working very well. I am 48 and when asked, my onc is not in favour of removing ovaries at this time. Definitely a discussion to have with your Drs.",
      "MessageIndex": 174,
      "PostDate": "12/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 13, 2012 12:26AM barsco1963 wrote: Phew! What a relief for you gardengumby. There are way too many freak-out words when dealing with cancer. I am glad that you are able to breathe again and move on to brighter days ahead!",
      "MessageIndex": 178,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 20, 2012 02:59AM barsco1963 wrote: mrsbmw81 - Praying for your MIL that God will wrap his arms around her and comfort her at this time. My thoughts are with you and your family at this difficult time.",
      "MessageIndex": 216,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 12, 2012 09:40PM - edited Jun 12, 2012 09:41PM by barsco1963 kayb - will be thinking of you this morning as you get your MRI done. I am usually an optomist, but will be thinking negative (as in neg. results) for you today. Keep us posted!",
      "MessageIndex": 470,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 13, 2012 09:15PM barsco1963 wrote: kayb - HOORAY!  So glad that you were able to get results right away AND that they were negative!!",
      "MessageIndex": 472,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 16, 2012 09:54PM barsco1963 wrote: Good luck on the 25th Psalm. Will be thinking of you and hoping for a good report!",
      "MessageIndex": 478,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 15, 2013 01:54PM barsco1963 wrote: Angela - I agree with blondie. Any doctor that says he cannot help you is not worth your trying to convince him that he can. Get a 2nd opinion. And yes, come to the stage IV group. Lots of wonderful people there to help you through anything that might come along.",
      "MessageIndex": 1038,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 6, 2013 05:19AM barsco1963 wrote: ProudMom - so glad to hear that there is no mets. Now to get that pain under control! Hopefully it will be sooner rather than later.",
      "MessageIndex": 1110,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 16, 2013 05:27PM barsco1963 wrote: Alice - we will all be waiting with you hoping for nothing but B9 results from your scan.  ",
      "MessageIndex": 1516,
      "PostDate": "16/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 16, 2013 08:40PM barsco1963 wrote: donna - I like what you are doing to create your space so that your spirit can live on and your loved ones will have a place to visit your obviously very generous and loving spirit. I am glad that you are able to find the good in every day and remain cheery. It is often easy to \"wallow\", which is ok for short stints, but it is so important to enjoy life while we have it. ",
      "MessageIndex": 1594,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 14, 2013 10:03AM barsco1963 wrote: shore1 - Yes, the aches and pains that plague us after a bc dx can definitely be worriesome. Thank you for reassurance that there are many, many other possibilities for the discomfort/pain other than bc. Of course you are right that any problems that last for more than 2 weeks or so should be brought to your drs attention. Glad that you are enjoying your summer!",
      "MessageIndex": 1646,
      "PostDate": "14/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 28, 2012 03:18PM barsco1963 wrote: NED is my hero - I really hope to meet him someday also. Soooooooooo happy for you and glad that you are doing great!",
      "MessageIndex": 24,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784787",
      "Title": "Still NED 17 months after radiation lorrhaw Charley"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 19, 2012 11:07AM barsco1963 wrote: Ashley - first of all, congratulations on the birth of your baby. Is it a boy or a girl? Second - take a deep breath, put the report in your bag and take it out only when you are with the surgeon. I know it is scary to think what \"might be\". Your surgeon will have be able to answer your questions. Make a list of questions that you do have so that you don't forget to ask any of them. Hang in there. Let us know how you make out.",
      "MessageIndex": 1,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781287",
      "Title": "Just read the radiologist's report...wish I wouldn't have AshleyR86 awb"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 10, 2013 09:16PM barsco1963 wrote: LuAnn - sorry that you will be spending Mother's day weekend in the hospital. But it is probably the best place to be under the circumstances. Wishing you a speedy recovery and lots of hugs and love from your kids. Perhaps you will get a special yummy treat on Sunday!",
      "MessageIndex": 1,
      "PostDate": "10/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804510",
      "Title": "Quick update, back in the hospital.... LuAnnH dmacw"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 5, 2013 08:34PM barsco1963 wrote: Wishing you safe travels and best wishes for a smooth delivery of a happy, healthy baby.",
      "MessageIndex": 4,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801428",
      "Title": "I know I have been MIA but wish my family luck tomorrow! LuAnnH Kaelia"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 30, 2012 08:00AM barsco1963 wrote: Manmieyol - I too have multiple liver mets and am being treated with hormonals rather than chemo at this point. So there are various options that you can discuss with your Mom's onc. Stage IV is definitely scary, not curable but certainly treatable. I hope that your mom finds a tx that will work well for her. She is lucky to have you by her side. Hang in there and keep us posted.",
      "MessageIndex": 3,
      "PostDate": "30/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786672",
      "Title": "Stage IV breast cancer spread to liver. manmieyol FiveAlive"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 7, 2011 08:10AM barsco1963 wrote: Great to hear such good news!",
      "MessageIndex": 38,
      "PostDate": "07/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777446",
      "Title": "The trial is working!!!! AngelaMBlack72 barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 30, 2013 07:37AM barsco1963 wrote: Sorry to hear you are in hospital. Sending you healing vibe so that you can get better and get home to that sweet wee boy. Thanks for sharing the pics. Looks like one heck of a party! Love the cookie monster cookies.",
      "MessageIndex": 14,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804017",
      "Title": "Noah's 1st Bday! Trying once again Evans1128 LuAnnH"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 16, 2013 06:46PM barsco1963 wrote: cheryl - sorry that the faslodex didn't help. Sure hoping that the tamoxifen will work much better for you. It has done me very well.",
      "MessageIndex": 8,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803214",
      "Title": "Faslodex didn't work cheryl1946 susan_02143"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 20, 2013 08:18AM barsco1963 wrote: cheryl - sorry that scan results were not great. Hoping that Xeloda kicks some cancer ass but is gentle on yourself.",
      "MessageIndex": 7,
      "PostDate": "20/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807954",
      "Title": "PET/CT any thoughts? cheryl1946 bhd1"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "barsco1963 wrote: I just want to share some good news with everyone. I had a CT scan today and it is showing that all of the lesions on my liver continue to decrease in size. It is a great start to 2012 for myself and my family. My wish for all is a peaceful and contented 2012 filled with good health, many new memories and tons of laughter and love. It isn't knowing the worst, the worst is not knowing. Dx 5/30/2011, IDC, 4cm, Stage IV, Grade 2, 21/29 nodes, mets, ER+/PR+, HER2- Hormonal Therapy 7/24/2011 Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780408",
      "Title": "Some good news! barsco1963 holding92"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 12, 2012 07:53AM barsco1963 wrote: Excellent news Fitztwins! Bring on the good news.... celebrate.......enjoy.",
      "MessageIndex": 63,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780879",
      "Title": "Survivor Guilt - I am a lucky girl Fitztwins nancyh"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 9, 2012 09:56PM barsco1963 wrote: Welcome mominsnj - sorry for the reason that you are joining us, but as you can see already, there is terrific support, encouragement and advice here. No matter what questions you might have, there is often somebody that has experienced the same thing. So ask away! We are all here for one another. I hope that the SEs from chemo do ease up for you, but it sounds like the treatment is kickin butt if you have some shrinkage. Shrinkage is definitely a good thing here! Bon suggested getting copies of all of your test reports/results. This will help to understand what is happening. Also writing down any questions that you have is important so that you can ask your onc about what is going on. Hang in there! ((hugs))",
      "MessageIndex": 6,
      "PostDate": "09/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785492",
      "Title": "trying to figure out where i fit in here mominsnj LuAnnH"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 9, 2012 09:43AM barsco1963 wrote:  lowrider - What an explosive way to start the day! Yikes Great stories ladies! As the saying goes,  \"laughter is the best medicine\" Thanks for providing my daily dose!  I had a similar explosive episode in a restaurant with a bottle of. My sisters and I were out for a girls weekend and had stopped for lunch at a little diner. Our food arrived and everyone knows that fries need ketchup right? And of course the ketchup bottle must be shaken with vigor prior to pouring. Well, you can maybe guess what happened...... yup - the top of the ketchup bottle was not on tight and there was ketchup everywhere! My sister beside me got the worst of it. (thank goodness there was a wall not other patrons behind us). I was still picking dried ketchup from my ears that night.",
      "MessageIndex": 15,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790256",
      "Title": "Share a Funny... Lowrider54 barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 3, 2012 02:37PM barsco1963 wrote: Hi - I am 48 and was diagnosed last yr at 47 yrs old. I cannot believe how naive I was before dx - I have learned so much in the past 8 months. While looking through some reading material that was sent home from hospital with me - I found bc.org and checked it out. About a week after umx a CT scan showed spots on my liver. I was devastated. But a US guided biopsy noted that it was not cancer. Hooray!! But - wait a minute - the doctor also noted that he could not be sure he got a good sample as the US was not very clear and it was hard to see. So a second CT guided biopsy was ordered and confirmed mets. :( On one hand I was glad that I would not have to do chemo & rads (not now at least), but on the other hand...........mets. I am still at odds with how to deal with it - most days are good. I have an \"it is what it is\" attitude. The tx is working very well  (tamo & zoladex) as tumors continue to shrink. So I concentrate on that and try to appreciate each day that I am given. I have a wonderful support network of family and friends, which I am truly thankful for. There is so much inspiration and support here. I don't post a lot, but do read a lot of threads and try to post words of encouragement and support when I can. I look forward to being here for a long, long time. Barb",
      "MessageIndex": 57,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781871",
      "Title": "...And you are? EnglishMajor keepingon"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 10, 2012 01:22PM barsco1963 wrote: TexasKaren - Your post made me smile. It sounds like a win/win situation.",
      "MessageIndex": 97,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781871",
      "Title": "...And you are? EnglishMajor keepingon"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 26, 2013 07:08AM barsco1963 wrote: ashell - I will certainly join you - misery loves company right? lol I have been dealing with nausea for over a yr now. I am sure that mine is caused by the tamo but am not willing to give it up as it has been a great matchmaker for me. (introduced me to stable boy!). I do find sometimes that peppermint tea or ginger tea help out. For the ginger tea - I peel and cut up a small piece of ginger root and add it to boiling water. Hopefully the nausea will subside for you soon.",
      "MessageIndex": 1,
      "PostDate": "26/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/805205",
      "Title": "Nausea is my nemesis ashell Sassa"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 21, 2012 08:00AM barsco1963 wrote: Oh Alesta - so very sorry to hear the news. Hoping that they find a great tx for you and that the next 4 yrs come and go plus many, many more. We are here to help you pick up the pieces. Sending you big ((((HUGS)))) and best wishes.",
      "MessageIndex": 4,
      "PostDate": "21/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787820",
      "Title": "And the crap news today is... alesta29 LauraOntario"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 26, 2013 08:23AM barsco1963 wrote: EM - another wonderful video. Thanks so much for sharing your story and continuing to bring the need for more research dollars to go toward mbc.",
      "MessageIndex": 13,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809938",
      "Title": "New Video, Feedback Please... EnglishMajor AnacortesGirl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 10, 2014 08:38AM - edited Nov 10, 2014 08:39AM by barsco1963 Ah we all have something don't we. Mine is dusting (and cobwebs)...I can let it go for weeks. If we have company (which isn't too often) I will do a quick swipe of the obvious and the rest will collect until I get the ambition to tackle it. Might as well make it worthwhile right? Another \"shame\" is shaving - legs and pits tend to get ignored in the colder weather. Out of sight out of mind. :-} (supposed to be an embarrassed smiley face)",
      "MessageIndex": 3,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/826137",
      "Title": "Housekeeping Hall of Shame blainejennifer mirryp"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 24, 2013 08:48PM barsco1963 wrote: Ebru - thank you for sharing. A very interesting way to look at what the future holds.",
      "MessageIndex": 12,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803749",
      "Title": "This one for Soleil, also a must-read for ALL ..trust me :) stagefree NickyJ"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 1, 2013 04:53PM barsco1963 wrote: I have been getting scans every 3 mos since June of 2011. Although all is going well I don't think I would be comfortable going anymore than 6 mos between scans.",
      "MessageIndex": 11,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799726",
      "Title": "went to onc yesterday chris1959 blainejennifer"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 14, 2013 09:57PM barsco1963 wrote: So happy that things are working out well for you Bobbi! Hope your new BFF will kick all of those mets to the curb.",
      "MessageIndex": 25,
      "PostDate": "14/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803103",
      "Title": "Afinitor is my new BFF BaseballFan sueco"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 3, 2013 07:51AM barsco1963 wrote: Some great questions cm - looking forward to reading Linda's answers. There are so many stories amongst us all.",
      "MessageIndex": 1,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804149",
      "Title": "Five Questions - Frankandfernsmom cmhartley texasrose361"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 15, 2013 01:32PM barsco1963 wrote: Linda - so good to get to know you a bit better. You do seem to have a great cheery attitude. It makes me smile. Best of luck with the cyberknife procedure. Show that pesky liver met who is boss!",
      "MessageIndex": 16,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804149",
      "Title": "Five Questions - Frankandfernsmom cmhartley texasrose361"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 28, 2013 09:35PM barsco1963 wrote: Tammie - so sorry that you are having to deal with all of this. No doubt you are scared! I hope that all of the love and support from everyone here brings you some comfort. I hope that xeloda knocks all of the mets back to nothing. ((Hugs))",
      "MessageIndex": 24,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801144",
      "Title": "SH*** gone from bad to worse in a day.. PISSED N SCARED! tammie justjudie"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 18, 2013 09:02AM barsco1963 wrote: Dbla - sorry for the pain that you are experiencing. I hope that it can be brought under control soon and that the next tx option kicks the crap out of those mets. ",
      "MessageIndex": 11,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811171",
      "Title": "So there I was...... dbla RangerMom"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 3, 2012 11:35AM barsco1963 wrote: Thank goodness! You must be so relieved. B9 is the best combination of letter/number that I can think of. Congrats!!!",
      "MessageIndex": 13,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/781960",
      "Title": "biopsy today, scared rezski Thatgirl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 17, 2012 08:44AM barsco1963 wrote: Hoping NED hangs out with you for a looooooong time yet. Good luck today.",
      "MessageIndex": 26,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782795",
      "Title": "Scans tomorrow CoolBreeze dawny"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 5, 2013 05:05PM barsco1963 wrote: Thinking of you Nancy - You have a lot of prayers and thoughts coming your way daily. Good to hear thTat you are doing well! No need to worry about posting - just concentrate on continuing to heal. xo",
      "MessageIndex": 184,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807898",
      "Title": "Update on me - brain surgery scheduled nancyh RonnieKay"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 13, 2013 07:56AM barsco1963 wrote: YAY for no mets!! I hope that you do find what is causing your headaches and can get them under control!",
      "MessageIndex": 21,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801747",
      "Title": "Brain MRI - Negative :-) JeninMichigan Leah_S"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 27, 2012 09:22AM barsco1963 wrote: We have a wonderfully large whirlpool bathtub that rarely gets used due to the amount of water it takes to fill it. After reading these posts though, I think I will be getting some bath bubbles and jumping in!",
      "MessageIndex": 15,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781685",
      "Title": "Let's pamper ourselves ma111 Moderators"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 12, 2013 12:52PM barsco1963 wrote: stern - sorry that you have found your way to stage IV - certainly not where anyone wants to be. I was dx with liver mets from the beginning. Have been on tamo and zoladex injections for about 1.5 yrs and it is working very well for me. Shrinkage of 8 tumors down to only 2 measurable ones and they have been stable for about 6 mos. I hope that your tx works to get rid of all of those little buggers. Hang in there.",
      "MessageIndex": 1,
      "PostDate": "12/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800367",
      "Title": "Still under shock stern jeanieb2"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 9, 2011 03:41PM barsco1963 wrote: Hi Angel - I don't know a lot about fibroadenoma other than what I have read on the internet. It seems that there is so much that can go on within the breast. Your pain could be a number of things. I encourage you to keep on your Drs until you have peace of mind. There is an older thread on this site called \"Can Fibroadenoma be really painful?\" I actually googled \"fibroadenoma pain\" which lead me to the thread - was first post that came up on google. You may find some helpful info there. I believe that some women had the fibroadenoma removed. I do hope that you can get some resolution to all of this pain. Best of luck - keep us posted. Barb",
      "MessageIndex": 1,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777820",
      "Title": "Need advice - Pain in breast Angelskay glesin"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 18, 2013 11:22AM barsco1963 wrote: I have recently noticed very achy hips/legs/knees. I have been on tamoxifen since dx. Not sure if it is the tamo but hoping that it isn't bone mets making an appearance. I do have a bone scan coming up which will tell me soon enough.",
      "MessageIndex": 4,
      "PostDate": "18/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801946",
      "Title": "Faslodex and aching legs/hip sueco cheryl1946"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 2, 2013 07:33PM barsco1963 wrote: So very sorry for the loss of your dear friend. It sounds like she inspired all those around her. May she rest in peace.",
      "MessageIndex": 19,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799835",
      "Title": "Lost a friend nancyh SusanR"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 16, 2013 08:57PM barsco1963 wrote: Sweeeeet! Go Navy!  Very happy for you lotusblossom - a great reason for celebration. WooHoo!",
      "MessageIndex": 13,
      "PostDate": "16/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804780",
      "Title": "Thought it had stopped working but... lotusblossom tortoise"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 9, 2012 12:05AM barsco1963 wrote: Sending warm thoughts and prayers to you all. God bless.",
      "MessageIndex": 44,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783793",
      "Title": "In hospital again PizzaDad soleil505"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 10, 2012 01:29PM barsco1963 wrote: Hi all - I hope that I am not imposing on this thread. I do not have lymphedema, but did have MX with AND (no chemo/no rads). I am wondering if there would be any risk if I were to fly - would be a short flight 1-1/2 hrs. Thank you for your input.",
      "MessageIndex": 36,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/791246",
      "Title": "Thinking about flying cookiegal barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 26, 2012 07:36AM barsco1963 wrote: Thank you for the advice on flying - followed the precautions you mentioned and so far so good. Flew on Friday (no sleeve) and although it was a short flight there was a stop over, so it was like two flights in one day. I haven't noticed any swelling. Good ole Air Canada bumped us from coach to 1st class for the first (and longest) leg of the journey! That was a bonus. Wishing everyone a good week ahead!",
      "MessageIndex": 60,
      "PostDate": "26/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/791246",
      "Title": "Thinking about flying cookiegal barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 30, 2013 02:01PM barsco1963 wrote: Karen - What a terrible experience while undergoing \"care\" at the hospital. I do hope that each incident is written up. Thank goodness that you are now home and resting. Hoping those antibiotics work their magic and your recovery is quick.",
      "MessageIndex": 7,
      "PostDate": "30/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813797",
      "Title": "Brain Infection Karen2012 Padiddle"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 2, 2012 09:13AM barsco1963 wrote: Sorry to hear of your not so great news. Keeping you in my thoughts. ((hugs))",
      "MessageIndex": 92,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783375",
      "Title": "Scan Results Tomorrow CoolBreeze Brendatrue"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 8, 2013 07:56PM barsco1963 wrote: Jean - so glad that you have found success with this chemo. I hope that it will continue to treat you well for a very looooooong time to come. Happy! Happy! Happy!",
      "MessageIndex": 23,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801565",
      "Title": "On my third type of chemo and my.......... Padiddle Kandy"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 19, 2013 08:39PM barsco1963 wrote: Awsome - dance the night away! Great news!",
      "MessageIndex": 4,
      "PostDate": "19/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802058",
      "Title": "Stable! 33skidoo Australia"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 13, 2013 09:49AM barsco1963 wrote: Welcome Brandi - sorry that your dx has led you to stage IV but you will definitely find support and encouragement from everyone here. Very happy to hear that the mets have responded so well to tx. I sure hope NED hangs out with you for a very long time. Have a blast at WDW!!",
      "MessageIndex": 26,
      "PostDate": "13/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798717",
      "Title": "brandall introduction brandall texasrose361"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 7, 2012 08:57AM barsco1963 wrote: bhd1 - sorry that the chemo didn't work for you and that you have to go through all of this. I hope that you can soon find the right mix that does work.",
      "MessageIndex": 6,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780495",
      "Title": "failed chemo bhd1 30DEBBIE"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 25, 2013 07:59AM barsco1963 wrote: So good to hear that Nancy is doing well. Hoping for a quick recovery and good pain management. Gentle ((hugs)) and lots and lots of love and smiles.",
      "MessageIndex": 116,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807898",
      "Title": "Update on me - brain surgery scheduled nancyh RonnieKay"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 25, 2014 10:37AM barsco1963 wrote: HOORAY! Terrific news - celebrate, dance, enjoy!",
      "MessageIndex": 15,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820490",
      "Title": "NED.....Yeah..... Mamita49 bhd1"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 1, 2014 05:53PM barsco1963 wrote: Hi Kaye - welcome to our little corner of the world. Here you will find informative, supportive, encouraging, loving women who are here for you and for each other. I pray that you will find an organization that will be able to help you get the treatment that you need. Keep us posted on how you are doing - we care.",
      "MessageIndex": 7,
      "PostDate": "01/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823279",
      "Title": "Possible bone and liver mets & no insurance. Lost and helpless. Kayebeko Bestbird"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 21, 2012 05:49AM barsco1963 wrote: I have always been one to go with what's practical rather than what's esthetically pleasing. I can't seem to justify buying new dishes when the one's I have (that my mom gave me about 15 yrs ago - grocery store collection) are still useable. We did however invest in a new bed with headboard and side stands at one time - but now that I think about it, that was likely at least 10 yrs ago (yikes). And we do have a matching leather couch and chair in the living room but only because the previous tenants didn't want to move it. I am a thrift store junkie and love to find a bargain anywhere along the way no matter whether it matches or not.",
      "MessageIndex": 10,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793841",
      "Title": "I've never.... Mzmerz DivineMrsM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 19, 2014 08:25PM barsco1963 wrote: Saw the same link on fb and saved it to my favourites. Will definitely be having a look at it. Great idea to share it here MrsM",
      "MessageIndex": 3,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822070",
      "Title": "Pinterest and metastatic breast cancer DivineMrsM exbrnxgrl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 10, 2012 07:02PM barsco1963 wrote: Binney - thanks so much for the warm welcome and all of the info. I have been fortunate so far that I have not had any swelling in the year since my mx. I do realize that we are never out of the woods so to speak and I will certainly take the precautions that you noted. I will have to try and track down an LE therapist - I don't think that there are many in my little neck of the woods though. Will likely have to travel some distance to find one. Will let you know how I make out upon return! Flight is not till 24th. Have a great weekend!",
      "MessageIndex": 39,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/791246",
      "Title": "Thinking about flying cookiegal barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 30, 2013 12:32AM barsco1963 wrote: Great article - I just saw it on fb and will be sharing!",
      "MessageIndex": 12,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811904",
      "Title": "My MBC Article in the Tribune Bestbird Linda-n3"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 3, 2011 09:37AM barsco1963 wrote: Karen - I know it is difficult sometimes to bask in the positive when in the back of your mind there is the unknown. And a slight improvement might not be what was hoped for but I take improvement of any kind as a good thing. I was found to have liver mets about a week after my mastectomy and it reallly through me for a loop. I have been fortunate that my treatments are working well so far. I feel well and have a great support network around me. Remeber that you are not alone. It is important to share with your friends/family so that they too can understand what you are going through a bit better.This site is great with lots of information and women who care. Keep the happy thoughts to the forefront! :)",
      "MessageIndex": 3,
      "PostDate": "03/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777465",
      "Title": "why is it that i feel down when i am making everyone feel up LilSchatzie joaniji"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 23, 2012 08:53AM barsco1963 wrote: Sue - so sorry that you are having to deal with all of this. I hope that you are able to find some assistance through some of the organizations referred by the others. Sending ((hugs)) and smiles. I hope that things soon start to get better for you soon!",
      "MessageIndex": 12,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781439",
      "Title": "Pain and the Week From He*ll - Need a Boost 37antiques Leah_S"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 13, 2014 03:26AM barsco1963 wrote: Happy Dance! Great news.",
      "MessageIndex": 23,
      "PostDate": "13/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824467",
      "Title": "Stable kayrnic SonnyB"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 8, 2012 07:38AM barsco1963 wrote: Marybetz - I too have liver mets and have had pain in the liver area for quite a while now. Scans continue to show lesions are still shrinking. US has shown gall stones. Not sure if this is causing the pain or not but was glad to know no progression. Hoping that the stabbing pain you are feeling is something other than progression!",
      "MessageIndex": 83,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781871",
      "Title": "...And you are? EnglishMajor keepingon"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 4, 2014 06:03PM barsco1963 wrote: Hi Curlygirly - sorry to be welcoming you to the stage iv forum. I too was dx with mets from the beginning (liver) and am very grateful for all of the support, encouragement and friends found here. Take one day at a time - as Chrissy mentioned, that little pill packs a potent punch. Hormonals were my first treatment and are still working well for me almost 2.5 yrs later. Come by often to let us know how you are doing and to ask any questions that my come to mind. We are all here for you.",
      "MessageIndex": 8,
      "PostDate": "04/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819867",
      "Title": "From a lump to stage 4 within a month! What now ....... curleygirly Mompsych"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 1, 2013 08:48PM barsco1963 wrote: So sorry to hear of the passing of another sister. Thoughts and prayers go out to Janice's family and friends.",
      "MessageIndex": 19,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804083",
      "Title": "A Stage IV member has passed... greenacres cmhartley"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 12, 2013 09:17PM barsco1963 wrote: Sending hugs and prayers your way. I hope that tomorrow brings hope for a tx that can work for you.",
      "MessageIndex": 27,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806021",
      "Title": "out of options onedayatatime NickyJ"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 23, 2013 11:48AM barsco1963 wrote: So sorry for the loss of your mom Shannon. I am glad that you and your familly were able to be with her for her last days. Thoughts and prayers go out to you, your family and friends at this time of sadness. Rest In Peace Marsha.",
      "MessageIndex": 68,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806021",
      "Title": "out of options onedayatatime NickyJ"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 14, 2012 07:46AM barsco1963 wrote: Hooray for good news!",
      "MessageIndex": 6,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785788",
      "Title": "YES! Happy Friday the 13th nancyh GatorGal"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 29, 2013 08:06PM barsco1963 wrote: Another young life taken far too soon from this horrible disease. Very saddened to hear of Jen's passing.",
      "MessageIndex": 3,
      "PostDate": "29/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811879",
      "Title": "Jen Smith, Author and Stage IV advocate, is an angel kayrnic Bestbird"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 28, 2013 09:20AM barsco1963 wrote: thisisme - Ugghh is right! Weight always seems to be an issue when dealing with this cancer crap, treatments etc. I know that being thrown into menopause can certainly be one of the culprits to weight gain. It sounds like you would like to get rid of it so I would encourage you to keep trying. Talk to your dr to see if you haven't already - or maybe even a dietitian for some helpful hints. Hang in there!",
      "MessageIndex": 1,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803924",
      "Title": "Weight.....crap thisisme justjudie"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 6, 2012 09:30AM barsco1963 wrote: Crap, crap, crap! Sorry to hear that there is progression. Count me in on hoping that the next tx will work much better at kicking cancer in the youknowwhat! Best of luck - sending good vibes and prayers your way.",
      "MessageIndex": 21,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788629",
      "Title": "Hmmmm...tears? JillThut CoolBreeze"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 3, 2013 08:52PM barsco1963 wrote: I've been discovering the local talent lately. Went to a Youth showcase a couple of weeks ago. Intimate venue - awesome talent from 9 yrs to 19 yrs. Loved it - can't wait to get out to more. It's good for the soul! cmhartley - would love to see Carrie Underwood. Fabulous talent - great lady.",
      "MessageIndex": 7,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804179",
      "Title": "My cure for My fatigue. How many love this? K-Lo barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 12, 2012 08:46AM barsco1963 wrote: Hi melissa and momma - Waiting and worrying go hand in hand. It is hard - waiting to get tested, retested and then waiting for results. Try to keep yourself busy and stay away from the internet - it only borrows trouble at this point. 2 weeks is not too long to wait for testing - nothing will change between now and then. I hope that both of you can get your testing done sooner rather than later and that both have good results. Hang in there - keep us posted - we are here to support, encourage, listen and celebrate!",
      "MessageIndex": 4,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793411",
      "Title": "New Here, with questions !!! Melissa_P sewingnut"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 23, 2013 07:31AM barsco1963 wrote: Sorry that Reggie has left. I know that you were really looking forward to meeting NED. Maybe Madam X will introduce you to him. Sending ((hugs)) your way.",
      "MessageIndex": 7,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799283",
      "Title": "No NED, and now Reggie is gone, too! BouncingBetties soleil505"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 30, 2012 01:19PM barsco1963 wrote: Apple - sorry that you are facing another surgery. I pray that all goes well and you recover in record time. Sending positive vibes and ((hugs)) your way.",
      "MessageIndex": 24,
      "PostDate": "30/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788269",
      "Title": "it's always something apple K-Lo"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 9, 2012 07:55AM barsco1963 wrote: thradia - Hang in there. Waiting and the unknown drive us all crazy. Hoping that the US shows nothing of concern.",
      "MessageIndex": 2,
      "PostDate": "09/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787178",
      "Title": "US tomorrow thradia thradia"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 31, 2011 10:09AM barsco1963 wrote: Yes, God bless us all.",
      "MessageIndex": 2,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780267",
      "Title": "my o my apple Iwillwinthisbattle"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 5, 2013 06:19PM barsco1963 wrote: Tiger lol - Like your Dr says.... whatever works for you.  I hesitate to smoke it due to being \"smoke free\" for a number of years now. Really don't want to have any opportunity to start up again. However, I have thought of baking it into some brownies.",
      "MessageIndex": 11,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801358",
      "Title": "meds to help you eat/gain weight allisontom911 Heidihill"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 29, 2014 02:20PM barsco1963 wrote: Congrats on your first publication! It is so very important to get the word out there about mbc and what it is and what it can do. Thanks for doing that!",
      "MessageIndex": 1,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/821505",
      "Title": "I had an article published! (first time) :) Springlakegirl cookiegal"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 28, 2013 07:34AM barsco1963 wrote: Happy, happy, happy!!! Such a relief to know that it is now official.",
      "MessageIndex": 44,
      "PostDate": "28/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809990",
      "Title": "It official ..... NED still loves me!! JeninMichigan aic"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 4, 2013 07:26PM barsco1963 wrote: Tiger - what is the natural alternative that you use? I think that I would like to try something natural after trying numerous prescriptions that haven't quite done the trick.",
      "MessageIndex": 6,
      "PostDate": "04/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801358",
      "Title": "meds to help you eat/gain weight allisontom911 Heidihill"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 25, 2013 06:15AM barsco1963 wrote: hendricks - so sorry to hear about this new hurdle. I hope the new tx really takes care of those new mets. Sending ((hugs)) and smiles your way. Keep us posted on how you are doing.",
      "MessageIndex": 9,
      "PostDate": "25/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805074",
      "Title": "Liver mets good but now it's in my brain?? Anyone on BKM120? hendricks1 Frapp"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Aug 20, 2013 07:00PM barsco1963 wrote: Will jump in your pocket Brandall. Best wishes for an easy poke and finding nothing of great concern on the scan.",
      "MessageIndex": 7,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809627",
      "Title": "PET scan tomorrow brandall meima-Bev"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 7, 2012 08:06AM barsco1963 wrote: Sending more ((((HUGS))))   Hope that everyone gets feeling better and you can get some rest.",
      "MessageIndex": 5,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782291",
      "Title": "UGGG why 40-years-old-now 40-years-old-now"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 22, 2013 05:31AM barsco1963 wrote: lovingmamma - Hoping that something comes along soon that is the magic bullet! ((hugs))",
      "MessageIndex": 5,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800844",
      "Title": "Between a rock and a hard place lovinmomma"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 18, 2012 01:46PM barsco1963 wrote: Ma - how frustrating for you! I have my family Dr fill out all of my forms - she is easier to talk with and seems to be more sensitive to my situation.",
      "MessageIndex": 20,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782820",
      "Title": "Venting again ma111 ma111"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 25, 2013 11:54PM barsco1963 wrote: Welcome Allison - sorry for the reason that brought you here, but as the others have mentioned it is a terrific spot for encouragement, support, love and laughter.",
      "MessageIndex": 24,
      "PostDate": "25/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813516",
      "Title": "New Here Freedomchild82 AmyJM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 18, 2012 03:08PM barsco1963 wrote: Hooray!!! Very good news liveit56 - I'll join in the dance!",
      "MessageIndex": 6,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781220",
      "Title": "Finally got results!!!! liveit56 dawny"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 9, 2011 02:17PM barsco1963 wrote: Best of luck KyAnne - hoping everything turns out ok for you. Try to stay positive - keep us posted.",
      "MessageIndex": 4,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777814",
      "Title": "20 Years old...tests tomorrow KyAnne PinkShirtNow"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 23, 2013 02:09PM barsco1963 wrote: lynne - We receive all complaints without bias here. I am sorry that the neuropathy is so painful. Is there any reason why you couldn't take some painkiller to get you through the night at least? Hoping that the supplements kick in soon for you and that the pain subsides.",
      "MessageIndex": 1,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806591",
      "Title": "Neuropathy. What new fresh hell is this? lynne248"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 15, 2013 07:15PM barsco1963 wrote: KeepingFaith - sending ((hugs)) and best wishes your way for great scan results. You surely don't need the extra drama in your life - hope everything is ok. Keep us posted so we can celebrate the good scan news with you.",
      "MessageIndex": 6,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804730",
      "Title": "Scan Day today KeepingFaith69 Jill49"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 15, 2013 05:29AM barsco1963 wrote: Thank you all so much for the well wishes and congrats! I am sooooo pleased that all of you lovely ladies are here and that I have come to know a few of you better as we continue to do what we have to do. I do hope that my story gives hope to others, as others have certainly been inspiration to myself. We are certainly in it together and here for one another. I am so very glad to have found this site. Let's kick some cancer ass!",
      "MessageIndex": 25,
      "PostDate": "15/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806107",
      "Title": "TWO years and counting! barsco1963 Leah_S"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 15, 2013 07:26PM barsco1963 wrote: You ladies have given me an idea with all the elephant talk. I am doing a fundraiser in October with proceeds going to METavivor. It will be a casual mix and mingle evening of music, art and information about advanced breast cancer. I am thinking that I will make elephant shapes to post around the auditorium with some facts about metastatic bc written on them. Perhaps some quotes from metsters who would like to share what it is like living with mbc. What do you think?",
      "MessageIndex": 54,
      "PostDate": "15/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810696",
      "Title": "\"Awareness\" rant! kayrnic AmyJM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 19, 2015 08:19PM barsco1963 wrote: Mandy - So very sorry to hear of your Mom's passing. Her kindness and giving spirit shone through last year when she donated many of her handmade crafts to a fundraiser that I held to raise money for metastatic breast cancer research.  I am sure that you have many,  many more wonderful memories and I pray that they bring you comfort and smiles in the days to come.",
      "MessageIndex": 38,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828643",
      "Title": "My Mother raro stagefree"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 12, 2012 02:47PM barsco1963 wrote: hika43 - Your mom is very lucky to have you by her side. You will be a great advocate for her. I am sorry that she has had to go through so much and ended up with a stage IV dx. You have come to the right place. Keep in touch here as you will find terrific support, encouragement, advice and experience from everyone.",
      "MessageIndex": 6,
      "PostDate": "12/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785679",
      "Title": "70yo mum preliminary diagnosed with stage IV bc hika43 lisagwa"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Dec 16, 2011 02:57PM barsco1963 wrote: I have also asked my onc about removing ovaries. He said that it could be done but basically the same response as what you got - overkill. He is big on giving the best QOL and feels that removing ovaries is unnecessary at this time. I am still considering it but at this time I am feeling good and don't want to jinx anything if you know what I mean. Still considering it and will likely discuss with him (and my family doc) again in the future",
      "MessageIndex": 1,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779623",
      "Title": "Removing Ovaries CherylinOhio cinnamonsmiles"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 4, 2013 09:33PM barsco1963 wrote: So glad that all went well for you today. Best wishes for success with Xeloda! ((Hugs)) and happy thoughts for you.",
      "MessageIndex": 9,
      "PostDate": "04/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801365",
      "Title": "Gamma Knife done ;) tammie soleil505"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 5, 2012 01:06AM barsco1963 wrote: Caryn - Glad that you are feeling well and are able to go back to a job that you obviously enjoy a great deal. Giddiness and excitement are strongly encouraged! We definately like to hear good news from our fellow sisters/brothers here.",
      "MessageIndex": 7,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780421",
      "Title": "A Little More Good News exbrnxgrl steelrose"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 8, 2013 06:51PM barsco1963 wrote: Jill - wisdom and kindness definitely sums it up. I don't know where I would be without these boards. I am truly thankful to have found such a wonderfully welcoming and supportive group. Love and Hugs to you all!",
      "MessageIndex": 6,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807405",
      "Title": "Just want to say thank you Jill49 brandall"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 6, 2015 04:11PM barsco1963 wrote: Hi Scrappy - just wanted to welcome you and echo the well wishes of all the others here. Lots of terrific women here to turn to when you need and ear to listen, a shoulder to cry on and someone to do the happy dance with you when you get good news. I was dx with stage iv liver mets in 2011 and they have been stable for well over a year now. Best of luck to you with tx. Keep us posted on how you are doing.",
      "MessageIndex": 17,
      "PostDate": "06/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827190",
      "Title": "Just diagnosed with Liver cancer Scrappygrl Scrappygrl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 19, 2013 10:57AM barsco1963 wrote: Definitely - I keep wondering if my dx was in error. However, the scans prove it to be very real. I have liver mets and have not had anything other than SEs from the tamoxifen (nausea, warm flushes). There is so much misinformation out there that we tend to think that Stage IV means looking and feeling terrible. We can live with mets and have a good QOL. I enjoy each day while I can. I hope that you continue to do well for a long time to come.",
      "MessageIndex": 2,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800701",
      "Title": "I don't feel sick cheryl1946 NineTwelve"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 12, 2013 09:20PM barsco1963 wrote: Awsome! Very happy for you.",
      "MessageIndex": 24,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798723",
      "Title": "Scan Results marywh KeepingFaith69"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 30, 2013 09:18PM barsco1963 wrote: Brandall - you are so right that the worry never seems to end. Every twitch, ache and pain makes us first think that it is cancer related. Hopefully your sore tailbone is just that. It is good that you have a scan on Monday (upcoming pocket party?) I hope that results come back clean and clear!",
      "MessageIndex": 2,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805446",
      "Title": "Tailbone pain? brandall cheery"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 16, 2014 06:10PM barsco1963 wrote: Laura - no one would blame you for wanting to scream about all that is going on. Sometimes we just get sick and tired of being sick and tired. I hope that bladder infection doesn't cause too much discomfort and that you are feeling better soon.",
      "MessageIndex": 3,
      "PostDate": "16/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824627",
      "Title": "One thing after another. LauraOntario Zillsnot4me"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 22, 2012 06:18AM barsco1963 wrote: Cybercheering for you Tammie!!! Glad to hear that you have finally met stable boy! Now get that swimsuit on and take him to the beach (or pool or where ever you want to go)!",
      "MessageIndex": 29,
      "PostDate": "22/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789334",
      "Title": "AWESOME NEWS :) tammie barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 16, 2013 08:55AM barsco1963 wrote: Thanks for the support girls. I only hope I can pull it off - it is the first such event that I have attempted. Soooooo  -  if anyone has any thoughts, quotes etc that they would like to see on an elephant please send them to me. I will likely post the 13 Facts Everyone Should Know about Metastatic Breast Cancer from mbcn.org If anyone would like to contribute you can PM me or post it here. I would like to include a first name (or initials only if preferred) for any personal contributions.",
      "MessageIndex": 64,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810696",
      "Title": "\"Awareness\" rant! kayrnic AmyJM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 17, 2013 09:35AM barsco1963 wrote: sticki & latte - thanks for the ideas. I have seen EM's videos and they are fantastic. Not sure if I am technical enough to get them from laptop to big screen - will have to do some thinking on that one. spamgirl - your idea would certainly get some attention. I like it!",
      "MessageIndex": 72,
      "PostDate": "17/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810696",
      "Title": "\"Awareness\" rant! kayrnic AmyJM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 6, 2013 09:30AM barsco1963 wrote: I just saw this on another \"pinktober\" thread. Thought it fit in here nicely - October is also Elephant awareness month - lol http://www.elephants.com/newsStory.php?newsID=1396",
      "MessageIndex": 140,
      "PostDate": "06/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810696",
      "Title": "\"Awareness\" rant! kayrnic AmyJM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 26, 2013 07:32AM barsco1963 wrote: dbla - sorry to hear that there are new liver lesions. I do have liver mets and have been on tamoxifen with zoladex injections for almost two yrs now. The combo is working very well for me - mets have decreased in size and number. Been dating stable boy for about 6 mos now. As for SEs - I haven't experienced any unmanageable SEs - hot flushes/aches/pains/nausea.  I hope that the tamo treats you kindly and does it's magic for you also.",
      "MessageIndex": 4,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806711",
      "Title": "One Day Service! dbla pajim"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Feb 13, 2013 09:27PM barsco1963 wrote: NED is such a wonderful friend to have. Congrats and here's to many many more dances together.",
      "MessageIndex": 6,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800415",
      "Title": "One year ago... lanagraves lanagraves"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 15, 2014 07:17AM barsco1963 wrote: So good to know that you are \"just old\" Sue. Not sure I have an answer for your question though. Everything seems to set off the panic button doesn't it?",
      "MessageIndex": 3,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820194",
      "Title": "How to not be a crazy person? sueopp intothewoods"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 12, 2013 06:30AM barsco1963 wrote: Awsome news for you!!!",
      "MessageIndex": 18,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798727",
      "Title": "PET confirms NED today TKSit bhd1"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 17, 2013 11:34AM barsco1963 wrote: noquitter - I think we are all lining up behind you with our elephants, ready to slap those who have their heads in the sand regarding the truth about bc. It is sad that so many of us still have to deal with such ignorance.",
      "MessageIndex": 76,
      "PostDate": "17/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810696",
      "Title": "\"Awareness\" rant! kayrnic AmyJM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 19, 2013 07:49AM barsco1963 wrote: How about making the elephants out of used steel wool?",
      "MessageIndex": 106,
      "PostDate": "19/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810696",
      "Title": "\"Awareness\" rant! kayrnic AmyJM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 3, 2013 07:55PM barsco1963 wrote: LOL Leah - glad I am not alone ",
      "MessageIndex": 137,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810696",
      "Title": "\"Awareness\" rant! kayrnic AmyJM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Apr 4, 2012 07:51AM barsco1963 wrote: HOORAY! So glad that you and Stable Boy are still getting along so well!",
      "MessageIndex": 23,
      "PostDate": "04/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785198",
      "Title": "STABLEBOY has decided to stick around. 3littlegirls Naniam"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Mar 11, 2012 07:43AM barsco1963 wrote: Enjoy your vacation apple!",
      "MessageIndex": 23,
      "PostDate": "11/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783889",
      "Title": "Be good stay well apple bobkat"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 27, 2012 08:13AM barsco1963 wrote: So sorry to hear of the loss of another sister! Condolences to her family and friends.",
      "MessageIndex": 23,
      "PostDate": "27/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789718",
      "Title": "Another angel. Dell neogirl seaperch"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "barsco1963 wrote: It's been 2 years since dx of stage iv bc. After reading all of the horrible stats etc regarding liver mets, I never thought that I would be here and doing well at this point in time. Then I found BCO and all of the wonderful persons here that have been such a great source of support, friendship, encouragement, love, laughter, hope and reality. Sadly there have been many sisters who have passed since my joining here. I only hope that they know how much their words and support have helped others here to move past the fear and enjoy the here and now. I am very grateful that I have responded so well to first tx. I am living a decent QOL and have returned to working full time (jury still out on that being a good thing - lol). I pray daily for all who are dealing with this horrible disease in any way and at every stage and thank those who take part in trials in order to find more and better tx. Thanks to BCO for providing a place for us all to come and share our fears, experiences, and to connect with others who \"get it\"  Bless us all! Barb It isn't knowing the worst, the worst is not knowing. Dx 5/30/2011, IDC, 4cm, Stage IV, Grade 2, 21/29 nodes, mets, ER+/PR+, HER2- Hormonal Therapy 7/24/2011 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806107",
      "Title": "TWO years and counting! barsco1963 Leah_S"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 29, 2013 04:25PM barsco1963 wrote: So glad that you are pain free - here's hoping that the Adriamycin takes care of those liver mets. Enjoy your time at home - come by often to chat, let us know how you are doing or even just lurk around. There is always something going on. ((hugs))",
      "MessageIndex": 5,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799582",
      "Title": "Holdontohope checking in holdontohope barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 5, 2013 09:11PM barsco1963 wrote: Jennifer - sorry no radiation advice, but plenty of wishes for you that the radiation will get that pesky met to back off and give you some relief.",
      "MessageIndex": 1,
      "PostDate": "05/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814077",
      "Title": "Starting Radiation for Naughty Hip blainejennifer exbrnxgrl"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 22, 2013 09:43PM - edited Jun 22, 2013 09:44PM by barsco1963 dbla - sorry to hear that your tumour markers seem to be indication of more chemo to come. That Stable Boy may come to regret his decision to leave you once he sees Reggie or NED moving in. What a Buckin fool he is!",
      "MessageIndex": 32,
      "PostDate": "22/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806510",
      "Title": "Bucked Off Already? dbla"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jun 23, 2013 09:06AM barsco1963 wrote: Bon - Love your new avatar. Like your idea too. Buck off cancer!",
      "MessageIndex": 33,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806510",
      "Title": "Bucked Off Already? dbla"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 15, 2013 06:54AM barsco1963 wrote: It is harder and harder to hear about the loss of more of our dear sisters. I cry - selfishly for myself and also for all of us who are dealing with this beast on some level. However, I find myself wanting to log in more and more in order to get the support and understandng here that I cannot find elsewhere. Then I can smile and find comfort in the love and friendship that is shared by all here on the boards. Time can often pass so quickly that we find we haven't been able to get to some of those things that \"we'll do later\", but it can also be on our side when it comes to healing and putting that distance between heartache and moving on. Wishing all of you time and space to be able to grieve and find peace in your lives. xoxo",
      "MessageIndex": 30,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804669",
      "Title": "Harder and harder to log into these boards stellaratovsky barsco1963"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jan 10, 2014 01:37PM barsco1963 wrote: Karen - just read through this thread. Glad to hear that the nausea may be cleared up easily and quickly for you. I have had nausea for 2 yrs and JUST got referred to palliative care last month. Nurse made sure that I knew the difference between palliative and hospice. I have had test after test and tried pill after pill....finally Haldol seems to be doing the trick for me. Scary to know that your team is thinking another brain met is lurking....keep us posted - we are here for you.",
      "MessageIndex": 36,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816643",
      "Title": "Palliative Care Karen2012 Heidihill"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Sep 15, 2013 07:50PM barsco1963 wrote: Good idea chickadee. I was going to go with \"A Musical Evening of Hope\" (in Support of Advanced Stage Breast Cancer) but now I am wondering if something like \"Let the Elephant Dance\" (in Support of Advanced Stage Breast Cancer) - or does that sound silly?",
      "MessageIndex": 56,
      "PostDate": "15/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810696",
      "Title": "\"Awareness\" rant! kayrnic AmyJM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 3, 2013 07:42PM barsco1963 wrote: Looking good redroks. I think I am a bit tired (or just dopey) though. I was looking for the boobs on the elephant. (doh!) But I figured it out all by myself - lol",
      "MessageIndex": 135,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810696",
      "Title": "\"Awareness\" rant! kayrnic AmyJM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Jul 8, 2014 08:19AM barsco1963 wrote: 1701jms - sorry that you are dealing with brain mets. I have no experience myself, but wanted to send some healing thoughts and support your way. Hoping that tx really takes care of them for you.",
      "MessageIndex": 3,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822557",
      "Title": "Brain mets! 1701jms chele"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 22, 2014 07:44PM barsco1963 wrote: Yip Yip Yippee! Happy for you MarshaMay",
      "MessageIndex": 5,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/826483",
      "Title": "Complete Metabolic Remission MarshaMay PattyPeppermint"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Nov 6, 2011 07:22PM barsco1963 wrote: Awsome news! Stay well.",
      "MessageIndex": 9,
      "PostDate": "06/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/777358",
      "Title": "Biopsy Results Are In!! SueI12345 VSM"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 11, 2012 07:46AM barsco1963 wrote: pp729 - That was how my story unfolded also. My dr. referred me to a BS for consult who then referred me to a radiologist for US guided biopsy. However, you might call back as megadotz suggested and see if you can omit one step. Good luck.",
      "MessageIndex": 2,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787304",
      "Title": "Confused about my upcoming BS appointment pp729 Sommer43"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "May 23, 2012 08:52AM barsco1963 wrote: chele - What a great story - you and your horse certainly have a beautiful connection. Wishing you only good results from your scan.",
      "MessageIndex": 17,
      "PostDate": "23/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787919",
      "Title": "I feel like my horse chele alesta29"
    },
    {
      "AuthorID": "barsco1963",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138029/profile",
      "Content": "Oct 16, 2013 09:46PM barsco1963 wrote: I too have always been ok with birthdays, not worrying about my age. I will be turning 50 later this month and recently held a big party for family and friends. I am truly thankful to reach the big 5-0! I tend to respond as Tina2 does when someone comments on getting to be so old. Definitely beats the alternative. Sometimes takes them a minute to figure it out - lol. I like the reference to the \"free trip\" every year too!",
      "MessageIndex": 7,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/812948",
      "Title": "Ranting about Bdays smiley2 Jill49"
    }
  ]
}