{
  "AuthorID": "basic_bee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278185/profile",
  "Posts": [
    {
      "AuthorID": "basic_bee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278185/profile",
      "Content": "Aug 6, 2018 09:14AM basic_bee wrote: Hello astyanax66! I'm new to the boards, but have been chugging through treatment for a bit now. I just started my radiation and had to get the tattoos. Personally I thought they felt worse than a bug bite for sure! And they do look like freckles, but they're blue. I thought I'd be annoyed by them but they really are hard to see unless you're very close. Good luck!",
      "MessageIndex": 107,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "basic_bee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278185/profile",
      "Content": "Aug 7, 2018 07:48AM basic_bee wrote: Hello! This is a difficult decision to make, I agree. Initially, I felt like you, I wanted the bilateral mastectomy with reconstruction. However, once I learned that I had to get chemo no matter what my surgical choice was, I changed my mind. I, too, was scared by the total loss of sensation. I was also scared, not of the mastectomy itself, but the recovery process and the many steps it would take for the reconstruction to finish. Finally, what pushed me over the edge was the thought of having to live with the implants and the potential complications they could bring. Not to mention the need for replacement 10 to 15 years down the road. This was just my thought process though. And, I didn't have the option of the implants being placed on top of the pectoral muscle either, which I believe really changes the reconstruction process. I'm also HER2-, so in the end I decided to do a lumpectomy followed by radiation even though my nodes all appeared clean in my pre-surgical scans. Good luck to you!",
      "MessageIndex": 1,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866445",
      "Title": "What would you do? urmysunshine17 NotVeryBrave"
    },
    {
      "AuthorID": "basic_bee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278185/profile",
      "Content": "Aug 7, 2018 10:16AM basic_bee wrote: Just take some deep breaths and move forward. It is hard to get through, I know. Try looking through this site or Google for a list of questions to ask and see if there is anyone who can come with you to the appointment to help you remember what happens. My first appointment was with a surgeon too, but then I had chemo first. You can take the time you need to make the decision that is best for you so don't rush anything. ",
      "MessageIndex": 1,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/866449",
      "Title": "Just Diagnosed and Seeing Surgeon Today WonderWoman75 GrannyK"
    }
  ]
}