{
  "AuthorID": "BayouBabe",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
  "Posts": [
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Oct 30, 2014 04:11PM BayouBabe wrote: Yes!  Totally normal.  Horrible for a few days, but so worth it in the end!  Hang in there!",
      "MessageIndex": 133,
      "PostDate": "30/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 6, 2013 03:37AM BayouBabe wrote: Sciencegal - yes, I am finished with radiation. Most of my tears were for my kids, not from pain from rads. My mom died from cancer about 7 years ago, and I would lie on the table and would be overcome with grief over missing her and fear of doing the same to my kids, but at a much younger age. My most frustrating rads story - I was set to finish rads on a Friday. Got a call about an hour before I was ready to leave that the machine broke down and I would need to wait until Monday to finish. My kids and friends had a celebration planned and couldn't understand why I couldn't still celebrate. (It ain't over, till it's over). I cried all weekend. So glad I am done! My skin has healed well. Just a little \"tan\" under my arm and on side. Healed well enough that my plastic surgeon is doing my exchange next month instead of waiting a full six months. So excited and yet so extremely nervous!",
      "MessageIndex": 346,
      "PostDate": "06/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 6, 2013 05:51AM BayouBabe wrote: MsW2012 - what is the reason for your surgeon wanting to do the swap earlier? I am so anxious to be done with TE, but, like you said, don't want complications. Ugh! If only there was an easy way to make this difficult decision. You would think we would all be pros at decision making by now!",
      "MessageIndex": 351,
      "PostDate": "06/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 6, 2013 12:22AM BayouBabe wrote: Celineflower - I read somewhere, probably here, that being brave isn't a choice, being brave is what we do when we have no choice. Radiation definitely caused me many tears - hated laying there with tears streaming down my face and not being able to move to wipe them away. Strength to you my fellow warrior! This too shall end and bring sunnier days ahead!",
      "MessageIndex": 344,
      "PostDate": "06/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 13, 2015 02:50AM - edited Nov 13, 2015 02:50AM by BayouBabe I do not have an answer for this. Have you checked the FORCE website? www.facingourrisk.org",
      "MessageIndex": 1,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836702",
      "Title": "Help me understand BRCA1 rwiley4529 rwiley4529"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 19, 2013 11:51AM BayouBabe wrote: Starbrightlyshines - I had a very similar experience at a family event yesterday. It left me feeling depressed, frustrated, and angry. I've decided that I need to let it go and nurture the relationships that are most important to me, and where there is give and take. I am so tired of people in my life that only take. It is hard to let it go though - my mind keeps dwelling and wasting what little energy I have these days. Hugs!",
      "MessageIndex": 21,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809079",
      "Title": "Fatigue or laziness? starbrightlyshines starbrightlyshines"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 20, 2016 12:19AM BayouBabe wrote: Dakotagirl - be sure to research fat grafting after rads. There are several threads here that discuss it. I had two fat grafting surgeries after rads and it has done wonders to repair my skin.",
      "MessageIndex": 5,
      "PostDate": "20/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/847031",
      "Title": "Implants after Radiation Therapy DakotaGirl BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 22, 2013 04:23PM BayouBabe wrote: Please do not be afraid to talk to your doctors. Nothing is more important right now than making the best possible decisions with the best knowledge you can gather. The doctors work for you - no question is a stupid question. That being said - most low Oncotype scores mean that the side effects of chemo will do you more harm than any benefit you may receive. My oncotype was a 19 and chemo was not recommended. I have never second guessed that choice even with my troubling path report and status listed below. Hugs and peace as you sort things through!",
      "MessageIndex": 50,
      "PostDate": "22/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/763394",
      "Title": "Oncotype DX test score at 18 - chemo or not? julie775 Bamagirl2016"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 5, 2013 09:54AM BayouBabe wrote: I had a BMX; being BRCA1+ took this decision away from me. I wish I had been able to keep my other breast. I did nipple sparing on one side, lost the other due to proximity to tumors. I SO wish I had been able to keep one breast and one feeling nipple. This loss of sensation has been one of the hardest issues I have dealt with in this whole awful mess. My advice - keep the breast and nipple on the good side if you can. Monitoring is doable, no feeling sucks (no pun intended). I blame much of my loss of libido on this, much more than the menopause from my oopherectomy and femara.",
      "MessageIndex": 1,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807194",
      "Title": "BMX vs. UMX with implant on other side kika2013 BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 4, 2017 06:41PM BayouBabe wrote: Laura - be sure to check out the FORCE website, www.facingourrisk.org, for more information on genetic cancers. Much will depend on your age and family history. Sorry you find yourself seeking this information; wishing you peace of mind in the days ahead",
      "MessageIndex": 2,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/851623",
      "Title": "Positive BRCA result Laura25 joy2"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 12, 2017 04:29AM - edited Jan 12, 2017 04:30AM by BayouBabe Sorry the link does not take you directly to the article. My tablet does wierd things. If you google the title it will take you to the article and you can view the table, which did not cut and paste with the rest.",
      "MessageIndex": 19,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/851623",
      "Title": "Positive BRCA result Laura25 joy2"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 5, 2017 01:43PM BayouBabe wrote: Since you don't currently have cancer, you have some time on your side. Take the time to research methods, find a surgeon you are totally happy with, and who others have been happy with. Remember they work for you. Unfortunately, there are good surgeons and bad ones. Do your research. Knowledge is power!",
      "MessageIndex": 9,
      "PostDate": "05/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/851623",
      "Title": "Positive BRCA result Laura25 joy2"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 12, 2017 02:40PM BayouBabe wrote: I only had a BSO, and every check up with my MO she encourages me to think about getting my uterus removed in another surgery. I have refused. Enough has been removed until science learns more. Ugh, sometimes I wish I didn't know I was BRCA+. I think I would worry less and sleep better.",
      "MessageIndex": 21,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/851623",
      "Title": "Positive BRCA result Laura25 joy2"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 12, 2017 04:18AM BayouBabe wrote: Newer research IS showing a connection to BRCA1 and uterine cancer! www.medscape.com Roxanne Nelson March 25, 2014 TAMPA, Florida — Women with BRCA1 mutations could be at increased risk of developing rare types of aggressive uterine cancer, in addition to their already well-known increased risk for breast and ovarian cancer, a new study shows. Patients who plan to undergo a prophylactic salpingo-oophorectomy to avoid ovarian cancer should discuss the potential advantages and disadvantages of having a hysterectomy during the same procedure, according to data presented here at the Society of Gynecologic Oncology 45th Annual Meeting on Women's Cancer. Researchers followed 525 women for an average of 6 years. All had a BRCA1 or BRCA2 mutation and had undergone risk-reducing salpingo-oophorectomy (RRSO). During follow-up, 4 uterine cancers were diagnosed — all in women with a BRCA1 mutation. None of the women with a BRCA2 mutation developed uterine cancer. There were also no cases of low-risk disease (although 1.95 cases would be expected; P = .14). All 4 uterine cancers were high risk (1 serous, 1 high-grade serous with undifferentiated components, 1 carcinosarcoma, 1 leiomyosarcoma). \"Up to this time, we have thought it reasonable, but not required, to remove the uterus,\" said senior author Noah D. Kauff, MD, director of ovarian cancer screening and prevention for the gynecology service at Memorial Sloan-Kettering Cancer Center in New York City. \"But it appears that women with BRCA1 mutations may have an increased incidence of high-risk uterine cancer after risk-reducing salpingo-oophorectomy that approaches 2.1% over 10 years,\" or an increase that is approximately 26-fold higher than in the general population. In this group, 2.2 uterine cancers would be expected, but instead there were 4.0, which is a doubling of the risk. \"This was slightly higher when compared with the general population, but it was not statistically significant,\" Dr. Kauff reported. Dr. Kauff emphasized that it is too early to suggest any changes to current practice. \"Given the study limitations, these data should be considered preliminary,\" he said. \"They require confirmation before any changes in clinical recommendations can be made.\" RRSO is associated with a decrease in risk for ovarian cancer of about 80% to 90% in women harboring BRCA mutations, and a decrease in risk for breast cancer of 40% to 70%. The effect of concomitant hysterectomy has not been established. Hysterectomy has its advantages and disadvantages, Dr. Kauff explained. \"It ensures complete removal of the fallopian tubes and can simplify hormone replacement therapy. It also eliminates a baseline risk of uterine cancer.\" On the downside, there is a higher risk for complications, higher cost, and longer surgical time. There have been no reported cases of cancer in the cornual portion of the fallopian tube after RRSO, he noted. High-Risk Disease With BRCA1 Mutations Dr. Kauff and his colleagues prospectively analyzed the risk for uterine cancer after RRSO. Of the 525 women evaluated, 296 (56%) had a BRCA1 mutation, 226 (43%) had a BRCA2 mutation, and 3 (0.6%) had both mutations. All had undergone RRSO but had an intact uterus. The women were followed with an annual questionnaire and medical record review. The researchers used age- and race-specific SEER data to determine the expected cancer incidence, and adjusted it for the prevalence of hysterectomy. Uterine cancer was categorized as low risk (endometrioid, mucinous, adenocarcinoma not otherwise specified) or high risk (serous, clear cell, sarcoma). The expected number of high-risk cases was 0.28. \"Instead, it was 4, and that was highly statistically significant,\" Dr. Kauff said. They occurred 1.4 to 12.9 years after surgery. One of the women had no history of breast cancer; the number expected would be 0.06 (P = .06). Three of the women had a history of breast cancer; the number expected would be 0.22 (P = .001). The researchers also looked at previous tamoxifen use, which is associated with an increased risk for endometrial cancer and endometrial changes. Two of the women with uterine cancer had previously used tamoxifen (expected, 0.092; P = .004), and 2 had not (expected, 0.184; P = .015). \"Women exposed to tamoxifen had a 22% increased risk,\" said Dr. Kauff. Table. Characteristics of the 4 Women With Uterine Cancer Routine Hysterectomy Not Recommended Yet This is \"definitely something that should be discussed with patients considering RRSO,\" said Stacey N. Akers, MD, from the Department of Gynecologic Oncology at Roswell Park Cancer Institute in Buffalo, New York. However, \"we need further studies to determine risks so that we can counsel patients appropriately.\" The women in this study who developed endometrial cancer had type 2 endometrial cancers, which are more aggressive than type 1 endometrial cancers, she pointed out. \"Women with known BRCA1/2 mutations who opt for uterine preservation need to be aware of this,\" she told Medscape Medical News. They should \"be sure report any signs of bleeding to their care team.\" This \"is a good study,\" noted Steven Narod, MD, director of the familial breast cancer research unit at Women's College Research Institute in Toronto. \"The 4 cancers seen are interesting, but it is a small sample and is insufficient to guide practice,\" he said. However, several previous studies have suggested that tamoxifen causes these serous endometrial cancers. In fact, in a study 10 times larger than this one, Dr. Narod and his colleagues followed 4456 women with a BRCA1 or a BRCA2 mutation (Gynecol Oncol. 2013;130:127-131). They found that the risk for endometrial cancer was similar in women with a BRCA1 or BRCA2 mutation and in those in the general population. There was a significant increase in women who had breast cancer, but this was restricted to those who had used tamoxifen. Dr. Narod agrees that a hysterectomy should not routinely be recommended as a part of prophylactic surgery for BRCA1 and BRCA2 mutation carriers. \"However, women should be made aware that they face a non-negligible risk of cervical and endometrial cancer, and that this can be eliminated through hysterectomy,\" he said. Society of Gynecologic Oncology (SGO) 45th Annual Meeting on Women's Cancer. Presented March 24, 2014. Medscape Medical News © 2014 WebMD, LLC Send comments and news tips to news@medscape.net. Cite this article: BRCA1 Linked to Higher Risk for Aggressive Uterine Cancer. Medscape. Mar 25, 2014.",
      "MessageIndex": 18,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/851623",
      "Title": "Positive BRCA result Laura25 joy2"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 9, 2013 06:04PM BayouBabe wrote: Can you have an MRI?",
      "MessageIndex": 1,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/807491",
      "Title": "Is This Normal? Lilmo61 Lilmo61"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 2, 2013 10:26AM - edited Jul 2, 2013 10:26AM by BayouBabe First, hugs! Sorry you are in so much pain and uncomfortable! I did not have any bandages at all when I came home; seems that all surgeons have their own way of doing things. My sides were also very sore and swollen. I had my drains for just over a month - was putting out way too much drainage. So that could be part of what you are feeling. I also felt like my tissue expanders were in my arm pits and they did and still do drive me crazy. Remember that they are under your pec muscles and are stretching in ways they were never meant to be stretched. Once they relax a bit, you will get a bit of relief. Try and stay on top of the pain with your meds. This will help. I don't tolerate Vicodin well. Instead after the first few days I took ibuprofen and Tylenol. You can space the two meds apart, thus you are getting meds every few hours in alteration. Take it easy as well. Now is the time just to chill - take a nap, watch movies, read if you can concentrate (I couldn't). It will get easier. Give your body some time to adjust, as well as your heart and spirit!",
      "MessageIndex": 1,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807085",
      "Title": "Looks and feels like my boobs were ran over by a truck! Liz1973 Smaarty"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Sep 15, 2013 05:33PM BayouBabe wrote: My best advice is to wait two weeks. If there is no change or it does not start to get better, then it is time to schedule an appointment. I am guessing that it is simply that, a bruise.",
      "MessageIndex": 1,
      "PostDate": "15/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811045",
      "Title": "Bruise-looking spot found jessicahowell BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 2, 2013 11:35AM BayouBabe wrote: Watching my kids from the sidelines was one of the hardest parts of this whole deal. Mine are 10 and 12. My daughter is counting down the days until she can get a squishy hug - she hates these expanders as much as I do! Put a travel pillow against your chest before your husband sets the little one down ; might help a little if you haven't tried it. My emotions were all over the place for months. Be easy on yourself and let the emotions go where they may. Helps with the emotional healing. That part takes even longer than the physical. My doctor gave me a prescription for Valium. I didn't use it often, but for me it was better than the pain killers and helped with the emotional bad day here and there.",
      "MessageIndex": 3,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807085",
      "Title": "Looks and feels like my boobs were ran over by a truck! Liz1973 Smaarty"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 24, 2013 08:12PM BayouBabe wrote: You could try private messaging \"whippetmom\" for suggestions for surgeons in your area. I believe she keeps a list of those that women have been satisfied with. Good luck!",
      "MessageIndex": 7,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809888",
      "Title": "FAT GRAFTING post mastectomy radiation for scar tissue tightness dpms mgdsmc"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 24, 2013 04:51PM BayouBabe wrote: I had fat grafting as part of my reconstruction surgery three weeks ago. I will not lie, the procedure will feel like you got hit by a truck. My fat was taken from my thighs, inner and outer. I had bruising from my arm pits to my knees. I am still sore and tender today. There are cuts though; I have two one inch incisions, one on each inner hip. On a good note, I do believe it has helped my radiated breast quite significantly. The skin looks better. The tenderness that always bothered my along my side feels much better. My arm pit is not as tight. I have what looks like new blood flow to a portion of my breast. Would I do it again? Absolutely! I think the one week recovery you have mentioned is off. I think two weeks is more accurate.",
      "MessageIndex": 1,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809888",
      "Title": "FAT GRAFTING post mastectomy radiation for scar tissue tightness dpms mgdsmc"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 24, 2013 06:43PM BayouBabe wrote: I had my fat grafting approximately four months after radiation ended. Standard here is 4 - 6 months depending on condition of the skin and tissues.",
      "MessageIndex": 3,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809888",
      "Title": "FAT GRAFTING post mastectomy radiation for scar tissue tightness dpms mgdsmc"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 16, 2013 04:35PM BayouBabe wrote: Forgot to add - research the fat grafting. It has done wonders to heal and repair my rads side.",
      "MessageIndex": 2,
      "PostDate": "16/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/814625",
      "Title": "Radiation after Mastectomy - don't want to do it cattywompus BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 20, 2013 05:22PM BayouBabe wrote: cattywompus - you are most welcome! Hang in there - radiation is no walk in the park, but it does wonders to lower risk. You are strong! You can do this! Before you know it, this too shall pass. Hugs!",
      "MessageIndex": 4,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/814625",
      "Title": "Radiation after Mastectomy - don't want to do it cattywompus BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 29, 2013 04:52PM BayouBabe wrote: Be sure to follow through. Trust your gut. Mammograms, ultrasounds, and MRIs all show different things. Wishing you health and a positive outcome!",
      "MessageIndex": 7,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808458",
      "Title": "Another weekend waiter... AliciaFrances Petitegal127"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 17, 2014 03:01PM BayouBabe wrote: mz6507 - so sorry you are finding yourself here.  If you go up to the top of the page and click on \"my profile\" and fill in some of your stats, we would be better able to help you.  We do get to be experts on hospital/doctor waiting rooms, don't we?",
      "MessageIndex": 5,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/816851",
      "Title": "Positive for BRCA Marie82 kuka21"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 16, 2013 04:33PM BayouBabe wrote: Please do the radiation. I had radiation due to close margins. I also had that TE overfilled in case of shrinking. During rads I used aloe vera gel regularly ( even brought it into the rad dressing room for immediately after rads). Also used Lubriderm for sensitive skin. I stayed as well hydrated as I could; my rads center even had a fridge with drinks, as well as tea and coffee. I would drink tea or juice before I would let myself leave the rads center. I went bra less during rads to avoid irritation to my skin - I bought men's white tshirts, larger than normal so they were loose and wore those. I then waited almost 6 months after rads and had my exchange surgery AND fat grafting at the same time. My new breasts with implants look wonderful - including the rads side. You CAN do this! A good outcome is possible! I am 45, close to your age - we can still be here for a VERY long life - please do everything you can to ensure this. Hugs!",
      "MessageIndex": 1,
      "PostDate": "16/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/814625",
      "Title": "Radiation after Mastectomy - don't want to do it cattywompus BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 13, 2014 07:31PM BayouBabe wrote: Marie - I am not BRCA 2, but BRCA 1.  Sorry you have to deal with this as well.  Please be sure to check out the FORCE website, www.facingourrisk.org if you have not already found it.  I am sure some BRCA2+ women will be around soon to help you and answer questions.  Hugs!  ",
      "MessageIndex": 1,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/816851",
      "Title": "Positive for BRCA Marie82 kuka21"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 29, 2013 06:02PM BayouBabe wrote: Please do not let her make you feel stupid. She should feel stupid for not doing her job correctly. I am so sorry you experienced this. You are your own best health advocate. Please remember this, regardless of where this may lead you.",
      "MessageIndex": 9,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808458",
      "Title": "Another weekend waiter... AliciaFrances Petitegal127"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 7, 2013 04:17PM BayouBabe wrote: Before you do anything you should meet with a breast surgeon AND a plastic surgeon. Please explore all of your options thoroughly. You have time to think this through. Researc, research, research. Look at pictures of reconstructions online and in your plastic surgeons office. You will not be driving for several weeks after surgery; it is not an easy recovery. If you can wait until after your wedding, I think you would be much happier. Also, check out the FORCE website, which is full of information for those of us that are BRCA positive. Www.facingourrisk.org.",
      "MessageIndex": 2,
      "PostDate": "07/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/814179",
      "Title": "Prophylactic Mastectomy questions sdekans1 hopedreams"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 1, 2013 12:28AM - edited Nov 1, 2013 12:30AM by BayouBabe I had TEs and then rads. My rads side was overfilled to allow for shrinkage from the rads. I went through rads being about a C cup on no rads side and a D on rads side. Filled in bra with a partial prostheses. I had exchange surgery a little over 4 months after rads ended. So far my results have been very good. I had fat grafting at exchange and that has helped heal some of my rads damage. Feel free to pm me if you have specific questions. I would be happy to share more.",
      "MessageIndex": 2,
      "PostDate": "01/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/813852",
      "Title": "recurrance after reconstruction need radiation Mikesgirl17 BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Mar 16, 2014 09:46AM BayouBabe wrote: Bertilda - I have two lumps near my incision line.  Mine have been declared fat necrosis by my doctors.  Hope this helps ease your fears a bit.  Wishing benign results for you!",
      "MessageIndex": 12,
      "PostDate": "16/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/818071",
      "Title": "Lump near incision line large pea size bertilda YoungTurkNYC"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 1, 2013 02:01AM - edited Jul 1, 2013 02:04AM by BayouBabe",
      "MessageIndex": 7,
      "PostDate": "01/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806907",
      "Title": "Official Invite - Michigan Picnic Get together !! Travelingpants2 Travelingpants2"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Oct 30, 2014 08:09PM BayouBabe wrote: yes, I did mine all at once.  Had three surgeons working on me at the same time - BS, PS, and OB/GYN surgeon.  Scheduling nightmare, but worth it to me to have it all done at once.  So sorry this isn't an option for you.  ",
      "MessageIndex": 3,
      "PostDate": "30/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/825893",
      "Title": "Confused why I can't have a double mastectomy. jovigal Janiner"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Dec 10, 2013 07:37PM BayouBabe wrote: I am learning to laugh at myself. Some days, what else can we do?",
      "MessageIndex": 4,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/815619",
      "Title": "Memory Loss and or Confusion myers421 jeni72"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Dec 10, 2013 07:33PM BayouBabe wrote: I definitely have confusion. Not sure if it is from the 10 hours of anesthesia I have had in the last year and/or the aromatase inhibitors. It is like my brain knows the area to go and look for a word, but then pulls out the wrong one to use. For example, I am a teacher, today in science, I kept saying microphone instead of microscope. I tell my kids at home to put the leftovers in the washing machine instead of the fridge. This usually happens with \"related\" words, such as the electronics above. I feel like a walking idiot some days. Sigh.",
      "MessageIndex": 2,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/815619",
      "Title": "Memory Loss and or Confusion myers421 jeni72"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Oct 30, 2014 07:23PM BayouBabe wrote: I had BMX with expanders during my rads.  My rads side was expanded fuller for two reasons.  One - to make it easier to radiate. Two - to allow for the shrinkage that rads causes.  It can be done.  Do you have time for a second opinion?  If a BMX is really what you want, it seems ridiculous to make you go through two surgeries, and twice the recovery, twice the mental healing, etc..  ",
      "MessageIndex": 1,
      "PostDate": "30/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/825893",
      "Title": "Confused why I can't have a double mastectomy. jovigal Janiner"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "May 1, 2014 08:14PM BayouBabe wrote: V8grrl - the waiting is the hardest part.  Hang in there!  Know we are here holding your hand in cyberspace in the meantime.  Hugs!",
      "MessageIndex": 11,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819645",
      "Title": "what a month! V8grrl MelissaDallas"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 7, 2013 08:17PM - edited Jul 7, 2013 08:18PM by BayouBabe I had an ultrasound guided biopsy and a stereotopic biopsy as well. I did not find out my results from the biopsies until approximately 48 hours later. Don't expect it that same day unless they have told you differently. Most doctors, in my experience, will not tell you anything about how it looks or feels. The most you will feel during the biopsy is the numbing shot. You may feel some pressure as they take the sample. You will be a bit sore afterwards, but nothing a small ice pack and some Tylenol won't help. I drove myself home from my second one. Your anticipation will be the worst of it. Be good to yourself in the upcoming days to distract yourself. Hoping for the best possible outcome for you!",
      "MessageIndex": 1,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/807366",
      "Title": "Three days and a wake up till biopsy casonpa casonpa"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 27, 2013 03:01PM BayouBabe wrote: I have not had anything like this, but recommend you go to your doctor to get things checked out. You are your own best health advocate and it would give you peace of mind.",
      "MessageIndex": 1,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/810050",
      "Title": "Concerned scorpio1112 Petitegal127"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 12, 2013 12:50PM BayouBabe wrote: Celtictrek - what a year you have had! My heart and hugs go out to you! I also found that patterned shirts (no stripes) helped greatly in hiding my lopsidedness. I figured if one's eyes had to continually move around on a pattern they couldn't focus on the unevenness. At least that's what I told myself!",
      "MessageIndex": 7,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808190",
      "Title": "What Type of Bra Do I Need For a Unilateral Mastectomy TripleNTifferella celtictrek"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Dec 21, 2014 11:42PM BayouBabe wrote: First - sorry for the intrusion on a stage IV board. I have been reading everything possible, in hopes of giving my 12 year old daughter a step up on my BRCA gene. A while back, can't find the article now, I read that peanuts and peanut butteractually had a preventative property against breast cancer. I have been encouraging my daughter to eat it since.",
      "MessageIndex": 16,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827123",
      "Title": "Peanuts linked to cancer spread? Shutterbug73 Beachbum1023"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 24, 2013 07:59AM BayouBabe wrote: I see you are in the USA. To get you through in the meantime, places like Joanne Fabrics or other sewing stores have really inexpensive forms that you could get now. Most allow you to add or remove stuffing to get the right size and you just slip them in any bra. Insurance will usually cover a portion or all of your bras and prosthesis. You will need a prescription from your doctor. Here in MI we have a few boutiques, often in cancer centers or major cities that specialize in breast cancer items. TLC online is another source. Lands End carries nice swim suits.",
      "MessageIndex": 2,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808190",
      "Title": "What Type of Bra Do I Need For a Unilateral Mastectomy TripleNTifferella celtictrek"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 22, 2014 08:57PM BayouBabe wrote: Jen - this is only my experience, so take it for what you want.  I had an ooph at 44.  MO started me immediately on an AI during rads.  The combo of the ooph and the AI was EXTREMELY hard on my body (see stats below for timeline).  I finally stopped the AIs, started tamoxifen, and am doing much better.  My MO thinks it was just too big of an adjustment for my body all at once.  MO says we will discuss trying an AI again sometime in the future.  Just something to think about.",
      "MessageIndex": 20,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/819405",
      "Title": "Should I get a prophylactic oophorectomy? surfette Brip1geneticmutation"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 27, 2014 02:19PM BayouBabe wrote: Kat - sorry no one is responding. Don't know anything about tubular or quadrantectomy. However, I was able to spare one nipple, and am glad I did. Makes that breast still seem like me, if that makes sense",
      "MessageIndex": 2,
      "PostDate": "27/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826577",
      "Title": "Tubular but close to nipple - Quadrantectomy or Mastectomy? katcar0001 katcar0001"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 3, 2013 11:00PM BayouBabe wrote: How will I know if I am fine with one? What do I watch for? I am so confused with this whole thing. Can you explain what you mean that they don't work for you?",
      "MessageIndex": 2,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/807160",
      "Title": "Glove or Gauntlet??? BayouBabe BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 9, 2014 08:06PM BayouBabe wrote: bumping for mbfit.  Any thoughts for her?",
      "MessageIndex": 1,
      "PostDate": "09/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/816690",
      "Title": "Is this Lymphedema? mbfit hugz4u"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "May 14, 2014 05:30PM BayouBabe wrote: Farmerlucy is right.  Friends who stay around for the long haul are definitely rare.  Cancer issues go on for a LONG time, and most people stop checking in after a few weeks, just when they are needed most.  Keep being there!  House cleaning was huge for me.  I couldn't do it myself, and was used to a clean house.  Loved friends who cleaned!  Glad your friend has you in her life!  ",
      "MessageIndex": 4,
      "PostDate": "14/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/821070",
      "Title": "Giving support, what is the most helpful? jamiemarlowe busymama"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 22, 2013 04:25AM BayouBabe wrote: You will still be mom. By being a slower less active mom for a few months you are doing everything you can to be that great mom again soon. Be mad at cancer not yourself. Hugs as you face this!",
      "MessageIndex": 1,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/808061",
      "Title": "Mother of 3 - starting chemo 7/24...how do I do this? Jserenityb0413 debbiema"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 8, 2013 07:17PM BayouBabe wrote: Don't mean to be a downer, but it is possible to be triple negative AND be positive for BRCA. Best advice - don't let your brain go there until you have more test/pathology results back. Every cancer and every patient is unique. Your doctors will guide you, as we will here, to treatment options available. The waiting is the hardest part, due to the unknowns. Hugs to you and hoping for the best on your MRI and your genetics test.",
      "MessageIndex": 2,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/807426",
      "Title": "Confused -- which is worse ? Goldycat123 Goldycat123"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Dec 3, 2013 10:31PM BayouBabe wrote: Congrats on no chemo! I remember the elation I felt when I got the same news. Celebrate today!",
      "MessageIndex": 3,
      "PostDate": "03/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815309",
      "Title": "Results today from docto!!!r msmaples516 msmaples516"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 26, 2013 04:31AM BayouBabe wrote: Tracy - congrats on getting in so soon! You will feel so much better once you get some new information. Treat yourself to something special this weekend - you deserve it!",
      "MessageIndex": 8,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808100",
      "Title": "Really? Breast Cancer? Tracy516 Peachygirl"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 23, 2013 03:05AM BayouBabe wrote: Hope your results show you are cancer free too. Be good to yourself until Wednesday! Hugs!",
      "MessageIndex": 1,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808100",
      "Title": "Really? Breast Cancer? Tracy516 Peachygirl"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 5, 2013 05:34PM BayouBabe wrote: Coraleliz - just curious if you don't mind sharing - did the two tumors have similar oncotype scores? I also had two tumors, but only one got sent. I have often worried that this was a big mistake, but try not to dwell on it. What is done is done.",
      "MessageIndex": 11,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/807212",
      "Title": "Stage 1, Node neg. has unique dilemmas Power-House IngridJ"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 8, 2013 07:35PM BayouBabe wrote: We are our own best advocates! Good for you for following your gut and going elsewhere. Good luck on the 11th! Be good to yourself in the meantime. Hugs!",
      "MessageIndex": 1,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/807427",
      "Title": "Sometimes 2nd Opinions are Needed achalese tonya845"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 24, 2013 12:24AM - edited Jul 24, 2013 12:35AM by BayouBabe",
      "MessageIndex": 1,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808153",
      "Title": "Tumor Size? summergal maltomlin"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 7, 2013 10:12AM BayouBabe wrote: Alloderm can make the drains put out more fluid as well. Did you have alloderm by chance? I found this out after the fact. I tried less activity, more activity, you name it. Mine were in for about 5 weeks. I wouldn't have been so frustrated if I knew the alloderm was to blame and not anything in particular I was doing.",
      "MessageIndex": 2,
      "PostDate": "07/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/814122",
      "Title": "jp drains can't start chemo!!! mrsparsley Kicks"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Oct 27, 2015 03:51PM BayouBabe wrote: Check into getting a referral to a physical therapist for her. Look for one who has experience with breast cancer patients. She should see some improvement if she does this.",
      "MessageIndex": 1,
      "PostDate": "27/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/836180",
      "Title": "Tightness on my chest key6687 Erica"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 17, 2013 09:44AM BayouBabe wrote: Cds - first please know that your doctor is right and most are probably benign. The odds are in your favor. I, too, come from a family where I have lost loved ones to cancer very quickly. I totally understand your fear right now. You are NOT overreacting or stupid. Your feelings are very real right now. I remember when my mom was in the early stages of being diagnosed, I told her not to worry about it, it was probably nothing. I did this to protect myself and hold off my own fear. I am guessing this is what your friends and family are doing as well. It is not that they are dismissing your feelings, but, rather, protecting themselves a bit. Doesn't help you right now (I realize now it was not the best thing to say to my mom either. But hindsight is 20/20.) I am so sorry you are going through this right now. Hoping for good test results for you on Tuesday. Sending you hugs and peace as you get through the nerve wracking days ahead!",
      "MessageIndex": 1,
      "PostDate": "17/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/809447",
      "Title": "My Loved Ones Seem Dismissive of My Anxiety cds BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Apr 11, 2014 09:13AM BayouBabe wrote: You can also get a great aloe from Walmart, large bottle reasonably priced, just be sure to get the 'clear' one with no added colorings.  I brought this right into the rads changing room for immediately after.  I swear this helped so much!  Good luck and hope you have a great vacation.",
      "MessageIndex": 8,
      "PostDate": "11/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/820055",
      "Title": "What ointments work best?? is Nozema a no-no? Notbuyingit Moderators"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 9, 2013 01:04PM - edited Jul 9, 2013 01:04PM by BayouBabe Kate - sending you all the positive thoughts and support you need! Best of luck for good results on Thursday!",
      "MessageIndex": 1,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/807437",
      "Title": "Anyone else in a similar situation? Kate1983 Kate1983"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 24, 2013 07:44AM BayouBabe wrote: The therapist I see is an hour away as well. It is not ideal, but is the closest one around. I guess it depends on how severe your swelling is. Mine is very mild. I had several appointments initially, but now am just followed up on every few months, unless I have a problem. I know from reading others posts here on the boards that they go MUCH more frequently for more severe issues.",
      "MessageIndex": 1,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/808193",
      "Title": "new bhd1 bhd1"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 5, 2014 12:05PM BayouBabe wrote: I have arthritis in my neck.  It is possible you may have pinched a nerve or herniated a disc while vomiting.  Possibly try a day or two of Aleve or ibuprofen.  Try heat or ice, 20 minutes max at a time.  Dixie cups are great for ice - freeze them, and then simply peel the cup down as the ice melts and you massage with it.  Hoping it is something as simple as this for you.",
      "MessageIndex": 2,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/816504",
      "Title": "How long do you deal with a new pain before calling the doctor? karody Denise-G"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "BayouBabe wrote: I have developed de Quervain's in my left wrist.  The issue is not resolving and is actually getting more painful.  Can I get a cortisone shot?  Would this be asking for trouble?  Are there alternatives?  I am so tired of the pain and am looking for some relief before damage is done to my wrist, thumb, and arm.  Ideas anyone?  What has worked for you?  My doctor thinks this is what I need, but is unsure with the LE.   BRCA1+, IDC Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/816905",
      "Title": "Can I get a cortisone shot in affected arm? BayouBabe crystalphm"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "BayouBabe wrote: I have developed de Quervain's in my left wrist.  The issue is not resolving and is actually getting more painful.  Can I get a cortisone shot?  Would this be asking for trouble?  Are there alternatives?  I am so tired of the pain and am looking for some relief before damage is done to my wrist, thumb, and arm.  Ideas anyone?  What has worked for you?  My doctor thinks this is what I need, but is unsure with the LE.   BRCA1+, IDC Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "14/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/816905",
      "Title": "Can I get a cortisone shot in affected arm? BayouBabe crystalphm"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Feb 22, 2016 04:11PM BayouBabe wrote: BlueHeron - LD= Lymphedivas.com They also make beautiful printed sleeves",
      "MessageIndex": 6,
      "PostDate": "22/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/841364",
      "Title": "Juzo print sleeves--take a look! Binney4 SissyK"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 18, 2013 02:55PM BayouBabe wrote: I would seriously consider genetic counseling and testing for BRCA. Have you considered this option or discussed it with your physician?",
      "MessageIndex": 1,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/807939",
      "Title": "breast cancer survivors lreith62 lreith62"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 13, 2015 07:22PM BayouBabe wrote: Good luck sufi! Fingers crossed that you make it theough rads smoothly and have no added issues with your neck. Take care",
      "MessageIndex": 4,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/827499",
      "Title": "Pain in neck from lying on belly for radiation sufi mqt64"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Sep 14, 2013 06:22AM BayouBabe wrote: I also had a nerve block for my BMX. I was actually sent home with it still in place. I had two small bags, one on each side of me, that held a medicine ball. These delivered meds for two or three days at home. When the med balls where deflated, my husband had been given directions on how to remove the nerve blocks from my back. It was a bit of a pain having drains on each side, as well as the nerve block bags. But I did not move much that first week other than bathroom trips. I am glad I had the block and would recommend it.",
      "MessageIndex": 4,
      "PostDate": "14/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/810888",
      "Title": "Nerve block for mastectomy MYL SpecialK"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 19, 2013 09:50PM BayouBabe wrote: 44",
      "MessageIndex": 81,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 23, 2013 05:08PM BayouBabe wrote: Your chances of developing it are small, but it is possible. For any woman who had nodes removed, you should not get blood pressure, IVs, or shots in that arm. ALWAYS have them use the other arm. A bit of a pain, but doable. As far as lifting, you should still be fine for a baby carrier. Use both hands to distribute the weight, don't carry for long distances, etc. All common sense and easy adaptations. Not sure about the breast pump, but I am sure some one else will chime in about that. You might want to look into getting a sleeve, for flying only.",
      "MessageIndex": 2,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/809814",
      "Title": "Lymph node removal-HELP!!!!! alrz1980 Musical"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 7, 2013 03:26AM BayouBabe wrote: I am so sorry to hear about your mother! When my mother was diagnosed, I spent as much time with her as I could. I would bring her little gifts to cheer her day - a single flower, her favorite milkshake, a new pair of crazy socks(she loved these). We spent countless hours looking at photo albums and reminiscing. We planted a tree with my kids - they were 4 and 5 at the time. Spoil your dad, too, he will be stressed but trying to hold it together for you and your mom. This initial time period is the most difficult. Hugs to you and your family!",
      "MessageIndex": 1,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/807280",
      "Title": "Holding on by a thread walkaway walkaway"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 17, 2013 02:36PM BayouBabe wrote: cds - I totally understand your fear for your child as well. Mine were 10 and 11 when I was diagnosed. I was honest with them from the get go, in language that was at their level. We would and still do have regular family sit downs where we update them and answer any questions, as well as remind them that we can discuss it at anytime. Most times they were satisfied with very simplistic discussions. I was/am amazed at their resiliency, ability to provide each other and me with comfort, and how they have stepped up to help out at home. My daughter asked to see the counselor at school, and saw her regularly last school year - it gave her a place to voice her fears/concerns without worrying about what I would think. Find someone like this for your son - family friend, relative, teacher, etc. It will help. Hopefully next week you will get the all clear and will no longer need to worry. If you need to, feel free to private message me - I would be happy to share some things I did or went through with my kids. It is definitely hard going through this with little ones at home!",
      "MessageIndex": 5,
      "PostDate": "17/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/809447",
      "Title": "My Loved Ones Seem Dismissive of My Anxiety cds BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 10, 2013 12:06PM BayouBabe wrote: Could it be nerves? Are you having high anxiety about the upcoming surgery? Stress does weird things to us.",
      "MessageIndex": 1,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807513",
      "Title": "fever & no energy? soccermomof4 planetbananas"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 14, 2013 12:41PM BayouBabe wrote: I had radiation with a BMX, so it does happen. In my case, tumors were very close to the skin, and the margins were very small. Due to my age, and two children at home, radiation was thrown at it. I also had LVI and am BRCA+, and I believe this played into the decision also. At the beginning my MO wanted me to have radiation. RO did not think it necessary. The two of them did a phone consult, and both decided it would be in my best interest.",
      "MessageIndex": 2,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/807714",
      "Title": "When is radiation not needed? Rosa_Aurora Rosa_Aurora"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Dec 31, 2013 09:54AM BayouBabe wrote: We are all looking for the \"This is exactly what you need to do/take to live to a ripe old age and make your children miserable\" speech.  But in today's world, it will not come.  I did the no chemo happy dance.  Today - I second guess that decision a lot; I was an oncotype 18.  Even a second opinion on the no chemo provides me with no comfort.  Cancer is scary, I want to know I ( and every one on my medical team) gave it my all.  The best I can hope for, is that the world will be different for my children.  May they never have to worry about these things and may they not have my BRCA mutation.  We are paving the road for those that follow in our footsteps.  ",
      "MessageIndex": 70,
      "PostDate": "31/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Dec 4, 2014 11:45AM BayouBabe wrote: lower - please remember that you do not \"have to\" do anything. You, and only you, are in charge of this cancer journey. You are the only one living in your skin, and the decision is yours. I think too often medical professionals do not let us know that we are are own best advocates and in charge. They work for us! Sorry you are joining us here, but good luck as you navigate your care. Hugs",
      "MessageIndex": 41,
      "PostDate": "04/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/825836",
      "Title": "Stage 1-recurrance percentage % risk? DXat32 Ygammyyet"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 7, 2014 03:35PM BayouBabe wrote: I would trust your RO.  It is good that she wants to run a scan to see which way is best.  I know some ladies here have been instructed to do a certain breathing technique to minimize this problem.  Maybe some of them will post suggestions for you.",
      "MessageIndex": 2,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/816591",
      "Title": "Supine position for left breast radiation checkers donaldtrump369"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jun 29, 2013 08:11PM BayouBabe wrote: My thoughts and prayers are with you! My father was just diagnosed with follicular lymphoma - I made the tough decision to send him states away to my sister for care. I am mentally and physically too fatigued to help him adequately right now. I can't imagine what you are going through all by yourself! Remember you have to care for yourself first, as hard as this may be. Now is not the time to be too proud to ask for help (I am fiercely independent, and had an awful time with this. I know and get it). Have you thought about Meals on Wheels? Even a few meals a week is a great energy saver for you. What about hospice for your mom? As hard as this is, they have tremendous resources available. Friends, church members, neighbors? So many are eager to help if they just know what they can do. See if there is a social worker available where your mom gets care - they are wonderful at steering you in the right direction for help and services. The more help you get for her care, the more you can focus on YOU! The wait for tests is the hardest. In a perfect world we would all get in the next day - imagine the stress it would save. Be good to yourself now and find and do things to help you relax as best you can and make the time pass. Hugs to you and your mom!",
      "MessageIndex": 2,
      "PostDate": "29/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806919",
      "Title": "Facing potential BC while my mom dies of other cancer VegKris Momcat1962"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Apr 30, 2016 09:38AM BayouBabe wrote: Also, if you click on\"add to my favorite topics\", it will be much easier to locate your posts at a later date",
      "MessageIndex": 3,
      "PostDate": "30/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/843888",
      "Title": "Why was my topic removed after one day on this site? sjpatacb Moderators"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 16, 2013 03:15PM BayouBabe wrote: I have this myself, but never told anyone. Thought I was nuts! Glad to hear it is not just me. Have not found a solution yet; hope others have and share!",
      "MessageIndex": 3,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809416",
      "Title": "Phantom Itching txmomof2 Jennie93"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 22, 2014 08:39PM BayouBabe wrote: I had my BMX and ooph on same day (kept my uterus).  Scheduling all 3 surgeons at one time was a nightmare (BS, PS, and OBGyn), but well worth it.  I wanted one less surgery and less anesthesia.  It was doable, one night stay in hospital - they wanted to keep me a second night, but I asked to go home. I did have a nerve block/pain med ball.  I won't lie, the first few days were absolutely horrible; I made sure to stay on top of all my pain meds.  I needed help getting up and down and getting in and out of the bathroom, in part due to having drains on both sides, AND the pain med balls - made maneuvering on my own impossible.  I am glad I went this route and did it all at once.  ",
      "MessageIndex": 1,
      "PostDate": "22/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/823891",
      "Title": "BMX and ooph/hysterectomy? CeciliaVera Aug242007"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 18, 2013 03:11PM BayouBabe wrote: I would strongly advise it. My counselor went through everything very thoroughly with me, answered all my questions. I went by myself, and wished afterwards I had had someone go with me. I would strongly suggest bringing someone with you - it is a lot of info to take in. You can meet with the counselor and just talk. Afterwards, you can decide if you want to pursue the testing. Knowledge is power! Good luck with your difficult decision.",
      "MessageIndex": 3,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/807939",
      "Title": "breast cancer survivors lreith62 lreith62"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 18, 2013 03:22PM - edited Jul 18, 2013 03:22PM by BayouBabe I, too, miss my mother. She passed away just over 7 years ago from cancer, and not a day goes by that I don't think of her. Mothers hold a special place in our hearts forever. Cherish those memories. I did have testing, but after my diagnosis. I was only 44, plus had numerous cancers in my family. I found out I am BRCA1+. It was a hard decision to make, but am so glad I did. I have since had a BMX (cancer was only on the left). I also had my ovaries removed. My children will be tested when they are older. I have one cousin who tested after my diagnosis and was negative. I just sent the info to two other cousins today. The decision is now in their hands.",
      "MessageIndex": 5,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/807939",
      "Title": "breast cancer survivors lreith62 lreith62"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 18, 2013 06:49PM BayouBabe wrote: No - no smokers anywhere in my family. Being BRCA+ actually gave me peace of mind in a weird sort of way. Once I knew I had the mutation I was able to stop second guessing every thing in my life and placing blame on myself or my circumstances. Peace finds us in strange ways.",
      "MessageIndex": 10,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/807939",
      "Title": "breast cancer survivors lreith62 lreith62"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 26, 2014 10:11AM BayouBabe wrote: Chloesmom - while I understand the need to want the tumors gone, you will live with your reconstruction for the rest of your life. You have time to make decisions and get a second opinion. Do not rush into this. Hugs as you make these difficult decisions!",
      "MessageIndex": 1,
      "PostDate": "26/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826554",
      "Title": "Big decisions in the next week Chloesmom Chloesmom"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 28, 2013 01:16PM BayouBabe wrote: Old rads girl here from Feb/March. I had X-rays once a week. Was told it was to make sure the rads sight did not need to be adjusted slightly, due to TE moving, swelling, etc. Hang in there everyone! My skin is still tan, but doing good. Sending you all hugs and much needed strength and energy to get you through this part of the journey!",
      "MessageIndex": 1428,
      "PostDate": "28/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Dec 22, 2014 01:59PM BayouBabe wrote: fyre - You are your own best advocate. Never forget this in this awful BC ride. You and only you live with the decisions you make about your care. You have time to choose a team you are comfortable with. I fired 2 of my doctors part way through treatment. Wish I would have fired them right from the start, as I had misgivings about them both right from the start. I am so happy with my medical team now. BC is stressful enough without having doctors that don't listen to you and your concerns. Good luck on choosing who and where are best for you!",
      "MessageIndex": 5,
      "PostDate": "22/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827138",
      "Title": "43 and just diagnosed a few days ago Brandi999 Izzyfran"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 10, 2013 05:31AM BayouBabe wrote: Keep trying to be positive. The waiting is the hardest part. Be good to yourself to pass the time - a walk, movie, good book, massage, ice cream! Peace and hugs as you wait. Let us know your results.",
      "MessageIndex": 7,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806714",
      "Title": "35 with swollen, painful breast scaredmomoftwo scaredmomoftwo"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 28, 2014 05:25PM BayouBabe wrote: hello - sorry you find yourself in this situation.  I am BRCA 1+ also.  Please look at the FORCE website if you haven't found it already -  www.facingourrisk.org. Any specific question I can answer?",
      "MessageIndex": 1,
      "PostDate": "28/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/824057",
      "Title": "Being BRCA 1 positive StayingStrong76 dijo41"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Feb 10, 2014 08:00AM BayouBabe wrote: Definitely check in Magical and let us know how you are doing.  I am in OT right now, getting a custom splint made today.  Doc says if no improvement by end of month, shot is the next step.  Ugh.  So sick of cancer/AI drama.  I was so healthy and mobile before all this.",
      "MessageIndex": 14,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/816905",
      "Title": "Can I get a cortisone shot in affected arm? BayouBabe crystalphm"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "BayouBabe wrote: What is better - a glove or a gauntlet? I am new at this whole LE thing. Some background - I had a BMX and radiation. One node removed. During radiation I was having a touch of swelling. Got measured at a lymphedema clinic (had baseline prior to surgery). It showed 3 % swelling. They taught me MLD. They also measured me for a sleeve and glove. Sleeve fits fine. Glove - had two different ones, neither worked. Got sent for a custom one. Just received my 2nd custom and it is still giving me problems. Thus, 4 gloves, and still not one that fits. Out of frustration I ordered a gauntlet from Lymphadivas - they had a grab bag sale and thought I had nothing to lose. Got the gauntlet today and love it. But now I am wondering if there is a reason I need the glove instead of the gauntlet? Don't want to cause myself more issues. I had asked at my last appointment at LE clinic, why I needed one over the other, and the therapist just looked at me like I sprouted wings. (Not fond of this clinic, but it is all that is accessible to me). Ugh. Is a gauntlet ok? Also - I do not need it every day - have been fine so far just wearing sleeve/glove when my arm feels full/aches, or when exercising. Please help. LE is starting to cause me to lose my mind! BRCA1+, IDC Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/807160",
      "Title": "Glove or Gauntlet??? BayouBabe BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 3, 2013 11:11PM BayouBabe wrote: Thank you! Comfort I understand. That is why the custom is not good for me. For one I don't think they have the measurements just right. My fingers hurt in it and ache. It also leaves horrible indents on my hand where the seams are. My fingers should not look like and feel like sausages - at least that's what I keep telling the clinic. So frustrating.",
      "MessageIndex": 4,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/807160",
      "Title": "Glove or Gauntlet??? BayouBabe BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 5, 2013 10:21PM BayouBabe wrote: Thanks for the tips and advice everyone! Figuring out LE is mind boggling!",
      "MessageIndex": 6,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/807160",
      "Title": "Glove or Gauntlet??? BayouBabe BayouBabe"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Apr 7, 2014 09:35AM BayouBabe wrote: Here's my two cents - breast cancer does not run in my family.  I never had any problems with my breasts.  Went in for a routine mammogram.  They found calcifications.  Biopsy and tests later - I am BRCA +, had multiple lumps that were never felt or seen on mammogram.  Diagnosed with cancer.  I would not wait for the biopsy if it was recommended.  Cancer sucks.  Advanced cancer sucks even more.  Good luck.",
      "MessageIndex": 5,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819886",
      "Title": "stereotactic biopsy and calcifications jsher11785 jsher11785"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 18, 2013 03:40PM BayouBabe wrote: One of my favorite sayings I picked up here - courage isn't about being brave, courage is when you have no other choice! :) but thank you! I have two young kids at home and would walk through fire to see them grow up - kind of guess that's what I did with the radiation! Even if you decide not to test, be sure to keep all regular doctor visits, keep an eye on your birads score, do monthly breast exams, and trust your gut if you think something is out of the ordinary. You know your body best. Even with BRCA testing, I am sure there are numerous \"cancer\" genes that have yet to be discovered. Cancer is scary and those who have seen it first hand need to be as proactive as possible. Hugs!",
      "MessageIndex": 7,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/807939",
      "Title": "breast cancer survivors lreith62 lreith62"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Sep 15, 2013 04:46PM BayouBabe wrote: Momof4blessings - I am so sorry you are finding yourself here. The waiting for test results is truly the hardest part. Please know that most biopsies show benign results, and praying that this is the result for you. Be good to yourself this week and spoil yourself a bit while you wait - never a better time for your favorite ice cream, a long hot bath, a manicure, etc. to help you make the time pass. Hugs as you wait - we are here for you!",
      "MessageIndex": 1,
      "PostDate": "15/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811039",
      "Title": "So frustrated! Momof4blessings Momof4blessings"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 8, 2013 07:32PM BayouBabe wrote: Just remember if you do look stuff up, there are a lot of bad sites out there and a lot of old information. This truly is one of the best sites to cruise. Women here are so kind and helpful - I read and got support for months before I ever became \"Bayoubabe\" and posted myself.",
      "MessageIndex": 7,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/807426",
      "Title": "Confused -- which is worse ? Goldycat123 Goldycat123"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Apr 30, 2014 07:29AM BayouBabe wrote: just wanted to check in and let everyone know of a new option my PT is exploring with me.  It is an \"IontoPatch\".  It is like a large battery bandaid.  Water goes on one side, cortisone meds go on other, patch is placed on spot for about six hours, and the electrical charge from the battery forces the med under the skin without an injection.  Feels a bit tingly while wearing, like your arm is going asleep or small little prickles, not painful.  It takes several applications, but I am seeing some improvement, and no additional LE risk from an injection.  Worth checking out!  Time will tell if this is the magic bullet for me; fingers are crossed; so tired of painful use of my left hand.",
      "MessageIndex": 24,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/816905",
      "Title": "Can I get a cortisone shot in affected arm? BayouBabe crystalphm"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 21, 2015 08:14PM BayouBabe wrote: So glad to hear you are doing well sufi. The right PT therapist can be magical. Hang in there and hope you continue to do well",
      "MessageIndex": 6,
      "PostDate": "21/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/827499",
      "Title": "Pain in neck from lying on belly for radiation sufi mqt64"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jul 10, 2013 07:07PM BayouBabe wrote: I disagree with the mammogram every two years, especially with a family history. I had asked my MO about this. She says the only reason the recommendations changed from every one year to every two is to save the insurance companies money. She, under no circumstances, recommends every two years. Please find another doctor. Get a mammogram EVERY year.",
      "MessageIndex": 11,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806628",
      "Title": "Starting to feel anxious Shezza33 chrissyb"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 10, 2015 12:31PM BayouBabe wrote: I had radiation on my back. I have severe degenerative disc disease in my neck and spine. I also have fused discs in my neck, as well as a plate and screws. Rads caused me many issues with my neck, spine, and left arm during treatment. I insisted and fought for PT during treatment. No one wanted to be the one to prescribe PT, as they wanted proof that their treatment was what was causing my issues. Ugh! I had dealt with my neck and spine issues for years prior to BC and rads, and knew darn well they were making my pain and range of motion worse during treatment. So I fought for PT and won. I also insisted on not being left in position on the rads table any longer than necessary. Techs knew to not lalygag when I was on the table. Be assertive, ask for PT, and stretch/PT exercises regularly. Good luck.",
      "MessageIndex": 1,
      "PostDate": "10/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/827499",
      "Title": "Pain in neck from lying on belly for radiation sufi mqt64"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Jan 15, 2014 04:15PM BayouBabe wrote: Thank you Binney for the link.  PT and the brace have almost irritated the issue and made the pain more intense.  My doc and I decided that we are now going to try a custom made brace, rather than the off the shelf one.  We will give it a few more weeks trial.  If no change, then it looks like the shot.  Ugh.  I just want some relief without all the LE drama.  Sigh.  Hope someone comes along who has had surgery and or a cortisone shot and have had positive results!  Anyone?",
      "MessageIndex": 2,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/816905",
      "Title": "Can I get a cortisone shot in affected arm? BayouBabe crystalphm"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 5, 2013 05:13PM BayouBabe wrote: Sandra - I had something similar for several months after my BMX. It would hit at all different times of the day for no apparent reason. I compared it to someone sending an electric current through my chest. Drove me crazy and would vary in intensity. I can't remember when I had the last one. I think this summer. Hoping yours goes away soon!",
      "MessageIndex": 1,
      "PostDate": "05/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/814075",
      "Title": "Uncomfortable rush of pins & needles when I stand sandra4611 sandra4611"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Oct 20, 2014 05:26PM BayouBabe wrote: gretchy - first, sending you hugs and so sorry you are finding yourself here.  Second, you are not a victim, and you have plenty of time to become empowered through all this.  Do not put this pressure on yourself now.  I am glad your husband will be with you.  You are the patient - the doctor does not have to be happy with your sister being there by phone - you do.  Tomorrow will be a hard day - let yourself feel how you NEED to feel, not how you THINK you should feel.  Be good to yourself tonight and tomorrow.  (((Hugs)))",
      "MessageIndex": 1,
      "PostDate": "20/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825597",
      "Title": "so scared and sad gretchy gretchy"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Nov 26, 2014 04:55PM BayouBabe wrote: Have you consulted with a RO yet? That was my first step before any decisions were made about rads",
      "MessageIndex": 1,
      "PostDate": "26/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/826571",
      "Title": "Is radiation required for a complete pathological response? Cldnkl Hopeful82014"
    },
    {
      "AuthorID": "BayouBabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183090/profile",
      "Content": "Aug 11, 2013 12:12PM BayouBabe wrote: jabel - please see if you can get a referral for physical therapy. I went for several weeks and this greatly helped. I had many of the same issues. It was a life saver for me.",
      "MessageIndex": 1,
      "PostDate": "11/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/809176",
      "Title": "pain pain and more pain jabal Linda-n3"
    }
  ]
}