{
  "AuthorID": "bb226",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132284/profile",
  "Posts": [
    {
      "AuthorID": "bb226",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132284/profile",
      "Content": "Jul 13, 2011 08:27PM bb226 wrote: Hi. I was mapped 7/7 and start treatments 7/25. 5 weeks. Is anyone else having the treatments PRONE? Good luck to eveyone!!",
      "MessageIndex": 197,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "bb226",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132284/profile",
      "Content": "Jul 14, 2011 02:33AM bb226 wrote: Hi Elizabeth 1889, The RO does all her radiation this way. She is a national speaker and is a member of several research and breast cancer boards. The 1st RO I saw at my local hospital was going to do it supine. After seeking a 2nd opinion I found her at a large teaching hospital. Since she proposed this treatment I have been researching the concept via medical journals and like it. (I am lucky that being a nurse I am able to access it for free.) She states there are less skin, short and long term, side effects plus no radiation to other breast, lungs and heart except scatter. Hey I am sold. I am dreading and looking forward to getting this done with. Does that make sense??",
      "MessageIndex": 199,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "bb226",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132284/profile",
      "Content": "Jul 13, 2011 11:25PM bb226 wrote: Hi rn4babies, Take a breath and breathe... I am also a pediatric nurse that had the same thoughts as you. I work 10 hour shifts in a busy OR. I am able to take an intermittent FLMA (it is a federal law) for a life threatening illness. I start rads in 1.5 weeks. I am attached to an adult hospital that offers rads treatment plus it is a teaching hospital to boot. Can you believe during this time (even before I knew my dx.) I applied for a promotion and got it even though my superivisor knows of my cancer dx. God works in funny ways to help you cope! This is how I am working it...I will go to work at 7 and my rad treatment is at 345 some days and 430 other days. Because of FLMA, the hospital will let me leave for the treatment. The doctor does not want me returning after because she feels I will be too tired. I will use approximately 8 hours vacation a week. If I can not do my job because of fatigue or lifting, I am planning on short term disability for a few weeks later in treatment. I started intermittent FLMA beginning of June (for all the MD appts.) and it will run out 11/25/11. It will give me plenty of time to finish. My doc told me she will write for anything I need...less hours or time off. The HR department was great and has been assisting me. Remember is it only 5-7 weeks in your lifetime. Remember  when you had a baby, you took off 6-12 weeks for that without a problem. Good luck. Have you looked into the accelerated WB rads. It is only 3 weeks. Google the Canadian method for information.",
      "MessageIndex": 11,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/771545",
      "Title": "How in the world am I going to manage this? rn4babies bb226"
    },
    {
      "AuthorID": "bb226",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132284/profile",
      "Content": "Aug 21, 2011 12:04AM bb226 wrote: Oh my God...you have summed it up. I wished I would have seen this at the beginning of my journey instead of at the end. I am making this a favorite in case my sister's excisional breast bxs (yes that is 1 in each breast) of Thursday turn up BC. I will send it to her. Thanks Laura!",
      "MessageIndex": 3,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/773420",
      "Title": "29-ish Months Post-Diagnosis: You Will Get Through This! Kaidog MNSusan"
    },
    {
      "AuthorID": "bb226",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132284/profile",
      "Content": "Aug 21, 2011 12:03AM - edited Aug 21, 2011 12:05AM by bb226",
      "MessageIndex": 2,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/773420",
      "Title": "29-ish Months Post-Diagnosis: You Will Get Through This! Kaidog MNSusan"
    },
    {
      "AuthorID": "bb226",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132284/profile",
      "Content": "Aug 21, 2011 12:32AM bb226 wrote: Thanks Kaidog. I just realized that your pen name is the black dog name in my picture. I am hoping that my sis is fine. Statistically 1 in 8 women in their lifetime get BC. I figure I was the one and am protecting my 2 sisters, 4 nieces and 1 friend. When you add it up it equals 8 with me. A co-worker who has battled BC told me that early in my dx. I like the thought. It makes it easier then \"why me?\"",
      "MessageIndex": 7,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/773420",
      "Title": "29-ish Months Post-Diagnosis: You Will Get Through This! Kaidog MNSusan"
    }
  ]
}