{
  "AuthorID": "bbd",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92803/profile",
  "Posts": [
    {
      "AuthorID": "bbd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92803/profile",
      "Content": "Feb 20, 2010 04:55PM bbd wrote: Nancy- I am sorry to hear of your news. I am in treatment at Newton Wellesley. I know that my husband really wanted me to go to Boston because his opinion was the experts were there. I have been pleased with my care. The frequent weekly visits and daily visits when I start radiation will make it so much less stressful than driving to Boston. Good luck with your treatment. Barbara",
      "MessageIndex": 52,
      "PostDate": "20/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/748294",
      "Title": "Waiting for core biopsy results and scared nancyjg nicole1"
    },
    {
      "AuthorID": "bbd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92803/profile",
      "Content": "Jan 5, 2010 04:59PM bbd wrote: All- Waiting is the worst. I am a big planner and I want to know when, why and how. Nothing has gone like I have planned...When I was diagnosed in October, I \"planned\" a lumpectomy and radiation and I would be done by Christmas. Others warned me to take it one day at a time. Long story I am starting chemo this week and I am now planning to be done by May. I am not trying to discourage you. Hang in there. I realize it is much easier said then done. Best of luck, Barbara",
      "MessageIndex": 13,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/746073",
      "Title": "Core biopsy, waiting and apprehensive elly chrismcg"
    },
    {
      "AuthorID": "bbd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92803/profile",
      "Content": "Dec 20, 2009 07:43PM bbd wrote: Thank you all for your replies and support. I did go short..even though my hair was only shoulder length it was a shock. I am glad I did. People have been kind with compliments.  I think it will help to have a new look to focus on while I wait for chemo.  Wig shopping next.....one adventure after another.",
      "MessageIndex": 4105,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bbd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92803/profile",
      "Content": "Dec 14, 2009 06:23PM bbd wrote: I am waiting for results from a follow-up lumpectomy to get clean margins. Chemo will be scheduled for 2-3 weeks once I am clear. I am scheduled to get my hair cut tomorrow. Does it make sense to cut my hair shorter than normal to get ready? I had read that makes it easier for when you lose your hair. Or do I stay with the normal style until I find a wig? Any advice would be greatly appreciated.",
      "MessageIndex": 4075,
      "PostDate": "14/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "bbd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92803/profile",
      "Content": "Jun 15, 2010 07:36PM bbd wrote: All- I wanted to send you words of encouragement and support. When I started chemo someone posted to our thread and encouraged us. I wanted to pay it forward offering my words of encouragement.  I finished chemo in March and radiation treatment last week and wanted you all to know you can do it....it wasn't a walk in the park but I worked through treatment and looked at colleges with my daughter. You CAN do this. Hang in there. Barbara ",
      "MessageIndex": 718,
      "PostDate": "15/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "bbd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92803/profile",
      "Content": "Jan 6, 2010 09:03PM bbd wrote:  Going and waiting is the worst. You need to go. As was said most are benign, but should it be a problem early detection is so key. I feel fortunate that my dx is Stage 1 and was caught early. You can do it. Please let us know. Barbara ",
      "MessageIndex": 4,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/746367",
      "Title": "I'm scared to go in jamesdeans_mommy Lisa1962"
    }
  ]
}