{
  "AuthorID": "Bcbc",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276311/profile",
  "Posts": [
    {
      "AuthorID": "Bcbc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276311/profile",
      "Content": "Nov 4, 2018 05:48PM Bcbc wrote: Jacks24, besides the usual post op pain, you may also be having neuropathic pain related to the damage to nerves at the time of your mastectomy. There are several medications that are specific for nerve pain. I suggest you speak with your surgeon about adding one of these meds. Gabapentin and lyrica, for example. I couldn't believe what a difference gabapentin made for me. I still required Vicodin for awhile, but not as often. I'm five months post op. I still hate the expanders, but honestly, I'm so much more comfortable now. I thought they became more comfortable as they were expanded. Early on, the \"folds\" in the expanders put so much pressure on my skin and chest wall, it added to my misery. Best wishes.",
      "MessageIndex": 3,
      "PostDate": "04/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/868156",
      "Title": "Mastectomy/Expander pain jacks24 jacks24"
    },
    {
      "AuthorID": "Bcbc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276311/profile",
      "Content": "Sep 17, 2018 02:52AM Bcbc wrote: Readyabout, I wish I'd been prepared for just how uncomfortable these TEs would be for many weeks post op. I thought I was pretty tough, but this was very difficult for me. I was glad that I remembered that my anesthetist mentioned that gabapentin might be useful post op. It made a huge difference in my comfort level once my oncologist prescribed it for me. I still needed periodic Vicodin, but not often. I'm now 3+ months post op. I tried to taper off my gabapentin 10 days after my last expansion, but the pain returned. Hoping to try to taper again before my exchange in 10 weeks. Gabapentin is my best friend these days. I wish I'd started on it earlier.",
      "MessageIndex": 739,
      "PostDate": "17/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Bcbc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276311/profile",
      "Content": "Nov 4, 2018 11:27AM Bcbc wrote: SPDGirl, Walden1 and Aussie-cat, I'm five months out and still have nerve pain. Gabapentin has been a wonderful drug for me. I tried to go off it one month ago, but I hurt a lot again so resumed it. I occasionally have breakthrough pain, but life is much better on it. Lyrica works well for some women. I have also found wearing a bra to keep fabric from rubbing on my breast skin 24/7 is mandatory. Otherwise, my non existent left nipple hurts! So weird. I'm still having frequent muscle spasms, but I remain hopeful that when I have my exchange surgery next month (and have revision to prepectoral placement of the implants) my muscle spasms will be gone. We'll see. I doubt it will change my neuropathy pain. I think nerve pain post mastectomy is more common than we think. This is a good podcast about it from this website. https://www.breastcancer.org/community/podcasts/postmastectomy-pain-20181005  And I'm very hopeful that this simple intervention may be helpful. I will ask my breast surgeon about it at my next appt.-> http://cancerres.aacrjournals.org/content/73/24_Supplement/P3-10-03 I'm wondering if anyone has tried it. Please let me know if so. Gentle hugs to all. Becky",
      "MessageIndex": 789,
      "PostDate": "04/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Bcbc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276311/profile",
      "Content": "Dec 30, 2018 01:06PM Bcbc wrote: For those that follow this thread, I would suggest joining the very active Facebook group \"surviving post mastectomy pain syndrome,\" We're all in this together.",
      "MessageIndex": 1744,
      "PostDate": "30/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Bcbc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276311/profile",
      "Content": "Dec 31, 2018 02:05AM Bcbc wrote: Minus two, I do understand your aversion to Facebook, but the activity of that group is very supportive. I wish this group here was more active.",
      "MessageIndex": 1746,
      "PostDate": "31/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Bcbc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276311/profile",
      "Content": "May 16, 2019 08:09AM Bcbc wrote: Spdgirl, you are describing classic Post Mastectomy pain syndrome. I highly recommend you listen to the following podcast about it offered here on this website. It's unlikely that more extensive surgery would eliminate the pain. Dr. Springfield is a physiatrist and describes the cause ave treatment well. Also, if you're on Facebook, there is a very large group of women that share this syndrome and are very supportive. Click on menu, then \"Listen to our Podcasts\" Post-Mastectomy Pain Syndrome: What It Is and How It's Treated Michael Stubblefield, M.D.  ",
      "MessageIndex": 819,
      "PostDate": "16/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Bcbc",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276311/profile",
      "Content": "Dec 31, 2018 09:51AM - edited Dec 31, 2018 09:54AM by Bcbc it is a closed Facebook group. The only ones that can read posts are ones that have requested to join the group. I actually prefer the set up on Facebook. You can comment on specific comments, so it's very easy to follow the comments you're interested in. And you can \"like\" comments so easily. So, it's very easy to be supportive without having to remember the person's name to identify in your comment. Best of all, the group is active. Note that it had been more than two months since anyone has commented on this page until I mentioned Facebook. AliceKo never did get any answers about removing her implants. I felt bad that she didn't get any answers. The same questions asked on Facebook would receive many answers. (From what I've read in the Facebook group about removing implants to reduce pain, some have removed them, but in general, it didn't seem to be a good solution. ) Here's to a happy New Year for all that includes discoveries of relief for our pain!",
      "MessageIndex": 1748,
      "PostDate": "31/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    }
  ]
}