{
  "AuthorID": "Bcky",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
  "Posts": [
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Jan 15, 2016 03:13PM Bcky wrote: I had nipple surgery last week. My 5th and last BC surgery I hope. I am now at a place of 'What if it comes back?' ' How do I go on from here?' It is like cancer stole my sense of well being and peace that I took for granted before BC. I feel that fighting the fear of the cancer beast reccurring is very exhausting to my soul. I can go maybe 3 days normal living then I have to shut the door and recluse /rest. I hate that cancer stole my savings and a year from my career. I hate that cancer stole many things. I have to be on psychiatric meds/therapy/ BC support groups. Yet I want desperately for someone to tell me the nightmare is finally over. I want them to say I am healed. I want someone to say It will never happen again. I want someone to say that I can go on after this brave fight and know I fought a huge battle and won. No one is going to tell me that. I am NED. I am in remission. I also do not like that the Oncologist says my kind doesn't come back usually. I know she means well and that is her opinion. I have heard from other Oncs that I should be concerned.",
      "MessageIndex": 17,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/839887",
      "Title": "Do you get over the fear of reoccurrence ? Marie711 farmerlucy"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Bcky wrote: I had the uni mx operation on Jan.9th. There are parts where on and next to my sternum and ribs the skin is very tight against the bone. It appears that more muscle and flesh were removed than other areas of the mx. It is painful. Anyone else with the same issue? I am still having pain in that area. The feeling is like I was punched there. Dx 10/9/2014, DCIS, 1cm, Stage 0, Grade 1, 1/5 nodes, ER+/PR+, HER2- Dx 10/9/2014, IDC, 1cm, Grade 3, 1/5 nodes, ER+/PR+, HER2- Surgery 10/30/2014 Lumpectomy: Left Dx 10/31/2014, ILC, 1cm, Grade 2, 1/5 nodes, ER+/PR+, HER2- Surgery 1/9/2015 Mastectomy: Left Hormonal Therapy 2/1/2015 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Surgery 6/15/2015 Reconstruction (left): Tissue expander placement Surgery 10/9/2015 Reconstruction (left): Saline implant; Reconstruction (right): Fat grafting Surgery 1/10/2016 Reconstruction (left); Reconstruction (right) Surgery 3/6/2017 Reconstruction (left): Nipple tattoo Surgery 12/7/2018 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 2, 2015 05:27AM - edited Feb 2, 2015 05:37AM by Bcky Thankyou so much Ariom. Yes like being punched in the sternum. Exactly. Thankyou.I thought I was alone in that. My surgeon fell and broke her arm and is out on leave. I see the surgeons assistant and she says what you do to just do my excersises. I am hoping to see my lymphodema therapist soon. I have been wearing the same compression sleeve since my lumpectomy in October and finally months later all the other compression things I need are being mailed to me. Three month wait almost. I had the basic unfortune of dealing with a lousy prosthesis place that thought they could keep my compression garments so so long. My mom came to stay two weeks with me for unimx surgery. I brought her in to the compression garment place. Still nothing. I finally asked my PHD to call them and today my stuff is getting mailed. Emotionally and psychologically I am not ready for recon. I am seeing a cancer psychologist and psychiatrist for some really bad PTSD from this DX. Yes it is a concave area just above the suture line. Thankyou becuase people are acting like I should be up and about and all done yet I am still very tired at times. Thankyou for acknowledging it takes time. MX is an amputation no matter the way they say it. *Thanks RoadRash hope you feel better too. Many years of pain. I am sorry. Partially my hesitancy to get recon.",
      "MessageIndex": 5,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 2, 2015 11:31PM Bcky wrote: Thanks Ariom",
      "MessageIndex": 7,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 3, 2015 03:40AM - edited Feb 3, 2015 03:41AM by Bcky Thankyou Road Rash. I was making it in my career and finally saving decent money. Getting excellent reviews from clients. Then BC. I am so depressed and sad. Very scared. I have PTSD the psychiatrist says. All the drugs they give cannot take away the reality of fear of death and cancer for me. I saw two therapists today and one specializes in cancer. She had cancer herself as a child. Somedays I want to simply fall asleep and not wake up. I used to be a type A person. Excelling at everything. Now I have not plucked my eyebrows in two weeks. My clothes are dirty. I have not gotten the mail in days. I need groceries. I am just so overwhelmed that after two therapists I came home and slept a few hours. I just took an Ativan and will sleep again. I have no appointments tommorow and have zero plans to deal with anything. On the 4th I will deal with things. I have an appt that day. Why are PHDs and Drs surprised when we are so depressed and sad? You are so right we were forced to deal with such a traumatic dx so fast. Facing BC. Somedays I can't. I am selling all I own and will move back to my families home state in 3 months when the lease is up. I live thousands miles away from family.",
      "MessageIndex": 9,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 6, 2015 03:59AM Bcky wrote: Thanks Ariom. Yes the Support Groups help. It will ease my mind to see a surgeon to explain why my sternum hurts so bad. But thankyou for reassuring me in the other past posts that it is normal. It relieved allot of anxiety.",
      "MessageIndex": 24,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 4, 2015 02:22AM - edited Feb 4, 2015 02:31AM by Bcky Today I made myself bathe. I bathe if I have to go somewhere but avoid it if home alone because the MX scar is really scarey.Today I washed my clothes; dealt with bills; and grocery shopped a bags worth. I filled the tank. I get very overwhelmed and have to stop when the overwhelm starts. I tried lifting the grocery bag with handles with my right arm because my mx was my left breast. My muscles really pulled in the sternum area....really pulled. Ouch! So I got a carriage. Came home and took half an oxycodone. My sternum hurt just from that grocery bag. I think that these cancer specialists know how devastating and traumatic this dx is but unless they are therapists they cannot and do not want to deal with it. PHDs do the physical work then therapists the mental. I hate it too when PHds treat us like we are silly/ crazy because we are so sad or scared. I cried in therapy so hard yesterday that I napped three hours after then that night slept 12 hours. To me it is the remaining pain of surgery. The fear of death. Feeling like I have lost everything and lost the most important thing of all. My health. My worry free health. Having cancer always on the back of ones mind is exhausting and scarey. I started Tamoxifen three days ago. I have lost my appetite completely. I am forcing myself to eat Japanese noodle soup and pop tarts. Not healthy but it is food. I cannot wait to go home(1000s miles away) to family. After surgery for mx I was placed in a recovery room next door to a woman that projectile vomited all night and really suffered. I knew who she was because I heard her talking to her surgeon before surgery. I heard her voice in her recovery room.She sounded good before surgery. Anyway the next morning her PHD came in and told her husband she was not doing well. She needed palliative then Hospice care. I was so thoroughly scared by listening to her all night then the a.m that after returning home from surgery I was beyond anxious and crawling out of my skin with fright. After my uni mx I was in my recovery room alone with a morphine drip desperatley trying to rest with many blankets. I asked why I was so cold. The nurse said shock. My mom was with me for surgery but left after and left me alone that night and the next day until discharge. It seems that it takes all the courage I have to face the day. I want to stay and hide in my apt. I told the RN that I found listening to a human being suffering all night long traumatic and more exhausting mentally than I already was from my surgery. Her response was hospitals are no place to rest. She insisted I sponge bathe but I was still freezing. Hospitals give me the creeps now. She did not care that I was freezing and I had to bathe with an IV bag;nerve blocking ball and blood ball thing etc. I have PTSD now and do not know I will ever forget the sound of that poor woman suffering.",
      "MessageIndex": 12,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 4, 2015 02:39AM - edited Feb 4, 2015 02:47AM by Bcky Thankyou Glenny. It was horrifying. I so desperately needed to rest that night and calm down my own fears of my own surgery. Thankyou for validating I am ok and just doing the best I can and right now it has to be enough. I bought organic mac and cheese and the Japanese noodle soup has bits of chicken.I have lymphedema in my left arm and trunkal too from the lumpectomy. The Lymph specialist helped allot and I wear my compression garments. I have to see her again now because of this mx. The surgeon said they had to tie my left arm down during mx surgery. My left arm was real swollen but it has gone way down and looks normal now.",
      "MessageIndex": 14,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 4, 2015 06:05AM Bcky wrote: Also above my mx scar is like a deep indent. My skin is so close to the bone. Does anyone have that? My sternum hurts but that indent does too. I see the PHD on the 4th. I already showed it to her but my original surgeon is on sick leave.",
      "MessageIndex": 17,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 5, 2015 06:46AM Bcky wrote: Finally on the 12th I can see a surgeon to take a good look at my mx. My original surgeon is still on leave but Another surgeon will help. I should not need dilaudid/ocycodones anymore yet tonight I just took one before I go to sleep. My mx hurts still a great deal. I went to my Breast Cancer support group tonight and shared my concerns.",
      "MessageIndex": 18,
      "PostDate": "05/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 5, 2015 10:41PM Bcky wrote: The support group is helpful. I have been going since Nov. Others there told me they had sternum pain too. I found them by contacting 1800 numbers and support group contacts the hospital gave me. thanks",
      "MessageIndex": 20,
      "PostDate": "05/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Jan 31, 2015 11:18PM - edited Jan 31, 2015 11:29PM by Bcky You too thanks. Dilaudid; Oxycodone for pain. Larazepam for anxiety. Tarazodone to sleep. Tamoxifen and Effexor I start tommorow.I do not take the Oxycodone or Dilaudid unless the pain is bad. But it really hurts. The PHDs say just do your exercises. It is like there is a huge swath of flesh like a valley that the surgeon took out by my ribs and it hurts. I can feel my ribs. The surgeons assistant said the surgeon took out the fascia ,as well as, breast flesh. I do not have the tight bra feeling or being squeezed by someone (the iron bra-they call it). I am sorry you are having that. That would be maddening.",
      "MessageIndex": 3,
      "PostDate": "31/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 6, 2015 03:52AM Bcky wrote: Thanks glennie....what a cute dog! My sternum hurt a little less today but I slept 12 hours on oxycodone and ativan.",
      "MessageIndex": 22,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 4, 2015 03:29AM Bcky wrote: Glennie I have been taking Ativan since my Lumpectomy in Oct. It is really a help. Some nights I cannot sleep well. Other nights I sleep for hours and hours. The psychiatrist gave me trazadone to sleep but I am not using it because it can cause heart arrythmia. I am waiting on her recieving my echocardiogram results via consent form. I am so glad for your responses Glennie. Thanks. I am here for you too.",
      "MessageIndex": 16,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/828054",
      "Title": "Pain after uni mx Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Jan 31, 2015 05:33PM Bcky wrote: The worry has taken over my life. I have huge anxiety. I am starting to see a psychiatrist now for PTSD. Today is a snowy rainy day and I decided to do Nothing but sleep. Eat soup and toast and stare at the tv. Every day is PHD appts etc. Very very stressful.",
      "MessageIndex": 10,
      "PostDate": "31/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828008",
      "Title": "The worrying is starting to take overmy life ConstantlyWorried Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 16, 2014 05:02AM Bcky wrote: Yes me. I am waiting as well. Very scarey. My Breast cancer score was upgraded after surgery.",
      "MessageIndex": 1,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826307",
      "Title": "Waiting for oncotype test to come back. Worried! Krynko Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 16, 2014 05:57AM Bcky wrote: It is terrifying. I know. Sweetheart. I think many of us on the boards from what I am reading have things found in surgery that make our diagnosis much worse. The Lobular Cancer was found during surgery for me. I had a DCIS Grade 1 tumor then pathologized at Grade 2 after surgery. Then Invasive Ductal Carcinoma Grade 2 that after surgery was deemed Grade 3 alongside it had Lobular cancer inside it and a comedo necrosis inside it. I refer to that last tumor as my other tumors evil twin. Like a mass of Evilness. A Cruddy nasty cancer ball of all sorted cancers. ICK! Hence I bet I have to have chemo. You may not have too. It is about the genetics of the tumor. The fact they are talking about chemo with me before my oncotype tells me I bet I will have a high score from tumor #2. Tumor #2 in my boob was an evil mix of Grade 3 Badness. ",
      "MessageIndex": 15,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826307",
      "Title": "Waiting for oncotype test to come back. Worried! Krynko Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Aug 19, 2018 03:10AM Bcky wrote: Stella and Other Gals.... I have trunkal LE; left arm and hand LE. It started after my L breast MX and breast reduction on my right side. I had a total of five surgery's that started in 2014. My last surgery was in January 2017. After my MX when it was discovered I had LE I got treatment from a licensed LE Massage Therapist through my oncologists recommendation. My arm and hand went back to normal size. I was using my compression garments for hand and arm. In 2016 during an oncologist visit the PA asked if my distended belly was causing me any pain or discomfort. At the time I said no and chalked it up to the 70lb weight gain during cancer treatment in 3 yrs. In 2017 my oncologist discovered I had trunkal LE. That my LE from 2014 had progressed from Stage 1 to Stage 2 and had gone into my trunk. Quietly my LE was getting much worse. I had no idea until I started experiencing rib pain. I am a Licensed Massage Therapist and was working allot of hours back then. My oncologist told me I had to stop working so much. I did. Despite losing weight my belly is still very distended and hard like I swallowed a beach ball. I had my gallbladder removed last month and that has caused some relief. I am also having spotting now everyday for about three months. I have a uterine biopsy scheduled for the 28th. I will be having either a normal full hysterectomy or an oncological one depending on the results. I am seeing a vein doctor on the 24th because I have developed vericose spider leg veins but just on the left leg. Like you I have the weird bleeding and one sided lymphodema. I had reconstruction surgery on my right breast and have had no lymphodema on that side. After my gallbladder was removed my lymphodema was horrible. My ankles swelled up terribly. I chided the Doctor into letting me leave the hospital early so I could get to my LE massage appt. My ankles were so swollen I could barely walk. I have been on Tamoxifen since dx. Not sure what it is but the abdominal swelling is weird and disconcerting. The endless spotting / bleeding is scary.",
      "MessageIndex": 17,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/823702",
      "Title": "Abdominal Lymphedema Only StellaStarr Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Apr 5, 2015 07:59PM Bcky wrote: I have a very serious question. I had my last Onc appt. just last week and my liver enzymes etc were good. My Onc. scheduled me for a bone density test. I go tommorow. During my visit with her I showed her a swollen gland on my groin which has since all but disappeared. What has happened 3x since is that at night just before I fall asleep I am getting a severe belly ache. So severe that each night it has kept me up until roughly 3am. Last night was so painful I was on my hands and knees. I tried drinking a bit of baking soda with water to no avail. I Dr. Googled and found it could be a number of things. I quit soda twenty years ago yet had some organic root beer last week. One man on Dr. Google says stopping the soda helped as the pain happened days later much the same as mine. But I am thinking abdominal mets. I had a clean Pet and MRI before my Uni MX in January. They found a shadow on my left rib after a chest xray but then said it was not cancer but an old injury because the PET and MRI showed no mets. Now I am scared. Has anyone experienced this intense belly pain? It radiates up to my bra line.",
      "MessageIndex": 2951,
      "PostDate": "05/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Feb 8, 2015 06:35PM Bcky wrote: We have so much in common Angelia. Uni mx. No chemo. I have a Fear of death. Fear of cancer. I am on medication now for help. I have two college degrees. Art awards etc. Used to be a high achiever. Excellent career. Brave independent woman.BC has withered me to a partially broken person. I see a psychiatrist and two therapists now. One works at the Cancer center. I used to be against psyche meds pre BC days. Now I take Ativan. Effexor. and other meds to keep me glued enough to get the very basics done in my life. Like showering/laundry etc. Don't be afraid to ask for help. My psychiatrist explained a cancer diagnosis is a very very traumatic event psychologically. It is better to be honest and deal up front with the fear and pain than hide these feelings. It is healthy to tell and feel your feelings. Without psyche meds I would be in a hospital on a psyche ward forced on meds. I now have Major Depression and PTSD. Do not be afraid to see a therapist. It is ok to get help.",
      "MessageIndex": 6,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/828271",
      "Title": "How do you stop the negative thoughts SpriteB Jek1983"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Apr 8, 2015 11:34PM Bcky wrote: Thanks ladies for your replies. I went to see my Oncological Therapist. I told her I had a bout with the abdominal pain last night. It started at around 930 pm and went on and on until 330 am. Same as the last three times before. So my Oncological Therapist went to the third floor and found my oncologists nurse. The nurse and my oncologist do not believe it is mets. They suggest that I need to try Tumms extra strength first. If that does not work then I need to see a GI PHD. Thankyou again ladies. Another gal at my BC Support Group tonight suggested gallbladder as well. But the pain is not on my right. It starts under my rib cage then down my belly and radiates to one point in my spine. The Oncological nurse said that if it were spine mets I would not have abdominal pain. Ok well off to bed. Who knows. But each of your answers are in tune with what My ONC and her RN say.",
      "MessageIndex": 2956,
      "PostDate": "08/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Aug 23, 2018 09:34PM Bcky wrote: Oh Great! Keep me posted after you see the Doctor. It is all so life altering and just plain old hard.",
      "MessageIndex": 19,
      "PostDate": "23/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/823702",
      "Title": "Abdominal Lymphedema Only StellaStarr Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "May 3, 2015 11:38PM Bcky wrote: 46",
      "MessageIndex": 437,
      "PostDate": "03/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 10, 2014 06:10PM Bcky wrote: Yes I had a Cat Scan and the Surgeon thought I had rib mets. Then a Pet Scan said I did not. Because I am reading chemo can cause naeropathy etc. I also live alone. My parents will be here a few weeks to help and that is it. How can I do chemo for months all alone?",
      "MessageIndex": 9,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826132",
      "Title": "Dealing with More Bad News After Surgery and Pathology Report Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Bcky wrote: I had two 1 centimeter tumors removed by lumpectomy last Friday. The DCIS tumor was initially a Grade 0. After Surgery/Pathology Report now a Grade 1. The IDC tumor was a Grade 2 now after Surgery/Pathology a Grade 3. They found tumor cells .18mm on one lymphnode. I am terrified of these tumor cells. Today I had a frontal head ache and the first thing I thought was it may be a tumor cell migrating to my brain. I have never had a headache like that. It came and went fast. It was a weird frontal pain in my forehead. I am very frightened. I also have read research that core biopsies can spread cancer cells to SNL and nodes. That core biopsies can seed cancer cells into the incision and needle lines of the biopsy. Dx 10/9/2014, DCIS, 1cm, Stage 0, Grade 1, 1/5 nodes, ER+/PR+, HER2- Dx 10/9/2014, IDC, 1cm, Grade 3, 1/5 nodes, ER+/PR+, HER2- Surgery 10/30/2014 Lumpectomy: Left Dx 10/31/2014, ILC, 1cm, Grade 2, 1/5 nodes, ER+/PR+, HER2- Surgery 1/9/2015 Mastectomy: Left Hormonal Therapy 2/1/2015 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Surgery 6/15/2015 Reconstruction (left): Tissue expander placement Surgery 10/9/2015 Reconstruction (left): Saline implant; Reconstruction (right): Fat grafting Surgery 1/10/2016 Reconstruction (left); Reconstruction (right) Surgery 3/6/2017 Reconstruction (left): Nipple tattoo Surgery 12/7/2018 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826132",
      "Title": "Dealing with More Bad News After Surgery and Pathology Report Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 10, 2014 03:29PM Bcky wrote: Thankyou for telling me not every tumor cell that escapes can turn into a tumor. I meant IDC not IBC I am sorry. I posted my diagnosis as public a while back and I am not sure if you can see it. Total terror.",
      "MessageIndex": 5,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826132",
      "Title": "Dealing with More Bad News After Surgery and Pathology Report Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 10, 2014 11:19PM Bcky wrote: Thanks ladies for the encouragement. My parents live 1000s miles away but they will be flying out by the 21st. I was under the impression chemotherapy was terrible. But I am reading different. Or more so Chemo is terrible but doable. Thankyou for your time and help.",
      "MessageIndex": 13,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826132",
      "Title": "Dealing with More Bad News After Surgery and Pathology Report Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 11, 2014 07:03PM - edited Nov 11, 2014 07:04PM by Bcky LOL Ick! like a nasty whirl of cancer. Then again I have always been a curious gal. A traveler. Willing try many new things. My breasts reflect my personality.\" Lets try DCIS. No Lets try IDC. How about some ILC in there? How about one tumor round and greyish then a yellowish tubular one? LOL unbelievable",
      "MessageIndex": 18,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826132",
      "Title": "Dealing with More Bad News After Surgery and Pathology Report Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 11, 2014 07:18PM Bcky wrote: Yes.I am going to try tonight. An Ativan with Tv. I treated myself to RiceFlour bread Gluten Free. It will be my treat. I made myself go to my Phds appt. this a.m then Walgreens, then the car wash and bought bread and organic peanut butter. Going to make toast as a comfort food and try and relax. Most days since dx I have to make myself do what needs to be done. Tommorow eyebrows need to be plucked. I look bedraggled and like a crazy lady. Like a bomb went off in my life because it did.",
      "MessageIndex": 20,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826132",
      "Title": "Dealing with More Bad News After Surgery and Pathology Report Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 11, 2014 06:46PM Bcky wrote: Went to the PHds today. Got my boob looked at and requested a copy of my pathology report. I have some ILC tangled up in the IDC and DCIS according to the Pathology report. I had like 2 one cm tumors all wadded up in a mass of sorts. One was tublar. ICK. I see the Onc for Tomoxafin real soon.",
      "MessageIndex": 17,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826132",
      "Title": "Dealing with More Bad News After Surgery and Pathology Report Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 11, 2014 12:27AM - edited Nov 11, 2014 12:37AM by Bcky Thankyou Meow and everyone. I go see the Physician tommorow. I have a bit of a Seroma? in my boob. I was just reading DCIS is always grade 0. How come they upgraded my DCIS too. It was initially DCIS Grade 0 now DCIS grade1 and my IDC was Grade 2 and now Grade 3. Too weird. 1030 am appt. I will ask questions and get a copy of my pathology report. Meow your Oncotype score was so high for Grade 2. Wow. I think it is the genes in the tumor? Kicks they want me to do radiation and hormonal therapy for sure. They are talking about Chemo now and waiting for the Oncotype. I had 5 nodes removed. 1 positive. .18mm of cancer cells on the node. ",
      "MessageIndex": 16,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826132",
      "Title": "Dealing with More Bad News After Surgery and Pathology Report Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 16, 2014 05:26AM Bcky wrote: I know MEOW chemo is SCAREY.",
      "MessageIndex": 7,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826307",
      "Title": "Waiting for oncotype test to come back. Worried! Krynko Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 10, 2014 05:12PM Bcky wrote: Thankyou I just had a shower and I am going to clean the apartment a bit. I read before showering about managing fear on here. I agree with all of it. Just at the root of the issue now I have to tell myself they took the cancer out. I still feel like I have tumor cells in my body running around looking to land. I must because they said they found .18 mm of cancer cells on a node during surgery. I cannot fathom chemo. The PA was asking if I would be interested in chemo as one tumor was upgraded to 3. I have to wait for my oncotype. I was just accepting radiation and oophrectomy and Tomoxifan. I live alone. My parents are coming in two weeks. I think bone mets are started by tumor cells that travel. How powerfully frightening. I take Ativan.",
      "MessageIndex": 7,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826132",
      "Title": "Dealing with More Bad News After Surgery and Pathology Report Bcky Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 16, 2014 05:25AM Bcky wrote: Strong Woman! noonrider. ",
      "MessageIndex": 6,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826307",
      "Title": "Waiting for oncotype test to come back. Worried! Krynko Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 16, 2014 06:06AM Bcky wrote: Thanks noonrider for hope. I would love to have my hair back after chemo. I have bits of grey now but not allot. I would love to have my thick hair back either auburn and grey or all grey. There has been concern about me taking Tomaxifan and talk of an oophrectomy because I had genetic testing done long ago and they found I have MTHFR Gene and C7116. These genes make me susceptible to venous thrumbosis and I have to take LMethyl Folate Calcium 7.5 mg everyday because my body from MTHFR does not turn nutrients into folate acid ever or at all. My body does not do it without a prescript. I am all for ovary removal. But the Onc is not convinced I need to skip Tamoxifan. I am afraid to take it.",
      "MessageIndex": 16,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826307",
      "Title": "Waiting for oncotype test to come back. Worried! Krynko Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 16, 2014 06:16AM Bcky wrote: There is one thing scarier than chemo. Bone Mets. Stage 4. I had a Cat Scan in the beginning and they thought I had Mets on my Ribs. A Pet Scan confirmed I did not. So if I have to do Chemo to avoid Stage 4 or Brain Mets or Lung Mets I will do it. What is most disheartening is Breast cancer comes back sometimes in women years later despite Chemo. Scarey. Freaky Disease. Cancer is really a profound illness.",
      "MessageIndex": 17,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826307",
      "Title": "Waiting for oncotype test to come back. Worried! Krynko Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 16, 2014 05:22AM - edited Nov 16, 2014 05:23AM by Bcky Initially before surgery they felt just Rads and Tamoxifen. Then after surgery they found .18mm of cancer cells on a lymphnode, They also upgraded one tumor from Grade 2 to Grade 3. I had two tumors. The aggressive tumor is Invasive Ductal and there is comedo necrosis and Invasive Lobular cancer in it. The PA was asking about if I would contemplate Chemo at my post op exam . I said no. But if my Oncotype comes back that I need it I will do it. I FEAR chemo.",
      "MessageIndex": 5,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826307",
      "Title": "Waiting for oncotype test to come back. Worried! Krynko Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 16, 2014 05:31AM - edited Nov 16, 2014 05:35AM by Bcky Me too. Besides the chemical assault on my body. I fear heart damage. I have a birth defected heart. I also will lose 2 feet of my auburn hair. In 2007 I cut off my braid and donated it to the American Cancer Society. I have not cut it since and I am going to donate this braid to the American Cancer Society if I have to do chemo. I have laid awake many a night thinking about chemo/ breast cancer/ my death/ my life. Overwhelming.",
      "MessageIndex": 9,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826307",
      "Title": "Waiting for oncotype test to come back. Worried! Krynko Bcky"
    },
    {
      "AuthorID": "Bcky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206248/profile",
      "Content": "Nov 16, 2014 05:40AM Bcky wrote: Mouth Sores can be lessened with baking soda in the water I heard too. The nails and hair: I would not try and save my hair. Saving my 2 foot braid I imagine the chemical damage and thinning it would look awful. I will have my hair donated to American Cancer Society and whatever grows back I pray is healthy hair. I accept I may never have long thick auburn hair again after chemo. It will probably be curley and grey. Tamoxifan will thin it as well. So 5 years of Tamox means I should keep it short. My long hair braided days are over soon I am afraid.",
      "MessageIndex": 11,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826307",
      "Title": "Waiting for oncotype test to come back. Worried! Krynko Bcky"
    }
  ]
}