{
  "AuthorID": "bcsurvivor7…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149671/profile",
  "Posts": [
    {
      "AuthorID": "bcsurvivor7…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149671/profile",
      "Content": "Apr 21, 2012 02:23PM bcsurvivor76 wrote: I just had my first round of Halaven yesterday with steroids and zofran. I woke up this morning with a bad headache. I am so grateful to have found this board, and have gained so much support from each and every one of you. Thank you,",
      "MessageIndex": 829,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "bcsurvivor7…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149671/profile",
      "Content": "Apr 29, 2012 04:23AM bcsurvivor76 wrote: Yesterday I was scheduled for my day 8 treatment in round one...but found out my white count was too low, and I am neutropenic so my chemo was delayed. I could not get neulatsa doc said because it was to late..anyone else had this happen? I am worried since I only had one treatment and had an issue. Does this mean I will have to go off often drug?",
      "MessageIndex": 842,
      "PostDate": "29/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "bcsurvivor7…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149671/profile",
      "Content": "Aug 28, 2012 02:55AM bcsurvivor76 wrote: I am scheduled for my last Halaven treatment on Wednesday. Then, headed to MDA for scans to see if the how the cancer responded. I am hopeful. Currently, I am very tired, and have breakthrough nausea. I also had neuropathy, which is much more bothersome, and wondered if others had the same SE?",
      "MessageIndex": 1027,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "bcsurvivor7…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149671/profile",
      "Content": "Jun 26, 2012 11:48AM bcsurvivor76 wrote: Apple, please explain more :-)    Has anyone had issues with needing blood transfusions?  If so, when? My MO says that it can happen due to the half-life..I now realize there is the potential for after effects...UGH! eag, feel free to steal my quote under your signature. We all need something to fuel our strength! ",
      "MessageIndex": 915,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "bcsurvivor7…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149671/profile",
      "Content": "Aug 28, 2012 03:32AM bcsurvivor76 wrote: I am a stay at home mom, so I have the ability to rest all day if needed. It is really more about the annoying feeling that anything.  Right now, I am scheduled to get rescanned, and then surgery and radiation are to follow. I often wonder if I will end up back on chemo, or if I will actually achieve NED :-) How do you get breaks?",
      "MessageIndex": 1029,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "bcsurvivor7…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149671/profile",
      "Content": "May 4, 2012 05:19AM bcsurvivor76 wrote: K-LO, I am unclear as to why I did not get any shots.  I thought is was because I was too low.  Plus, they think I had a sinus infection and started me on antibiotics.  I am going in tomorrow for the 2nd treatment of the first cycle.  I am so curious how my counts will be, and IF they will give me  a shot the following day.  I did speak to my doc briefly today, and she mentioned they were going to change my dose.  I asked if that meant the schedule as well, and she was going to get back to me.  So, tomorrow I will have more feedback, and will update everyone as soon as I arrive home :-) I will say skipping that dose allowed me to recover well, and fuel my body with some food for energy!",
      "MessageIndex": 850,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "bcsurvivor7…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149671/profile",
      "Content": "May 13, 2012 01:45AM bcsurvivor76 wrote: Hi Ladies, just checking in. I had my second treatment from round one. I had a lower dose, and tolerated this one much better. I get my treatment on Fridays, and Saturday's I have a terrible headache, sunday, Monday, Tuesday, nausea and fatigue. Wednesday, I start to feel like I can eat again. I am going this Friday for the first treatment of cycle 2. My hair is thinning out for sure. I wonder when it will come out in clumps? Can anyone provide their experience with that? Also, I am wondering how many cycles your docs have you on? I am so clueless how many I will need to have. Wishing everyone more energy!",
      "MessageIndex": 861,
      "PostDate": "13/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "bcsurvivor7…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149671/profile",
      "Content": "May 23, 2012 03:03AM bcsurvivor76 wrote: I finally received my 1st treatment of my second cycle on halaven yesterday. My MO switched my anti-nausea meds from Zofran to Emend, which seemed to help a great deal. I also got a shot of neupogen today and again tomorrow. As of now I am scheduled for my day 8 treatment on June 4th. (I asked to delay it for a work conference) I feel very tired, and my hair is only just thinning. Which is frustrating!",
      "MessageIndex": 871,
      "PostDate": "23/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "bcsurvivor7…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149671/profile",
      "Content": "Jun 26, 2012 06:21AM bcsurvivor76 wrote: I have one more treatment left of three cycles, before I head to MD Anderson on July 9th for a PET Scan to see if the cancer is responsive to Halaven.  Today is day 5, and I am definately feeling very tired as well. I get neupogen shots two days in row following chemo. I am scheduled on Wednesday for chemo, and I wonder how my counts will be. Also feeling so anxious to hear what the scans will show.",
      "MessageIndex": 912,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    }
  ]
}