{
  "AuthorID": "Beachwalker…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78007/profile",
  "Posts": [
    {
      "AuthorID": "Beachwalker…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78007/profile",
      "Content": "Jan 28, 2009 07:04PM - edited Jan 28, 2009 07:09PM by Beachwalker I started arimidex 2 months ago.  My oncologist wants me to go on the bisphonates trial; but I'm terrified that I'll end up with the rare side effect of jaw necrosis (the fear comes with having a rare breast cancer - you then think that you'll get all of the rare things).  Anyway, I asked (begged) if I could just go on the once a month Boniva.  He said no, because my bones are good at this time - I'd have to have osteoporosis.  It's very irritating that he wants me to go on a trial that is at least 10 times more Boniva, but won't give me the simple prescription of once a month for prevention.  I'm going to ask my primary care doctor to see if she'll prescribe it to me.",
      "MessageIndex": 6,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/727409",
      "Title": "Prophalactic Boniva ejlj nastazia_s"
    },
    {
      "AuthorID": "Beachwalker…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78007/profile",
      "Content": "Jan 19, 2009 09:02AM Beachwalker wrote: It was a primary care doctor with one of the better more well-known hospitals.  I don't know if you've ever been told that you have dense breasts?  Mammograms often miss cancer in dense breasts . . . MRIs should catch it.  I've sent you a private message, too.",
      "MessageIndex": 29,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/726764",
      "Title": "severe breast pain in left breast aljlbl Beesie"
    },
    {
      "AuthorID": "Beachwalker…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78007/profile",
      "Content": "Jan 18, 2009 09:32PM - edited Jan 18, 2009 09:45PM by Beachwalker Angie,  I hope that you get second and third opinions and the MRI -- just in case it is Inflammatory Breast Cancer.  It's a very scary thing to suggest; hopefully it is not, but if it is, the sooner you get it treated, the better.  Most IBC is not diagnosed until one is stage 3 or 4.  However, common sense says that there must be a stage 1 and 2 ... one doesn't immediately jump to 3 or 4.  When I was diagnosed with Stage 3B- IBC, my skin did not have the classic orange peel look.  Just a small red rash, and stabbing pain, and swelling.  Even my female gynecologist blew it.  She told me that my breast was a different consistency but since she didn't feel any lump, I could wait until my next mammogram.  I waited a month, got a better doctor, and was diagnosed with IBC very quickly.  My new doctor and clinic looked at my \"normal\" mammogram done by my prior hospital 10 months earlier, and they can see an \"area of organization\".  Perhaps if my IBC had been caught then, I wouldn't have been stage 3.  It is very important to listen to your inner voice and not be afraid to keep demanding answers.  ",
      "MessageIndex": 27,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/726764",
      "Title": "severe breast pain in left breast aljlbl Beesie"
    }
  ]
}