{
  "AuthorID": "beachbabe",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86119/profile",
  "Posts": [
    {
      "AuthorID": "beachbabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86119/profile",
      "Content": "beachbabe wrote: Starting chemo on the 17th of July, getting Taxotere and Carboplatin 6x. Followed by 6 weeks of radiation, Then year of Herceptin/Avastin if chosen in random clinical trial . Wow.  Anyone doing or have done about the same treatment that we can follow each others progress and compare notes. Very nervous, but need to start so I can have a routine in my life. I am worried about  steroids (weight gain) and constipation(very prone on normal days)  thanks for any insight! Angel  Angel Dx 5/4/2009, IDC, 3cm, Stage II, 7/12 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737214",
      "Title": "anyone getting taxotere and carboplatin treatment with herceptin beachbabe bluedasher"
    },
    {
      "AuthorID": "beachbabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86119/profile",
      "Content": "Jul 5, 2009 08:03PM beachbabe wrote: I also had the port a cath surgery on June 30th and the port is fine but the pain in the neck, front and back when I stand up (the weight of my chest going down) is hard to take. I feel a little better doing the deep breathing, has anyone had this? how long does it last. I do not think I can make it the year for chemo with this pain in the neck also. Do I need to call the doc and is there anything that can be done?",
      "MessageIndex": 38,
      "PostDate": "05/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694114",
      "Title": "Port-a Cath pain? TinaLee Kicks"
    },
    {
      "AuthorID": "beachbabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86119/profile",
      "Content": "Jul 10, 2009 06:39PM beachbabe wrote: Had my 9 day check up on the port and mastectomy scar and was told to remove the steri strips in the shower. Did this and the next day had a swelling around the port area. now it very sore, I am calling my dr. in the am. not sure if it is infected I go for chemo in a week.  Anyone else? ",
      "MessageIndex": 44,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694114",
      "Title": "Port-a Cath pain? TinaLee Kicks"
    },
    {
      "AuthorID": "beachbabe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86119/profile",
      "Content": "Jul 10, 2009 11:05AM beachbabe wrote: I also am starting chemo on the 17th I had the port put in on June 30th, I went thru all the tests, Bone scan and Muga are time consuming not painful, but could not be done the same day. Had ekg done same day I had the Port put in. I think major test are done just want the chemo to start to get routine back in my life and feel like I am still in charge of my life. haha. Getting lots of ideas from here and really appreciate everyone sharing!!  not really caring about the hair loss,(hair is very short anyway) worried about the steroids and weight gain. any advise? ",
      "MessageIndex": 196,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    }
  ]
}