{
  "AuthorID": "beach5",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268141/profile",
  "Posts": [
    {
      "AuthorID": "beach5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268141/profile",
      "Content": "Mar 9, 2019 03:40AM beach5 wrote: Debsmisto - I am also considering moving from HP to Kadcyla and P. I needed to do rads so we stayed on HP after my carbo was completed. I'm surprised that you are starting the entire regimen all over again. I have finished 9 of the 16 HP treatments, and our plan was to simply substitute Kadcyla for the H in the last 7 treatments. Did you guys discuss substituting vs. starting over? I'm wondering if I should reconsider something. I also discussed with my MO last week moving to Xeloda and finishing HP concurrently. I have triple negative and HER2+, so we are balancing trying to treat all.",
      "MessageIndex": 1316,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "beach5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268141/profile",
      "Content": "Mar 30, 2019 12:51PM beach5 wrote: I finished my first Kadcyla infusion yesterday. We are doing it as a single agent. No pre-meds, and over 90 minutes. They said the rest of infusions will be 30 minutes. I've moved from HP to Kadcyla. My plan was to just do 6 cycles of this which would essentially mirror the full Herceptin regimen if I had stayed on that. But the pharmacist and MO said yesterday we should discuss next time. I bit tired and queasy today, but feel pretty good. Washed the cars and drove 3 hours to the beach. Sometimes I wonder if I remember what feeling normal is:) My echo showed a few weird things, but we're sticking with the plan for now. I'm hoping dropping the P will allow my hair to start growing again.",
      "MessageIndex": 1331,
      "PostDate": "30/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "beach5",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268141/profile",
      "Content": "Mar 31, 2019 01:37PM beach5 wrote: Yes Stage 3 treatment. I know somewhat unusual, but an odd case (multi-expression TN before surgery and HER2 after) with really no standard of care. So far all, including insurance, have been pretty supportive in trying different things, with our focus now on trying to knock out HER2+ since it went untreated through all the neoadjuvant period(we were treating TN). We've elected to be as aggressive as we can and go from there. I'm continually amazed by you stage IV ladies, your stamina, attitude and support are incredible. Will let y'all know how things progress, and maybe Kadcyla becomes more common for earlier stage.",
      "MessageIndex": 1334,
      "PostDate": "31/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    }
  ]
}