{
  "AuthorID": "BeachyQueen…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126155/profile",
  "Posts": [
    {
      "AuthorID": "BeachyQueen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126155/profile",
      "Content": "BeachyQueen wrote: Hello Ladies, I have been reading your posts for some time now but still have unanswered questions. Apparently, having a recurrence in my mediastinal lymph nodes with pleural effusion moved me into a stage 4 diagnosis. I have been doing the double dosing of Faslodex since March 2011 and on 6/20 will be receiving my 5th dose. I feel as if I have aged 20 yrs since March!! The se's are tolerable but my qol has significantly changed. Not sure what being restaged to 4 really means. I could really use your help with this one ladies. My onc. is very difficult to volunteer info. Have to pry everything little thing out of him and even that is not much. He says he has had very good results with women on Faslodex and I believe him. However, I want to know if I am now in the category which basically says I have a poor prognosis because my mets are not in the bones but elsewhere? My dear husband seems to believe that I am overreacting with my fears and concerns because it is only now in my lymph nodes. (I had the fluid drained from my lung). What can you ladies tell me to confirm what I suspect to be the truth about this matter, are we in denial here, overreacting or both? Sorry to rant so.... Deborah Schroeder Dx 7/29/2007, IDC, 6cm+, Stage IV, Grade 3, 12/23 nodes, mets, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770452",
      "Title": "Newly restaged to IV BeachyQueen sarah1968uk"
    },
    {
      "AuthorID": "BeachyQueen…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126155/profile",
      "Content": "Jun 28, 2011 12:47AM BeachyQueen wrote: 43 first dx 46 Stage IV Bt the way, my diagnosis at 43 was while having my first and only mammo!!",
      "MessageIndex": 672,
      "PostDate": "28/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "BeachyQueen…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126155/profile",
      "Content": "Jun 17, 2011 09:23AM BeachyQueen wrote:",
      "MessageIndex": 12,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770452",
      "Title": "Newly restaged to IV BeachyQueen sarah1968uk"
    }
  ]
}