{
  "AuthorID": "Beachbum102…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
  "Posts": [
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 20, 2015 10:47AM Beachbum1023 wrote: Lils23, I am off to rads but let's talk later this evening! You can do this!! And I am going to help you.",
      "MessageIndex": 8,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828644",
      "Title": "\"Dr Google\" - not my best idea Lils23 Lils23"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 24, 2015 11:05AM Beachbum1023 wrote: Chris, I am so sorry that you have more than one battle to fight! You are the most important part of this, and sometimes we all have to pick our battles, and sometimes we just say no. Maybe it is time to stay away from the stress, and just say no to anything or anyone that causes dysfunction in your life. Say yes to you, and move on :)",
      "MessageIndex": 3,
      "PostDate": "24/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829822",
      "Title": "what a mess chris1959 AmyQ"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 31, 2015 11:10AM Beachbum1023 wrote: Hi Ladies, I had 28 rads and 5 boosts, and my skin held up pretty well for the most part. It did peel, turn dark, and freckle. I am still seeing peeling mostly now the boost area over the scar. I am distressed about the scar, it looks larger and puckered. It will turn red when I shower or rub Aloe on it. My armpit is still a bit tight, but I am working on that. The big deal was the look of it. My Dad was burned when I was 9 years old, and the visual of a burn makes me nauseous. Weird reaction but anything that looks like a burn makes me ill and weak in the knees.  My other big complaint, is the struggle to keep the pads on to keep it covered. I had the stretchy tube wrap and all it did was roll up. So I got out some ribbon and made festive shoulder straps to look like a cami top. That worked wonders, and kept it all in place, and comfortable!! No tape, and I could safety pin the pads to the fishnet. I could also wear my soft form just by pinning it to the fishnet. So a huge win for my recovery. I hope this may help someone struggling to stay covered and heal.",
      "MessageIndex": 508,
      "PostDate": "31/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 2, 2015 10:27AM Beachbum1023 wrote: Hi Raider Girl, I just got a bill for $43,113.84. And that is not all of it. Rads are $1,221 each day, I haven't got the bill for the boosts yet. And that does not include the RO visits etc. Don't have it to pay, don't care. No not depressed...................lol. I'm Stage IV, I will keep the balance running until.....yep you get it, and they won't. I have passed the point of being worth more dead than alive. Still don't care. Hating this. ",
      "MessageIndex": 515,
      "PostDate": "02/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 7, 2015 08:55AM - edited May 7, 2015 08:59AM by Beachbum1023   Raider Girl, I went to the beach the other day and the buzzards gave me the \"eye\". All this chemo fat I must have looked like a damn buffet!  I still have some swelling on my chest wall after rads, anyone else have this? And I have a blazing pain on my side right at the end of the rads field under my arm. Anyone have that? And a partridge in a pear tree.................some days I feel like there is no end ever to SE.",
      "MessageIndex": 532,
      "PostDate": "07/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 7, 2015 11:14PM Beachbum1023 wrote: Donna, I am so sorry that you are having to make more choices, especially when none of the results are what you want in the end. But you will just have to see what the scans etc. find and go from there. We all do the best we can with the situation at the time. I know that I could try to blame all things that have gone under the bridge, but that doesn't do any good, reduce any stress, or even change today. I hardly think passing on the chocolate bar, soy crackers, or martini would change anything. I have today to deal with, and I will do my best, but sometimes we have to let it go and remember that sometimes even our best is just not enough. I hope you take it easy on yourself, you deserve to make the best decision possible. Good Luck, I wish you the best!",
      "MessageIndex": 3,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829238",
      "Title": "Diagnosed DCIS again 3 years later - so different this time... Donna-Dew Donna-Dew"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Dec 30, 2014 10:14PM Beachbum1023 wrote: Well Ladies, since I had surgery on 12/15 I couldn't drive to go home to see the family and old friends. Seriously, I have BC someone couldn't drive up here to get me?? I thought it would be a little lonely being home alone, just me and my fish. But I didn't have to answer any dumb questions, predict my future, or look happy. I didn't cook, clean, or try to mop up spilled wine. I slept late, snacked on veggies and had shrimp for dinner, all in my old fuzzy robe and comfy slippers. I think it was one of the BEST Holidays ever!! No stress! Happy New Year Ladies!",
      "MessageIndex": 11,
      "PostDate": "30/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827265",
      "Title": "How My Holidays Were This Year DivineMrsM DivineMrsM"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 19, 2015 09:01AM Beachbum1023 wrote: LILS23, It is nothing until it is something! Use the cream as directed, and see what happens. I am praying and hoping that you get the best possible news. Now breath, and relax the weekend is on the way. Take Care!",
      "MessageIndex": 6,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828644",
      "Title": "\"Dr Google\" - not my best idea Lils23 Lils23"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 20, 2015 07:29PM Beachbum1023 wrote: Good evening Lils23, I hope you had a pleasant evening! So how is the cream working? Any change, or anything new going on with it? Have you heard any news yet? I know the waiting can drive a sane person crazy, been there. More like still there. It is all hurry up and wait, and more hurry up and wait. It can be frustrating and exhausting. But I have walked this road, and I have made it through chemo, surgery, and I finished rads #19 today. So far it has be doable, not fun, but doable. I figure every day at treatment is a huge investment in my future. I am banking on me! Stress can be very hard to deal with on any day, but harder when we stress about the unknown. Tell me now what I have to do, and I will find a way to do it. That is how I roll with breast cancer. Tell me what I am fighting and give me all the tools I need to kill it. I have gone to every test, scan, chemo, surgery, rads, and whatever else I have to do. No wonder you are so upset, how do you fight nothing?? Let's try to go with it is nothing until it is something, and then you roll on it as hard as you can! So relax, do something you love to do this weekend, and see what we have to fight. Then we go to battle. You can do this, it is all about you, and you are going to go Game On! Have a great weekend, let me know how you are :)",
      "MessageIndex": 10,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828644",
      "Title": "\"Dr Google\" - not my best idea Lils23 Lils23"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 18, 2015 11:16PM Beachbum1023 wrote: Lils23, first of all take a breath and try to relax. Second, Dr. Google is not a real Doctor so don't believe it. A lot of info on Google is out dated, from a bad source, or just plain flat wrong. You will find a lot of support from everyone here. I am so glad that you do have a set appointment to see the Doctor and find out what you really have. Please remember it is nothing until it is something. And he will be able to help you and decide what it is. Then you know for sure and can move on. I hope you get the best news! Please let us know how it goes. Take Care",
      "MessageIndex": 1,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828644",
      "Title": "\"Dr Google\" - not my best idea Lils23 Lils23"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 13, 2015 08:43AM Beachbum1023 wrote: Redwolf, I hope that your oncologist has a few more tricks in the trunk! I got your back. Sending prayers your way. Hugs, Cheryl",
      "MessageIndex": 7,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831418",
      "Title": "Please, Lord redwolf8812 GrammyR"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 9, 2015 11:43PM Beachbum1023 wrote: Hi Cmo65, welcome to our club, you will find plenty of info here and lots of support 24/7. Look through all of the threads here, the info is real time, sometimes hours old! And the info is correct and so honest. Stay away from Dr. Google, the info is usually outdated and incorrect or just plain wrong. Having a positive proactive attitude will serve you well. I do not have any history of breast cancer or any cancer in my family. So stunned would be correct. But I have a great care team, and my treatment has moved along quickly. Keep a notebook handy to write down questions for your Doctors, the information will come at you fast and non-stop. If you have someone to take to your appointments to help keep notes, that can be helpful. Some record it on their smartphones. Ask questions here, we have all been there, so you will find answers for all of your questions. And we have hints and tips for just about anything! The women here are amazing! You will feel better when you have all of the info, have a care team in place, and get started with treatments. The American Cancer Society has a great website, and they can be helpful. They have a lot of resources to help navigate treatment, find resources, and they offer some great programs along the way. Please visit here often, and let us all know what we can do to help. There are a lot of threads to follow, to laugh, to cry, and rant and compare. But remember here you are never alone, we all walk as one! Welcome! Cheryl",
      "MessageIndex": 5,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829317",
      "Title": "Was told this evening I have IDC Cmo65 mel147"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 7, 2015 10:45PM Beachbum1023 wrote: I have noticed that the numbers don't always add up either. Some are staged at 4 after surgery, some don't complete treatment for various reasons, and some die from another reason such as a car accident or heart attack. Just because they do have BC, other things can happen at any time.",
      "MessageIndex": 2,
      "PostDate": "07/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/828285",
      "Title": "If 93% survival rate at 5 yrs - why do the 7% perish? rleepac HaveFaithInHim"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 2, 2015 08:11AM Beachbum1023 wrote: Good Morning Ladies, I have a appointment on 1/9 to discuss/schedule radiation. Any tips, comments, or suggestions would be greatly appreciated. My Oncologist wants to schedule more chemo to start 1/20. Since I just started feeling well from chemo and surgery, I cringe at the thought of here I go again! Thank You!",
      "MessageIndex": 657,
      "PostDate": "02/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 4, 2015 08:31PM Beachbum1023 wrote: Hi Gongshow16, Celebrate your victory! I am very happy for you, this is not a easy path to follow, and you did it. Awesome!! I hope to follow you soon and bring everyone here with me. My advice, enjoy Life!",
      "MessageIndex": 716,
      "PostDate": "04/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 13, 2015 05:54PM Beachbum1023 wrote: Hi Hope50, My emotions are all over the place from one minute to the next. Since the first week of June, I have had 94 Doctor appointments!! And I worked full time 42 hour weeks. Not sure how I did all that, but it is a blur right now. I am seeing my RO tomorrow to schedule to start the rads. I am just afraid that by doing the rads to prevent a return, that the mets will grow crazy and I will second guess if I should have gone back to chemo asap. The rads scare me because I have heart damage from the Adriamycin, some side effect that is. The Tumor Board agree that I should do the rads then chemo. Depressing for sure. I really wanted my hair back for summer. So I get the swing from high to low, good days and bad days. I try to keep it all happy and positive, but I feel like I take steps backwards all the time. I was told that because we so depend on our care teams that when things change we react badly because we fear what could happen without them. And when our heads go to the dark place, it can be very depressing and confusing. It's cold and snowing, no sun, I live alone, and I am not working so I can go to treatment. I totally understand the \"blues\". And soon as we complete the treatment, we think we should all good to go, 100%! Uh no not really. I'm still fighting the side effects that linger, trying to recover from a mastectomy, and now rads?? And more chemo?? So for the rads graduates, any helpful info you can share to get through this hurdle? Thanks!",
      "MessageIndex": 931,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 18, 2015 12:19PM Beachbum1023 wrote: Hi Nomatterwhat, glad you are doing well after rads!! I go Thursday for the last sim to hopefully start rads on Monday. But after all the doctor visits, scans, chemo, surgery and recovery and now rads to go, I just might have to move to another apartment or try to explain all this to the local health department. What a ride this is. I have a lot of catching up to do. Thanks for sharing.",
      "MessageIndex": 1012,
      "PostDate": "18/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 23, 2015 08:37PM Beachbum1023 wrote: Hello funthing42 and PoppyK, Thank You for the tips and the info. I've been doing the BC thing since the middle of June 2014, and just about over it. I will be so glad when the rads are over, and I don't start until Monday. Since I am not working right now, I can skip the bras and just do tee shirts, which is what my RO prefers if possible. And she wants the Aloe Gel, which I have ready to go. I am just not so excited to have more fatigue on top of chemo and surgery fatigue. I think they jam all of these crappy treatments on us when we are too weak to protest! I guess it is too much to ask for our old life back, but I would if I could. But I have learned to eat the home made ice cream with extra hot fudge for lunch just in case. I'm not missing dessert! Have a magical weekend!",
      "MessageIndex": 1099,
      "PostDate": "23/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 29, 2015 09:59PM Beachbum1023 wrote: JustJean, at least I am not crazy. Tomorrow is #5, and I feel sunburned, and my armpit is sore, just like I told them. But that never happens until 3 to 4 weeks in. So they say.....can't wait until week 3 and 4. Should be good times. Frustrating for sure.",
      "MessageIndex": 1237,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 2, 2015 01:47PM Beachbum1023 wrote: Hi Bippy625, I am freezing in layers in Ohio, so I can ditch the bra no problem. We had about 10 inches snow yesterday so I ditch the bra and just wear a tee with a zip fleece but I so get the concave and the weirdos! It's hard enough to put mascara on my tiny lashes without smearing it, and the wig gets old too. The other night I had a 7 pm appointment for my heart ultrasound at the hospital. It was late and cold so went with my tee and zip fleece under my coat. Well, I had to wait and took my coat off forgetting I was very lopsided. Holy crap, I felt like everyone was staring at me. Very uncomfortable, and I was glad when I was called. But to make it worse, the tech asked me to just pull up my shirt, and I did. The look on her face was priceless when I had one boob!! Cancer sucks, but sometimes we laugh. At this point, I can throw my \"boob\" in the lingerie bag when I wash my panty hose. Grrr...... Ok gotta gel my rads area, I finished #6 today, and a long way to go. Take Care!",
      "MessageIndex": 1336,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 2, 2015 03:42PM Beachbum1023 wrote: CoyoteNV, thank you for your unending advice and support. I could not have my reconstruction started at the end of my mastectomy, so I may not do it all. Given my stage at this time, I feel that I want happy healthy days, and not so much recovery days to look forward to. I go no bra, but I am shopping soon since the ones I have are just annoying.",
      "MessageIndex": 1344,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 3, 2015 06:15PM Beachbum1023 wrote: Well Ladies I had rads #7 today. It feels like I had too much sun, but after reading everything that could happen to me, I am a little freaked out. I have 28 total, and she said that she will see how the skin looks before deciding on any boosts. Yikes, I'm not too excited about what is coming. But I hope the aloe helps.",
      "MessageIndex": 1374,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 6, 2015 06:22AM Beachbum1023 wrote: Good morning WheelyGirl, my treatment area for rads does go all the way up to include the armpit and shoulder area but it may be because of my Stage IV. This is a one hit wonder treatment plan for me. Or as I call it, go big or go home! It is painless, quick, and the days go by fast. I have #10 today already. I apply 100% clear Aloe Gel after rads, and several times during the evening. I wear soft tees and no bra to promote healing and keep the area clean and dry without pressure. And I still follow healthy eating and consume plain water to hydrate. And a walk does the body and soul good! I hope your rads go fast, and well!",
      "MessageIndex": 1444,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 6, 2015 08:26AM Beachbum1023 wrote: Wheelygirl, I have not bought any bras yet, but I did try sports bras that I have and they worked well. I don't wear a bra now, but I do wear sports top with support so I can use my foob. Right now a bra is annoyting for me.",
      "MessageIndex": 1448,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 7, 2015 09:37PM Beachbum1023 wrote: Wigless here, and not happy! When they made the head form I had to take it off. They said that my head had to be exact for the radiation and the tattoos. Well the radiation is for the boob I no longer have, so what does the head have to do with it?? The second day I left it on, and nobody said anything. Every day since as soon as I give the info, they tell me take it off. I get the fact that they need to line up the tattoos, so they have to see them. But why can't they cover my chest after they line it up? If the rads go all the way through my body, I would think it would make it through a little washed out hospital gown! After going through chemo and surgery I am finding radiation to be a different day. I loved all of my other nurses and techs, but the ones I have for radiation are not on my A list. They have a \"all business\" attitude, and not a warm fuzzy feeling from any of them. They are not so friendly, use Sharpie markers like I am a whiteboard, and never tell me much. I asked them about the dose of radiation, and I was told it pretty complicated but I could ask my RO. And when I asked for information about side effects, I was told we deal with that when it happens. Happens?? Exactly, what happens and when does it happen, and how do you plan on fixing it?? Grrr......I will so glad that I never have to go back there! We do have a very nice lighted 3 panel tropical beach scene on the ceiling to look at, my favorite place!",
      "MessageIndex": 1506,
      "PostDate": "07/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 8, 2015 10:37AM Beachbum1023 wrote: CoyoteNV, the center I go to was my only choice for rads. I was told that I had to go to the same center for chemo and I refused so I went to the CC close to home and I am so glad that I did. It's all new, bright, and windows everywhere. I had a great view for chemo, and the nurses are fantastic. So having to go to the Cancer Center triples my drive each way, and I am not so fond of the people there. I feel a disconnect, just not sure why. I feel like I am just a number moving through my rads there. So I am glad that I won't have to go there often, just for my PET scans, and for follow up with my BS. Everything else I can do close to home at the CC. So I hope I am done after the next 18, and no boost week. I'm not too sure what that will do for me at this stage of the game.",
      "MessageIndex": 1514,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 7, 2015 08:33AM Beachbum1023 wrote: Hi quiggy, I drive myself to rads every day also. But I always stop at one of my favorite stores on the way home. I just walk and look usually but it is my little reward for going another day. It's good for me to have that someday list in my head. Gives me something to look forward to when rads are over.",
      "MessageIndex": 1470,
      "PostDate": "07/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 8, 2015 05:05PM Beachbum1023 wrote: Hi WheelyGirl, Gotta love the side effects right? I have a lot of left overs, and they are now with me forever. I have permanent heart damage from the Adriamycin. I have permanent neuropathy from Taxol. My tumor regrew quickly on Taxol so wondering how big the mets got. I have lost fingernails and toenails. I have lost my hair, eyebrows and eye lashes. I have permanent joint pains, weight gain, dry mouth and bloody noses. My last infusion was 11/25. So the side effects do not go away in a few days, maybe for some people but for sure not me. So far I have completed Rads #10. My armpit is sore, my ribs hurt, and the arm pulls and feels tight. Happy joy. I hope it stays that way. I do not want any more gifts that keep on giving! I hope you do well.",
      "MessageIndex": 1531,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 7, 2015 09:54AM Beachbum1023 wrote: Good afternoon, I am on my back with only my right arm above my head. I hold my wig on my lap with my left arm. Ticks me off they make me take my wig off, humiliating especially when I was allowed to wear it to surgery with a surgical bonnet on! And I have my gown open showing all the scars from surgery. That bothers me more than showing a boob, but whatever just get it done so I can be on my way. I have finished 10 rads, 18 to go. The RO will decide if I do the boost at the end depending on the skin. Grrr....I hope I don't. I am fearful of the damage to my lung and ribs. I already have permanent heart damage from chemo and neuropathy that doesn't seem to quit even though I have meds three times a day for it. The good thing is, they get me off the table asap, and if I am early they take me right away if nobody is back there. I am usually on my before my appointment time. Not sure why, but I think chemo was easier. At least I could see it, I feel like I am fighting a ghost with rads. I just close my eyes for it and \"walk\" the beach in my head........",
      "MessageIndex": 1478,
      "PostDate": "07/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 11, 2015 01:54PM Beachbum1023 wrote: Good evening dacre, We all walk this road, with or without a fork to divide us. We all walk together no matter how we get there. We follow those that have gone this road before us, and we join all the others together to do battle, no matter how we choose to do it. Your post for me is a positive thing. You are here learning, you put your very personal feelings out there for us to read. And at the end of the day we are all the same. We are strong women fighting for our lives and I am OK with any way you get there.",
      "MessageIndex": 1621,
      "PostDate": "11/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 11, 2015 06:40PM Beachbum1023 wrote: Quiggy, thanks and love it! I'm just a country girl, and I know the creeks rise! But we all do the best we can to live our lives with purpose and love. Meet you on the bank!",
      "MessageIndex": 1623,
      "PostDate": "11/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 11, 2015 08:11PM Beachbum1023 wrote: Hi Farmerma, sounds like you have your butt kicking cancer killing boots on! I pass on the bras for now and wear soft tees to rads. I use the 100% Aloe Gel Clear. I put it on 5 to 6 times a day. I finished #13 today, and so far so good. Just a little tan, and my armpit is tender but just a little fatigue. Good Luck, I know the time goes by fast.",
      "MessageIndex": 1625,
      "PostDate": "11/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 10, 2015 02:29PM Beachbum1023 wrote: Gemmafromlondon, I have been told to drink water constantly during chemo, surgery, and now rads. It also keeps my blood pressure up so two fold for me. But it really does help. I drink 4 to 6 bottles per day of water.",
      "MessageIndex": 1589,
      "PostDate": "10/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 10, 2015 09:57PM Beachbum1023 wrote: Windgirl, I just had rads #12 today, and I just let it grow. But my armpit is red, tender, and starting to burn. I deal with it, and they can too! :)",
      "MessageIndex": 1607,
      "PostDate": "10/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 13, 2015 09:58AM Beachbum1023 wrote: Professor50, Congrats! I am very happy for you, just shows us Friday the 13th can be a good thing! Enjoy the weekend knowing that you are done! Happy Valentine's Day! I am off to rads #15, I am heading to the finish line.",
      "MessageIndex": 1657,
      "PostDate": "13/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 16, 2015 07:55AM Beachbum1023 wrote: Good morning Ladies, I am going to rads #16 today. So far so good. It is a little tan, and a little pink in the underarm. The shoulder feels a little tight, but I have been doing my exercises so that is getting better. I use Aloe Gel 100% clear about 5 to 6 times a day. I wear soft tees and a soft zip jacket over it since I don't wear my bra right now. I'm just glad it's cold right now to layer my shirts. My Mom always told me to wear clean underwear, I'm not wearing a bra or my boob! Geez...........",
      "MessageIndex": 1703,
      "PostDate": "16/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 16, 2015 10:18AM Beachbum1023 wrote: Hi Dotwithkitties, I'm #16 today, see above. So far so good. I had a mastectomy, and I can't find any bra that stays in place! Maybe double sided tape will work, but so far tees and loose jackets work. I'll deal with the bra after rads and see what I have next. I won't miss the beach, rafting, or swimming one way or another it will be. Try another style sports bra, I have some that do work. Just a pain to find the right one. I use the Aloe, hydrate 4 to 6 bottles of water a day, and eat well. But sleep is needed to get through rads. I can, you can! It's Game On, and I came to play and win. You got this.",
      "MessageIndex": 1706,
      "PostDate": "16/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 16, 2015 01:39PM Beachbum1023 wrote: mqt64, Thank you so much! I just got home from rads, and it's a little more brown, and turning red under the arm. My shoulder feels a little stiff. My mastectomy scar shed some skin today, but I got it covered with aloe and air. But 16 done. I am so sorry to hear about your nephew, but I am going to pull up my cancer kicking boots up, and go stomping his way!! We will send all of the love and support he needs, and surround his ladies with hope and hugs! Is there anything we can do for him and his family? Have a great evening ladies!",
      "MessageIndex": 1710,
      "PostDate": "16/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 19, 2015 02:31PM Beachbum1023 wrote: Hey Bippy, Congrats on the goodies! I hope you sleep all night! It is -9 here tonight and the windchill is going to -20. I am going to hunker down in a soft furry blanket and try to stay warm! The wind is just brutal coming across the Lake. But I went to rads #18, and a little more tan but the armpit is looking a bit toasty. Spread on the Aquaphor, I hope it helps. I feel like a greased pig......yuk!",
      "MessageIndex": 1754,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 18, 2015 07:56AM Beachbum1023 wrote: Hi Bippy, I am going to rads #16 today, and I would rather not go. My skin feels tight, oh the little sunburn! My armpit looks burned, and my side hurts really bad. Very frustrating to say the least. I had a mastectomy, and I feel like they are trying to cook my ribs. Geez this is not fun. They told me to put clear Aloe Gel on it, uh no. I do but not too sure what it helps. They did give me some samples of Aquaphor but I haven't tried that yet. $80,000 bucks for rads, and I get 4 samples of cream, priceless! Not too sure what will be left by #28. Note to self, don't do this again. Yesterday I missed rads because I was so sick and vomiting. Came up out of the blue, no fever, and I hadn't eaten. It happened right after I got up. I called the nurses and told them what was going on, and they told me to call the PCP. They said I was too far out from chemo, so it probably wasn't that. But my pulse was racing, and I was concerned because of the heart issues that I have from Adriamycin. So I slept the rest of the night, and I feel fine today, other than the rads issues. I know rads can cause nausea, but have you had any problem with it? ",
      "MessageIndex": 1730,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 20, 2015 09:52AM Beachbum1023 wrote: Thanks Professor, I am right behind you! I have 10 to go. I have nothing to match :) but I hope it is uneventful for me as well. Stay Warm!",
      "MessageIndex": 1783,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 19, 2015 07:24PM Beachbum1023 wrote: Good evening Ladies, what a group! We got this. I finished #18, and it is looking good for now. My chest is tanned and my armpit is a little red. The shoulder is a little stiff, but I am back to doing my exercises. So I hope it keeps going well. I put the Aloe gel on before I leave rads, and then I keep putting it on during the evening. I put Aquaphor on when I go to bed. Greasy but if it works, I'm all good with it. In the morning its a shower and Aloe, and then I put it on again after rads. Have a comfortable evening!",
      "MessageIndex": 1760,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 20, 2015 09:21AM Beachbum1023 wrote: Gemmafromlondon, Congratulations from Ohio! I hope your rads will be your big thing! And good luck with choosing the next step. It is a game changer for sure, but Game On! I am limited for treatment since I am triple negative, and my choices are sounding like a choice between yikes and sucks. So I will find out after I complete rads and see what I can roll the dice at. Have a great weekend, I hope you find your peace and balance.",
      "MessageIndex": 1780,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 23, 2015 04:39PM Beachbum1023 wrote: ThinkingPositive, thanks, had the MO been a little more patient and understanding, I would have pushed for another way but she had ONE plan. And it failed miserably. I was supposed to have immediate reconstruction but the PS had to rearrange the skin around because the incision was a mess, so that failed too. They want it to heal first and then I'll see what to do. Perhaps flat is where its at! I'm just not too sure I want the hassle and aggravation of all that at my age. And since my heart EF is below 50% that is a bit scary as well. This whole disease stinks, I feel like I am going to be using duck tape to piece myself together by the end..............",
      "MessageIndex": 1861,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 23, 2015 08:04PM Beachbum1023 wrote: Hi zjrosenthal, I am doing rads now, finished #20. How are you doing after surgery? The armpit is pretty tender, I hope you are feeling ok.",
      "MessageIndex": 1871,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 24, 2015 08:10AM Beachbum1023 wrote: Hi Jean, I finished chemo/Taxol, and 19 days later I went for my mastectomy. I started rads on 1/22. They wanted me to heal a bit before rads, and they were too busy to schedule any sooner at rads. Sad they can't get enough people scheduled because there are more people for rads than they have time for.....:(",
      "MessageIndex": 1886,
      "PostDate": "24/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 24, 2015 08:56PM Beachbum1023 wrote: Did you try telling them that cancer is NOT necessary? WTH! Sorry they are dumping on more frustration.",
      "MessageIndex": 1906,
      "PostDate": "24/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 24, 2015 04:01PM Beachbum1023 wrote: Dotwithkitties, I finished #20 today and my armpit is very tight. It's the rads from what my RO said today. She told me to go back to my mastectomy exercises to keep it loose. I massage Aloe Gel 100% clear every night into my armpit and on the incisions. Aquaphor will work also but it is pretty greasy. I wear tees over it.",
      "MessageIndex": 1897,
      "PostDate": "24/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 28, 2015 12:48PM Beachbum1023 wrote: Hi Quiggy, 6 more to go? I have 4 more. We are almost done! I'm pretty tired today, but getting those cancer killing butt kicking boots all ready to go for Monday. We are so close. We just have to suck it up a little longer :)",
      "MessageIndex": 2007,
      "PostDate": "28/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 28, 2015 01:03PM Beachbum1023 wrote: Quiggy, a smiley face! We got this, even if it does suck, just because we are so worth it! I just put some more Aloe on, and I'm going to push through it. Kicking and screaming, but still doing it.",
      "MessageIndex": 2010,
      "PostDate": "28/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 2, 2015 02:24PM Beachbum1023 wrote: Hi Ladies, I hope everyone is doing well. I have 3 more rads then done. Still dealing with the itchy on the chest, and the armpit is pretty dark brown/red and a little tender. I have a rash on the back of my shoulder, a little tan but not too bad, just itching. So I hope I make it past the next three intact. Uh maybe on the that! Keep going Ladies, you got this!",
      "MessageIndex": 2083,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 3, 2015 08:47PM Beachbum1023 wrote: Hey Quiggy, thanks for the toast! I am sucking down a pitcher of Margaritas, cheers is right!",
      "MessageIndex": 2130,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 5, 2015 02:43PM Beachbum1023 wrote: Quiggy - Thank You! I thought I was losing my mind last night, the pain was unreal. All I could do is fan it with cool air, and slather on more Aquaphor. My RO thinks that Aquaphor is like a miracle in a tube. So far all it has done is destroy my new sheets and my clothes. WTH? I think Vaseline would do the same, nothing! I begged for meds, and nothing! So I can break into my codeine tonight, I keep a stash from the other side effects. I swear the pain gremlins were shredding my armpit with a grater. Hard to deal with especially since my armpit is all over now. Some on the arm, some in the pit, some on my side, where do I shave?? Now I have boosts, right on the scars, and it is all over. They laid out a circle for the boost, almost the size of a grapefruit. Makes me wonder how the scars are going to hold up. I asked my tech today where he was recruited from to work there, death row?? He said Taliban, and we laughed like crazy. Hating this.",
      "MessageIndex": 2167,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 5, 2015 07:32PM Beachbum1023 wrote: chtease - congrats are in order for such a huge milestone! 12 tonight, 12 tomorrow, you get it just repeat! Be safe.",
      "MessageIndex": 2181,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 7, 2015 10:22AM Beachbum1023 wrote: mysunshine, I can't help you with that one, but have you tried any of the other threads to see what you can find there? Maybe look at the recon or implant thread. Good Luck!",
      "MessageIndex": 2219,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 2, 2015 06:59PM Beachbum1023 wrote: Quiggy, I am doing a double happy dance. I have 3 more to go, and you did it for you! Doesn't get any better than that.",
      "MessageIndex": 2095,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 4, 2015 09:42AM Beachbum1023 wrote: Hi WheelyGirl, some deodorants have aluminum in them. Bad mix with rads. I use Aloe after. But I am so thankful it is winter :)",
      "MessageIndex": 2144,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 7, 2015 01:10PM Beachbum1023 wrote: Wheelygirl, I had asked about drinking, and I was told that I could have two. So I opted for a bottle of white, and a bottle of red! That's 2! My markings stay on pretty well, but they made a template in case anything does wear off. They just touch them up from time to time.",
      "MessageIndex": 2222,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 12, 2015 08:39AM Beachbum1023 wrote: Good morning rads Ladies, I FINISHED ALL OF MY RADS THIS MORNING!! Chevy please add my smiley face to the roll call list. For everyone about to finish, I'm waiting for you at the finish line! It's doable, but if you need a little push, let me know, nobody walks alone here! I hope everyone has a great weekend!",
      "MessageIndex": 2330,
      "PostDate": "12/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 13, 2015 09:23PM Beachbum1023 wrote: Farmerma, My bills are piling up, and I don't care so much. I worked out a plan for the collection agency to combine all of the accounts together, and I pay them $50 per month. That's it and no more. That is really what I can afford. I am 58, live alone, and no job thanks to BC. So I take care of my credit account, rent, car payment etc., and it will just have to be good enough. Or like I tell them I have Stage IV cancer, would zero be better?? They always take what I can pay. I really hate to be like that, but I don't have many options at this point. I owe over $12,000 just to the Cleveland Clinic and the others. I can be depressed about it, or do the best I can. My rads are healing up pretty good, lots of Aquaphor, RadiaGels, and soft pads to keep it from rubbing. Hopefully this will be a bad memory soon.",
      "MessageIndex": 2366,
      "PostDate": "13/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 23, 2015 10:28PM Beachbum1023 wrote: Jean - I always had 3 techs, and 1 nurse.",
      "MessageIndex": 2532,
      "PostDate": "23/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 9, 2015 10:33AM Beachbum1023 wrote: Farmerma, I am doing my happy dance! I hope one we can all meet and take the bells down...............Have a merry magical evening! Cheryl",
      "MessageIndex": 2723,
      "PostDate": "09/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 9, 2015 10:38AM Beachbum1023 wrote: Hi Kayfry, I agree that getting back to life is difficult! I have always worked and have been very active. I would walk 11,000 steps per day, and now I struggle to make half of that. But day by day, I hope we find our old life, with a new twist. Good Luck, Cheryl",
      "MessageIndex": 2724,
      "PostDate": "09/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 10, 2015 01:23PM Beachbum1023 wrote: Coyote, your life sounds happy, peaceful, and serene. And nothing beats shoveling manure, and brushing a horse. I love the feel of the big noses, and listening to the snickers and crunching of apples and carrots. That's real medicine in my book. I miss my Walker, he was quite a ride. Your studio sounds so colorful and bright, true joy and a labor of love and satisfaction. Have a magical and colorful weekend! Cheryl",
      "MessageIndex": 2747,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 26, 2015 10:45PM Beachbum1023 wrote: Wow what a week! Congratulations Ladies lots of finishers this week. Next week should rock as well. I haven't seen so many happy posts in one place for a while. You are going to wear out Coyote from smiling so much as she updates the list. I hope you all heal soon, and move on!",
      "MessageIndex": 2590,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 5, 2015 08:58PM Beachbum1023 wrote: Good evening Ladies, When I finished my chemo I was presented with a Graduation Certificate and I got to ring the bell. I rang it as hard as I could. I wanted everyone in the building to know that I did it! And my chemo nurses gave me a stuffed Everready bunny, because we keep going, and going, and going! Not for everyone, but I worked oh so hard to reach that day, and I was going for it. Then I ran, as far and as fast as I could.......and stopped at the liquor store on the way home! I deserved that too! Have a great night!",
      "MessageIndex": 740,
      "PostDate": "05/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 6, 2015 09:57PM Beachbum1023 wrote: Good evening, Maybe I am old and old fashioned too, but I now have 14 Doctors! I have one for every part that has an issue it seems. I wanted to know my Vitamin D level, and I was told to schedule an appointment to see my GP for that. Ok another Cha Ching in the cash drawer. Then I have heart damage induced by the chemo, Cha Ching off to the Cardiologist. I have a port, big Cha Ching off to the surgery center and the Vascular Surgeon. Then the port surgery was draining so my Oncologist sent me to the ER, and another big Cha Ching for the cash drawer. The ER Doctors did not resolve the issue, so off to the Vascular Surgeon again, and more bills. I had a mastectomy and had blood pressure issues after the surgery so that was 4 days admitted to the hospital. 4 days, I was scheduled as a 23 hour stay. I'm glad I had someone available to feed my fish. So now I have a bigger pile of bills. I have numb feet and hands so I was sent to a Neurologist for arthritis. Really? Maybe neuropathy from Taxol?? So I needed another Doctor to see me and tell me that it was from chemo. Shouldn't my Oncologist know that?? I also have a new Eye Doctor hopefully to correct my blurry vision. Still working on that one. My breast surgeon is shipping me off to the RO on Friday. Cha Ching another big day for the cash drawer. Along the way I acquired a second Cardiologist because my first Cardiologist did not have privileges at the hospital when I was admitted. I also found myself in X-Ray for my feet. The bone pain from the Taxol and Neulasta was unbelievable. It was so bad they thought that I had a broken foot. Report came back degenerative joints, so off to Ortho for a really snazzy moon boot. At least my toenails felt better, it had open toes. At this point, the only person in the building I haven't met is the Janitor!! Now after all that, I see the new RO on Friday. Sorry my rant went a tad long......My question is why do we need t-shirts etc. for rads? What do I really need for rads? How were the side effects, and when do they appear? Thanks Ladies",
      "MessageIndex": 766,
      "PostDate": "06/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 1, 2015 10:57AM Beachbum1023 wrote: Farmerma, I love your dog! He reminds me of Miss Molly, a very lovable and loyal lab that I loved. She was black also, and always knew when to buddy up. I really miss her. We were beach buddies, and when my friend decided to move on, she went with him. I miss her way more than I miss him. Dang dog napper! Dogs seem to know what we need sometimes, more than we do. He will get you through. I am so glad that you are almost done! I hope the boosts are quick. I had zero issues from the boosts, and the skin is looking really good. I am out of rads three weeks on Thursday. You got this!",
      "MessageIndex": 2647,
      "PostDate": "01/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 7, 2015 09:35AM Beachbum1023 wrote: Good Afternoon Birdgirl11, Thanks for all the info and tips. I appreciate it. I see the RO on Friday, but the rads may be refused at this time to start chemo, again! The MO is concerned about the mets in my abdomen and wants to start soon since the Taxol response wasn't good, and the breast tumor grew back and fast. The mets are very small and the MO wants to get them now before they start growing. So one thing to prevent the original breast tumor from coming back, but another to shrink the mets. Another round of run, worry, and wait and see. So I hope to have a better plan in place on Friday. I'll see how long that plan works.......geez it's exhausting! For everyone in the polar vortex freeze - stay warm. For everyone on a nice warm sunny beach - please invite us! The wind chill here is -15.",
      "MessageIndex": 781,
      "PostDate": "07/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 3, 2015 11:51AM Beachbum1023 wrote: Kayfry, even if the skin does peel, mine washed off in the shower, so no issue, and it doesn't itch. Bonus! And the new skin fits right in so I hope the rest of the healing goes as well. I just keep slathering on the body cream, and at this point it is something that smells great like vanilla or lavender. No more medical potions! I always thought that my boobs were pretty small until I had one, it's a giant and hard to dress. I think if it tries to kill me, she is a gonna go. I should have done it the same day...........hindsight.",
      "MessageIndex": 2688,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 10, 2015 10:31AM Beachbum1023 wrote: Yikes1 - Have a Magical weekend! Congrats on this milestone.",
      "MessageIndex": 853,
      "PostDate": "10/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jun 3, 2015 05:42PM Beachbum1023 wrote: Hello wonderful ladies! I wanted to check in and see how everyone is doing. For those of us moving out to no treatment, enjoy the break. I see many who are still dealing with issues left from the winter. I hope they all resolve soon. But I do see lots of recon coming as well. I had a failed immediate recon then rads, so I am thinking that it stops here. I've read a lot, but with the way they had to remove the tumor and close the mastectomy, I don't have much to work with. And all of the time off and recovery, I just don't see it for me. I want to finish healing, and lose the chemo weight I gained and get stronger. But I go back to work on Monday at my new job, so I think I want to focus on work, and finding me. And I want a summer to hit the beach, last year was spent at the Clinic for me. Then I'll think about doing recon, or not. But right now I am pretty happy not being a patient, and dealing with more physical issues. My head is in the game with one, and other than sorting out my clothes that don't work with my sexy sports bras, I'm ok with it.  Take Care everyone, I hope you are well. Cheryl  ",
      "MessageIndex": 2970,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jun 14, 2015 10:04AM Beachbum1023 wrote: WndrWoman, I am going to LiveStrong now at my local Y and I love it! I just got back from spin cycle and rode 14.0 miles on the recumbent spin cycle. I have knee issues so this works well for me. I am getting in shape, but losing weight, sadly not so much! Not sure why I can't drop pounds, but I have a appointment to see my PCP in a few weeks. I am exercising like crazy, and step counting, eating great, and still the fat stays. Just getting frustrated. Since I am tall, everyone tries to discourage me from losing pounds, but I gained 25 pounds during treatment and my clothes won't fit. I hope you enjoy LiveStrong, it is really a great program! Cheryl",
      "MessageIndex": 3006,
      "PostDate": "14/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 13, 2015 02:28PM Beachbum1023 wrote: Viceroy, Happy Dance for you! And a bottomless basket of hugs, use as needed. Cheryl",
      "MessageIndex": 2773,
      "PostDate": "13/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 19, 2015 07:51AM Beachbum1023 wrote: Good morning everyone! You all sound very positive, with the A plan, and a B plan! I just want to get going and get it done. I already battle the fatigue from chemo and surgery, so I hope to make it through. And I am looking forward to completing this and getting my certificate. When I \"graduated from chemo\" the nurses gave me my signed certificate, and we could ring the bell as hard and as long as we wanted. I wanted to rip it off the wall at that point :), but I rang it with all the muscle I had left. And it felt so good to hug all my nurses, and smile all the way out the door to my car!! I felt so free to move on. One day at a time.......",
      "MessageIndex": 1025,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Sep 26, 2015 09:41AM Beachbum1023 wrote: I finished LiveStrong in July, and loved it! And lost 10 pounds. Have fun!",
      "MessageIndex": 3195,
      "PostDate": "26/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jun 15, 2015 10:45PM Beachbum1023 wrote: Quiggy, I am so happy for you! Let the healing both mentally and physically begin. You deserve peace and comfort after all this. Take care and repair, Cheryl",
      "MessageIndex": 3013,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 2, 2015 08:41AM Beachbum1023 wrote: Good morning, I had a mastectomy and I am a little nervous about the rads since the breast is gone. I have 28 with 5 boosts. They use a bolus every other day to act like skin, but there isn't much left. I just hope the lung and ribs survive the rads. Today is #6, so a long way to go yet. I'll keep you posted.",
      "MessageIndex": 1331,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 3, 2015 09:09AM Beachbum1023 wrote: labelle, I hope you have a speedy recovery. I am going to rads #7 today for the right side with a mastectomy done 12/15. I worry about the possible damage to my skin and ribs and lung. Very scary, but I'll push through it. My RO wants us to use 100% Aloe gel, so far so good. I do not wear a bra, I am waiting to get new bras after rads. Since I live in Ohio, multiple layers hides my lopsided chest for now. So I hope to heal and figure out how to dress for swimming and summer clothes.",
      "MessageIndex": 1358,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jun 30, 2015 11:09AM Beachbum1023 wrote: Hey Ladies, we are never done from what I can tell. I still have to go monthly for port flushes, nice chemo reminder. Yuck. But nice to see my nurses. And the scans start again after Labor Day, oh joy. When I finished my DD AC/T they gave me a stuffed Energizer bunny, now I know why.............on and on and on we go just like the dang pink rabbit! It would be so nice to just stop it all for good and move on, but the thought of being adrift in cancerland is pretty scary too. Oh this must be the \"new normal\" I keep hearing about. It sucks, nothing \"normal\" about any of this crap. Hang in there ladies! Good thing I still have my butt kicking cancer killing boots to stomp on with.............Cheryl",
      "MessageIndex": 3110,
      "PostDate": "30/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 4, 2015 01:46PM Beachbum1023 wrote: Congrats InGodshands, big day for you!! I have 20 to go, so I'll be right behind you, thank you for showing us the way!",
      "MessageIndex": 1393,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 4, 2015 06:45PM Beachbum1023 wrote: Hey Bippy, Congrats for 13! You are headed to the finish line! I get it, there isn't anything pretty about pink, it makes me ill.",
      "MessageIndex": 1403,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 5, 2015 07:59PM Beachbum1023 wrote: Good evening Ladies, I finished rads #9 today, I have some tight feelings under my arm, and the skin feels warm. It feels a little like a sunburn right now. I put the aloe gel on but that doesn't seem to do much yet. I just hope it stays this way!",
      "MessageIndex": 1442,
      "PostDate": "05/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 6, 2015 02:22PM Beachbum1023 wrote: Hi Kayfry, I started rads on 1/26 and so far so good. Super quick, and no issues yet. The skin looks a little tan, but I put 100% aloe gel on it, and the techs and nurses said it looks good so far. They said to pat the gel on and let it dry, do not rub the skin. Wear larger loose soft shirts and no bra if possible. Take warm not hot showers, and do not rub the wet skin. I have 28 treatments, 18 to go. The RO said she would evaluate my skin and tolerance before she decides on the boost. I will keep you posted.",
      "MessageIndex": 1454,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 8, 2015 03:58PM Beachbum1023 wrote: Hi Just Jean, you actually have clothes in the washer?? I have piles, just piles, white piles, dark piles, just waiting for me to get off the couch. I hate fatigue! I do not get many answers from the CC either. I was told that radiation dosage is very complicated. It is, that is why I was asking questions. I also inquired about side effects, and they blew me off with \"we deal with them if they happen\". Deal with what? When would it happen? Fix it how? I am very frustrated, and I will be so glad to see the last day come. I hope you heal up soon!!",
      "MessageIndex": 1524,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 10, 2015 08:44AM Beachbum1023 wrote: Quiggy, I wish they made that in a body spray size! Everything I have hurts today, and rads this afternoon! Have a nice evening.",
      "MessageIndex": 1585,
      "PostDate": "10/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 14, 2015 07:15AM Beachbum1023 wrote: Redhead01, I finished rads #15 yesterday. So far so good. I have a little red under my arm, but looks tan everywhere else. I put the 100% Aloe Gel on it as soon as I am done, and 4 more times daily. I feel a little sunburned today on my chest. But that's it so far. I always wear an old soft tee shirt to rads and no bra. So with 13 more, I'll keep doing that until something changes. Good Luck!",
      "MessageIndex": 1673,
      "PostDate": "14/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 18, 2015 08:43AM Beachbum1023 wrote: Hey Bippy, I get the no med thing! I had to beg for Tylenol #3 with codeine for bone pain with Taxol and Neulasta. They don't want me to get addicted. Really?? I have Stage IV, it's not going to get better. But we suffer enough and they need to make sure we don't suffer for no reason. I do not understand the fight to get meds. It's not like we get them on the corner, but we will if we have to. I told the MO to write it or I would get what I needed to live. This is all about QUALITY OF LIFE right? It is such a downer to my mood and well being when I hurt so bad that opening my eyes hurts. I do hope you can get what you need!! As we should!",
      "MessageIndex": 1732,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 20, 2015 06:58PM Beachbum1023 wrote: Hello Rads Ladies, I finished #19 today! I have 28 total to do. My skin looks tanned/pinker today. My armpit is sore, but looks dark tan and red. It is the worst, go figure, I have breast cancer but my armpit is fried?? I know they are going for the nodes but one would think the breast area would look worse than the armpit. But my rib cage hurts as well. I feel like I got punched in the ribs. And since the breast and the nodes are gone it's just frustrating. I slather on the Aloe, and switch to Aquaphor at night. I am just so glad to be on the downhill slide right now. I hope everyone is doing well, and have a great weekend!",
      "MessageIndex": 1804,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 20, 2015 11:46PM Beachbum1023 wrote: Hi Leslie, 5 done is a good start! My RO told me to try to get as much air as possible on the radiation area. I wear loose tops or a light summer shirt when I can. The Aloe Gel during the day seems to help, and Aquaphor while greasy does the most overnight. I finished #19. I have 28 total. She hasn't decided on the boost yet. But drinking water helps too. Stress is tricky, because it is coming from all directions, and different sources. It's hard to reduce it. But I try to do something every day just for me. With the travel time, maybe you can look through a book or magazine, or perhaps try to relax. I am going to try to make some jewelry this weekend. Maybe your Son knows how to clean and do laundry?? I do hope he helps you, you need some rest. Try not to over do it this weekend, you have a ways to go! Take Care.",
      "MessageIndex": 1812,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 25, 2015 05:57PM Beachbum1023 wrote: Good evening ladies - finished #23 rads today. My chest has a rash with tiny red bumps, itchy and annoying. My armpit is pretty dark red, but I keep clothes off it for air and it seems to help. The rest of the area is just tanned so far. My ribs ache a bit on the side. But it feels like a sunburn so far. I slather on the 100% clear Aloe Gel and Aquaphor at night and keep it uncovered so it seems to help. Clothing makes it all itch. Go figure it is below zero, not a good time for a tube top!! But soon this will all stop, forever! Keep going, it's Game On!",
      "MessageIndex": 1927,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 4, 2015 07:27PM Beachbum1023 wrote: Welcome! Attitude is everything, and you are on it! Positive and moving on, I hope to move on soon also. I see the RO on 1/9, the sooner in, the sooner out! Lots of great info here, and very helpful. Good Luck!",
      "MessageIndex": 714,
      "PostDate": "04/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 2, 2015 08:31PM Beachbum1023 wrote: LARock - I think you may be on to something with all of us being treatment survivors! I think the song said something about what doesn't kill us makes us stronger, we should be able to move mountains!",
      "MessageIndex": 2102,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 3, 2015 05:40PM Beachbum1023 wrote: Ok Ladies I need a lifeline - I thought I was going to be done with 28 rads on Thursday, but the RO today added 5 boosts to the tumor bed because my skin is looking so good. Define good please! I look like a hot mess rash on my chest and the back of my shoulder. My scar is turning dark red and all puffy and puckered, and the armpit will probably peel off tomorrow. I do not want to know what bad looks like. My arm is very tight also so I have to slowly exercise it to gain range of motion. 7 more to go. Grrr........hating this. On the plus side, I can drink since I am done with chemo. :) I'm pretty sure the RO said I could drink, oh maybe she meant water. Too Late!",
      "MessageIndex": 2121,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 20, 2015 10:16PM Beachbum1023 wrote: Hi JustJean, Hey neighbor! More snow on the way, but on the West side winter has been so easy compared to last year's polar vortex. Great news on the quilt, it is beautiful. And the end of rads, a good day for sure. I hope you get some good news from the MO. I saw my Neurologist today to figure out what to do with my peripheral neuropathy, thank you Taxol! So more meds, three times a day. Nice I can mix them in with my heart meds, thank you Adriamycin. And all the supplements, to grow hair, fix nails, and increase my Vitamin D. Drug Mart loves me, a frequent flyer there with all the meds. I start rads next week and my Oncologist wants me back in chemo, thank you Stage IV. I get it. And I forgot to get the Aloe Gel for rads, so back to Drug Mart!! Oh geez, this is exhausting...... Where is the quilt show?",
      "MessageIndex": 1050,
      "PostDate": "20/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 12, 2015 11:18PM Beachbum1023 wrote: Thank You, Thank You, Thank You, Thank You, yep can't Thank everyone enough! Finishing rads is so sweet. Now just waiting for the \"sunburn\" to heal. Is that what they told you too?? Some \"sunburn\". Yikes. I did get a very sweet reward tonight, I can see the shore lights from Canada, Cedar Point, and the Islands. Spring is really happening when I can see that. Now just waiting for the ice and snow to melt.............it's been a long winter! I see flip flops!",
      "MessageIndex": 2343,
      "PostDate": "12/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 29, 2015 08:37AM Beachbum1023 wrote: Hi bippy625, I was scheduled for mastectomy and reconstruction but it couldn't be done after the mastectomy. The tumor had attached to the skin, so the PS had to rearrange the skin so I have to heal before any reconstruction. Big surprise when I woke up, but it was so numb I couldn't feel it. But now at this stage of the game, I am not so sure I want to do. It is a large time and money investment to get through it, so I think I am going to pass. But I am 58, so that plays into it also. I am going to rads #4 today, nothing yet! Has anyone had a sore throat? The nurse said it can happen. And anyone with lung issues? Thanks!",
      "MessageIndex": 1215,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 30, 2015 04:49PM Beachbum1023 wrote: I was told to not drink during chemo, but nothing was said about it during rads. Cheers, until I hear something.",
      "MessageIndex": 1249,
      "PostDate": "30/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 30, 2015 08:57PM Beachbum1023 wrote: Good evening mqt64, I have 28 plus 5 boosts, how many are you doing? Today was fine, I just feel sore more to the side than the breast area. Hopefully it will stay that way. I have Aloe Gel that my RO wants us to use. I asked her if she wanted me to use Aquaphor and she said that if I needed it later she would give it to me. They have a ton of samples. After all the bills for the treatment, I will take anything free at this point. I am anxious to get past this rads treatment, and see where I am. I am hoping to avoid a new chemo until late summer or into fall. I am sick of being stuck inside, and I want to enjoy the good weather. I hope everyone has a great weekend!!",
      "MessageIndex": 1257,
      "PostDate": "30/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 31, 2015 02:40PM Beachbum1023 wrote: JustJean, I hope something works for you. I have 100% Aloe Gel, I found it at Drug Mart and it was pretty cheap for the bottle I bought. I went big, I sure I hope I don't use it all! Geez this is creepy. Makes chemo sound easy, rads seem to sneak up on us. And it does keep on giving WTH!",
      "MessageIndex": 1286,
      "PostDate": "31/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 17, 2015 09:17PM Beachbum1023 wrote: WheelyGirl, Congratulations, I am dancing as fast as I can! Have a great weekend! Cheryl",
      "MessageIndex": 2805,
      "PostDate": "17/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 19, 2015 07:11PM Beachbum1023 wrote: Coyote, I am so sorry about your special furry friend. Our pets are all truly family and very dear to us all. Good news on cancer clear!! I am so very happy for you. That is the brass ring we all want and need. You got it! I do hope they can resolve the kidney disease and make it easy for you. You have done so much for all us, we are all here for you, we got your back! Take Care, Cheryl",
      "MessageIndex": 2923,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jun 14, 2015 10:26PM Beachbum1023 wrote: My local YMCA offers LiveStrong for 12 weeks free. It is excellent, and I am loving it. Look online at your local Y and see if they offer it. Our local cancer center also offers many programs for exercise and yoga free as well. Good Luck!",
      "MessageIndex": 3010,
      "PostDate": "14/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jul 4, 2015 06:45AM Beachbum1023 wrote: Hi Jean, thanks for the tip on the cream, I hope that helps. Some vaccine huh? Let's hope we stay well! Cheryl",
      "MessageIndex": 3120,
      "PostDate": "04/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 10, 2015 02:26PM Beachbum1023 wrote: Hi Linda, my pain comes and goes, but I also have lower back pain that I have had for years, so that doesn't help. I can usually get by with exercise and walking with OTC for the nagging pain. But I do have Tylenol #3 with codeine that I use if the joint pain gets me. I hate to take any meds, go figure with BC huh? I am guessing it shall just spiral from here on out. But I will not deal with pain, and I will take care of it if it gets bad. Cheryl",
      "MessageIndex": 8,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830301",
      "Title": "What level of pain is acceptable? LindaE54 stellaratovsky"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 18, 2015 01:36PM Beachbum1023 wrote: Hi Ladies, I guess I decided that I couldn't really live with it well, \"it\" was going to have to learn to live with me!! My terms. So far, so good. But it is a lot to deal with from the go. All the decisions, and treatments pretty much sucked up all of my brain cells. So now that I have it under control, I am going for it. I joined LiveStrong, went to aerobics this morning, and then went to walk the beach. I am also hoping I get hired for a new position, and have a more scheduled existence. Moving forward one step at a time!  Yes it does get easier, but it takes some doing to get there. This is a marathon, not a race to the finish, and I am in it to win it for a long time. And you will too!",
      "MessageIndex": 11,
      "PostDate": "18/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831548",
      "Title": "Does it ever get easier? terrij152 slepeint"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 25, 2015 12:37PM Beachbum1023 wrote: Shawna, I am so sorry that you have lost your beloved Mother. I hope you find comfort knowing she has her wings and peace for eternity. Cheryl",
      "MessageIndex": 4,
      "PostDate": "25/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832031",
      "Title": "My Mother and hero shawna41653 Shutterbug73"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 12, 2015 03:46AM Beachbum1023 wrote: Good evening Vegas Nurse, welcome to the club! I am Stage IV, triple negative, and mets. I have nothing but bad luck, so no betting Vegas for me! But it is what it is. So how are you feeling, and how is your treatment plan going? I have done chemo, surgery, and now rads. I hope to have a break soon. Visit us often you will find a lot of support here.",
      "MessageIndex": 634,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 8, 2015 07:52AM Beachbum1023 wrote: Good Morning Everyone, I am also Stage IV and I made it through chemo and my mastectomy pretty well considering. But I do have some questions that someone may be able to answer. I have several nodules in my lung and I also have mets in my abdominal lymph nodes. Does anyone else have this, and what is the treatment for this. My BS wants me to go for radiation as a preventative measure, but the MO wants to go to chemo again. So I am not sure of the benefits trying to prevent the breast cancer coming back in the breast area, or attacking the nodules and mets in the abdomen. I am concerned because I have permanent heart damage from the AC, and the Taxol regrew the original tumor. The tumor had shrunk almost 60% on AC, but 40% regrew in 6 weeks. So very scary, and I am triple negative also. So looking for \"big guns\" to take this on. Going back to chemo is annoying at this stage of the game. I wanted to move forward, but I feel like I am chasing a greased pig at the county fair! I have a hard time making a decision because I feel I don't have enough info to do so. But most of that comes from knowing what I have already learned from AC/T. Thank You! I hope everyone is staying warm, it's a low of 15 today! Go Bucks!",
      "MessageIndex": 619,
      "PostDate": "08/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 23, 2015 04:49PM Beachbum1023 wrote: Hi josalive, Welcome! You will find that nobody is alone here, we all walk together. Ask any questions that you may have, you will have a lot of support here. And it is nice to be with all of us who get it, and you can spend the time with your kids as carefree as possible. I find it a comfort to visit here often, and keep my home life separate from BC as much as I can. How old are your kids?",
      "MessageIndex": 640,
      "PostDate": "23/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 23, 2015 08:34PM Beachbum1023 wrote: Hi All, please count me in!! If enough of us sign in they may do some research and find us a cure! I'm triple negative also. Thanks!",
      "MessageIndex": 628,
      "PostDate": "23/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 12, 2015 04:13PM Beachbum1023 wrote: JustJean, welcome to our little club! Sorry after all the things you have been through, you are now here. I hope that we all stay here for a long time :) Cheryl",
      "MessageIndex": 648,
      "PostDate": "12/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 18, 2015 03:07PM Beachbum1023 wrote: Hi Alice, if the Doctor does not respond, call another oncologist. Did her PCP recommend anyone? Try and call the PCP and see who they work with. I had almost 5 weeks from my biopsy until I started chemo and I have invasive cancer. I had AC/T and finished it 11/25. I had surgery, and just finished rads. My MO appointment is next week. You could also try calling the ACS and see if they can help. They have a lot of resources available. Do you have a cancer or breast center close by? Are you in the US? What tests has your Mom had? I will say one thing, this can be a very slippery slope to navigate sometimes. Write down everything, and save every report. I have multiple binders from all of the info I have from the last 10 months. I think it is time to be pro active, and get someone on your side and have a team in place. You will feel better when you have a team and treatment in place. Good Luck!!",
      "MessageIndex": 5,
      "PostDate": "18/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/829656",
      "Title": "Angry at doctors! Will not call back. Need Chemo ASAP! aliceisalive NATSGSG"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 4, 2015 06:54PM Beachbum1023 wrote: Hi JustJean, I don't know how to unblock. Maybe ask the mods.",
      "MessageIndex": 1405,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 8, 2015 04:49PM Beachbum1023 wrote: Hi Yikes, just because the CC has a reputation known around the world over, doesn't always mean that everything is right. I have to remove my wig for rads, upsetting at best. I have to lay exposed for rads, no covering on my boobless chest scars and all showing. It is disturbing because anyone that walks down the hall can see the monitor. I have asked for the radiation dose, and I was told it was complicated. I asked about side effects and they told me they would deal with it if it came up. What comes up? How do they plan on fixing it? I'm just very frustrated, and I can't wait to be done. Sadly I have 18 more days to go, and then she will decide how the skin looks if she is going to add 5 boost. I had a modified radical mastectomy with clear margins and I am Stage IV. Ain't no 5. Just what might come back? Being triple negative, and I cannot have AC/T ever again, my treatment options are limited. I am more concerned with living than fearful of it coming back. So back to rads tomorrow.....",
      "MessageIndex": 1528,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 12, 2015 10:06AM Beachbum1023 wrote: I am leaving shortly for rads #14, no throat or voice issues. But I will let you all know. I hope you feel better!",
      "MessageIndex": 1633,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 12, 2015 10:19AM Beachbum1023 wrote: CassieCat, just go for it! I slather on Aloe Gel 100% Clear after rads. I drink a bottle water on the way. I wear an old tee shirt and no bra. Glad it is winter it covers my one boob :) I haven't had any problem with the markers, I have very few marks, and 4 tattoos. I am going to #14 and only a little sunburn feel. Today I am half way done. So I am excited to go tomorrow, I am all down hill from here..... Pull up those cancer killing boots and go rock it! You got it!",
      "MessageIndex": 1636,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 20, 2015 08:30AM Beachbum1023 wrote: Allmodestyisgone, Modesty what is that?? LOL We all have that problem, I just ignore it anymore. I believe that Canadian protocol is more radiation per visit, so less visits. That would be a question for the rads techs or your RO. I have 28 rads, then the RO will see if the skin can take the 5 boosts at the end. I hope to be done at the 28, but I don't want the tumor to come back either. So I'll see what happens. Drink a lot of water it helps to keep the skin hydrated. And here in the US I use 100% clear Aloe Gel 5 times a day, and I use Aquaphor at night. Have they told you what to use yet? So when is the wedding?? That is really something fun to look forward to this Spring.",
      "MessageIndex": 1777,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 23, 2015 04:06PM Beachbum1023 wrote: Thinking Positive, I had a mastectomy 12/15 and started rads 1/26. But I'm Stage IV. So pretty black and white for me I guess. I have 28 by script, and then she will see how my skin is holding up before she decides if I need to do the boost. But I don't have much left to boost. I do have a bolus every other day. But my armpit is starting to turn dark red/brown and I have a rash on my chest that is so itchy, like poison ivy itchy! Annoying if anything touches it. I guess a lot of things would play into the decision like your age, reconstruction, work/home life, stage, grade, etc. But they did tell me that if I refused to do it, the window would close and I go on to chemo again. Not sure why, but I was going to do it anyways. Living and doing rads was a pretty easy choice for me. I am more concerned about the heart damage from Adriamycin than going to rads. And yes breathing and coughing is a side effect of heart damage. So meds and a new ECHO every 3 months for life for me. Not too sure if I hate the disease or the side effects more!",
      "MessageIndex": 1856,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 23, 2015 06:30PM Beachbum1023 wrote: Bippy, Congrats! I hope you are going to party like a rock star! Annie, put those cancer killing butt kicking boots on and keep stompin' 2 more!",
      "MessageIndex": 1868,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 27, 2015 08:38AM Beachbum1023 wrote: Good morning, I am going to #24 today, still going ok. My armpit is pretty dark but as long as I keep it dry and open to the air it does seem to help. The rash is still itching, but I finish next Thursday! Take Care.",
      "MessageIndex": 1970,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 27, 2015 09:57AM Beachbum1023 wrote: Welcome cbooklvr, I am going to #24 today, 4 more to finish next week. I am doing well with the Aloe 100% clear gel and the cornstarch. My armpit is a bit burnt, but the itchy rash is just annoying. Good luck, for me this has been doable, but looking forward to next Thursday!",
      "MessageIndex": 1973,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 1, 2015 08:51PM Beachbum1023 wrote: Hello everyone, we made it to MARCH!! And I have 4 more rads to go. I can't wait to be done. I am sunburned, LOL, and my shoulder aches, oh I have a itchy rash on my chest, annoying to keep scratching at my rib bones, but no boob. My armpit is getting dark brown and a little red. But all the skin is still there so I hope to make it to the end without many issues. My big whine is the fatigue. I am dragging. I went from a whirlwind of appointments the first week of June, to 4 months of AC/T chemo, then 2 weeks later surgery, and now rads. I don't ever remember being this bone tired. I will be so glad to get back to some sort of normal. I hope everyone is doing well, and getting to finish line. I will wait for you......",
      "MessageIndex": 2072,
      "PostDate": "01/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 1, 2015 10:23PM Beachbum1023 wrote: cbooklvr, you got this, it will be over before you know it. It really does go fast. It takes longer to change for the treatment than the treatment takes.",
      "MessageIndex": 2074,
      "PostDate": "01/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 5, 2015 02:13PM Beachbum1023 wrote: Hi everybody, I finished 28 rads this afternoon, with 5 boosts to the tumor bed left. Last night I had horrible shooting pains in my armpit. It woke me up it was so painful. Any of you had that happen? I tried to get meds or something today and they told me to take Ibuprofen. WTH? The pain was unreal. The skin is very dark/red. Any ideas? Thank you! Have a great night.",
      "MessageIndex": 2164,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 19, 2015 01:06PM Beachbum1023 wrote: Hi JustJean, congrats for a terrific job well done! And the quilt is lovely! I cherish the ones that I have from my Mom and Grandma. And you can kick and scream all you want. I have thrown a few punches myself on this ride I never wanted to be on. I live on the Lake only the West side of the snow belt. I am guessing you are East. Thankfully this winter has been so easy for us West siders! And I stay West as much as possible to avoid the snow. I start rads next week, and I am dragging my fatigued butt to get there. I am not looking forward to it. I haven't heard much good about the whole thing, before or after! But for me it beats chemo. Thanks for sharing the quilt picture, I am sure she loved it! Have a great evening, and I hope that you forge ahead with peace in your heart.",
      "MessageIndex": 1031,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 28, 2015 11:01PM Beachbum1023 wrote: JustJean, Quiggy, and PoppyK, where are the boat drinks? I would love to join you! I'm pretty sure we can all say what is necessary, drama or not! I want to see the person that gets through cancer without ranting, raving, drama, and tears. I've had all of those at the same time! I'm going to rad #4 Thursday, and my treatment area feels warm and tender tonight. I was told that I shouldn't notice anything until the end of week 3 or 4. Not so sure about that one. And all the sharpie dots, very attractive. I look like I got attacked by some crazed dot to dot coloring book artist! Seriously, I thought sharpie markers were school supplies. I'm glad that it's cold in Ohio, and I can cover it with a big collar and a scarf. So for those ahead of me, what should I expect to happen? I've seen some pretty scary things about rads. And it kinda creeps me out, not sure why, and I thought chemo was a trip! Have a great day all, I hope you feel well.",
      "MessageIndex": 1205,
      "PostDate": "28/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 29, 2015 08:34PM Beachbum1023 wrote: Vitamin D, I was taking 1000 mg per day, and now they doubled it to 2000 mg per day. But the Neurologist doubled it. So that is a question for rads tomorrow. Tomorrow is rads #5, and I wondered if anyone felt sunburned so early in treatment? My chest feels hot to the touch, the incision from surgery is turning red, and my shoulder movement feels tight. My armpit is sore also. Maybe freaking out a little on my part? The nurse said nothing happens until week 3. Uh huh, so not sure where to go at this point, they seemed to not give a hoot.",
      "MessageIndex": 1235,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 31, 2015 08:08AM Beachbum1023 wrote: Good morning everyone, I had a problem with seatbelt straps over the summer when I had my port put in. It always would rub until it got cold and I broke out the winter coat. I have a little stuffed puppy that I keep in my car and he fits right under the strap when I drive. I tried the pillow thing but just couldn't get it right. They were all the wrong shape, too big, too stiff etc. And I gave up until I bought the puppy when I was out shopping one day. It works great! and besides, who can resist a cute little soft puppy?? Anything that works and makes me smile!",
      "MessageIndex": 1266,
      "PostDate": "31/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 1, 2015 09:23AM Beachbum1023 wrote: WndrWoman, I am just rooting for a great game, and the food of course! I don't have a team since I live near Browns Town. Maybe one day?",
      "MessageIndex": 1304,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 30, 2015 10:25AM Beachbum1023 wrote: Cassie, two more then done! I'll put my dancing shoes out for your happy dance.",
      "MessageIndex": 2624,
      "PostDate": "30/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 3, 2015 03:20PM Beachbum1023 wrote: Congrats PoppyK!! I hope you are healing well.",
      "MessageIndex": 1366,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 4, 2015 12:48PM Beachbum1023 wrote: Ladies, I had the same drawing class today! I have green X's and red lines all over. Do they buy the Sharpie's at Staples, or at a medical vendor? Seems absurd to use a marker. But done with #8. My shoulder bones feel strange, but so far so good. How is everyone else doing?",
      "MessageIndex": 1391,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 3, 2015 10:18AM Beachbum1023 wrote: Hi Kayfry, I am 3 weeks out today from the boosts. The skin has mostly all peeled, stopped itching last week, and looks pretty good. It does have a tanned look compared to the rest of me. I use clear 100% Aloe multiple times a day. So I think I am on the other side of rads I hope. I see the RO on 4/24 for my final follow up. Whew......what a ride. Wearing a bra is still a project, and I hardly wear one except when I have to. But that may come around when I go to a mastectomy bra, right now I make due until the rest of the swelling goes away. But it is not comfortable. Have a nice weekend. Cheryl",
      "MessageIndex": 2686,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 5, 2015 09:24AM Beachbum1023 wrote: Wndrwoman, Congrats! I am off to rads #9, so far so good.",
      "MessageIndex": 1423,
      "PostDate": "05/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 17, 2015 09:20PM Beachbum1023 wrote: Booklady, Viceroy, and Hygeia, Tap Tap Tap, another Happy Dance for all of you! Have a magical weekend! Cheryl",
      "MessageIndex": 2806,
      "PostDate": "17/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 8, 2015 08:54PM Beachbum1023 wrote: Good evening all, The head mold looks very much like a low dog bowl shape. Just my head fits in it, turned to the left. They take films on Friday to make sure I am still lined up correctly. I have a bolus M-W-F one week, and the next week T-TH. I have 4 tattoos 3 mid chest to line up and place bolus, 1 on my side under my arm area to tape the bolus on the side line. And assorted Sharpie marker x's and squiggly lines down my side. Very festive some lines are red, and the x's are green. Glad it's winter! I just can't wait until this is over.",
      "MessageIndex": 1548,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 9, 2015 08:47AM Beachbum1023 wrote: And away we go! I am off to #11, for those ahead of me power on, those beside me we will walk together, for those behind us, we will all meet at the end! Have a great week. ",
      "MessageIndex": 1561,
      "PostDate": "09/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 5, 2015 08:21AM Beachbum1023 wrote:  Thank you everyone! I would not have been able to do so well, and make it through all 33 rads without all of you! I hope everyone has healed and can now move on. I am 7 weeks out this Thursday.  This was my last day at rads, showing off my Diploma, wearing my very cheap, very blinged out tiara, and holding 33 roses. Super big finish! I always wear my tiara to chemo, it has super powers, and makes all of the nurses laugh. The Doctors just shake their heads and smile, I see a psych consult coming at some point........but the tiara is worth it :)",
      "MessageIndex": 2876,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 20, 2015 08:26PM Beachbum1023 wrote: quiggy, I got your back. I am so sorry that you have another bump in the road. I wish you the best! Cheryl",
      "MessageIndex": 2938,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 13, 2015 09:57PM Beachbum1023 wrote: Party time Ladies, we all made it to the weekend! Congrats to all those that have finished. Happy Valentine's Day!",
      "MessageIndex": 1667,
      "PostDate": "13/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 14, 2015 08:06AM Beachbum1023 wrote: Hi Cassie Cat, the tee shirt is a good idea. I put the Aloe gel on when I change from the gown to go home. I finished 3 weeks, and going well. Good Luck.",
      "MessageIndex": 1677,
      "PostDate": "14/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jun 19, 2015 07:27PM Beachbum1023 wrote: WheelyGirl, I am sending all of my good vibes your way for the interview on Tuesday. I am sure you will knock it out of the park! Cheryl",
      "MessageIndex": 3054,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 18, 2015 09:04PM Beachbum1023 wrote: Good evening Rads Ladies - sounds like everyone is making it through to the end! Keep going, we will all make it to the finish line!!",
      "MessageIndex": 1743,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jul 4, 2015 04:30AM Beachbum1023 wrote: WndrWoman, thanks I am trying, but now I have shingles. WTH! I made an appointment months ago to see my PCP, it's the 23rd. But I got the dang shingles first. The shingles vaccine was on my list. My MO pushed the flu and pneumonia vaccines, but never mentioned the one for shingles, I saw it online. Has anyone had the shingles vaccine? I am burning and itching and look a mess. Maybe I wasn't stomping fast enough?? LOL Another gift without a return receipt.  I hope everyone has a fun and safe 4th! Cheryl",
      "MessageIndex": 3118,
      "PostDate": "04/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 23, 2015 07:30AM Beachbum1023 wrote: Going Morning Ladies! This is the last week of February!! Spring is just around the corner, and the end of rads is coming. I have #20 today, and I have a rash on my chest, and the armpit is pretty red. Looks pretty tanned otherwise. I'll be glad to get this behind me. I hope everyone had a great weekend. Now it's Game On for 5 more days. We got this!",
      "MessageIndex": 1850,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 24, 2015 09:18PM Beachbum1023 wrote: Hi Cassie, I finished rads #20 today and my chest is tanning but the armpit is getting red and feels tight. I went back to my mastectomy exercises and that has been helping a lot. I use 100% clear Aloe Gel and Aquaphor at night. So far so good. I just have a small itchy rash just below my neck and on the back of my shoulder. I have 8 more rads to go. Take Care!",
      "MessageIndex": 1908,
      "PostDate": "24/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 25, 2015 06:37PM Beachbum1023 wrote: Hi quiggy, we all have those days, allow yourself to have \"one of those days\". Don't beat yourself up over it. I feel a lot of those same things. My hair is 1\" long/short, not really long is it? My eyebrows are crooked, but I can make them straight with wonderful cosmetics. My eyelashes are tiny, but thank you Maybelline! My vision is blurry some days, and sorry if I stepped on your toes! I have to go wash my hands, but really rearrange push and pull my boob where it belongs. Sorry if I am tired, I am exhausted from fighting for my life! And after all of that, I do look good, and Thank You very much for noticing! I hope you feel better, I am going to rub in some more Aloe and go to bed. I am tired from rads. But almost done! Have a comfortable night, and tomorrow game on! We will do it again. ",
      "MessageIndex": 1929,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 26, 2015 10:21AM Beachbum1023 wrote: dacre, what did the RO say? I would think that it would be a red flag during treatment. I usually get sent to someone else since chemo and rads doesn't have side effects. WTH?? I have seen 16 different Doctors now. And they always tell me the current problem is caused by the chemo etc. Thank You very much Adriamycin for the heart damage. Thank You Taxol for regrowing my tumor is 6 weeks. And on and on it goes..... I would have them either figure it out, or send you to someone that can help you. Ridiculous! That is not acceptable!",
      "MessageIndex": 1950,
      "PostDate": "26/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 27, 2015 10:15PM Beachbum1023 wrote: Hi Coyote, are you thinking it was the cute little puppy? I used that under my seatbelt strap to keep the pressure off my port. But it works nicely for rads too. I'm thinking I will keep him after treatment just to ride shotgun! I finished rads #24, I should be done on Thursday with #28, but I will let you know so you can light the fireworks! Have a magical weekend!",
      "MessageIndex": 1989,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 28, 2015 12:53PM Beachbum1023 wrote: Hi WheelyGirl, I found my shotgun puppy in the baby department at Stein Mart. But any place that sells stuffed animals should work. I was looking at the evil lizard, but I thought it would be too skinny to work well. :)",
      "MessageIndex": 2008,
      "PostDate": "28/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 2, 2015 08:09PM Beachbum1023 wrote: Ladyb1234, thank you so much, I can't wait to dance out that door! Quiggy, I'll be happy dancing for you on Monday! You know we never walk alone here.",
      "MessageIndex": 2100,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 3, 2015 09:21AM Beachbum1023 wrote: magicalbean - Its a crap shoot alright! I finish Thursday and I hope to make it through. So far so good.",
      "MessageIndex": 2106,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 4, 2015 09:47AM Beachbum1023 wrote: Sorry for the confusion, my chemo brain is working better than I want it to. Off to rads! I hope my old brain returns soon. LOL",
      "MessageIndex": 2146,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 7, 2015 09:57AM Beachbum1023 wrote: Hi rads ladies, I have 4 boosts left to finish. So far, it's quite a ride to say the least. The rash is very itchy, and I have it on my back as well. I just hope that the boosts leave my mx scar intact. I have swelling also, anyone have that from the rads? My scar looks like it is puckering a bit too. It was smooth. Any ideas?",
      "MessageIndex": 2216,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 7, 2015 01:38PM Beachbum1023 wrote: Hi Ladies, I am allowed to use 100% clear Aloe gel, Hydrocortisone cream, and Aquaphor. They seem to frown on anything else. I did get 4 tiny tattoos at the sim set up. Just another life time reminder of rads! They also make templates in case the marks rub off. I find it rather hilarious that they use Sharpie markers. I feel like a science project model. Just like a grade school volcano, but I do blow up some days! Since I had a mastectomy, the chest area and scars are swelling, so not too attractive right now! The skin is pretty tight, and I have issues with shoulder mobility. Just when it was really good and back to normal from surgery. So back to the exercises. I thought the rads would be easier, not!",
      "MessageIndex": 2225,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 3, 2015 10:21PM Beachbum1023 wrote: Good evening Ladies, I have a appointment to the RO on 1/9. I am very concerned about radiation because I have heart damage from Adriamycin chemo. Has anyone had this problem? My heart is not pumping enough blood, and I have daily meds, twice a day every day for the rest of my life! Geez....after my mastectomy I was in the hospital 4 days because my blood pressure dropped to 70/34. So needless to say I am freaking out a bit over the side effects. Any advice is greatly appreciated!!",
      "MessageIndex": 698,
      "PostDate": "03/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 24, 2015 03:05PM Beachbum1023 wrote: Hi Ladies, I knew what my marks were and I told them everyday so they would confirm them on the screen and verbally. And I kept track of all of the bolus days as well. We also have to give our name, birth date, and treatment side before each treatment started. The last day I was there, I told them I was Jane Doe and I joined the PPP Patient Protection Program! Good for a laugh on my last day at rads.",
      "MessageIndex": 2547,
      "PostDate": "24/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 10, 2015 03:36AM Beachbum1023 wrote: Good morning Ladies, I woke up to 5 degrees, and wind chills below zero! And some hot coffee! I saw the RO on Friday, and she wants to do 5 1/2 weeks of rads. I saw the MO on Tuesday and she wants me to start chemo on 1/20. My BS wants me to see the PS for reconstruction. The RO is going to present my case this coming Tuesday to the Tumor Board and see what they come up with for the plan. My plan was, I hope my hair is back before summer to go to the lake swimming at the beach, and get a tan. :) So at this stage, I am leaning towards rads just in case it could be a good thing long term. Then to chemo. Anyone else have this situation? ",
      "MessageIndex": 842,
      "PostDate": "10/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 10, 2015 09:02AM Beachbum1023 wrote: Lilactulip, I'm new here, but I haven't started rads yet. I won't know the start date until they decide if it's rads first, or back to chemo. But I hope your abcess heals quickly so you can continue. And I'm sure you will get a lot of responses to help you! ",
      "MessageIndex": 850,
      "PostDate": "10/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 30, 2015 10:24AM Beachbum1023 wrote: Kayfry, congratulations! Get your dancing shoes on for one big happy dance! Cheryl",
      "MessageIndex": 2623,
      "PostDate": "30/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 12, 2015 03:25PM Beachbum1023 wrote: Hi Saltygirl, I hate everything about cancer too! I'm sure everyone here does also. It is overwhelming, but it is worth it, we deserve to have our life back. Your arm may be fatigued from the position perhaps? I know my arm is not all together back from my mastectomy and feels tired from the exercise rehab. You have come so far, one more step, and keep on fighting! I hope you feel better. ",
      "MessageIndex": 904,
      "PostDate": "12/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 10, 2015 01:16PM Beachbum1023 wrote: Hi dotwithkitties, so did you name your puppy? I still have mine, he rides shotgun most days now, his name is Colt. I named my wig McKenzie. It is nice to have them in the car, and it helped with rads too. Kept the seatbelt from rubbing when the skin was fragile. Cheryl",
      "MessageIndex": 2746,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 15, 2015 08:03AM Beachbum1023 wrote: CoyoteNV, I had my marks and tattoos done yesterday, and the dry run is next Thursday 1/22. I will get my rads schedule next Thursday. :)",
      "MessageIndex": 962,
      "PostDate": "15/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 18, 2015 10:46AM Beachbum1023 wrote: Good morning dacre, I know 1:45 in the afternoon isn't really morning, but it is for me now. After 2 months of chemo, and working through chemo, and then a mastectomy, and starting rads next week it's the best I can do right now. I am exhausted also. I am sure that everyone here has had a fatigue day, I should have read the fine print better for side effects! This one doesn't seem to get better......I know that I am sick of plastic forks, take out, and naps!",
      "MessageIndex": 1008,
      "PostDate": "18/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 23, 2015 07:43PM Beachbum1023 wrote: Hi all, I start rads on Monday morning, and I'm a bit concerned. I have the aloe gel that the RO wanted me to use. Any other tips that may help? I am concerned about the fatigue because I just wrapped up chemo and surgery. I am so tired already, I just can't imagine more fatigue on top of that. And what is cording? I have seen it mentioned several times, just curious. Thank You!",
      "MessageIndex": 1096,
      "PostDate": "23/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 24, 2015 09:18PM Beachbum1023 wrote: Good evening dacre, I am glad you are here! The club nobody wants to join, but I thank my lucky stars every day that I am here. I need to laugh and cry and try to find the answer to the question why me? Why you? Why does this disease take so much from us all? We can share our rad stories, and the ups and downs. For all of you already moving through the rads, I start Monday and I am not looking forward to it. But I appreciate your stories, the good and bad. I hope everyone is doing well. Thank You for sharing.",
      "MessageIndex": 1122,
      "PostDate": "24/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 1, 2015 12:22PM Beachbum1023 wrote: I go for the food and commercials also, has any one seen Johnny football or Josh? Just askin', LOL",
      "MessageIndex": 1307,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jun 16, 2015 11:40AM Beachbum1023 wrote: Coyote, speak from your heart and share your inspiration and your passion. You will rock the house! I'll be lurking in spirit, you know that we are never alone, we are always together no matter what. We won't let you down! Best of luck, Cheryl",
      "MessageIndex": 3023,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 2, 2015 03:28PM Beachbum1023 wrote: Hi all, I finished rads #6 today, and I am using Aloe gel as directed by the RO so far. I haven't had any changes yet. But I am on high alert just in case. I had modified radical mast on 12/15, and now rads. I hope I am done, but the tumor board suggested possible gamma knife surgery, or chemo. The MO wants more chemo, yuk! I do wear a bra when necessary, but as little as possible right now. I am sure that summer is going to be a challenge with swimming, the beach, and summer clothes in general. Oh this sucks. Sorry just my day today.",
      "MessageIndex": 1342,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 3, 2015 08:04PM Beachbum1023 wrote: mqt64, I am having 28 rads to start, and we will see how it goes if the boosts will be needed at the end. I am with you, I just hope they pass quickly for us. The Lake was beautiful today with bright white snow and deep blue water where the ice has split. I love the winter more than the summer on the Lake. It is something to see. Take care!",
      "MessageIndex": 1376,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jul 8, 2015 07:00AM Beachbum1023 wrote: Hi Ladies, I have given up on anything underwired, even though I always wore them before the mastectomy. I can't find a comfortable one. I did find some great sports bras that work though. They are seamless, long and short line, and I like the racerback style. They all have pockets too. And the price is great with lots of coupons to use online. Keep trying, it took me months to be comfortable! Cheryl",
      "MessageIndex": 3132,
      "PostDate": "08/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Sep 27, 2015 08:39AM Beachbum1023 wrote: Great News Jean! I too have the extreme joint pain, my knees and back have been rough lately. Hopefully nothing will be \"glowing\" on my bone scan!",
      "MessageIndex": 3199,
      "PostDate": "27/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 16, 2015 02:52PM Beachbum1023 wrote: raisemeup, how do we get through all of the hurry up wait?? We come here and find love and support. We ask questions, and look for guidance, we do our normal things and go on with the day to day of life. The waiting game is truly awful, we all know that. But we all make it through, and get the results, make a plan, and then it's Game On! I'm so sorry that you have to wait longer because of the water problem, but it will all fall in place for you and your family. Please keep us informed, and we all wish you well going forward. Good Luck!",
      "MessageIndex": 2,
      "PostDate": "16/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/828557",
      "Title": "Diagnosed but no plan yet raisemeup NATSGSG"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 20, 2015 12:38PM Beachbum1023 wrote: Hi Annie, I hope today finds you warm and comfortable. We have bitter cold, but beautiful blue sunny skies. Plan each day and enjoy it. I hope you can forget the time limits, and enjoy every hour of every day. I hope that Hospice is treating you very well, and your time will be well spent surrounded by family and friends, comfort and love. I am sending you a warm hand to hold, a song to sing, and enough love to fill your heart. Take Care Annie, I hope you have a peaceful evening.",
      "MessageIndex": 99,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828155",
      "Title": "Hospice for me Annie62 RonnieKay"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 23, 2015 09:36PM Beachbum1023 wrote: My last chemo was 11/25 Taxol. My hair is now 1\" long/short! Mostly black with white. It was brown before. But its hair.",
      "MessageIndex": 21871,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 28, 2015 10:27PM Beachbum1023 wrote: Hi Ladies, my last Taxol was 11/25. My eyebrows and eyelashes are almost all back, and are thicker than before. My nails are really hard growing back in, and one more file and they should all match. My hair is almost 1\" long, super soft and growing in pretty even. I take Biotin every morning. Cheap and it seems to help. Good Luck!",
      "MessageIndex": 21895,
      "PostDate": "28/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 6, 2015 12:24PM Beachbum1023 wrote: Hey Rock Stars - you all look great with the new hair! I hope to catch up soon with a trim. Cheryl",
      "MessageIndex": 22056,
      "PostDate": "06/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 12, 2015 11:56AM Beachbum1023 wrote: Wow you all look great, short hair still counts! I hope you all feel good too. My hair started to come back after the second dense dose Taxol. Then I lost my eyebrows and eyelashes, but they are almost back. I can at least wear mascara these days. I hope to lose my wig by summer. Just depends on when I go back to chemo.",
      "MessageIndex": 21830,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 18, 2015 11:14AM Beachbum1023 wrote: Hi BPgas, I hope you feel better today, that sounds aggravating at best. I had dose dense Taxol but never had that happen. I just had everything else! How are your feet/toenails and cuticles? I had skin peeling on the bottoms of my feet and around the toenails. And my skin is super dry, and dry cuticles. I found some wonderful products at Sally Beauty. I use Foot Therapy (small yellow box) to soak my feet and ankles. I love that stuff, it feels great! And I also get my cuticle oil there. I use new files every time I do my nails since I am concerned about any germs etc. But they also have the wig supplies too. I have a real hair wig, so it takes a little more to keep her pretty. But I love it, and it is relaxing in a weird way to sit and do \"my hair\". They also have the wig caps and silky pillowcases too. I was so fortunate to have a great assistant when I was there, she too has to wear wigs. So very helpful. Maybe a silky cap and pillowcase would be helpful to you so you could be comfortable. I hope you get some answers so you can feel better. Its so hard to sleep when you can't be comfortable.",
      "MessageIndex": 21848,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 8, 2015 07:31PM Beachbum1023 wrote: Mom to quads - have you tried a flat iron? I have a good one for my wig and it works great!",
      "MessageIndex": 21942,
      "PostDate": "08/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 27, 2015 01:30AM Beachbum1023 wrote: blueflowers, I take Biotin for my hair, and it seems to work well and it's cheap. I always pick it up BOGO.",
      "MessageIndex": 22018,
      "PostDate": "27/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 12, 2015 09:59AM Beachbum1023 wrote: Iheartthegirls, I know it is hard to do, but take a breath, and try to relax over the weekend. The waiting game is by far the worst thing right now. Maybe lunch and a movie this weekend to do something to stay busy with your Mom may be a good choice. You will find a lot of info here, and the love and support will make your days much easier. Try to stay away From Dr. Google, the info can be outdated, and just plain wrong. It will only add to the frustration and panic. We all post info that is in real time, the truth, and very helpful. Everyone here has the same problems, but we all walk our own road. All you have to do is remember that many have been here before us, but we all walk side by side, and together! What we do just may make a difference for those that follow us. I wish your Mom the best, and I hope you can relax throughout the weekend!",
      "MessageIndex": 1,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828411",
      "Title": "New Here and worried Iheartthegirls Iheartthegirls"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 3, 2015 06:43PM Beachbum1023 wrote: Annie, I hope you fill your heart with love, enjoy every second you have, and know that those that have gone before you will be there to greet you , and know that I am behind you. I hope to find you one day, with a helping hand to lead me to my peace.",
      "MessageIndex": 6,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828155",
      "Title": "Hospice for me Annie62 RonnieKay"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 10, 2015 02:27AM Beachbum1023 wrote: Hi Annie, sending my sunny blue skies and Spring sun your way to melt the snow, and warm the air. I hope Spring will surround you with beautiful blooms and brighten your day. I hope you are comfortable and showered with love. Take Care. Cheryl",
      "MessageIndex": 122,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828155",
      "Title": "Hospice for me Annie62 RonnieKay"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 16, 2015 05:59PM - edited Feb 16, 2015 06:00PM by Beachbum1023 Good evening Annie, I hope you had a comfortable day, and a pain free evening. Sending love and support your way. Please let your Daughter know that we are here for you, and her too. Hugs!",
      "MessageIndex": 84,
      "PostDate": "16/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828155",
      "Title": "Hospice for me Annie62 RonnieKay"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 2, 2015 01:33PM Beachbum1023 wrote: The American Cancer Society sponsors Look Good Feel Better. It is a two hour class to go over make up, scarves, and wigs. And you get a really nice make up kit to keep. They showed us how to cover for eyelashes and eye brows. I had a great time, the make up kit is really nice, and it is all presented by volunteers and cosmetologists. You can find it online for the info, and how to sign up. Side note, my eyebrows and eyelashes started to come back as soon as they fell out. And I had my wig made with bangs just for that reason. But it really was quick! Good Luck!",
      "MessageIndex": 21901,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 10, 2015 04:08PM Beachbum1023 wrote: Viceroy, beautiful, and I love the color!!! Pretty scarf too. Have a great weekend. Cheryl",
      "MessageIndex": 22069,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 3, 2015 08:30PM - edited Mar 3, 2015 08:31PM by Beachbum1023 Hi FairyGirl, I take Biotin, and my hair is growing back very full. It is almost 1\" long all over, but a little longer on top. The color is dark brown and gray but growing. My eyelashes are also back thick and full. My eyebrows are a little off, but I fill them in with make up. I would try the Biotin it is cheap OTC. I usually watch the Drug Mart for when they have them on sale BOGO. But it is working very well for me. My nails are back also, and back to normal color. And strangely the nails are very hard. I finished AC/T on 11/25. I also use Johnson's Baby Shampoo and Pantene conditioner on my real hair. Not sure if that helps you at all, but I hope so. Good Luck! I hope it works for you.",
      "MessageIndex": 21906,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 10, 2015 03:54PM Beachbum1023 wrote: Hi Ladies, I am 5 months out from my last Taxol, and I called today to schedule a trim to tidy up my wild hairs! The back has grown so long that it shows under my wig. A great problem to have. So still a long way to go..........at least it is something before summer. I hope everyone has a great weekend.",
      "MessageIndex": 22067,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 14, 2015 01:58AM Beachbum1023 wrote: Hi BPgas, I had Taxol but my hair was already gone from the AC. But it did start to grow back for me after the first Taxol infusion. I did lose my eyebrows and eyelashes on Taxol, but they are growing back nice and thick. Sorry I can't really say much else, since I am not too sure if it was the AC or the Taxol. But I would ask the MO or your chemo nurses.",
      "MessageIndex": 21838,
      "PostDate": "14/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 19, 2015 11:37PM Beachbum1023 wrote: Hi Chloesmom, I am sure you look great with the new wig! It was so funny when I had to shave my hair down. I was always told I looked like my Mom, and then I shaved my head and I looked just like my Dad, or Uncle Fester. Ugh, good thing I love my wig :)",
      "MessageIndex": 21861,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 8, 2015 07:29PM Beachbum1023 wrote: Mom to quads - have you tried a flat iron? I have a good one for my wig and it works great!",
      "MessageIndex": 21941,
      "PostDate": "08/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Oct 6, 2015 11:53PM Beachbum1023 wrote: Well Ladies, it sleeps 20, so I think a gathering at Indian Bear would be perfect! And they have hot tubs, and a new winery right next door that we can walk to. I tried to stay.............",
      "MessageIndex": 299,
      "PostDate": "06/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jul 15, 2015 11:44AM Beachbum1023 wrote: Hi April, I was born in '56. I guess I was so excited to see the last year go I never thought I may start this crap all over again. I went for my 6 month mammo, and \"they see something\". Yikes! So after being called back three times for more pictures, they called me back for a US. And told me to discuss it with my BS at my 6 month check up appointment next week. Not too sure if I should laugh or cry, but I am going to live in denial until then. Makes me sick to even think what could be coming my way.............again. Not fair. Cheryl",
      "MessageIndex": 285,
      "PostDate": "15/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Oct 3, 2015 01:35AM Beachbum1023 wrote:  Sassy, Thanks! Everyone should apply for it, Good Luck! This is the loft at Indian Bear Lodge, beautiful! It sleeps 20 and every inch is gorgeous. We had a great time, campfires, hot tubs, wineries, and wonderful food. I came home with three totes of gifts too! I hope you are selected!! Keep me posted. Cheryl",
      "MessageIndex": 296,
      "PostDate": "03/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Sep 26, 2015 02:01PM Beachbum1023 wrote: Hey Ladies, thanks I have the bone scan in the bag but no results yet. Still have the blood tests and CT before I see the MO on 10/13. And the Cardiologist the beginning of October. Living in denial until I know the results but feeling like crap. Ugh. I went on the Casting for Recovery retreat and had the best time ever. Look for it online and apply, you will love it even if you never fished before. I had three bags of gifts coming home!! We are going on another weekend mid October as the Alumni group. Until then I guess I get prepared for the \"news\". Or not! ",
      "MessageIndex": 291,
      "PostDate": "26/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Oct 2, 2015 08:11PM Beachbum1023 wrote: Hi Sassy, I don't know how to do that, but it's online I found it on Google. The retreats are by state, and I believe that 33 states now have them. But a great experience! I had a blast. www.castingforrecovery.org",
      "MessageIndex": 294,
      "PostDate": "02/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jul 5, 2015 09:35AM Beachbum1023 wrote: I won the shingles lottery. My MO wanted me to get the flu, tetanus, and pneumonia vaccines, and I did. Never mentioned the shingles vaccine I saw it online. My appointment with my PCP is 7/23 but I got the shingles last week. Go figure. But I didn't know that chemo and rads creates high risk for shingles for all of us. Please check with your MO, this sucks.",
      "MessageIndex": 278,
      "PostDate": "05/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jul 8, 2015 10:07AM Beachbum1023 wrote: Hi April, I have a bunch of binders for paperwork, drugs, info, billing etc. that keeps me going. Too much info to remember for me. And I carry a calendar book and a notebook in my purse to keep on top of questions etc. It's a full time job staying ahead of all this.  I hope you are doing well, I see you have been at all this for a while :) Take care, Cheryl",
      "MessageIndex": 281,
      "PostDate": "08/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jul 12, 2015 11:50PM Beachbum1023 wrote: Hi April, I started out well being organized, than got too sick to care. But I pulled it together towards the end of rads and got organized right about the time the paperwork slowed up. So I'm down to the stack of paper to be filed. I keep a basket that I drop the new stuff in and deal with it watching TV. I hope I can keep it going from now on. In three days I hit the big one year anniversary of this trip to hell. Amazing what has happened in 12 months! Good Luck, just keep at it. Cheryl",
      "MessageIndex": 283,
      "PostDate": "12/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 14, 2015 03:06AM Beachbum1023 wrote: Hi Nico, you have already been to the dark place and Dr. Google, so take a breath and relax a little. The waiting is by far the worst of this. I have sent myself to the dark side, and usually for no good reason. I hope it all goes well, and you can smile when you have the results!",
      "MessageIndex": 7,
      "PostDate": "14/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828366",
      "Title": "31 years old scared sh*itless nicomari83 Beachbum1023"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 27, 2015 12:24PM - edited Feb 27, 2015 12:25PM by Beachbum1023 Oh no ban my Peanut Butter cups? Or should I pass on the Snicker Bar? Toast with Peanut Butter and raspberry jam a pass? Homemade Peanut Butter cookies, fresh from the oven, hand me the plate! Let's study why I have BC, let's find the reason why some people have it and others don't. Let's find a way to control it for all us Stage IV people, let's find a cure! Then and only then will I give up anything peanuts.",
      "MessageIndex": 46,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827123",
      "Title": "Peanuts linked to cancer spread? Shutterbug73 Beachbum1023"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 17, 2015 12:48PM Beachbum1023 wrote: KBeee, the other day was sunny so I wanted to go walk at the beach. I drove in with my shoulder length blonde hair. A couple walked past my car so I waited and when they weren't looking I pulled off the wig to walk topless so to speak. I passed the same couple on the path, and I got a double double take look from them. I smiled and laughed..........have a great day!",
      "MessageIndex": 545,
      "PostDate": "17/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 18, 2015 12:23AM Beachbum1023 wrote: Karen, your lovely gift is beautiful. I hope it brings you comfort, support, and serenity. How thoughtful.",
      "MessageIndex": 560,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 22, 2015 09:54PM Beachbum1023 wrote: Leaf, I hope you had a comfortable weekend and are ready to be back to business in the morning. It looks like you are finding plenty of answers and support here. A great place to be for both of you. There is no reason to be embarrassed or feel shame for having BC. I hope you have plenty of ideas to start the search for assistance. You will find so much support here, and much comfort as well. It is quite a whirlwind in the beginning. I keep binders to try to keep everything straight. You will have a lot of info coming at you, and this is information that you need for insurance and taxes and medical records. Best to try to organize it early. I hope you have a great week, and find assistance. Good Luck!",
      "MessageIndex": 11,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828714",
      "Title": "Just Diagnosed / 32 yrs Young Girlfriend Facing Breast Cancer leafuponleaf bride"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 20, 2015 03:25AM Beachbum1023 wrote: Has anyone tried frozen seedless grapes as a snack? Pretty tasty, and easy to pack for chemo days.",
      "MessageIndex": 619,
      "PostDate": "20/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 20, 2015 11:15PM Beachbum1023 wrote: Kcoralee, welcome to the group, and no worries we all walk together here! You will find amazing support, and answers to all of your questions. Nausea was my biggest fear, and I worked with my infusion nurses and they got me through it. The meds worked great, and I followed the advice, stay ahead of the side effects! Everyone here will help, just post and you will find what you need. You got this!  Best of luck, be kind to yourself, it's a wild ride. Take Care, Cheryl",
      "MessageIndex": 1584,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jun 5, 2015 09:53AM Beachbum1023 wrote: Welcome BAT, I finished AC/T on 11/25 and had a single right mastectomy on 12/15. Very doable for me. I am TNBC as well. I see the MO after Labor Day to have new scans done. I hope this helps. I hope treatments are going well for you both. Cheryl",
      "MessageIndex": 2085,
      "PostDate": "05/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jun 8, 2015 12:05AM Beachbum1023 wrote: littleblueflowers, I have neuropathy and I am taking Gabapentin, and all good! I tried to convince my MO that since my feet and hands and face are all good I do not need the drugs. Her opinion is that if I am all good it must be working, so I just keep eating them. She may just be right this time :) I take 300 mg every morning and every night, but I reduced the dose, it was supposed to be 3 times a day, but hey if it is working I am not telling her just yet. Sorry I can't help with the burning and blistering. But I know someone will! Take care, you need those feet for all that hiking! Cheryl",
      "MessageIndex": 2148,
      "PostDate": "08/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 22, 2015 01:57PM Beachbum1023 wrote: Addie, I saw your post and wanted to share, I took Biotin and my hair is growing back like crazy!! I finished my last DD Taxol on 11/25 and I have had my first haircut three weeks ago. It will grow back. Mine came back darker than it was, but it is super soft and wavy. A big improvement than it was. I always had thick hair, but it is really thick now. And my nails look great from the Biotin. Ask your MO, mine suggested it for growing my hair back. It does get better, one day at a time. Take care, Cheryl",
      "MessageIndex": 1624,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 30, 2015 02:51AM Beachbum1023 wrote: LiveStrong at the YMCA - Positive_Spirit - I applied for the program, and I have just finished the first three weeks, and I love it!!! We go twice a week for the program, and the other 3 days I go on my own. I take Spin on Mondays, LiveStrong on Tuesday and Thursday, Aerobics on Sunday, and Yoga on Tuesday evening at my local cancer center. It is FREE for us, and the class here is 12 people, we are the first class. The 3 month membership is free so we can use all of the classes, pools, track, and machines any time. If it is available, I would highly recommend it. And I am losing weight, a bonus! I also walk 6000 to 9500 steps per day.  I do feel really good right now, 6 months out from Taxol. I just wish the exercise and Yoga had started sooner so I wouldn't have to lose the weight and get back in shape. Thankfully I was pretty fit when the shit bus hit me. All that exercise is really cutting the fatigue as well. After chemo, surgery, and rads it is nice to be tired from something other surviving treatment!  ",
      "MessageIndex": 1902,
      "PostDate": "30/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 11, 2015 11:47AM Beachbum1023 wrote: Hi Ladies, just dropped in to say you got this! I wore my wig every day from 8/11 to 4/28 and it never came off. In fact I got so many compliments on it that I wondered what I looked before the wig. 4/28 I went for my first hair cut! It's very thick, a little wavy, but growing like crazy. I take Biotin every day and it seems to be working. So smile even if you have to fake it, and you can do this. It will come back around in a good way. And my nails are great, back to normal, my old normal!!  Thinking of everyone today, and sending you wishes of happy days!",
      "MessageIndex": 1327,
      "PostDate": "11/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 21, 2015 09:35AM Beachbum1023 wrote: slv58, hope the port feels better soon! I use a small stuffed puppy under my seat belt strap to keep the strap off my port. Much better in the summer, no coat to protect it. A small pillow works but I did not find one small enough. Good Luck, happy weekend!",
      "MessageIndex": 1592,
      "PostDate": "21/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jun 5, 2015 12:57PM Beachbum1023 wrote: Addie29, I am so sorry this drags on so long for all of us. We don't really have seasons now, just chemo, radiation, surgery, and recovery with a few festive parties tossed in! Blech!",
      "MessageIndex": 2094,
      "PostDate": "05/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 3, 2015 11:47PM Beachbum1023 wrote: Hi mamajencoz, welcome to the group! Well I already finished AC/T on 11/25 but I drop in to visit and help if I can. I survived AC and you will too! Any questions, just ask. Start drinking a lot of water, it will be very helpful during chemo. I drank 4 to 5 bottles a day, and still do. Check back on the March chemo thread, there is a lot of info there, and many other AC Ladies as well. There are a lot of tips to pack a chemo bag, as well as hair and wig tips, skin issues, and side effects. But I must say a positive in it to win it attitude will help. But bad days are allowed as well. You do whatever you need to do when you feel like it. We all get it, and we even poke fun at the ridiculous side of this crazy disease. I wish you well, you never walk alone here. I'll be waiting at the finish line. Take Care. Cheryl",
      "MessageIndex": 185,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 7, 2015 11:33PM Beachbum1023 wrote: Hi mamajencoz, Sorry you aren't feeling too good. I had AC/T, and I drank 4 to 5 bottles of water each day. I used Jell-O, popsicles, mandarin oranges, pretzels, baked potatoes, mac and cheese, and yogurt. Anything easy, but sometimes I could eat cottage cheese. Very weird combination but I ate what worked, and ate it over and over. Thankfully I was much better on Taxol. But if you had chemo today, I would tell your MO, my nausea never really hit hard until Thursday and Friday. Maybe you need a better combo on infusion day. I had 3 meds for it, but usually the Zofran kept it under control. I would take it on schedule the day after and kept it going until Monday morning. I hope you feel better soon. Cheryl",
      "MessageIndex": 246,
      "PostDate": "07/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 10, 2015 12:23PM Beachbum1023 wrote: Hi ankledolphin, I had AC/T and I ate a ton of mac and cheese, mandarin oranges, bananas, popsicles, noodles, Jell-O, baked potatoes, and chicken. The same things that worked I just ate over and over. It is a lot of trial and error. I also drank a lot of cold mocha, the chilled one in the dairy aisle.",
      "MessageIndex": 332,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 16, 2015 05:06PM Beachbum1023 wrote: Starrgirl, I am so sorry that we all have to lose our hair, but it does come back! I finished AC/T on 11/25 and my hair is now 1 1/2\" inches long. I wore my wig, and truthfully not dealing with my hair was a huge help. When I was so tired working and going through chemo, I could just put her on and go. So while I would rather have my hair, it was a very mixed blessing for me. I guess we all pick and fight our own battles during treatment, but for me I love my wig!  I hope that you have a great evening with your dear son, how thoughtful and kind. You did good Mom!!",
      "MessageIndex": 516,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 29, 2015 05:29PM Beachbum1023 wrote: Hi sheshe, If you read the previous chemo threads there are a ton of suggestions for chemo bags. I used a cooler with strap, like a larger soft side lunch cooler. I got mine at Dick's Sporting Goods, and it worked great. It has a removable container and I could pack it and put it in the fridge. Then just grab and go. It had zip pockets and all of meds fit in there. One place for everything and I could take it to work with me. I took plastic forks and spoons, yogurt, apples, pretzels, celery, mac and cheese, lip gloss, bottled water, iPhone and charger, hand cream, Lemon Drops for dry mouth, all my meds, reading material or Kindle or iPad if you have one. I always had to eat during the infusion to keep my stomach settled, and I just kept eating small snacks. I had nausea but I controlled it to keep eating. Some Ladies knit or crochet, read, and some Ladies would work from a laptop. I always stayed busy to make the time fly. I was usually there about 5 hours. But you will make it work for you. Make sure you drink water starting 2 days before and just keep drinking forever! I still drink at least 4 bottles of water per day. I took pictures, sent text updates to my friends, whatever it took. You will find that you will have many suggestions from everyone. You could always drop in to the previous threads from the other months and they will be happy to help. Nobody is ever alone here, 24/7! Some Ladies have a shawl or small throw, it's up to you. But be very kind to yourself, its a wild ride. Take care, and let me know if I can do anything to help you. I finished AC/T 11.25. I wish you the best! Cheryl",
      "MessageIndex": 92,
      "PostDate": "29/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 30, 2015 01:00PM Beachbum1023 wrote: lovlilynne, I did not ice my nails, and I am ok with that. They did turn funky colors, but they have all grown out except for my two big toenails. They are about 50% right now. You can try some clear polish with a tint or fun glitter for sparkle for the summer. I just thought I had bigger fish to fry than worry about it. What chemo are you going on? Popsicles are great, lots of flavor, and I never had mouth sores. I used Biotene mouthwash also, big help. Good Luck!",
      "MessageIndex": 113,
      "PostDate": "30/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 30, 2015 01:31PM Beachbum1023 wrote: SheShe ask for the lidocaine cream, it works great. I never felt a thing. I also use it when I have to go for my monthly port flush.",
      "MessageIndex": 116,
      "PostDate": "30/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 30, 2015 11:27PM Beachbum1023 wrote: Hi littleblueflowers, Congrats on the clear CT and tumor markers!! That is great news. I am so sorry about the helicopter accident. I do hope that your husband is ok. I will send a ton of hugs and well wishes to the survivor.",
      "MessageIndex": 122,
      "PostDate": "30/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 31, 2015 06:12PM Beachbum1023 wrote: SpriteB, I worked through AC/T and finished it on 11/25. That was the same day my employer put me on leave. They did not give me a choice. I would work on Monday 10 to 8, on Tuesday I had chemo in the morning and worked from 3 to 8. On Wednesday I worked 10 to 8, and was off on Thursday and Friday. Saturday I worked 10 to 6 and Sunday from 11 to 5. I worked in a retail position so my days could be flexible to a point. I still had to get my hours in. On Monday mornings I would go to the blood lab for my CBC and metabolic panels, and on Wednesday I would go for my Neulasta injections. Exhausting for sure. But working with the public was also a problem. I had to be close to the bathroom for sure. Then I had my regular week, and back to the chemo schedule.  You may do better on your cocktail, it is different for everyone. But not a walk in the park for me. Looking back I am not sure how I did all that. But I did it. Hopefully you will have the desk position, and that should help you. Good Luck, I am sending a pile of hugs to be used when needed! Cheryl",
      "MessageIndex": 140,
      "PostDate": "31/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 3, 2015 11:50PM Beachbum1023 wrote: Rockerwife, have the best camping trip ever! Happy trails...............I am so glad the kids gave you a Hero send off! My Mom taught 5th grade for 32 years, and teaching was her life. I know what that means to you. Cheryl",
      "MessageIndex": 187,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 16, 2015 04:59PM Beachbum1023 wrote: Vanmama, sorry about the headache, but I always took ice packs to put on the back of my neck during the chemo infusion. Maybe that would help you too :) Cheryl",
      "MessageIndex": 514,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 19, 2015 05:24PM Beachbum1023 wrote: Hi littleblueflowers, sorry you feel so crappy, but I have the watery nose and achy body. It's a side effect that hasn't left me yet. Check your temp just in case, but mention it to the MO or chemo nurses. I hope you feel better!",
      "MessageIndex": 601,
      "PostDate": "19/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 21, 2015 02:00AM Beachbum1023 wrote: Good Luck tomorrow, I wish you the best! I would see the MO at 9 and be done with chemo at 2ish, I had to work 3 to 8. Hope this helps.",
      "MessageIndex": 650,
      "PostDate": "21/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 10, 2015 11:12AM Beachbum1023 wrote: slv58, I have a power port and I lost all last summer to chemo. I am very happy to go swimming this year so worth it! I do keep a little stuffed puppy in my car, he rides under my seat belt to keep the strap off my chest. Other than that, I do not have issues with my port. Ask for a script for lidocaine to cover the port with 1 hour before they access it. It numbs it and you won't feel a thing! Huge bonus!  There is a light at the end of this tunnel, you got this! Hugs, Cheryl",
      "MessageIndex": 1299,
      "PostDate": "10/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 19, 2015 02:31AM Beachbum1023 wrote: Hi April Ladies! I just wanted to drop in and wish you all a comfortable journey. I finished AC/T on 11/25. And I did work 42 hours a week all they way through chemo. I had a flex schedule so by working every weekend I got it done. Rough but I made it. My schedule was Mon. 10 to 8, Chemo Tues. and work 3 to 8, Wed. 10 to 8, off Thursday and Friday, Sat. 10 to 6, and Sun. 11 to 5. Not fun but I managed. You can do this! Good Luck! I am going to be hanging up my wig soon, and you will too!",
      "MessageIndex": 10,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 29, 2015 03:18AM Beachbum1023 wrote: Hi April Ladies, I just wanted to drop in and wish you all well! I finished AC/T on 11/25, and you can do this, I did. I hope you have your chemo bags ready to go, and are all set. If you have any questions I may be able to answer, just ask. Nobody here walks alone ever, and I am waiting at the finish line for you to meet me. Make sure you hydrate before chemo starts, it helps alot. I still drink about 4+ bottles of water a day. Stock the fridge for the days after chemo. Plan for easy small snacks, it does help to eat. Popsicles, Jell-O, cottage cheese, frozen grapes, juice, yogurt, fresh fruit, and mac and cheese helped me keep the nausea away. I always took the meds, it really helps to keep on schedule as needed. It is very difficult to keep nausea away if you do not take the meds. Brach's lemon drops help with dry mouth, Biotene mouthwash helps as well. Lip gloss and body lotion, cuticle oil, and Tums. Good to have some OTC for relief when you need them. I used baby shampoo on my head to keep my scalp clean. But the good news - my hair started to grow after the first Taxol infusion after AC. I was so happy to see that, and Biotin helps it grow. And your hair will come back as well. I will probably get a trim this week. So for all of the side effects, there are plenty of tricks to get ahead of them. I always took plenty of small snacks and bottled water for infusion day and I really felt better with something in my stomach. Seriously nausea was my big fear. I drank water, ate a lot of small meals and snacks, and never ever had to vomit. Maybe TMI, but it is a huge fear for more ladies than me only. But find a way to keep it at bay, and positive thinking helps. Good Luck Ladies, you got this! And with Easter soon here, take all the pictures of friends and family. You will still have your hair, and next Easter you will have it all back! :) ",
      "MessageIndex": 76,
      "PostDate": "29/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 29, 2015 11:51PM Beachbum1023 wrote: Hi littleblueflowers, You so got this! Come to the threads and vent away all you want! That's why we all help each other. I finished AC/T on 11/25. But I am waiting for you and everyone else to finish this. I put on my cancer killing butt kicking boots and stomped my way through it and out the other side. Have fun with your family, you have a whole lot of loving and living to do, don't waste that time on cancer. You have enough time to \"do\" cancer. Your husband must love you to the moon and back, take advantage of that. And your parents are coming to support you. That is fantastic to have so many caring and supportive fans in your corner. Save your tears and fears for when you come here to find support with all of us that get it. I can only give so much to cancer, I have given plenty and I am ready to move on and get my life back. Don't worry about your armpit, part of mine has moved a little after surgery. I was told after rads that the hair probably won't grow back and I won't sweat on my right side. Could be worse! And I know how scared you are, but so is every single person here on the boards. We wouldn't be normal if we weren't scared. It's okay to have a pity party now and again, just not a lifetime of pity. Stay here on the boards, you will meet the strongest and kindest women ever. Pour your heart out, and you will have all of the support you need 24/7. I so wish I could say that this is easy, nothing easy about it! But I will help you, nobody here ever walks alone. I am following those that have gone before me, and I am waiting for you. One step, one day at a time. Good Luck! Cheryl",
      "MessageIndex": 99,
      "PostDate": "29/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 30, 2015 12:08AM Beachbum1023 wrote: x1mel, Nothing about BC is fast, on time, or when we want it. It is all about hurry up and run, then wait. A positive attitude will serve you well, with a lot of patience thrown in. I am 58 and single, I so get having to carry the load. But I can focus on me, and not worry about all of the things life can bring to our day. Take care of you, that is so important now. This is all about you and your future. If you think you may want extra support, talk to your Social Worker. Join a local support group, or maybe confide in a special close friend. But take a long deep breath and try to relax and just focus on what you truly need. Before chemo I had a ECHO, CT, PET, MRI, US, and mammogram. And I always had a CBC and metabolic panel done the morning the day before chemo. It just depends on your Doctor. You may want to have your teeth cleaned before chemo. Your MO will tell you what you need and when. I also had my flu shot and my pneumonia shot but that has to be worked in around the chemo, ask your MO. They will get you going. I play games on my iPhone, read, cook, whatever works really. I made a necklace for a friend for Easter the other day. But it is best to stay busy, and keep your mind busy too. Exercise is great, or maybe a new hobby. Everyone finds a way to cope. So come here often, you will find everything you need here. But time spent worrying does not change the process or the outcome. But you can do this. Read through the other chemo threads, you will find a lot of help from the others that have started before you. Just ask, you will have a lot of help. Take care, let me know if there is anything I can you with. Cheryl",
      "MessageIndex": 100,
      "PostDate": "30/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 30, 2015 12:32AM Beachbum1023 wrote: Hi KBeee, so sorry you are back in line at the chemo bar! But I will be joining the chemo line again soon. Great advice on the water, water, water, it served me well through AC/T. I still drink like a camel :) I forgot to add Biotene mouthwash, it helped me, no sores!! And I always took a freezer ice pack to put on my neck during the infusions, and never had the headache. Maybe good for you too. It sounds like you are planning a party with all of your friends at chemo! Nice. and wonderful support. I always wore a bedazzled tiara to chemo. I told me nurses it had super powers. Yep a little crazy, but the laughs were so worth it. Then all 5 of the infusion nurses started to wear them every time I went to chemo, Tiara Tuesday! Maybe you need a little fun for your chemo group........just sayin. It was great fun. I even wore my tiara to my last day at rads. The Doctors and techs were cracking up when I went in to change and came out in a gown and tiara doing my happy dance. I find a little humor goes a very long way. Take care, I hope you have your cancer killing butt kicking boots ready to go! I wish you the best. Cheryl ",
      "MessageIndex": 103,
      "PostDate": "30/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 1, 2015 02:58PM Beachbum1023 wrote: Hi Lynne, I finished rads three weeks ago this Thursday, and while it was physically easier, mentally it was not easy for me. It really got in my head. I think going 33 times day after day was the rough part. And three weeks out my skin is still healing and wearing the bra with extra parts is very annoying. I go without it as much as possible. I worked all the way through chemo, not easy at all, but I kept a regular schedule and that helped. I am going to start looking for a new job Monday after Easter. I had travel time both ways and the rads so the time was tough for me. I spent about 1 1/12 hours total for each rad treatment, and the days with the Doctor ran longer. I was glad that I wasn't working. I am not too sure how I would have made that happen. But now that I am done, I will have a free schedule until I go back to chemo. So that should be easier. Good Luck, I wish you well. Cheryl",
      "MessageIndex": 149,
      "PostDate": "01/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 10, 2015 11:08AM Beachbum1023 wrote: Lovilynne, Biotene mouthwash, Brach's Lemon Drops for dry mouth, bottled water, popsicles, lip gloss and body lotion, kleenex, Biotin for hair and nails but ask your MO first when you can take it. Oil and/or polish for your nails. Sounds like you are going to be ready, battle on!",
      "MessageIndex": 325,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 10, 2015 12:07PM Beachbum1023 wrote: Biotene is mouthwash and other dental products. It is OTC. Biotin is supplement and found with the vitamins for hair and nails. I usually find it on sale BOGO at Drug Mart.",
      "MessageIndex": 329,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 10, 2015 04:36PM Beachbum1023 wrote: Sorry I forgot one - have you tried frozen seedless grapes? Easy to eat a few at a time, and cold.",
      "MessageIndex": 337,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jun 3, 2015 03:17PM Beachbum1023 wrote: KBeee, wishing you a Happy Birthday, and many more to come for a very long time! Cheryl",
      "MessageIndex": 2014,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 3, 2015 11:56PM Beachbum1023 wrote: KBeee, you are rocking the hair! Love it. And what a great bunch of co-workers, the support is fantastic for you. I hope your trip to the chemo bar will be an easy journey instead of a 911 call.",
      "MessageIndex": 188,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 5, 2015 07:25PM Beachbum1023 wrote: ankledolphin, did you take Claritin for the bone pain? It works for some ladies. I tried it and gave up and went to Tylenol #3 with codeine. They fight here about writing scripts for it, but I couldn't take the aches and pains. I had relief with the codeine. That was the only way I got through it. The last injection for Neulasta with the Taxol, I refused it. I only took half of it, and no pain. If you need pain relief, get it and don't take no for an answer!! I get very annoyed when I need meds for pain and they try to refuse. I have plenty now. Sigh. I hope you feel better!! Cheryl",
      "MessageIndex": 203,
      "PostDate": "05/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 5, 2015 07:27PM Beachbum1023 wrote: KBeee, is it ok to call you egghead?? Love it! What a fun day with the family. The pics are really great. Cheryl",
      "MessageIndex": 204,
      "PostDate": "05/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 6, 2015 11:30AM Beachbum1023 wrote: Hi Allicat, I never took the popsicles with me, just kept a bunch at home. I guzzled water during the infusions and never had mouth issues. I also used Biotene mouthwash, and sucked Brach's lemon drops for the dry mouth. And I'm still doing all that. I can't seem to lose the thirsty or dry mouth. I usually drink about 4 to 5 bottles of water per day! But the popsicles do count as a liquid when the water tastes weird. And I have margarita and pina colada ones, no alcohol. So they cool your mouth and throat, and count as a liquid. They usually have a lot of flavor so helps getting enough liquid.  For chemo I always took yogurt, celery, pretzels, water, mac and cheese for lunch, and bananas. Just small snacks to keep something in my stomach. I always felt better having all the drugs with a snack during the infusion. My worst fear was the nausea, and I never had a problem with vomiting. Never once! But I took my meds, drank a lot of water, and snacked. You just have to find what works for you.  Good Luck. Cheryl",
      "MessageIndex": 209,
      "PostDate": "06/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 30, 2015 03:17PM Beachbum1023 wrote: I had X-rays every Friday to make sure I was aligned for the treatment. Some people gain or lose weight so they correct the alignment if necessary. Sadly, I wasn't the one to lose any weight.",
      "MessageIndex": 5,
      "PostDate": "30/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/830037",
      "Title": "Xrays every five rad treatments....why? cbaird99 TB90"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 8, 2015 06:01PM Beachbum1023 wrote: Hi AmyJM, I don't have that but let's hope that you don't have tongue mets either! I know what you mean, every ache and pain anymore and I think it's everywhere. But relax until Monday, and I hope it's nothing! Dr. Google is not right all the time, thank goodness!",
      "MessageIndex": 1,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828286",
      "Title": "lump in tongue AmyJM"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 15, 2015 04:46PM Beachbum1023 wrote: Fran2014, I too purchased a really lovely but expensive human hair wig, and I love it. When I went to pick it up, they showed me how to wash, blow dry, and flat iron McKenzie. I spend so much time wearing her I thought she needed a name! Kinda like a close freaky sister I never had. I usually wash her every 7 to 10 days it just depends. If you have any questions that I may help with I would be happy to compare the notes. I love my wig, and I get compliments all the time. Makes me wonder how bad my real hair was!! Let me know if I can help. Cheryl",
      "MessageIndex": 477,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 4, 2015 12:04PM Beachbum1023 wrote: Hi Lynne, looks like you have a great backup with you today!! I hope all goes well, and you feel good to enjoy the rest of the day when you are done!! Cheryl",
      "MessageIndex": 1164,
      "PostDate": "04/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Dec 31, 2014 11:16PM Beachbum1023 wrote: Happy New Year! And any more TectonicShift, That is worth a party!",
      "MessageIndex": 21,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/827206",
      "Title": "Help I'm terrified! michelleLg hopefour"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 30, 2015 12:20AM Beachbum1023 wrote: Hi Ginger, I have a new ECHO every three months, and my port is on the left side. I have never had a issue with the ECHO. I find it rather relaxing. The room is darkened, and the techs always answer any questions I have during the test. They usually take about 50 minutes, then I see my Cardiologist right after it. Nice fast results! The port incision is very small, about 1\", and I had no issues with it. I had it done at noon and went home as soon as I was awake. I worked 10 hours the day after. The annoying thing is the seat belt strap in my car. I have a cute small stuffed puppy that rides under my seat belt and keeps it off my port. And he makes me smile, a good thing! Good Luck, you got this! Cheryl",
      "MessageIndex": 102,
      "PostDate": "30/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 6, 2015 11:47AM Beachbum1023 wrote: Hi ankledolphin, The runny nose is from losing the nose hairs, nothing to protect it. I had AC/T, and still have a runny nose. The bloody nose was a nightly thing when I was on Taxol, but that is a rare occurrence these days. I have a large cool mist humidifier, and it helps a lot with breathing issues. So I'll wait and see what happens when summer arrives in humid Ohio. I just hope the Lake winds help me there.  The food was tricky on chemo. Something would sound good until I took a bite, and sometimes one bite and in the trash. Very annoying for sure. But I did well with mac and cheese, yogurt, fresh fruit, canned mandarin oranges, Jell-O, popsicles, whole milk, pudding, chicken, and noodles. Strange menu but the nurses said to eat whatever it took to not drop weight. A big success since I gained almost 20 pounds by the end of chemo. But it is coming off, slow and steady. I did not many restrictions on food, just fresh raspberries, strawberries, and lettuce. They did not want me to eat anything that could not be washed properly or peeled. But I am so glad to eat all of that now. Buy small amounts of food items until you know what works for you. I ate the same things over and over. And pass on the things you love, because you may have a strong reaction to it after chemo. Brings back all of memories from chemo. I thought that idea was bunk until now. I can't gag down mac and cheese or mandarin oranges. I liked to treat myself on the way home from rads to homemade ice cream and homemade hot fudge. But after 33 rads, my thighs are showing it. And I haven't craved it since rads.  I hope this helps, if not let me know. Been there done that! Cheryl",
      "MessageIndex": 211,
      "PostDate": "06/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 6, 2015 11:04PM Beachbum1023 wrote: Hi littleblueflowers, if you made it through the \"you name it\", you are a pro and ready to kick chemo in the butt. Not fun at all, but very doable. And everyone will help you do it. I really have nothing to compare chemo to, it is in a class all by itself. But the side effects are manageable, and it is best to be prepared. What is your treatment plan? You will have a lot of answers to your questions when the others see your post. I finished AC/T 11/25, I can you can. Good Luck! Cheryl",
      "MessageIndex": 226,
      "PostDate": "06/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 7, 2015 12:25AM Beachbum1023 wrote: Hi Karen, I am not sure what chemo you are having but I did want to chime in about the schedule. I always had my chemo on Tuesday morning, and worked 3 to 8. On Wednesday I worked 10 to 8 and had the Neulasta injection at lunch. I was off on Thursday and Friday because the side effects always hit me hard on Thursday and Friday. Then I was back to work for Saturday and Sunday. I know everyone has a different reaction, but my good days were Tuesday afternoon and Wednesday. I just don't want you to have a big surprise. I hope it all works for you. Take Care, Cheryl",
      "MessageIndex": 228,
      "PostDate": "07/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 9, 2015 06:23PM Beachbum1023 wrote: Hi greenae, saw your post, and jumped in. I went to Look Good Feel Better in January, and it was so much fun! The make up kit had all the goodies and more. And it was all name brand stuff. I hope you have a great time. My eye brows and eye lashes never looked so good! Cheryl",
      "MessageIndex": 294,
      "PostDate": "09/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 13, 2015 05:16AM Beachbum1023 wrote: littleblueflowers, your pictures are amazing! It does speak a 1000 words, he's a keeper! And your brother too, awesome!",
      "MessageIndex": 396,
      "PostDate": "13/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 19, 2015 07:11PM Beachbum1023 wrote: windingshores, take a deep breath and try to relax. It will help with the anxiety. You need to get all the info in front of you to see what you are really dealing with. Our heads will go to that dark place when we don't know, and so we panic. Once that sets in, it is hard to get the train on the track. You need to have your head on, gather up some close family and friends, and game on! Take someone you trust to the appointment so you gather all of the info. Record your appointments with your smart phone. Make notes so you can ask questions. The timing is slow, we all hurry up to wait for those appointments, and then hurry up to wait for the results, and on it goes. We all feel better when we control the process and the people. Look through the boards, there are excellent threads to answer some questions, but also to suggest what to ask the Doctors. Please remember that knowledge is power, and power will give you some control. Now is the time to be ready, ask all the questions, look at the info on the boards and be prepared when you see the Doctors. You can do this, it is amazing what one can do when the time is now to do it. Please visit us often, we all help each other get through this. Take Care.",
      "MessageIndex": 2,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/828649",
      "Title": "So helpful to read others have panic attacks windingshores farmerlucy"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 9, 2015 03:36PM Beachbum1023 wrote: Hi Ladies, I really have a hard time wrapping my head around the numbers. I am just going to live, and not over think the % of survivors. I am triple negative, Stage IV. I really don't need an expiration date, it will be no matter the numbers. I am trying to have 5 great years. I would rather have the months in the early years, I have zero desire to add more time at the end. If I do it right, I will wear myself out and just leave what is left for the end.........",
      "MessageIndex": 4,
      "PostDate": "09/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830282",
      "Title": "15 -20% 5 year survival rate..huh? LeeLee38 JeninMichigan"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 6, 2015 09:48PM Beachbum1023 wrote: Good afternoon everyone, I have decided to donate my triple negative cancer body to the Cleveland Clinic donation program to train our future Doctors and hopefully be a part of a much needed cure for triple negative BC. They will use what they need and then cremate the remains to be returned to the family or laid to rest with all of the other donations in the crypt in their Mausoleum at the Lake View Cemetery. And better yet it is all free to me. That leaves me to spend the money I have on me and not leave it for anyone :) That way when I check out I will hopefully do some good, and I will still be close to the Lake with a view. I told my brother I had my arrangements made, and no worries for anyone. I told him to have a party, and I will rest in peace forever. He would have to pay for the party :) If I plan it right, the last check I write will bounce! I did that on purpose, I want to be close enough to haunt them for eternity!",
      "MessageIndex": 336,
      "PostDate": "06/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 9, 2015 06:15PM Beachbum1023 wrote: Trvler - visit chemocare.com they have all of the drugs on the site and they list all of the side effects. Some drugs you have to go to the manufacturer to get the rest of the uncommon side effects. But Taxotere can cause permanent hair loss. I rolled the dice with Adriamycin and I \"won\" the permanent heart damage from it. Another uncommon side effect that 10% or less of the patients have. I think they need to let the patients know that it could cause permanent side effects. Tough to decide when you know what may happen. Instead of what the MO tells you. Seems unfair. I also \"won\" tumor growth from Taxol. I cannot have either one again because of the \"fail\" and I am at lifetime dose. Sucks being triple negative as well for me. I have so few options for treatment to begin with. Do the research, it is all about you!",
      "MessageIndex": 10,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829226",
      "Title": "Overwhelming yet trying to be positive - a new reality Meme117 Trvler"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 22, 2015 03:42AM Beachbum1023 wrote: Lmonelli, well first you need to relax and breathe, then gain some control. You will feel better looking at the info with a clear head. There are a lot of threads here that you can read. Stay away from Dr. Google, most of the info there is outdated, or just wrong. I had a mastectomy, chemo, and just finished rads. Do you have to go to chemo, if so which one? What order for the treatment? Check out the threads, and post any questions that you have from them. You will have your answers, the Ladies here are great about sharing and helping. Take Care!",
      "MessageIndex": 1,
      "PostDate": "22/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829742",
      "Title": "Diagnosed yesterday with IDC Lmonelli Holeinone"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 21, 2015 12:01AM Beachbum1023 wrote: Hi Ladies, I got the info, but no real need to hurry. Take a breath and relax, this is a big decision and you don't wants regrets later. The mastectomy was super easy, very little pain, the drains while annoying were easy as well. The drain removal was so over blown, it was like a little tickle. Not having a shower was way worse! I had a larger tumor and chest wall attachment so I am now doing rads. The only pain is going every day. No big deal I have had sunburns worse than this. Poison ivy is more annoying than rads to me. So while we all have to make choices between treatments within the recommended protocols, we all do it. I haven't decided on reconstruction yet, but right now I will probably pass on it. The cost is limiting, the recovery time and surgery time is long and complicated to me. And at the end of the day, once I got it out of my head, I don't think I care to do it. I am just trying to get through the rads and see where I go next.",
      "MessageIndex": 5,
      "PostDate": "21/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828703",
      "Title": "Got more info; need to hurry?! Lumpectomy or Mastectomy? windingshores msphil"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 18, 2015 10:42PM Beachbum1023 wrote: Mandy, I am so very sorry to hear of your dear Mother's passing. I am new here to Stage IV, but I have seen so many posts about your Mom and the love and concern shown by the wonderful ladies here. They wrote of her often, and she will be deeply missed by everyone here. I too shall walk the same road, my journey will end the same way. But I know that many wonderful ladies have walked before me and they will be there to meet me one day. I hope to stand among them, surrounded by love, and find guidance from your dear Mother Raro. I hope that you will one day have peace in your heart, and know that your Mother will again be circled by her friends. Take Care",
      "MessageIndex": 2,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828643",
      "Title": "My Mother raro stagefree"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 7, 2015 02:10PM Beachbum1023 wrote: Welcome meme, I am so glad that you are here, the ladies are amazing, and will be a constant source of support for you. I am not a Facebook user, and I told the people that needed to know on a need to know basis. I try to keep some area of my life cancer free. I have been doing cancer since last June 9th, so it's been quite the ride. But my happy place is the Lake and the Beach so that is my free zone. I'm just waiting for the Lake to thaw to get back to my happy place! There are many ways to deal with everything here, there are threads for side effects, hair issues, chemo, and rads to name a few. I post on many different threads. Let us know how you are, and ask questions you will see a lot of new friends drop in to welcome you and help you.",
      "MessageIndex": 2,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829226",
      "Title": "Overwhelming yet trying to be positive - a new reality Meme117 Trvler"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 29, 2015 01:19PM Beachbum1023 wrote: bellajenn, wishing you a great report!! I hope you are comfortable, and resting to heal soon. Take Care, Cheryl",
      "MessageIndex": 32,
      "PostDate": "29/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830563",
      "Title": "Military Wife Waiting For Results bellajenn bellajenn"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jul 9, 2015 01:38PM Beachbum1023 wrote: tshire, try to deal with what you know 100%, and don't look for the what if. You have plenty to deal with. Ask the surgeon for their advice and let them guide you. Everyone here can second guess, and let their mind go \"there\", but don't. And we are all scared, but knowledge is power, and the more control you have the better. Do you have a treatment plan yet? And you are not crazy, just try to relax, and catch your thoughts. I wish you well. Cheryl",
      "MessageIndex": 61,
      "PostDate": "09/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 7, 2015 02:41PM Beachbum1023 wrote: Chloesmom, tap tap tap following you with my happy dance. Congratulations!",
      "MessageIndex": 24,
      "PostDate": "07/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/830231",
      "Title": "Chemo scares me more than the disease AnewBeginning lcm123"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 22, 2015 10:27AM Beachbum1023 wrote: GatorGal, I hope you have a great time visiting, and I hope you come back refreshed. Safe travels. Cheryl",
      "MessageIndex": 2,
      "PostDate": "22/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829761",
      "Title": "Taking a Short Break GatorGal Moderators"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 19, 2015 12:40AM Beachbum1023 wrote: Allyme, I take Biotin and my hair is growing back really thick and soft. It is over an inch long and very full. My chemo nurses suggested it. I am sorry that you are having a difficult time with your family. Faith is inside our heads and our hearts, not inside a building of brick and stone. Medical treatments are. But that doesn't mean that one is better than the other, or that one can stand alone. BC is a wicked disease, and tries the best of us daily. We need to attack it from any and every angle that we have available. The faith and love that your parents have is very powerful to them. But with BC we need everything we can find to stomp it out. Perhaps when you combine your treatments with your parents faith you will all be able to find peace and results! I wish you well, and I hope this resolves for you soon.",
      "MessageIndex": 3,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829662",
      "Title": "Don't know what to say! Allyme Allyme"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 14, 2015 01:12AM Beachbum1023 wrote: Hello Jacques, I am so very sorry for your loss. Cheryl",
      "MessageIndex": 23,
      "PostDate": "14/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828448",
      "Title": "Heartbreaking News - Diana Payne solange49 dlb823"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 18, 2015 12:39PM Beachbum1023 wrote: Windingshores, I think that trusting your team is important no matter who chooses. You have to like them and trust them with your life. I have 16 Doctors on my team. While I see a few on a regular basis, the other specialists are available to me anytime I need them. I prefer that team simply because I have constant \"second\" opinions for treatment, and I can change the plan if needed. On three separate occasions my case has been presented to the Tumor Board, and I am confident that they have developed a working plan for me. Once you have all of the info, you will be able to move forward and feel confident that all of the Doctors have a plan for the best outcome. Good Luck, I hope the waiting goes by quickly!",
      "MessageIndex": 9,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/828594",
      "Title": "question about which MD will be first windingshores"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 8, 2015 01:23PM Beachbum1023 wrote: Good morning The Divine Mrs. M, I actually grew up in Richville, a tiny nothing by Navarre and Massillon. But I love to live on the Lake. There is so much to see here. The Emerald Necklace is something to see. The parks circle Cleveland and have so much to offer. Beautiful parks with miles of trails, and something different at each park. There are waterfalls, Indian carvings, caves, deer and abundant wildlife to watch. Mentor Headlands has natural sand dunes, and little mountain. But the wine festival at Geneva on the Lake will be so much fun. The town is very nice and looks like a time warp. Medina is also nice to visit with nice shops and good restaurants to visit. I like to go to Vermilion to visit the small shops and it has some very fun festivals in the summer. The Wooley Bear festival is a huge local event hosted by Dick Goddard from channel 8. For a fun evening try Blossom, it is the summer home of the Cleveland Orchestra, a true international gem. I love to sit in the grass with a picnic and enjoy the Orchestra. Playhouse Square offers wonderful entertainment, and has been a favorite of mine. I saw Momma Mia, Tommy, Jesus Christ Superstar, Camelot, and the Mexican Ballet there. They have so much to offer. Another favorite of mine is the Walleye Drop on News Years Eve in Port Clinton. A very fun street party to ring in the New Year. And yes it is outside, but like no other in freezing Ohio! Well enough about all that. If you want to know anything else, let me know. There are still so many things I just want to see here, I guess they belong on my to do list. But I do want to zip line! This summer is looking to be busy, I hope to get back to NY to visit the wineries, Bully Hill is a favorite, and I loved Corning. I hope to get a much needed break after rads to get on with my list of must do. I have 18 to go, then I can check it off. Seems like a long way.............. I'll let you know what else I add to my to do list!   ",
      "MessageIndex": 43,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828214",
      "Title": "Bucket List- what did you include? Maureen813 Maureen813"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 20, 2015 12:01PM Beachbum1023 wrote: lemonadehk, I also had DD AC/T, finished 11/25. Did you have a baseline heart ECHO before AC started? What is the EF%? I have the shortness of breathe and a dry cough. Please mention it to the MO before the next AC. While heart damage is a uncommon side effect, it is for real and can be permanent. If you have any questions that I may be able to answer, feel free to PM me. Cheryl",
      "MessageIndex": 2,
      "PostDate": "20/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/830587",
      "Title": "AC-T and shortness of breath! Very worried... lemonadehk Trvler"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Dec 27, 2014 09:01PM Beachbum1023 wrote: Michelle, Do yourself a big favor, and keep looking forward. We all have the what if moments! I just had surgery and was disappointed that the reconstruction could not be done at the end of my surgery. Now I'm leaning toward moving forward without it. It could be a blessing for me. I have learned to pick my battles wisely! And it's okay to be scared, we all are at one time or another. My tumor was 9x9 and now its gone. I'm thankful for that! I was scared when I thought I had a problem. I was confused when I was sent to the Cancer Center, and then I got mad. When I knew what I was looking at, I was very sad and I had every emotion you could think of. Then I decided to be in it to win it! Now I don't try to look back, second guess my choices, and I put a lot of faith and trust in my Care Team. That was 6 months ago! Good Luck! I hope you have a very speedy recovery!",
      "MessageIndex": 8,
      "PostDate": "27/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/827206",
      "Title": "Help I'm terrified! michelleLg hopefour"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 20, 2015 10:58PM Beachbum1023 wrote: Good evening Ladies, contact the American Cancer Society. They may be able to help you. They have a lot of different programs that offer assistance. How about trying personal fund raising? Many local restaurants and national chains are very generous with fund raisers. How about a trying to publish a cook book to raise funds and keep that budding chef on track. Ask at the school and see if they have any resources available. Does she really have to put class on hold for now? Many people work during treatment, school may be a calming influence and keep it normal. I would try to find some other living arrangements, toxic is just plain wrong. Have you asked for assistance through the cancer clinic or her doctors and nurses? Or perhaps another patient could use a roomie until health returns. Do you Facebook? I guess I would turn over every rock, open every door, there are answers out there. I know for myself that the resources are there, it's the finding them that is not easy. But I always ask my social workers, and somehow I find a way..............Good Luck!",
      "MessageIndex": 2,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828714",
      "Title": "Just Diagnosed / 32 yrs Young Girlfriend Facing Breast Cancer leafuponleaf bride"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 7, 2015 02:55PM Beachbum1023 wrote: iGoldenGirls, I am so happy that your Mother is doing well. I'll \"unpin\" the voodoo. With cancer I think it's better to try anything.........including big smiles and good voodoo! Have a great evening filled with hugs and laughter. Cheryl",
      "MessageIndex": 14,
      "PostDate": "07/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829878",
      "Title": "Ever have pain you were sure was progression turn out not to be? GoldenGirls LindaE54"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 11, 2015 12:46AM Beachbum1023 wrote: Hi Lotusblossom, Thank You for telling your story. I so want to be like you, Stage 4 and living life! I have a lot of living to do yet, places to go, and hearts to break before I leave this earth. :) I am waiting to start rads or chemo, depends on the decision of the Tumor Board on Tuesday. So I feel really good right now, so I hope the rads then chemo. I would prefer to skip it all and be cured, but I'm just making lemonade out of all of these lemons. Have a peaceful weekend!",
      "MessageIndex": 972,
      "PostDate": "11/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 23, 2015 06:10PM Beachbum1023 wrote: Hi Smiley, I do not have any history with that yet, but I am finishing rads now. I will be seeing the MO after I finish rads, and probably back to chemo. I cannot do any Adriamycin or Taxanes. I have heart damage from the Adriamycin, and my tumor grew back quickly on Taxol. But being triple negative, it will be challenging.",
      "MessageIndex": 989,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 9, 2015 04:54PM Beachbum1023 wrote: Bosco - wishing you all the luck I have! Sending lots of well wishing hugs also. Keep us posted.",
      "MessageIndex": 1029,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 18, 2015 08:57AM Beachbum1023 wrote: Good morning Spirit, good luck on the biopsy! I hope the lymph nodes are working like crazy for you. And the shrink is fantastic. Take Care.",
      "MessageIndex": 1040,
      "PostDate": "18/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 14, 2015 05:25AM Beachbum1023 wrote: StefLove - the wait is the worst. Everyone here has been there, but as soon as you know what it is things will change for the better! It is nothing until it is something, then you can go forward. You will find a lot of support here, you won't ever be alone here! Let us know how it goes! Good Luck, I hope you have a peaceful weekend.",
      "MessageIndex": 3,
      "PostDate": "14/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829464",
      "Title": "Can't Stop Worrying, 35yo 3cm mass StefLove mommy2lilfi"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 3, 2015 09:48AM Beachbum1023 wrote: Hello Eleanorebelle, I am so very sorry for your loss. But I am concerned about you right now. I hope you find a Doctor to help sort all of this out for you. You need straight answers to your concerns. I hope you find the cause soon so you can relax a bit. Take care.",
      "MessageIndex": 6,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828085",
      "Title": "Stillbirth and possible BC? Advice please! Eleanorebelle coraleliz"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 22, 2015 02:39PM Beachbum1023 wrote: BarbDenise64, Party like it's 1999! That rocks 2 months off and no spread, BIG celebration for that one. Congratulations, enjoy every day.",
      "MessageIndex": 981,
      "PostDate": "22/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 11, 2015 08:36PM Beachbum1023 wrote: Hi lbgal, you can post here, this is triple negative. I post in a lot of different forums also. I hope you are well.",
      "MessageIndex": 986,
      "PostDate": "11/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Sep 3, 2015 09:16AM Beachbum1023 wrote: Good morning Ladies, I have a human hair wig that I wore when I lost my hair during AC/T. I found stretchy caps at Sally's that worked out great! I had several of them so I could wear a fresh one every day, and just hand washed them. They actually held the wig in place and I never had a problem. They kept my wig cap clean as well. Human hair wigs are quite expensive so I had to make it last, and it still looks great 13 months later. And my hair has grown back really thick and wavy. Now to color the dark gray and silver! But so thankful to have that choice. I also take Biotin every morning and my nails have never looked better. My MO suggested that I start it at the end of Taxol to speed up the hair growth and nail repair. Cheap fix and it worked wonders for me. My new obsession is glitter nail polish! Happy Holiday! Cheryl",
      "MessageIndex": 1165,
      "PostDate": "03/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Sep 26, 2015 02:03PM Beachbum1023 wrote: TexasRose, great news, I hope I hear the same! Cheryl",
      "MessageIndex": 1196,
      "PostDate": "26/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 5, 2015 02:13PM Beachbum1023 wrote: Hi Susanne, sorry for all that anxiety and heart issues. I made it through rads, but I have permanent heart damage from Adriamycin. I have low blood pressure, shortness of breath, and a dry cough. I have a new ECHO every 3 months to watch what is going on. Thank you chemo. My friend had serious issues from rads, but they weren't too worried until she landed in the hospital with all of the damage and side effects.  Keep pushing to get the care you need, it is all very real. No wonder we are \"anxious\". Good Luck! Cheryl",
      "MessageIndex": 2,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/831037",
      "Title": "Heart problems after Radiation Susanne123 Astarte"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 6, 2015 04:07PM Beachbum1023 wrote: hi Bama, I hope you are having a good afternoon! What can we do to help?? Everyone here will step up to answer whatever questions you may have. What chemo are you on? I had AC/T then surgery. I just finished rads #10 today. But not about me, but I have disc issues in my lower back and neck. They are from years ago when I was at the farm and chasing horses, cows, and goats! I think throwing all the hay bales into the loft may have helped the injury also, and a car wreck. But try to separate the pains and side effects so you can explain the symptoms to the Doctors. It's good to be able to say when it started just in case its from the chemo or meds. I always keep a spiral notebook with my daily meds, food and water intake, and any issues or side effects. Not sure if that works for you, you have your hands full. Take care, I hope you feel well, and let's us know how we can help you! Just ask!",
      "MessageIndex": 25,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/827665",
      "Title": "32 and diagnosed yesterday bama351 farmerlucy"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 6, 2015 08:38AM Beachbum1023 wrote: Good morning TheDivineMrsM, I hope you get to all those things, and many more. I live close to Ohio Amish country, and there are some great home cooking restaurants that make the best chicken and noodles ever! I used to raise meat chickens and I had the Amish butcher them for me, and over the years we were friendly. I was invited into their home, and the simplicity of their life is compelling to me. I love the hand hewn dark walnut floors they had throughout the house. Simple yet stunning! They harvested the trees from their property, and used the lumber for flooring and trim. I have reduce, reuse, and recycle on my list. BC is consuming, so I would rather spend the time doing other things and not leave a ton of stuff for someone to clean up after the fact. So affairs in order while necessary, is on the bottom of the list. I would love to take a road trip this fall to see all of the glorious colors, and visit small town America while I can. I'll keep the local things for later.",
      "MessageIndex": 16,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828214",
      "Title": "Bucket List- what did you include? Maureen813 Maureen813"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 6, 2015 11:43AM Beachbum1023 wrote: dlb823, Have you tried cross country skiing, or snowshoes? I cross country ski just because I have a bunch of old fractures from other things I used to do. The thought of downhill anything is a bit scary at my age. But cruising along the trail is very relaxing and a great workout!",
      "MessageIndex": 21,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828214",
      "Title": "Bucket List- what did you include? Maureen813 Maureen813"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 3, 2015 06:44PM Beachbum1023 wrote: Good Luck tomorrow, mine was over before I knew it, and no pain at all.",
      "MessageIndex": 1,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828164",
      "Title": "Biopsy tomorrow! BodhisattvaNH Trvler"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 3, 2015 11:34PM Beachbum1023 wrote: Hello Tbryer, welcome to the club, the club no one wants to join. You will find that we are never alone here. And you will meet the most amazing ladies ever. I was wondering what chemo you have had, and what is next. You can edit your profile to add the info so we can all address your questions and concerns with helpful responses. There are many other threads that may interest you as well. I post on numerous threads, and many other ladies do as well. We always go forward, and you will too. I am Stage IV, but that is only a number to me. And there ain't no 5! So I am kicking butt to do whatever it takes. So what can we do to help you? ",
      "MessageIndex": 1011,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 4, 2015 12:29AM Beachbum1023 wrote: Welcome SpiritBlessing, look through all of the active topics and see what will interest you. You can read through them, and join in where you feel comfortable. I have met the most amazing ladies here. They are so helpful and kind. It is nice to offer experience to the newbies along the way. I hope you enjoy the threads as much as I do. Cheryl",
      "MessageIndex": 1013,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 10, 2015 05:53PM Beachbum1023 wrote: Bosco, Great news! I am so happy for you. Keep us posted!",
      "MessageIndex": 1035,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 10, 2015 01:33AM Beachbum1023 wrote: Happy Mother's Day! Enjoy your day Ladies! ",
      "MessageIndex": 1064,
      "PostDate": "10/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 10, 2015 11:15AM Beachbum1023 wrote: lotusblossom, Thank You and congratulations! I am so happy for you to be NED. You have shared far more than than hope, you have shared the possible. That makes my heart sing. Enjoy this glorious day. Cheryl",
      "MessageIndex": 1067,
      "PostDate": "10/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 10, 2015 02:57AM Beachbum1023 wrote: I go to a new location so it is bright with huge windows over looking the woods and a pond. The recliners are purple, and we have cable TV, and the nurses are the best ever. We have a lot of fun, we wear Tiaras on Tuesday infusion day, crazy socks for Halloween, and festive beads for St. Pat's. Christmas was festive, and I am working on their Easter Basket! They are not only concerned about our time there as a patient, they really make the effort to have fun, be kind and compassionate, but they know us as people first. We have snacks and juice, and a microwave to heat our lunches. They also had a nice small collection of books, magazines, and BC info. Local churches also make quilts for every new patient, and others knit lovely hats to keep our heads warm. The support staff are so helpful, and keep us straight on appointments and orders. It is the best part of my journey, I can't say enough about the level of care I receive there.",
      "MessageIndex": 7,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829315",
      "Title": "Your Chemo Room - please describe Meme117 Mommato3"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 15, 2015 05:39PM Beachbum1023 wrote: Maureen, I wish you the best!! I am sending you a bottomless basket of hugs, use as needed! Take Care, Cheryl",
      "MessageIndex": 37,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830424",
      "Title": "In my pocket Maureen813 Maureen813"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "May 13, 2015 10:38PM Beachbum1023 wrote: bellajenn, check with the BS, they put me in a surgical bra after my mastectomy. And they also wrote scripts for bras. Check your insurance I get 4 per year. I just started wearing sports bras since I finished rads 7 weeks ago. I had swelling so I was told to only wear one when I had too. Good for me! Good Luck! Cheryl",
      "MessageIndex": 18,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830563",
      "Title": "Military Wife Waiting For Results bellajenn bellajenn"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 19, 2015 01:53PM Beachbum1023 wrote: Bellajenn, I am so sorry that you have to deal with all of this. I hope everything goes well for you and your husband.  I also want to say Thank You to you and your husband for your service to those of us that enjoy the freedoms that our military personnel and their families provide to all of us. I feel that all of our military personnel cannot be thanked enough. I hope you find the others here that can support you and your family with your unique situation. Cheryl",
      "MessageIndex": 4,
      "PostDate": "19/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830563",
      "Title": "Military Wife Waiting For Results bellajenn bellajenn"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 22, 2015 07:52PM Beachbum1023 wrote: Hi Karla, I am so sorry that you are facing so many difficult challenges! But the hurry and wait is not uncommon. We have all been there. So let's take a breath and try to relax a little. I go with its nothing until it is something. I think they are being very diligent with your history. I would welcome the second look just to be sure. I am always happy when they take my case to the Tumor Board for multiple opinions to justify the treatment plan. Refreshing that they are taking the second look seriously for you. I hope you can have a pleasant evening! Visit the threads, you will find a lot of support from the wonderful ladies here. Take Care and let us know how things go for you. Cheryl",
      "MessageIndex": 1,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828762",
      "Title": "additional slides ordered Karla98664 Trvler"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Dec 27, 2014 04:16AM Beachbum1023 wrote: Hello everyone, I hope everyone has been able to enjoy the Holiday Season! I just had my surgery on December 15, 2014 and I had my drains removed this morning. I just wanted to share a few tips for feeling better. I packed my warm robe and slippers for the hospital, a wrap style robe worked well with the drains. I took my faux mink throw to cover up when I sat in my recliner to read and have my meals. I took plenty to read, mouthwash for dry mouth, lemon drops and lip gloss. And plenty of body lotion to rub on my dry skin. I was very fortunate to have very little pain, and I felt great when I woke up in recovery. I made sure I warned them that I always feel sick after surgery so they made sure I had plenty of meds. I think the best advice I got was from my chemo nurses. Drink a lot of water, all day every day and my attitude is the most important part of this journey. While not every day is good, it is what we make it. So we all laugh, and we all cry, just some days we do it at the same time! And it feels great to be here to do it another day. Good luck to you all, I hope we all have a healthy and happy New Year!",
      "MessageIndex": 294,
      "PostDate": "27/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 25, 2015 05:06AM Beachbum1023 wrote: Good evening Soldier, you have just entered the waiting zone. We have all been there, and for the most are still in it. I hurry up and wait for reports, tests, scans, appointments, but it is very necessary to get through it. You have a lot of control of your life and all of a sudden you are not in control, you don't have answers. But you need those answers to gain control again. And you will, we all do and we all make it. I was very focused on work, and just fit it all in to make it all happen. I am single, 58, and live alone so I had to focus and it kept me busy. Don't cancel, take care of yourself and everything will fit together again. Let us know how you are!",
      "MessageIndex": 9,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828851",
      "Title": "Reassurance please soldieron Beachbum1023"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Jan 4, 2015 08:03AM Beachbum1023 wrote: Hi Trstra, stay positive, its nothing until you know! Attitude and a positive outlook matters. Good Luck with the biopsy, mine was painless, and quick. As everyone here will tell you, it is the waiting that really sucks.",
      "MessageIndex": 8,
      "PostDate": "04/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827140",
      "Title": "Abnormal mammo, awaiting biopsy lovelynurse81 lovelynurse81"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Aug 15, 2015 10:42AM Beachbum1023 wrote: tshire, I wanted to pass and live out my days, but calmed down and decided to make a huge run at it with everything in the tool box. I did DD AC/T, then a mastectomy, and rads. Over one year later I am back to work, and no scans until after Labor Day. It does suck, but I never wanted to regret my choice just in case. I've done it all, and my only thing left is chemo again since I am triple negative.  We are all lost at some point, but knowledge is power, and the choices are yours to make. Do it for you, and you will feel better that you had the option to make the choice and go at it. I went the fearless badass approach. So game on! We have your back. Cheryl",
      "MessageIndex": 101,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 8, 2015 12:46AM Beachbum1023 wrote: good morning all, I did not use cold caps. They are not offered at the hospital I chose for my chemo infusions, seemed liked a lot of work, and I wanted a real hair wig. I had it made to match my real hair, they matched my color roots and all, and the cost for it was no different than if I had my hair. I only had to wash and style it once a week, it was a custom fit so very comfortable and soft, and it looked better than my hair. I had a lot of compliments on it. I have been wearing her since the second week of August '14. And it looks great. It just seemed like a lot to deal with, and the cost was too much for me to consider it. And going through AC/T was enough!",
      "MessageIndex": 28,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/828260",
      "Title": "Anyone choose NOT to use 'cold caps'? rleepac sbelizabeth"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Feb 16, 2015 05:55PM Beachbum1023 wrote: bama351, hang in there, proactive on the side effects is good! Drink plenty of water to stay hydrated, and eat small meals and/or snacks to keep that tummy happy. I always felt better with a little something to snack on. Let us know if we can help.",
      "MessageIndex": 33,
      "PostDate": "16/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/827665",
      "Title": "32 and diagnosed yesterday bama351 farmerlucy"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Apr 15, 2015 03:58PM Beachbum1023 wrote: Hi Ladies, I just dropped in to let you know the waiting is the worst. But after waiting for many things over the last 10 months, I have learned that patience is a virtue, and I try to enjoy the wait. For me it is nothing until it is something, and I can enjoy the denial in peace :) Worry and anxiety will make a bumpy road, and make it too stressful. And it may be a lot of worry for nothing!  It is Spring, enjoy the sun, walk the beach, or plant some flowers. Take the kids to the park or enjoy a long walk, just do it! I hope you all have great results - when you get them!",
      "MessageIndex": 4,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830462",
      "Title": "Just Waiting... JGO JGO"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 6, 2015 04:07PM Beachbum1023 wrote: debiann, I had chemo, mastectomy, and finishing rads boosts, 4 more to go. The tumor was close to the chest wall so no option other than refusal for the radiation. And the skin burns are very real. They say it heals quickly. Take Care!",
      "MessageIndex": 13,
      "PostDate": "06/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829187",
      "Title": "Just diagnosed and confused over many decisions Suzannecarol keepthefaith"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 26, 2015 10:56AM Beachbum1023 wrote: Allyme, since we are both Stave IV, it is easy to go to the dark place in our heads. But I was told that my tumor is chronic, and treatable. So while I am still the same stage, it is treatable and chronic, not a death sentence like the dark place tells us. I try to wrap my head around that, the what is next, and how is the treatment working. I try to focus on the good side, not the negative side. If I woke up every day looking at the dying side of this, I am sure my attitude would plummet. All we do at this point is go to battle, and you know how to fight the unseen, fight the unwanted, and fight what wants to stop you. I try to break it down and fight each battle as my way to win the war. Sooner or later we celebrate the victories, we regroup and make our move. You know we never fight alone here, so let's get those cancer killing butt kicking boots on and make the plan to win the next battle! You got this! ",
      "MessageIndex": 22,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829909",
      "Title": "A rant about life Allyme Allyme"
    },
    {
      "AuthorID": "Beachbum102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209350/profile",
      "Content": "Mar 19, 2015 01:26PM Beachbum1023 wrote: Hi Bizzyd, sorry you are here, but Welcome to a fantastic group! Everyone will help you, just ask and you will find the help you need. As far as telling people, I had a mixed bag. The people I thought would step up have sat down, and others have jumped on the bus and ride in the front seat. It's hard to say what they will do. Some you can tell on a need to know basis, some you won't tell at all. It depends on how you feel about it. It really is your decision who to tell, when to tell, and how much to tell. Take someone with you to the appointments, nice to have extra ears. They will hear what you don't hear. They can take notes, and organize questions and answers. You will receive a lot of important info, keep copies of all of your tests and appointments. Put a notebook in your purse and take it with you. Handy to have to write down anything you think of. You will have a lot of info coming at you, but it will all fall together, and you will feel so much better when you know. You have time to decide so don't rush it. Take care of you first, now is not the time to worry about others, be selfish. Relax, organize what you do know, and then decide. Come here often, we are all here for you, we get it. Take Care! ",
      "MessageIndex": 4,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829677",
      "Title": "Advice on telling others? bizzyd etnasgrl"
    }
  ]
}