{
  "AuthorID": "bearcub",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
  "Posts": [
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Mar 21, 2013 04:37PM bearcub wrote: Scarlett I am so happy for your wonderful news!!",
      "MessageIndex": 39,
      "PostDate": "21/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801769",
      "Title": "Core Needle Biopsy tomorrow and trying not to panic scarlettm512 bearcub"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 27, 2014 11:39PM bearcub wrote: I had my last AC on November 5, 2012...I had enough hair 16 weeks after to feel comfortable without hats, scarves ect..I never did wear a wig. I was rocking the pixie...good luck on your hair growth, it feels like forever but it will come back..",
      "MessageIndex": 37,
      "PostDate": "27/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826475",
      "Title": "Hair growth after AC Akevia Akevia"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 13, 2012 10:38PM bearcub wrote: I am so sorry you have this stress on the 24/7 tape you probably have playing through your head this weekend. We have all been where you are, it's horrible, but what would be worse was not finding the lump and the other signs. Try to enjoy the weekend with the family. I am glad you are seeing the doctor on Tuesday, make sure you demand the mammogram, do not let them do a lets wait and see thing!.... Congrats on your new life, it is obvious you are a very strong women, all the best!",
      "MessageIndex": 9,
      "PostDate": "13/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794900",
      "Title": "Freaking out. :( HateThis cheryl1946"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 16, 2012 07:43PM bearcub wrote: Hate this, I am so happy for you!!....enjoy the day!!......go back in 6 months for sure...",
      "MessageIndex": 23,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794900",
      "Title": "Freaking out. :( HateThis cheryl1946"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jun 12, 2013 11:00PM bearcub wrote: Congratulations, that is wonderful news..",
      "MessageIndex": 18,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/806012",
      "Title": "In shock for a different reason - PREGNANT! Letlet kathleen1966"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 8, 2012 10:04AM bearcub wrote: Bump",
      "MessageIndex": 968,
      "PostDate": "08/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 9, 2012 11:08PM bearcub wrote: Bumpy, bump",
      "MessageIndex": 973,
      "PostDate": "09/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Mar 7, 2015 06:57AM bearcub wrote: Was DX in 2012 at 54",
      "MessageIndex": 392,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 2, 2012 09:22PM bearcub wrote: Edithester. I am so happy things have worked out with you and your family, it must ba a huge weight off your shoulders. We are here for you as you move forward with your journey. Lesley, I am so happy for your clear scan, you go girl!",
      "MessageIndex": 78,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 7, 2012 10:16AM bearcub wrote: Welcome KRCorett! Sorry you are here, but you are at the right place! These Ladies have helped me more than anything so far through my process. They ate a wealth of knowledge and support, good luck!",
      "MessageIndex": 132,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 19, 2012 09:58AM bearcub wrote: Lesley, I love what you said in your last two posts. Thank you",
      "MessageIndex": 259,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 21, 2012 07:10PM bearcub wrote: Edith wow that was brave moving from one hospital to another with those wires in, I was frightened just crossing the hall, mind you they put a paper cup over them and I kinda looked like I was wearing one of those weird Madonna bras! So happy for you it went so well, happy healing!...I still have blue on my boob!",
      "MessageIndex": 293,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 28, 2012 01:14PM bearcub wrote: Crystal the pathologist found mine on a routine mammogram. Was called back 2 days later, they got me right in for a repeat and an ultrasound. They pretty much told me a few days later at the doctors that it was picture perfect BC. It totally blindsided me, no real BC history, a aunt had it 30 years previous but lived another 30 yrs and did not die from it...I sure hope you get a biopsy result that is negative for BC. Benny I also had waist long hair, it was sad to have to cut it short but I was glad I did about a month before I lost it from chemo. It was a bit less traumatic, I now have hair envy though, whenever I see pretty long hair. The one thing I learned was short hair is so easy to care for. Oh well I only have 2 more rounds of Chemo so I can start growing it back in November, and maybe by summer it will feel like chemo is behind me and I will have a cute short do. To those who have had surgery The one thing that you need to watch for is LE, Lymphedema, swelling of the arm that nodes were taking out of. Do all the exercises your surgeon mentioned and ask your surgeon about it. Never let a nurse or anyone take your BP, IV, or any needles in the arm that had the nodes removed. Just thought I would mention it as it was brought to my attention on another thread. Edith will you be doing chemo?... Have a fun weekend everyone!",
      "MessageIndex": 323,
      "PostDate": "28/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 4, 2012 10:51AM bearcub wrote: Benny it could be a bit of fluid buildup or just part of the healing process. 2 weeks after my surgery DH and I went on a week vacation and on the way home mine also felt like that. It did slowly ease up over several weeks. When I did see the surgeon she thought it was fluid drying up??...also pain in the ribs that went away. I thought maybe it had something to do with a doctor or nurse elbowing or leaning into me during surgery??...your pain will go away please try and not worry. Do talk to your doctors about it on the 10 or try and move the appt. up like NSJ2 suggested. If it is an infection they may want to get you on antibiotics. I am praying for a great path report for you. I feel terrible for the barn owner whose wife passed so quickly. She must have caught it so late she had extensive spread to her abdomen or she died from some uncontrolled infection. So sad......hang in there Benny, enjoy Diamond today.",
      "MessageIndex": 355,
      "PostDate": "04/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 11, 2012 09:14PM bearcub wrote: Benny, I am glad you got your pathology back, looks like your nodes did the job of grabbing those loose cancer cells. Now you can get on with more surgery if required, chemo and rads?? Make sure you get a copy of the report. Benny, you can try Paula young.com for a wig that will get you through a few months if you prefer a wigs. You can also check out head covers.com also for scarves and wigs but be prepared with them to pay extra for duty at the border. About 20 dollars an order, so if you order from them get everything you may want in 1 order....all in all they both are very reasonably priced. Lesley is right, I am usually tired the first week after chemo but still manage most days to ride 16 km. a day on my stationary bike....I try to do it 5 days a week. I also walk my dog outside. You may be one of those people that have minimum SE. I have been very lucky that way. I am sure on your good days you will still be out on Diamond...",
      "MessageIndex": 385,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 16, 2012 05:34PM bearcub wrote: Benny...your onc sounds like a winner, no bedside manners....go on the stage 3 thread and you will see those ladies have been around a long time. They are making leaps and bounds with cancer treatment, think of it as more of a chronic disease, not a death sentence. Did the onc say you would loose your hair with that regiment?...yes, u tube has lots about tying scarves. A doorag works great the little ones that tye in the back, head covers.com sells them. I also bought a beanie type of pad that goes under the scarves, it helps so scarves don't slip plus they add warmth. Do not fear the chemo, it is doable, most don't get all the SE. On your good days spend with Diamond riding. Remember it is being done to give you many more years with Diamond. When you go get chemo take a picture of her with you. Try and go to the look Good Feel Better class, they teach about scarves, wigs and you get a beautiful makeup kit. You will do great Benny, and next summer chemo will be done and you will be out riding the range.....SMILING!!!....it will happen. Edithester did you find out if you will be doing chemo and radiation? Hang in there girls it will be okay.",
      "MessageIndex": 390,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 17, 2012 09:55PM bearcub wrote: Edithester hope you are doing well, any news on when you begin your treatment and kind? I had a good laugh when you made the comment about the women who lives with doc....too funny! I hope your weather is not too rainy over there. We have almost no leaves left on the trees and boy it is getting chilly.....we are on the first snowfall watch now!",
      "MessageIndex": 408,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 29, 2012 12:01PM bearcub wrote: Dakota and Edith, I am starting my 4th and final AC in another week. You will be fine, it is scary the first time. You will walk out of there feeling no different. Make sure the nausea meds they give you work, if you feel sick at all call them at the clinic...drink lots of fluids to flush the drug out of your system. Use baby wipes to save your *****region from the harsh drug. Always remember this drug will help you, small price for your life! My nails have held up but my skin on my hands is so dry from hand sanitizer. Also get onto the November chemo thread or start one for people starting chemo in November so you can walk this path with people going through exactly what you are. I am thinking of you, breathe, you will be fine.",
      "MessageIndex": 461,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 6, 2012 07:02PM bearcub wrote: Edith you sound like you are managing your chemo great, positive attitude can go a long way. Have a great time tomorrow with friends and tea with your darling GD.... Carla I never had an MRI either, just mammogram, US, biopsy, chest xray, surgery and a CT scan as the doctor thought she felt something around my liver. No MRI. CT came back all clear as did all my organs. Chest X-ray normal. Your doctor may suspect from the mamm and US that the mass is very small.",
      "MessageIndex": 525,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 16, 2012 02:32PM bearcub wrote: Edith I love your story, I totally could visualize. I will have my electric dagger blade ready and be gentle!! Hope you are all managing your SE . Hang in Warriors we are doing this!! Benny I love the picture you posted, I can picture her running up our veins and kicking cancers ass... Plus I think my inner beauty looks just like her, lol",
      "MessageIndex": 611,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 20, 2012 09:11AM bearcub wrote: Edi hang in, I was delayed a week from low WBC. It does suck. I am day 7 post last chemo, and feel awful, I just want to sit around and do nothing, it seems to take so much energy to do anything. I know this will only last a few more days and I will bounce back, usually day 10. I feel like a slug. I hope everyone has a happy week!",
      "MessageIndex": 669,
      "PostDate": "20/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 8, 2012 10:21AM - edited Dec 8, 2012 10:21AM by bearcub Great article Benny, I can see you next summer on the Wild Pink Yonder Ride!",
      "MessageIndex": 892,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 13, 2012 09:35PM - edited Dec 13, 2012 09:36PM by bearcub Benny my dose was lowered for two cycles also, you are not alone in that. ...poor kitty, maybe he is just worried about his mama... It has snowed half the night and all day, I woke up early this morning, was getting ready for my CT simulator (radiation prep) at 8:30 and heard on global tv that we had a snowfall warning....I opened up the blind to the patio and it was a friggin whiteout....and about 10 inches of snow piled up. Figures.....why today did that happen...I live 26 km. north of the city and had to share the road with logging trucks that blow up the blowing snow...gosh I thought I would not make it. Scary....snowblowed for 2 1/2 hrs when I got home, DH works 12 hr shifts and just could not leave it for him. ..my hair is growing its about 1/4 to 1/2 inch...white....I wish it was darker so it showed...it will take forever to cover this scalp....my DH tells me I look like a chia pet. Everyone have a great friday",
      "MessageIndex": 988,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 15, 2012 11:03PM bearcub wrote: Traii it's okay to have days like that, we all have them, it was good that you were able to get out and have some fun, and if only for a few hours let you hair down!....sorry had to make the hair comment!...hope your Sunday is a good one.",
      "MessageIndex": 1003,
      "PostDate": "15/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 19, 2012 06:27PM bearcub wrote: Benny good to hear things went well and Websister sounds like a gem, you are so lucky to have her in Calgary. I hope things work out with the AC. I had fatigue from about day 5 to 9, and some indigestion around week 2. I hope everyone has a great week!",
      "MessageIndex": 1057,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 22, 2012 10:25PM bearcub wrote: Yes Benny the flushing is normal on AC, as Websister said, it won't last long maybe a few days. Always stay on top of constipation take senekot and take fluids. It is very important to stay positive, keep your mind as busy as you can, bundle up and take a walk, if just to go around the block, get a good book from the library, try and do a puzzle. Keep the mind busy and not always thinking cancer..if you can play with Benny, I bought a cute mouse from Walmart for my Lily(Siamese cat)..if you tap it, it squeaks, it's her Xmas Gift but she has heard it and is already looking for it. You will feel well enough soon to go see Diamond, and hopefully clear sailing until the next AC. Are you having 4 rounds of AC? Have a great week! Merry Christmas...",
      "MessageIndex": 1100,
      "PostDate": "22/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 1, 2013 12:25AM bearcub wrote: Benny you look and sound great, now that is New Years worth celebrating!!! I wanted to thank you all for being here for me when I need you all, we all get meltdowns, and low moments, it is normal and okay...our bodies have been going through so much. Lets all have a super great 2013...we will make it through our treatments, and aches and pains and setbacks we will get stronger and be the warrior women we are! Happy New Year to you all!!",
      "MessageIndex": 1238,
      "PostDate": "01/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 1, 2013 09:11PM bearcub wrote: Benny it is a beautiful saddle pad ....it was meant to be for you and Diamond, it was so right for you to go back and get it....meant to be....a sign to fight on and look forward. I am smiling looking at the pic.",
      "MessageIndex": 1255,
      "PostDate": "01/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 4, 2013 09:29PM - edited Jan 4, 2013 09:30PM by bearcub Hi everyone, Benny I hope you are feeling better. I was watching the news and wanted to say to all our down under girls, that heat and fires you are experiencing in Australia sounds pretty brutal. Stay cool and safe!....I have a few feet of snow in my yard I wish I could send down, lol.. Bevlee congrats on the baby news, grand babies are so special. I have 8 ranging in age from 4 year old twins girls to our 16 year old grandson.....that's pretty good considering I am 29 years old, still.... Carlads I bet the hair looks cute, hope you get minimal SE from your chemo. Websister I hope your feeling better, so nice that you can spend time with your mom, I sure miss mine. Dakota your kids sound like they keep you hopping, they are so special. Edi I would love to see your sassy wig, I wish I could figure out how to put pics up. If you every get it let me know. Hope the itch is gone! Liefie welcome back I had my 2/16 rads today, it isn't bad at all so far and the ladies have been very nice. I am hoping my skin holds up but being fair makes me nervous. As a kid I would burn, fair skin and red hair. The RO told me that skin color doesn't really make a difference that even dark skinned people can have bad reactions and fair skinned be fine. We will just have to see. All the other sisters, have a super Weekend",
      "MessageIndex": 1319,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 7, 2013 08:41AM bearcub wrote: I have to agree with all of you, this is going fast....I cannot believe most of you are halfway done chemo. I just want to say you ladies all have the best attitude going through all of this stuff. I find this thread really refreshing. Good luck today Edi with the blood, hope you bought some yummy easy food to cook. I am off to #3 rad today...of course it is snowing, you have to love driving in January in the winter EH! As we say in Canada.",
      "MessageIndex": 1355,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 8, 2013 09:33PM bearcub wrote: Oh Benny, I wish I was there to give you a hug. It's not hopeless, and even if you get delays you are still fighting the cancer. I know you didn't want a feeding tube but if it keeps you getting nourishment and calories to keep you strong it wouldn't be so bad. My oldest grandson has Crohns disease and 2 years ago had a abscess in his colon, he could only have boost for 4 months while he was in hospital in Vancouver children's hospital, if he couldn't tolerate it they would have given him a feeding tube. He has friends that did have the tubes. It is usually temporary. It is so important to get your strength up. Please try to stay strong for Benny and Di.",
      "MessageIndex": 1385,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 12, 2013 04:28PM - edited Jan 12, 2013 04:30PM by bearcub Benny you could probably explain up front about being afraid of needles and they will let you numb it up. I got three little ones like a freckle, you can hardly see them, it really is not a big thing to worry about but it sure makes lining you up easy and quick. As a warrior I think of them as my war wounds...but like you I was a little afraid, all for nothing!! DH and myself have started a puzzle on the dining table and have spent 2 days now putting together a beautiful South Pacific beach, a nice thing when it's too cold for a walk. Nahahi I have never skied into a moose, scary....but I hit one 16 years ago in a car accident. I was lucky to walk away from that with nothing more than a mouthful of glass and a terrible case of the shakes. The way the windshield popped down I was about 1/2 inch from a lobotomy....funny thing before I hit it I could feel something push me way back in the seat....maybe a guardian angel? Since then my DH has hit 3....and we are good drivers!! Traii hope the arm is good, and Carlads hope you are still fairly SE free. Hey Bev hope you are doing good! Take Care everyone!",
      "MessageIndex": 1479,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 19, 2013 07:02PM - edited Jan 19, 2013 10:57PM by bearcub Barbara sorry you are in this situation but this is the best place to come for information and support. I also am her2+ and yes we do require additional treatment. I have herceptin infusions every 3 weeks, that started after my chemo since I only required AC, but if you get the Taxols, I am pretty sure herceptin can be given at the same time. Others here will walk you through that. Yes, it looks like you are Er and pr negative. Don't read anything before 2010 on the net, it just is not new enough. All of us have been exactly where you are and you can do this! My DH bought that book Breast Cancer Husband by Marc Silver back when I was diagnosed it is a awesome book and I highly recommend it. Edi sorry about the veins, yes good advice from Websister. Hope you feel better soon. As for the cake never mind the pic, I want a slice!! Traii I hope your DS was able to get the pony ride. Carlads hope you are feeling fine. Benny you sound like you are in a great place, hope you keep feeling well....loved the pic in the cowboy gear at chemo, lol I think that mashed potato diet may be something I need to go on! I hope you all have had a great weekend!!",
      "MessageIndex": 1628,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 30, 2013 08:46AM bearcub wrote: Liefie congrats on the clear mammogram. Traii sometimes it takes so long to get our drugs ready once we get to the chemo unit. Like you say though, every chemo you get you are 1 closer to being done!...I am going to google gummy shark, I need to see it, your DH fishes in the ocean, oh my, I am so afraid of great white sharks I don't think I could go so far out on the water in Australia. As a kid we stayed at Bonny Hills in NSW, north of Sydney for 3 months. I remember a wave grabbing me right off my feet and twirling me under the water. At the time it was pretty scary. Edi glad things went well, I hope things are going okay for your friend, that is a scary DX. Isn't medicine in This day and age a miracle, I will say a prayer for her. Bevlee, Carlads and Nihahi, websister, hope things are going well. Benny, we are thinking of you, take care. Have a great day everyone!",
      "MessageIndex": 1909,
      "PostDate": "30/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 13, 2012 04:55PM bearcub wrote: Bump",
      "MessageIndex": 977,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 18, 2012 03:03PM bearcub wrote: Bump..bump..bump...we need to keep this info up!!",
      "MessageIndex": 983,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Apr 1, 2013 11:25AM bearcub wrote: Happy Easter my Breastfriends!! I know I have been missing in action, sorry all, taking a well deserved cancer break!! I read back a bit and Edi I was brought to tears reading about your meltdown in the kitchen. I think we have all done it. I think we are all suffering PTSD, post traumatic stress disorder. I think thats why I needed the cancer break. Your Grandaughter is a little beauty, you are so lucky to be living so close to her. Your bathroom looks awesome!! Nihahi I wanted to tell you a while back you posted pictures of snowy owls, they were beautiful, those beautiful pictures have a calming effect. When my DH and myself got married 36 years ago he told me if a eagle flys over your car it means good luck, I don't know if it is true but it makes me feel better. I may have missed something, last I heard you were fighting with the alien boob, I hope you are feeling better, and good grief, I hope you can get a better sleep than 30 min.... Traii, I was thinking of you yesterday when I read in our newspaper that some guy who is a talented marathoner from Prince George, B.C., died in a Melbourne hospital after a tree branch fell on him during a storm. He was only 58 and fit as a fiddle, go figure! I bet Easter with your little guy was a blast. Websister I hope your mom is doing better, and they didn't rush her back to the lodge. Is the snow in Calgary starting to go, this was a horrible winter for us, we got tons of snow in February and March, It felt like everytime i had a appointment in town it would be a whiteout.....I told my DH I wasn't going to retire here in 3 years. I think we have agreed that somewhere on Van Island would be just right. I was meaning to ask about the herceptin, I am having number 7 on April 10th, I just worry so much that my heart won't make it to the 17th one. My last muga scan had my number at 58. I started at 63. What number of herceptin are you on and what is your left valve ejection number. I will keep my fingers crossed that I can make it through all 17. I also had a young guy for rads, I actually have given up who is looking at my chest, it feels like everyone has!! Liefie I am envying you on the island, I hope you are feeling well. I have been watching the Jodi Arias trial for the last 2 months, it takes my mind off cancer, and I booked Disneyland for myself and my daughter and her 2 kids. We will be leaving Mother's Day for a week! We are super excited. This trip was cancelled last year as I was Dx a few weeks before the trip. We were going to RV down the coastline but this year we are just going to fly. To all the girls on this site Happy Easter, may you all have a beautiful spring, we sure deserve it and some peace of mind. XOXO",
      "MessageIndex": 2958,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Apr 14, 2013 04:05PM bearcub wrote: Just checking in....Dakota and Nihahi prayers for a quick recover for you both. Summer here we come! To everyone have a great week, and get lots of rest if its needed!",
      "MessageIndex": 3110,
      "PostDate": "14/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 6, 2012 05:33PM bearcub wrote: Bennie, I wish you could have had a few of us with you, I think your cancer coordinator would be a big help, so that you know what to expect as you move through your journey. she would go with you Benny. I also had no clue about the contrast when I had my CT until I was in the room, a coordinator would have been great. I waited a month after Dx to call my coordinator and wished I had taken the step the day I knew I had cancer. I think Ativan would help a lot ask your doctor for something to relax you. I hope you get the scans you really do need the answers. Answers will give you the power to deal with your BC quickly. If you can handle a horse, you can handle BC! Liefie I also have a siamese girl who is 3...",
      "MessageIndex": 119,
      "PostDate": "06/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 16, 2012 10:17AM bearcub wrote: Benny, hand sanitizer, spray bottle of hydrogen peroxide and Lysol wipes. You will be fine, just be cautious. Stay calm, you are a strong woman, you can do this. I bought a vanity fair bra, padded no underwires, from sears and it was beautiful to wear right after my surgery. It did not hit my incision at 1-3 o'clock or the SN incision. So happy for you Bonnets, way to go!",
      "MessageIndex": 210,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 21, 2012 12:50AM bearcub wrote: Editheser, it is midnight my time and I imagine you are in surgery now since you are in Britian and hours ahead....have a nice snooze and may your surgery go perfect......take care ((hugs))",
      "MessageIndex": 285,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 28, 2012 12:07AM bearcub wrote: Hey Benny I hope you are enjoying your new horse, and feeling well. Don't over do it. Bonnets I agree BC can get anyone, it doesn't seem to matter if you eat well, exercise, vegetarian or marathoner or someone who eats junk and is a couch potato. It must just be in the genes. Edith I hope you enjoyed the cinema,...no snoring eh! I just had my second round of chemo yesterday, the hair on my head was so patchy from falling out I had to have DH shave it...so I am doing the scarf thing. I have been feeling pretty good, keeping up with the meds to keep from any nausea, it's working. Managing to clean the house and still bike everyday. Have a fantastic weekend girls and I hope everyone is healing well.",
      "MessageIndex": 317,
      "PostDate": "28/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 29, 2012 10:44AM bearcub wrote: Edith, The only thing that concerns me with the cold caps is that I want all my cells to get the chemo, the cancer cells can hide anywhere, even in the hair roots. I am glad you are feeling better, I do think stress tires us out. I am with you I just want to get back to myself fast. Benny, Yes I did keep my hair, I braided it when it was wet and chopped the braid myself. I don't think I could have left it on a hairdresser floor. Then I went into the hairdresser for a short cut. It felt real weird and I couldn't make eye contact with anyone for a day then I got used to it and it it was okay. I have 2 wigs, and don't wear either mostly hats and scarves I made from a McCalls pattern....I also thought of hooking the bread into my hat or scarf but I haven't done it yet...you can look up how to tye a scarf with a braid and its using long tails of the scarf to make a long braid....I am going to try it. I was wondering how old Diamond is, Mare or gelding?....probably super nervous from the move, poor thing. Take care everyone, have a fun weekend.",
      "MessageIndex": 331,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 30, 2012 10:46PM bearcub wrote: Crystal that is awesome news! Edith it was not a stupid suggestion about the ice caps. A lot of people use them. I just think it would be better to let the treatment do its thorough job and then we can have hair and NO cancer ever again!..we all have to do what feels right for us. I am never offended by anything the ladies here say. We all just suggest to each other. I pray you do not have to do chemo..but if you do I am here for you. I also have a licker for a cat, lol she is always licking my arms!!",
      "MessageIndex": 340,
      "PostDate": "30/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 14, 2012 08:45PM - edited Nov 14, 2012 08:49PM by bearcub Benny, I wanted to let you know today I finished my last chemo, I was taking the same drugs for nausea that they have given you. I never got sick or nauseous once. You will do great, hang in there. Tell yourself that you are going to see the plush toy everyday that you can get out there and make it your goal. You are on your way and we are here, and before you know it you will be finished too. Did you buy a wig yet, or cut the hair a bit shorter. You are going to look great!....we're you ever able to go to a look good feel better class? Are there drivers for people doing chemo in your area? Talk to your cancer coordinator she may be able to help you with that....ps...I could have easily driven home from chemo but they wouldn't let me. Edith I have had the same problem with my posts....write them and then poof don't post. It sure is frustrating. You have such a good attitude, you are right the hair will grow back, hopefully you are flushing that cancer down the loo...lol Today I am officially growing my hair back. Ladies we are all doing this!...We are Warriors!",
      "MessageIndex": 573,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 23, 2012 04:47PM bearcub wrote: OMG Edi you make me laugh.....you may have to get DH to clean those clippers...the scalp stops being sensitive after its buzzed, it really is a huge relief!....besides you have a beautiful wig...... Dakota yay your almost done. I was Dx a month before you but because I am Her2 + I have to do 17 rounds once every 3 weeks of Herceptin and won't be done until at least October, 2013. Oh well at least well on my way...I imagine the hair is buzzed by now. Not so bad right??....you are strong and you can do this....and can start regrowing by Feb. Hopefully hair by summer.. Liefie how has Tamoxifen been for you any SE, I start it on Dec. 5th. Have a wonderful vacation in South Africa. My parents lived in Tanzania in the late 80's early 90's for 9 years. When my ED was 13 she spent a summer with them over there. She has many happy memories........watch the water for sharks!!",
      "MessageIndex": 703,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 9, 2012 01:35AM bearcub wrote: Benny hang in there girl, and don't go reading some of those posts. I have done exactly that and I was so depressed afterwards, I had myself thinking I was going to die....and that certainly was the wrong frame of mind to go to. It can really bring you down. You are not late stage. Yes chemo can be nasty, and yes you will have yucky days but when it's done you will start to come back, your energy, and I actually heard that the skin can turn beautiful when chemo is done...lol I am waiting for that to happen to me!! ..Mind you mine was never that great to start with! Always remember when you start to feel down, CHANGE YOUR BRAIN, CHANGE YOUR DAY, CHANGE YOUR LIFE!!...my mantra....its okay to have a down day..now get back up on the horse!!!...can you see me with pompoms and a cheer leading outfit, lol... I hope everyone is warm and toastie in there homes ...keep the cold weather outside...lol at you Edie sitting on your foot. I could so picture that. It's minus 12 here, and lightly snowing. That's not too bad!...my DD home 4 hrs. North is -35... I hope the rest of the weekend is awesome for you all, no matter if you are healing on the couch, or resting from chemo try and have a good one ladies..",
      "MessageIndex": 895,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 13, 2012 10:02PM bearcub wrote: Looks awesome....Benny!",
      "MessageIndex": 990,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 13, 2012 10:06PM bearcub wrote: Good luck with surgery Lesleyanne",
      "MessageIndex": 991,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 19, 2012 09:54AM bearcub wrote: Benny I hope you have a good day, and a few weeks with minimal SE. I am imagining the warrior girl is coming out to play today!....she is ready to kick cancers ass!! Websister you are an angel.",
      "MessageIndex": 1049,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 5, 2013 09:28AM bearcub wrote: Edi I would love to see a pic of that cake, if you get pics loaded. My GD also turns 6 later this month, on the 23rd. I am pretty sure it will be a Dairy Queen ice cream cake...kids love those even when it's freezing outside.",
      "MessageIndex": 1326,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 8, 2013 06:01PM bearcub wrote: Oh Benny, so sorry you feel like cxxp still...are you able to drink ensure or boost? It is very important to get calories in and not lose so much weight. I think you said you have lost 30 lbs. since this started, that is a lot and may be making you weaker. Yes, you definitely need to see a nutritionist. I hope tomorrow is a better day. When is your next chemo? Traii that is a great picture of you. I hope you will be SE free..... Carlads not long now, we are in your pocket on Thursday.. Edi wow your clinic does sound busy, the ladies really are angels. To all you other ladies, may you have a wonderful Wednesday!",
      "MessageIndex": 1383,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 11, 2013 03:29PM bearcub wrote: Hey Benny you sound so much better!....so glad things are looking up. I hope the chocolate bar was good...you deserved it..I love the pic of your Benny..so glad Di was not the donkey when the farrier was out, I bet her hoofs were beautiful. Have you tried nail polish on them, lol my Grandaughter did her horse's hoofs with pink sparkles! Websister, sorry for sending that snow your way...I am going to get DH to help me post some pics...we have tons of snow. It's minus 14 right now and it's 1 in the afternoon so that's our high...hope your doing okay on the herceptin. Carlads hope you are feeling good and no SE . Nihahi I can almost smell that homemade bread, my fav.....enjoy! Liefie enjoy the time with DH. Lila the news about your friend is so very sad, it sounds so awful, I am sending you a virtual HUG... I agree with Benny's advice so I won't repeat it. Your post reminds me why we fight so hard through these treatment plans. The options are limited, treatment or no treatment. I for one am so happy we have treatment and I would always choose that. Take Care. I had # 7/16 rads this morning. I am still doing fine, a bit pink. I am doing 2-3 saline compresses a day and they gave me this cream that I put on once a day not greasy and it works like a glove....the only wording on the tube is Stratpharma...it is wonderful. I will say this is such a breeze compared to chemo. The bonus about driving into radiation everyday is seeing the snowy owls...we have had some migrate into the area and have stuck around, and I have seen at least 20....I had never seen one in the wild before. They are beautiful. Everyone have a fantastic weekend....",
      "MessageIndex": 1455,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 15, 2013 07:04PM bearcub wrote: Benny I know if you read through the sept 2012 chemo girls almost everyone did the Taxanes and most found them easier than AC. Like liefie said the red devil is a nasty bugger....Take baby steps here, I think you can do it and finish your treatment, it may take a little longer but you will get it done. How do you know how your body will take to the Taxanes, just maybe your body will be okay. I can still see you riding through the fields this summer with that saddle pad that has so much meaning in the design. I also plan on seeing you for lunch on your way through to Burns Lake!...Take Care Liefie I don't blame DH, cougars scare me too, we have had sightings in our area, so I always keep an eye out. I hope Your DH has some sensor lights near his garden... We spent a week in Parksville on the water after my surgery and before chemo. It was beautiful, then drove up to Comox Kye Bay for a few days, ferry to Powell River and Gibsons, Whistler and home. It certainly gave me a new energy to get home and do chemo.",
      "MessageIndex": 1535,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 24, 2013 10:53AM bearcub wrote: I just picked up my i-pad...I am on my way....will post when I get home... OMG I am crying seeing that cake, thank you.....you are all in my pocket...xoxoxo..luv you all my worldly friends!!",
      "MessageIndex": 1792,
      "PostDate": "24/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 25, 2013 01:51AM bearcub wrote: nihahi I am there in your pocket, wrapped in a scarf, don't want to get cold....ready for a excellent day!",
      "MessageIndex": 1805,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 29, 2013 03:59PM bearcub wrote: Traii and Edi hope the chemo goes well, we are all in your pockets....and that's not me pinching!! Bevlee wow what a great community you live in, and darling friends who shaved their heads to support you. Nihahi your poor chest, I hope the icing helped. Hopefully come April things will be better. Liefie fingers crossed for the mammogram results! Websister stay warm! Scottie thanks for the deodorant tip, I will try the b/soda. Dakota I imagine you have been busy being hockey mom....and your avatar is beautiful. I have been pretty sick with a cold for the last few days, what really sucks is I don't know what I can take to stop the runny nose, stuffy head feeling. Being on tamoxifen and herceptin makes things a bit more difficult because of interactions. I have been doing sinus rinses and listerine gargles. Gggrrrrr. I have been back on my stationary bike 5 days a week 30 min. thanks to you all for the motivation....even today with this damn cold I got it done, didn't want to but I did. We have a snowfall warning expecting about 20 cm. snow. It's not too cold - 14 this afternoon. Everyone who is having treatment I hope you a SE week!",
      "MessageIndex": 1901,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 2, 2012 08:33PM bearcub wrote: Bump!",
      "MessageIndex": 963,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 21, 2012 10:09AM bearcub wrote: Bump!",
      "MessageIndex": 986,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jun 5, 2013 01:52AM bearcub wrote: Yes, it still may not be cancer, and if it is you may be a candidate for a lumpectomy. It is hard in the beginning, your mind racing trying to make decisions without all the information, when you get a treatment plan things will get easier...Take a deep breath. I know it is hard.",
      "MessageIndex": 7,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/805696",
      "Title": "Can somebody help me pls Seebha marie5890"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jun 5, 2013 09:44AM bearcub wrote: Marie has given you good advice, call your doctor today and get a copy of path report, and from now on get copies of all your tests, bloodwork, scans, keep them in a folder. Any lump larger than 1 cm. depending on grade of tumor, you will be looking at chemo. When you get your path report it will tell you the stage, and the grade of cells, ( non-aggressive to aggressive. Your MO will discuss with you a treatment plan. I know this is shocking for you, but it will get easier to handle.",
      "MessageIndex": 10,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/805696",
      "Title": "Can somebody help me pls Seebha marie5890"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Apr 1, 2013 03:34PM - edited Apr 1, 2013 03:36PM by bearcub Welcome Laurie, these ladies are wonderful. Happy Birthday wishes for Websister and Benny! Dakota you remind me so much of my oldest daughter, she is 35 and going through the same as you, her DH is an ass. She is doing mediation for the legal separation they have lived apart since Dec. 2011...and she is still trying to get things worked out. I could not imagine her having to deal with BC and that. She did go for her first mammogram about 10 days ago and got a call back, had a Ultrasound, and is waiting the results. I am praying she gets a good result. The RO was leaning towards cyst. I will say you sound great and I think your frame of mind has you in a good place. You can do this. I will say my next door neighbour called me about 10 days ago she also went for her first mammogram, (shes 48)..got the callback and now has been given a appointment with the surgeon and has to have a biopsy. I am praying she gets a B9 result. Liefie you are so right, we are alive, I will live with my loose neck and tummy pouch. Yes, Jodi Arias is a psychopath, scary...I sure hope the victims family gets justice. Take Care All",
      "MessageIndex": 2962,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Apr 17, 2013 08:42PM bearcub wrote: My prayers are going out to all those who have been touched by the Boston bombings. Such a sad event that touches the world. Nihiha I hope things are going well for you. Healing vibes.. Liefie, chemo for terrorists sounds like a plan. I hope your pups foot is just something minor. I have a 10 yr old Chesapeake retriever cross. They are such luvies... Websister wow you are doing well, I will definitely ask the MO on the 30th about CoQ10. I started out at 64 and it dropped to 58 and have another muga at the end of May. I am tempted to stop exercising through May and give my heart a rest. Hopefully that might help it go up a bit. Dakota happy you are safe. Edi I hope the London marathon has no problems, stay safe. Caitlin, Traii and everyone have a great week...",
      "MessageIndex": 3137,
      "PostDate": "17/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 30, 2013 09:54PM bearcub wrote: I have been gone for a long time but do lurk a bit, Web sister I just want to send my condolences on the passing of your mom. I do hope your DH is home now to be with you at this difficult time.",
      "MessageIndex": 5469,
      "PostDate": "30/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 2, 2012 01:46AM bearcub wrote: Edithester, I am thinking of you telling your kids, hope it went well. (hugs)",
      "MessageIndex": 65,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 4, 2012 09:11AM bearcub wrote: It is amazing how horses can heal. We gave our 3 horses to my daughter about 5 years ago, she has 80 acres up at mile 0 of the Alaska hwy. there is nothing so healing as being able to be with your horse. Most of our grandchildren love riding as do my daughters...I really miss the horses....",
      "MessageIndex": 103,
      "PostDate": "04/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 12, 2012 09:06AM bearcub wrote: Benny yes you would go through PG to get to Burns Lake, we'll do lunch!",
      "MessageIndex": 167,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 12, 2012 12:42PM bearcub wrote: Benny are they doing a sentinel node biopsy or removing several lymph nodes for biopsy. I did a SN, was also a gd. 3. My nodes and lymph and veins were clear, as were margins after surgery, don't get too concerned about gd. 3 meaning it has spread everywhere. Having A Bad Day? Place Your Hand Over Your Heart, FEEL THAT! That's Called Purpose! Your Alive For A Reason, Don't Ever Give. Up!!! Have a great day girls!",
      "MessageIndex": 183,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 16, 2012 10:57PM - edited Sep 16, 2012 10:59PM by bearcub Benny good luck tomorrow, just remember this time tomorrow your breast cancer will no longer be in your breast.....it is a great place to start with your treatment....",
      "MessageIndex": 229,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 18, 2012 08:33PM bearcub wrote: Sara welcome to the group and imagine we have our arms around you. Some doctors just seem to forget we are real people, not just a piece of paper with a Dx. Benny, I am so happy you made it through your surgery, you have come so far since you first starting posting. Hoping for a quick healing for the Poor old boob!",
      "MessageIndex": 249,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 18, 2012 11:29PM bearcub wrote: Sara I have heard nothing about the trial you are talking about. How did you hear about it? I am going to look it up on the net and see what I can find out. They have me scheduled to do 17 rounds of Herceptin once every 3 weeks.",
      "MessageIndex": 252,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 18, 2012 11:55PM bearcub wrote: Okay I read a bit about TDM1. Did your doctor suggest this trial to you? I couldn't find anything on the Edmonton trial. Its a tough decision to make to be in a trial, I guess if Herceptin alone was not working for me I would do what I had to do to extend my life. It did sound like there are some side effects I certainly would investigate that. Have you asked anyone in the stage IV thread. They are girls that have mets and may beable to help with trial info.",
      "MessageIndex": 253,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 19, 2012 05:48PM bearcub wrote: Edith, I hate that when I wake up in the night and my brain won 't shut off and I lie there with all my fears..it's when we feel truly alone. I think we all have done it before our surgeries..You will be fine, it will be over before you know it....and the cancer will be where it should be....out of your body...that is definitely worth looking forward to. I will be thinking of you on Friday. Mariah so glad you found this site, these women are fabulous, so helpful and we are always here. So sorry you are on the road when you got this news...Travel safe.",
      "MessageIndex": 273,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 29, 2012 11:54PM bearcub wrote: Lesley great post, lol love the rant...I put on a great scarf today and made it into a long braid, felt like I had long hair all day. There are some great u tube videos to show you how to tye them. Benny I could totally invision you with Diamond, she sounds lovely, I think all this ground work will be good for her, and you. You will be well bonded by the time you get up on her. Ya the hair thing is hard, but I usually wear something on my head when I go by the mirror, I scare myself a bit, lol with the bald look.. I love what Lesley did with the platinum hair with pink, I think I will do something different as I grow it out. Everyone have a happy Sunday and take it easy!",
      "MessageIndex": 336,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 23, 2012 06:34PM bearcub wrote: Benny what great pictures, Diamond is truly beautiful. You look real good too!.... I hope you have good news from the surgeon tomorrow, you may have an infection, and need some antibiotics. I doubt you have developed inflammatory breast cancer....it is easy for our minds to go there though! We don't have snow yet, a bit of a surprise, you actually have a good time of the year for chemo, winter!!!....you will be ready to go riding by spring and be out in those fields. Did you cut your hair a bit shorter yet?, before you do make sure the type of chemo you get causes your hair to come out. Not all chemo's do.... Take care, Carrie",
      "MessageIndex": 428,
      "PostDate": "23/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 29, 2012 10:33AM bearcub wrote: Benny, I think you need a stronger antibiotic or maybe it will settle down the more antibiotics you get in you. Enjoy the horses today, I love the smell of horses too!!....we have a ton of snow....can't get too far today..heavy snowfall warning today.... Hope everyone is having a SE day!",
      "MessageIndex": 455,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 5, 2012 12:12PM - edited Nov 5, 2012 05:44PM by bearcub Hi Carla, I am sure hoping your biopsy results come back B9...you have found the perfect site for support. your mass is the same as mine was, 2 o'clock left breast. My surgeon said the same thing almost positive it was cancer...on the mammogram it was picture perfect. I was where you are last June. Now I am done surgery and have my last chemo on Wednesday. Keep up with the foods, you want to try and maintain your weight. You are in the hardest part right now, the testing....waiting for results. We are here for you 24/7. It may sound crazy but it does get easier. Traii and Edithester it is so nice to chat with ladies from all over the world. I have a aunt and uncle and cousins living north of Sydney at Bonny Hills on the coast near Port MaQuarrie, NSW. I also have a grandfather from Oswestry, Shropshire in the UK. Good luck with the fuzzy tongues, lol feels weird doesn't it. Mine only last for a few days. I have been on the AC. Hope you all have a good week, I am feeling good, go for bloodwork tomorrow and last chemo on Wednesday!!!!",
      "MessageIndex": 517,
      "PostDate": "05/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 8, 2012 04:28PM bearcub wrote: Dakota hope you have a SE free weekend....Happy pooping!! Carla, so sorry you have IDC. When you have surgery and pathology you will have a better idea of size and grade. They told me mine was about 2 cm. but pathology came back 1.1 cm so things can change...you will be fine, hang on, you can do this, we will be here to help you. Watch what you read on the net, some of the stuff is too old...and thank goodness you found your cancer and on Dec. 2nd it will be out of you....Take Care.. Edithester someday I am coming to the pub where you work for a beer, sounds like a cute place...take care.",
      "MessageIndex": 544,
      "PostDate": "08/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 8, 2012 04:31PM bearcub wrote: Benny, how is the infection, are the antibiotics working? Any news when your chemo starts? Hope all is well.",
      "MessageIndex": 545,
      "PostDate": "08/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 24, 2012 04:47PM bearcub wrote: Websister I love the wig, thank you for checking on Benny. Benny we hope you get well soon and get all the SE under control. (Hugs).",
      "MessageIndex": 719,
      "PostDate": "24/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 25, 2012 08:56AM bearcub wrote: Edi that is a wonderful thing raising money to send them to Disney World, I sure hope her dreams all come true... So happy to hear you just got on with the buzzing, no more stray hairs in everything. I am sure you look absolutely beautiful. Traii everyone has to make their own decisions about how the hair goes. Whatever works for you is right. I hope your tender scalp feels better soon. I agree with Edi........Benny Hop, Hop!",
      "MessageIndex": 728,
      "PostDate": "25/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 9, 2012 06:05PM bearcub wrote: Okay I am real mad.....I want to kick the crap out of that assistant...and lately my patience has been limited...I would have grabbed a hunk of her hair and yanked as hard as I could. I used to be a hot head redhead!...To bad we didn't live in Calgary...we could have all gone together into the store with our bald heads...we could have said out loud that we hope our hair doesn't grow in like hers!!...okay now I am just being bratty. Dakota you remind me of my daughter who is a hockey and soccer mom. You must be so proud of your kids. It's nice you felt well and were able to share the fun of tree decorating, sounds like a quality weekend. I had a hysterectomy when I was 46 so can't help any of you with the period questions... Benny glad you feel better today...I bet the next go round they will be on top of everything and it will be better... Everyone have a great week!!",
      "MessageIndex": 911,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 12, 2012 01:06PM bearcub wrote: Benny you do sound so much better today, I can hear the fighter coming back. Spinach soup sounds yummy, have a bowl and cuddle up with the kitty. Try and get outside before your next chemo, you may have to bundle up, but it feels good to breathe in some fresh air and see the trees and hear the birds. Try and take a treat out to Diamond and just give her some loving, she will certainly give it back. I asked about the Irvines tack as the owner when she was just a little girl lived around the corner and would come over and play at the house. She and her sister went to school with my kids. I Knew she had a nice tack store in around Calgary. You can do this Benny! Remember you will be riding through the fields by next summer...treatments done! This is just a bump in the road...yes a nasty bump but you can do it.",
      "MessageIndex": 966,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 1, 2013 10:52PM bearcub wrote: Carlads, we have your back this week, you will be nervous and then when it is done you will probably walk out just fine, waiting for a SE. Did they tell you how long the first infusion will take? How many? Are you expecting to loose your hair with your chemo drugs? You may have already answered these questions but i still have chemo brain and can't remember? I sure hope you are one of the lucky ones that has minimal SE. I actually was very lucky and had few SE, just fatigue and indigestion. The fatigue was cumulative. You got this girl....you picture the warrior kicking the ** out of any stray cells... Your southern dinner sounded yummy!",
      "MessageIndex": 1258,
      "PostDate": "01/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 8, 2013 10:00PM bearcub wrote: Benny I totally agree with naihati and Websister.",
      "MessageIndex": 1388,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 11, 2013 09:42PM bearcub wrote: Edi the hair is coming along, it is mostly white, I would say it will be at least 2 more months before I am comfortable walking outside with out a hat, but that works because of the weather here -20 now, I don't want to go anywhere without a wool hat on! Don't be nervous about the tattoo and rads, you will do fine. Traii I hope the physio helps, and your arm feels better. Caitlin will be thinking of you on the 17th....not long now. Nahahi I saw a horned owl once while I was riding it was beautiful. We had some bald eagles in a tree just down from our house last week. Unfortunately a deer had been hit and they were hanging around feeding. I have feeders out from about Oct. to April for the birds. I can only put them out when I am pretty sure the bears are just about hibernating or they get into them... Everyone have a great weekend!!",
      "MessageIndex": 1466,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 19, 2013 07:03PM bearcub wrote: One question I meant to ask Barb, have you had surgery already, how do you know your margins, that's why I am asking.",
      "MessageIndex": 1629,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 24, 2013 03:12PM bearcub wrote: YIPPEE YIPPEE KY EH!!!!!!! I am done rads, it kinda went fast and it was not bad at all. Thank you for the cake warrior girls, it is delicious!!! Make sure you each grab a slice.. Bevlee I take vit D3 and calcium 1500 mg., I have been taking them since 2007, still got BC, go figure! Nihahi wow so glad things turned out, 2014 I would have been hyperventilating too!! So glad April is the month and you will have your fipples soon..(fake nipples) Edi I almost fell off my chair laughing at your description of what the nurse said about your nipples....the crappiest she had ever seen, boy I think I would have needed therapy after that comment....oh well your babies grew up to be healthy and DH didnt complain..lol. that's all that matters. Liefie the news about your cousin is so sad, make sure she knows about this forum. It is just me or does it seem the women are getting this disease younger? Very scary stuff, I pray she will be around for many years. Chemo brain sucks....I need a list and a calendar on the fridge to keep me straight. Websister glad things are going well with your mom. Hope you get the insurance company straightened out, April will be soon enough. Hope things went okay with the herceptin. What #is that for you? I have number 4 on feb 6. Carlads hope you are feeling fine. Dakota hope you feel better, you are way to busy to not be a 100 percent....colds yuk. I only ever took the pill for about 3 months. Just wondering if any of you have thought about what contributed to your cancer? I had been taking a lot of supplements a few years back and wondered if it did more harm than good... I talked to the nurse today, as I feel at two and a half months out from chemo my hair is growing at a snails pace....it is a short crew cut look still...her comment when I took my hat off was , two and a half months, WOW, ya that made me feel better. I asked about biotin as I have read some take that, she didnt think i should add any more drugs to my body, she said to be patient it will come back, that it looked soft....ya I felt better....not! Benny, if you had energy to houseclean your place up you must be feeling better. Good to hear, hope appt. went well. Try to maintain that weight. Everyone take care........going to have steak and shrimp tonight!",
      "MessageIndex": 1794,
      "PostDate": "24/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 25, 2013 03:00PM bearcub wrote: Edi, that is so funny, we will keep your secret!!....gosh your wig looks great! My DH and myself both had colonoscopies last year....it was not pleasant....the drink stuff they had me take was vitro-mag and I thought it kinda tasted like sprite or 7 up...the drink wasn't so bad but the after effects.....yikes.. Liefie how many months before you got your first haircut pfc? Have a nice time in Victoria. Everyone have a fantastic weekend....",
      "MessageIndex": 1822,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Feb 2, 2013 10:53PM bearcub wrote: Hi all, Welcome Keemo. Edi, those guys look like they enjoyed the day on the shed, lol what a great friend your DH has. I know you fed them well. Nihahi those are beautiful pics and I feel guilty for sitting on my butt today. Thank you for sharing. Traii I love the original parent trap with Hayley Mills, went with my mom when I was young to see it, and wished I had a long lost twin sister.....nope went home to 3 brothers!..like the one with Lindsay Lohan too. Bevlee hope you feel okay. Carlads hope headaches subside Dakota, how do you do it!!..have a good sleep! Websister hope Kenny is doing well, and your mom got settled. Everyone else have a great Sunday",
      "MessageIndex": 2020,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Feb 3, 2013 09:18AM bearcub wrote: Jmevans welcome and so sorry you have to be here. It is very scary starting down this road. The anxiety can be overwhelming. We have all been exactly in your shoes and know how you feel. I was in that position back in June and here I am in Feb, surgery done, made it through chemo and radiation, and yes starting to grow my hair back. You can do this we will be in your pockets tomorrow for your doc appt. and will help you through all this. Remember to take some one with you tomorrow and tell them their job is to take notes....because it is hard to remember anything in a doctors office. Write any questions down you may have. If they allow you to record the session even better but ask first. Also ask the doctor for copies of any tests you have had done to date and continue to get copies throughout your treatment. Keep them in your file. Take a deep breath, you can do this you are a warrior!! Take care, Carrie",
      "MessageIndex": 2026,
      "PostDate": "03/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Feb 3, 2013 09:45AM bearcub wrote: Nihahi good morning, yes my nose is still a bit drippy but I think I am turning a corner and may be on the upside of the cold. I still managed to do my stationary bike for 30 min. most days. We have had several nice days with a big melt but as I look outside this morning it is snowing like crazy..you are inspiring me to possibly give snowshoeing a try. Have a great day!",
      "MessageIndex": 2028,
      "PostDate": "03/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Feb 3, 2013 10:03PM bearcub wrote: Edi I can't help it but had I been at the shower I would have said, 12 hours labor, ha that's nothing compared to the 18 years hard labor ahead of you......sorry I know they are worth it but I am now a empty nester and love it!....I also love the 3 kids and 8 grand kids I have. Edi I laughed out loud at the wig coming off too!..I bet you handled it in style! Keemo I think I can't help myself I now have to google moose balls!........horses name....you might want to stick to a name that starts with sh......I will suggest Shandy, that was my horses name, she has been gone now for about 10 years.....I don't know what it means but she was definitely a warrior!...good luck and happy riding! Traii that sounds like a beautiful relationship you have with your brother. My oldest brother passed away 20 years ago, my next brother...mental illness, who refuses medication, I do have a good relationship with my younger brother but we live 6 hours apart. We don't see each other as much as we would like to. Nihahi, Carlads, Liefie, Bevlee, and everyone I might have not mentioned you are in my prayers...have a wonderful week Dear Benny I pray you are well xxx",
      "MessageIndex": 2036,
      "PostDate": "03/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Feb 11, 2013 10:28PM bearcub wrote: Congrats Carla and Liefie on your babies birthdays, my DD turns 34 tomorrow, and yes she is still my baby girl. Lesleyann, yes a better year ahead of you. I was kind of in the dumps last week after bloodwork and herceptin on Wednesday. BW came back with my WBC still low after 12 weeks of no chemo. I only hope it is from radiation and that it starts to come back up soon. I am always a little on the low side. The herceptin went well, no SE and I didn't have to stick around after the infusion. I guess after the 4th one protocol lets you leave right away. That was a relief. I have put up on my avatar a picture of the top of my head. Hair is not too bad, maybe no more hats in a few weeks. It is coming in so white that a picture from front doesn't show the hair as well. I was so happy when my Grandaughter came over for a visit on sunday( I hadn't seen her for about 2 weeks), and she ran up to me and said, Grandma your hair is growing lots!!...she made my day! I have to go back and read posts so I can't comment too much, hope you are all well, and nihahi, you might need to buy more peas!!...your poor toe, that hurts the dickens!! Benny girl so glad you are back, and so sorry you ended up in the hospital, but you did get through the chemo and you are moving forward with your journey. Hope this round is better for you. Take Care All.....xxx",
      "MessageIndex": 2197,
      "PostDate": "11/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Feb 12, 2013 11:12AM - edited Feb 12, 2013 11:15AM by bearcub Hey Dakota our daughters share a birthday, my DD is 34 today!..Have a super fun day!!",
      "MessageIndex": 2207,
      "PostDate": "12/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 2, 2012 09:56AM bearcub wrote: Edithester, well your son-in-law sounds like a real sweetheart, he obviously has trouble using his listening ears. I would suggest you contact your daughter and let her know what has been going on and that you really need her support now. Unfortunately it is your time to be selfish and put your health before family squabbles (who has time for that). Thankfully you have a DH who will help you through your journey with BC. Your kids will come around.",
      "MessageIndex": 70,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 22, 2012 03:28PM bearcub wrote: Edith, I do not want to imagine what that might have been like...you go girl, wow you really sound in control, I love it!! Benny, time will heal everything up and before you know it you will be back in the saddle. You can still brush your new baby, or give him/her some alphalfa cubes or grain, lunging may have to wait a bit but a nice walk or just grooming and talking will help with the bonding, also if you blow lightly up the nose they tend to remember your smell. I am excited for you, a new halter and lead rope maybe in pink would be beautiful! My DH and myself got our first kitten the day after we were married and have never been without animals since....36 years this Dec. We currently have a half Chesapeake and half border collie, who is 9 named Emma and a Siamese who is 4 named Lily..they are our kids now that the kids are grown...They have sat with me and given me unconditional love in some pretty low moments. Thank god for our pets.",
      "MessageIndex": 296,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 3, 2012 02:05PM bearcub wrote: Edithester I am thinking of you today, tomorrow is the big day for the pathology results from your surgery. We have sure come a long way from our dx to telling our kids to now getting on with treatment. You are a strong woman, and I am praying for great results for you. Bonnets I am so sorry about the loss of your daughter at such a tender age. I can only imagine how crushing that was to go through. We are here for you, ((hugs)). Angie what a beautiful picture of you, I am so sorry you now have to watch your daughter walk this path. I am sure you are very inspirational to her. ((hugs)). Benny how is your arm doing?",
      "MessageIndex": 349,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 18, 2012 07:37AM bearcub wrote: Edithester and Momine I live in Prince George, British Columbia. It is almost smack inj the middle of British Columbia, yes we get plenty of snow. If you ever watch the discovery channel and see the reality show Highway thru Hell, it is south of us..... Edith glad you are starting your treatment quickly here and you will be over it by spring. Skating in your cars to work is not a good thing.lol.......hope you have a better winter, our last few have been horrible way to much snow. I will have to post a few pics I have of the yard at its worst...it's crazy!! Momine I laughed with the fashion statement, I was actually seeing that on a tv show where the ladies had turbans on just for that reason not BC. I guess we can think of ourselves as styling!!....I do have enough to switch up to match my clothes and find them very comfy and with the under caps warm.(much needed for this climate)....I am going to imagine Greece is nice and warm now. Benny do you have a treatment date. Careful driving the roads are getting unpredictable. I hope you all have a fantastic day!",
      "MessageIndex": 412,
      "PostDate": "18/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 22, 2012 10:48PM bearcub wrote: Dakota, I was never tested for oncotype. I am a stage 1, my tumour was 1.1 cm. grade 3 so basically the grade pushed me into chemo. The MO did not like the look of the cells, very aggressive, so i had chemo. I had clear margins, no node involvement , no venous or lymphatic invasion. I have 1 round of AC left on Nov 7th., then rads and herceptin and Tamoxifen. I wanted to do everything possible to fight this disease. Since surgery I am NED..(no evidence of disease).",
      "MessageIndex": 420,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 5, 2012 01:38AM bearcub wrote: Hey Benny, great pics of Diamond and you!..how do you post the pics in your message like that? Edithester I hope your feeling okay now that you are on your way with chemo, you have such a positive attitude I know you will manage through it! I hope everyone has a SE free week and am sending positive vibes along!..to those that are starting this week you will do just fine.",
      "MessageIndex": 511,
      "PostDate": "05/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 17, 2012 10:09PM bearcub wrote: Benny so glad you made the call to the emergency, you do not have to be uncomfortable like that. We are all different chemo regiments so we all react differently but we are made to feel comfortable. Glad you will start to feel much better soon.",
      "MessageIndex": 641,
      "PostDate": "17/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 23, 2012 08:14AM bearcub wrote: Hi Edi, great that we have you back. What is the news on the next chemo?...what day this week? I have been reading and being quiet, I know you all are going through hair issues, the hardest part is where you are now, once you get tired of the blizzard happening you will eventually just go for the buzz. The funny thing is for most a huge relief and a non issue anymore. No worries girl, you can do this, you are warrior women. Benny so sorry you are having such a tough time right now, I hope they are able to get you on the right meds so you can continue in comfort. Traii my hair was at my waist in August. I washed and braided it and cut it to a bob myself, the same day right after I went to the hairdresser and had a pixie cut, 2 weeks pre chemo...then 16 days after my first chemo my DH had to buzz it. My hair is now growing back now that I am done chemo...lol I look like I have newborn with fuzz.",
      "MessageIndex": 695,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 8, 2012 10:08AM bearcub wrote: Hi Girls, it's been a bit, I haven't been posting much...after chemo I just needed a cancer break. It sounds like you are all doing so well, even you Benny, your next round I imagine will be much better. So happy you could spend some special time with Diamond. Dakota, tough times with a ex (since your not together I am assuming he is a ex)..my oldest daughter is going through a separation, it has been ongoing for a year now, it is very stressful and to do it with a cancer DX like you have to...you do need your warrior panties on!...I am thinking of you and hope it goes okay.. Carla woohoo surgery done!!...get well soon!!...I never had drains but it is doable, it must be hard with a little one, lots of loving without lifting for now. I am 3 and a half weeks out from my last chemo and my hair is starting to grow, it is white, with a few dark hairs all going every which way....I am just wanting a pixie look at this point!! A few more months I imagine, but it is true it comes back!!!!!!! I go in on the 13th for my ct simulator for radiation treatments that begin Jan 3rd...16 treatments and then just herceptin..16 more of those, and they are easy as pie..OMG I can actually see the end of the road at this point. I hope everyone is feeling well this weekend and the coming week brings minimal SE We Can Do This!!",
      "MessageIndex": 891,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 9, 2012 06:22PM bearcub wrote: Jennie it would have been funny...we would have looked like a bald headed lady gang!! Benny have you ever heard of Irvines outside of Calgary, horse tack ect?",
      "MessageIndex": 913,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 12, 2012 08:57AM bearcub wrote: Benny I agree with everyone above, didn't you have a e-Coli infection and that is what sent you to hospital? I am sure that is what has made everything so difficult this round. You were not just dealing with the after effects of chemo. You should try the reduced dose maybe for another round and see how it goes, and I want to know why they are putting you on Neulasta shots when your bloodwork is fine. Don't those shots just create more pain? Benny do you have a support system around, family? I wish I could give you a hug, I hope everyone else continues to manage the SE fine, have a good week.",
      "MessageIndex": 959,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 17, 2012 07:23PM - edited Dec 17, 2012 07:24PM by bearcub Erica sorry you have to be here but you will not find a better place for guidance through your journey, Welcome. Benny that little sweetie is one of my granddaughters. The pic is a few years old. Those horses are my daughters. Good luck on Wednesday with chemo, that is terrific that Websister will go with you. She will be a super person for support. I think this time will be much better Benny. Edi, good news about the blood. Today is our 36 th wedding anniversary. We went out and finished up all our Christmas stuff and, went for a beautiful lunch, then off to the casino....came home with no winnings...lost 10 bucks DH was down 15......tonight we will have a drink and sit In the hot tub. It's been a good day. I hope everyone has a terrific week.",
      "MessageIndex": 1025,
      "PostDate": "17/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 22, 2012 02:00PM bearcub wrote: Hi Everyone!! I have been crazy busy prepping for family....cleaning, baking, shopping, dealing with tons of snow and cold...supposed to drop to -33 with windchill. I made sure my bird feeders are full of seed for the birds... Benny you sound so much better, you got this girl, I also had wicked indigestion for a few days each round, doc gave me a prescription for Ranitidine and it worked wonders. Up to day 10 pretty much felt like a slug, things improved after that. Dakota Happy Birthday, hope it was awesome....congrats on the final AC. Websister hope you get to slow down a bit through the holidays. Edi enjoy that special little GD through the holidays, you are sailing through girl! Traii enjoy your family, wow, 39 degrees..that is hot hot hot....with us having a windchill of minus 33 ...that is a wide spectrum, lol...we should both be at about 23 degrees a nice not too hot, or cold day....dreaming here... Carla, we are with you girl as you journey ahead towards chemo....warrior on!! Lesleyann, Bevlee and Luvmygoats.....warrior on girls....I love goats, lol...back in the 1990's we bought a brand new white camero, went over to visit a friend with goats and one yup jumped right on the front hood.... Everyone have a Merry Christmas just in case I don't have time to write....next Christmas hair for sure!!.....xx",
      "MessageIndex": 1094,
      "PostDate": "22/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 27, 2012 02:16AM bearcub wrote: Hi all, I hope you all had a Merry Christmas, Benny I hope your throat feels better soon, you are a warrior and you will get through this. Edi, my GD have all come down with the flu, I am hoping I haven't caught the bug...saw them yesterday. Websister I hope you had a safe drive to British Columbia and some nice family time with your brother. I think we should all have a reunion one year from now and say how we are doing...how long our hair is and how we have moved on from breast cancer....how we are warriors and survivors. I have my herceptin tomorrow so off to the clinic...again!...oh well it is saving my life! Have a great day everyone, feel well..",
      "MessageIndex": 1153,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 27, 2012 09:00AM bearcub wrote: A reunion on the boards of course as we all live countries apart...Benny you will get this done you now have done 2..diamond and Benny need you. Better this is going on during winter...who wants to be outside with the cold winter weather...spring will get here soon and chemo will be done. ...Jennie, Traii and Dakota I hope you all start to feel better real soon. Edi I hope you managed to get things done before the company came! Happy Thursday everyone!",
      "MessageIndex": 1161,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 8, 2013 11:20PM bearcub wrote: Benny we don't want to see you suffer without getting help if the help is there. Enjoy the day with the farrier and Diamond. That is excellent therapy, and you are right you have to show up when the farrier can come. Give Diamond a pat from me! Take Care",
      "MessageIndex": 1392,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 22, 2013 09:50PM bearcub wrote: Traii how cute is that your DS helping his mama with her arm exercises. So sweet. I would not want my dinner looking at me. I am sitting here laughing at the food talk.... Edi the dinners you and your DH grew up on, sorry, but am I ever glad I grew up with my mom and dad...lol..the worst thing they served was liver and onions and I think my dad ate everyone's share. My DH grew up with 11 kids and he has stories too. Liefie I bet the moose balls were delicious and the best thing no antibiotics in game. We had spaghetti the other night made from elk meat. My DH is not a hunter, my DD father in law sold us 1/2 a elk....best meat I have ever eaten. Benny sounds like things are under control. I hope your not coming down with anything. Now that you are done with chemo you can get your body on the mend. I am sure the cancer had its a** kicked..will you be heading to radiation in a month? I just want you to know Benny if you do rads it is very easy and fast. I have 2 rads left....done Thursday. It has gone way better than I thought, I had imagined my skin sloffing off, but that didn't happen I feel very lucky. I haven't worn a bra since Jan 3, I never go bra less....but I didn't want to cause any extra irritation with my skin. I have been wearing men's small white undershirts under my shirts.....and moisturizing and saline soaks 2 x a day. Luvmygoats congrats.. Everyone stay safe, looks cold in Alberta, and hot in Australia, and Edi hope your snow is all gone now!",
      "MessageIndex": 1745,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 28, 2013 12:04AM bearcub wrote: Hi everyone, I go away for a bit and so much goes on, you are all so chatty. I am sick with a nasty cold, my nose is running like a faucet. I can't really take cold meds because of the tamoxifen and herceptin. Drinking lots of fluids. Blah! Nihahi those pics are so good, I would have been scared to death coming around a corner and almost into the side of that. Scottie how do you use Baking soda for deodorant, just dust it on? Liefie I bet you look great with the new clothes and haircut. First place my hair came back was my legs, go figure!! I am going to grow my own Kale this year. I actually didn't mind it chopped and put into my salads, I just scrunch the leaves a bit so they become tender. (Traii, they are like a tough lettuce or greens). Edi I bet you had a blast shopping, and you look great in your pictures. Love the wigs. Websister, hope you are recovered from the herceptin, because I still have the herceptin it doesn't feel like I can celebrate my finishing surgery, chemo and rads...not really done I guess. Carlads I hope you are feeling well. Benny I am praying you just are busy with friends and not in hospital, take care! Luvmygoats, I am looking forward to having hair long enough for a pixie cut, I have always had long hair, but I may like it short. Bevlee, hope you are less frantic this week. Everyone facing whatever they face this week I hope it is smooth sailing!",
      "MessageIndex": 1875,
      "PostDate": "28/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Dec 4, 2013 10:57PM - edited Dec 4, 2013 10:58PM by bearcub I know I don't post often, I do lurk and just have to say to Benny how sorry I am to hear about Diamond. I could hardly believe what I was reading. Please know you are in our thoughts. We lost our boy suddenly at 17 on November 5th...broken leg....I hope Diamond is running with him! Edie I remember when you were first starting out, you look beautiful!",
      "MessageIndex": 5925,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 2, 2012 01:20AM bearcub wrote: Bennymuffins, I also am Canadian, and understand when you said you went from perfectly healthy one day to having BC and planning your funeral the next. I think that is a normal response, At least I hope so as I did the exact same thing. I was eating right, biking 22 km. 6 days a week, and I still got BC, no family history except an aunt and apparently that is not considered. I also was in shock, but as you move through your doctors apps and educate yourself on BC you will begin to relax. Just curious if it was your GP who told you the lymph nodes were all going to be removed? This would not be his area of expertise. I would not rely on my GP, only your surgeon or oncologist's opinions. So sorry about the loss of your horses, I do think stress doesn't help, but you most likely already had your cancer? When I was dx we were 2 weeks away from a planned vacation down the Oregon coast to Disneyland, Vegas and home. That got cancelled. My hair was to my waist until about 8 days ago I braided it and chopped it off, then went to town to touch it up. I will probably lose what I have mid Sept....it is sad but at least we are moving forward and live in a time that we can treat our cancer. So I hope you have some friends to hold your hand, and help you through this. The ladies on this forum will guide you, they have been so helpful for me. We will give you strength.",
      "MessageIndex": 63,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 11, 2012 03:46PM bearcub wrote: You ladies are all fantastic, reduced me to tears reading these posts, lol must be being off the steroids, getting all emotional and all. I think someday we should get together for a pj party in the barn, with our stuffies and our tears, and our laughter....and of course the horses. I do believe the aches and pains and vertigo are just middle age...lol I am 55!...going on 20. Take care all!",
      "MessageIndex": 157,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 12, 2012 09:56AM - edited Sep 12, 2012 09:57AM by bearcub Benny that is wonderful news, what a load off your shoulders!.....we will definitely get together for lunch. I have a few plans for next summer but hopefully our dates will all work! Enjoy your horse today!...sometimes aging feels wonderful when that's all it is!!!",
      "MessageIndex": 173,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 16, 2012 05:31PM bearcub wrote: Girls you can go online and order a bright pink plastic bracelet that snaps onto your wrist. It is used when you are going in for surgery and are unable to speak up and say no to needles, blood pressure, IV's, blood tests, in the arm that has nodes removed. Order online your FREE bracelet from www.lymphedema.com",
      "MessageIndex": 214,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Sep 22, 2012 08:08PM bearcub wrote: Edith, your DH is right, you have done great so far, we do not have an expiry date, your sweet terrier proved that...Love does wonders. Benny, I agree with Julz call the doctor Monday. If you are still having pain. I would check to see if you are running a fever, if you are go to emergency it could be an infection. Take care",
      "MessageIndex": 300,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 5, 2012 09:41AM bearcub wrote: Edithester I am so happy your pathology came back with such wonderful news. It is such a relief to know for sure what is going on in your body. You are much like me, no evidence of disease left just have to go in and mop up any stray cells ( if there are any)..yes your insurance policy. I am halfway through chemo now, make sure you join a thread that is with people going through chemo with you as you get so much valuable info. I am in the sept 2012 chemo girls and they have been so much help. Your DH is such a sweetie, my DH and myself took a baldy picture together, yes he has more hair than me, lol....but we are smiling in the pic..... I had a friend who told me right after my surgery that if it was her with BC she would do nothing, no treatment, I said you would die then and she said yes.....wow I was shocked that she feared what I had so much, did I mention she came over to show off her two new knees. As she walked stiffly away I felt truly sad, at 58 she has never had a mammogram.....and said she wouldn't .",
      "MessageIndex": 364,
      "PostDate": "05/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 16, 2012 09:33PM bearcub wrote: Benny, Beesie and lifetime have given you excellent information. I was node negative grade 3, but am still having chemo. I think of it as a insurance policy. I also will be doing radiation and then herceptin for a year and then 5 years on Tamoxifen. You must be Her2+. Do you know when your first chemo is? I am happy you have someone to go with you. I would cut my hair to a bob or shorter before treatment mind you it is a personal preference. I have never seen the Beenies at Walmart. The one under the scarves I use is a padded quilted circle thingy that sits on my head and comes down to my ears. I have bought a wig from Paula Young very reasonable...I never wear it though...good luck on your journey, it will get easier each day as the shock wears off...just keep moving forward.",
      "MessageIndex": 396,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 17, 2012 09:50PM bearcub wrote: Benny I love the last few posts from, lifetime Momine and Lesley. Everything they say is true....go ahead and cry and cry some more. You will find the crying jags will come further and further apart and be quite surprised when all of a sudden you have time and feel up to seeing Diamond....and you will smile and feel almost normal. I always said I would never feel comfortable going to town in a scarf looking like a cancer patient and now I don't care. Truthfully no one really even takes notice. I hope I remind at least 1 person to go get the mammogram they may have forgotten to do. Give Diamond and your kitty lots of hugs, don't go giving all of your stuff away you will be around a for a long time yet. Animals are very healing... There is another trial out of Edmonton I think on a drug called Metforin or something like that. It seems promising and I may ask my Onco about it...",
      "MessageIndex": 407,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Oct 30, 2012 03:43PM bearcub wrote: Edith glad it went well, don't be surprised if a few days out you feel somewhat fatigued, it will pass and you will be ready for the next round....I'm happy you found some beautiful scarves. You will be beautiful.",
      "MessageIndex": 474,
      "PostDate": "30/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 15, 2012 05:39PM - edited Nov 15, 2012 05:41PM by bearcub OMG you warrior girls are a hoot!....Benny Good for you, 1 down, and it wasn't so bad. Get some deserved sleep, I hope you have minimal SE and can get out and see Diamond soon. After yesterday's chemo, I was out driving our 3500 dodge diesel truck alone today...no problem. I love your wig, it's beautiful. p Traii, your DH sounds like he has a fun sense of humour!! That does help, Edith after the hair starts to go it may be best to just shave it off, it really is a relief when it is gone as it seems to come with so much anticipation, it's the worst part, but once it's done as a warrior you can do anything!!..and it really isn't as bad as we all thought it would be, it is a blip in our time, it will grow again. I am having indigestion today the doc gave me a prescription for Ranitidine, it works great and fast...I just took one. Lifie and Dakota glad to see your doing well and getting some exercise in, it really helps you feel in control. It helps pump oxygen to our brains and OMG we need it, lol. Dakota to bad about the D***H....I sure hope you have some loving people around you. Edith I am going to buy your book!! Have a super Friday Warrior girls!! ((HUGS)) to everyone!!",
      "MessageIndex": 590,
      "PostDate": "15/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Nov 16, 2012 10:37PM bearcub wrote: Liefie is exactly right Edith, and yes Benny Diamond I can see hanging with us warriors. Expect the hair to go anytime Edith, the scalp is getting ready if its sore. I wish I would have had the poor appetite, mine was quite the opposite, GggRrr... Happy weekend warrior girls!",
      "MessageIndex": 617,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 15, 2013 12:24AM bearcub wrote: Websister great news that you can continue with the herceptin. I get my 3 rd on Wednesday. Our weather is warming up this week to plus 5, seems a bit odd for January, but I won't complain. It will be a slushy week! Glad your mom is doing well. Traii and Nihahi enjoy the tennis, I have never been a huge fan, tried it as a teenager, pulled a muscle and that was my experience....never picked up a racket after that. Dakota and Carlads hope your SE are tolerable, Benny good luck on Wednesday. Edi I get a good laugh reading your posts, you girls sound like chefs..makes me hungry. Keep the snow shovel handy.....you may need it still.. Liefie you are so lucky to be living on the island, I am assuming Vancouver island since you head off to Victoria for treatment. I met my DH on the island many years ago. I thought I would point out I have been on tamoxifen since Dec, 5th, and haven't noticed any SE .....touch wood..I did have lots of night sweats while doing AC. I did #8/16 rads today half way, skin is still looking pretty good..I will be very happy when it's over, I have met some very nice people though in the waiting room. Well everyone have a safe Tuesday",
      "MessageIndex": 1513,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 21, 2013 06:04PM - edited Jan 21, 2013 09:05PM by bearcub Benny, I am so sorry you have had such a terrible time, Try and rest and healing hugs being sent your way. My first IV I had just above my wrist and I ended up with a bruise that was embarrassing, looked like I had been manhandled...all the others have been good though. Benny make sure you see the dietician as soon as you are able, you need to keep up your strength. Nahiha your pictures are beautiful. I was going to write that I haven't really seen any wildlife lately and then on my way to rads I saw a moose in a neighbours yard this morning. It surprised me as I haven't seen to many moose this year...I love to see them just not on the highways. Everyone stay safe....and have a good week!",
      "MessageIndex": 1717,
      "PostDate": "21/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 22, 2013 09:16AM bearcub wrote: Bevlee it was in a neighbours yard in the deep snow, they have a river (Salmon River) just behind the house, I am sure he had been there looking for a drink of water. 65 sorry you are in this situation but you have come to the right place, these ladies are full of information and support. That does seem to be a bit of a wait for surgery, I had my surgery exactly 1 month after, and that felt forever... Have you spoken to the surgeon about your worries? Getting everything in order house wise is a good idea, for the dark hours ask the doctor for a sleep aid if you need it. I was given a low dose lorazepam as I broke out in a nervous rash after DX. Take care, you are not alone. Benny, carlads hope your okay. Traii hope your arm is feeling better. Off to rads, 14/16....boob is feeling a bit sore, and a bit pink but I can do this. 2 more after today!! Have a super fantastic day everyone!",
      "MessageIndex": 1724,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "bearcub",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158225/profile",
      "Content": "Jan 31, 2013 05:44PM - edited Jan 31, 2013 05:46PM by bearcub Carla and Dakota thinking of you today....hope for minimal SE, and yay Dakota 1 more! Edi hope you feel better. Love the pic of you and DH on Christmas morning! Nihahi I take my coffee black, and I would love a Timmy's apple fritter or chocolate long john! Sounds like we are going to have fun. Websister I understand your position. Benny will come back to us when she is able, I do not believe she would hurt herself. She has too much to be here for, She loves her Diamond and Benny. Benny we can hardly wait to hear from you girl! Some adventure you must be on! Traii I checked out gummy sharks....they are big, does your DH fish his own or do you buy it at the market? Everyone have a great day",
      "MessageIndex": 1965,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    }
  ]
}