{
  "AuthorID": "BearMan52",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
  "Posts": [
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Jun 18, 2007 03:15AM BearMan52 wrote:",
      "MessageIndex": 5,
      "PostDate": "18/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/629071",
      "Title": "previous post jan125 jan125"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Oct 25, 2008 08:02AM BearMan52 wrote: Hey Gang, Thanks much for the hugs, prayers and info. Susan, good to hear about re-introducing carbo---that combo is the one that has given us the best results so far. We'll ask about that (and yep, it was a scarey reaction). Thanks Fitstwins on the info about your radiation...sounds like you've been having a similar experience wiht that---and good call on the lifetime crap! LuAnn, good to hear from you again ---and I see you've kept Herceptin in the mix with your AIs?...I've wondered about bringing that back into our mix at some point. I know there's differing philosophies on certain combos vs sequential. Oz, hugs and prayers to you---I saw that Abraxene was recently approved for advanced bc in Australia (going by memory here)---maybe that could be an option?? We're leaning heavy toward the AI, in fact, I think that's the call. We're also planning to use the lack of chemo SE's to get better with nutrition. We just picked up a book \"Anti-Cancer: A New Way of Life\" by Servan-Schreiber...a very balanced science and nutrition approach. ONe of the best I've seen---intended to compliment the traditional approaches, not bash or replace them---I ran across this on one of my BC News websites. Schreiber himself battled a recurrent brain malignancy and did surgery/chemo along with a lifestyle change. Thanks! Bearman",
      "MessageIndex": 8,
      "PostDate": "25/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723318",
      "Title": "Time for a change--need some help BearMan52 Binney4"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "BearMan52 wrote: Hey Gang, Caregiver Barry here, husband to Dana. I've posted here a few times off-on over the past two years in our bc recurrence fight. We've been on Xeloda/Tykerb for about 14 months and the latest CT scan showed some progression, so it's time for a switch and I'd love some input from the true experts.  Here's some history: dx recurrence Aug 06, mets in hip bone, ribs, right axilla/armpit node, superclav node, mediastinal node; ER+, PR-, HER2+ [on Zometa throughout] Aug 06-Feb 07: Carbo/Taxotere/Herceptin: good response, resolved superclav node and spots on ribs, other spots reduced, but had allergic reaction to Carbo in Feb 07 Feb 07-Aug 07: Navelbine/Herceptin: markers went down for a couple months, but eventually some progression, including a couple new small nodules in lung Aug 07-Oct 08: Xeloda/Tykerb: markers stayed down and stable for many months, right axilla node, which was palpable, decreased with no discomfort; eventually started to notice armpit discomfort more and markers have been inching up over past 3 months Oct 08 CT scan: a few more tiny nodules in lungs (all less than 1 cm); right axilla/armpit slightly bigger and \"thicker\" The right axilla/armpit has become actually quite painful as it's probably pressing on a nerve, which has led to a frozen shoulder due to Dana protecting the underarm. We're seeing an orthopedic on Monday for that. Our next options: 1. Ixempra and Avastin 2. Abraxane and Avastin 3. Femara (an AI, and thus a chemo break) Femara and a chemo break sound good (giving us a chance to get good nutrition back into the mix), but may not bring immediate relief to the armpit. Our doc is actually recommending that for now---taking into account our mental state of weary, etc. I appreciate the recent thread from  tooyoungtohavebc on her (and others') Ixempra experience. Any feedback, info, success stories on these options, would be muchly appreciated. You all are such an incredible encouragement. Thanks! Barry caregiver husband BearMan52 (formerly Carebear52---descriptive, but too cutesy) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723318",
      "Title": "Time for a change--need some help BearMan52 Binney4"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Apr 3, 2008 05:20AM BearMan52 wrote: I've heard/read good things about Ixempra and there seem to be a few more new/effective therapies noted lately in the pipeline and in clinical trials (I monitor a breast cancer news site: http://www.medicalnewstoday.com/sections/breast_cancer/) My instinct says fight on! Barry Caregiver Husband",
      "MessageIndex": 1,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703316",
      "Title": "Last resorts LoveInHope CalGal"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Oct 24, 2008 07:15PM BearMan52 wrote: Thanks! Saint, that is a NICE run on Femara...we almost started with that but went with chemo and the Her2 drugs first...sounds like you've had some good success on these options, and your chemobreak testimony may help seal the deal. Fitstwins---I've been wondering about radiation to the armpit all along...and that IS a possiblitlity (even talked with our onc about it today)...what we don't know of course, is would we be trading one set of problems for another (lymphedema, etc. from the radiation), and using up some radiation quota in an area that isn't a life-threatening organ?? Thanks so much for the info and ideas...and the prayers! Barry",
      "MessageIndex": 3,
      "PostDate": "24/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723318",
      "Title": "Time for a change--need some help BearMan52 Binney4"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Oct 26, 2008 07:17PM BearMan52 wrote: Thanks much! Binney, good info on lymphedema...it's always been a concern in that Dana is a harpist. Her original bc was in her left breast; we had the sentinal node biopsy AND a great surgeon and had no lymphedema...so good to know we might have some options. It's wild how her recurrence is in her RIGHT armpit after we had a bilateral Mast. Robin, AWESOME info on your Femara experience---achieving something we ALL long for...NED (no matter the timeframe). Can I ask, how long until you started to notice Femara's affect---whether reduced symptoms, decreased tumor makers, etc.?? That's good Femara testimony and may seal the deal. Thanks!!! Bearman",
      "MessageIndex": 11,
      "PostDate": "26/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723318",
      "Title": "Time for a change--need some help BearMan52 Binney4"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Jun 5, 2008 06:51AM BearMan52 wrote: Stephanie, I'm helping today with a prayer experience at our church. I'll be praying for you all day today. Barry Caregiver husband",
      "MessageIndex": 8,
      "PostDate": "05/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706742",
      "Title": "TripleNeg Steph How are you? Watson katie11"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Sep 20, 2007 08:05AM BearMan52 wrote: Answering AliceJean's question about a PET vs CT scan: A PET measures the uptake of a radioactive (low dose) glucose, so not only do you get a measurement of a lesion, you also get a reading of the lesion's activity (Standard Uptake Value, SUV). If the lesion's SUV is above a certain point, this might indicate metastisis. The CT gives you a more accurate measurement...this is why it's best to do a PET/CT combo...you get the advantages of both. Hope that helps. BTW, we're also in the same Xeloda boat. Have been on it for 2 cycles and things don't seem to be improving. Barry Caregiver husband",
      "MessageIndex": 6,
      "PostDate": "20/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692417",
      "Title": "Xeloda might not work for me shend katie11"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Jul 20, 2007 11:53PM BearMan52 wrote: Mike - Just now checking back on this thread; sorry for a late reply. We've done Navelbine as an infusion push---it takes only about 10 minutes for the push. I hadn't heard it was available via pill. We do weekly, 2 on, 1 off. There has been a funky combo of occasional diarrhea AND constipation about a day or two out from treatment, but that's been off an on. Dana did start to get some numbness in her fingers (the neuropathy), so our onc backed the dosage off about 20% for a few weeks, then we tried it again at full dose and the numbness has abated. On the second week we get a double dose of Herceptin so that we don't have to come into the office on our off week. It does take the white count down to minimum levels, so we've done nupogen shots at times--a surgeon friend of mine trained me to give the shots (saves a copay office visit) and I've become quite good :-); best wishes on this; be glad to help with any other questions.",
      "MessageIndex": 7,
      "PostDate": "20/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/648940",
      "Title": "Tykerb/Xeloda - Update mec2450 mec2450"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Jul 21, 2007 12:02AM BearMan52 wrote: Mike...I just re-read your original post...we're doing a flip flop of you guys....moving off Navelbine/Herceptin to Xeloda/Tykerb...we haven't done any new scans but tumor markers showing some increase (symptoms are still okay though) Any side effect advice on that combo? Also just read a post (I think on bcmets.org) of a woman who knocked out multiple mets (bone and I think lung) with Navelbine/Herceptin.",
      "MessageIndex": 8,
      "PostDate": "21/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/648940",
      "Title": "Tykerb/Xeloda - Update mec2450 mec2450"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Jul 6, 2007 06:15PM BearMan52 wrote:",
      "MessageIndex": 2,
      "PostDate": "06/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/648940",
      "Title": "Tykerb/Xeloda - Update mec2450 mec2450"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Jan 5, 2009 11:34PM BearMan52 wrote: Hi MJL, We've had a good bit of both in our journey. The resolution on a CT is much better and helpful for COMPARING from one CT to the other, but the uptake value on a PET (the SUV, which is the rate a lesion uptakes the radioactive sugar) helps determine whether a new lesion may be cancerous. My understanding is the radiologist will use the SUV value of the PET and will take measurments from the CT. The CT is most helpful if you know you already have active mets...then it's a good guess that new lesions are cancerous, and the docs can tell whether previous lesions of progressed or regressed. CTs are cheaper and usually easier to schedule. Once our recurrence was diagnosed, we started off using a PET/CT combo, but have used CT lately. I will say that my wife had a suspicious, enlarged lymph node a couple years ago (pre-recurrence diag) and a CT didn't show any cancer. After a couple months of the enlarged node not going away a biopsy diagnosed that it was bc, and the recurrence journey began. A CT notes DIFFERENCES in tissue---in our case the enlarged node was probably all carcinoma and thus didn't register in the CT scan as a change. Hope that helps. Barry Caregiver husband",
      "MessageIndex": 4,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726801",
      "Title": "PET vs CT scans MJLToday BearMan52"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Sep 19, 2007 10:27PM BearMan52 wrote: Geeta, I am absoultely heartbroken. Your sending the regular sized photo of Shelli's avatar was the exact right thing to do. That little thumbnail picture has been connected to so much strength and hope through her posts...and we've had to use our imaginations a bit to picture Shelli and her family from that tiny shot. Our prayers are with her family and you. Thank you, Barry",
      "MessageIndex": 61,
      "PostDate": "19/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692418",
      "Title": "Shelli is an angel geeta75 Sige"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Oct 15, 2007 09:20PM BearMan52 wrote: Hi Calico, We've learned that measurements on a PET/CT can vary greatly. Often when our PET/CTs are compared (new one to old one) the radiologist will simply re-read the old scan, rather than use the report. The second read will often be greatly different than the first read of the same scan! Where/how they measure something is not exact...our onc has explained it like measuring an egg...measure across perpendicularly you get 1 inch...inadvertantly measure at a bit of an angle, you get 1-1/4 inch.  And TMs WILL fluctuate for a lot of reasons that aren't related to cancer. Hope that helps, Barry [caregiver husband]",
      "MessageIndex": 1,
      "PostDate": "15/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693839",
      "Title": "lung nodule question Calico Calico"
    },
    {
      "AuthorID": "BearMan52",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/46143/profile",
      "Content": "Feb 2, 2009 03:17PM BearMan52 wrote: We just started Abraxene in our regimen...and it's 3 on, then 1 off, as well. We were supposed to have Avastin along with but have been denied insurance TWICE on that--mainly because Dana is Her2 + (they say there's no data for Avastin and Her2+)...but I see that you and Jeane have it in your mix...we're trying with Genentech now.  It sounds like you're right on track with treatment---the Avastin and Tykerb are nice targeted (non-chemo) therapies that go after different receptors/targets. Keep pressing! Barry caregiver husband",
      "MessageIndex": 3,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728339",
      "Title": "Abraxane rooni rooni"
    }
  ]
}