{
  "AuthorID": "BecMitch",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70277/profile",
  "Posts": [
    {
      "AuthorID": "BecMitch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70277/profile",
      "Content": "BecMitch wrote: I recently have had breast reduction surgery and the surgeon sent the tissues to path and came back with mutifocular atypical lobular hyperplasia. I have been trying to find information on this - but have found very little. I know this is a very early find and I am trying to find someone else with this or have been through this and the treatment. I am waiting for results with the estrogen reception test to see if tamoxifen will help. Please help if you have any info on this. I am very thankful and blessed to find it this early. Thanks for the help. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/720391",
      "Title": "Diagnosed precancer after reduction surgery BecMitch BecMitch"
    },
    {
      "AuthorID": "BecMitch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70277/profile",
      "Content": "Sep 2, 2008 10:50PM BecMitch wrote: Thanks for the replies. I did ask the first oncologist about a MRI he consulted with another specialist and they came to the conclusion that an MRI wouldn't be able to tell them much with all the scar tissue. Today I found out that the cells are estrogen receptive, so the tamoxifen will probably be the drug of choice. I have a prescription for it but I am going to get a second opinion from a breast cancer specialist. I am calling the new doctor tomorrow. Anne, did you have a lot of side effects from the tamoxifen? I am 47 and haven't gone through menopause yet. I am going to talk with gyno sept 17 because they took me off of the depo-provera that I was taking for severe cramping and heavy bleeding during my period. May have to have a endometrial oblation. I also have heavy endometriosis they found when they did my gall bladder surgery last Jan and found that by chance also. I appreciate everyone's input - because there is so little about this early stage on the internet. All of my mammo's have been good - just very large dense breasts. They took off 3 lbs on each side and down to a B cup. I haven't been this small since 6th grade. I hope this new doctor will want an MRI. That way we will know for sure. There is no breast cancer in my family on either side. I thought I was at a low risk because of all the factors figured in, but they said I was at a very high risk. I guess we will see what is behind door number 2. Thanks again everyone. Becca",
      "MessageIndex": 7,
      "PostDate": "02/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/720391",
      "Title": "Diagnosed precancer after reduction surgery BecMitch BecMitch"
    }
  ]
}