{
  "AuthorID": "Beeb75",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
  "Posts": [
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Aug 31, 2011 06:52AM - edited Aug 31, 2011 06:54AM by Beeb75 No news is good news, when it comes to cancer. There's no reason to think the chemo (followed by hormonal therapy afterwards, yes?) won't do its job of killing any remaining microscopic cancer cells. Believe that it will. Remember that with all the treatment we get these days, even more advanced breast cancers can be tamed. A recent study at MD Anderson found that 75 percent of women with \"regional\" disease (aka positive nodes) survived 10-years and beyond.",
      "MessageIndex": 3,
      "PostDate": "31/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773964",
      "Title": "Can cancer spread during chemo? many Saltwithsavor"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 22, 2011 01:20PM Beeb75 wrote: Also, question for PLJ -- when your onc said that the Adjuvant Online stats were inflated, did he mean they are too optimistic? Or too pessimistic?",
      "MessageIndex": 32,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/772002",
      "Title": "Chemo - since I have a choice, why would I? BobbiMarie Lee7"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 22, 2011 01:27PM Beeb75 wrote: That's interesting. I would think the opposite because Adjuvant doesn't even take into consideration Her2 status and the benefits from Herceptin. ",
      "MessageIndex": 35,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/772002",
      "Title": "Chemo - since I have a choice, why would I? BobbiMarie Lee7"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 22, 2011 01:52PM Beeb75 wrote: Actually, I think your onc might have meant the opposite...that Adjuvant Online is too pessimistic. I looked at some of the technical reports from Cancermath. One of them looks at Adjuvant and says \"Indeed, we found that Adjuvant!Online tends to over-predict patient risk .\" Adjuvant's numbers are much more pessimistic than Cancermath, but cancermath seems to have been developed by smart people (Harvard types) so hopefully, they know what they are talking about. ",
      "MessageIndex": 36,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/772002",
      "Title": "Chemo - since I have a choice, why would I? BobbiMarie Lee7"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 22, 2011 01:18PM Beeb75 wrote: Oh, 1 to 2 percent chance of permanent side effects from chemo...that makes more sense. I wonder what's included among those -- milder things like joint pain, or serious ones like neuropathy or heart damage?",
      "MessageIndex": 29,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/772002",
      "Title": "Chemo - since I have a choice, why would I? BobbiMarie Lee7"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 22, 2011 01:07PM Beeb75 wrote: Where does the stat about a 1 to 2 percent fatality from chemo come from? That is nowhere near what my onc quoted to me. More like 1 in 1000.",
      "MessageIndex": 27,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/772002",
      "Title": "Chemo - since I have a choice, why would I? BobbiMarie Lee7"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Nov 10, 2011 05:49PM Beeb75 wrote: Posy, My tumor was about the size of yours on US and MRI. Lymph nodes looked fine on US and felt fine clinically. After surgery, the tumor was a bit smaller (2.1) pathologically, but 1 lymph node was positive (with 1cm of cancer!) My lump had also been not diagnosed when I took it to the doc over a year previous. PET/CT/MRI found no cancer elsewhere so I ended up Stage 2B. It should make you feel better to know that the large majority of breast cancers are early stage (only about 5 percent are Stage IV at diagnosis.) Of course, it can happen to anyone, but the odds are on your side that you are early stage and good treatment will cure you. Best of luck! ",
      "MessageIndex": 36,
      "PostDate": "10/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/776881",
      "Title": "Coping with the wait for the Stage TectonicShift Beeb75"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Sep 8, 2011 05:06AM Beeb75 wrote: Steff, How high was your Ki-67? i didn't get oncotype because of my positive node, but curious about what it might have been. By the way, when I was first diagnosed, I talked with a woman who had Oncotype over 40. She was about 3 years from diagnosis and was doing great.",
      "MessageIndex": 6,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773658",
      "Title": "oncoType over 40-anyone a few years from diagnosis? Steff66 edwards750"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jun 28, 2011 07:22AM Beeb75 wrote: I haven't had personal experience with this either -- but I think there are other things the lung nodules could be. Hope you get good news today!",
      "MessageIndex": 2,
      "PostDate": "28/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/770890",
      "Title": "Lung nodules increasing in size? TeddyM TeddyM"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "May 20, 2011 09:25AM Beeb75 wrote: For itching: * soak in an oatmeal bath (grind oatmeal to a powder, mix with water, or buy it) * cortisone cream or calamine lotion? Maybe your docs have some ideas? Mine wouldn't let me put anything on it...though I think they might have suggested Benadryl, but please check with a doc on that, I'm not sure....  Sorry you're itchy! They'll be gone soon. ",
      "MessageIndex": 91,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768149",
      "Title": "Shingles >:-( lago Teka"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jun 7, 2011 08:19AM Beeb75 wrote: Sara1970, MSK has an amazing plastic surgery team in terms of training, execution, follow-up, etc. My interactions with the team there have been excellent -- no complaints. They answer questions patiently, get you in quickly for your appointments (or if you have a 'surprise' problem.) My sense is that they are strongly focused on safe care -- safe surgeries (meaning no mistakes or complications) and cautious follow-up (treating signs of infection aggressively, for example).  I think they are just less concerned about whether or not we get big boobs! Their approach is more medical than aesthetic -- they want good visual outcomes, of course, but a good medical outcome is most important. That's the feeling I get. Everyone I've dealt with in plastics has been really great though -- all the way from the front desk to the doc himself (and I've seen many, many techs, nurses, fellows and other docs there along the way.) ",
      "MessageIndex": 18,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/769734",
      "Title": "NYC surgeons sara1970 Hortense"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jun 3, 2011 05:56PM Beeb75 wrote: I had Dr. Van Zee at MSK, but Heerdt was also highly recommended to me. I think MSK is great. They are extremely well-organized and everyone is really nice. However, bring a book or your knitting because sometimes there is a long wait.",
      "MessageIndex": 5,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/769734",
      "Title": "NYC surgeons sara1970 Hortense"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Apr 27, 2011 07:49AM Beeb75 wrote: Oh, lago, that sucks!  I'm on the same meds -- the pills are huge, aren't they? (I'm not a good pill swallower so they're a challenge.) The upside is that, taking antivirals and antibiotics, I now feel invincible, even if my immune system is still rebuilding. (stay away, fungi!) Lago, did you have a severe case of chicken pox as a child? My mom says I had a mild case and I'm wondering if that's why my shingles aren't too widespread either. ",
      "MessageIndex": 23,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768149",
      "Title": "Shingles >:-( lago Teka"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Apr 29, 2011 02:01PM Beeb75 wrote: Yes, I had no idea what it was at first. My first suspicion? Skin mets! (lol). Then I decided on heat rash from where my sports bra hit my back (never mind that the areas didn't exactly line up.) Never in a million years thought shingles.",
      "MessageIndex": 53,
      "PostDate": "29/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768149",
      "Title": "Shingles >:-( lago Teka"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Apr 26, 2011 08:16PM Beeb75 wrote: I have them right now too, only on my back (for just over a week so far) -- I finished chemo 2 months ago and had my exchange surgery 5 weeks ago. I did feel a bit of a headache for a few days before the rash showed up, but thought it was a side effect from the Tamoxifen which I had just started. I'm not too surprised since I know my white blood cells were below normal a few weeks ago during a follow-up with my onc. Last Friday I got a simultaneous skin infection (cellulitis) over one of my implants so I was in the hospital all weekend getting IV antibiotics as well as antivirals. The infection cleared up fast, but the shingles persist (I think I started the anti-virals too late.) I'm \"lucky\" because my shingles are just a small patch. They were mostly just itchy, though today I've started to feel the pain. (Was wondering why they sent me home with Vicodin, even though I didn't need any pain meds while in the hospital.) I saw an infectious disease doctor in the hospital to confirm the shingles. He tried to tell me they weren't related to chemo which I find really hard to believe. Just look at the roll call here, and I've never in my life known anyone with shingles. Oh, and I'm 36! Nowhere near the typical age for shingles (or for BC, but that's another story.) That doc did tell me that actually getting shingles is like getting the shingles vaccine -- better actually, because your immune system relearns how to keep the virus suppressed. Most people don't get shingles more than once. We can hope! Agree with you all wondering why we don't get the vaccine before treatment. There's obviously a clear risk for them during/after treatment and it's the last thing we need on top of everything else!  ",
      "MessageIndex": 18,
      "PostDate": "26/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768149",
      "Title": "Shingles >:-( lago Teka"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Apr 29, 2011 04:57AM Beeb75 wrote: Hi Lago, sorry to say that a different kind of pain sets in during the second week. I also had that raw/sunburn feeling, painful to put pressure on...for the first week. Then I started taking Valtrex and the redness subsided and the blisters started to dry up. That's when I started having more \"nerve pain\". It's basic sporadic, shooting pains that feel \"deep\" or like a bruise. Not crippling by any means, but uncomfortable. I haven't taken any pain meds for it (but again, I have a pretty mild case with just one affected area on my back.) Good luck!",
      "MessageIndex": 49,
      "PostDate": "29/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768149",
      "Title": "Shingles >:-( lago Teka"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jun 6, 2011 10:59AM Beeb75 wrote: Hi all, I love, love, love Dr. Van Zee. She really is wonderful. Extremely smart and knowledgable, kind, patient. Can't recommend her more highly. Also, I felt comfortable with her because she was the recommendation of a doctor friend of mine who had done a fellowship in the department there. So he had the inside scoop. Heerdt was his other recc. It's true what the other ladies here say in terms of getting to MSK. I also live in Queens and getting to appts is a bit of a pain. But I am getting a work-out these days making my way there every day for radiation. It's also true that the plastic surgeon there (at least the one I worked with) is conservative with size. My one dissatisfaction with my results is that I lost a full cup size (went from C/D to big B.) Now, I had always wanted a smaller chest, so this is my chance to try it out and see if I like it. But it's a little hard to get used to and I need a whole new wardrobe. (Now I know why smaller-chested women like to complain.)  If you don't have a lot of extra body fat, you will only really be a candidate for implant reconstruction, and you will be limited by the size of your rib cage (essentially.) Shiramg -- what was your reconstruction technique that made you bigger?  ",
      "MessageIndex": 13,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/769734",
      "Title": "NYC surgeons sara1970 Hortense"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jun 6, 2011 01:35PM Beeb75 wrote: Good luck on your exchange surgery! I had mine almost 3 months ago. I was in a bit of pain for a day or two after surgery, but it went away fast. And the implants are a big improvement over the expanders in terms of comfort.",
      "MessageIndex": 16,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/769734",
      "Title": "NYC surgeons sara1970 Hortense"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Feb 11, 2011 04:34AM Beeb75 wrote: Yep. It's normal. That's what they've offered me. Breast, underarm, and collarbone. Those are the areas where breast cancer can reappear as a \"locoregional recurrence.\"",
      "MessageIndex": 2,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764718",
      "Title": "Help me find an answer please Polyana anneflorida"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 22, 2011 01:25PM Beeb75 wrote: Hi Socks, There's really no way to estimate the chances that more lymph nodes are affected. Every person's case is different. However, overall, it is more rare to have many lymph nodes affected. Lots and lots of lymph node positive patients only have 1. But even if your mom has more, the treatments can be very effective in stopping the disease in its tracks. Best of luck to her! ",
      "MessageIndex": 1,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772018",
      "Title": "Did you have lymph node involvement? Some questions? Pinkfuzzysocks34 edwards750"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jun 7, 2011 08:32PM Beeb75 wrote: Don't let the MRI results scare you too much -- they show a lot of false positives. My pre-surgical breast MRI showed 4 areas of concern, 1 of which two different doctors were certain was cancer. I did get them all biopsied before surgery and none were cancer. Glad you are able to go ahead with your scheduled surgery. Good luck!",
      "MessageIndex": 6,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770017",
      "Title": "Ultrasound shows suspicious lymph node. So scared Chrys23 Beeb75"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Oct 17, 2011 07:07PM Beeb75 wrote: This idea may be a little out there, but for those of us who are premenopausal with hormone-sensitive cancers, I've wondered how our monthly cycles of estrogen and progesterone play into our cancer growth rate.  For example, if you had a biopsy at a time of the month when estrogen or progesterone was surging, wouldn't you then have more cells dividing (fueled by your hormones)? And if you then had surgery at a different time of the month when your hormones would lower, perhaps you would then have a lower mitotic rate, or Ki-67? Just an idea -- because I have always been confused by the fact that I had a fairly high Ki-67 (20 percent) and yet my tumor was called \"slow-growing\" by some docs because it was so highly ER and PR positive (90+ percent for both).   ",
      "MessageIndex": 9,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705247",
      "Title": "Ki 67 vs Mitotic Rate ck55 papaska4"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Mar 10, 2011 03:58AM Beeb75 wrote: Hi Christine, I just finished chemo 3 weeks ago. I had ACT (same drugs, different regimen.) I too wanted to quit when I had 2 more to go. I really had to push myself to finish. But now, I am really glad I did. I feel like I've done everything possible to keep the cancer from coming back. Chemo is a little like running a marathon -- there are definitely moments when you just don't want to do it anymore. But in the end, you will be very proud of yourself for having the strength to get through it. That said, talk to your oncs about ways to lessen the side effects...talk to us here at BC.org, too. What is bothering you the most? At the end, I was bothered most by my dead taste buds and painful fingers and toes. I started drinking fruit smoothies and got a lot of pleasure out of them. And I started asking people to do the things that hurt my fingers (open packages, mail, etc.) And just baby yourself -- take days off, bubble baths, naps, whatever works for you. Better to get the chemo over with now, then have the cancer come back and need chemo/treatments for life. You can do it! Beeb ",
      "MessageIndex": 4,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/765974",
      "Title": "TAC, anyone stop early? christine47 Luan"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 18, 2011 10:12AM Beeb75 wrote: I thought even if you just have one first degree relative with breast cancer, your risk is double or triple that of the general population (so instead of 1 out of 8, it would be 2 or 3 out of 8, right?) ",
      "MessageIndex": 10,
      "PostDate": "18/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/771720",
      "Title": "High risk breast surgeon undergoes PBM... Soccermom4force alexandria58"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Sep 13, 2011 01:04PM Beeb75 wrote: Chluvr, usually, people with a positive node (like me and you) are recommended for chemo. I did chemo. Ellie, a 5 cm tumor would mean a 50 percent recurrence risk WITHOUT treatment. Plus two nodes at 6 percent additional per node, would mean a 62 percent recurrence risk WITHOUT treatment. With treatment, you can typically cut the recurrence risk by 2/3, so you'd be left with about a 20 percent recurrence risk after all the treatment.  ",
      "MessageIndex": 14,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774689",
      "Title": "Size vs # of nodes ck55 Kay_G"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Sep 13, 2011 05:14PM Beeb75 wrote: Pure, It is in the technical reports section of lifemath.com/cancermath.com.  http://www.lifemath.net/cancer/about/techreports/technical_report_1.pdf. This is probably not the be all/end all explanation of breast cancer recurrence risk...but it's an interesting one developed by researchers at Harvard and validated, I believe, using real SEER data sets.  Sweetbean, yes very true. Also the things like aspirin, alcohol, etc. There's more we can do to reduce our recurrence risk. Also, there are always new treatments coming out. I don't know if drugs like Herceptin are really factored into the mathematical model, for example. ",
      "MessageIndex": 21,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774689",
      "Title": "Size vs # of nodes ck55 Kay_G"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Sep 13, 2011 06:58PM Beeb75 wrote: Hi Starbeauty, I'm not sure if there's been a randomized, controlled (aka gold-standard) study on aspirin, but I think there was a retrospective one that showed among a large population of women who'd had BC, those who took aspirin regularly had fewer recurrences. My onc is not completely convinced, but she OK'd me taking a baby aspirin 3X a week. Aspirin can cause GI bleeding in some people, so you need to be careful and check with your doc if it's OK for you to take it, but I think the theory has something to do with the COX gene which gets activated in some breast cancers and which aspirin foils.....or something like that. ",
      "MessageIndex": 23,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774689",
      "Title": "Size vs # of nodes ck55 Kay_G"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Sep 15, 2011 08:35AM Beeb75 wrote: Many, I think it meant to be a rule of thumb rather than a certainty. After all, it doesn't really even make sense for someone to have more than 100 percent chance of anything. I only posted it because someone asked about the relative importance of tumor size vs. nodes. It offers some information about that. But all of this information is incorporated into the model at Cancermath.com, so that is a much more reliable source if you want to figure out specific recurrence/mortality rates.  If you plug your wife's data into Cancermath, you will see that with treatment, she has a 70+ percent chance of beating her cancer. That's pretty darn good! Wishing you and your wife all the best. ",
      "MessageIndex": 29,
      "PostDate": "15/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774689",
      "Title": "Size vs # of nodes ck55 Kay_G"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jun 28, 2011 10:16AM Beeb75 wrote: Can you get a referral to a breast surgeon and ask for a biopsy or to have the cyst aspirated? I wish I had pushed harder for an answer when I was told my lump was \"nothing\" or worse, \"healthy breast tissue.\" It was cancer. (not that yours will be. But, it either is or it isn't, might as well figure it out ASAP so you can either deal with it, or stop worrying.)",
      "MessageIndex": 1,
      "PostDate": "28/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/770908",
      "Title": "I dont feel confident in radiologist jhunnicutt36 jhunnicutt36"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Mar 25, 2011 11:56PM Beeb75 wrote: I can't remember exactly when I was able to sleep on my side post-BMX, but for as long as the tissue expanders were in, I had to tuck my hand under my side to cushion the area where the expander met the rib cage. Good luck! ",
      "MessageIndex": 7,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/766583",
      "Title": "Suggestions on comfortable sleep positions after BMX shannonW Beeb75"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Feb 10, 2011 11:29PM Beeb75 wrote: Hi KrisKat, I think oncs like to start chemo between 4 and 6 weeks after surgery, so even if you wait until you return from your trip, you should be just around 6 weeks. That's when I started mine. Good luck! ",
      "MessageIndex": 840,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Sep 13, 2011 07:03PM - edited Sep 13, 2011 07:03PM by Beeb75 Here's some info on the aspirin study I was talking about: http://www.breastcancer.org/risk/new_research/20100216c.jsp Also seems like a Q&A on this site does not recommend aspirin to prevent recurrence, but seems like something that it can't hurt much to try. Anyway, I am, as I mentioned, with my onc's OK for a thrice weekly baby aspirin. ",
      "MessageIndex": 24,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774689",
      "Title": "Size vs # of nodes ck55 Kay_G"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Sep 13, 2011 11:15AM Beeb75 wrote: These researchers at Harvard suggest that cancer follows a mathematical model (which I think is so wild.) They actually figured out how size of tumor and number of lymph nodes play into the recurrence risk mathematically. (This is all explained over at the site Cancermath, in the technical reports, which is where I found it.) Basically, the tumor size correlates to recurrence risk with each additional millimeter adding one percentage point to the recurrence risk. So a 5 mm tumor would have a 5 percent recurrence risk. A 6 cm (that is, 60 mm) tumor would have a 60 percent recurrence risk. Each positive lymph node adds, I think, 6 percent to the recurrence risk. Keep in mind that whatever the total recurrence risk is -- given the tumor size and the positive nodes -- it can be cut by 2/3rds with adequate treatment. So even someone with a large tumor and many nodes can have their recurrence risk brought down dramatically to pretty good odds, with treatment. And, there are definitely cell characteristics that play into recurrence risk, like receptors, and grade, and type (with ILC less likely to recur, I believe.)  Also, from the data I've seen, the modern treatments save the lives of around 75 percent of Stage 3 BC patients. (Please forgive me for posting out of Stage. And I hope this doesn't scare anyone. But since the question was asked, and I happened to know the answer, I thought I'd post it.) ",
      "MessageIndex": 11,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774689",
      "Title": "Size vs # of nodes ck55 Kay_G"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 17, 2011 02:22PM Beeb75 wrote: Good article. There were a number of things in there that made me feel better about my decision to do bilats (like the three young women who recurred in their 'good' breast)...and about my chances of beating my cancer.",
      "MessageIndex": 4,
      "PostDate": "17/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/771720",
      "Title": "High risk breast surgeon undergoes PBM... Soccermom4force alexandria58"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 7, 2011 07:21PM Beeb75 wrote: SusansGarden. You say\"...... but this still doesn't prove that rogue cancer cells were \"killed\" in the above situation.  It could merely mean that this particular person never would have had a recurrence in the first place.  Such as there are many that have chemo/hormonal therapy ..and they STILL move on to a recurrence or Stage 4.  So it still makes me wonder if recurrence fate is really determined at time of surgery/discovery. And that if you don't have a recurrence ~ you were cured from the beginning (i.e. it was fully removed at surgery/radiation) regardless of what adjuvant therapy route you did or didn't choose.\" You are right that for any individual's situation, we have no idea if they were cured at surgery, cured by adjuvant therapy, or not curable no matter what they did. But the studies show that a percentage of women are curable by adjuvant therapy, and that's why we all do it. Just to give you an example. If 100 women had my exact cancer stats, 45 would die of cancer within 10 years, even if they had surgery. If everyone also did adjuvant therapy of chemo and anti-hormonals, then only 17 would die of cancer within 10 years. But, we just don't know who would have been the 55 who didn't need additional treatment, who were the 28 who benefited from treatment and who would not have been helped no matter what treatment they did. But the overall drop in breast cancer death rates...even among younger women dx with the disease, shows that whether the adjuvant treatment delays or prevents recurrence, the effect is the same. Those women live to die of something else, hopefully at a ripe old age.  There are probably three factors that determine the fate of a breast cancer patient. The first is the type of cell that becomes cancerous. The second is when the cancer is discovered. The third is what type of treatment is chosen and used. But it's NOT true that if you don't have a recurrence you were definitely cured by surgery. Some percentage of the women these days who do not have a recurrence were \"cured\" by adjuvant treatment. Studies show a clear difference in outcomes between people who do adjuvant treatment after surgery and those who do not. I can point you to such studies. ",
      "MessageIndex": 48,
      "PostDate": "07/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 7, 2011 09:53PM Beeb75 wrote: Here's another population-based look at breast cancer death rates from 1996 to 2006.  You can see that they have declined for all age groups. I think it's most interesting to look at the info for the women under 40, since this is a group that does not get mammograms (therefore, their cancers are more likely to be detected in lump form, and are NOT super-early stage.) And yet, death rates have also dropped dramatically for this age group (by 30 percent) even though incidence has held steady or even increased.  www.prb.org/Articles/2009/brea...  The only explanation that I can think of that would explain this data is that treatments are working and \"curing\" more women than in the past. (By \"cure\" I mean making sure that breast cancer cells do not threaten the woman for the rest of her life.)",
      "MessageIndex": 68,
      "PostDate": "07/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 8, 2011 12:35PM Beeb75 wrote: Athena, That New York Times article is old, and it uses even older data (death rates from 1990-1994.) And yet if you look at the interactive chart for breast cancer, it shows a downturn in the death rate that began at about that time. In the 70s and 80s, it was pushing 30 per 100,000 women (age and population adjusted) In 2000 it was 27.1 per 100,000 women (age and population adjusted) It's currently 24 per 100,000 women (age and population adjusted) (Note that the US population is about 312 million people, so a drop of 6 per 100,000 means about 10,000 fewer women PER YEAR, will die of breast cancer, than would have in the past.) And, breast cancer incidence has risen over time.)   So contrary to what you wrote above... If you get breast cancer today (\"today\" being 4 or 5 years ago) your chances of surviving it are not much better than they were in 1950.  ... quite the opposite is true. You have a *much* better chance of surviving it today.  ",
      "MessageIndex": 84,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jan 16, 2011 12:07AM Beeb75 wrote: Highly educated and respected breast surgeons still perform ALNDs, so the question is why? Surely not for mere staging purposes. My surgeon (who went to Harvard Med...just sayin') told me \"Lymph node ratio is important.\" Well, you can't have a low ratio unless a lot of nodes are removed, that's just high school math.   So what about studies like this one? http://www.ncbi.nlm.nih.gov/pubmed/12217299 RESULTS: Node-negative patients with < 14 lymph nodes removed had a 10 year survival of 79% compared with 89% in patients with > or = 14 lymph nodes removed (P=0.005). The 10 year survival for patients with an LNR > or = 0.2 was 52%, compared with 73% for patients with an LNR < 0.2 (P<0.0001). A Cox proportional hazards model showed that, for node-negative patients, only age and total number of removed lymph nodes were significant prognostic factors. For node-positive patients, age, total number of removed lymph nodes and the LNR were significant risk factors for survival outcome. The LNR was also significantly associated with the presence of distant metastases during follow-up (hazard ratio 3.56, range 1.63-7.77).  There are numerous studies about the importance of lymph node ratio. And clearly, our breast surgeons believe they our improving our chances for survival by getting us a better ratio (by taking more nodes.) Would the ALND naysayers care to respond to this point? ",
      "MessageIndex": 40,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763385",
      "Title": "Axillary Node Dissection Sereena thenewme"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jan 16, 2011 01:59AM Beeb75 wrote: Hi Mathteacher, The study was looking at the relationship between number of lymph nodes removed and lymph node ratio, and survival and it found: RESULTS: Node-negative patients with < 14 lymph nodes removed had a 10 year survival of 79% compared with 89% in patients with > or = 14 lymph nodes removed (P=0.005). The 10 year survival for patients with an LNR > or = 0.2 was 52%, compared with 73% for patients with an LNR < 0.2 (P<0.0001).   Doesn't that info alone make you want have more lymph nodes removed? If I'm missing something, please explain! I do find the abstract from San Antonio interesting, though perhaps not definitive. Two things that concern me: the study closed early due to low accrual/event rates...and I also wonder if the almost identical survival rates at 5 years have more to do with current chemo and hormonal treatments that \"push\" any relapses that will happen further into the future....Would love to see 10- and 15- year results!   EClaire: Yes, I think your oncologist will want to be more aggressive with your chemo/hormonal treatment if you have lots of positive nodes. There are currently three \"levels\" of chemo and as they increase in potential efficacy, they also increase in serious side effects. Also, the duration/intensity of your hormonal treatment might be affected by your nodal status. Put simply, the more nodes involved, the higher your chance of relapse and the more your doctor will want you to hit the cancer hard, with everything they've got, to keep you disease-free.  As a real-world example: I had an allergic reaction to my first Taxol and my doctor suggested I quit chemo then (after 4 AC and 1 Taxol) and go straight to Tamoxifen. She said that with 1 node positive, I don't have a super-high risk of recurrence, and there was a chance another Taxol treatment could send me into anaphylactic shock (which could kill me). Another woman told me that when she developed a rash after Taxol, her oncologist was like, \"Sorry about that rash, but you've got to finish chemo\" and that was because she had lots of positive nodes, so chemo was more crucial for keeping her cancer-free.  Also, now that I think about it, node number also comes into play for radiation. My radiation oncologist ultimately recommended skipping radiation of the axillary area and doing chest wall only, because my axillary was \"treated\" surgically, through the ALND (and radiation would increase my risk for lymphedema). If you have no positive nodes, or 1-3 nodes, you may or may not need axillary radiation (the dreaded \"grey area\") But if you have 4 or more positive nodes, they will definitely want to radiate that area. Best of luck!",
      "MessageIndex": 44,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763385",
      "Title": "Axillary Node Dissection Sereena thenewme"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Nov 4, 2011 08:43PM Beeb75 wrote: I lost weight at the start of chemo (while on AC) but the taxane didn't affect my stomach as much so I gained it back. Then, I've been so worn out from all the treatment that I've gained additional weight (8 lbs total). Not a ton, and I really believe it's from inactivity. Chemo just makes you so fatigued that you lie around a lot more than you did before! I think I'll be able to get into better shape once my energy returns.",
      "MessageIndex": 2,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777563",
      "Title": "Weight Gain 3girls"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Dec 15, 2011 07:40PM Beeb75 wrote: Ck55, The answer is -- depends on the person and the pathology. In a person with a 1 cm tumor and 8 positive nodes, it is the nodes increasing the recurrence risk. In someone with an 8 cm tumor and 1 node, it is the size that is more responsible for the recurrence risk.  But it's not an either/or...the two factors get added together to come up with the recurrence risk. ",
      "MessageIndex": 42,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774689",
      "Title": "Size vs # of nodes ck55 Kay_G"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Sep 13, 2011 02:06PM Beeb75 wrote: Hi Cyndi, A 25 percent chance of recurrence means a far better chance of NOT recurring. Look at it that way. Plus, I think ILC is a little different, with a lower chance of recurring. AND you had the best receptor combo. AND you're already 5 years out from diagnosis. I think you're in pretty good shape! ",
      "MessageIndex": 17,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774689",
      "Title": "Size vs # of nodes ck55 Kay_G"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 8, 2011 11:31AM Beeb75 wrote: Athena, you say: If you get breast cancer today (\"today\" being 4 or 5 years ago) your chances of surviving it are not much better than they were in 1950.  What makes you think that? ",
      "MessageIndex": 82,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 9, 2011 05:43PM Beeb75 wrote: Hmmm. I think going deaf on Tamoxifen or blind from a chemo infusion *are* especially rare. And we *do* know how many lives are saves, we just don't know exactly which lives they are. That's the cost benefit analysis Beesie was talking about. I had an almost 50 percent chance of dying of breast cancer in 10 years (and I was 35 at dx) with no adjuvant treatment after surgery, so for me, the choice was easy. But if I had been older, or earlier stage, my decision might have been different.",
      "MessageIndex": 179,
      "PostDate": "09/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 8, 2011 11:17AM - edited Jul 8, 2011 11:21AM by Beeb75 Athena , you say:  Rather, you have to ask the question: \"if 100 people get disease X today, what proportion, if any, will die of it?\" How about 20 years ago? 50 years ago? Let's compare.  By that standard, we have made amazing strides in breast cancer! Because the actual numbers of breast cancer cases have risen dramatically over time, while the actual numbers of deaths from breast cancer have fallen. So more people are getting the disease, but fewer people are dying from it. How to explain? There are two thoughts: 1) Mammogram technology has enabled us to detect very early (and easily treatable) breast cancers, and perhaps even cancers that would never have been a threat to a woman's life. So we count those as diagnoses when they might have been the kinds of cancers that would never have grown fast or metastasized. 2) The treatments for breast cancer are \"curing\" some women. (And I always use the word \"cure\" to say that they are doing something to the cancer cells -- killing them, making them dormant, knocking the tumors back to a level that they don't come back to threaten the women before she dies of something else.) That's why I suggested looking at the data for young women. You can isolate out the mammogram effect and see the treatment effect. Young women don't get mammograms, so their cancers are still not caught early -- yet, they get aggressive treatment and their death rates from cancer have dropped.   P.S. Also to address the idea of competing causes of death -- we haven't had a WWIII, or major epidemic, and medicine is doing better in terms of treating other potential causes of death like heart disease, AIDS, etc. Lifespan is increasing, so I don't think that plays strongly into the data. Rather, I would argue that cancer is increasing in its prevalence because we *don't* have those competing causes of death. People are avoiding the early killers of the past (like childbirth, infectious disease) and living long enough to get cancers, which generally increase as we age. ",
      "MessageIndex": 78,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 8, 2011 03:23PM Beeb75 wrote: VR, You and I read that \"however\" in very different ways. It says: \" Treatment significantly reduces overall breast cancer mortality through 15 years of observation.                  However, the average overall effect on mortality ratios is less than that for recurrence, particularly among women in the older age group, and there is no statistically significant trend over time (P for time trend > .1).\"               In my understanding, it is pointing out that while fewer women recur, some are dying from late effects of their treatment. Basically, they seem to be saying. \"Great! We've figured out how to stop breast cancer in its tracks in many women. Now what are the long-term effects of these treatments?\"",
      "MessageIndex": 108,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 9, 2011 09:18AM Beeb75 wrote: So, that study shows that mammogram screenings lead to 11 out of 2000 women being treated for BC, but only one of them was helped by treatment. (the other 10 had non-threatening cancers.) Is it worth it? I guess it depends on which woman you are. And there is no way of knowing in advance.",
      "MessageIndex": 143,
      "PostDate": "09/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 9, 2011 02:34PM Beeb75 wrote: Treatment does prevent recurrences in some women. That much is clear. It's the mechanism of prevention that the OP seems to be asking about. Does treatment just delay the recurrence for 100 years, so that the person dies of something else? It doesn't matter, because a dead person can't have a recurrence. So the recurrence has still been prevented (through a long delay). Again, the simple way to ascertain that is to look at the number of women dx with breast cancer, vs. the number of women who die from it. Only about 20 percent die from it. The rest have had recurrences either prevented, or delayed beyond the end of their life.  However, no one knows if they will be the person who does have a recurrence. I deal with it this way -- since, after all of my treatment, I will have about a 15 percent chance of recurring, I allow myself to worry about it 15 percent of the time. The other 85 percent of the time, I have to assume I'm cured. Cary1, whether or not you ever have a recurrence,  your cancer history means that you are likely to need lots of medical care in the future -- whether for monitoring of recurrence/new primaries; for after-effects of treatment; for taking medications, etc. I'd say it's key to have good health insurance. But, I'm sure there are other ways to get that, without necessarily sticking with your current high stress job.   I agree with you, that the Obama Health Plan left a huge gap for people like us. But, it is what it is. Only time will tell who treatment has worked for, and who not. Nobody has a crystal ball.  Your onc should be willing to tell you about your recurrence risk. If not, Adjuvant Online and/or CancerMath can also calculate it. But again, that doesn't tell you whether or not you will recur, only how many women did out of a 100 women with cancers just like yours and treatment just like yours. ",
      "MessageIndex": 165,
      "PostDate": "09/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 9, 2011 03:12PM Beeb75 wrote: The other problem with the health care bill is that it required each state to offer a plan for high-risk people (like us.) You are guaranteed entry for a 'reasonable' premium. However, one of the conditions of eligibility is that you cannot have had health insurance for 6 months before enrolling in the high-risk plan. That would mean that someone like me or Cary1 would have to give up our insurance and go without it for 6 months in order to qualify for the state's high-risk plan. Well, that would obviously be terribly risky for any of us, so we have to hang onto whatever insurance we currently have, or can get -- even if it costs an arm and a leg (like mine) and has coverage gaps. ",
      "MessageIndex": 168,
      "PostDate": "09/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 7, 2011 05:17PM Beeb75 wrote: I think the bug/exterminator analogy is a good one. Remember that the definition of Stage IV is not that you merely have cancer cells elsewhere in your body. It's that you have tumors in other organs that are big enough to be visible using the current screening tools we have (CT, MRI, PET, Bone scan.) I believe they need to be at least 1 cm to be detectable by PET, for example. So early-stagers may have cancer cells floating around, and they may even have started new 'colonies' in other organs...but if they are still small enough to not be visible with the technology we currently have, we are not Stage IV. Many early-stagers probably have this situation going on, which is why, if they only get surgery some percentage (depending on stage and cancer cell type) will eventually develop tumors in other organs. We get chemo and hormonal therapy to attack and try to either kill or make dormant any remaining cancer cells. To the question of why chemo can obliterate (apparently) smaller colonies of cancer cells, but not bigger ones, the reason seems to be that as tumors grow, the cells continue to mutate and develop resistance to would-be killers like chemo or our immune system. A 2 cm tumor has more than a billion cells. So among those billion, there will be some that can survive chemo and can keep growing. But if you have, say a 2 mm micrometastatic deposit on an organ, there would only be a few million cells, and you might be able to kill them all with treatment.     This must be why the studies show better outcomes for early stagers who get chemo and/or hormonal therapy, vs. those who do not.  And while it might seem reasonable to think that treatments only \"delay\" recurrence, the evidence doesn't support that. If it were, all the younger cancer patients (who can go on to live decades, if they beat their cancer) would eventually recur. But they do not.   ",
      "MessageIndex": 37,
      "PostDate": "07/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jan 15, 2011 04:22PM Beeb75 wrote: My understanding is that the purpose of axillary dissection is not ONLY to stage the cancer, but also to ensure that all the cancer is physically removed. If one node is positive, they want to remove the others just in case they are harboring any cancer cells themselves. And there IS evidence that removing more lymph nodes correlates to to better cancer outcomes -- perhaps it's because some of those other lymph nodes actually have cancer cells in them (even though our current technology may not detect them.) Check out this study: http://www.ncbi.nlm.nih.gov/pubmed/20421053 It basically found that people who had a low ratio of positive lymph nodes to all lymph nodes removed ratio had better outcomes. So a person who had 1/30 did better than the person who had 1/2 who did better than the person who did 1/1. I did see the other study referenced above by other posters and thought it was interesting (and worried I'd had an ALND for nothing) but studies contradict one another all the time -- no one should make a decision based on a single study but on the weight of all the evidence. You can research lymph node ratio to find other studies on that topic. My surgeon is at Memorial Sloan Kettering in New York, and I know everyone there stays on top of all the data and acts aggressively on all fronts to get better survival rates. For me, lymphedema is a risk, but it was a risk I had to accept for a better chance at survival. (And yes, I had to rely on my brilliant surgeon's experience and wisdom to guide me.) Recovery was slow and steady, but I am close to full range of motion now (4 months after surgery) and have no sign of any lymphedema at all. I was advised to try to stay at a healthy weight to keep that risk low. ",
      "MessageIndex": 26,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763385",
      "Title": "Axillary Node Dissection Sereena thenewme"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Mar 21, 2011 02:35AM Beeb75 wrote: Sorry for posting out-of-stage, but thought my experience might help since I lost my taste buds on Taxotere. I kept a lot of gum around (citrus type flavors were good) and that kept the bad taste at bay during non-meal times. For meals, when nothing else tasted good, for awhile I turned to smoothies. I always kept some bananas cut up and frozen in the freezer. I'd throw them into a blender with other fruit -- pineapple or strawberries or blueberries or mango (I found that tart flavors tasted best) -- added some ice cubes, orange juice, yogurt, honey (got creative and just tried different combos) -- and blended it all together. For more calories/protein, peanut butter, milk, honey and frozen bananas were really yum.",
      "MessageIndex": 10,
      "PostDate": "21/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766387",
      "Title": "Taxol-How do you cope with loss of taste buds? GodsPioneerWoman GodsPioneerWoman"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 7, 2011 09:06PM Beeb75 wrote: Here is a meta-analysis of relevant, randomized controlled trials of various chemotherapy and hormonal therapies with 15-years of follow-up. You can see how at the various time points, there are fewer recurrences and deaths among those who got treatment (it varies a lot, of course, for age, stage, receptors, etc.) \"Effects of chemotherapy and hormonal therapy for early breast cancer on recurrence and 15-year survival: an overview of the randomized trials.\"  www.ctc.usyd.edu.au/cochrane/p... ",
      "MessageIndex": 66,
      "PostDate": "07/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 8, 2011 11:26AM Beeb75 wrote: VR, Interesting article: the info that jumps out at me: Treatment significantly reduces overall breast cancer mortality through 15 years of observation.   And...  In addition, there is a substantial risk of dying from non-breast cancer causes as the length of follow-up increases,  Well, isn't that the whole point? I mean, no one is going to avoid death entirely. It will be the final outcome for us all. But our goal after a breast cancer diagnosis is to keep the disease from killing us. If something else kills us eventually, we've achieved that goal.  ",
      "MessageIndex": 80,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 8, 2011 12:47PM Beeb75 wrote: And let me just post two data points. In 1996, 184,300 women were diagnosed with breast cancer; 44,300 died of it.  In 2010, 209,840 women were diagnosed with it, and 39,840 died of it. So you can see your chances of surviving breast cancer today are much better today than they were even in the mid-90s. It's hard to find data going back to the 1950s, and frankly, I don't see how it would be very useful anyway, since as you rightly point out, data collection was different back then, and the useful treatments for BC didn't come about until the 90s. (Tamoxifen became the standard of care in the mid-90s, and the chemo regimens have developed over the past decade, with dose-dense ACT and Herceptin arriving in about 2005.)   ",
      "MessageIndex": 85,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 8, 2011 01:34PM Beeb75 wrote: I didn't use percentages at all. I used rates and raw numbers. The data for breast cancer in the Times article stops at 1994. That's really old and there is much more recent data available (2003-2007 is the most recent data set). I provided some of it above. No woman's individual outcome can be predicted based on statistics, of course. But we can look at the big picture, and if 10,000 fewer women per year are dying of breast cancer, that's really excellent for those 10,000 women and their families and they are all really thrilled about it.   That women still die of breast cancer, that anyone dies of any cancer, is more than disappointing to me. It's devastating. Still, that doesn't mean we can't be glad about the progress that *has* been made and the lives that *have* been saved. And we don't need to spout falsehoods to raise outrage. It only kills credibility. The provable facts are bad enough -- nearly 40,000 women die of breast cancer every year in the U.S. Treatment doesn't work for everyone and better ones are needed. But they do work for many, thank goodness.",
      "MessageIndex": 88,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 9, 2011 12:17PM Beeb75 wrote: The question has been answered. Whether adjuvant treatment prevents or delays recurrence, the results are the same. Fewer women diagnosed with breast cancer are dying from it. Therefore, the treatment has saved some lives...or life/years, more accurately, because no life can be saved forever. We all do end up dying of something -- whether BC that didn't respond to treatment; a late-term effect of treatment; or something else entirely. Although all studies have flaws, like all people, it doesn't make them worthless. Taken together, they have yielded a wealth of information about breast cancer, treatment, effects, etc.  ",
      "MessageIndex": 157,
      "PostDate": "09/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Jul 12, 2011 10:12AM - edited Jul 12, 2011 10:13AM by Beeb75 Chevyboy, regarding Tamoxifen, you say: \"Maybe it does benefit a lot of women, but does anyone KNOW just how much?  I mean IF you take this for 5 years, and have no evidence of recurrence, does that mean that the Tamoxifen did this, or could we also assume that even without, your body would not have developed any more cancer? And what about the women who do NOT take Tamoxifen, with early stage BC...and they have NED after 5 years....???   There really is no proof, right?\"   We absolutely have proof that Tamoxifen prevents recurrence in some women. Studies have looked at groups of women with similar ages/stages of cancer and compared those who took Tamoxifen with those who did not. Fewer women who took Tamoxifen had recurrences (local AND distant).  Since doctors are not able to look inside our bodies at the cellular level to see who has cancer cells growing, and which of those cancer cells respond to Tamoxifen, we don't know in advance, or even after the fact, who Tamoxifen has worked for. But they know that it does work for some. The question really becomes: which group of women do you want to be part of? The group that takes Tamoxifen and some will have a recurrence prevented because of it? Or those who don't take Tamoxifen, and therefore don't have that extra recurrence-preventing tool. It is a gamble, but one that can be quantified to make the decision easier. With no nodes and a small cancer, you probably don't have a high recurrence risk to begin with, so Tamoxifen would only save a few percent who would have had a recurrence. But for someone like me, Tamoxifen would prevent recurrence in about 12 out of 100 women who take it (55 would be cured with surgery alone; chemotherapy would help another 21.) A percentage will not be helped by either chemo or anti-hormonals. Again Tamox might only help a small percentage of very-early-stagers, but if I were among those who did end up with distant metastasis, I would regret my decision to skip a recurrence-preventing tool. Tamoxifen side effects may be annoying*, but distant recurrence is essentially always fatal. But everyone has to make that decision for herself.  * Note: those with serious/unacceptable side effects from Tamox should obviously try something different. ",
      "MessageIndex": 278,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771245",
      "Title": "Adjvnt Therapy: Destroys or delays growth of stray BC cells? SusansGarden Omaz"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Aug 15, 2011 04:12PM Beeb75 wrote: Mine went up during chemo but came down afterwards, though they are still much higher than the pre-chemo levels. I am 6 months out. My MO was not concerned, just wanted to keep an eye on them.",
      "MessageIndex": 4,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/773011",
      "Title": "Liver enzymes high. Wendyspet Beeb75"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "May 24, 2011 08:52PM Beeb75 wrote: I know someone who was diagnosed with early stage (maybe stage 3?) breast cancer while pregnant. She was able to be treated with chemo while pregnant, had a healthy baby, then did more chemo and surgery. Docs know how to treat pregnant women with breast cancer, so don't feel you need to terminate for treatment's sake. And fingers crossed that your liver lesions are benign!  That said, chemo can be rough -- especially with little children in the mix. Do you have family/friends close by? Now's the time to rally the troops. There's lots of support out there from organizations too, if you don't have family/friends who can help...whatever you end up deciding. Wishing you the very best! ",
      "MessageIndex": 6,
      "PostDate": "24/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769368",
      "Title": "Does this sound like liver mets? Any hope for me? katie31 katie31"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Sep 16, 2011 02:45PM Beeb75 wrote: Maybe he was saying that you have a \"risk for systemic disease.\" That is probably because you are Her2+  If they haven't found any cancer outside of your breast or local lymph nodes, then you do not have Stage 4 disease. Best of luck with your treatment! ",
      "MessageIndex": 2,
      "PostDate": "16/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774986",
      "Title": "systemic risk mclvig"
    },
    {
      "AuthorID": "Beeb75",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118875/profile",
      "Content": "Nov 29, 2011 10:35PM Beeb75 wrote: Cp418, You and I have the *exact* same diagnosis down to the percentages of ER/PR and Ki-67. Weird! I was diagnosed in 2010 and it was chemo for me (though I was also only 35.) My onc wouldn't do Oncotype either, just recommended chemo (dose dense ACT.) P.S. I love the links you post to new studies and data...I'm a research junkie too. ",
      "MessageIndex": 41,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778800",
      "Title": "Chemo and Breast Cancer - Another Perspective PlantLover LtotheK"
    }
  ]
}