{
  "AuthorID": "beegee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144872/profile",
  "Posts": [
    {
      "AuthorID": "beegee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144872/profile",
      "Content": "Jul 17, 2012 03:16AM beegee wrote: Very sorry, Orlandopark.  I will pray for you.  I wish I could think of something to say that would bring you comfort now.  Praying for you to stay strong and positive... Cancer really rots! ",
      "MessageIndex": 14,
      "PostDate": "17/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/790566",
      "Title": "moving on to stage IV orlandpark1965 Gitane"
    },
    {
      "AuthorID": "beegee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144872/profile",
      "Content": "May 22, 2012 08:31AM beegee wrote: I am 5 months PFC, and my hair is shorter than most men I know.  And it's curly which I never had before.  I was very surprised at how long it is taking to grow.  Last week I got a haircut, and there was a pathetic little tiny pile of curls on the floor, but boy did it make a difference.  I started sporting my short, grey, curly do since then.  I'm kind of liking it.  It's funny getting past the debut appearances with all my friends, coworkers, etc.  I work with kids on the autism spectrum, and yesterday, a nine year old boy greeted me, and promptly said, \"Boy, you're getting older and older.\"  Just when I was starting to feel good about my almost Jamie Lee Curtis look!  Then his sister, who is 4, kept asking me about my hats, and I told her I'm not wearing them anymore because I got a haircut.  When I was about to leave, she asked me for a kiss and hug, which I realized afterward, was so she could \"cop a feel\" of my curly rug.  Then she shyly asked me, \"Are you a girl?\"   That got me some belly laughs, which felt great!  I told their mother that I was going to put that in my book whenever I write it.  Kids are so precious!  But now I'm re-thinking the grey thing.  Maybe I'll go back to coloring my hair... ",
      "MessageIndex": 15430,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "beegee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144872/profile",
      "Content": "Jul 16, 2012 08:24PM beegee wrote: Hey Oaktown, You're pics are amazing.  I finished chemo on Dec 5, and my hair now is much shorter than yours.  But I'm happy to have what I have.  I started going without hat/scarf or wig mid May, and I have had two trims. I love that it's curly.  For the first time in my life I have \"wash and wear\" hair.  ",
      "MessageIndex": 183,
      "PostDate": "16/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780790",
      "Title": "What a difference a year makes jennyboog Yndorian"
    },
    {
      "AuthorID": "beegee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144872/profile",
      "Content": "Jul 16, 2012 09:09AM beegee wrote: When I was diagnosed, I heard the words \"locally advanced\" but did not know the stage.  There was skin and chest wall involvement so that put me in stage 3b which I really was not attentive to until after I was done with treatment. I don't like what I read about 3b, so I talked to my onc about it.  I am doing everything I can, and as far as I know, at this time, I don't have cancer.  Every case is different, even within the stages.  I'm enjoying my \"cancer free\" status for now, and living healthy and happy, hoping that it will last for the rest of my long life.  The staging is important for the treatment planning, but we can always beat the odds that the staging suggests.  One thing my onc said is that the subjects in the studies that we are reading now were treated many years ago, and didn't have the treatments available to them at that time that we do now.  So, ladies, we are now making new statistics, as we speak. ",
      "MessageIndex": 64,
      "PostDate": "16/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "beegee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144872/profile",
      "Content": "Jul 17, 2012 06:28AM beegee wrote: I am so glad that I read this thread.  I completed radiation on April 2 this year, and in the last three or so weeks, I have had an intermittent cough.  I'd have these spells a few times a day that would last a few minutes, and then go away.  I kept telling myself (hoping) that it's just a cold or virus, but otherwise, not sick feeling at all.  I have an onc appt on Aug 2, so I can ask about it then, and, hopefully confirm that I'm ok.  But just knowing that it could be radiation fibrosis, and not lung cancer is very hopeful for me. I was never told about radiation fibrosis during my treatments. Shelly, your tag line is funny! ",
      "MessageIndex": 5,
      "PostDate": "17/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785561",
      "Title": "RADIATION FIBROSIS many bevin"
    }
  ]
}