{
  "AuthorID": "BeEnough",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260296/profile",
  "Posts": [
    {
      "AuthorID": "BeEnough",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260296/profile",
      "Content": "Sep 26, 2017 01:36PM BeEnough wrote: Add another. Stage IIB 2007; stage IV mets to liver 2017.",
      "MessageIndex": 421,
      "PostDate": "26/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "BeEnough",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260296/profile",
      "Content": "Nov 19, 2017 10:21PM BeEnough wrote: pajim, thank you for the description of getting this diagnosis as a kind of death. That is the most accurate description I have heard and helps me make more sense of these last 10 months. Likessquirrels, it takes courage to make changes. You have it. I rarely post but have read much on this forum. The ladies here have an overwhelming amount of courage, sympathy and knowledge. ",
      "MessageIndex": 27,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/859691",
      "Title": "Question about Cold hearted doctor Likesquirrels BeEnough"
    },
    {
      "AuthorID": "BeEnough",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260296/profile",
      "Content": "Nov 30, 2017 11:41AM BeEnough wrote:",
      "MessageIndex": 6794,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BeEnough",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260296/profile",
      "Content": "Dec 29, 2017 01:07AM BeEnough wrote: Z, sorry to hear you are in pain and concerned about your port. I've had my port since February. Both the port site and the tube into my neck were uncomfortable for a number of months but not to the extent that I couldn't get out of bed. I still guard both sites particularly when my grandchildren are around. I love the port and am willing to deal with the slight discomfort. kaylynne, I take cold/allergy meds on a semi-regular basis and they don’t affect my liver enzymes. I hope you find a good answer to your problem. ",
      "MessageIndex": 7052,
      "PostDate": "29/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BeEnough",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260296/profile",
      "Content": "Oct 27, 2017 11:56AM BeEnough wrote: lisbet54, Yesterday was the start of my 8th month of weekly Taxol. I too am older (old, really). I do have some neuropathy but for me it is quite manageable; some tingling in my fingers and some numbness in my feet. My MO suggested I take Alpha Lipoic Acid and Gabapentin to help with the symptoms. I sometimes have fleeting strange sensations in the days right after infusion but nothing that I would characterize as strong tingling. The Weekly Taxol for Stage 4 has a lot of very good info. I'm sure the ladies there would have a lot of good suggestions for you. Please do not lose hope. I have not posted on this or the Weekly Taxol thread before today. I have read all of the posts on both threads and am so very impressed with the courage, knowledge and compassion you all have shared. My heart goes out to those ofyou who are so young.",
      "MessageIndex": 6366,
      "PostDate": "27/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BeEnough",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260296/profile",
      "Content": "Nov 29, 2017 05:40PM - edited Nov 29, 2017 05:42PM by BeEnough I got to spend yesterday in the ER for a nose bleed that would not stop. There was too much bleeding for the them to cauterize my nose so he put some cocaine in the offending nostril and then inserted a nasal balloon pack. My platelets were fine but my protime was high so they gave me a shot of vitamin K to help the protime recover. I don't know if the protime was high ecause my liver is having problems (my liver enzymes have been fine) or if Taxol is causing it. I see my MO tomorrow in conjunction with more chemo. Your thoughts would be appreciated.",
      "MessageIndex": 6783,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "BeEnough",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260296/profile",
      "Content": "Dec 5, 2017 09:22PM BeEnough wrote: Lisbet, I have had no liver pain. The only way I know the Taxol is working is because the scans show a decrease in the size of the tumors and because my TMs continue to fall. My last scan showed only one tumor decreasing in size with the others stable. TMs seem to be leveling off also. This is month nine on Taxol for me. Not sure how aggressive my mets are but TMs went up about 10% in two weeks before I started chemo. My thoughts are with all of you.",
      "MessageIndex": 6870,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    }
  ]
}