{
  "AuthorID": "Bekah66",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203524/profile",
  "Posts": [{
    "AuthorID": "Bekah66",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203524/profile",
    "Content": "May 8, 2015 08:10PM Bekah66 wrote: Hi Diane I'm coming into this conversation late but I hope you're doing well with your port. I was adamant against having one at first ... the thought of \"something in me\" freaked me out. I had a long talk with my oncologist and although he was very neutral in his thought of getting the port in, he did mention to me that the chemo drugs are very strong and could do damage to my veins/arm (I had 6 rounds of TC, followed by a year of herceptin). His concern was the fact that I play piano for a living and if I had severe issues with my arm it would effect my job. I took the hint and got the port. It was done under twilight sedation and I can honestly say it was a great decision for me. I've had no problems with infections. The only issue I ran into was when it got very cold the area around my port got very sore (first time it happened I thought I was having mild chest pains and was convinced I was having a heart attack ... I tend to over-react). It was explained that when it gets cold, the bottom plastic part of the port also gets cold and irritates the chest muscle it's sitting against. So I just layered up and wore a big warm scarf and was fine. My family refers to it as my \"Perdue turkey button\" ... like the ones that pop out of a Thanksgiving turkey when it's done cooking. My own personal temperature indicator :) My port and the catheter are both visible under the skin (the port sticks out, and you can see the cath tube if I point it out). Now that summer's coming I'm a little concerned about that and wearing tank tops in the hot weather but I figure when I get hot enough I won't care. So in the grand scheme of things, I'm glad I did it. It causes very little discomfort and I think it hurts less to get the needle poke there then when they take my pre-treatment blood draw. Good wishes for continued success with your port!!!",
    "MessageIndex": 15,
    "PostDate": "08/05/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/145/topics/829140",
    "Title": "Anxious about the port.. DavisD Bekah66"
  }]
}