{
  "AuthorID": "bellajr",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108621/profile",
  "Posts": [
    {
      "AuthorID": "bellajr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108621/profile",
      "Content": "Sep 6, 2010 11:30PM - edited Sep 6, 2010 11:31PM by bellajr I had discharge for a year before I went to the doctor.  Two weeks ago I had a diagnostic mamo and ultrasound along with a biopsy all in the same day.  It turned out to be a tiny papilloma with mild hyperplastic change.  I have seen three surgeons and two think i should have the ductal excision and one wanted an MRI and possible surgery.  Since the biopsy I have had no discharge so I could wait on it and follow up for six months.  My papilloma did not show on the mamo so make sure you get a diagnostic mamo and ultrasound.  You will need a good tech to find it.",
      "MessageIndex": 7,
      "PostDate": "06/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/757379",
      "Title": "Waiting for Mammogram After Discovering Bloody Discharge dido1 leaf"
    },
    {
      "AuthorID": "bellajr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108621/profile",
      "Content": "bellajr wrote: I had nipple discharge for one year before I went and had a diagnostic mamo and ultra sound along with a core biopsy all in the same day.   They found a very small papilloma with mild hyperplastic changes.  I have gone to see a few breast specialists and two of them recommended a small out patient sugary to remove the part of the duct where the papilloma is.  The third doctor wanted to do an MRI and surgery.  I found out that my insurance will not pay for the MRI and that the radiologist that performed the biopsy thinks that the MRI is over kill.  I am kind of afraid of getting the MRI because of false positive readings and it will be $1,600 out of my pocket.  The two surgeons who only recommended the surgery also mentioned that I could wait and follow up every six months since it looks like the radiologist may have got most of the papilloma during the biopsy.  I am concerned about the surgery.  Does anyone know if the duct excision causes an increased risk of breast cancer or how invasive is it?  Also if I get the MRI I may not need the surgery if it shows everything is clear. There is one side of me that wants the MRI but on the other hand I am concerned about the false positive readings that could occur and start unnecessary stress and further testing.   The papilloma is no longer seen on the ultra sound since the biopsy and the discharge is gone so I am confused as to what to do.  Any advice on 2mm-4mm papilloma with mild hyperplasitc change? If the biopsy was B9 could there still be cancer cells? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/757670",
      "Title": "Breast Papilloma! bellajr barbe1958"
    },
    {
      "AuthorID": "bellajr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108621/profile",
      "Content": "Sep 7, 2010 06:30AM bellajr wrote: Thanks for the information.  The logical way of thinking is to wait on it but the surgeons make me feel there still could be some cancer cells in there.  Thanks again.",
      "MessageIndex": 3,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/757670",
      "Title": "Breast Papilloma! bellajr barbe1958"
    }
  ]
}