{
  "AuthorID": "bella2013",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
  "Posts": [
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Oct 14, 2018 07:06PM bella2013 wrote: My gyno found my lump. He measured it at 5 cm. When I went for my diagnostic mammo and ultrasound it was measured at 1.5 cm. When I had my breast MRI it measured close to 5 cm. When I had the lumpectomy it was true to the MRI",
      "MessageIndex": 1,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867760",
      "Title": "Your mass size difference from mammogram to ultrasound Abumponthebod letsgogolf"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Apr 4, 2018 09:16PM - edited Apr 4, 2018 09:18PM by bella2013",
      "MessageIndex": 4,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/863733",
      "Title": "Mastectomy after a lumpectomy Daczahow bella2013"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Apr 4, 2018 09:20PM bella2013 wrote: I was diagnosed in December. Had a lumpectomy in my left breast in January. My nodes were clear but my margins were not. I had two places that were not clear. My breast surgeon said that there was no breast tissue left in those areas. All that was left was skin over muscle. He said he would have to remove a large portion of skin in order to get the spots in question. I opted for BMX with DIEP Flap Reconstruction. I am six weeks post op. I do not regret my decision. The decision to have a BMX was easier for me to make because I had a simple mastectomy. Because we learned so much about the cancer when I had the lumpectomy, I did not have any more lymph nodes removed and I did not have my chest muscle removed which is done in a radical mastectomy. My Oncotype Score was 14 which took chemo and rads off the table. I am on day 3 of Anastrozole. If I had chosen BMX as the first step in my treatment plan I would have chemo and rads.",
      "MessageIndex": 5,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/863733",
      "Title": "Mastectomy after a lumpectomy Daczahow bella2013"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 16, 2018 08:51PM bella2013 wrote: Maiyen, I second the suggestion to go to MD Anderson. I went to their cancer center here in Jacksonville. I loved my cancer team and my nurse navigator. I loved the team approach...everyone was on the same page regarding my treatment plan. There is no such thing as a “common” breast cancer. Ten women could have IDC and each would have their own treatment plan different from one another. The size of the breast cancer tumor, the location of the tumor in the breast, the stage of the cancer, the grade of the tumor all go into deciding your surgery and treatment plan. It makes me want to scream that a female gynecologist would have such a cavalier attitude about where to go to get treatment. She should be your advocate and pave the way with a referral to MD Anderson or another breast cancer center. I just can’t say enough about the team approach. If you have to find your own surgeon and your own MO and your own RO and your own PS...ugh...that is such hard work when you are navigating new territory in your breast cancer journey. I wish you the best results and sending hugs as you proceed",
      "MessageIndex": 9,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864584",
      "Title": "43 and Diagnosed This Morning maiyen Mquara"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jan 10, 2019 01:52PM bella2013 wrote: Toy, Breast Cancer is a huge disruption in our lives...but it is doable...many of us have walked this path...at the time of diagnosis we were all overwhelmed and stricken with fear. We go through a period of shock and denial. What you are feeling and experiencing is normal. After you get the results of the MRI, you will have a clearer picture of your treatment plan. If you have a biopsy report you might consider posting the results. If you press MENU at the top of this page, go to Settings. It will give you the opportunity to fill in your diagnosis. Please set them to Public. Only your BCO members will be able to see your cancer stats. It really does help other people respond to you appropriately based on your tumor stats. You can do this! I am not going to say, “you got this!” None of us “got this”. What I am saying is that it is doable. Take a Valium or a Xanax before your MRI. It will take the edge off and might even give you an opportunity to nap during the MRI. Blessings, Barbara",
      "MessageIndex": 4,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/869269",
      "Title": "just diagnosed MRI tomorrow Toyamjj bella2013"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jan 10, 2019 10:10AM bella2013 wrote: Toy, that’s a complicated question. I am assuming that if you are having your breast MRI then you had the biopsy and have some info about your tumor. Just doing a search on other cancers that are hormone receptors brought up uterine and ovarian cancer. The breast MRI is the best diagnostic tool to see if there are additional tumors in your diseased breasts that might not have been detected yet. Sometimes tumors can hide. The breast MRI will also determine if there is anything suspicious in your other breast. The breast MRI is not a whole body MRI. It is specific to the breast. It gives your BS, MO, and RO the best information to determine your treatment plan...i.e., lumpectomy with chemo and rads or mastectomy. Take a deep breath...try not to focus on things that are unknown...you have a good team and they will guide you to the best possible treatment. You have many years ahead where you will battle the dark fears of a recurrence. Take this one day at a time. You will feel better when the tumor has been removed",
      "MessageIndex": 1,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/869269",
      "Title": "just diagnosed MRI tomorrow Toyamjj bella2013"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 16, 2018 04:17AM bella2013 wrote: please go to the discussion group, “Worried and need advice.” Dom7mom posted on April 24 very similar symptoms to what you are having. The symptoms may not be the same but it might be worth reading. Keep us posted!",
      "MessageIndex": 3,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864627",
      "Title": "What tests should I insist on? (Possible ibc) LunaSunset LunaSunset"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 15, 2018 08:24PM bella2013 wrote: Luna, do you have a gynecologist? Your gyno would probably be able to diagnose exactly what is going on and set the wheels in motion for mammo, ultrasound or some other diagnostic procedure. Do you have a hospital with a breast cancer center close by? If so, ask your pcp to refer you for evaluation. Hopefully, the np you will be seeing will be a woman who will see the urgency of the situation for more evaluation. It’s quite possible that if you don’t have a gynecologist and called one with the urgency of possible inflammatory breast cancer they might see you right away. You have to advocate for yourself! If you are not comfortable with the evaluation or diagnosis push for referrals to a BC surgeon. Praying that it’s benign...whatever it is",
      "MessageIndex": 1,
      "PostDate": "15/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864627",
      "Title": "What tests should I insist on? (Possible ibc) LunaSunset LunaSunset"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jan 10, 2019 12:27AM - edited Jan 10, 2019 12:29AM by bella2013 Amyrn I had BMX with DIEP Flap Reconstruction. It took five weeks before I turned the corner. The pain will eventually subside. I didn't drive until I was five weeks post op. The DIEP Flap involves a major incision from hip bone to hip bone. It was the pain and tenderness from that incision that kept me from driving. You just had a huge surgery. Your breasts are going to settle down. I am eleven months post op and mine have softened. As your breast heal your PS will show you how to gently massage them (don't do that yet). I had my nipple tattoos done in November. It makes such a difference. I do know that fat tissue is heavier and more dense than breast tissue so if you were to have DD's they are going to be heavy. The underarm sensitivity will calm down. I call week three post op “hell week!\" You are so tired of hurting and you do want your body back! I promise you it will get better. If you can't wear a soft sports bra then maybe try a snug fitting tank top. If you can't get any relief from the nerve pain then consider asking your PS for Gabapenten. The Oxycodone and 800 mg Ibuprofen didn't touch the pain. I didn't know about Gabapenten until I was already healed. Sending you healing ((hugs)). You can do this! The worst is behind you!! P.S. Did you have the robotic surgery",
      "MessageIndex": 1,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869256",
      "Title": "Post op bilateral mastectomy w/free flap reconstruction amyrn129 amyrn129"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Aug 11, 2018 04:59PM bella2013 wrote: Amica, I am so sorry you are having to fight so hard for treatment. I wanted a PET Scan too because I did not have chemo or rads. My Oncologist said no to CT or PET Scan, stating there was no protocol to order either of them. My nodes were clear but my margins were not. Of course I had a huge fear of cells floating around. I had two lumps appear near my SNB. I was sure that they were scar tissue but I went back to my BS who also thought I didn’t have anything to worry about but sent me to my breast center for an ultrasound. My sister was with me and told him I wanted a PET Scan. He asked why my MO would not order one. I explained her reasoning. He said he would order a PET Scan and use the two new lumps as the reason for the Scan. He said we may not get it but he would fight for me. I had the PET Scan in June. It came back NED. I fired my MO and I meet my new one this Monday. Since you are having a recurrence and it has metastasized...surely that is reason for a PET Scan. Maybe you could find a MO who is willing to treat you and not just toe the line with the gov’t. It is so frustrating and I am so sorry that on top of having BC you have another monster (gov’t) to fight. Sending you ((hugs))",
      "MessageIndex": 144,
      "PostDate": "11/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/866087",
      "Title": "Anyone want to sit and wait with me? ColleenS80 Amica"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 5, 2018 01:02PM bella2013 wrote: I had pain at my SNB site for several weeks following my lumpectomy and then again after my BMX with DIEP Flap reconstruction. My under arm pain was the same as you describe. Placing a small soft pillow under my arm helped quite a bit. At my hospital, they gave mastectomy/lumpectomy patients heart shaped pillows that fit comfortably under each arm pit. Do you still have your drains in? Mine hurt very badly while the breast drains were in. Once the drains came out I did get some relief. My pain didn’t lift until 5 weeks post op. I had reconstruction too so that added to my delay in healing",
      "MessageIndex": 22,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743290",
      "Title": "pain after sentinel lymphnode biopsy mimi1964 Kushie"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Aug 31, 2018 01:45AM bella2013 wrote: Colleen, thanks for sharing",
      "MessageIndex": 231,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/866087",
      "Title": "Anyone want to sit and wait with me? ColleenS80 Amica"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Sep 3, 2018 10:33AM bella2013 wrote: Princess Pincushion, your reference to Psalm 3 reminded me of my favorite song by the Brooklyn Tabernacle Choir. Go to YouTube and search “Thou O’ Lord”. It is based on Psalm 3. Stand by to be blessed beyond measure😇.",
      "MessageIndex": 95,
      "PostDate": "03/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/861804",
      "Title": "Afinitor and Faslodex combo ABeautifulSunset Mimito3"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Aug 31, 2018 02:24AM bella2013 wrote: Colleen, can you post that on “The Dumbest Things People Have Said To You/About You. I tried to post it but I am not smart enough to do that. Valentina7 could really benefit from reading this. Thanks so much",
      "MessageIndex": 232,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/866087",
      "Title": "Anyone want to sit and wait with me? ColleenS80 Amica"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Sep 22, 2018 11:50PM bella2013 wrote: Fritz, I am so sorry that you have to find yourself here. You will find kind, loving support here on these boards. You are in shock right now, we have all been through it. Try not to let your mind go to worst case scenarios. You don’t have all the information about your cancer yet. Having hormone positive receptor cancer is treatable and survivable. When you meet with your BS on Monday maybe he will be able to share the Stage of your cancer. He will also discuss surgical options...lumpectomy or mastectomy. You should have a medical oncologist (MO) on your team to discusss chemo and/or rads. You have another full time job...research and read everything you can about your cancer. Breast Cancer.Org (BCO) is a good resource to use. There are many articles regarding cancer treatment and current research. Stay away from wacky websites that do not have integrity. Remember to breathe...this is a long road and there are no quick fixes to BC. In the days to come you will have so much information coming at you and important decisions to make that you never dreamed you would have to make. Knowledge is power. Take someone with you to every appointment. Seriously, every appointment. I took my husband and sister. I am glad I took both because this cancer diagnosis was happening to him too. My sister heard things we both missed due to shock and fear. Your #1 goal is to be cancer free! Use every tool available to throw at this beast. Please check in on Monday and let us know the update. We are here for you. I am praying for peace and strength for you. ((Hugs)",
      "MessageIndex": 336,
      "PostDate": "22/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/866087",
      "Title": "Anyone want to sit and wait with me? ColleenS80 Amica"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 15, 2018 12:26AM bella2013 wrote: Kelligirl, do take the Ativan as you get to the hospital. The prep is the most nerve racking. You need the Ativan for the prep. You will be under for the surgery. Make sure you go home with pain meds. You will need them for a day or two. Blessings for a successful surgery. Praying for clear nodes",
      "MessageIndex": 107,
      "PostDate": "15/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 22, 2018 02:00PM bella2013 wrote: HikingLady, I will be thinking of you today. It was 3 months ago today that I had BMX with DIEP Flap reconstruction. It’s wonderful that your husband is an RN. You will soon have this behind you and will be healing. So sorry you find yourself back here again. BMX is the way to go to help eliminate a recurrence. It’s a big surgery just give your body time to recover. Reconstruction results are amazing. You can have beautiful breasts again",
      "MessageIndex": 178,
      "PostDate": "22/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 27, 2018 02:30PM bella2013 wrote: Marena, welcome back! So happy to hear that your surgery went well and you found a Shero in your surgeon. Stay ahead of the pain and the constipation that can be a SE of the pain meds and you will do well. Keep us posted",
      "MessageIndex": 244,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Feb 6, 2018 01:25AM bella2013 wrote: Mrsmcg, the Oncotype Score is determined by your tumor. After your doctor removes your cancerous tissue it is not only sent to the pathologist to determine if your margins are clear but it can be sent to Genome Health, I believe that’s the lab that looks at 21 genes that make up your cancer. They issue a score on a scale of 0-100. The lower the score the lower the risk of recurrence. It is an exceptional tool to have to map out your treatment. My Oncotype Score is 14. I have a 14% chance of recurrence. If I go on hormone treatment it lowers my risk to 9%. Knowledge is power! I would insist on the Oncotype DX. Most insurances cover it. Genome Health states they have a payment plan if your insurance does not cover it. Praying for miraculous results for you",
      "MessageIndex": 15,
      "PostDate": "06/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862183",
      "Title": "Invasive Ductal Carcinoma Mrsmcg BarredOwl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Sep 20, 2018 04:29PM bella2013 wrote: Tristaan, my heart is breaking for you and your family. I am praying for comfort and peace. Princess was a precious sister in Christ. It helps to know she is with her Savior. In His name, Barbara ",
      "MessageIndex": 9763,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Nov 11, 2018 03:49PM bella2013 wrote: Grannax,congratulations! That was a great video! Thank you for going out of your comfort zone and sharing your story! It’s a big deal! You have blessed all of us💜",
      "MessageIndex": 10117,
      "PostDate": "11/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 9, 2018 04:33PM bella2013 wrote: I am becoming convinced that experiencing pain or not could have something to do with the location of the breast tumor. Some women fly through these procedures without feeling a thing...some of us experience a great deal of pain. My tumor in my left breast was at the 1:00 position. It was quite large and stretched under my nipple. I had an ultrasound guided biopsy. The US was more painful that the diagnostic mammogram. I was experiencing pain with my tumor so the pressing on it during the US was uncomfortable. My radiologist was a woman and was patient to let the lidocaine take effect before she would proceed. The worst part of the biopsy is the waiting afterwards",
      "MessageIndex": 78,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 30, 2018 10:47PM bella2013 wrote: Usually Respritory Therapy comes in for a visit after surgery. They usually bring it with them. I was given one for my outpatient lumpectomy, but again I had low oxygen levels coming out of the anesthesia",
      "MessageIndex": 289,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jun 12, 2018 05:19PM bella2013 wrote: I never knew the value of medical marijuana until I had my BMX. Faithsmama if it’s legal go for it! I had the tightness too. It will get better. My PS’s PA said that it’s kind of an incremental thing. It will lessen and at the same time I get a little more used to it. Take care of your pain level!! You can’t heal when your body has to deal with the pain. Praying for pain free and cancer free breasts and chests",
      "MessageIndex": 410,
      "PostDate": "12/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Aug 30, 2018 07:11PM bella2013 wrote: sn75, sorry to hear that you are so sick. I think it takes about a year (without complications) to regain our stamina. April was not that long ago. Don’t feel guilty if you are still struggling. It will get better. Sending a warm gentle hug😊.",
      "MessageIndex": 718,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Sep 21, 2018 11:59PM bella2013 wrote: B84, I too was on board for a lumpectomy and rads. I had clear nodes but my margins were not clear. My left breast was going to be destroyed due to the amount of skin I would have removed. So I thought single mastectomy with an implant. After talking it over with my BS, I decided on BMX with DIEP Flap Reconstruction. That decision took chemo and rads off the table because my team already knew that my nodes were clear. I do not and have not regretted my decision at all. I felt certain that if I did not have my good breast removed it would become cancerous too. I am seven months post op and doing well. I am very pleased with my new firm breasts. I will get my 3D nipple tattoos in November...just before my one year anniversary of my diagnosis. It’s a big decision. You have come to the right place. Lot’s of experience shared in these discussion groups.",
      "MessageIndex": 755,
      "PostDate": "21/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Nov 15, 2018 09:00PM bella2013 wrote: Heather, I am sorry you find yourself here in this place. You will find love and support here. Your fear is very real. This path is very frustrating and scary. Take a deep breath. Just because they are going to biopsy the area in question doesn’t mean that it’s cancer. It is good that your team is being thorough. Most breast lumps are benign, especially at your young age. Keep us posted. Keeping you in prayer 🙏.",
      "MessageIndex": 1,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868363",
      "Title": "Core Needle Biopsy-Terrified! HeatherJS MaddieBrie1"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Sep 15, 2018 06:16PM bella2013 wrote: PP, just sent you a PM. Don’t respond. I know what to pray for now. It’s difficult to fathom the speed in which this diagnosis is going. There must be SOMETHING that can be done! You are not the author of your family’s grief. You didn’t cause this cancer. I know you don’t want them to hurt and be heartbroken, but that comes with the love you all have for one another. How is your DH holding up? Gentle hugs and strong prayers! Barbara ",
      "MessageIndex": 9711,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Sep 6, 2018 01:21PM bella2013 wrote: Moderators, can you jump in and help Pooki? Isn’t there a radiologist on BCO that might help her understand her report? Thanks",
      "MessageIndex": 2,
      "PostDate": "06/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867041",
      "Title": "Help! Confusion in Diagnosis/Staging Pooki WinningSoFar"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jan 13, 2019 11:16AM bella2013 wrote: Kec1972, It’s easy to assume that a Lumpectomy is just outpatient and not a big deal. That is not true. A lumpectomy is a major surgery. It’s basically a partial mastectomy. Not only was the pre-op difficult but you were likely under anesthesia for at least two hours. That’s a big deal. Also the emotional stress from diagnosis thru the lumpectomy takes a huge toll on you. Be good to yourself. If your body is experiencing fatigue just go with it and rest. You will get back to your normal energy level, but for now your body is telling you what it needs...lots of rest. Remember, your body has been battling cancer, it really is tired. Happy rest and lot’s of sleep for now! ((Hugs)",
      "MessageIndex": 21,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869094",
      "Title": "Recovery Time for Lumpectomy with sentinel node biopsy? kec1972 kec1972"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Feb 20, 2018 10:18PM bella2013 wrote: Beachygirl, I was given the same instruction when I had a lumpectomy and sentinel node biopsy on my left breast. I am having BMX on Thursday so I will be sure to ask questions about blood draws and BP",
      "MessageIndex": 1,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/862676",
      "Title": "Blood draws and BP on effected arm Beachygirl SummerAngel"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Nov 19, 2018 11:19AM bella2013 wrote: Grannax2, that is so awesome!!! We will pray that nothing interferes with this wonderful opportunity!",
      "MessageIndex": 10200,
      "PostDate": "19/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 9, 2018 04:21PM bella2013 wrote: My advice...in any of these breast procedures where you are not sedated...ask for a script for Xanax, Valium, Ativan, etc. There is nothing comfortable about any of these procedures, even if they are pain free. It helps to relax you and eases any anxiety and helps to tolerate any discomfort. Take it an hour before your procedure. Have someone drive you to and from the facility. ",
      "MessageIndex": 77,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 9, 2018 05:21PM bella2013 wrote: Joy, take deep breaths. You will do well. Did they give you a script for anti-anxiety? If not, call your BS today. You are soon to be on the other side of this surgery and will have it behind you. There is relief when you wake up and you know the tumor is gone. Praying for clear lymph nodes",
      "MessageIndex": 80,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 30, 2018 05:56PM bella2013 wrote: Ladies, the spirometer is important. After being under anesthesia it’s really important to do deep breathing to force that stuff out of your lungs. It’s a pain (literally) to do but it’s worth it to not get pneumonia on top of recooperating from the surgery. When your chest is bound up with bandages and feeling tight and painful the last thing you think about is breathing deeply. My O2 alarms kept going off while I was in the hospital. When I went home my DH and DS were deligent about making use the spirometer",
      "MessageIndex": 285,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jun 5, 2018 02:56PM bella2013 wrote: Marena, I am so sorry you are struggling with pain. I too had pain when my drains were removed, but I believe that is when the healing really begins. Do not be shy about asking for meds. You just had your breast amputated! That is a huge surgery! I have Xanax, a very low dose. One 30 Day prescription would last me a whole year. I would only take it if I was experiencing a season of insomnia and then would only take a half pill. When I was diagnosed I started taking .5mg every night at bedtime. My anxiety levels were so high and when my head hit the pillow my mind was racing. The Xanax helped me get a good eight hours of uninterrupted sleep. I continued that dosage through to two months post op then have tapered off to half a pill .25g. The pain relievers didn’t offer me any pain relief. The Xanax lowered the anxiety I had about the pain and let me drift off to sleep at night. If the pain relievers helped you by all means ask your surgeon for a prescription! Just because it wasn’t offered to you doesn’t mean he won’t give it to you. Experiencing pain that is affecting your ability to sleep is impeding your healing process. Go to your surgeon, gynecologist, or PCP...you will get help. Blessings!",
      "MessageIndex": 339,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jun 28, 2018 08:29AM bella2013 wrote: Runor, beautiful...",
      "MessageIndex": 4849,
      "PostDate": "28/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Sep 13, 2018 05:28PM bella2013 wrote: PP, I think God had surrounded you with His angels😇.",
      "MessageIndex": 9700,
      "PostDate": "13/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 10, 2018 01:08AM bella2013 wrote: 👍👍",
      "MessageIndex": 85,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 11, 2018 06:36AM bella2013 wrote: Marena, I took .5mg of Xanax. Timing on when to take depends when you are scheduled for your procedure. I took my dosage before I left the house because I am only ten minutes away from the hospital. I will be thinking of all of you in the coming weeks as you all approach your surgery date. Praying for clear nodes and quick healing",
      "MessageIndex": 90,
      "PostDate": "11/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 29, 2018 02:23PM bella2013 wrote: Marena, we have a lot of fluid pumped into us during and after this surgery. I could not believe how blown up I was when I returned home 48 hours after my BMX with DIEP Flap reconstruction. My legs were so enlarged. My PS said that our bodies are initially in shock from the trauma of the surgery and the fluids flow interstially. It takes awhile for our bodies to get it together and start releasing fluids like they are suppose to do. He said that it can take months for our bodies to release this fluid. Hydrate, hydrate, and hydrate some more. When you are resting keep your legs and feet elevated.",
      "MessageIndex": 271,
      "PostDate": "29/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jun 1, 2018 01:05AM bella2013 wrote: SLL101984, I don’t have TE’s but I do have breast from my DIEP Flap reconstruction. I use form fitting tank tops. It hides any imperfections of my breast and makes my clothes look good. I won’t get fitted for new bras until after stage 2 of my reconstruction. Hope this helps",
      "MessageIndex": 304,
      "PostDate": "01/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jun 2, 2018 08:35PM bella2013 wrote: Ladies, it will get better. I had the same pain you are describing under the arms and across my chest. It helped to put two small pillows under each armpit. It relieved that area of pressure and additional irritation of my arm rubbing against the tender areas. I had serious pain at my drainage sites under each breast/armpit. I couldn’t do anything about that pain until the drains came out. That area was as hard as a rock. I was taking Oxycodone which did not touch the pain. I alternated between 800 mg of Ibuprofen and extra strength Tylenol. It didn’t give me much relief either. Once I went without meds so I could have a half a glass of wine at dinner. To my surprise I had some relief. I am not advocating alcohol but at a moment when I was so miserable with unrelenting pain I got some relief. Some women say they turned the corner at week 3...for me it was week 5. Pain relief is coming...hang in there! Praying you move thru this season of pain quickly",
      "MessageIndex": 323,
      "PostDate": "02/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Sep 16, 2018 05:08AM bella2013 wrote: I wish I had been more prepared for the nerve pain. Going home with Oxycodone and 800mg Ibuprofin was childs play. I discussed with my PS at my phase 2 surgery the pain issue and he sent me home with Oxycodone and Gabapentin. Otherwise I was pretty much prepared for my surgery. I was told it would be a 4-6 week recovery. My brain processed that as 2-3 weeks! NOT!!! It was 5 weeks before I turned a corner. Just tell her to do everything the doctors say to do. Get Ivory Antibacterial soap and bath with that while incisions are healing",
      "MessageIndex": 737,
      "PostDate": "16/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jun 26, 2018 06:44PM bella2013 wrote: Nicole, Heartland is a great series to watch (great family movie, no violence, sex, or bad language. The writers do a great job of developing the characters. It will carry you through your treatment...Seasons 1-9 are on Netflix and Season 10 is on Amazon Prime. Gracie & Frankie is hilarious; Justified is excellent Longmire is excellent Night shift is very good (tales of the ER) Hart of Dixie (very light comedy, a little silly) I will list more as I think about them",
      "MessageIndex": 83,
      "PostDate": "26/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/865124",
      "Title": "Highly suspicious of malignancy Nicole1966 Nicole1966"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Apr 28, 2018 10:54AM bella2013 wrote: Congratulations Julie! How long did you take Hormone blocking therapy",
      "MessageIndex": 2,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/864278",
      "Title": "So thrilled to say: TWELVE YEARS TODAY! sugarplum InnaB2018"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 30, 2018 02:36PM bella2013 wrote: faithfulheart, I asked the same question. She answered it above on April 28th. She gave good info.",
      "MessageIndex": 21,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/864278",
      "Title": "So thrilled to say: TWELVE YEARS TODAY! sugarplum InnaB2018"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Feb 20, 2018 10:13PM bella2013 wrote: Sherryc66, so sorry you have an area in question. The biopsy is a sobering experience. It’s the beginning of the roller coaster ride. I pray your journey ends on Friday with a good report. This website is a good place to come to get information and support. Check back and let us know your results. Blessings...",
      "MessageIndex": 1,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862675",
      "Title": "Core biopsy today Sherryc66 TookieRN29"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Dec 11, 2018 02:03PM bella2013 wrote: Promises, fatigue is a symptom. The extreme fatigue is what sent me to my gyno and my PCP. My gyno found the lump. The fatigue lifted after lumpectomy. I do have some fatigue now due to the AI",
      "MessageIndex": 6,
      "PostDate": "11/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868794",
      "Title": "Major fatigue for over a year, now lump. Promisesmommy djmammo"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 27, 2019 11:20PM bella2013 wrote: MBPooch, I am 15 months post BMX with DIEP Flap reconstruction and I recently started having the tight band feeling I had post surgery. It lasted a couple of days and then eased off. I believe that healing is a process and on many levels we feel like we are healed but there’s always more healing that needs to occur. If you are concerned...check with your doctor",
      "MessageIndex": 1784,
      "PostDate": "27/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Feb 5, 2018 07:31AM bella2013 wrote: Diagnosed on 12/4/17 at the age of 60.",
      "MessageIndex": 823,
      "PostDate": "05/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jan 13, 2019 08:10PM bella2013 wrote: LabMom3, I had BMX with DIEP Flap Reconstruction. I was home and showering 48 hours after my surgery. You should not let any shower water hit your chest. You should turn your back to the shower head and let the water run over your shoulders and down your chest. I wore an oversized front opening sports bra (fruit of the loom from Walmart. My chest hurt down the my sternum also. When I drank cold or hot beverages I could feel it going down. It was so strange. Remember your chest had been through a lot of trauma. It will take several weeks to settle down. I can’t speak to the nipple attachment issue but I do encourage you to address the care specifically of that nipple. Ask him if you can choose to wear your own sports bra. Maybe even take one with you. At day 9 post-op with drains is about normal. My post-op appointment was on day 12. I had all four of them removed then. I thought if I exercised or moved around more that would help my body release the fluid! NOT!!! The calmer you stay the more your body adjusts and sends the fluid where it needs to go. Ask away!!! Someone here will try to answer your questions. It sounds like you are doing well",
      "MessageIndex": 3,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869332",
      "Title": "New here! 9 days post op questions Labmom3 Labmom3"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Dec 19, 2018 04:07PM bella2013 wrote: djmammo, everything that you stated is very true. The problem begins when the patient (owner of the breasts) is dismissed by her gynecologist...to the point he does a breast exam through her clothes...not exactly standard of care",
      "MessageIndex": 35,
      "PostDate": "19/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868794",
      "Title": "Major fatigue for over a year, now lump. Promisesmommy djmammo"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Dec 19, 2018 11:00PM bella2013 wrote: My BC Surgeon used that technique. That was the first time I had experienced that technique",
      "MessageIndex": 37,
      "PostDate": "19/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868794",
      "Title": "Major fatigue for over a year, now lump. Promisesmommy djmammo"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 16, 2018 01:55PM bella2013 wrote: Readyabout, sending hugs and warm thoughts for a smooth surgery and even smoother recovery",
      "MessageIndex": 116,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 26, 2018 02:55AM bella2013 wrote: Ladies who are suffering in week 2...it gets better. Hang in there! The pain and the tightness will lessen. Stay strong! The hardest part is behind you",
      "MessageIndex": 234,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jun 23, 2018 06:18PM bella2013 wrote: SLL, you are still new in your BC journey. He might still be processing your diagnosis and treatment. My husband retreated also and I couldn’t understand why. When I asked him he said, “you said you just want to be left alone...you need peace and quiet and space.” I did say that but not intended for him...I was telling him to explain why I didn’t want to socialize...stand around and chat after church, have friends over, etc. So once that got cleared up then we got back on track connecting emotionally not physically...but I was in so much pain I didn’t want to be touched except for a shoulder rub or a foot rub. I also asked my nurse navigator if there was a marriage counselor/therapist at the breast cancer center. There was and she said he was excellent. Sometimes I thought about us going together and other times I thought about going for myself. I also had my sister who walked this journey with me and was a great sounding board Men are made to conquer problems. They can’t fix this cancer diagnosis and I think they feel helpless. and scared. He may be withdrawing without even realizing it or because he doesn’t know what to do. We are in our 31st year of marriage and I can say that communication is so important. Even if he won’t talk about it he can listen to you and how you are feeling. He can hear what you need from him. Cancer is a full out assault on our bodies and our lives. Everyone close to us will be affected in some way. Listening to my husband respond to family and friends who were asking about me revealed a lot about how he was dealing with my breast cancer, especially after my BMX with DIEP Flap reconstruction. He was very protective of me in that he explained what a huge surgery it was and never gave the impression that I was just breezing thru it. He was honest about the pain I was experiencing and/or the lack of strength and stamina. That told me “he got it”. He got what I was going thru. This past week I received results from my full body PET SCAN. It came back negative, NED. No cancer anywhere in my body. That was such a relief. It is like a dark cloud that had been hovering over us was finally lifted. The future didn’t seem so uncertain. Laughter and fun has come back into our marriage. Continue to vent here! We are here for you. Barbara ",
      "MessageIndex": 492,
      "PostDate": "23/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jul 10, 2018 10:45PM bella2013 wrote: ReadyAbout, I agree with you! Starting with the diagnostic mammogram/ultrasound, biopsy, mri, lumpectomy with nuclear dye injections in the nipple, the SNB and then having our breasts amputated...we have crossed a new threshold of pain endurance. I don’t believe that people who have not been close to breast cancer realize the painful procedures that are involved with diagnosis and treatment. You are correct! NOTHING will come close to having a BMX.",
      "MessageIndex": 580,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jul 18, 2018 04:51AM bella2013 wrote: SLL101984, I am having my Stage 2 surgery this Friday. My PS is going to do fat grafting and will be taking fat from my hips for better proportions. I have not had liposuction before but I can imagine that I will have soreness in my hips. I am not expecting to experience pain in my breast since I can’t feel anything. He said recovery time is about a week. I have read that most take 1-2 weeks to recover. This recovery will be a walk in the park compared to my BMX with DIEP. Besides, I am taking advantage of my insurance covering this and especially this year since I have met my deductible! Good luck",
      "MessageIndex": 627,
      "PostDate": "18/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Jul 18, 2018 07:07PM bella2013 wrote: I could not sleep in our recliner, not enough back and neck support for me. I went to BBB and bought a memory foam wedge pillow. I put my regular pillow on top of the wedge pillow, put a pillow under my knees and a pillow under each arm. The wedge elevated me enough and an added bonus...it solved my sleep apnea! I continue to use the wedge, pillow under or between my knees and I hug another pillow to my chest when I sleep on my side",
      "MessageIndex": 631,
      "PostDate": "18/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 13, 2018 08:19PM bella2013 wrote: I slept in our guest room on a queen size bed. The bed is high so I had a step stool that made it easier to get in and out of bed. I had a wedge pillow and used my favorite pillow on top of it. I had a pillow under my knees and a pillow on each side of me. I was in a lot of discomfort and pain so I was concerned that I would keep him awake all night. I too had a small table that kept all my essentials next to the bed. I never had a problem with the drains leaking",
      "MessageIndex": 7,
      "PostDate": "13/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864570",
      "Title": "Where did you sleep in the weeks after BMX? Lea7777 Lea7777"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "May 24, 2018 12:41AM bella2013 wrote: Curious, I didn’t get relief from BMX pain until 5 weeks post op. The chronic pain just lifted. Give yourself a little more time...you might turn the corner very soon",
      "MessageIndex": 1666,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "bella2013",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264271/profile",
      "Content": "Sep 6, 2018 01:14PM bella2013 wrote: Pooki, hang in there. Someone will chime in soon",
      "MessageIndex": 1,
      "PostDate": "06/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867041",
      "Title": "Help! Confusion in Diagnosis/Staging Pooki WinningSoFar"
    }
  ]
}