{
  "AuthorID": "Bellapam",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256390/profile",
  "Posts": [
    {
      "AuthorID": "Bellapam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256390/profile",
      "Content": "Jul 23, 2017 10:38AM Bellapam wrote: My fellow Lady Vets! I am glad to find this thread because when I researched VA BC care, I got nothing but a page at the VA.gov site that says the VA is beginning to get more female vets. Yes, only now. In 2017 . My 66 year-old mother is also a vet, so I was very troubled to see that statement on a website only last night. Anyway, I am not even close to being diagnosed yet, but I am limited to the VA if I end up having cancer. I am 90% service-connected for disability, and right now I am in grad school, so no other insurance. Luckily I am near Fayetteville, NC, which has 2 large VA hospitals. I go there next week for the imaging tests. I thought I would revive this thread in case some other military members have joined this community since April. I would like to pass on any information I find concerning VA and BC treatments even if I have a b9 result. Best wishes, Pam",
      "MessageIndex": 6,
      "PostDate": "23/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/854455",
      "Title": "Veterans going through breast cancer treatment at the VA ParakeetsRule carmstr835"
    },
    {
      "AuthorID": "Bellapam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256390/profile",
      "Content": "Jul 24, 2017 05:49PM Bellapam wrote: Ladies, Are they that rough when they do the mammograms? I have heard it is worse for those with small breasts. Could it be the tugging and pressing from the procedure that made you sore? I hope you feel better soon! Pam ",
      "MessageIndex": 2,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857298",
      "Title": "Pain and swelling after mammo! Nimm Recap"
    },
    {
      "AuthorID": "Bellapam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256390/profile",
      "Content": "Jul 24, 2017 08:34PM Bellapam wrote: Tbone, I missed the part about you being sore for months. I would not expect it to last that long, either. I mean, maybe a few days if they needed to press harder. Nimm, I am glad they seemed to be careful about hurting you. Again, I hope it goes away or you both find out what it is and treat it. ",
      "MessageIndex": 6,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857298",
      "Title": "Pain and swelling after mammo! Nimm Recap"
    }
  ]
}