{
  "AuthorID": "ben50",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194090/profile",
  "Posts": [
    {
      "AuthorID": "ben50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194090/profile",
      "Content": "Jun 10, 2014 02:37PM ben50 wrote: I’m very sorry, I can imagine this must be extremely difficult for you. After our surgery, we were waiting on results and missed our doc’s initial call. She left a message that said she had our results and to call her back. We were thinking the same thing as you: “If it’s good news, why wouldn’t she just leave a message?” Well we called her back and it was good news, she just wanted to tell us in person. It could well be similar circumstances in your case.",
      "MessageIndex": 2,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/821854",
      "Title": "Need help off the ledge momand2kids momand2kids"
    },
    {
      "AuthorID": "ben50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194090/profile",
      "Content": "Jun 10, 2014 04:53PM ben50 wrote: So sorry you have to deal with this . Prayers are with you. I'll post this in case it brings you any marginal level of comfort and forgive me if it's not what you need right now -- but a quick Google search on papillary thyroid cancer says: \"The overall cure rate is very high (near 100% for small lesions in young patients).\"  Sounds extremely treatable!",
      "MessageIndex": 5,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/821854",
      "Title": "Need help off the ledge momand2kids momand2kids"
    },
    {
      "AuthorID": "ben50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194090/profile",
      "Content": "Mar 28, 2014 04:30PM ben50 wrote: springsoon- Sounds like you're getting your neoadjuvant' on soon. Good for you. Neoadjuvant chemotherapy is great (minus the side effects), particularly in Grade 3 cancers because chemo drugs target and kill fast multiplying cells. Therefore, the more aggressive the cancer, the more utility you get from chemo.  I must say, with neoadjuvant chemotherapy it was quite rewarding to tangibly observe my 26 year old wife's tumor melt away before our fingertips. By the second infusion, there were no longer anything to feel. Your experience might be different (we are Her2+), but treatment is really outstanding these days - know you're good hands. It will shrink (or destroy) your tumor and flush out your lymph nodes. Sending warm vibes and knocking on wood that you achieve a pCR. ",
      "MessageIndex": 2123,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "ben50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194090/profile",
      "Content": "Jun 10, 2014 01:15AM ben50 wrote: For your case, it pretty much all has to do with your Her2+ status in conjunction with your stage. Results have been very positive with neoadjuvant chemotherapy for aggressive cancers, so it has become standardized for most stage II-IIIers with high grade cancers (mostly Her2+ and Triple Negative). With neoadjuvant chemotherapy, one of the primary hopes or endpoints is to achieve a pathological complete response (pCR) which is the absence of any residual tumor cells at the time of surgery. Achieving a pCR  has big implications as you probably already know based on your waiting to decide about radiation until after surgery. So yeah, you're getting cutting-edge treatment. Perjeta was only approved last September.",
      "MessageIndex": 4,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/821821",
      "Title": "Confused as why everyone seems to have surgery first eva9310 april25"
    },
    {
      "AuthorID": "ben50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194090/profile",
      "Content": "May 29, 2014 07:48PM ben50 wrote: Oooohhhhhh man I feel your pain!! We've been living in the dreaded \"gray area\" for the last month or so and it truly is awful. My wife, 26, triple positive, got a pCR from neoadjuvant therapy, but because of the one original positive lymph node, we are also stuck making this incredibly difficult decision. What has made this decision infinitely more complicated is the fact that we are in our 20’s. With a pCR – even with one original lymph node – I feel like everyone would recommended we forgo radiation, however, because we’re young and the research shows cancer tends to be more aggressive in younger patients – our medical team is split. My wife, on the other hand, is afraid of secondary carcinomas from the radiation which would have a longer time to develop (apparently your chance of getting a secondary cancer from radiation –albeit very low- increases the further out you get form your treatment). So it’s a total crapshoot and there is no “right” answer. I think what it really comes down to is what YOU feel comfortable with and what will help you sleep at night. For our case, I’m 90% sure we are passing on radiation at this time. Some reasons include: the little research that does exist suggests radiation holds limited benefit for stage I-II women who achieve a pCR at the time of surgery (it’s soooo very under-researched), radiation is not without its side effects (even though our biggest fear is very, very rare, there is a price to pay), you can only radiate ONCE – so with our current good results in mind – having radiation as a weapon down the line is important, we are fortunate to be able to receive other adjuvant therapies Now that’s our case and while we both fall into the gray area, our circumstances being there are quite different. It doesn’t look like you achieved a pCR, which is not completely surprising to me as your diagnosis is Grade 2, ER+, which means you have a generally slower growing tumor which typically do not respond to chemotherapy as dramatically. Obviously the biggest and best news you have is clear lymph nodes and you’re opting for a BMX. With these variables in mind, I would feel comfortable opting out of radiation. Because of the N0, I believe you can feel pretty confident that it didn’t spread past your initial breast (though knocking on wood – nothing is 100% with this disease) but that’s how I would take it. Having a larger tumor matters less than lymph node involvement in the long run and because your opting for complete removal, I would likely be inclined to save radiation for down the road if necessary (knocking on wood again). However, other members here likely have a different take on your situation than me. I see a slower growing tumor (relatively speaking) with no lymph node involvement and because I got rid of all the tissue (boobies), I could feel comfortable with my decision (or my wife’s decision). Sorry for such a long reply! In a weird way, it’s almost refreshing to see someone going through the same challenge as us. Just like us, there will be no right answer in your circumstances and because of this, I believe you have to follow what you’re heart and gut tells you. Either way, we all need to come to terms and live with the decisions we make about our treatment.",
      "MessageIndex": 10,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/821365",
      "Title": "Anyone else is a radiation \"gray area\"? katiegrey TB90"
    },
    {
      "AuthorID": "ben50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194090/profile",
      "Content": "Oct 13, 2014 06:29PM ben50 wrote: Hi Anxious98, as a husband of a 25 year gal who was indeed diagnosed with breast cancer, I can definitely say you are doing the right thing. The stats are on your side, but it can still happen. It doesn't sound like you have felt an actual, tangible lump, but the golden rule is ask for a biopsy for that is the only actual way they know what something is. Too many times you hear docs, OBGYN's, oncologists, etc dismiss lumps in young women because \"their too young to get breast cancer.\" Now, do you have cancer? Honestly, probably not. But seriously -- do what you need to do to be sure. If I were you, I would ask for an mammogram or even better: an MRI, and a biopsy if there is a tangible lump. Feel confident knowing your chances of having breast cancer is comparable to that of a 70 year old man's. But like us, you could still hit the anti-lottery. So continue to be a good advocate for yourself and don't let your docs tell you are too young to have a certain test. You'll be just fine! ",
      "MessageIndex": 2,
      "PostDate": "13/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825086",
      "Title": "Am I doing the right thing? Am I overreacting? What do I do? Anxious89 ben50"
    }
  ]
}