{
  "AuthorID": "BernadetteD…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72548/profile",
  "Posts": [
    {
      "AuthorID": "BernadetteD…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72548/profile",
      "Content": "Nov 3, 2008 02:23PM BernadetteD wrote: It took awhile for my hair to return ( about three months) and because I am taking Arimidex it has returned very thin. The color was more gray than brown but I colored it and now it looks like it did before. However the thinness and short length are difficult. I live in Boston. Has anyone found a hairdresser who is good with hair after chemo?I dread going to a regular salon and having someone not understand, So far I am pushing it all back, which makes it look thicker. It curls at the back ( I always had curly hair ).Am taking selinium and zinc pills at the recommendation of a friend and spraying with Rogaine. But the dermatologist said that these only will keep it from getting thinner. I think a good haircut will soon be in order but want to find someone who knows about hair after chemo.",
      "MessageIndex": 546,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "BernadetteD…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72548/profile",
      "Content": "Nov 18, 2008 02:17PM BernadetteD wrote: Dana Faber has a boutique with a woman who is incredible in helping you get through it. I decided for me watching it fall out would be worst than doing it, so before chemo I went in and had her shave it. After it was done she massaged my hair with oils and told me to condition it and massage it with oil ( almond, mink, olive, whatever you like) regularly. She complimented the shape of my head and that helped a lot. We tried on wigs which the insurance company paid for and she made that fun also. I tried to image myself bald with situations that appealed. I had seen Buddhist nuns in Korea and they looked so clean and striking. I discovered that my eyes were huge without hair and I did indeed have a nice shaped head. Washing was wonderful because I felt so clean. I bought different lubricants and tried them all and I bought soft caps for bed to keep warm, The two wigs I bought were fun and I actually got a lot of complements on them. My hair has returned ( different now) and I'm glad but that time in my life bald was not really so bad, Don't mean to be pollyanna but if you regard it as an experience  that won't last forever and can be interesting, you may find some up sides. Getting ready in the morning was a breeze then, Now my hair is thinner from Arimidex but it is light and soft and curly. Trying to see how to work with it now is an adventure as well. There are many awful things about cancer but being bald doesn't have to be one of them.",
      "MessageIndex": 29,
      "PostDate": "18/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724480",
      "Title": "when did you shave your head? mela4409 goldie0827"
    },
    {
      "AuthorID": "BernadetteD…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72548/profile",
      "Content": "Sep 24, 2008 01:12PM BernadetteD wrote:  I have been using arimidex for three months and mostly OK. I do have some stiffness after driving a long way or sitting for a long time. The doctor thinks some of this is left over from chemotherapy and some from the drug and says it will get better. Swimming and regular walking shakes it out. My hair does seem to be thinner than before but hard to say why since it is just growing back from chemotherapy ( shaved it all off before it fell). A friend suggested supplements selinnium and zinc and calcium), I am taking them and I do see a result in my hair and some in the creakiness. I really though am tolerating the drug well. Hope it goes well for you.",
      "MessageIndex": 2,
      "PostDate": "24/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/721123",
      "Title": "Armidex roxy42 TenderIsOurMight"
    },
    {
      "AuthorID": "BernadetteD…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72548/profile",
      "Content": "Oct 7, 2008 08:42PM BernadetteD wrote: I did lympodema massage and learned to wrap my arm from the therapist. I wear a sleeve but found I did better without the glove. I did massage for about four weeks three times a week and she gave me exercises as well. Actually the massage was nice and relaxing and I've found being able to wrap my arm gives me a sense of control over things. My arm swells in the heat or after vigorous housework. Swimming seems to really help as well.Nobody notices the sleeve in the winter under my clothes and in the summer I got used to it and stopped minding people's questions. It's OK now.",
      "MessageIndex": 80,
      "PostDate": "07/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/701480",
      "Title": "SO, HOW DO YOU COPE???!!! Binney4 sisterinspirit"
    }
  ]
}