{
  "AuthorID": "Berry77",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94729/profile",
  "Posts": [
    {
      "AuthorID": "Berry77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94729/profile",
      "Content": "Dec 20, 2009 09:14AM Berry77 wrote: I get the feeling they don't want to worry you about possible side effects and cause more worry than necessay but at the same time I'd rather know. I want my options and possibilities up front please :-) I am grateful to have forums like these and people who speak up so I can be better informed. We are lucky to have each other. I spoke with a breast cancer survivor of some 40 years who said back in the day they didn't have all this internet knowledge and how lucky I am which I agree. Most of my knowledge and help has came from nurses. They have seen so much and heard so many things and they sometimes will share stories which is helpful. I do love the nurses and lab techs and everyone who cares enough to share. My throat really feels like it's been burned and I sure am having such trouble breathing in fact my lungs hurt. This cough is annoying! Coughing and wheezing and I haven't even done anything yet this morning. I don't think people should avoid radiation but at least research it, talk to the doc & nurses, and find out any options that are available. If it works then great and if it doesn't then you'll know what the next step is and how to take care of yourself that best suit your needs as well as your health for now and your future. It's a tough decision but I am glad I get to the make the decisions about my own health but it doesn't make it easy. Talk, ask, research!   Kak I am so sorry you have to deal with all that your going through but I am so glad you posted and shared your experience and wealth of knowledge you have and what you've found. This is all so helpful. Thank you and may your big heart be filled with all that's good.",
      "MessageIndex": 21,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744855",
      "Title": "Coughing & Shortness of Breath During or After Rads KAK Chevyboy"
    },
    {
      "AuthorID": "Berry77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94729/profile",
      "Content": "Dec 21, 2009 08:39AM Berry77 wrote: I just canceled my radiation. When I told them I have asthma and developed a cough and have trouble breathing just from a few treatments (3) all she said was \"that's too bad\". She told me that for me radiation treatment isn't really an option but I told her that I can't live with breathing problems and a cough like this, that just wouldn't work for me.   ",
      "MessageIndex": 27,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744855",
      "Title": "Coughing & Shortness of Breath During or After Rads KAK Chevyboy"
    },
    {
      "AuthorID": "Berry77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94729/profile",
      "Content": "Dec 20, 2009 08:18AM Berry77 wrote: I've had asthma for 8 years now. I just finished chemo Nov 20th and started radiation Dec 16th and the 2nd and 3rd days of radiation I started coughing and having choking sensations. My asthma has been acting up badly and I use my inhaler every few hours daily now. This after only 3 treatments...eeeks! I don't want to go back and am thinking of quiting the radiation. After all I am about quality of life not quantity and if I have to cough and have shortness of breath well that just stinks because I am a hiker, bike rider, yoga enthusiast and walker so my lungs are important to me :-)    I am thinking about canceling my rad appt and waiting for the doc to come back after the holiday to talk so I can tell her \"heck no\". They do rad on three areas, my throat, chest and arm pit areas. It's rough and I very much dislike it. Forget these side effects. I came I tried I don't like. I keep thinking about what the doc said \"if you don't do radiation the chances the cancer could come back are 60%\" so as I sit here I think about that more than anything. I don't know what to do but I know I don't like how I feel right now with shortness of breath, dry mouth and a nasty cough. If I feel that now how much worse and for how long will it be around. I just don't think I can do the remaining 32 treatments of radiation. This is nuts and my heart goes out to all who have these decisions to make.   ",
      "MessageIndex": 17,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744855",
      "Title": "Coughing & Shortness of Breath During or After Rads KAK Chevyboy"
    },
    {
      "AuthorID": "Berry77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94729/profile",
      "Content": "Dec 20, 2009 08:40AM Berry77 wrote: I know. My rad onc said it wouldn't affect my asthma or breathing at all. She told me not to worry about it. I was very concerned considering she told me the radiation would cut into part of my lung. It was at this point when I said no way would I do this if it affected my asthma or breathing and she told me if I didn't do the radiation the chance the cancer would come back was at 60% and not to worry too much about the asthma because it probably wouldn't affect it. I left that office telling my friend \"no way will I do this if my breathing/asthma gets worse\". And now I just have to make that decision. I haven't felt good about doing the radiation anyway but now after my trouble breathing and reading more online about it I don't think I will continue with it.",
      "MessageIndex": 19,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744855",
      "Title": "Coughing & Shortness of Breath During or After Rads KAK Chevyboy"
    }
  ]
}