{
  "AuthorID": "besa",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
  "Posts": [
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Nov 2, 2015 05:48PM besa wrote: http://medicalxpress.com/news/2015-11-vitamin-d-su... One more study on the topic that was just published.......",
      "MessageIndex": 25,
      "PostDate": "02/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/835778",
      "Title": "Vitamin D range...what is normal? tangandchris patoo"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Oct 23, 2012 05:47PM - edited Oct 23, 2012 05:49PM by besa My phiolsophy is never to assume that no news is good news.    If I don't hear from my doctor there is no way for me to know if everything is OK or if there is something to be concerned about and the information just fell between the cracks.  I think that forgetting to call one time doesn't make your doctor horrible but I would point out the error and I would expect an apology.  If this is just the way she tends to handles things  - I would find another doctor. I would also want a sit down discussion with the oncologist about all my options if a bone scan was  -3....  bone building medications, the posibility of taking tamoxifen (which protects against bone loss) vs using an aromitase inhibitor etc.",
      "MessageIndex": 1,
      "PostDate": "23/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/795384",
      "Title": "Is there something wrong with my Oncologist? MENA1954 MENA1954"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Oct 9, 2014 04:33PM - edited Oct 9, 2014 04:46PM by besa SallyU204- breast surgeons and plastic surgeons work as a team and a breast surgeon will have \"partner\" plastic surgeons they work with.  You usually can't shop and mix and match plastic surgeons and breast surgeons.   That being said, when I researched this,  the name that kept coming up for high volume skilled microvascular surgeons in the DC metro area was Bernard Chang at Mercy  followed , 2nd choice - by Maurice Nahabedian at Georgetown. I think Nahabedian may also work out of one of the Northern Virginia hospitals (Fairfax Hospital)  -- he has offices at both Georgetown U. and in McLean, Va.  (Scott Spear at Georgetown does implants not microvascular reconstructions.)  Chang and Nahabedian were originally Hopkins ps but now have very big reconstructive programs at their respective hospitals. I think they have more experience (been doing this for a longer time) than the  microvascular ps at Hopkins. You want someone who does these surgeries on a regular basis, multiple times/week and has done multiple hundreds, much better yet.... 10000s (these numbers are surgeries done on their own, after microvascular fellowship or other training.) A good ps should have a large group of happy customers willing to talk to you.    Arrange to talk to them and if possible see their results in person.  Cosmetic enhancement is a different skill set than reconstruction so find someone who does mainly reconstructions.  ",
      "MessageIndex": 4,
      "PostDate": "09/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/825256",
      "Title": "Need recommendation for surgeon in DC region SallyU2014 SallyU2014"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Feb 5, 2013 07:17PM besa wrote: You can request a copy of the radiology report- the exact same report that is sent to your referring physician- not a watered down \"patient\" report.   You are entitled to it. I would pick it up in person and not allow them to mail it to you.  (Mailing would just delay things more.)   Absolutely all of my reports had BiRads scores listed on them.  Another option is to call the radiology office and specifically ask the nurse or radiologist for the BiRads score on your report.  The score was never offered to me- even when I verbally requested information about what the report contained. I only learned the score from reading my reports or by specifically asking for the score. ",
      "MessageIndex": 2,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800032",
      "Title": "BiRad? Pharmbecca5 besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Feb 27, 2015 03:31PM - edited Feb 27, 2015 03:39PM by besa The oncologist is very important. I agree with nottoday and other posters. As with all of this there are docs who are on top of thing, read the literature and offer you the latest and the best. Than there are does that aren't. Not getting a good cosmetic result with reconstruction is bad. Not getting good cancer treatment is worse. Go with the oncologist you feel is is the best and try to make sure there is a good match in terms of personality and communication. You will have a long term relationship with your oncologist. ",
      "MessageIndex": 5,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/828951",
      "Title": "How important is your oncologist? (and NOLA) Trvler Trvler"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Feb 28, 2015 08:26AM besa wrote: Trvler-If you are not finding local medical oncologists, radiation oncologists etc that you feel comfortable with - perhaps you can work the recommendations in the other direction. Ask Dr. Stolier and/or the NOLA plastic surgeons (Dr. Massey who works in Chicago as well as NOLA) who they would recommend in your area- possibly they may come up with a few names. (You would still need to check the recommendations out yourself very carefully). In addition possibly look at the closest NCI designated cancer center. Just some ideas.....",
      "MessageIndex": 9,
      "PostDate": "28/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/828951",
      "Title": "How important is your oncologist? (and NOLA) Trvler Trvler"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 9, 2012 07:28PM besa wrote: I agree with the above posts - I would consider finding another doctor.  You may be able to get a copy of the report yourself and bypass the doctor.  If HIPAA laws are applied correctly you are entitled to a copy of the report.  You need to contact the place that did the biopsy and tell them you want a copy of the report.  You will need to sign a release- releasing the report to yourself - and then you will probably need to pick up the report in person.  Some facilites will fax, others won't - different places have different policies.  I always get copies of my breast MRIs, mammograms, etc  usually before they reach my doctors- and always before my doctors contact me with the results.  I have absolutely no problem understanding the reports.  Having the information before I see my doctor helps me formulate questions and I am sure that I have ALL the information.  (The only problem I have encountered is getting blood work results from big commercial labs - because of this I tend to use hospital labs for these tests.)  If this continues to be an issue for you in the future you can talk to the place doing the tests (before they are done) to learn the policy on releasing information to patients.  All things being equal, I will choose a facility that will easily release results to me.",
      "MessageIndex": 14,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780728",
      "Title": "Feeling so upset at doctor liveit56 liveit56"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 29, 2012 09:35AM besa wrote: Wonderful news!  You should not have had to go through all of this -good that you are switching to a new internist and a new facility for mammograms. ",
      "MessageIndex": 45,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780728",
      "Title": "Feeling so upset at doctor liveit56 liveit56"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 10, 2012 06:30AM - edited Jan 10, 2012 07:38AM by besa liveit56 - If you feel comfortable, tell us how the office responds.   This just shouldn't be necessary.  Dealing with the possibility of a cancer diagnosis is so stressful - it is horrible to add issues like this to the mix.  If they continue to give you a hard time you can file a HIPAA compaint (and if it was me I would tell them that that was the path of action I was going to take.) ",
      "MessageIndex": 16,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780728",
      "Title": "Feeling so upset at doctor liveit56 liveit56"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jul 26, 2014 05:08PM - edited Jul 26, 2014 05:23PM by besa You have a lot on your plate right now.  It is OK to feel whatever you feel.  There are no rules or right and wrong about this.  I just wanted to give you a good resource: www.facingourrisk.org     \"FORCE\" is a great source for information and support for women dealing with hereditary bc.  In addition to the web site with message boards and lots of current and accurate information they have local groups - so if you want to you can connect with other women dealing with exactly the same issues you are facing.  ",
      "MessageIndex": 3,
      "PostDate": "26/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822963",
      "Title": "DCIS and Brac2 postive Zer35 Zer35"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Feb 18, 2013 06:32AM besa wrote: You might want to post on the \"NOLA in September\" tread in \"breast reconstruction\" - I know there are many women there who have had prophylactic mastectomies with microvascular (DIEP, GAP etc reconstructions) or other threads in the reconstruction forum.  Also the web site www.facingourrisk.org for information and again at this site other women in your position.  Read the guidelines on your insurance policy but generally insurance will not be a problem if you have a strong family history and especially if there is a BRCA mutation.  A really good book - the best I have seen on the subject- get a copy of the latest edition of kathy Steligo's \"Breast reconstruction Guidebook\" to learn about your reconstruction options  (if you are interested in reconstruction) and how to choose a really good plastic surgeon.  http://www.breastrecon.com/  or from Amazon.com   It looks like the same author has written a book on hereditary breast cancer and options (one of the others authors is the women who founded FORCE  - see link above. ",
      "MessageIndex": 8,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/800399",
      "Title": "who has had a prophylactic mastectomy? Dawnie Chrisrenee77"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Oct 7, 2013 12:07PM besa wrote: My experience was different from posts above. In my case the radiologist who performed the biopsy was also the physician who called and gave me the (bad) news -not the ob-gyn who ordered the tests. At the time I had problems getting timely accurate information from my doctors. I later realized that as patients, if the HIPAA rules are followed correctly, we are entitled to copies of all of our radiology reports (the same report that is sent to the ordering physician). Because of my initial experience- I now no longer wait for calls from physicians with test results. I just pick up copies of my reports myself. I get radiology reports from the radiology office. For me that is easier and less stressful. I have immediate access to knowledgeable people who can help me with the next steps if the news is not good.",
      "MessageIndex": 4,
      "PostDate": "07/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/812435",
      "Title": "Scared and annoyed jenistar aviva5675"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Dec 4, 2011 06:24PM besa wrote: A DIEP moves only the tummy fat (and the blood vessels that nurish it) to your breast.  You end up with a tummy tuck and a reconstructed breast.  A Tram (a free flap tram - there is an older type called pediculed tram) takes the same fat and blood vessels but also takes a piece of muscle surrounding the blood vessels. It is an technically easier surgery to do. With a tram you also end up with a tummy tuck.  With a tram there is a higher risk of hernia down the road as well as a somewhat more difficult recovery and you also risk losing  some strenght in your abdominal muscles.  In a pediculed tram (rarely done now) the abdominal muscles are cut but not detached.  They are tunneled through your abdomen and used to reconstruct the breast.  There is a much greater chance of hernia and much more muscle weakness and supposedly a  more difficult recovery.   The major teaching hospitals in my area trams (of any sort) are not done and have been replaced by DIEPS.  Less experienced plastic surgeons will often say they are going to try to do a DIEP but if they have problems they will switch to a free flap tram.  The more experienced plastic surgeons will promise a DIEP and will deliver a DIEP.  Here are two web sites that describes the different types of flap reconstructions.  http://www.facingourrisk.org/info_research/risk-management/breast-reconstruction/index.php (The above FORCE web site is also a great resource for BRCA information and support. ) http://www.breastcenter.com/breast-reconstruction-procedures.php Below is a list of DIEP surgeons.  If you decide to do this surgery you will need to check them out yourself - research them.    This is just a list- not a recomendation for the surgeons listed.  You can also post on the \"NOLA in September\" thread for names of DIEP surgeons.  Many of these women have done a lot of research and know who are supposed to be the best in the U.S. http://www.breastrecon.com/id10.html",
      "MessageIndex": 5,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/779019",
      "Title": "BMX DIEP/TRAM FLAP???? prncsviolet NatsFan"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Dec 4, 2011 01:17PM besa wrote: Get a copy of the latest edition of \"The Breast Reconstruction Guidebook\" by Kathy Steligo.  It will explain your options and also help you to choose a good plastic surgeon.  I had a unilateral DIEP about 4 years ago and after considering my risk to the contralateral side went back and had a unilateral hip flap.  You need VERY experienced plastic surgeons who do these surgeries on a regular basis ( 2 or 3/week) and have been doing them for years.  I took 6 weeks off from work for my diep by could have gone back earlier (my job is somewhat physical- not a desk job).  For the hip flap surgery (a variation on sGAP) I was off for 4 weeks but also could also have gone back earlier.  I, like you, did not want implants and am happy with my choice.  I also did not want any muscle used in the reconstruction.  Tram takes muscle as well as fat  and because of that was not a surgery I was interested in.  LD flap also takes muscle and usuallly also requires an implant.   ",
      "MessageIndex": 1,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/779019",
      "Title": "BMX DIEP/TRAM FLAP???? prncsviolet NatsFan"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 23, 2012 09:11PM besa wrote: bethoul- Good for you for advocating for yourself!  I am probably missing something but I don't understand why the  HMO would disapprove.    Looks like you will decide to omit chemo on the recommendation of a 2nd consult - this will cost the HMO less money.  Hormone therapy and radiation therapy are standard of care.  (If you still feel uncertain you can always get a 3rd opinion - but I would again go to a major cancer center - big research/teaching hospital.)  (My own story is that the first surgeon I saw did not order an MRI and scheduled me for a lumpectomy.  A 2nd opionion ordered the MRI and found that I had multifocal bc - surgery was changed from a lumpectomy to a mastectomy.) ",
      "MessageIndex": 32,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/780827",
      "Title": "Oncotype DX testing bethhoul MimiNC"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 13, 2012 05:08PM besa wrote: I would ask the 2nd oncologist what criteria she used to decide to test you.  If they sound reasonable (ER positive, PR positive, Her2 negative and either node negative or 1 to 3 positive nodes) I would  choose to switch oncologists.  Your oncotype score may or may not reaffirm the need for chemo but if you feel it was a reasonable test that should have been run before chemo I would choose to find someone new.  I would also want to know what the calculated chance of distal recurrence is based on the oncotype score and also what it now after chemo (based on the oncotype score).  These numbers will most likely be different than the numbers calculated based on only on tumor size etc.  The oncotype calculation is supposed to be more accurate -based on the proteins (actually mRNA) expressed in your particular tumor.  This information may help you make decisions going forward.",
      "MessageIndex": 13,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/780827",
      "Title": "Oncotype DX testing bethhoul MimiNC"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 18, 2012 05:56PM besa wrote: Bethhoul- The oncotype dx test looks at the progesterone receptor and calculates that into your oncotype score.  My relationship with my doctors is a business relationship- I am a consumer as well as a patient.  If I feel a physician really knows their stuff and I communicate well with him/her, if I agree with what is proposed,and if they respect the decisions I make when it comes to my treatment - wonderful.  If not, I fire Dr. \"Wrong\" and hire Dr. \"Right\". ",
      "MessageIndex": 20,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/780827",
      "Title": "Oncotype DX testing bethhoul MimiNC"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Aug 5, 2012 08:50AM - edited Aug 5, 2012 12:20PM by besa Hopefully your anesthesiologist will be more empathetic then the one in the online forum.  (If not I would write quickly write a letter to the hospital complaining).  You need to figure out what happened so you can make sure this never happens again.  Was the anesthesiologist a resident or someone in training?  I think the new residents come on board in July.    I have been given propofol many times and never had a problem with the kind of pain you describe - something clearly went wrong in your case. ",
      "MessageIndex": 12,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/791537",
      "Title": "General Anesthetic: horrible pain in arm when being put under gumshoe christina0001"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Aug 4, 2012 02:55PM - edited Aug 4, 2012 03:25PM by besa I would agree that propofol is likely the problem.  When you are getting general anesthesia - propofol is generally used just before you are given inhaled anesthesia gases  (it is also used without inhaled gases). Propofol is a white milky liquid admistered via I.V. and will be the last thing you remember before being put \"under\".    It burns if it is admistered alone and is given with lidocaine to prevent this from happening.  Just wondering if  the lidocaine could have been left out of the mix or not enough used?   I would absolutely ask the anesthesiologist about what could have caused this.  I might also request a copy of the anesthesia records - you can see what medications were given and when - etc. ",
      "MessageIndex": 10,
      "PostDate": "04/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/791537",
      "Title": "General Anesthetic: horrible pain in arm when being put under gumshoe christina0001"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Mar 7, 2012 06:45AM - edited Mar 7, 2012 06:46AM by besa In my case I was using neosporin on my drain sites and eventually developed an allergy to it - itching and red bumps.  I was told to test both the things I was using (betadine  and Neosporin) on the inner area of my elbow- apply them in different areas for a few days and see what happens.  Sure enough the neosporin caused an allergic reaction.  Stopped using neosporin and the problem was solved.  My doctor told me this is something that is common. ",
      "MessageIndex": 5,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/783721",
      "Title": "Rash near incision site? SandyBeaches Cats134"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Mar 15, 2016 01:28PM - edited Mar 15, 2016 03:50PM by besa Erskine-You have a right to be upset. My doctors made it clear that some breast tissue would always be left behind in the chest wall after my bilateral mastectomies (one was prophylactic and done 4 years after my initial mastectomy) and there would still be a chance of local recurrance or a new primary bc. Even if every single breast tissue cell in the breast could be removed (which of course it can not) an ER positive woman with invasive bc would still need to take tamoxifen or an AI to cut down on the chance of getting metastatic disease. The idea is to try to stop any bc cells that may have moved beyond the breast (and this can happen even in node negative womem.) New-girl. I am so sorry you are dealing with this. You had no way of knowing there was a problem. Hind sight is 20/20. I don't know of anyone who had a mri specifically to see how much residual tissue was left.",
      "MessageIndex": 6,
      "PostDate": "15/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/842222",
      "Title": "Did u know Breast Tissue can b left behind w/Mastectomy ErskineGirl besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Nov 11, 2014 01:42PM - edited Nov 11, 2014 01:50PM by besa http://www.asco.org/press-center/asco-releases-updated-guideline-interventions-reduce-breast-cancer-risk-women-increased Above are the asco guideline concerning the medications used for chemoprevention (as momoschki and exbrnxgrl mentioned chemoprevention is different from chemotherapy). Tamoxifen, raloxifene, or exemastane reduce a woman's risk of getting ER positive breast cancer. Chemoprevention is just one of the options available for high risk women. The outside consult with a medical oncologist should help you understand this option.",
      "MessageIndex": 12,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826147",
      "Title": "Anyone else feel they are being treated with extreme prevention? JaniceB2003 besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 10, 2013 08:57PM - edited Jan 10, 2013 09:02PM by besa About mastectomy and reconstruction --If there is the possibility of mastectomy get a copy of the latest edition of Kathy Steligo's \"Breast Reconstruction Guidebook\" - the best I have seen on the subject.  It will tell you what your options are and also help you choose a good plastic surgeon. http://www.breastrecon.com/ A nurse stating that skin sparing/and or nipple sparing surgery is cosmetic and they don't do it because they are saving lives -----??????  This makes no sense to me - unless there are in, your specific case, some very special complicating factors.  Skin sparing/nipple sparing reconstruction is for a better cosmetic outcome -- there is nothing wrong with that. Skin sparing is done very commonly so unless there is skin involvement  I would want to know exactly why it isn't being presented as an option.   The doctors who do nipple sparing with a bc diagnosis have very specific criteria that you need to fit into - size of tumor, distance from the nipple ect. The cosmetic outcome of a reconstruction depends a lot on the skill of the plastic surgeon and the breast surgeon who works with him/her- shop around and get a number of opinions.  You need a plastic surgeon who does the type of reconsturciton you want in high volume and does the surgery regularly (every week).    With the right plastic surgeon - the cosmetic results of mastectomy and reconstruction can be really good. I had a problematic unilateral skin sparing mastectomy with DIEP reconstruction done locally following a multifocal breast cancer diagnosis- turns out the plastic surgeon was well trained but inexperienced.   I  went back 4 year later and did a prophylactic nipple sparing mastectomy sGAP on the other side.  They also did some work to fix my DIEP reconstruction.  For my second surgery I traveled  to New Orleans to find a really skilled ps. They did a great job. Look at the reconstruction photos on this site:  www.breastcenter.com   Plastic surgeons often recommend the type of reconstruction they are technically able to do and down play or even disparage other options.  If you end up needing or wanting a mastectomy with reconstruction my advice is to figure out what type you want first and then go to the best plastic surgeon who specializes in what you want and talk to him/her about it.  Also, cosmetic enhancement requires a very different skill set than reconstruction.  You want to go to someone who specializes in reconstruction not enhancement.",
      "MessageIndex": 17,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798613",
      "Title": "Stage and grade of cancer determined AFTER surgery. What!?! InTheWind InTheWind"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 10, 2013 09:10PM besa wrote: I was not dealing with a HMO but can you, in some cases, try to petition them to get permission to go outside the system if they can't provide what you need?  Even within the system I would want to have enough information to find the doc who was the most skilled and the best fit.",
      "MessageIndex": 19,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798613",
      "Title": "Stage and grade of cancer determined AFTER surgery. What!?! InTheWind InTheWind"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 31, 2012 10:42AM besa wrote: CindyT, I apologize I was responding to christina1961's information instead of yours.  The ability to \"stack\" flaps may possibly allow you to use flap reconstruction.  GAP is taken from the butt (sGAP is higher up, iGAP more problematic with potential problems with sciatic nerve damage is lower down, lumbar flaps are from hip area - higher than sGAP).  There are also other flaps.  Only a small number of skilled microvascular plastic surgeons have the ability to stack the flaps but the cosmetic results can be very good.  Also not may microvascular plastic surgeons do GAP reconstructions in high volume and with skill.  When flaps are stacked Diep flaps can be combined together or combined with GAP or lumbar (hip) flaps, GAP flaps can be combined together, etc.",
      "MessageIndex": 12,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781851",
      "Title": "Seemingly impossible decision CindyT littletower"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 30, 2012 10:12PM - edited Jan 30, 2012 10:15PM by besa I don't have an answer for you but if you are possibly considering a mastectomy and reconstruction get a copy of the latest edition of Kathy Steligo's \"Breast Reconstruction Guidebook\" the best I have seen on the subject.   Flap reconstruction (DIEP, GAP) have much fewer issues after radiation and are alternatives to implants reconstruction - just something to consider. The higher complication rate is with implants.   With a skilled microvascular plastic surgeon the cosmetic results of a flap reconstruction can be very good. ",
      "MessageIndex": 3,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781851",
      "Title": "Seemingly impossible decision CindyT littletower"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jun 26, 2013 04:11AM - edited Jun 26, 2013 04:12AM by besa I agree with leaf above.  My experience  -I specifically and very calmly and directly asked the radiologist what he thought the chances  of me having breast cancer were (both at the call back mammogram and again at the biopsy.)  In both cases he looked me in the eye and told me he had absolutely no idea of what the chances were.  Later when I read his radiology report it said BIRADS 5 - very highly specious for malignancy.  Clearly the radiologist was not being honest with me.  When I talked to him about it later he acknowledged what happened and apologized.  He told me he \"didn't think women wanted to know the truth\"-- huh???  How I handle things now -- I always say something to the radiologist like \"I need you to be comfortable being completely honest with me.\"   I also ALWAYS pull my radiology report (the same report that is sent to the physician that ordered the test.).  According to HIPPA laws we are entitled to copies of our reports.  In terms of technicians-- I don't feel that they are really able to make a truly informed judgement.  I don't ask them about results and wouldn't trust their judgement even if they ventured an opinion-- just my opinion... ",
      "MessageIndex": 2,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806704",
      "Title": "Radiologists/Techs/Doctors Giving Hope ShawtsGirl leaf"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Oct 29, 2012 01:28PM besa wrote: The laws concerning informing women about dense breast tissue has changed in some places so this may be why you are seeing the information for the first time.  (In the past this information was often included in the report sent to the ordering physician but not included in the report sent to patients.)  As others have have said, dense tissue makes screening mammograms much less effective and in and of itself is considered a risk factor for breast cancer.  When breast tissue is dense, breast MRIs are often used instead of or in addition to mammography and insurance should cover this.   My advice - advocate for yourself, talk to your doctor about this and strongly consider having screening MRIs in addition to mammograms. ",
      "MessageIndex": 7,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/795627",
      "Title": "\"Extremely Dense Breast Tissue\" kkross kkross"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 31, 2012 09:23AM besa wrote: The not enough fat response can be because the  plastic surgeon doesn't have the technical skills to do GAPs or stacked DIEPS, stacked GAPs, etc.  Go to a VERY experienced microvascular surgeon who had done 100s or even 1000s of these for an opinion.  I used DellaCroce in New Orleans - if you are interested you can contact his office and usually just send photos for an opinion.  Also post on the \"Nola in September\" thread under breast reconstruction to talk to other women who were told they didn't have enough tissue and then ended up with beautiful reconstructions because they found a physician who was more skilled. ",
      "MessageIndex": 7,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781851",
      "Title": "Seemingly impossible decision CindyT littletower"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 31, 2012 09:38AM besa wrote: Personallly my choice was not to use muscle and lat flap was not even done at most of the places I considered (they had moved on to newer surgeries).  With DIEP most surgeons can only use one half of the abdominal tissue that is taken.  A skilled plastic surgeon can \"stack\" the flaps and combine them instead of discarding a portion of the flap.  They need to be able to hook the blood vessels together so all the tissue will get blood.  If you want a tissue reconstruction this may be an option.  If the plastic surgeon you are using is talking about \"tram\" he almost certainly doesn't have the skills to do a stacked DIEP.",
      "MessageIndex": 10,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781851",
      "Title": "Seemingly impossible decision CindyT littletower"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 31, 2012 06:32PM - edited Jan 31, 2012 06:34PM by besa Cindy, Some info and quick references.  Plastic surgeons have the reputation of recommending the procedures they are able to do and discounting or not mentioning other options.  Depending on where you are, if you decide you are interested in one of the stacked reconstructions you may  find you need to travel to get what you want.  If that is a path you choose, the surgeons that specialize in these surgeries are set up to take out of town patients and make the logistics easy.  (I traveled to New Orleans for surgery and it was very doable). http://www.ncbi.nlm.nih.gov/pubmed/21364412 http://www.breastcenter.com/stacked-diep-reconstruction.php http://www.drmarga.com/DIEP.html http://www.breastrecon.com/id10.html   (this is a list of plastic surgeons who do microvascular breast reconstructions- it is NOT a vetted list.  The doctors need to be checked out and researched.)",
      "MessageIndex": 15,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781851",
      "Title": "Seemingly impossible decision CindyT littletower"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Dec 31, 2011 02:48AM besa wrote: http://breastcancer.about.com/od/diagnosis/a/birads.htm From this web site - an explanation of Birads IV",
      "MessageIndex": 5,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780246",
      "Title": "Birad4 explanation pprice3122 marie5890"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Oct 29, 2012 04:53PM - edited Oct 29, 2012 07:32PM by besa",
      "MessageIndex": 15,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795532",
      "Title": "Chemo??.... awaiting the oncotype DX test- any advice?? susancats frankp"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Dec 12, 2015 07:26AM - edited Dec 12, 2015 07:39AM by besa http://nomograms.mskcc.org/breast/ http://nomograms.mskcc.org/breast/ Konakona - you can use this Sloan Kettering Breast Cancer nomogram (above link) to calculate the chance of being sentinel node positive. I had multifocal invasive ductal carcinoma (IDC). In my case when I plugged my information into the calculator being multifocal did increase my chance of being sentinel node positive - but my sentinel node biopsy came back negative. (When the sentinal node biopsy nomogram asks for the size of the largest tumor , put in the size of the largest invasive tumor (not the size of a DCIS tumor)).. If you want information about breast reconstruction (breast reconstruction options, how to choose a good plastic surgeon, etc) a great resource is the latest edition of Kathy Steligo's \"Breast Reconstruction Guidebook\" http://www.breastcancer.org/community/gift-shop/bo... http://www.breastrecon.com/ ",
      "MessageIndex": 5,
      "PostDate": "12/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/838383",
      "Title": "Multifocal how bad is it? Konakona BlueHeron"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Feb 8, 2014 11:46AM besa wrote: If you haven't already seen it look at the web site www.facingourrisk.org  Many women in your situation making the same decisions.  Lots of information and help there... ",
      "MessageIndex": 5,
      "PostDate": "08/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817809",
      "Title": "BRCA-1 Positive: To Do or Not Do Something Preventative Bearhitch Itiswhatitis2"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Oct 31, 2013 09:02AM besa wrote: All good recommendations from posters above. In addition, for support and excellent up to date information about hereditary breast cancer go to the web site: www.facingourrisk.org",
      "MessageIndex": 4,
      "PostDate": "31/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813824",
      "Title": "What should I do? Yoliriv sandra4611"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 15, 2013 01:08AM - edited Jan 15, 2013 05:26AM by besa Yes, her dad or any family member could have the gene and NOT develop breast, ovarian or any of the other related cancer.  The gene only increases the chance of getting one of these cancers -it does not ensure that you will absolutely have one of these cancers.  Her dad could have the gene and have just been lucky.  If he has the gene and hasn't had one of the cancers he can still pass the gene on to one of his children.  Often people wondering about BRCA gene mutations are sent to genetic counselors who specialize in this kind of thing. The counselor takes a detailed family history and then, either recommends testing or don't recommend testing.  Going to a genetic counselor also, I think, can make it easier to have health insurance cover the testing.  Other associated cancers are prostate cancer and pancreatic cancer, and I some others.  Go to the FORCE web site above for detailed information.  That would be a better place to post questions about breast cancer gene mutations.  There are other mutations that increase the chance of breast cancer.  Posting here for information is good but also try the FORCE web site for more detailed information.",
      "MessageIndex": 5,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798842",
      "Title": "Worried about my wife in her 20's TheBestAround besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Feb 7, 2013 05:18PM - edited Feb 7, 2013 08:49PM by besa The reference you want is \"New England Journal of Medicine\" 365(2011) pp1304-1314. Title of article is \"Adverse Health Outcomes in Women Exposed in Utero to Diethylstillbestral\"  Robert Hoover is the first author but Julie Palmer seems to be the one who is studying breast cancer and DES daughters.  The overall bc risk for women >40 years old is 1.82 times usual risk.  The risk increases with age.  From looking at the paper quickly it looks like the study ran until about age 55 so there seems to be no data past that age for DES daughters.  Try doing a pubmed search so you can read the abstract.",
      "MessageIndex": 5,
      "PostDate": "07/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/800113",
      "Title": "Anyone here a daughter of a Mom who took DES during pregnancy? april485 besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Feb 7, 2013 08:47PM - edited Feb 7, 2013 08:53PM by besa http://www.nejm.org/doi/full/10.1056/NEJMoa1013961 The link above should get you to the free full text of the above New England Journal article.  The abstract is below: Adverse health outcomes in women exposed in utero to diethylstilbestrol. Source Division of Cancer Epidemiology and Genetics, National Cancer Institute, National Institutes of Health, Department of Health and Human Services, Bethesda, MD, USA. hooverr@mail.nih.gov Abstract BACKGROUND: Before 1971, several million women were exposed in utero to diethylstilbestrol (DES) given to their mothers to prevent pregnancy complications. Several adverse outcomes have been linked to such exposure, but their cumulative effects are not well understood. METHODS: We combined data from three studies initiated in the 1970s with continued long-term follow-up of 4653 women exposed in utero to DES and 1927 unexposed controls. We assessed the risks of 12 adverse outcomes linked to DES exposure, including cumulative risks to 45 years of age for reproductive outcomes and to 55 years of age for other outcomes, and their relationships to the baseline presence or absence of vaginal epithelial changes, which are correlated with a higher dose of, and earlier exposure to, DES in utero. RESULTS: Cumulative risks in women exposed to DES, as compared with those not exposed, were as follows: for infertility, 33.3% vs. 15.5% (hazard ratio, 2.37; 95% confidence interval [CI], 2.05 to 2.75); spontaneous abortion, 50.3% vs. 38.6% (hazard ratio, 1.64; 95% CI, 1.42 to 1.88); preterm delivery, 53.3% vs. 17.8% (hazard ratio, 4.68; 95% CI, 3.74 to 5.86); loss of second-trimester pregnancy, 16.4% vs. 1.7% (hazard ratio, 3.77; 95% CI, 2.56 to 5.54); ectopic pregnancy, 14.6% vs. 2.9% (hazard ratio, 3.72; 95% CI, 2.58 to 5.38); preeclampsia, 26.4% vs. 13.7% (hazard ratio 1.42; 95% CI, 1.07 to 1.89); stillbirth, 8.9% vs. 2.6% (hazard ratio, 2.45; 95% CI, 1.33 to 4.54); early menopause, 5.1% vs. 1.7% (hazard ratio, 2.35; 95% CI, 1.67 to 3.31); grade 2 or higher cervical intraepithelial neoplasia, 6.9% vs. 3.4% (hazard ratio, 2.28; 95% CI, 1.59 to 3.27); and breast cancer at 40 years of age or older, 3.9% vs. 2.2% (hazard ratio, 1.82; 95% CI, 1.04 to 3.18). For most outcomes, the risks among exposed women were higher for those with vaginal epithelial changes than for those without such changes. CONCLUSIONS: In utero exposure of women to DES is associated with a high lifetime risk of a broad spectrum of adverse health outcomes. (Funded by the National Cancer Institute.).",
      "MessageIndex": 7,
      "PostDate": "07/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/800113",
      "Title": "Anyone here a daughter of a Mom who took DES during pregnancy? april485 besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "May 25, 2015 10:16PM - edited May 25, 2015 10:59PM by besa Not everyone with stage II breast cancer needs chemo. As snowgirl63 said there is an Oncotype DX test that will give an estimate of an individual woman's risk of recurrence (used for women with ER positive, HER2 negative breast cancer, 0 to 3 positive nodes.) A low score would indicate that there is no benefit from chemo. I was stage 2A, node negative, had a mastectomy with reconstruction and also had an low Oncotype Dx score. The recommendation for me was not to have chemo. I did take hormonal therapy which reduces the risk of recurrence for women with ER+ breast cancer by about 1/2. In the U.S. early stage breast cancer patient are given personal statistics (statistics obtained from Oncotype Dx test) for our risk of recurrence with and without chemo, with and without hormone therapy. For me this information made the decisions about chemo and hormonal therapy much easier to make. In the U.S. an oncologist is the one who usually makes recommendations for or against chemo (generally the breast surgeon does not make recommendations concerning this). Has your mom seen an oncologist specializing in breast cancer? (Also does your know the status of her tumors hormone receptors -they are called estrogen receptor (ER), progesterone receptor (PR), and human epidermal growth factor 2 receptor (HER2) ) which would help her know how effective hormonal therapy would be for her. see last link below) http://www.breastcancer.org/symptoms/testing/types... http://www.oncotypedx.com/  Some helpful information about hormone receptor status of breast cancer tumors: http://www.breastcancer.org/symptoms/diagnosis/her... ",
      "MessageIndex": 5,
      "PostDate": "25/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/831933",
      "Title": "My mom is refusing to take chemo, I am scared for recurrence nanayko Snowgirl63"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 6, 2019 06:02AM - edited Jan 6, 2019 06:07AM by besa",
      "MessageIndex": 44,
      "PostDate": "06/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868774",
      "Title": "High Ki-67, but low grade and stage? evily Renee9487"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Dec 14, 2015 10:55PM besa wrote: konakona-I Also agree with all that BarredOwl posted -very good information and very good advice.",
      "MessageIndex": 16,
      "PostDate": "14/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/838383",
      "Title": "Multifocal how bad is it? Konakona BlueHeron"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 11, 2015 12:50AM - edited Jan 11, 2015 01:36AM by besa hattp://www.mskcc.org/cancer-care/adult/breast/pred...  Memorial Sloan Kettering has a predictive tool for this question . See the link above to \"breast cancer nomograms\"- . Of course not a crystal ball but it does give an estimate of the chance of being node positive. For me personally having and estimate of the probability of what may be makes it easier for me to handle things and prepare. The factors that influence the outcome, according to this Sloan Kettering \"Sentinal Lymph Node Metastasis\" predictive model, include:age, tumor size, tumor location, lymphovascular invasion, multifocality, grade, ER and PR status and a category called \"special type\" (see link for definition of what is classified as special type.)",
      "MessageIndex": 8,
      "PostDate": "11/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/827481",
      "Title": "Anyone with Grade 1 tumors - what was your node status? shelleym1 newinab"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 14, 2013 10:16PM - edited Jan 14, 2013 10:17PM by besa kkemp2211- If you post on the \"Nola in September\" thread you will get tons of responses to your questions.   ",
      "MessageIndex": 7,
      "PostDate": "14/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/798706",
      "Title": "Who did your surgery at NOLA? MrsH besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 20, 2013 12:03PM - edited Jan 20, 2013 12:08PM by besa I ended up discussing this with a few of my local docs.  I asked a local plastic surgeon who had done a revision on an original problematic DIEP reconstruction(done elsewhere)  if he would help me .  I was upfront and told him I had decided to go to New Orleans for my contralateral proplylactic mastectomy and GAP reconstruction.  I guess ego was not an issue and he told me he would help me out. I figured that at worst he would say no.  I also had a local breast surgeon who was following me agree to help and my internist also agreed.  I ended up not needing any of them and of course I knew that the Center would arrange for me to return to New Orleans if I actually had a significant complication. I just decided to ask the people I felt would do a good job and if they seemed comfortable with helping me and said  yes fine and if they said no - I would just ask someone else. ",
      "MessageIndex": 2,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/799145",
      "Title": "Anyone who traveled for surgery - Q about follow up care MrsH besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Oct 8, 2016 10:16AM besa wrote: a great resource is \"FORCE\" www.facingourrisk.org In addition to lots of current information you can connect with other women facing the same issues.",
      "MessageIndex": 3,
      "PostDate": "08/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/848676",
      "Title": "Newly discovered BRCA2 Positive Shelby77 mustlovepoodles"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Feb 8, 2013 06:47PM - edited Feb 8, 2013 06:50PM by besa I think it is important to make sure oncologists and ob/gyns are aware of DES daughter status.  I haven't seen any specific studies on the gynecological effects of AIs and SERMs (tamoxifen) on DES daughters.  There are obviously huge benefits from taking these drugs.  Not sure how it would play out but it is possible that an oncologist or ob/gyn might possibly decide to do a little more screening for gyn side effects when DES daughters are taking some of these medications. ",
      "MessageIndex": 12,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/800113",
      "Title": "Anyone here a daughter of a Mom who took DES during pregnancy? april485 besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Feb 8, 2013 09:23PM - edited Feb 9, 2013 10:18AM by besa http://www.cdc.gov/des/consumers/about/history.html  Risk of DES associated health issue is the hand that DES daughters were dealt - but (see link above) DES had nothing to do with enabling them to be here.",
      "MessageIndex": 14,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/800113",
      "Title": "Anyone here a daughter of a Mom who took DES during pregnancy? april485 besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Mar 3, 2015 07:02PM besa wrote: Saralou118- Go go to the web site: www.facingourrisk.org \"Force\" is a great resource - lots of information and help and you will \"meet\" many others dealing with the same issues.",
      "MessageIndex": 1,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/829072",
      "Title": "32 and positive for BRCA1 saralou1118 saralou1118"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 15, 2016 09:28AM - edited Jan 16, 2016 09:24PM by besa I had a prophylactic mastectomy on my non-cancer side four years after my initial bc diagnosis. I am BRCA mutation negative but do have a family history of bc. (I am considered high risk but not as high as someone with a BRCA mutation.) I did not have sentinel node biopsy on my prophylactic side. I had a negative breast MRI and mammogram. That being said I was aware of the risk that I would face axillary dissection if cancer was discovered during pathology. NCCN guidelines version 2.2015 \"Breast Cancer Risk Reduction\" (see page BRISK-5) under foot note \"bb\" (foot note is on page BRISK-6) states that \"axillary node assessment has limited indication at the time of risk reduction surgery\" I have heard of some doctors injecting isotope and then mark the sentinel nodes with clips before prophylactic surgery so that they can go back later after mastectomy and remove the marked nodes if pathology warranted it. I think that some women who have had mastectomy & reconstruction at NOLA have talked about this. If you are interested it might be worth a post on Dr. DellaCroce's \"ask the doctor web site\" http://members.boardhost.com/plastic/  BethL - mapping the sentinel node can easily be done in a prophylactic setting. There is no need for a tumor to be present. The isotope is injected near the nipple and they locate the main nodes that are drained using a probe that detects radioactivity. The radioactivity can be injected the day before surgery or the day of surgery. I think the dye can be done in addition to isotope and is usually done at the time of surgery. lemonadehk- I was under the impression that the exposure to radiation from lymphoscintigraphy was much lower - see conclusion section in link below - which talks about exposure equal to from 1 to 5 chest x-ray exposures http://www.birpublications.org/doi/pdf/10.1259/bjr... ",
      "MessageIndex": 2,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/840136",
      "Title": "Sentinel node dissection for prophlactic mastectomy? lemonadehk lemonadehk"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 15, 2016 10:09PM - edited Jan 15, 2016 10:29PM by besa For information specific to women who are very high risk and prophylactic mastectomy you could try the FORCE web site: www.facingourrisk.org A quick search turned up the info below concerning sentinel node biopsy. Hopefully there is more info to be found. http://www.facingourrisk.org/understanding-brca-an... In the study above 4 out of 143 women had invasive bc found during prophylactic mastectomy. Two of the four had positive sentinel nodes....",
      "MessageIndex": 9,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/840136",
      "Title": "Sentinel node dissection for prophlactic mastectomy? lemonadehk lemonadehk"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 15, 2013 12:59AM besa wrote: There is a very good web site with information about this: www.facingourrisk.org",
      "MessageIndex": 3,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798842",
      "Title": "Worried about my wife in her 20's TheBestAround besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Nov 26, 2014 02:42PM - edited Nov 26, 2014 03:30PM by besa If you are thinking about DIEP consider seeing Bernard Chang at Mercy in Baltimore for a consult. After researching things I think he is the most experience, high volume microvascular surgeon in the DC/Baltimore metro area. (I traveled to New Orleans for sGAP surgery and revision of a problematic contralateral DIEP that was originally done in the Maryland suburbs.) I am not a patient of Dr. Chang's but from my research he would be the first person I would consider in this area. He originally worked at Hopkins but then moved to Mercy. (My take on Hopkins is that the microvascular ps at Hopkins train there, and after that tend to stay for a relatively short time and then move on.) Think about getting a copy of the latest edition of Kathy Steligo's \"Breast Reconstruction Guidebook\" - the best I have seen on the topic. It will help you decide exactly what type of reconstruction you want and also help you choose a good ps. from amazon.com or from http://www.breastrecon.com/ A pedicled tram is a very different surgery from a free tram. The pedicled tram has many more issues and is no longer even offered at Hopkins because of its associated problems. First step- ask exactly what type of tram your current ps is offering. My take on things if if it is a pedicled tram I would immediately find another ps. My advice is go to the most skilled and experienced ps you can possibly find who offers the type of reconstruction you really want. If you want a DIEP travel for it (an hour is nothing in the scheme of things). This is a decision you will live with for the rest of your life. (As an aside I am happy with the decision I made in terms of type of reconstruction. It was the right decision for me. I am very active and have no physical limitations in terms of exercise. ) (Also - if you haven't already done so listen to Dr. DellaCroce's videocast on this site.)",
      "MessageIndex": 5,
      "PostDate": "26/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826554",
      "Title": "Big decisions in the next week Chloesmom Chloesmom"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jun 6, 2015 04:26PM - edited Jun 6, 2015 04:42PM by besa",
      "MessageIndex": 7,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/832354",
      "Title": "How is BC staged when you have multiple tumors? jmute Ridley"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jun 6, 2015 04:43PM - edited Jun 6, 2015 04:48PM by besa In my case with multiple invasive tumors in the same quadrant of one breast (multifocal breast cancer.) I was staged using the size of the largest tumor. They may stage the tumors separately if they are in different breasts or in different quadrants of the same breast (multicentric breast cancer). (DCIS, no matter what the size, is always stage 0.) If there are distinct areas of DCIS combined with distince areas of Invasive bc in the same tumor - my understand is that only the invasive portion will be used for staging.",
      "MessageIndex": 8,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/832354",
      "Title": "How is BC staged when you have multiple tumors? jmute Ridley"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Mar 16, 2016 04:26PM - edited Mar 16, 2016 07:19PM by besa Very smal titamium clips are routinely used to stop bleeding during surgery and are not removed. I have a DIEP reconstruction and an still monitored with mammograms (and have had MRIs of my reconstruction) Looking at the mammogram image I can always see multiple clips in my reconstruction. Multiple surgical clips are also left in the donor site and showed up on an x ray of my donor area. This is routine and normal and has never been flagged as a problem. I do not take prophylactic antibiotics before dental procedures or for any other reason . Have you talked to a diep ps about this current problem? I don't know if the metal \"artifact\" mentioned in your report is a titanium clip or clips. In my imaging reports, the clips seen are reported as \"surgical clips\" but the imaging facilities I have used are familiar with imaging tissue reconstructions.",
      "MessageIndex": 5,
      "PostDate": "16/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/842219",
      "Title": "Breast infection and \"metal artifact\" 2.5 years post-op littleemmi besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 12, 2013 09:49PM - edited Jan 12, 2013 09:52PM by besa I had my surgery with Dr. Dellacroce as the lead surgeon and Dr. Trehan assisted.  Dr. Stolier was the breast surgeon.  I met Dr. Massey on rounds.  They are all great- nice people, very caring,  who spend time with their patients. I am very happy with my results.",
      "MessageIndex": 4,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/798706",
      "Title": "Who did your surgery at NOLA? MrsH besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Feb 1, 2013 08:19PM - edited Feb 2, 2013 09:17PM by besa",
      "MessageIndex": 33,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799162",
      "Title": "Just Diagnosed now MRI finds a 2nd Lump jfelice Camillia"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jul 6, 2017 10:13PM - edited Jul 6, 2017 10:43PM by besa FORCE (www.facingourrisk.org) has a \"surgeon referral tool\" or \"Patient experience contact tool\" (they seem to use both names.) You can search by doctors name and find woman who have used plastic surgeons and breast surgeons for mastectomy and reconstruction and are willing to talk to others about their experiences. See if the plastic surgeon you are considering is listed there. http://www.facingourrisk.org/understanding-brca-an... http://www.facingourrisk.org/understanding-brca-an... Also possibly contact the local San Francisco FORCE chapter to to see if they could give you more information about the plastic surgeon you are considering. They may have members that have used him but are not listed in the patient experience contact tool. http://www.facingourrisk.org/get-support/local-gro...  Also, as an above poster recommended, ask to speak to former patients. For breast reconstruction this is a usual request. Anyone who is good will have a large group of happy \"customers\" who are more than willing to talk to you. Also ask to see photos of his work (also a usual request.) My feeling is that if you can't contact former patients and see photos of his work this is a red flag. In addition you want someone who does mainly reconstructions, cosmetic enhancements are a different skill set. You also want someone who does these surgeries in high volume, if possible multiple times a week and has been doing them for years. Another good resource... get a copy of the latest edition of Kathy Steligo's \"Breast Reconstruction Guidebook.\" There should be a section on how to choose a good plastic surgeon and other good information. http://www.breastrecon.com/index.html or from Amazon.com You can look this plastic surgeon up in pubmed. See if he is publishing anything on breast reconstruction. Publishing is not a guarantee that he will do a good job but at least a possible source of information about him.(put his name into the pubmed search engine below.) https://www.ncbi.nlm.nih.gov/pubmed/",
      "MessageIndex": 15,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856669",
      "Title": "How to assess a surgeon's expertise/quality MLScott CGG"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 4, 2012 04:12PM - edited Jan 4, 2012 04:13PM by besa The O.R. time depends on the type of reconstruction you want and the number of skilled surgeons working on you.  For tissue transfer (DIEP/GAP/hip flap)  some facilities have two very skilled plastic surgeons working on you at the same time and this greatly cuts the time in surgery.  I had a bc diagnosis and DIEP reconstruction, then decided 4 years later to do prophylactic GAP on the other side.  Insurance covered the surgeries.  My insurance would have also covered bilateral propylactic surgeries without a bc diagnosis if I had a significant family history, if I was BRCA positive, or if I had other significan risk factors that could lead to a bc diagnosis.  The scars are completely hidden even if I wore a bikini (which I am not going to wear).  Get a copy of the latest edition Kathy Steligo's \"Breast Reconstruction Guidebook.\"  It is the best I have seen on the topic and will give you the kind of information you are seeking (and more).",
      "MessageIndex": 3,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/780463",
      "Title": "Q's about prophylactic breast surgery beepbeep klynnz"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Sep 18, 2013 08:44PM besa wrote: A study that just came out today on the topic of treating DCIS with radiotherapy...... http://jco.ascopubs.org/content/early/2013/09/16/JCO.2013.49.5077.abstract?cited-by=yes&legid=jco;JCO.2013.49.5077v1 http://www.sciencedaily.com/releases/2013/09/130918101900.htm \"Breast Conserving Treatment With Radiotherapy Reduces Risk of Local Recurrence Sep. 18, 2013 — Results of EORTC trial 10853 appearing in the Journal of Clinical Oncology show that breast conserving treatment combined with radiotherapy reduces the risk of local recurrence in women with ductal carcinoma in situ (DCIS). The incidence of DCIS has been increasing in the past decades, and this has been attributed to increased detection through breast cancer screening using mammograms. In the EORTC study, adjuvant radiotherapy after local excision reduced the incidence of both in situ and invasive local recurrences by a factor of two and resulted in an overall lower risk of mastectomy. Dr. Mila Donker of The Netherlands Cancer Institute, Amsterdam, and lead author of this paper says, \"Survival after treatment for DCIS is excellent. Therefore, the question rises whether the current treatment for DCIS (local excision and adjuvant radiotherapy of the breast) is overtreatment. To answer this question, not only long-term data about local disease recurrences and prognosis are important, but also information about the prognosis and treatment in case of recurrence.\" Between 1986 and 1996, the phase III EORTC trial 10853 randomized 1010 women with complete local excision of DCIS to no further treatment (503 patients) or radiotherapy (507 patients). The risk of any local recurrence was found to be reduced by 48% (HR: 0.52, 95%CI 0.40-0.68, P<0.001) in the patients who also received radiotherapy. The 15-year local recurrence-free rate was 69% for the group of patients receiving breast conserving surgery alone, but this increased to 82% for the group of patients who also received radiotherapy, and the 15-year invasive local recurrence-free rate was 84% versus 90%, respectively (HR: 0.61, 95%CI 0.42-0.87). The differences observed in local recurrence did not lead to differences in breast cancer specific survival or overall survival, but patients with invasive local recurrence did have a significantly worse breast cancer specific survival (HR: 17.66, 95%CI 8.86-35.18) as well as overall survival (HR: 5.17, 95%CI 3.09-8.66) than those who did not recur. Thus, an invasive recurrence resulted in a worse prognosis. A lower overall salvage mastectomy rate after a local recurrence was also observed in the group of patients who also received radiotherapy, 13%, than in those patients who just received breast conserving surgery, 19%. Thus, radiotherapy after breast-conserving surgery for DCIS resulted in an overall lower percentage of patients who were treated with a mastectomy after a local recurrence. This study highlights the importance of conducting long term follow-up.\"",
      "MessageIndex": 59,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/682418",
      "Title": "anyone with low grade dcis not having radiation joe1234 ballet12"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jan 27, 2016 09:43AM - edited Jan 27, 2016 11:36AM by besa It is not clear to me from your original post if you are, or are not ,estrogen receptor positive. If you are estrogen receptor positive (ER +) you should be able to have an oncotype dx test done on the tumor tissue to determine if chemo is necessary.(if you are ER+ and they are not recommending this test I would want a very good explanation of why they aren't using it.) In any case, you can seek a 2nd opinion with another medical oncologist for peace of mind to make sure you are on the right path in terms of chemo. ..see link below about oncotype dx test: http://www.genomichealth.com/oncotype_iq_products/... ",
      "MessageIndex": 2,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/840738",
      "Title": "Stage 2A... Doc recommends preventive chemo Ashley46 Moderators"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Nov 22, 2011 10:13PM - edited Nov 22, 2011 10:22PM by besa Logan - You are impressive.  As \"37 antiques\" said these are personal decisions that only your mom can make with the help of her doctors.  Often women will get a 2nd or 3rd opinions from different doctors - just to make sure she is on the right track and to help her decide . Now a biology lession- I don't know if you have learned about this in biology class yet (I guess I will see how good I am at explaining things): Cells have receptors on their surface.  A protein is able to bind and fit into the receptor.  It is sort of like the receptor is a \"lock\" and the protein (a hormone) is a \"key.\"  In this case when the \"key\" fits into these \"locks\" they cause the cells to grow.  Breast cancer cells can have estrogen receptors, progesterone receptors and human epidermal growth factor 2 (HER2)  receptors.  These 3 different receptors can be blocked with specific drugs - for example tamoxifen is a drug used to block the estrogen receptor. Tamoxifen will help keep cancer cells with estrogen receptors from growing.  Your mom's cancer cells do not have these receptors so other different drugs or treatments are used.  As \"37 antiques\" said not all breast cancers are the same - and the treatment will be different depending on what works best for the kind of breast cancer a woman has.",
      "MessageIndex": 24,
      "PostDate": "22/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/778497",
      "Title": "Im am 15, and my mom was Just Diagnosed. TheAnonymousL shells43"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Jul 21, 2013 05:57PM besa wrote: I am guessing he is probably scared.  This is just my opinion and a generalization but often men, in difficult situations, want to be able to take action to \"fix\" things.  When they can't take concrete action they are sort of stuck.  They are often not used to listening and supporting people (without fixing things) the way women tend to do.  You can try telling him what you need and it may help - but some people, even if they have good hearts, are just not capable of doing what you are asking.  If this does turn out to be bc (and even if it is not) you might want to put a therapist in place to help you get through this.  There is also a book \"The Breast Cancer Husband\" which you could suggest he read if the diagnosis does turn out to be bc. It may help him support you. It would be nice to be able to change the interaction so you get what you need.  It may or may not be possible.  The idea is to get through this as best you can. ",
      "MessageIndex": 1,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/808072",
      "Title": "Waiting for biopsy...Married, but feeling alone. Grace1969 Grace1969"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Aug 28, 2014 08:38PM - edited Aug 28, 2014 08:45PM by besa I had a \"suture granulomas\" also called \"spitting a stitch\" which fit your description. It happened closer to when my reconstructive surgery was performed (and had nothing to do with tattooing).   Not sure of the time frame in terms of how long this can happen but I think it can be within the time frame you mention.  If this does turn out to be what you are dealing with it is basically the body's immune response to an internal suture.  In my case my ps just told me what it was and didn't seem to be concerned - just asked me to keep it clean while it healed.   Consider calling your  surgeon's office now (instead of being concerned and worrying for the next two weeks) and just describe what your are seeing.  See what they think and ask them how you should handle the situation.  ",
      "MessageIndex": 1,
      "PostDate": "28/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/824020",
      "Title": "Pimple on Mastectomy Scar Lifeafter besa"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "May 26, 2014 03:23PM besa wrote: If you have mastectomy and immediate reconstruction you will need two surgeons - a breast surgeon (a general surgeon who does mainly breast surgeries) and a very experienced plastic surgeon who specializes in and does mainly breast reconstructions (not cosmetic enhancements - which is a very different skill set). Some very good resources: www.facingourrisk.org      (FORCE is an advocacy group for women dealing with  hereditary breast cancer - lots of great information on this site as well as a group of women dealing with the same issues) I secondd  Divecat's recommendation - The LATEST edition of Kathy Steligo's \"Breast Reconstruction Guidebook\"  -  The best I have seen on the topic.... http://www.breastrecon.com/  or from Amazon.com ",
      "MessageIndex": 3,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821409",
      "Title": "Do I need two surgeons? JoPete Moderators"
    },
    {
      "AuthorID": "besa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136339/profile",
      "Content": "Aug 29, 2014 05:31PM - edited Aug 29, 2014 05:35PM by besa http://journals.lww.com/dermatologicsurgery/Citation/2006/05000/Suture_Granuloma_Following_Surgical_Neck.41.aspx http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3644453/ I think the majority of suture granulomas do occur closer to the time of surgery but they can occur many years out.  See the (non-bc) peer review joural articles in the links above. Hope this turns out to be something very innocuous---",
      "MessageIndex": 3,
      "PostDate": "29/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/824020",
      "Title": "Pimple on Mastectomy Scar Lifeafter besa"
    }
  ]
}