{
  "AuthorID": "Bess88",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221081/profile",
  "Posts": [
    {
      "AuthorID": "Bess88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221081/profile",
      "Content": "Sep 11, 2015 04:47PM Bess88 wrote: I requested a copy of the mammo report at PCP office today. I'm glad I did. \"Developing density which demonstrates a smooth border. 13 mm. Indeterminant, possibly a cyst.\" Birads 0. I know this doesn't mean all clear, but much better than my imaginings. Wish I had that full information a week ago. The deliberate holdback and vagueness of info is probably meant to avoid panic, but had the opposite effect. Very frustrating.",
      "MessageIndex": 5,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834893",
      "Title": "Driving myself google crazy Bess88 Bess88"
    },
    {
      "AuthorID": "Bess88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221081/profile",
      "Content": "Bess88 wrote: Hello, I am new here. 44 yo, family history (mother) who died from stage 4 at 61. I had baseline mammo at 35, called back for compression views (horrible experience with nasty tech). Others have been normal since, though I've definitely not been faithful about going yearly. Actually my most recent one, prompting me to write, was 3 years since last. Went on a Saturday. Tech explained she would be doing 3d mammo bc of history and known dense breasts. I've also been told in the past that I have fibrocystic breasts. I'm pretty sure previous mammos were not 3d. She did 4 regular views. Then after reviewing them took extra couple of left. I thought nothing of it at the time. Following Tuesday a message was left that they wanted me in for another appointment. For some reason I didn't see that I had the message until Thursday, later so couldn't call back until Friday. When I did, I was told that radiologist recommended an ultrasound. Not another mammo, which I clarified with her. Given \"next available\" (wondering if this would be sooner if suspicion was higher) appointment for ten days later, this coming Monday. Called PC right after and receptionist said they were going to call me. I need to see PC for physical and referral script. That is tomorrow. She told me that report said \"area of density in upper quadrant left side\" I had pap and clinical breast exam in June with no problems detected. So now I know that tech saw something prompting those extra views on left. That is what has me worried more than typical callback stats. I must already be out of the \"could be just an overlap of tissue\" category. No idea what the birad score is though it is making me crazy that it's recorded somewhere. I can't find any info on how common it is to recommend us rather than diagnostic mammo firstafter a screening. Finally got official letter today. \"Area needing further investigation. Ultrasound recommended. If not already scheduled call as soon as possible.\" Also noted my density classification is scattered glandular. I am sick with worry and have given myself bruises! poking around trying to feel what they are focusing on. Really can't find anything unusual. I am a single mom with one son in college. I'm certainly not going to worry him at this point. But I really don't have anyone I feel I can share any of this with. So sharing here just to get it out and maybe find some moral support. Thanks for any thoughts. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834893",
      "Title": "Driving myself google crazy Bess88 Bess88"
    },
    {
      "AuthorID": "Bess88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221081/profile",
      "Content": "Sep 10, 2015 07:12PM Bess88 wrote: Thank you patoo!",
      "MessageIndex": 4,
      "PostDate": "10/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834893",
      "Title": "Driving myself google crazy Bess88 Bess88"
    },
    {
      "AuthorID": "Bess88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221081/profile",
      "Content": "Sep 10, 2015 06:43PM Bess88 wrote: Thank you! I keep trying to tell myself those things. It feels better just to know someone listened and replied with positive thoughts.",
      "MessageIndex": 2,
      "PostDate": "10/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834893",
      "Title": "Driving myself google crazy Bess88 Bess88"
    }
  ]
}