{
  "AuthorID": "bestrong",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90910/profile",
  "Posts": [
    {
      "AuthorID": "bestrong",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90910/profile",
      "Content": "Jan 22, 2010 01:33PM bestrong wrote: Hello.  I had a similiar experience with my first mammogram.  I went to the screening with a concern of dimpling, puckering in left breast.  I told the tech. but she did not really see it.  I then was called back for irregular density on the opposite breast.  I ended up having the stereo-tactic as well, with benign results.  Great news, but come back in 3 months for a follow-up.  Well in those 3 months I must done several BSE a DAY.  I became obsessed about having cancer.  It is especially hard for me, considering my mother died one year ago of cancer. (not breast)  I am also adpoted so I do not know my medical history at all.  After going back to the follow-up they said everything was fine.  I have now decided that I will keep doing what I am supposed to do and not worry about this everyday.  I need to focus on things that are positive.  There are so many others here with similiar circumstances that did not get same results.  Take care and hopefully your worry will lessen.",
      "MessageIndex": 4,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/747014",
      "Title": "Anyone with dense breasts - lump on upper outer quadrant brady0819 ddbaker"
    },
    {
      "AuthorID": "bestrong",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90910/profile",
      "Content": "Nov 11, 2009 03:49PM bestrong wrote: hello, I am sorry that you are going through this.  I do not understand all the terms in your report, but I believe BIRAD 4 usually requires a biopsy.  I know that I had to have one.  I also had dense breast tissue.  Have they scheduled you for a biopsy?  Remember that 80% of the time a biopsy will come back benign.  Mine did.!!  I hope that you recieve news soon, I feel you though.  The waiting sucks!!",
      "MessageIndex": 1,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/743693",
      "Title": "Ok...any idea what this means? Willow_1647 thenewme"
    },
    {
      "AuthorID": "bestrong",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90910/profile",
      "Content": "Jan 25, 2010 10:41AM bestrong wrote: My pathology was normal breast tissue change, but then it was noted on my chart as fibrocystic breast disease.  I think that it is very common to have this while you are still premenopausal.  I am sorry that you are struggling with this so much. (I have read your previous posts)  Hopefully after next week you will be able to relax and not worry so much.  You had very good results from you first biopsies,",
      "MessageIndex": 2,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/747302",
      "Title": "Anyone with biopsy results: normal breast tissue brady0819 Kam28"
    }
  ]
}