{
  "AuthorID": "bestfriend05",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139653/profile",
  "Posts": [
    {
      "AuthorID": "bestfriend05",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139653/profile",
      "Content": "bestfriend05 wrote: Dear friends, mum has had a really rough patch since last year when she was diagnosed, stage 4 from sept 2011 with brain mets, brain surgery, left breast mastectomy, whole brain radiation, chest wall radiation, letrozole (failed), then gamma knife as brain reccurence for 7 spots and now tamoxifen failed. Doctor says will do chemo or surgery, not decided yet, pls advice and give your words of wisdom to help my mum..what kinds of chemo are usually used for chest wall reccurrences, is resurgery advisable? bestfriend Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792830",
      "Title": "letrozole and tamoxifen failed, what next? bestfriend05 nancyh"
    },
    {
      "AuthorID": "bestfriend05",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139653/profile",
      "Content": "bestfriend05 wrote: Hello all, Mom has had her 3rd round of adriamycin and cyclophosphamide for lung and liver mets, she is in the 2nd week after this chmeo cycle and has suddenly developed very painful mouth sores and difficulty swallowing on one side of the throat. She went to the emergency clinic yesterday and they prescribed her some nystatin for fungal infection of mouth. I was wondering if anyone else had similar problems, I am little bit worried about the swallowing issue? Why does she have that, the doctor did not really explain it. She has also started using biotene mouthwash..Any inputs will be appreciated.. Thank you and God Bless.. Bestfriend Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801333",
      "Title": "difficulty swallowing and mouth sores bestfriend05 allisontom911"
    },
    {
      "AuthorID": "bestfriend05",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139653/profile",
      "Content": "bestfriend05 wrote: Hi all thought would just start this thread for all the buzz that is surrounding breast cancer vaccines. There are quite a few trials taking place as I have researched so far. It will be good to share our info on this topic as well I suppose..here is one of the articles I found, a stage 4 lady with promising results: http://www.thedailybeast.com/newsweek/2011/12/11/could-this-be-the-end-of-cancer.html please share your breast cancer vaccine clinical trial stories if u know of any, thank you..xx Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782780",
      "Title": "Breast cancer vaccine clinical trials for stage 4 bestfriend05 bestfriend05"
    },
    {
      "AuthorID": "bestfriend05",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139653/profile",
      "Content": "bestfriend05 wrote: Hello all, My mum is on the above combo for lung and liver mets. She has had 5 cycles so far and has one more to go. She has been complaining of a couple of side effects and was wondering if I could get some insight from here, cuz most of the time I get more info here than from doctors. She is having infrequent rapid heart beats and breathlessness, which I told her could be related to low iron levels, but I am also aware cyclophosphamide can be cardiotoxic. She also has of course the whole blue brittle nail thing going on which have been temproraily relieved by this nial polish we got from pharmacy. Also she has been a change in her bowel movements, and its not diarrhoea, its atleast 3-5 stools a day which are normal. I am thinking of asking her gp to get a stool test done. We have told our oncologist and he does not seem to think much about it. I was wondering any one here is in a similar situation. Thank u all.. God Bless.. Bestfriend Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800162",
      "Title": "Cyclophosphamide/adriamycin and side effects bestfriend05 Cafelovr"
    },
    {
      "AuthorID": "bestfriend05",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139653/profile",
      "Content": "bestfriend05 wrote: Hello everyone, my mother was recently diagnosed with stage 4 and mets to brain (single lesion) which was removed surgically, she has now been advised to get WBR or wait and watch..!!! can some one pls help us in making this decision, has anyone everbeen in a similar situation before..? we r so confused and stuck, really really dont know what route to take..she is er and pr +ve and her2 -ve, so cannot have herceptin...! what is one to do..??? PLS HELP Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778775",
      "Title": "WBR or wait and watch..!!! bestfriend05 luvmywife"
    }
  ]
}