{
  "AuthorID": "beth1225",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
  "Posts": [
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Feb 20, 2009 06:16PM beth1225 wrote: kdholt, yes get to a genetics counselor and let her help you with a fmaily tree.  Just because there are no women on a side of the family has no bearing on whether or not a genetic mutation exists.  There is a 50% chance of it being passed down and has nothing to do with the sex chromosome.  There are a lot of factors and the GC will discuss them  with you.  Also, men DO get BC like my dad did.  Sometimes, men do not get it taken care of until it has invaded other sites and progressed and the primary is not distinguishable as BC.  Most of all, go to FORCE, Facing Our Risk of Cancer Empowered (www.facingourrisk.org) to find out more answers and articles.  It is the only non-profit that is devoted to genetic mutation and family history and the ensuing risk.",
      "MessageIndex": 7,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/729333",
      "Title": "What are the chances? kdholt Sessna1"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "beth1225 wrote: I had 2 back-to-back staph infections after my bilat mast.  The ps had a PICC line put in on my right arm for IV antibiotics and it was in 3 weeks.  I still have soreness, sometimes to the point of not being able to use it at all.  That has not been occurring that badly lately but the upper arm still feels like something is irritating it. has anyone else encountered this kind of thing? Any thoughts appreciated. Love and hugs, Beth \"Without Humor, life is a walk, not a joyride.\" PBM 5/7/2007 www.youravon.com/bethcohen www.freewebs.com/larryandbeth is our family website, please visit me! Dx 1/3/2008, DCIS, Stage 0, 0/6 nodes, ER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703511",
      "Title": "PICC line site sore 9 months later beth1225 beth1225"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Apr 11, 2008 02:19PM beth1225 wrote: One good thing about these boards is that when I post something like this, I don't feel like a freak in that it is all in my head.  Not that the docs have said this, but they don't ahve any definitive answers. Noni, we must be neighbors!  I live in Willow Grove, which is also suburban Philly!  Welcome to the boards.  We sometimes have get-togethers in and around the city.  Last one was at Chili's on City Avenue.  Send me an email so I can keep you up-to-date, larryandbeth1 at verizon dot net.  We also have mini meets like at Starbucks! Snowy, I have no idea how many cms were put in.  Good point though.  I guess it is analagous to leaving a sponge in.  I would have to request notes from the radiologist and then the home infusion people who took it out.  The right arm is also the same one I broke twice in one year and it is sensitive from that too.  But the pain is in the upper arm. Swimangel, I only 3 nodes out on each arm at the PBM and nobody thinks it is the culprit.  No more staph infections for me either.  The ps is so cautious in regard to it.  I am now allergic to one of the oral antibiotics, clindamyacin (sp?).  Got a lovely rash all over my body from it.  Thank you all for responding!  Glad we got each others' backs!",
      "MessageIndex": 4,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703511",
      "Title": "PICC line site sore 9 months later beth1225 beth1225"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Jan 16, 2007 02:21AM beth1225 wrote:",
      "MessageIndex": 6165,
      "PostDate": "16/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/185035",
      "Title": "2005 ROCK-TOBER CHEMO GIRLS sherryhaire Curlylocks"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Feb 6, 2008 09:39PM beth1225 wrote: From one Beth to another, Twink is so very right.  I really balked at the idea that I would be taking meds to get through this journey.  I had so many problems along the way, I asked my plastic surgeon about something to get rid of that hole in the stomach feeling.  he did and still does write me scrips for xanex to take as needed. Then my dh, mom and brother had an intervention with me and my GP.  They were all at my appt with him and told him how I cried at the drop of a hat, blew up over nothing, actually picked fights at times.  Other times I just wanted to be left alone and slept.  Well, his feeling was after all I had been through, HE needed an anti-depressant.  So I am now on effexor twice a day as well.  My dh just commented to one of my bff's that I am a different person, much more like I had been before my on-going surgeries and then the discovery of the DCIS. Nobody should have to go it alone.  Sometimes you just need a little help.  And an Ambien or Lunesta the night before is allowed by any of the surgeons and some even have samples.  Personally, if your PC is not going to help you, get a new doctor, JMHO.  I did a couple of years ago and the one I go to now is very understanding (as I said above). Viv, before my ooph in 2002, I had to wait in pre-op for an hour while they waited for an anesthesiologist.  I understand how you felt!",
      "MessageIndex": 10,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699885",
      "Title": "sedative before surgery? Beth41 Abby2"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Jul 14, 2007 06:55PM beth1225 wrote: I had my bilateral on 5/7/07 with immediate implants. Once the last drain was pulled (I had a lot of infections after surgery) the ps told me to massage with lotion or cream. It does make it feel better. I still feel tight across my chest especially when I am tired after a long day. The numbness is what is the weirdest feeling. That has not eased up yet. The nerves I was told can take over a year or more to regenerate. Also, don't be surprised if you get shooting pains that the doc called \"phantom pains\" and that is associated with the cut nerve endings too. It is kind fo embarassing when in the middle of a group of people I grab my chest! At least my friends and family understand.",
      "MessageIndex": 3,
      "PostDate": "14/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/654327",
      "Title": "Post Mastectomy Tightness Katiejane Beesie"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Mar 13, 2008 11:53PM beth1225 wrote: Kimmie, my dad, his mother and her mother before her all had bc.  Two of his cousins had ovarian cancer.  We all were tested on that side and all carry the BRCA2 gene mutation.  I opted in 2002 to have the ooph to remove the ovaries which reduce the risk of both cancers.  This past year in May of 2007, I opted to have the Prophylactic Bilateral Mastectomy (PBM).  It gave me such relief knowing my risk went from 80-95% risk down to around 5-8%, lower than the national average.  Although I have had some problems with the PBM post-surgery, I would not have changed my mind for one minute. I received a lot of support both here and at FORCE, Facing Our Risk of Cancer Empowered (www.facingourrisk.org) where they deal more frequently with the PBM and Oophs.  Please sent me a private message (PM) if you want to talk further or go to my family website (below) and send me a message. I know it is a very difficult and extremely personal decision.  I hope you can come to terms with it and have the peace of mind you seek.",
      "MessageIndex": 1,
      "PostDate": "13/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702131",
      "Title": "proactively removing my breasts kimmiecakes57 beth1225"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Jan 24, 2007 01:15PM beth1225 wrote: FSU, I understand the feeling of what ifs. One of the reasons I am doing the preventive measures is to avoid the waht ifs. I still have some anyway. I have 4 sons (one is mine, 3 are dh's) and 4 gorgeous grandkids. I am doing all of tis for them so I can see them mature and grow up. I am sure your mind is racing right now. I was anxious for 3 days waiting for the results from the CA125 and it came back OK. Take a deep breath and love your kids and know we are all here for you whenever you need us.",
      "MessageIndex": 4,
      "PostDate": "24/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/513346",
      "Title": "concerned - would love some insight FSUfan94 planningplanner"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Jan 30, 2007 11:23PM beth1225 wrote:",
      "MessageIndex": 1,
      "PostDate": "30/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/519005",
      "Title": "good news Sheila1960 Chrysalis"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Jan 24, 2007 01:45PM beth1225 wrote:",
      "MessageIndex": 6,
      "PostDate": "24/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/513346",
      "Title": "concerned - would love some insight FSUfan94 planningplanner"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Mar 28, 2007 10:01PM beth1225 wrote:",
      "MessageIndex": 1,
      "PostDate": "28/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/570161",
      "Title": "Women urged to have MRIs wildabouthorses wildabouthorses"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Jan 9, 2008 08:42PM - edited Jan 9, 2008 08:43PM by beth1225 Hi Margie! I am probably too experienced with drains as this is my 3rd round of surgeries with them!  The first time, I had some leakage around only two out of the four.  When I was back in the hospital shortly after my 1st surgery, the nurses used a special drain gauze pad that is fitted to go around the drain.  These are very expensive to buy at the pharmacy and ones like CVS do not carry them.  However, my dh was clever and he bought the non-stick gauze pads and sterilized scissors and cut them out like the ones at the hospital.  Worked like a charm and we did it again back in August with my drain and again on 12/27 with this one.  Even if you don't shower everyday and just get a \"bird bath\", change the gauze.  Call the doctor, even if you don't think it is important, it puts your mind at ease.  The less stress on you the better and the docs want to know if you are experiencing a problem.  Better safe then sorry, trite I know, but a valuable lesson.  I also had visiting nurses the 1st and 2nd surgeries so I called them with questions. One question in particular:  After about a week and a half, the fluid went from red to light red to pink and then like a straw color.  I had no clue so I called the visiting nurses office and they assured me it was the natural progression and they want to see it get to that color.  If you see stray strands of red, that is ok too.  It is probably tissue going through.  Make sure you use an alcohol wipe to \"strip\" or \"milk\" the tubes.  It acts as a lubricant to make it easier to do and helps clean off germs. If you ever need to talk or ask more questions, please email me, bethpknits-pink@yahoo.com.  I will be glad to help if I can.",
      "MessageIndex": 7,
      "PostDate": "09/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698187",
      "Title": "Drains question mmcp bean4865"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Mar 29, 2007 01:02AM beth1225 wrote: Shirlann, we have Aetna HMO and they did not pay for the MRI the first go round. They needed paperwork form the ordering dr who was my gyn. She pointed out the scrip said BRCA2+ and strong family history. Guess they missed it but they did turn around and pay for it. I think it takes a strong willed doctor to be on your side too.",
      "MessageIndex": 8,
      "PostDate": "29/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/570161",
      "Title": "Women urged to have MRIs wildabouthorses wildabouthorses"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Jan 30, 2007 01:47AM beth1225 wrote: Cindy, good luck to today. We will be there keeping an eye on you. Come back and let us know what happens. All of us are wishing b9!",
      "MessageIndex": 8,
      "PostDate": "30/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/517848",
      "Title": "Tomorrow is the big day! threekidsinall TeddyJudy"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Jan 31, 2007 08:10AM beth1225 wrote: Glad to hear you are feeling better than the night before. When I had my first lump out I was not prepared for the shock of pain when the anesthesia wore off. Both of mine were B9. We are hoping for the same for you too.",
      "MessageIndex": 19,
      "PostDate": "31/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/517848",
      "Title": "Tomorrow is the big day! threekidsinall TeddyJudy"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Mar 28, 2007 04:52PM beth1225 wrote:",
      "MessageIndex": 1,
      "PostDate": "28/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/570373",
      "Title": "steriotactic biopsy terri01 annie43"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Feb 8, 2008 04:55AM beth1225 wrote: Hello everyone.  I was tested several years as part of a research study and found out I am BRCA2+.  Part of the study was getting consultations with a genetics counselor.  We mapped out a plan from high surveillance to the PBM and Ooph.  The other place to get a lot of information is at FORCE, Facing Our Risk of Cancer Empowered (www.facingourrisk.org).  There is a wealth of knowledge there and a lot of women and men who are at high risk and BRCA+.  Hazel, it is frightening.  But I have to reiterate, everyone needs the counseling.  It really helps to know what your options are. I had the ooph in 2001 and then the PBM may, 2007.  At the time of the ooph I was 41 and in a relationship.  Granted, I was too old, in my opinion, to have more children.  I was also on Tamoxifen as a preventive measure before the PBM. If any of you would like to talk more about it, please feel free to email me at larryandbeth1@verizon.net.  I would be very willing to help where I can.  I have been in your shoes already.  And don't forget to check in at FORCE.  They have a message board and chat room too.  Both here and at FORCE you get support and information.",
      "MessageIndex": 8,
      "PostDate": "08/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/698603",
      "Title": "waiting on BRCA test 4kkz katharine"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Jan 31, 2007 01:54AM beth1225 wrote: Sloth, don't give up the good fight. I keep waffling with doing the prophy bilat mast but then when I look at the kids and grandkids I know I don't want to keep that risk. I also don't want to go through the treatment when it does hit. And we all want you to be here to talk to. So reschedule!",
      "MessageIndex": 2,
      "PostDate": "31/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/518891",
      "Title": "sloth's surgery delayed ..ugh... sloth notmyturn"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Mar 28, 2007 05:23PM beth1225 wrote:",
      "MessageIndex": 4,
      "PostDate": "28/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/570373",
      "Title": "steriotactic biopsy terri01 annie43"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Feb 6, 2008 09:27PM beth1225 wrote: Happy Birthaday Zar!  I didn't know until I saw the thread tonight.  Hope your day was filled with wonderful times! ",
      "MessageIndex": 14,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699865",
      "Title": "happy birthday zarowny! BethNY zarowny9"
    },
    {
      "AuthorID": "beth1225",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/41890/profile",
      "Content": "Sep 16, 2007 07:15PM beth1225 wrote: Susie, thank you for posting this.  I saw it when I was on FORCE(Facing Our Risk Of Cancer Empowered) last night.  I feel like my story was up there except I am older!  The decision to do the PBM is so very hard to do.  I sometimes wonder after all the post-op complications I had, why I did it all.  Then I get reminded from the people at FORCE, that i am bc free and my risk is reduced greatly.  There is a lot of talk over on there boards about it, www.facingourrisk.org.  Joan called and told me about it too.  She was going to post but you beat her to it!  Thank you for doing it. Love and hugs to you (and Shana Tova), Beth   ",
      "MessageIndex": 5,
      "PostDate": "16/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/692259",
      "Title": "Weighing risk and Prophylactic mastectomy article NYT saluki nicvec"
    }
  ]
}