{
  "AuthorID": "bethanybean…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69193/profile",
  "Posts": [
    {
      "AuthorID": "bethanybean…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69193/profile",
      "Content": "Nov 17, 2008 10:08PM - edited Nov 17, 2008 10:09PM by bethanybeane Hi all GOOD NEWS TO SHARE FOR ENCOURAGEMENT.  I've been worried about how weak I am...... but what a difference just from last weekend to this. I walked up a big hill last week -- stopping several times to bend over -- catch my breath --- and even though I didn't get to walk during this past week b/c of work and appts, I made it up the same hill this weekend with very little trouble. Things do get better. I'm 5 weeks out from Chemo and feel good. Still some minor side effects but improving and feeling more like myself everyday. Hooray. Hang in there and keep on keeping on.  9 of 33 rads done -- no side effects from that to speak of -- only some pangs of nerve pain every now and then -- could also be from nerves finally waking up after June surgery. I'm beginning to feel like I won't feel bad forever. All the best, Bethany",
      "MessageIndex": 75,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "bethanybean…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69193/profile",
      "Content": "Dec 5, 2008 04:09PM bethanybeane wrote: Sherrie, Thanks for the info about creams and the cheek swab test. Bethany",
      "MessageIndex": 112,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "bethanybean…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69193/profile",
      "Content": "Nov 11, 2008 06:04PM bethanybeane wrote: Hi Desi, I also finished chemo in October and am having the same number of rad txs that you are. I started radiation last week and have had 6 now. I am also working on regaining strength and stamina after chemo. It took a toll. Today I had good news that I had lost 3 lbs in the last couple of weeks -- hopefully not just water since it wasn't just water that I gained during chemo. I'm working on looking and feeling better each day. Hoping that I might have some very short hair by mid-January and have lost the weight I gained. It sounds like you had a tough regimen.  I think, even if we have redness or burns, it will be easier than the chemo. I don't know how I could be any MORE tired -- it's all relative. And, I'm just going to focus on feeling better every day. Take care, Bethany ",
      "MessageIndex": 58,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "bethanybean…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69193/profile",
      "Content": "Nov 16, 2008 09:33AM bethanybeane wrote: Sherrie, The technicians told me not to worry about losing the weight I had gained - they could adjust. And, my doctor there enthusiastically congratulated me on losing 4-6 lbs. (some water I think). Maybe ask again? Bethany",
      "MessageIndex": 69,
      "PostDate": "16/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "bethanybean…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69193/profile",
      "Content": "Nov 14, 2008 08:56PM bethanybeane wrote: Hi Michele, I checked back on this thread and Suz in LA (near the top of the previous page) mentions a strange taste in her mouth. Seems although a rare s/e, you are not alone. Has this continued or is it just after treatment? Wonder what that's about...hope you can ask your doctor on Monday. ~Bethany",
      "MessageIndex": 64,
      "PostDate": "14/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "bethanybean…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69193/profile",
      "Content": "Oct 29, 2008 10:15PM bethanybeane wrote: Hi all, Just logging on as another November radiation starter. I've also been reading the October rad posts which have lots of helpful tips and set some expectations. My simulation is on 11/4 and am not sure exactly how soon they'll be ready with my set up after that. Trying to decide the time of day that will be least disruptive to work but allow for any side effects. Fortunately, center is only 10 mins away from my office and parking is free. Counting that blessing when I see how far some of you guys have to drive - my thoughts and prayers go out to you for safe travel. Bethany",
      "MessageIndex": 20,
      "PostDate": "29/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "bethanybean…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69193/profile",
      "Content": "Nov 4, 2008 07:11PM - edited Nov 4, 2008 07:12PM by bethanybeane Hi all, I'm another who begins radiation tomorrow. I'm to have 28 full breast and 5 boosts. I didn't get tatoos, only three red crosses that were covered with clear \"skin\" type circles that can get wet. I feel very fortunate. I'm going in everyday at 4:20 on my way home from work and I'm sorry some of you have to drive so far -- that makes this harder for you. Still having Herceptin every three weeks which took 2 hours on Monday and no side effects!!! My muscles are so wasted -- and it takes hardly any exertion to be out of breath....Onc said that the Decadron caused muscle atrophy and that it will take some dedicated effort to regain strength. This has been really hard and I'm hoping that the radiation will be much easier.  We can compare notes as we go. Bethany",
      "MessageIndex": 36,
      "PostDate": "04/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "bethanybean…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69193/profile",
      "Content": "Nov 6, 2008 04:37PM - edited Nov 6, 2008 04:38PM by bethanybeane Am I imagining pangs of stinging pain at the former tumor site after two days of radiation? Maybe it's just the healing that is still going on -- nerves waking up after several months. I think I'm going to use aloe vera everyday after rads before I get pink. I have a sore spot on the sentinal nodes where that is probably a reaction to the suture. Has anyone else had this? What does cording look like? Bethany",
      "MessageIndex": 44,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "bethanybean…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69193/profile",
      "Content": "Nov 25, 2008 05:47PM bethanybeane wrote: Hi Liz, Glad you finally get to move on to the next phase so that you can get that one behind you too. I finish rads on 12/19. Wish you didn't have to travel so far. I'm curious about how much hair has grown back for you since 9/25. Happy Thanksgiving!  ~ Bethany",
      "MessageIndex": 98,
      "PostDate": "25/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    }
  ]
}