{
  "AuthorID": "BetNY22",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
  "Posts": [
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Jan 9, 2014 08:27PM BetNY22 wrote: Hey Ladies, I made some big decisions this week and I wanted to come thank you for helping me with them. You ladies have been such an inspiration to me. Carol, your words really made a difference and I am starting with a trainer on Saturday to get in shape so I can not only help my lymphedema but also because I have decided to do the diep flap surgery. I have a phone consult with Dr. Massey on Sunday and I am really excited about it. I am hoping to be a regular on this thread and really get into the exercising. I sent the trainer the handout and she was happy to read it. Thx!!",
      "MessageIndex": 4366,
      "PostDate": "09/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Jan 10, 2014 09:34PM BetNY22 wrote: thanks Carol & Hugz! I was chicken too Hugz, I just kept going for consults and they keep telling me I shouldn't use an implant because of the radiation and that I should do the diep. I am flying for the first time next week and I am a nervous wreck about that too, I will wear my glove and sleeve but I just pray nothing gets worse, we are going to disney so its a test of alot of things...we shall see, I may have to get one of the go cart type chairs if I can't keep up. I can't believe how motivating you ladies are! The trainer called me back to tell me she read the handout and said that she thought I should do a half hour session at first, she seemed to really absorb all of what she read, she talked to me for a while about it. We are gonna start Tuesday instead of this weekend.",
      "MessageIndex": 4373,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Jan 23, 2014 08:34PM BetNY22 wrote: Hi ladies, my first plane ride went well and my lymphedema did not act up thank god! I went to disney so at the end of the day I was ridiculously exhausted and hurting but I propped my arm up on pillows and by the morning everything seemed to be ok. I was so excited to work with the personal trainer before I left and she was so attentive and concerned for my LE but now Im back and she left for a week for her vacation so I doubt I'll get much more in before my surgery on 2/12. So Dr. Massey thinks just by doing the diep that she will minimize my lymphedema and it might even go away- I am so nervous and excited at the same time. Carol I am going to pm you for some exercises, maybe I can do them on my own for the next couple of weeks.",
      "MessageIndex": 4422,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Nov 19, 2012 10:50AM BetNY22 wrote: Thanks mgdsmc, I decided this morning that today is the start of a new week and this week I am gonna have the \"I can kick cancers ass\" attitude. I sent a couple of pics of myself to the wig lady and she is going to show me a few wigs that are as close to my look as possible. I am going to reschedule the other wig consultation as well. I will see which I like better. Lol Paula, I feel the same way about being like Mgdsmc. I have some weird arm aches today, trying to find a lymphedema massage therapist, they say it can help prevent it. Being that I had 30 removed and that I will be having radiation I better get on it before it gets me. Have a great day everyone!",
      "MessageIndex": 660,
      "PostDate": "19/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Oct 21, 2012 01:15PM - edited Oct 21, 2012 01:16PM by BetNY22 I guess I should stop being a lurker... I am due to have surgery a bmx this Wednesday Oct 24th, I am so tired of waiting for the surgery date to come it feels like forever I was diagnosed on Sept 28th. I am so nervous what the pathology report will look. I had a biopsy, that found a 2.5cm lump in my left breast and a positive lymph node. I then had an MRI that showed the lump to be 3cm and that there was more than one lymphnode positive...at the time of the MRI they also said that one of the lymphnodes behind the breast wall looked swollen and that if it that was positive they wouldn't be able to reach that and I would have to have radiation to that spot, I got that phone call while walking into my Petscan. I spent an entire weekend planning my death and got the phone call with the results of the petscan on monday with bs beginning with the words \"are you ready for some good news?\" thank god was not behind my breast wall. I still worry though, I wonder how good the petscan is. Does anyone have pain in their breast before diagnose? I have been having pains for months which I thought might have been heart related and after being diagnosed and biopsy the pains have been worse, like sharp pains. The bs said it is my muscles reacting to the cancer, that I am have muscle spasms. I will post again at a later date cause my 9yr old daughter keeps looking over my shoulder. Good luck to everyone!",
      "MessageIndex": 252,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Oct 31, 2012 05:34AM BetNY22 wrote: Hi October girls. I am exactly a week out from my mastectomy. Came to a hotel last night because I can't imagine feeling like I do with no power in my house (storm hit us). I am very worried about my drains although covering doctor thought it was ok. I might head to hosp today to have them check it out. There are some clots in my drains and it is much darker than it started. She said it might be old blood since I had a hematoma in hosp. I really thought this surgery would be easier on me since Ive been through 2 back surgeries. I am now scared of the diep flap I will now have at the end of this horror. I haven't cried once since I've been back from surgery, when my 9 year old girl seen me for 1st time after surgery she screamed with excitement \"Cancer Free\". I wouldnt want to burst her bubble and her see me crying. I also have a 4 yr old boy that has no clue except the fact that he can't hug the arm with the pink bracelet on it. Has anyone else had clotting? Thanks for the laughs Dulcigirl, I would be the type to calculate too.lol",
      "MessageIndex": 411,
      "PostDate": "31/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Nov 21, 2012 04:15AM BetNY22 wrote: Interesting MGD, I didnt realize they could do that. I have to wait for mine, 6 months after radiation, so prob about this time next year. I look at is as a bonus tummy tuck for going through all this shit. Hopefully it won't hurt that bad for you.",
      "MessageIndex": 677,
      "PostDate": "21/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 2, 2012 12:09PM BetNY22 wrote: Nice to hear from you MGDSMC, glad to hear you are doing well, can't wait to do my flap!",
      "MessageIndex": 769,
      "PostDate": "02/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Nov 1, 2012 08:00PM BetNY22 wrote: Thanks Paula, I went today for my post op appointment and all was fine, she agreed that  the reason the liquid was so dark was because it was old blood and that the clots were fine. Didn't take the non producing drain out since she said sometimes when you take it out the other one will lose suction. Cindy -I am terrified of drain removal, cant believe it was that bad, sorry you had to go through that Mary- I can imagine that being very upsetting but I am sure it was just because you are not used to it and you think everyone is aware of it, Im sure you looked fine Grier-happy birthday! we are the same age :) Pathology report came back 3/30 nodes positive and 3.4 cm tumor ER+ PR+ Her2- I couldnt of been happier, I thought I had more nodes involved. Either way having cancer is sucky but I guess this is better than expected. I was upset to hear that it will take 6 months after radiation to have the diep, I wasn't aware of that. So this morning when I woke I was so drained and could barely stand to brush my teeth, I was so upset thinking I was getting weaker instead of stronger- the bs told me that it was because I stopped taking pain meds and I should continue to take them, that I need them. I have been taking again and I feel much better. I was also thrilled that she said I could remove the constricting bra, what a relief. I used a home depot work cotton work belt around my waist to put drains in. I guess I will go update my profile. Goodnight Ladies",
      "MessageIndex": 433,
      "PostDate": "01/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Nov 18, 2012 07:35PM - edited Nov 18, 2012 07:36PM by BetNY22 Hi Ladies, its been a couple of weeks. I spend a couple of hours on here a day, (almost obsessed) but I don't post very much. I have had a few real down days since I met with my MO, I think reality set in even more. I need to go wig shopping this week. I cancelled an appointment I had with the wig place since MSK were able to see me on Friday since they had a cancellation. This hair thing is on my mind more than it should be but I just can't help it, I have hair down to the middle of my lower back. I thought of trying the cold caps to keep hair but the MO told me that chemo wouldnt work near my head area and would if I had lingering cells, that is where they would go. She definitely didn't sugar coat ANYTHING. So I guess I wont ice my nails or toes either because what if it cant get there either. I have spent the last hours on here in the forum where the 5+ years ladies check in, it is very inspiring and makes me feel better, I have been crying extremely easy since appointment. You girls have been great and uplifting, you all have such wonderful attitudes. I am so happy to hear that some of you have had none to very little side effects. I start dense dose chemo (every 2 weeks) on 11/28 for 8 sessions. First 4 are AC and than 4  of T. They gave me a bunch of prescriptions to fill, I am going to  compare them with everything you said you took MGDSMC, sounds like you handled it well. Good night all, hoping for a better day tomorrow. I Will be praying for all of us. Glad to hear your mom was ok Grier :) Bet",
      "MessageIndex": 657,
      "PostDate": "18/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Nov 19, 2012 06:21PM BetNY22 wrote: Shirley we will really be able to compare- are you doing every 2 weeks or every 3? That's great that your friend couldn't tell about you wearing a wig. I am definitely having arm issues too, my range of motion is awful and my hands are hurting today. I have been searching for a lymphedema expert and I guess I will have to bite the bullet and go to the one at Sloan where I am being treated. It is at a different branch and all the way uptown but I will just have to go. I am waiting for one other person to get back to me that might have some info of one where I live. Good luck with the cording issues IAtigger and Connie",
      "MessageIndex": 666,
      "PostDate": "19/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Nov 28, 2012 07:43AM BetNY22 wrote: Good morning, waiting to be called for my first infusion, I was scared out of my mind all day yesterday. Connie, definitely ask for a prescription called Avitan, it is helping so much with anxiety and is also for nausea. I kept receiving texts and phone calls wishing me well for today and each one of them set me off in tears. I took 3/4 of the pill and I was singing silly songs to my kids. at the docs suggestion I took a whole one this morning and I am way calmer then my DH, he looks like the one who might be getting chemo. Trying to drink this water, I know it's good, just trying to get it down. I guess I should post on Nov chemo, and introduce myself. BTW- no port for me, they don't automatically do them at MSK in the city, makes me nervous. I'll post later.",
      "MessageIndex": 726,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 1, 2012 05:43AM BetNY22 wrote: Good morning.. Mgdmsc- I hope everything went well with surgery, I hope you are on soon to let us know. Connie- you really can't pay attention to stupidity, I told my friend that she reminded me of her mother in law and she asked me if the cancer went to my brain...p.s, she called me 3,days later apologizing how dumb she was for saying that. Had my first treatment on Wednesday, so far so good. They say today will be the worst, done with emend and the steroids, I'm kind of on my own. Gonna take my claritin and the clorozine (sp?) on my own andif I have to I'll take that Avitan but that puts me in lazy mode. Paula, I went for my wig too and tried something entirely different, I wasn't into it. I go back tomorrow for the one i loved---to have it cut and styled, it looks so much like my own hair I was quite impressed. It is human Asian hair dyed to my lighght brown color with blonde highlights. She said she will curl the bottoms and it should lasts for weeks. I went to another place in the city that wanted 3x the amount and it wasn't even human hair. Good luck to everyone this weekend, I have to feed the kids breakfast....wishing no SE for everyone! Bet",
      "MessageIndex": 765,
      "PostDate": "01/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 22, 2012 08:42PM BetNY22 wrote: Shirley, mgdsc is right. Emend says right on the package I get to take 3 days in a row. I've been lucky with nausea and the doctors thought mine would be really bad since my pregnancy nausea was over the top. I take the steroids - 3 pills for 2 days following chemo too. I would def call. Good luck! Mgdsc, how is recovery going? I can't wait to do my flap!",
      "MessageIndex": 870,
      "PostDate": "22/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Nov 20, 2012 07:36PM BetNY22 wrote: Politico-sorry you had a bad day, I had a few of those last week and they are just draining and so upsetting. I went back to my hairdresser today to touch up my roots-I figure I have 3 more weeks until it falls out, I might as well. I apologized to her for having my worst meltdown ever in front of her, of course she said don't be silly but I really did lose it in her chair last week. I hope your birthday was as nice as can be. Hope your energy bounces back. Mgdsmc, what surgery are you having? I thought you were done, is it the 2nd part of your tram. I will be doing the diep flap after this is all over with. Paula I know the feeling of no more drains- I had them in 22 days, what a difference in sleeping! Connie-I hope your infection clears up fast. Today was very productive, I made an appointment for wigs, PT,massage therapist. I go for my EKG in the morning to make sure my heart is up for my chemo start next Wednesday. Goodnight!",
      "MessageIndex": 675,
      "PostDate": "20/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 6, 2012 06:39PM BetNY22 wrote: Hi Ladies, I haven't been on in quite a few days was trying to give it a break since I feel I become obsessed with this site sometimes. Well I'm done with my break.lol I am on day 8 past my first chemo and really doing well, the only side effect so far started today...it looks like I am getting a cold sore on both sides of my mouth where my bottom and top lips meet. I used the baking soda and salt rinse, we shall see! Mdg sounds like your doing great, I would bê the same way, I'd show everyone. I would show everyone my mastectomy if they would look.lol Grier exciting that you are almost done and have your exchange surgery set. Connie glad to hear no side effects for you either. Everyone else seems to be doing good as well! Very weird, I have a buzzing sound in my ear, wonder if it's a side effect...hmmm",
      "MessageIndex": 803,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Jan 1, 2013 05:32PM BetNY22 wrote: Just stopping in to wish my fellow October girls a happy & healthy new year!",
      "MessageIndex": 881,
      "PostDate": "01/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Jan 25, 2014 03:50PM BetNY22 wrote: GIRLSTRONG, I did a full head of hair extensions at about 8 months post chemo.  I am very happy I did them but even at 8 months it took alot of patience to do it so it blended since the extensions have to be so high up in the head and you end up with a mullet look for a while.  I now have them in 2 1/2 months and I love them, hair is blending nicely now. Pm me with any other questions, I'd be happy to answer!",
      "MessageIndex": 19958,
      "PostDate": "25/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Jan 1, 2013 07:30PM BetNY22 wrote: Lol luvbugs, I ordered out today and I thought I'd never order from there again but reading your post it must be the taste buds.lol.... Tomorrow is a full week of the yucks! last night i did venture out for a few hours to a friends party a few blocks away, I tried to get my husband and kids to go without me, it didn't work. I was decent, I medicated myself and I even sipped a glass of sangria. Whether I feel well or not its back to work for me tomorrow, my business has been closed since last Thursday, time to get back to work. happy & healthy new year to all of you! It's funny how last year I would say \"happy, healthy, & prosperous\" but this year prosperous just doesn't mean anything, healthy is key! Hugs to all!",
      "MessageIndex": 1438,
      "PostDate": "01/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 18, 2012 09:30AM BetNY22 wrote: thanks for being so supportive, only you women know the real emotions of this. txjunebug, that is a good way to look at it, at least I know its working. My family keeps convincing me to shave it but I somehow am scared that if I do, just what if I were able to retain some to pull some out of the bottom of a hat or scarf. I know I am dilussional and I have to move on :( How is everyone doing with their weight? I gained last time and my Ocologist said that I have to be careful because most weight gained during chemo is very hard to lose. I just don't want anything but carbs. Im gonna put a cute hat on and try and enjoy this day with my children, we are doing all the great xmas sites in NYC today.",
      "MessageIndex": 1214,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 29, 2012 05:45PM BetNY22 wrote: Macyhen you will be in my prayers tonight, I'm so sorry to hear about this.",
      "MessageIndex": 1401,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 27, 2012 12:39PM BetNY22 wrote: I hope everyone had a very Merry Christmas- my memory is really off, anyone else? I had my #3 yesterday and I feel very nauseous after this one. I needed to come into my office and do end of the year stuff and while Im usually very good with Math and calculating I needed to call my mom to make sure I was doing it right. Very frustrating! I am leaving soon, I feel useless here- I had my assistant come in and I think I'll tell her she can leave too, there is really nothing going on. Its alittle over a week and I am over the hair buzzing. I haven't seen my barehead yet, I switch from scarf to wig. I have to say, I really love my wig, it was a small fortune but worth it, I get so many compliments with them not know it isn't my real hair and the people that know say wow, if I didn't know I would never think. That makes me happy!",
      "MessageIndex": 1363,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 28, 2012 08:52PM BetNY22 wrote: Michelle- I can't believe everything you've been through :( Hi ladies- had tx3 of AC on Wednesday---a lot different than the last 2 that barely affected me- knocked me on my ass with nausea and fatigue. Thought I might end up in ER with dehydration since I wasn't able to drink liquids. A friend came by today with some med marajuna and within a half hour I was back to myself. It was actually a chocolate cookie, I only ate1/8th of it and was feeling great, eating and drinking (not high). My oncologist had said it was helpful as long as I didn't tell her about it.lol...hadn't needed it till now! Dont know if I mentioned b4-short term memory loss terrible. But my breast cancer was not evident on my mammogram, I was very lucky that my Gyno found it and sent me immediately for a ultrasound instead of just mammo. I was told I have very dense breasts. Question- are any of you planning on a diep flap after radiation? I am, it can't come soon enough- 6 monts post radiation",
      "MessageIndex": 1389,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 30, 2012 05:23PM BetNY22 wrote: This #3 has really been awful for me :( I can't believe the difference I feel from this one, I was almost fine from the other 2. Liquids are so hard to get down and I'm having a hard time being awake. I thought I would be fine for New Years and now I'm not so sure. I hope I miraculously wake up a different person tomorrow.",
      "MessageIndex": 1417,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Nov 28, 2012 05:34PM - edited Nov 28, 2012 05:34PM by BetNY22 Hi all, I am not new to bco but I am new to the November boards. First infusion today- I am doing four rounds of AC and then four of the T. Wasn't as bad as I thought, the anti anxiety medicine they subscribed helped- Avitan. They gave me all kinds of meds for nausea, I am also on steroids. Wishing to get that energy everyone talks about from them. So far I haven't moved off the couch in 5 hours, only to use the bathroom and eat. The only way to make me happy is think that I am 1/8 done with my treatment. Glad I found this board, very helpful!",
      "MessageIndex": 734,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 2, 2012 07:23AM BetNY22 wrote: I'm on day 5 of my first treatment, first couple of days I had so much energy, now I can barely move. I am going to pick up the wig I bought, she is cutting it exactly the way mine is now. I feel like if I wear it before I need it I might get used to it and not freak out as bad. I have to say the TE are my biggest complaint right now, they are only filled half way but drive me nuts while I'm sleeping...so much pressure. I'm considering not filling them anymore since eventually I am doings diep flap. I am taking the Claritin for the neulesta plus taking the compazine a couple of times a day and the aches and nausea have stayed away. They only gave me steroids for first couple days plus the emend. Wishing everyone a SE free day!",
      "MessageIndex": 840,
      "PostDate": "02/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 17, 2012 03:05PM BetNY22 wrote: Hi Ladies, its been a while. I have been reading your posts but haven't posted. I am day 5 from AC #2...this treatment was harder than the first on me. I have some nausea, a headache and fatigue (still working) but overall the only real complaint is this hair loss. I knew I would lose it, I think about it constantly, this is the horrible to me, worst than losing the breast, I am not taking this good- I wish someone could put me to sleep and wake me up when my hair regrows- I know it sounds so petty and vain but I can't help but feel this way. I hope everyone has minimal side effects",
      "MessageIndex": 1204,
      "PostDate": "17/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 19, 2012 09:09PM BetNY22 wrote: I did it! Got head shaved last night, my hair was so gross and I was scared to wash it because of clumps that would come out. My mom came with me and I didn't look when my hairdresser did it, she then restyled my wig and I went home with that. I changed from the wig to a scarf in my closet since it was the only place with no mirrors, and didn't look this morning either when putting on wig, wonder how long I can keep this up. I went to work with wig which looks a lot like my hair and someone I do business with walked in and said, \"you have a new hair-do, how nice\" I tried to be vague and change subject but they went onto ask if I had plans of going someplace special with my fancy hair...ugh, couldn't change subject fast enough! My scalp hurts today and we only used a #2 blade.....This whole thing is so traumatic. Today I stayed at work the longest I've stayed since I was diagnosed, I really physically good @ 6 days past tx#2. Bracing myself for #3 which I get the day after Xmas. I haven't noticed anything with my nails as of yet. It's great that most of you are able to do some work from home. Btw I love the topless in Walmart, that's awesome! Wishing everyone a SE free day tomorrow!",
      "MessageIndex": 1235,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "BetNY22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161915/profile",
      "Content": "Dec 21, 2012 03:55PM BetNY22 wrote: Luvbugs- praying that all test results come back good Sick of pink- I feel so bad for you, what are you taking for your nausea, maybe they need to switch it up. I take emend, it has worked great. Dakota- I swear I can't take sedative stuff normally, the ativan just really takes the edge off. I take it before I go for chemo as well. Try taking 1/2 at first if you feel edgy (hard to break those little pills though) Priscilla-hoping white blood counts come back up for you. I would try some lentil soup-its full of iron",
      "MessageIndex": 1260,
      "PostDate": "21/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    }
  ]
}