{
  "AuthorID": "betsee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197534/profile",
  "Posts": [
    {
      "AuthorID": "betsee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197534/profile",
      "Content": "betsee wrote: Hi everyone!  I've been reading the boards for a couple of weeks since I've started having pain in my left breast. I'm 46yo, with unknown materal family history of breast cancer.  It so happened that I had a scheduled gyn appointment around the time the pain started, so I asked my doctor about it an she sent me for a mammo and US but she didn't seem concerned.  I went for the mammo and US last week with no results yet.  The US tech asked about the pain, I was able to give her an idea of what was going on and she also pulled up my mammo on her computer.  She said my breast were dense and that I would need US with my mammos going forward and also that the area where my pain is was only cystic.  It was black and oblong and about an inch and half long.  From what I read, cysts are benign and usually don't lead to cancer but again I haven't seen my report yet so I'm still waiting.  What my question to the group is about family history, considering the density of my breast and my mother died of gastic cancer but I have no other family history to draw from.  I know family history is a strong risk factor for breast cancer but how do doctors figure risk for someone with no history?  I would hope that they would err on the side of caution.  Has anyone else had this experience or some information that I can draw from? Thanks!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818962",
      "Title": "Unknown maternal family history betsee betsee"
    },
    {
      "AuthorID": "betsee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197534/profile",
      "Content": "Mar 11, 2014 04:46PM betsee wrote: Thank you so much for your responses.  What I should focus on is myself and whatever the biopsy results are.  But first, I have to figure out where to get the biopsy done.  My doctor's office wasn't helpful in referring me anywhere.  I was thinking about calling the radiology center I went to for the mammo and US or should I go to a breast cener or breast surgeon?  I'm picking up the perscription and copies of my radiology reports tomorrow and would like to schedule my biopsy right away.  Any suggestions based on your experience would be helpful!  Thanks hugs :)",
      "MessageIndex": 7,
      "PostDate": "11/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818962",
      "Title": "Unknown maternal family history betsee betsee"
    },
    {
      "AuthorID": "betsee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197534/profile",
      "Content": "Mar 11, 2014 05:00PM betsee wrote: Geekyknitter, good point!  Thanks again, I'll call them tomorrow after I get the perscription.  And thank goodness yours was benign!!",
      "MessageIndex": 9,
      "PostDate": "11/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818962",
      "Title": "Unknown maternal family history betsee betsee"
    },
    {
      "AuthorID": "betsee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197534/profile",
      "Content": "Mar 13, 2014 02:17PM betsee wrote: Thank you ladies!  It really helps to get feedback!  I made an appointment for 3/19 with a breast specialist surgeon but I'm keeping the biopsy scheduled until after I meet with the BS.  I'll decide after I speak with him to see what he suggests, I imagine he will have his own facility that he prefers.  I know in the end that a biopsy is the only way to diagnose anything and Geekyknitter you're probably right that by doing an MRI it could be costly and delay final results.  I was wondering if anyone has a lot of soreness and for how long after the biopsy?  I'm supposed to get a core needle biopsy, same as Petitegal.  We're planning on going camping that weekend and I'm hoping to not be sore.",
      "MessageIndex": 17,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818962",
      "Title": "Unknown maternal family history betsee betsee"
    },
    {
      "AuthorID": "betsee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197534/profile",
      "Content": "Mar 19, 2014 09:06PM betsee wrote: I went to BS today and left more confused than I started.  He started off telling me that biopsies shouldn't be done if not necessary, so I was kinda hopeful until he wanted to look at it on ultrasound.  Once he saw it his response was verbatim \"it's a mass and you need a biopsy\", I left there more scared than it started.  I was in such shock I didn't ask any questions.  My husband gets esophageal biopsies once a year for a rare condition and doesn't understand my concern. He thinks I'm overreacting. I've been more bummed today cause I was hoping that the BS would say it's just a cyst and let's aspirate it.  I wasn't expecting its a mass, you need a biopsy.  It's scheduled for Monday, I hope he gets results quickly. ",
      "MessageIndex": 20,
      "PostDate": "19/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818962",
      "Title": "Unknown maternal family history betsee betsee"
    },
    {
      "AuthorID": "betsee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197534/profile",
      "Content": "Mar 13, 2014 11:51AM - edited Mar 13, 2014 12:10PM by betsee Divecat, thank you!  Yes very true but I can't stop from thinking that its more suspicion than I've ever had... :(  I haven't left it alone and am undecided how to handle it even though I've already scheduled the biopsy.  Its 12 days out, too much time to think about it...cause on the one hand its my gyn that is perscribing the biopsy and is solely ordering the biopsy on the report from the radiology center.  It makes me feel like sheep being herded around, you know?  On the other hand, I've read so many others had consultations and options being explained to them.  I understand that biopsies can leave scar tissue, etc. and I was wondering if I should have an MRI before doing something invasive.  I have heterogeneously dense breast tissue, I'm just wondering if something could be lurking behind the large complex cyst or the several other cysts that I have.  If I'm going to go through getting poked and prodded, I would feel better if I knew there wasn't anything else that needed to be biopsied.  I'm just confused...",
      "MessageIndex": 13,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818962",
      "Title": "Unknown maternal family history betsee betsee"
    },
    {
      "AuthorID": "betsee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197534/profile",
      "Content": "Mar 10, 2014 03:38PM betsee wrote: DiveCat -  Thank you for answering my post!  Yes, I am still pre-menopausal.  I understand there are many factors, some unexplainable as to why or why not bc happens.  I'm still waiting for the report, so I'll hold off asking for anything until I hear from the doctor's office.  Although, the pain in my left breast is causing me to lose sleep, I keep rolling on to it while I sleep.  I wonder if its typical to draw it out and shrink it? I was considering asking about genetic testing to help bridge the gap of my maternal side of the family.  I usually use my sister as a guage since she's 15 years older than me but I know we are still unique from one another and its not a true barometer.  Kicks - Thank you for answering my post!  I agree with you that there is a risk everyday in our lives.",
      "MessageIndex": 3,
      "PostDate": "10/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818962",
      "Title": "Unknown maternal family history betsee betsee"
    },
    {
      "AuthorID": "betsee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197534/profile",
      "Content": "Mar 11, 2014 04:01PM betsee wrote: I spoke to my doctors office today, they are sending me for a US needle-guided biopsy for a complex cyst.  I haven't read the report yet, picking it up tomorrow along with the perscription for the biopsy.  From what I read, I understand that cysts are generally B9 but I've never had a biopsy done before and just not knowing if any of my mother's family has had BC its causing me a little worry.  Add to that both my parents died of cancer, mom was gastric, dad was espohegeal.  Dad also had skin cancer, it was something cell skin cancer, he had it removed and it never came back.  I know I'm probably putting peices together that don't belong and my husband tells me not to worry but knowing that both my parents had cancer and how it dangerous it is, I can't help it.  Thanks listening and posting your stories and thoughts, its very inspiring and comforting.  Take care :)",
      "MessageIndex": 4,
      "PostDate": "11/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818962",
      "Title": "Unknown maternal family history betsee betsee"
    },
    {
      "AuthorID": "betsee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197534/profile",
      "Content": "Mar 12, 2014 12:11PM betsee wrote: Ok, I got my report BI-RADS 4A, 1.4 cm cystic mass with the presence of solid nodularity at the peripheal aspect.  I've schedule my bisopsy with a local hospital that has a breast cener.  The radiology center doesn't do the biopsies in the location that I went to for the mammo and US.   My appointment is 3/25/14 and I haven't been sleeping well, my husband keeps telling me to not worry but its hard not to.  It is helpful to know that 80% of BI-RADS 4 are beneign, I'm just going to leave it at that. :)",
      "MessageIndex": 10,
      "PostDate": "12/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818962",
      "Title": "Unknown maternal family history betsee betsee"
    }
  ]
}