{
  "AuthorID": "bevsteed",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74531/profile",
  "Posts": [
    {
      "AuthorID": "bevsteed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74531/profile",
      "Content": "bevsteed wrote: Is anyone else experiencing this?  My muscles, bones & joints felt better ON chemo than after I went off.  Is there an anti-inflammatory effect that chemo has that could benefit the joints, etc?  I am temporarily off only a month to have surgery, and will be starting chemo again in a month after surgery.  I'm looking forward to seeing if my body aches go away again once I start chemo.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729026",
      "Title": "Effects of Chemo or Stoppage of Chemo on Musles & Bones bevsteed bevsteed"
    },
    {
      "AuthorID": "bevsteed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74531/profile",
      "Content": "Feb 18, 2009 02:26AM bevsteed wrote: Wow, it's good to hear there others having the same symptoms.  My first thought was the cancer was spreading.  I also had Neupogen shots during chemo and wondered if that might have something to do with it.  I've also put back on some weight, about 10 pounds, and I KNOW that has something to do with it.  I'll start a walking and stretching routine asap.  My symptoms always go away when I get up and MOVE.  Thanks ladies. ",
      "MessageIndex": 5,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729026",
      "Title": "Effects of Chemo or Stoppage of Chemo on Musles & Bones bevsteed bevsteed"
    },
    {
      "AuthorID": "bevsteed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74531/profile",
      "Content": "Feb 21, 2009 07:23AM bevsteed wrote: I had dose intense abraxane (3 weeks on, 1 week off) for 3 months.  I also got cytoxin and epirubicin during the first round of each cycle.  The only bad side effect I had was neutropenia.  I had to be very careful about being around people and picking up illnesses.  I got neupogen shots for the low white blood count.  I never had nausea because I was always given zofran and decadron before the abraxane.  Of course my hair came out.  If you have problems, ask if they're giving you nausea meds.  If not, ask for some. ",
      "MessageIndex": 5,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/728809",
      "Title": "Abraxane ? kbugmom bevsteed"
    },
    {
      "AuthorID": "bevsteed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74531/profile",
      "Content": "Feb 13, 2009 12:26PM bevsteed wrote: I also had a golf ball sized tumor.  Mine was malignant and I did 4 months of chemo to shrink the tumor before surgery.  Another reason they will do chemo first IF her tumor is malignant is to make sure that her tumor is responding they way they want it to and that they are using the right drugs.  My tumor disappeared after the chemo, but I'm still having bi-lateral mastectomy next week, followed by more chemo and radiation since I had lymph nodes involved too (that have also disappeared).  It's so scary, so much misinformation out there.  Pray, pray, pray.  I recommend a great book called \"There's No Place Like Hope\" written by a 3-time breast cancer survivor.  I've read it a couple of times during my treatment.  Tell her she's NOT ALONE! ",
      "MessageIndex": 5,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/729014",
      "Title": "Golf Ball size tumor Lukesmom ecm"
    },
    {
      "AuthorID": "bevsteed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74531/profile",
      "Content": "Mar 19, 2009 04:14PM bevsteed wrote: Hi again everyone: Thanks for your replies.  I'm doing better now...just want to move ahead with life one day at a time.  Dawn, I had the same treatment regimine as you, except mine was every week, 3 weeks on/one week off.  I couldn't tolerate the entire cycle because my white counts dropped too low.  They are changing up my cocktail for this next cycle, don't know what it will be yet.  Toronto, I know how you feel.  I don't want anymore false hope.  I had CT scan on Tues, going to onc next Tues. and will find out if there is mets per CT.  I hate sweating out these tests!!!  Hanging tough here.  I'm gonna go shopping tonight. ",
      "MessageIndex": 19,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730086",
      "Title": "Lots of Positive Nodes bevsteed lexislove"
    },
    {
      "AuthorID": "bevsteed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74531/profile",
      "Content": "bevsteed wrote: I just got the post-mastectomy path report from my surgeon.  I had 27 of 29 positive nodes and still quite a bit of tumor present despite neoadjuvant therapy.  Does anyone have any advice?  I know this is not a good development.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730086",
      "Title": "Lots of Positive Nodes bevsteed lexislove"
    },
    {
      "AuthorID": "bevsteed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74531/profile",
      "Content": "Mar 3, 2009 04:17PM bevsteed wrote: Hi lexis:  I'm triple neg.  I'm confused about margins because I had bi-lateral mastectomy.  I assume that means they took all the tissue.  I'll have more chemo and radiation.  I had MRI in january that showed no tumors or nodes.  That's why this report is so discouraging. ",
      "MessageIndex": 2,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730086",
      "Title": "Lots of Positive Nodes bevsteed lexislove"
    },
    {
      "AuthorID": "bevsteed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74531/profile",
      "Content": "Mar 4, 2009 05:35PM bevsteed wrote: Hi ladies; Hi Lex:  Thanks for checking on me.  I'm feeling really down today.  We went a month thinking I was clear from the MRI and now this happens.  Talk about false hope.  I called the surgeon's office to get more information and the nurse said I'd have to wait until my follow up appointment on the 17th.  Also told me to call my main onc to get details.  Feel like I'm getting the run around.  I'm trying to get my fight back though.  I'd like to know what my stage is now.  I was IIIA before surgery, but now I know I'm probably IIIC or worse.  I've heard that being triple neg makes it worse.  I'd just like to get some up beat news.  Anyway, I'll get out of this pity party soon.  Nowhere to go from here but up huh?  God bless you all! ",
      "MessageIndex": 9,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730086",
      "Title": "Lots of Positive Nodes bevsteed lexislove"
    },
    {
      "AuthorID": "bevsteed",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74531/profile",
      "Content": "Mar 5, 2009 04:33PM bevsteed wrote: Hi everyone:  Thanks for your posts, advice and good wishes.  Like you, Ann, I was told per MRI, ultrasound and mammo that I had a great response to neo-adj chemo.  I was ready for good news.  But wWhen the surgeon called with the path report, she just said \"there was quite a bit of tumor\" in the breast and \"lots of diseased nodes.\"  When I asked how many nodes, she said 27 out of 29 and that I would have to do more chemo.  I was in total shock.  I see her again on the 10th and am going to ask lots of questions.  I don't see my medical onc until March 24th, at which time he will give me a complete run down on the path and a treatment plan.  I'm just so scared because everything I've been told about triple negative ILC is that it's very bad.  I've been crying a lot and praying a lot.  I've got so much to live for.  I'm just going to have to take a deep breath and get mean again.  On my daughter's facebook page she has posted a poem she wrote called \"Map to Okay\".  She wrote it about breaking up with her boyfriend.  But I love the title and told her that if she found the \"Map\" to share it with me, because I really need to be okay right now.  You all are great, and I thank you truly from the bottom of my heart.  I know that you know where I'm at because you've already been there.  God bless all of you. ",
      "MessageIndex": 14,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730086",
      "Title": "Lots of Positive Nodes bevsteed lexislove"
    }
  ]
}