{
  "AuthorID": "BFFofStageIV",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92240/profile",
  "Posts": [{
    "AuthorID": "BFFofStageIV",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92240/profile",
    "Content": "BFFofStageIV wrote: Hi everyone .. I think I have read everything I can possibly read on this site. I'm the Best friend (33 years) to my 'sister'.   She has been diagnosed with Stage IV, Grade 3, IDC.  We just got the reports from PATHOLOGY and are heading into Dana Farber tomorrow for our second opinon. My friend is 47 years old (Tomorrow).  She has three children ages 17, 15 & 13.   She is healthy, strong and has no other issues.  5 years ago we removed approximately 3 tumors that were \"fatty and non- cancerous, from the same breast. I need your help .. what do I ask, if anything.   What do I listen for tomorrow during our second opinion meeting, and what can I DO?    We are all at a loss as to how we move forward and get busy with the fight ... we won't let this win. Any and ALL guidance would be so, so, so appreciated.  I want to give her the best of me.  I want to know what I should be doing tomorrow, besides listening and taking notes! Some history: We had our first biopsy one month ago.  Immediately went in and removed the lump.  Told:  Stage II.  We did a ct scan, an MRI, and then a PET scan.  They found more in her chest cavity.  They did the second surgery almost two weeks ago.  Found each and every lymph node to be enlarged and positive.  One doctor wants to start hormone treatment, another wants to start chemo immediately.  Tomorrow we meet with Dana Farber.    What can I do for her? Lisa - the BFF who calls my friend .. her left arm!! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "10/11/2009",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743653",
    "Title": "BFF of Stage IV -- What do I do? BFFofStageIV BFFofStageIV"
  }]
}