{
  "AuthorID": "bieque",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
  "Posts": [
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "Jul 7, 2012 07:32AM bieque wrote: Why did they schedule the diagnostic so far away!?  I'm driving myself crazy while I wait for the 13th.  I know they only do diagnostics on certain days, but......ugh!",
      "MessageIndex": 2,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790037",
      "Title": "waiting for follow-up mammogram for microcalcifications bieque bieque"
    },
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "Jul 11, 2012 09:39PM bieque wrote: I would have been fine if the assistant had simply said that they had gotten the labs back and doc would call if anything was abnormal....it's the fact that she made it sound like she didn't even know if the tests had come back or not and wasn't even willing to check (actually said that it would require her to pull up another window on the computer and then there was silence...thought she was checking....then she said, did you hear me?  I told her I thought she was pulling up the tests and that's when she said that she didn't understand why I even wanted to know the results). When I had labs done back in March to confirm a UTI and to determine a reason for my fatigue, (at a walk in clinic), they called me a few days later to tell me that my labs were all normal.....so I don't understand why my doctors office won't at least tell me that much information. I know that there's definately something going on....what it is I don't know, but I was running 40 plus miles a week, ran a full and a half marathon in January/February and now I'm struggling to run more than 5 miles a week as I'm so fatigued, having aches and pains (even on days I'm not running), inflamed thyroid, etc...It could be something as benign as hitting perimenopause....I just want to know for sure what I'm dealing with.....I'm supposed to run another marathon in October and I need to get over this fatigue/heavy leg thing so I can start training. It's a new doctor....I like her so far, but the phone assistant needs to work on her patient skills.",
      "MessageIndex": 7,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790037",
      "Title": "waiting for follow-up mammogram for microcalcifications bieque bieque"
    },
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "Jul 10, 2012 05:51AM bieque wrote: I tried to get it moved up, but they didn't have any openings (apparently they're backed up from the holiday). I'm equally frustrated with the doctor's office.  My labwork in June came back indicating elevated bilirubin levels (it was normal back in March) and blood in the urine, and since I'm still extremely fatigued and experiencing shoulder pain and now some pain in my upper abdomen (just started this past week), she ordered a liver function test and complete urinalysis. I went to the lab last Tue. and since I had heard anything back, I called my doctor's office yesterday for the results.  The assistant said, \"I don't understand why you want to know the results.\"  ????? Um, what???? She went on to tell me that I'd hear the results in August at my next appointment.  I asked if they doctor had seen the labwork yet and she sounded irritated and said that she'd ask her tomorrow but not to expect her to call me. Some of these people should NOT be working in a medical office where they have to deal with patients.",
      "MessageIndex": 5,
      "PostDate": "10/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790037",
      "Title": "waiting for follow-up mammogram for microcalcifications bieque bieque"
    },
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "bieque wrote: I went to my doc due to on-going fatigue (approx. 4 mo), shoulder pain, hip pain, and pain in the right breast.  She ran a lot of bloodwork as we suspected a thyroid issue but since it had been 4 years since my last mammogram, she also had me do another screening. Bloodwork came back showing thyroid is functioning within normal ranges, but she noted that it is indeed inflamed and that there is a bump on the trachea that she's not sure what it is.  My bilirubin is elevated and there was blood in the urine. The mammogram showed microcalcifications in the right breast that were not present in my prior screening (done in 2008) and they have scheduled me for a diagnostic mammogram on the 13th. This is all pretty scary especially since my mom passed away from breast cancer in 2008 after a 6 year battle with the disease; and my dad passed away from lung cancer when he was 44 and my step-mom passed away from uterine cancer when she was 42. I am 42 years old and have 2 daughters (ages 9 and 6) and basically their sole caregiver as their dad suffered a severe brain injury in 2006 (right after birth of ydd). Does anyone know if there is any possible connection between elevated bilirubin levels, inflamed thyroid, and hematuria and bc? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790037",
      "Title": "waiting for follow-up mammogram for microcalcifications bieque bieque"
    },
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "Jul 13, 2012 09:36AM bieque wrote: Just had my diagnostic mamm. and was frustrated to learn that the radiologist is not located on site.  The tech sends the images to him (he's in another state) and he calls to let her know if he wants any more pics.  She took 3 pics of my rb.  I had to wait an hour for him to call her back. Then she came out and said that I could go (radiologist felt the pics taken were all he needed) and that the radiologist would send the reports to my doctor who would then notify me within 5 days of the results. She said that she could not comment on the pics as she is only a tech. So, now I wait again.   Good?  Bad?  I have no idea.",
      "MessageIndex": 9,
      "PostDate": "13/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790037",
      "Title": "waiting for follow-up mammogram for microcalcifications bieque bieque"
    },
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "Jul 19, 2012 09:03AM bieque wrote: The bs called this morning and wants me to come in Monday morning for the biopsy.  Said that I need to be there at 11:30 but the biopsy won't actually happen until 3pm.  I was rushed getting my daughter off to camp, so didn't think to ask.....what do they do all that time prior to the actual biopsy? MRI on Friday....things are moving kind of quickly now.",
      "MessageIndex": 6,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790735",
      "Title": "pleomorphic calcifications? bieque JamieB86"
    },
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "Jul 23, 2012 06:53AM bieque wrote: Appointment with the breast surgeon today and am feeling nervous.  The breast surgeon is affiliated with a hospital, but the office is in a suite of the hospital.  They actually called back to say that they're not sure if the biopsy will happen today or not....depends on which type of biopsy needs to be done (they haven't yet seen the films from the radiologist....I'll bring them with me today).  They scheduled the appointment based on the radiologist report and my doctor's office referral. The lump on my neck has gone from a pea size to a marble size since last week and the lump on my chest (starts at top of sternum and is about the size of a walnut) has become quite pronounced...my daughter asked me about it in the pool yesterday. Do you think they'll biopsy them or do some sort of other scan or just wait till the biopsy results come in for the rb?",
      "MessageIndex": 8,
      "PostDate": "23/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790735",
      "Title": "pleomorphic calcifications? bieque JamieB86"
    },
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "Jul 23, 2012 06:02PM bieque wrote: Appointment went well.   They did a stereotactic biopsy and she reassured me beforehand that majority come back benign.....her overall demeanor was very reassuring.  She said she would contact me on Thursday with the results.  The test wasn't too bad....worst part was the awkward position of my neck and the initial prick of the numbing medication. As for the other lumps, she said that she wanted to wait and get the results back from this biopsy before worrying about the others as they could just be a thyroid nodule in my neck and a lipoma in my chest. Sure hope I'm in the 80% benign category!!",
      "MessageIndex": 10,
      "PostDate": "23/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790735",
      "Title": "pleomorphic calcifications? bieque JamieB86"
    },
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "bieque wrote: I'm feeling a bit sick to my stomach....I have been awaiting results of my diagnostic mammo.  My doctor has not yet called me, but I went on the patient portal for my doctor's office and found out that she has written a referral for me to see a breast surgeon for pleomorphic calcifications....it was dated 7/17/12....why hasn't she called me??? What does this mean?????  I'm feeling pretty scared right now as my mom passed away from breast cancer in 2008 and had been battling it for a total of 8 years (she had a primary and then a 2nd primary a few years later). Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790735",
      "Title": "pleomorphic calcifications? bieque JamieB86"
    },
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "Jul 18, 2012 11:01AM bieque wrote: ok...after going out and mowing the lawn (my own form of therapy when stressed), I'm definately a lot calmer and thinking more rationally.  I appreciate you giving me the definition of pleomorphic....guess i went to the wrong site as it stated that it meant it was most likely malignant....darn doctor Google. I'm ready to call her now and find out more information.",
      "MessageIndex": 2,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790735",
      "Title": "pleomorphic calcifications? bieque JamieB86"
    },
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "Jul 18, 2012 05:59PM bieque wrote: Well, went in to talk about the results and also to show her my new lumps (swollen node under left armpit and lump on right side of chest about a finger below the collarbone) that I found yesterday. She told me that the radiologist had found 2 clusters of pleomorphic calcifications in the upper right quadrant of my right breast (maybe 11 o'clock).  The first cluster appeared to be 1.5 in size and the second one measured at a little over 2 in size. She handed me the referral to the breast surgeon and told me that they would be doing a biopsy (probably stereo) and that she'd like me to try and get in next week. She also said that my recent labwork had come back with elevated bilirubin levels (same as in June) and that I'm still showing blood in my urine (same as in June) so she ordered an MRI of my abdominal area to see if there's something going on there....that will be on Friday. So, guess I'm still in waiting mode......",
      "MessageIndex": 4,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790735",
      "Title": "pleomorphic calcifications? bieque JamieB86"
    },
    {
      "AuthorID": "bieque",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155510/profile",
      "Content": "Jul 25, 2012 02:09PM bieque wrote: So grateful to hear that everything is benign!!! Thank you so much for your support and information throughout this ordeal. You will remain in my thoughts!",
      "MessageIndex": 12,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/790735",
      "Title": "pleomorphic calcifications? bieque JamieB86"
    }
  ]
}