{
  "AuthorID": "BigDBeating…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
  "Posts": [
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Feb 19, 2014 09:58AM BigDBeatingBigC wrote: Congrats, Lana!  I am jumping into that pocket as well, if you don't mind.  I am still WAITING for genetic testing results, was hoping to have them today, but Bracha did not come back yet; and my MO very embarrassed told me my Oncotype was not ordered!  So now I have to wait two weeks for the Onco results -- Bracha could come in anytime, then we will know where I stand finally!  Starting Femara tomorrow!  Hugs to you all!",
      "MessageIndex": 1076,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Feb 19, 2014 02:32PM BigDBeatingBigC wrote: Lizzie, good luck with your treatment, I am very interested to learn how it goes for you with the short, intense protocol. And you as well, sbp.  Any SE's yet with Letrozole?? algranna, I am starting Letrozole tomorrow.  I am still waiting for Oncotype and Bracha test results to determine what additional treatment I will be getting, but rads will be a part of it unless the Bracha test is positive as I guess I would probably go with additional surgery :( -- we will see.  Good luck with your treatments. Let me know how you are getting along with Letrozole.  I will do the same. Red, wishing all the best for you as well.  Much congratulations Mimi, Peaches, Gubby, and RIsteadman!  Celebrate, ladies! Have a beautiful and restful sleep my sisters.",
      "MessageIndex": 1083,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Feb 26, 2014 09:23PM BigDBeatingBigC wrote: Red, I am in agreement on taking off the Friday if you can.  During this time when you need the extra rest, do not hesitate to do what is best for YOU.  You are doing a lot!  My goodness, working pretty much full time and cooking, taking care of your family.  That is a lot to ask of your body right now on top of the rads.  I say just do it.  And whine all you like, we all do it and we all need to now and then.  Nothing in the world wrong with that!",
      "MessageIndex": 1208,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Feb 26, 2014 05:51PM BigDBeatingBigC wrote: Kiwilady:  Glad you made that decision.  I am still waiting for my Oncotype results.  If I am in the middle, as much as I do not want chemo, I am sure I would probably take it.  Good luck to you and please keep us posted on how you are feeling during your treatments.  I wish minimal SE's for you!  Edwards, I am post-menopause and have just started taking Femara and was told I should stay on it for 10 years as well.  All my MO said was he used to recommend 5 years of hormone treatment, now he wants his patients on the hormones for 10 years.  It is a long time but if it keeps me disease free, so be it.  Who knows, hopefully they will come up with something in the next years that will be easier on all of us.  I sure hope so!",
      "MessageIndex": 225,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Mar 23, 2014 12:13PM BigDBeatingBigC wrote: I am sorry you had to deal with that Lojo.  The important thing is to never take no for an answer and to get help with the appeal.  I have had to fight insurance companies in the past and most of the time they will reverse it.  But I never do it myself.  I get a third-party involved, whether it is the doctor or the dentist, or the company who administers our health plan.  It is worth the time and effort.  I am glad your test was paid for.",
      "MessageIndex": 293,
      "PostDate": "23/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Mar 23, 2014 01:44PM BigDBeatingBigC wrote: I am taking a guess here, rette, and someone else may know the right answer, but I think because of the size of the area, whether it be tumor or whatever, there must be a cut-off in the insurance company's determination of whether the test should be administered.  For example, my MO suggested that we absolutely do the test because my tumor size was 2.2 and there was an area of DCIS next to it.  Where I am treated they generally cut off the determination of whether or not you should have chemo at 2 cm's.  Just to be on the safe side.  My grade was low, but the onco test result was the determining factor of whether or not I should have the chemo.  Both the MO and RO felt the result would probably be low based on the path report, but they also said it was just a guess on their part and the score could be high.  I did not want to always wonder if I had made the right decision to not have the chemo so I insisted on having the test done.  When the score came back as 12, we all knew that chemo would be of no benefit to me.  I can tell you that even if I had had to pay for that test myself, it was worth having it done for peace of mind.  If I had had a tumor size of 4 cm, my doctors would have insisted on chemo no matter what.",
      "MessageIndex": 295,
      "PostDate": "23/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Feb 12, 2014 09:52PM BigDBeatingBigC wrote: Wish I could advise you, Daylek.  I am still waiting for my results, I get them on the 18th.  Landing in the middle is hard, but you are right on that border.  I would be doing what you are doing.  Did your MO give you any advice or did he or she just say it is up to you?  Which of course, it is up to you, I am just curious as to if advice was offered from your doctor.",
      "MessageIndex": 192,
      "PostDate": "12/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Feb 8, 2014 01:43PM BigDBeatingBigC wrote: I am sure it was very tough, Red.  I am still waiting for the results of my onco.  I will have them on Feb. 18, along with results of the Bracha and bone scan.  It has been a very very long couple of months from when I was first diagnosed.  But finally, on the 18th I will know exactly what I am facing.  Not sure what my choice will be if I am in the grey area, just have to wait and face that decision when I come to it.  Always a day at a time with a prayer to my God.",
      "MessageIndex": 188,
      "PostDate": "08/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Feb 21, 2014 01:04PM BigDBeatingBigC wrote: Low, low, low!  Will be thinking of you on Monday, Kiwi.",
      "MessageIndex": 214,
      "PostDate": "21/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Mar 1, 2014 10:18AM BigDBeatingBigC wrote: Yep, Diane, I hear ya, always better than the alternative.  I do not like taking meds in general, but in this case I will take it.  Every doctor is different just like every patient is different.  My MO used to prescribe the hormones for five years, now he has upped it to 10.  He said it just lowers the risk of recurrence.  My MO is the definition of \"scientist.\"  We have had discussions about certain supplements I take and he says he does believe in most of them.  Why?  He says there is no scientific evidence to support it.  I disagree with him, but enjoy the discussion about how he thinks and feels.  We are each our own most important advocate and we have to do what we know works for us.  I am post-menopausal as well.  Thanks for your words on RAD SEs.  Of course, I am worried about how bad they will be for me.  I am very fair and burn easily, but no matter.  It is something I need to do and have been told not to worry about SEs, that they are much more manageable now than they used to be.  I am having 21 total, a little more condensed and getting more than if I were doing 33.  My RO says I can do that because I am no having chemo.  18 whole and 3 boosts.  Just hoping and praying the fatigue is not too hard, I need to work but of course will take some time if I need to.  I am just grateful to live in an age where we have the options that my DM never had.  And grateful to be able to link up with all of your wonderful women in here, you keep me sane on the days when I am down.  ",
      "MessageIndex": 229,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Mar 1, 2014 11:59AM BigDBeatingBigC wrote: Thanks, Kiwi, and am happy you have your plan in place as well.  We have sort of mirrored each other, with our diagnosis dates being the same, receptors are the same, and we will be going through RADs about the same time too, right?  I feel the same as you right now.  Since 12/17 it has been an emotional rollercoaster, and the waiting for test results was brutal.  Everything the beautiful women in here always said is right, you feel better once the plan is in place.  You know what you have to do, and you dig in and do it.  Whether this piece of sh_t disease comes back one day or not, I am ready for the fight and will give it my best.  It got both of my grandmothers and my mother, but not me.  I have a fighting chance and I intend to enjoy every day I have.  Love you all and sending healing light and energy to you.",
      "MessageIndex": 231,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Mar 2, 2014 10:23PM BigDBeatingBigC wrote: Thank you so much, flagirl, and I wish you a low onc score as well.  The 33 treatments make sense as your bc was on the left side.  Mine is on the right.  I have read a lot of info on here about different creams.  I will see what my RO give me.  Like you, I am ready to get going with this and get it done.  Let us know what you find out this week.  I will be praying for you.",
      "MessageIndex": 233,
      "PostDate": "02/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Feb 12, 2014 10:52PM BigDBeatingBigC wrote: I am right there with you, Kiwi!  I don't think I will ever forget how terribly long these last couple of months have been.  No matter how horrible the news could be, at least I would know!  Never realized how difficult this would be.  Thank God there is this place.  If I were going through this 20 years ago, with no internet, well, let's just say happy we have each other in here.  I am praying you get good results, Kiwi. ",
      "MessageIndex": 194,
      "PostDate": "12/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Mar 1, 2014 06:02AM BigDBeatingBigC wrote: Wanted to share my Oncotype results which I received late yesterday afternoon.  12!!!! So, no chemo, would not help my chances any and now on to rads.  My MO gave me a 16% chance of survival over the next ten years without hormone treatment.  If I remain on the Femara, which I intend to, the odds are literally cut in half, to 8%.  Bracha also came back normal, so rads here I come!",
      "MessageIndex": 227,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Feb 20, 2014 11:47AM BigDBeatingBigC wrote: I am on Femera and had a bone scan -- have not started rads yet.  The bone scan was done to get a baseline, kind of like when you get your first mammo.  I expect I will have one every year for I do not know how long.  I could be wrong on that, just guessing.  I assume because cells can travel and metastasize (and the bones being in general the first place the cells would travel to), my MO likes to get a bone scan early on to get the all clear and then can compare with the next one, and so on.  I did find out I had arthritis when they did mine.  Congrats on finishing rads!!  That is a huge accomplishment and you sound like you did very well.  Gives me hope!",
      "MessageIndex": 1107,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "BigDBeating…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194053/profile",
      "Content": "Mar 5, 2014 09:28PM BigDBeatingBigC wrote: Thanks, jlow.  I appreciate your input.  Hope I get the same result!",
      "MessageIndex": 237,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    }
  ]
}