{
  "AuthorID": "bigdogmom2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101958/profile",
  "Posts": [
    {
      "AuthorID": "bigdogmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101958/profile",
      "Content": "Sep 2, 2011 09:19PM bigdogmom2 wrote: Wow!  I knew I could count on you ladies!  I'm so sorry you all are or were in pain also.   From your descriptions it all sounds so similar.  Thank you so much for responding.  Mycinn:  My general doc did mention physical therapy as one of the options, but said it depends on what my PS says after he looks me over... I am really hoping to go this route.  Going to check out that thread for sure, thanks for the heads up.  I'm very curious about the nerve damage!  Is there anything they can do for that?  There is a noticable difference in type of pain? Glad it sounds like you have a great team and are moving in the right direction. Delilah:  Uggg torn muscles.  Now that sounds scary and painful.  I see what you are saying about sitting on the rib cage feeling, especially if I lean forward kind of hunched over.  Now when the PS whet back in to do the surgery to repair and rebuild do they go through your original scar or is this a different incision?  So sorry you are still having issues with the nodes and have a leak too!  J9W:  I now have another question to have answered!  Never even thought about how far down they cut...I am going to ask my PS when I see him.  Yes, I thought for sure a broken or bruised rib!  It seemed to come on so fast.  I was swimming the day before and thought maybe I pulled something but now I am really leaning toward scar tissue! DFC:  I had the cording originally I was able to break it up.  It was from my armpit to my fingers.  Now I guess it's not so much a cord that I have but that same area gets achy and sometimes a tad swollen.  Does that make sense?  It seems tight but not with the actual cord popping out ewwww... I could not imagine having cording on both arms, I'm so sorry!  I couldn't shave or stretch my arms above my head.  What have they suggested for you? Well it sure does sound like scar tissue, I am really hoping therapy will do it.  She also mentioned something about some non-invasive procedure that breaks it up, I don't recall what the name was for it.  I will keep you all posted on what my PS says, I really respect him and he has always been very understanding and helpful when I have questions or issues.  So I am really hoping he has a great solution!  I just hope this isn't a continual problem and if the scar tissue is going to just keep coming back ;0(  Sorry we are all in pain but thankful for your help! I hope you all have a great weekend! Cheryl",
      "MessageIndex": 5,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774056",
      "Title": "Could this be scar tissue.?.? bigdogmom2 Delilahbear"
    },
    {
      "AuthorID": "bigdogmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101958/profile",
      "Content": "bigdogmom2 wrote: Hi all!  Wondering if anyone else has experienced this.  I had my exchange surgery done November 2010.  All has been great since then, I do get some occasional issues from cording that I got after my BMX but it usually goes away with stretching and massage, something I have learned to deal with.   Well approx. 4 weeks ago I started getting some pretty nasty rib pain, thought maybe I bruised a rib or pulled a muscle.  So fast forward to today and it has not gotten any better.  The pain is right where the wire on your bra hits and a bit below that area, tender to the touch and is extremely painful when lying flat on my back and then even worse when I attempt to get up from a position like into a sit-up.  I went to my general doc and she had me lay flat on my back and put pressure just below my ribs and I felt a terrible pulling feeling.  She thinks it may be scar tissue and suggested I call my PS.  I have an appt. with my PS but I thought in the meantime I would ask the wise women on here. It is extremely painful, feels like a broken rib (if you have ever had one owwiee)   When I do a motion like with a vacuum the push pull yikes!  Sadly this has meant my DH has had to take that job on over the past month!  One perk ;0)  So just wondering if any of you all have had anything like this and if so what did they do?  My general doc said there are many things to be done, including surgery which she said she didn't recommend because my PS did a fantastic job and she wouldn't mess with it lol :0)  Boy did that make me blush and feel very good since she is the only other to see them besides DH and surgeons! Thanks for any input, hope you are all having a great week! Cheryl Dx 3/5/2010, DCIS, Grade 3, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774056",
      "Title": "Could this be scar tissue.?.? bigdogmom2 Delilahbear"
    },
    {
      "AuthorID": "bigdogmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101958/profile",
      "Content": "Sep 27, 2011 10:16AM bigdogmom2 wrote: LtotheK stated \"I really take offense at DCIS patients talking about their pre-cancer as similar to my situation.  For starters, only invasive cancers/grade 3 have to have sentinel node biopsy.  I don't have lymphedema (edited to add: \"yet: a lifelong threat it is\"), but just that alone changed my life forever (I work with my hands).\" This is a public space, and we have more responsibility to correct (or as best as we can get) information than to one another.  It's nice when the latter happens, the former is for all the women who come in front of us desperate for information.\" LtotheK ~ I personally find your posts offensive.  I kept telling myself to just zip it, but I feel I need to clear up some \"misinformation\" in your posts.  I was required to have a sentinel node biopsy for \"just\" a DCIS \"pre-cancer\" diagnosis and I was one of the ones who got lymphedema from \"just\" a sentinel node biopsy.  So just to clarify certain things can happen even at my stage; so as you said no-one is in the same boat even at different stages, fortunately for some their treatments work with their body and unfortunately for others those same treatments don't work.  That's why I think sensitivity and respect should be shown at any stage.  To all the ladies on this forum, my apologies for butting in here.  But my panties are really in a bunch!  And I felt the need to clarify some misinformation by the above mentioned post.  I have been following English Majors blog for quite a while (which led me to this post) along with a bunch of other women on this forum to gain more insight on advocating for more research for MBC and less on the awareness fluff (although recently with all these public figures spewing misinformation it has been frustrating).  As a side note I must say thank you to all of you that have taught someone like me so much about this horrible disease and I just feel that as a person with breast cancer at any stage it is our obligation to put MBC and research in the forefront! Thank you and again my apologies for intruding... Cheryl",
      "MessageIndex": 56,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774921",
      "Title": "NYT Notes Andrea Mitchell's BC controversy EnglishMajor EnglishMajor"
    },
    {
      "AuthorID": "bigdogmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101958/profile",
      "Content": "Sep 30, 2010 04:39PM bigdogmom2 wrote: Lowrider, no need for apologies!  You said something on a DCIS post that touched me and helped me to get over a certain amount of \"guilt\" that I was feeling and I thank you for that.  I myself feel very appreciative that you and others post on the different threads, your posts have taught me, given me information and lead me to places to do my research.  Now that I have been touched by BC personally I feel an obligation to learn more about every stage.  It goes so much deeper than getting my friends to go for their mammograms, and you have educated me with your story and your informative posts.  Who better to learn from than those of you going through the fight.  You all are up to date on research, treatments and trials and where money should go.   My only hope is that I can do you all justice by educating others that breast cancer continues to take loving mothers, wife's, sisters, daughters and friends, from us and it will continue to do so until a cure is found.   I have to admit before I was diagnosed and came to this site I was naive and thought buying toilet paper with a pink ribbon on it was really contributing... ;0) So hopefully by you and through me something will be gained from it, I will take your words, use them, and make them count!  Anyhow, I just wanted to say thank you from 1 person you touched and hopefully I can thank you by educating others!  Bless your heart :0) Cheryl",
      "MessageIndex": 12,
      "PostDate": "30/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758695",
      "Title": "An Apology with a Twist.... Lowrider54 debbie6122"
    },
    {
      "AuthorID": "bigdogmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101958/profile",
      "Content": "Sep 10, 2010 10:50AM bigdogmom2 wrote: Thanks so much everybody!  You all have made me feel much better.  Ice pick HA that sounds very appropriate.  I did talk to my PS today and he said what I am feeling is very normal, some people the pain is worse than others.  He said I have alot of scar tissue and it seems to be breaking up and he said that will cause more pain than normal also.  So my official diagnosis is \"not crazy\" LOL  and told me to call for any reason the pain doesn't make me a wuss and there is no stupid question ;0)  Good to know!  I was just so bummed it seemed all was going so well just alittle sore after a fill no biggie, shoot the fill before this one I went jet skiing the same day!   And then WOW that last one just really set me back mentally because of all the pain.  I am feeling better today sore but bearable.  Jeanne, I too am envious to all the exchange girls.  I am really looking forward to that surgery (never thought I would say that).  Hope your rads go well.  Time will fly by and your exchange surgery will be here before you know it :0)  Wow Robin, 1 1/2 hours!  If they are going to make you wait that long I would suggest they get recliners for their patients!!   Orchidgal, I had the cording also, funny I called it a guitar string!  That was awful.  I think seeing it pop out from my skin when I stretched my arm freaked me out more than anything.  It went from my underarm to the top of my hand.  My PS suggested lots of stretching sooooo I went to the batting cages and hit softballs LOL  It worked, it ended up breaking up the next day!  Thank you all so much the support here really is amazing :0)  Glad to get to know you all. Cheryl :0)",
      "MessageIndex": 1074,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "bigdogmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101958/profile",
      "Content": "Sep 27, 2010 05:43PM bigdogmom2 wrote: I have to say personally I find it sad that us DCIS people are looked at like we should just get over it and people don't understand where we are coming from, you are \"cured\" and thank god you didn't have to do chemo etc... In all honesty I caught myself saying this to people when they would call and tell me they are \"thinking of me\" and \"I'm so sorry you have BC\" etc... I would respond, \"Ohh I'm great they caught it as early as possible\" or \"Hey if you were to get breast cancer this would be the one you want\" WTF was I thinking!!!  Now with tests completed, the waiting for results over, the decision of what to do made, 1st surgery done and TE's in, I am horrified by what I said in the beginning of this journey.  How could I disrespect so many women with cancer at any level? You see I feel I have handled this pretty well (so I tell myself ;0), I don't complain much, never wanted help (although my husband insisted on it when he couldn't be there to help), went back to work quickly, mentally I feel strong.  But I have my moments when I think wow I'm 39 and had my boobs cut off... was that the right decision should I have just done a lumpectomy should I have had rads... and if you look at the after surgery section, I do complain that my TE's are causing me horrible pain.  I did feel guilty at first to post such a wussy post about pain from TE's when so many others were higher stages and going through chemo at the same time.  But I have to say I have received some very nice and encouraging responses from people at every level and am forever grateful. I am one of those people that wants to throw everything at it kinda overkill if you will.  It may sound crazy to anybody that has had chemo or rads but there was a time when going through this that I wished I could have chemo or rads on top of the DMast, just to make sure they got everything.  I thought well if you can get so many different suggestions of treatment for the same diagnosis how do I know for sure that it won't come back or something hasn't escaped and is in there somewhere.  I like to think of myself as a rationale person but I can tell you DCIS or any other stage of cancer that feeling will NEVER go away, that coming from a person with \"just\" stage 0.  The fears are there, I don't feel comfortable being told you never have to do another Mammogram again, that doesn't make me feel better... I want to be sure it isn't there, I want people to test me and poke and prod just to make sure and if it is I want it caught early AGAIN.  This is my new me; I now worry, this is MY new life, something I never had before cancer so that is something we all have in common; unfortunately.  I by no means mean this post to offend.  I too as a person with stage 0 thought as you did at one time.  Suck it up and get it over with and you will never have to worry or complain about this disease again.  I got a good slap in the face of reality, no matter what stage we are all scared, it never goes away and it is HARD!  Every complaint no matter how big or how small is a valid complaint :0) I sat on this post for a while and wondered if it was my place to voice my opinion.  But then I realized I do have cancer and I can give you the perspective of a person with a much lesser stage than you.  I no longer feel guilty for being \"just\" stage 0. Cheers to you all!  Much happiness and good health in your futures :0) Cheryl xo",
      "MessageIndex": 24,
      "PostDate": "27/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/758051",
      "Title": "Taboo subject mollynminnie mom3band1g"
    },
    {
      "AuthorID": "bigdogmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101958/profile",
      "Content": "Sep 23, 2010 08:09PM bigdogmom2 wrote: Getty, Happy Birthday :0) and Congrats on the surgery date Laurie!! Stephanie, I noticed the moon last night... You may be right on about that one!  It was quite gorgeous though. Thanks for the well wishes and unfortunately Robin as suspected I'm back to the pain in the boobs.  But I am getting closer to the rock removal :0)  We are thinking one more fill to over fill them and then we can schedule surgery.  I have alot of scar tissue underneath these babies he said that he will get rid of (clean up....) all that when he does the exchange.  But he is very happy with the skin on top and the placement of the expanders.  So I will concentrate on that positive news. I am supposed to be doing a 30 mile bike ride this weekend, so hopefully the pain will subside a bit before then.  It is just a flat easy ride downtown so we shall see :0)  Not sure how safe riding a bike on pain meds is...  Thanks again and I hope you all are having a great day!! Cheryl",
      "MessageIndex": 1112,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "bigdogmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101958/profile",
      "Content": "Sep 22, 2010 03:57PM bigdogmom2 wrote: Hey there, just checking in on you all :0)  It's great to see some of you already post exchange and now more dates popping up for exchange.  Gives me hope these things will be yanked out soon!  Getty, thanks for the info on your exchange that is encouraging sounds like you are doing well!!! Some of you sound down and I'm sorry I hope things start to look brighter very soon for you all :0) I am going this afternoon for another fill so I will probably be down in the dumps soon too.  I just started feeling better this Sunday!  Now that I've had a couple days of no pain and easy breathing I head back again today!  I am hoping there will only be one more fill after this and I too can start looking forward to an exchange date!  I'm going into my fill today feelin positive and hoping it doesn't go like the last one, ohhhhh and I'm also including a muscle relaxer and pain med cocktail too!  I will keep you all posted. Have a great afternoon everybody :0)  And thanks again for keeping my spirts up!! Cheryl",
      "MessageIndex": 1106,
      "PostDate": "22/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "bigdogmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101958/profile",
      "Content": "Sep 9, 2010 08:53AM bigdogmom2 wrote:  Hi, I hope you all don't mind me posting here.  I had my bilat mast on May 25th (not many people post on the May thread).  Well I have been keeping up on your thread because I was later in the month.  I just saw a post on here about pain getting worse after fills.  My last two fills have been horrible!  I have had I think 7 fills now and am at about 550 cc.  I am a tad bigger than what I started with and we are planning on 2 more fills.  My fill amount has varied depending on my pain levels and how I did on the previous fill so some are around 50cc and some are about 75cc.  My last fill yesterday really has me freaking out.  I am in so much pain I pretty much feel like I did 3 days out from surgery!  I feel like someone is putting a knife in my back and breathing hurts, like my ribs are sore.  I am back to not standing straight, sleeping upright... uggg  I know my PS told me the fills toward the end would be more painful but WOW I have to say I am a bit shocked at how much pain I am in.  I too am back to my pain meds, sleep would have been impossible last night and work today, forget it!  There haven't been many posts that I have seen on having pain with the TE's fills, so when I saw a few of you post about it, you all made me feel better today.  I'm not as crazy as I thought LOL Erggghh, this turned into more of a poor me post... not meant to be, sorry!  Just wanted to say I hope you all start to feel better soon too!  I'm sorry for your pain but so glad I'm not alone, I was starting to feel like these TE's should be a cake walk and I was being a big baby ;0) Hugs :0)",
      "MessageIndex": 1068,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "bigdogmom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101958/profile",
      "Content": "Jun 30, 2010 07:28AM bigdogmom2 wrote: I was very worried about the drains.  I am the one that got the apron at Lowe's, well that credit actually should go to hubby and son they came up with the genius idea :0)  It was $2.00 just the small one that goes around your waist.  You can tuck the drains and tubing in the pockets and just wear longer shirts to cover the apron or tell people you work at Lowe's!!  It was great for changing clothes too just keep the apron on and change clothes.  I never pulled on the tubing and no pinning!  Hopefully you won't have to have them for too long.  But this should make it much easier :0)",
      "MessageIndex": 17,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754382",
      "Title": "Drains Scrabblelady bigdogmom2"
    }
  ]
}