{
  "AuthorID": "bigred1984",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160702/profile",
  "Posts": [
    {
      "AuthorID": "bigred1984",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160702/profile",
      "Content": "bigred1984 wrote: I went to my general doctor and she could easily find my lump.   it is small round firm and not very mobile.  She thinks it is probably a fibroadenoma she wants me to come back in 3 weeks to check on it again.  At that point if it stays the same we can either watch it or I can get reffered for a mammo.   What do you think is a good idea.  Should I insist on a mammo?  My doc says that breasts make lumps and that it isn't out of the ordinary for them to come and go.  I trust her opinion but I don't want to make a mistake. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793785",
      "Title": "to get a mammogram or wait?? Advice? bigred1984 bigred1984"
    },
    {
      "AuthorID": "bigred1984",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160702/profile",
      "Content": "Sep 24, 2012 06:06PM bigred1984 wrote: thank you for your reply, I am 28, and I found the lump a little over a week ago.  I have 5 week menstral cycles so I am not due for another 2 weeks.  It is difficult but I have not touched my breast since my appt. wednesday.  I took a trip to visit my family over the weekend and it took my mind of things.  I am hoping the lump just dissappears!",
      "MessageIndex": 2,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793785",
      "Title": "to get a mammogram or wait?? Advice? bigred1984 bigred1984"
    },
    {
      "AuthorID": "bigred1984",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160702/profile",
      "Content": "Sep 19, 2012 06:20AM bigred1984 wrote: I am praying for you momma!  I am 28, a momma and also just found a lump... Round hardish and immobile.  Keep us posted. ",
      "MessageIndex": 3,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793725",
      "Title": "Worried 27 year old mother! What did your lump feel like? AJS715 Letlet"
    },
    {
      "AuthorID": "bigred1984",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160702/profile",
      "Content": "Sep 18, 2012 04:30PM bigred1984 wrote: Tomorrow is my appointment, and I am feeling quite nervous.  My lump feels ominous to me like a bb in a bowl of pudding that is sightly curdled.  Even if it is benign I know that my doc will require a mammo and then there is the possibility of biopsy.  So there will be a stressful week or two coming up. I assume that I have a lot of xenoestrogen exposure from my 12 composite dental fillings.  I have heard that bpa/bis gma can increase bc risk.  I just feel doomed.  like I did right before my last cancer diagnosis.  I worry that I am one of those genetically broken people who will just keep getting cancers until they expire. I know how it goes on cancer forums, you get a lot of scared folks who end up not having cancer.  As a melanoma survivor I see this frequently on our forums.  I pray that I am one of those people, scared shitless for a week or two than elated, given a new lease on life.",
      "MessageIndex": 3,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793675",
      "Title": "I found a lump and I'm scared! bigred1984 bigred1984"
    },
    {
      "AuthorID": "bigred1984",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160702/profile",
      "Content": "bigred1984 wrote: Greetings, I am a 28 year old wife and mother of one amazing 2 year old.  Who I am still nursing BTW.  I never do self checks but I felt like my right breast felt heavier than my left so I felt around and I found a bb sized lump in the flesh under my nipple area.  It's firm and round but not mobile or painful.  I have these wonderful tiny breasts that are like little bags of smooth pudding.  So it was quite alarming to find a tapioca in my pudding. Its strange my right breast has more thick tissue than the left.  Like a squishy soft irregular movable mat.  The left breast is smooth.  I have an appt with my primary care doctor on wednesday, she is very through so I expect she will order a mammo even if she suspects its benign.  I'm not sure what I'm asking I just needed to vent because I am freaked out.  I was diagnosed with melanoma 6 months ago so this would be my second cancer this year.  However the mel was in-situ so I am not undergoing any treatment for it.  Can you have a firm round lump that doesn't move but isn't cancer?  Does the presence of thicker but still squishy tissue around the lump mean ominous things? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793675",
      "Title": "I found a lump and I'm scared! bigred1984 bigred1984"
    },
    {
      "AuthorID": "bigred1984",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160702/profile",
      "Content": "Sep 17, 2012 06:46PM - edited Sep 17, 2012 06:48PM by bigred1984 thank you bessie for your quick reply.  I am trying to keep a calm head.  This finding something weird, going to the doctor, getting a biospy, then bad news....has become all to familair to me with my recent melanoma diagnosis.  I hope you are correct about the nursing thing, I heard there are such things as milk cysts.  I do not have much breast cancer in my family, but I have a lot of colon and melanoma.  The only BC is my sweet great aunt Doris, who died at 91, she had breast cancer toward the end but refused treatment, she died in her sleep before it caused her pain.  yuck, everything I type is depressing.  Just read the website, it gives me a lot of hope.  Thank you again.",
      "MessageIndex": 2,
      "PostDate": "17/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793675",
      "Title": "I found a lump and I'm scared! bigred1984 bigred1984"
    }
  ]
}