{
  "AuthorID": "billsgirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
  "Posts": [
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jun 12, 2008 06:49AM billsgirl wrote:",
      "MessageIndex": 2,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707160",
      "Title": "Ever hear of cankles? billsgirl crapshoot"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "billsgirl wrote: My son said they're \"cankles\"...calves which just continue to your feet, bypassing any identifiable ankles (which are too swollen to see). Whatever you call them - I hate 'em. I finished my last of 8 treatments 3 weeks ago (4xAC, 4xTaxotere) and got through relatively unscathed. Now three weeks later, my ankles and legs feel terrible. Heavy and achy. Fluid retention which comes and goes (so it's not a clot) but I don't know how to treat it. My onc and surgeon say be patient, drink lots of fluid, walk. I've been doing all of this (except maybe the \"be patient\" part) but it comes back.I've learned so many wonderful tricks, secrets and simple ideas from the ladies on this site, I thought I'd ask. Any ideas? How do you relieve your fluid retention? Have you gone through the same thing? Am I experiencing the \"norm\" of post-chemo life? Thanks for anything you can offer. I hate cankles! Dx 10/9/2007, ILC, 2cm, Stage I, Grade 2, 0/16 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707160",
      "Title": "Ever hear of cankles? billsgirl crapshoot"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jun 28, 2008 03:32PM billsgirl wrote: After axilarry node dissection on my right side and bilateral mast, I followed up with 4 x A/C dose dense and then 4 x taxotere with no port using only my left arm. I never had a problem and my chemo nurses were great with varying location of needle pricks. I have been told I have some scarring but that didn't seem to bother the techs/doctors at UCLA when they had to do bloodwork and anesthesia for my exchange. My onc told me ports are considered for older (I'm 45) or less healthy patients. He suggested I try without and if things didn't work, he would put the port in later. Never needed it and glad to have averted an unnecessary surgery. ",
      "MessageIndex": 8,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708217",
      "Title": "Has anyone completed A/C tx successfully WITHOUT a port? deecsw MissUniverse"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jan 9, 2008 05:16PM billsgirl wrote: Hi Jan Jewels, I don't have a whole lot to add about myself, but I do check in regularly to see how you ladies are doing and appreciate all that you share. I'm feeling pretty calm about Friday and hope that I can keep those nasty se at bay. Picked up my wig today - love it. If I feel up to it, I will go to the Look Good, Feel Good clinic Monday. Can't wait to see the makeup :)",
      "MessageIndex": 437,
      "PostDate": "09/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jan 10, 2008 10:37AM billsgirl wrote: Amy, I start tomorrow too but I'm trying to stay busy and keep the jitters at bay. Although I say I'm fine, I know I've been a bit snappy with dh and family. I'm sure after tomorrow (which means one down, only seven to go!) we'll feel somewhat more prepared. It's so hard not knowing what to expect, with everyone's experience differing. I went out and bought everything I read about - biotene, baking soda, popsicles etc! Crazy, I'm sure, but I was just thinking I'd rather have it in the middle of the night than not. I'd be so happy to share   Even though I don't contribute often, I do check in everyday, once or twice, to check on everyone. You ladies are amazing, keeping everyone straight and remembering who's doing what. My brain seems too foggy and I haven't even started yet! Thanks for being there.",
      "MessageIndex": 448,
      "PostDate": "10/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jan 12, 2008 11:41AM billsgirl wrote: Oh, and I forgot the best news...my BRACA came back negative. Yea! I don't have daughters or sisters, but I was concerned about my ovaries. Please, NO more surgeries for awhile. (well, except for my implant exchange, which I'm rather looking forward to  ) Thanks for listening.",
      "MessageIndex": 488,
      "PostDate": "12/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jan 6, 2008 08:54PM billsgirl wrote: Starting 1/11, A/C every 2 weeks x 4, then T - not sure of that schedule - x 4. I'm a bit anxious about Friday so I'd love to hear how all the ladies did last week through til now. Early this week, I plan to pack my chemo bag,med cabinet and kitchen pantry with all the suggestions I've read about here. I have read countless numbers of articles to prepare myself, and I didn't get half as much from them as I did from you and these discussion boards. Thanks!",
      "MessageIndex": 354,
      "PostDate": "06/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jan 26, 2008 04:33PM billsgirl wrote: Carol, I thought it was something I did to reset the page. If anyone knows how to get the posts back to fitting the page, please post for me too. Loved the pictures, Julie K. I'm getting ready for my buzz. Hope I can be as brave as you all looked in your pics",
      "MessageIndex": 870,
      "PostDate": "26/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jan 6, 2008 05:58PM billsgirl wrote: Hi Ladies, Count me in. I start 1/11/08 AC/T x 4, dose dense. Although I was more scared of starting chemo than I was of surgery (bilat 12/5, immediate recon with TE) I have since found some peace. Reading these boards has helped immensely - knowing that others have been there, done that. Knowing that some go through it well makes me think \"why not me?\" I'm ready to get started and get it over with! I'm new to posting having just felt comfortable enough to comment. So many of you are so eloquent and informed, I think I was slightlu intimidated about saying the wrong thing or saying it the wrong way. I since have come to nderstand that we are in this together, and what better way to navigate this journey than with a friend who understands first hand. Thank you...",
      "MessageIndex": 349,
      "PostDate": "06/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jan 6, 2008 06:18PM billsgirl wrote: Thanks, Carol. I feel so much better already, just knowing that someone out there knows exactly what I'm feeling. I have the greatest friends and family supporting me, including one fabulaous husband, but the support here is different. I plan to visit daily. Going for my first expander fill tomorrow. Just wondering if anyone doing dose dense also stayed on a regular fill schedule??",
      "MessageIndex": 352,
      "PostDate": "06/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jan 26, 2008 11:07AM billsgirl wrote: God morning (CA time) Day two and all is well so far...keeping my fingers crossed. I slept most of yesterday, fought a bit of a headache and drank so much water I can't stop peeing! Thank you all for posting your beautiful pictures. My hair started falling out in strands yesterday and I didn't even want to shower this morning for fear of what would be left.Not as bad as I thought, but falling out in bigger clumps now. My 16yr old son plans to buzz me tonight or tomorrow. I think he's actually looking forward to it! Vettegal and SISKimberly have inspired me to take some pistures of my own. I sure hope my head and ears are as pretty as yours! I pray that the weekend provides you working girls some rest, and I curse those se! Stay away from us all.",
      "MessageIndex": 859,
      "PostDate": "26/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jan 12, 2008 11:38AM billsgirl wrote: Hi, just wanted to check in. My first tx went remarkably well. Although I'm so sorry about se and troubles some of you are experiencing, I thought it was important to post some encouraging news for anyone reading and anticipating their upcoming treatment. I had a pretty good headache most of the night until I went to bed. I ate my small meals, drank gallons of water (sprouting gills, I think) and slept well too. I took my anti-nausea on schedule, got up TOO many times to pee pink, and woke up this morning rather hungry. Oatmeal and peaches seemed to worked well. Just returned from my neupogen shot. After a brief scare at 3pm yesterday that my insurance denied the claim, I got it all taken care of with a rather stern phonecall to my case manager. Seemed it wasn't denied, still pending. They had only received the request for pre-approval yesterday (and my shot was scheduled for today? I'll have to have a word with my dr.) Anyway, she marked it urgent and it went through at 5pm last night. Whew! Did you hear about Claritin working for bone pain after the shots? Thought that was interesting. So, of course, anticipating anything, I bought it and added it to the stash of other pharms and supplies I've stockpiled for \"just in case.\" Love your stories, D!, about hair loss. I'm a bit anxious about it, but I have my wigs and hats ready. You make me giggle with your stories. Thanks for making it seem bearable. After all we've been through, the lightheartedness is so uplifting. So, I jsut wanted to add my 2 cents. Knock on wood, I feel good :)",
      "MessageIndex": 486,
      "PostDate": "12/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jan 23, 2008 03:54PM billsgirl wrote: Hi Jewels, I'm always listening to you, even if I don't contribute much, I check in everyday. Thank you for your insight and encouragement. It makes it all more tolerable. KathyL: re my periods. I was due Jan 2 and got it today rather unexpectedly. Spotted for a few days, thought that would be it, but it hit me full bore today. No real symptoms, but bleeding pretty good. I, like others that have mentioned it, will be glad for the shutdown. One benefit to all this toxic treatment :) D1 and KathyL: my treatment plan is correct. My expected dates for AC are 1/25, 2/8 and 2/22. Wow, to put it in writing makes it seem like light at the end of the AC tunnel! Not sure whether I will do Taxol weekly. I'll discuss more with onc soon. Although Senekot and Pepcid AC are my newest best friends, I have been really fortunate to suffer few se. Some tired afternoons and one day of pretty good bone pain from Neupogen, but otherwise doing well wih nothing else. Saying my prayers for tx 2 to go the same way, but know from your experiences that I should be ready for anything. I do swear by the hydration. I drank a bottle of water for every hour I was awake the day before tx and the day of. I plan to do the same this time. I do have to see ps for a \"fill-up\" which means making the 3hour drive to UCLA - that should be fun with all the pit stops I'll have to make. Glad it's my girlfriend driving and not dh. He might not be as understanding There are so many of you that I pray for to be strong and resilient and I'm sorry that I can't name you all by name. But know that the Jewels are on my mind as we travel this road together. I have faith in God that he looks after us. Stay strong. My best to all going in for tx this week and I hope to hear good news next time I check in. Just a funny story...My sister in law sent me an email full of warm and kind wishes, and a sugary poem that she asked that I memorize and remember when I was feeling down. I wrote back that I appreciated all that she sent to me, I would memorize the poem and take her advice but that I also had a mantra for when I was feeling less than stellar... FUBC! She got the biggest kick out of it. Thanks for that too",
      "MessageIndex": 753,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "billsgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61089/profile",
      "Content": "Jan 23, 2008 08:58PM billsgirl wrote: Jenny, I drank a gallon of water during the day before my tx1 and a gallon the next day too. I swear hydration is a huge part of it. Take your meds as directed - DON\"T WAIT to feel nauseous. Most importantly, I look forward to the moment I'm finished because that means I'm that much closer to the end. I've only had one tx, the waiting b4 was worse the real thing, and I have felt so much better than I expected. So it's possible to get through it and feel almost normal. It's different for everyone, but I think it's important to know that people do get through it and do OK. If one person can, why not you? Right? Good luck.  I'll be there Friday too and will think of you. Stay strong",
      "MessageIndex": 769,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    }
  ]
}