{
  "AuthorID": "blasu",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185187/profile",
  "Posts": [
    {
      "AuthorID": "blasu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185187/profile",
      "Content": "Jul 30, 2013 09:24PM blasu wrote: I forgot to mention a couple of other side effects - I had neuropathy in both hands and feet.  My nails actually hurt but i didn't lose any of my nails on my fingers.  However, I did lose some of the nails on my toes.  Surprisingly, they have grown back.  But I still have numbness in my fingers and some of my toes.  I was recently diagnosed with Carpal Tunnel and I know that affects the fingers as well as the hands and wrists but my doctor thinks some of the stiffness, swelling and numbness in my fingers might be residual from the chemo. She just started me on Gabapentin (a nerve pain killer) so hopefully that will start working. Also, my skin was extremely dry and it also dried out my eyes so it was hard to wear contacts.  Use plenty of lotion and eye drops.",
      "MessageIndex": 732,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "blasu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185187/profile",
      "Content": "Jul 30, 2013 09:05PM - edited Jul 30, 2013 09:06PM by blasu Mellie239:  I am new to this forum. Wish I had joined one when I went through my chemo.  Anyone on this forum can feel free to email me or ask me any questions.  I took extensive notes - as to what side effects occured when and how I felt, etc.  I was diagnosed with breast cancer in March of 2012.  I had a lump in my right breast and had a mastectomy.  I went through chemo for 6 months - and my last treatment was October 13, 2012. You mentioned that you have decided not to have a port.  I did get one and I was very glad I did.  It did not hurt to have it inserted and it made it so much easier to have my tubes inserted each time I had a treatment.  I only had to put some numbing lotion on it each time about a half hour before treatment to numb the area.  I do recommend that you get one.  It has left a scar but its not very big. Also, the chemo treatments were very uneventful.  I went to MDAnderson at St Lukes in the Woodlands and they were wonderful.  I had a treatment every week for 3 months, then every month for 3 months.  It went by pretty quickly.  I went in and they put me in a room with a recliner, a tv and hooked me up to IVs.  It takes about an hour, although wait time and labs, I was actually there about 2 hours.  I never felt anything going through my body.  It was hard to believe that it feels like nothing's happening, when, in fact, a strong chemical is killing cancer cells.  I was given meds through my IV for nausea so I never experienced vomiting throughout.  I DID, however, have an allergic reaction to my Tamoxifen (I believe it was) in the beginning and I broke out with sores and a rash all over but my oncologist reduced the dose and it went away.  After each treatment, it did knock me out for about 3 days but I continued to work.  Every now and then, I had to take off a day or two. My hair did fall out exactly 2 weeks after my first treatment.  I was out of town doing a trade show when that night my hair started coming out in long strands, not clumps.  It was traumatic but I came prepared.  I brought a scissors and a wig - thank God.  My sister began cutting off all my hair.  I never did shave it.  I had gone to MDAnderson and tried on wigs as soon as I found out so I'd be prepared.  They graciously GAVE me two wigs of my choice.  Good wigs are very expensive so you might check into what resources are available to you.  I had shoulder length hair and my wig was very short.  I got so many compliments on it when I got back to work, I decided when I was through with all this, I wanted to keep that style.  (However, I am now discovering that when your hair grows back, it won't necessarily be the same texture or color as you were used to.)  My hair just started coming back in May, I think.  I'm still wearing my wigs cuz I hate the way my hair is growing back but in 100 degree heat, they're very hot.  Sometimes I wear a hat. The biggest and worst side effect I experienced was the dry mouth (and dry everything) which changed the taste of all foods.  NOTHING tasted the same so I lost my appetite.  The only food that was consistently good and appealing was fruit and I ate lots of that.  No one had ever warned me of this side effect.  It lasted until my last treatment.  When I first began to eat again, and it tasted like I remembered, it was amazing.  But I did lose 15 pounds.  I bought a cookbook that I believe is called \"Cooking While on Chemo\" - it has lots of great receipes and tips.  It will also tell you what to expect.  One day you might crave hot foods, that night you might crave cold foods and the next day could be entirely different.  You might want salty foods one day and sweet the next.  BUT, not only does it not taste good, you might develop canker sores in your mouth, under your tongue.  I had them the entire time so every time I tried to chew, my teeth would hit the sores and it hurt like hell so it was easier just not to eat.  Sometimes I was starving but it was just too painful to eat.  My doctor did give me something called \"Magic Mouthwash\" (true name) and it did coat my mouth and made something taste tolerable for the moment but it didn't last.  The other worst side effect was that I lost all energy.  I have always been an energizer bunny but wow!  It zaps the life out of you.  I slept a lot!  In fact, now, 9 months later I still don't have all my energy back but its getting there. I'll stop here for now but, please, if anyone wants any advice or wants to know the specifics of my cancer and treatment, I would be very glad to share.",
      "MessageIndex": 730,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    }
  ]
}