{
  "AuthorID": "blg",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
  "Posts": [
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Nov 16, 2011 10:21PM blg wrote: I'd been following your posts - so sorry to hear the DX.  Stay positive and take good care.  The people on here are wonderful support :)",
      "MessageIndex": 21,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777564",
      "Title": "Biopsy on Monday - Lot's of Questions QuinnCat blg"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Dec 20, 2011 07:39AM blg wrote: Good luck on Thursday.  Keep us updated and take care.",
      "MessageIndex": 1,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779783",
      "Title": "back and worried snoozles59 cycle-path"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Dec 22, 2011 12:55PM blg wrote: HOORAY!!!!!  Happy for you!",
      "MessageIndex": 23,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779842",
      "Title": "Clean Scans! Merry Christmas to me! sweetbean Ellie1959"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Dec 6, 2011 04:45AM blg wrote: I'm in the central Ohio area and several months ago while reading an article on breast cancer, I noted the names Larry Lilly, William Farrar and Charles Shapiro were mentioned.  I wrote them down on a jot pad in my office thinking \"you never know when you might these names\".  Well, sure enough, I find myself in that scenario.  I don't recall what it specifically said about them or even what newspaper/magazine they were mentioned in, but it must have been something with some weight to it for me to bother writing it down.  Anyway, thought maybe it might provide you with some reassurance that you are indeed seeing a reputable breast surgeon.  Good luck with your appointment and take care. ",
      "MessageIndex": 23,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778967",
      "Title": "Infection, cyst, IBC or ??? LaLa13 bcisnofun"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Dec 7, 2011 10:40AM blg wrote: I'm glad your appointment went well and that you were comfortable with the BS.  Let us know how the results come back. I'm so happy for you that everything is looking good!",
      "MessageIndex": 35,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778967",
      "Title": "Infection, cyst, IBC or ??? LaLa13 bcisnofun"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Mar 19, 2012 12:21PM blg wrote: COngratulations on the good news!",
      "MessageIndex": 25,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782319",
      "Title": "Awaiting Excisional Biopsy LoriBeth blg"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Dec 9, 2011 09:21AM blg wrote: Good luck!",
      "MessageIndex": 3,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779258",
      "Title": "Excisional biopsy on Monday jkp dfb1963"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Nov 19, 2011 05:27AM blg wrote: I was very interested in reading all of your opinions.  I and my Dr. both felt a palpable lump in my left breast.  It didn't show up on the previous mammo nor the diag. mammo which was done after finding it.  That led to an US that showed \"a very dense\" area.  Which led to an MRI that didn't show anything.  That was 6+months ago.  At my annual exam a few weeks ago I discussed it with my Dr and said I wasn't comfortable with the inconclusiveness of the testing.  I'd have been ok with them saying, \"oh, we see it and it's just a (fill in the blank)\".  But that nothing shows up and both I and the Dr feel it...  it concerned me.  He agreed and referred me to a BS.  And the BS felt it too and arranged for an US that day and said if the US detected it this time, he'd go ahead and do a US guided biopsy.   Of course, it wasn't seen.  So I have the option of going back to the BS for a recheck in 3 months or he said he'd do an excisional biopsy now if I wasn't ok with waiting.  He said given the feel of it and that it wasn't detectable on even the MRI led him to not be concerned.  He suggested maybe a stretched ligament (i think that's what he said).  He didn't brush me off in any way and didn't make the option of the exc. biopsy seem silly.  I was leaning towards waiting the 3 months but in reading your posts, I wonder if I shouldn't just get the biospy done now.  I think when I go back in 3months that's what would happen next anyway. I am interested in your thoughts if anyone doesn't mind giving an opinion.  Thanks!",
      "MessageIndex": 8,
      "PostDate": "19/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778215",
      "Title": "How to handle pulpable lumps that don't show up on mammograms dense SarahsMom"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Dec 16, 2011 01:29PM blg wrote: skapaya - I'll be thinking of you!  We're kind of similar - my lump isn't showing up on tests either and am scheduled for excisional biospy on January 9th.  I decided my mind is busy enough with the holidays so this can wait just a little bit.  Enjoy the holidays and take care!",
      "MessageIndex": 45,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Jan 6, 2012 01:16AM blg wrote: What a nice surprise to sign on here and see the nice thoughts - thanks so much!  I've only even mentioned this whole thing to my husband and sister (who lives rather far away) so it's nice to have all of you to \"listen\" to me.  So, had the excisional biopsy this morning and let me just say - how kind of odd.  Not sure what I was expecting though.  I do like the Dr and his staff so that's a non-issue.  I don't know, it just almost made me giggle at one time.  I got the numbing shots and then all of the sudden there were little scissor snips - so many of them.  Like someone was getting bangs very precisely was all I could think of.  Which at that point I had to bite my lip to keep from laughing inappropriately!  And so it went and whatever it is was removed and his \"breast fellow\" (though I shoudl mention she was a lady - HA) felt the removed lump and commented that you could really feel it in the specimin\".  Hmmm.  And then he felt it and concurred that it definitely was good that we'd removed it.  But then commented that he didn't think it looked suspicious.  He would know, right?  But then he also called her over to insert her finger (in what I imagined to be a gaping hole - again, my silly imagination) and they talked about the thickening.  Again, hmmmm.  So though I think that really I have no cause for true concern, I will spend the next few days analyzing every word said.  I suppose that is normal though accomplishes nothing.  I get to remove the dressing tomorrow.  I have no idea what to expect.  I'll be either pleasantly surprised by my dainty little scar or surprising horrified at an ugly red scar. But really, at this moment, I feel much relief just having it gone.  And no longer the internal debate of do I keep with the wait and see approach while watching for changes.  It's been almost a year and clearly it wasn't going away on its own.  Again, thanks for letting me ramble.  This site and those of you sharing your stories have been a Godsend.  Thinking of you all and praying for your health and happiness!",
      "MessageIndex": 101,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Jan 3, 2012 08:34AM blg wrote: @SueJR - thinking of you...  I have a small palpable lump not detected on mammogram, US or MRI - yet everyone (me and all the Dr's) can feel it.  After agreeing to play the \"wait and see\" game, the time is up and a biopsy is scheduled for Thursday.  I know that in all liklihood it's nothing of concern but I've spent a part of every day for the last several months thinking of all the \"what ifs\" - I'm so looking forward to that feeling going away!  Keep us updated.  And good luck!",
      "MessageIndex": 88,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Jan 3, 2012 02:51PM blg wrote: @LynnieC - YAY for you!  and @SueJR - glad you got your appt moved up, that must be a huge relief for you!  Good luck!",
      "MessageIndex": 91,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Jan 12, 2012 01:05PM blg wrote: Got my results a couple days ago from exc. biopsy on the 5th and all is good - it was just a lump of fibrous fatty tissue.  I am curious as to why that didn't show up on any of the prior testing but the fact is that it didn't, so I am glad my Dr and I agreed to get it removed.  They said to leave the steri-strips on for a couple weeks but I can see it's about an almost 2 inch scar.  And still a whole lot of colorful bruising.  All of which will improve with time.  I am happy and relieved with my results and so very grateful to have had this site and all of you keeping me company.  For those of you waiting, good luck!!!",
      "MessageIndex": 117,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Dec 21, 2011 11:27PM blg wrote: lynniec - you are so not alone here.  This site is wonderful.  As far as I know I am perfectly healthy but an upcoming excisional biopsy still weighs heavily on my mind (despite my best efforts).  This site and the people on it let you vent your concerns, feel like you're not the only one \"feeling this way\" and not making you think you're crazy for doing so!  I hope your visit is here is short and that your upcoming tests prove only that you're perfectly fine.  Take care!",
      "MessageIndex": 61,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779435",
      "Title": "NEW: I need a waiting buddy skapaya skapaya"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Jan 6, 2012 04:50PM blg wrote: Had my excisional biopsy Thursday too!  Thanks for sharing your stories.  Praying for your good health!",
      "MessageIndex": 2,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780556",
      "Title": "Core Biopsy Was a Breeze! Renae50 Renae50"
    },
    {
      "AuthorID": "blg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137638/profile",
      "Content": "Dec 2, 2011 09:40AM blg wrote: I completely understand.  I've had a palpable lump for several months now and after a negative US and negative diag mammogram and waiting for 6 months, I was referred to a BS.  Both Dr. agreed, something is there, they both feel it - as do I!  Probably the same as you, he's unable to do a US guided biopsy since it's not showing up on the US.  Mine didn't show up on an MRI also.  So we're going forward with the excisional biopsy.  But not until January (at my request).  Good luck with your surgery.  When is it scheduled for?  I'll be anxious to hear what the results are.  I'm sorry I don't have the reassuring story you're looking for.  But I do have a sympathetic ear.  Take care!",
      "MessageIndex": 4,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778926",
      "Title": "Mammogram and ultrasound negative MariaEP Tenmom"
    }
  ]
}