{
  "AuthorID": "blieuxgirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86211/profile",
  "Posts": [
    {
      "AuthorID": "blieuxgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86211/profile",
      "Content": "blieuxgirl wrote: i am scheduled to have a lumpectomy next week. the doctor said it most likely is benign, but recommended the lumpectomy still as most of his patients usually feel better having questionable tumors removed.  they will do the pathology on it after it is removed. it is solid, but well defined as far as the doctor would say. im terrified.  i cant stop crying. it seems like the course of least resistence to go ahead and have the lump removed.  i dont know if this is the best thing to do, or to just have a biopsy and wait and see. either way, as long as the tumor is in there i will be worried about it.  any advice or insight? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737077",
      "Title": "having lumpectomy not sure of pathology blieuxgirl blieuxgirl"
    },
    {
      "AuthorID": "blieuxgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86211/profile",
      "Content": "Jul 7, 2009 09:19PM blieuxgirl wrote: thank you both. i know i will feel better having it removed.  part of my rationale is that if it turns out to be malignant then at least its out and i can start whatever treatment all the sooner.  plus, i dont want to have to keep \"watching\" it every few months to see if it grows or changes or sprouts wings and flys away.  im just dreading the whole thing. my boyfriend cant be there and i so want to have his hand on mine... anyway... im really scared of the wire guided thing before the surgery. my anxiety is through the roof.  i know it could all be so much worse.  but i still face the possiblility of it being more than just a fibroidadenoma.  i was in such shock when i went in for an anual exam and the gyn said i needed to have a mammogram.  im only 38.  then they call me on the phone and tell me i need to go have an ultra sound because the mamm showed a lump...then the ultra sound recommend further testing...geez...its been two months since all this started and im going insane.  is it cancer? is it nothing? should i start preparing? should i just pretend nothing is wrong? (all rhetorical questions) my head is spinning. and to top it off, i vainly keep worrying what my breast will look like after the lumpectomy.  knowledge may be power but it scares the hell out of me too.  there's a little TMI out there, and oddly, not enough...",
      "MessageIndex": 3,
      "PostDate": "07/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737077",
      "Title": "having lumpectomy not sure of pathology blieuxgirl blieuxgirl"
    },
    {
      "AuthorID": "blieuxgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86211/profile",
      "Content": "Jul 19, 2009 01:10PM - edited Jul 19, 2009 05:47PM by blieuxgirl well, my surgery went well and i feel like a big titty baby now (no pun intended ;-) it was no where near as traumatic as i expected it to be and i am so very relieved that the pathology came back benign. i ended up not having to go through it alone, my boyfriend was there, amazing and supportive, as well as my family and friends.  the wire guide wasnt painful at all, but i did cry when the doctor came in.  the worst part was the wait.  they could have given me the versed much sooner.  now im just really sore and havent taken it easy like i should have. im a bit swollen and very tender, ice packs have been the best help, i didnt even fill the script for the pain meds.  now that its over i would still have it done, for the peace of mind i now have. i thank you all for your input and advice.  god bless you all and good luck to you. ",
      "MessageIndex": 11,
      "PostDate": "19/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737077",
      "Title": "having lumpectomy not sure of pathology blieuxgirl blieuxgirl"
    },
    {
      "AuthorID": "blieuxgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86211/profile",
      "Content": "Jul 11, 2009 09:56AM blieuxgirl wrote: it sounds like ya'll have way more information than i do. i had the doctors office fax me the diagnostic evaluation of the ultrasound and they only sent me a three line copy of the preliminary report, which i already had.  i was hoping to get a more detailed information. i guess they sent the wrong report or thought i wouldnt know the difference.  i will call them back on monday.  its hard to know what questions to ask.  im just so nervous, not knowing exactly what im dealing with.   ",
      "MessageIndex": 10,
      "PostDate": "11/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737077",
      "Title": "having lumpectomy not sure of pathology blieuxgirl blieuxgirl"
    },
    {
      "AuthorID": "blieuxgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86211/profile",
      "Content": "Jul 8, 2009 01:47PM blieuxgirl wrote: (karen) that does make me feel better.  i hate the vainity position, but it is a real concern i guess. at least its my left breast, which is the bigger one :-)",
      "MessageIndex": 7,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737077",
      "Title": "having lumpectomy not sure of pathology blieuxgirl blieuxgirl"
    },
    {
      "AuthorID": "blieuxgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86211/profile",
      "Content": "Jul 8, 2009 01:45PM - edited Jul 8, 2009 01:46PM by blieuxgirl (irish) my decision to go ahead and have the lump removed is partly because i am a single mom with two small kids.  i work full time.  my reasoning is that if i have it cut out rather than biopsy first then im one step ahead if it turns out to be malignant.  plus, even if it is benign i dont have to keep going back to get mammograms and having it checked all over again like this time.  im already having to miss a lot of work with doctors appointments...just trying to make life easier. ill deal with whatever comes along, even though i really just want to go to sleep and forget about it all...",
      "MessageIndex": 6,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737077",
      "Title": "having lumpectomy not sure of pathology blieuxgirl blieuxgirl"
    }
  ]
}