{
  "AuthorID": "bllshane",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225775/profile",
  "Posts": [
    {
      "AuthorID": "bllshane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225775/profile",
      "Content": "bllshane wrote: Hello. Reading posts has been helpful. Dx IDC HR-, one mass <1 on mammogram, not visible on ultrasound. Does SBR9 mean grade 3? Stereotactic biopsy showed invasive ductal carcinoma. Had MRI yesterday. FInd out results tomorrow with breast surgeon. Depending on results may be lumpectomy due to small size as surgeon said at initial consult or? I have an HMO. Is it possibility that HMOs dictate a less invasive surgery first - lumpectomy for example - due to cost? I haven't been told I have options for treatment at this point. Is lumpectomy usually done first medically speaking to get a more complete dx before further extended surgery? Friend shared she had chemo to shrink tumor before her surgery. Is it possible I should be asking about this option? Too many questions? Just wait for tomorrow's info.? Smile. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/838651",
      "Title": "Waiting MRI results bllshane bllshane"
    },
    {
      "AuthorID": "bllshane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225775/profile",
      "Content": "Dec 19, 2015 08:16PM bllshane wrote: Inks, thanks for your response. My MRI showed a second duct concern and lymph node involvement. I'm triple - and I believe my SBR9 score means the same thing - Grade 3. I'm staged at Stage 1 for now until they complete the lumpectomy. Plan is to remove 3-4 additional lymph node to identify possible spread of cancer. My surgeon is confident I don't need adjunct chemo as it is small and plans to apply radiation at time of surgery. Welcome any thoughts. I read some of the stories and can't help but compare how the length of time various between diagnosis and treatment. The anticipation is difficult. I thought surgery was going to be scheduled at my follow-up appt. with surgeon (after MRI). The Ashkenazi heritage factor and possible other genetic testing is now being waited for before scheduling. My next follow-up appt. with surgeon is 1/11/16. I think we'll schedule at that time. I work at a great place and love my job. They are waiting along with me as well - sometimes inpatient as I am - to simply know when I'll be on medical leave. Doing pretty good. ",
      "MessageIndex": 2,
      "PostDate": "19/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/838651",
      "Title": "Waiting MRI results bllshane bllshane"
    },
    {
      "AuthorID": "bllshane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225775/profile",
      "Content": "Dec 24, 2015 05:14AM bllshane wrote: Had my Genetic consult today. Good information. Results may change my surgery treatment. ",
      "MessageIndex": 5,
      "PostDate": "24/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/838651",
      "Title": "Waiting MRI results bllshane bllshane"
    },
    {
      "AuthorID": "bllshane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225775/profile",
      "Content": "Jan 3, 2016 06:11AM bllshane wrote: Waiting on genetic testing. Holidays are finally done now. Have surgeon follow-up appt. 1/11 if the genetic tests are in. Don't know if it is psychosubmatic or real, but left breast where lump has a different sensation. Not pain, but heaviness. Think is might be psychosubmatic as feel sensations in right breast as well. Having difficulty sleeping, specially weekends. During work week I don't have problems getting to sleep as am exhausted, but usually wake up middle of morning and then can't get back to sleep. Need to get my sleep schedule regular. ",
      "MessageIndex": 6,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/838651",
      "Title": "Waiting MRI results bllshane bllshane"
    },
    {
      "AuthorID": "bllshane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225775/profile",
      "Content": "Dec 22, 2015 01:35AM bllshane wrote: Well, I learned SBR9 is not the same as triple negative, although I am both. I need to research the difference. Meanwhile, I had my radiation consult today. There are four (4) choices. I'd love to hear from anyone who knows anything about IOR and/or SAVI. I'm researching those as well.",
      "MessageIndex": 4,
      "PostDate": "22/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/838651",
      "Title": "Waiting MRI results bllshane bllshane"
    },
    {
      "AuthorID": "bllshane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225775/profile",
      "Content": "Jan 5, 2016 03:11AM bllshane wrote: Can anyone share anything about having negative results for the most common 3 BRCA mutations? I have more results to wait for - other BRCA mutations and a panel. I'm wondering if I\"m \"out of the woods\" for the need of a bilateral masectomy because these first three mutation tests were negative. Please comment if you know anything along these lines. Thanks!",
      "MessageIndex": 7,
      "PostDate": "05/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/838651",
      "Title": "Waiting MRI results bllshane bllshane"
    }
  ]
}