{
  "AuthorID": "Blondie7",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204663/profile",
  "Posts": [
    {
      "AuthorID": "Blondie7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204663/profile",
      "Content": "Jan 3, 2015 11:53AM - edited Jan 4, 2015 10:29AM by Blondie7 Leighrh: Sorry that you have joined the club no one wants to belong to. The initial shock and fear with this diagnosis really knocks you off your feet. While you wait for the specifics of your diagnosis, researching this topic is overwhelming because of all the possibilities. I was like you too, thinking that every day that passed, my cancer was spreading. But as has already been mentioned, it doesn't happen that quickly. Instead try to use some positive imagery and imagine your immune system (kicka** soldiers) building a wall around your tumor.:). Take a deep breath and take it one day at a time. There will be a lot of information coming at you over the next few weeks. Having someone to accompany you to appts is so helpful for the support and for the extra set of ears to take in the information. Something that I found helpful to keep myself organized was to take a binder and start filling it with copies of my tests/procedures/surgeries, resources, business cards of all the different medical specialists I saw etc. This way I had all my info in one place for future reference, and I could add and update this information as I needed. Once you start to get more information from your tests etc.. you will be able to formulate a plan and this will hopefully give you more of a sense of control over what is happening. There are so many wonderful women on this site who have been where you are and are here to help give you support. I'm with formydaughter, eat Popsicles if it makes you feel better",
      "MessageIndex": 4,
      "PostDate": "03/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827333",
      "Title": "Just diagnosed Leighrh greenae"
    },
    {
      "AuthorID": "Blondie7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204663/profile",
      "Content": "Sep 2, 2014 11:40AM Blondie7 wrote: MarieBernice6234 Glad that you have your nurse navigator to help guide you. This will be a big help. I had a nurse case manager that was provided by my medical group and she helped guide me as well, making sure I was receiving timely and appropriate referrals to services I needed and guiding me to helpful resources as well.  Stage (0-4) refers to the size of the tumor and how far the cancer has spread within the breast, to nearby tissues and if it has spread to other parts of the body. Grade (1-3) refers to how abnormal the cancer cells appear microscopically. Grade 1 indicates that while there is breast cancer cells present, you can still identify normal breast cells as well (well differentiated). Grade 3 indicates that the cells are very abnormal and the difference between the normal cells and the breast cancer cells is not seen (poorly differentiated). Usually Grade 3 tumors are more aggressive than Grade 1. I hope you have someone to go with you to your appointment tomorrow.  It's always best to have the support and to have another set of ears listening and digesting the information you will be receiving.  Someone else may also think of questions that you did not.  Wishing you the best possible outcome (under these stinky circumstances) Cali-Girl7",
      "MessageIndex": 16,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824078",
      "Title": "Just diagnosed, overwhelmed about future nomoretears850 Moderators"
    },
    {
      "AuthorID": "Blondie7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204663/profile",
      "Content": "Sep 2, 2014 08:05AM Blondie7 wrote: Hi  MarieBernice6234 I'm sorry about what you are currently going through. There will be a lot of information coming your way and decisions to make in your upcoming future, but know that this website has a wealth of information and supportive people who are also going through or have been through similar situations.  This is the first post I have made, but I have followed various topics over the past couple months and have been relieved and encouraged to hear the stories of so many others going through what I am. I was diagnosed with IDC (invasive ductal carcinoma) after a mammogram, ultrasound and finally a biopsy. I have had past surgeries for atypical hyperplasia and for lobular carcinoma in situ.  Because of this history and some family history, I elected to have bilateral mastectomies.  I had a general surgeon who I knew from my previous breast surgeries. I consulted with the general surgeon first about all my options. When I elected to have the mastectomies with reconstruction, the general surgeon then referred me to a plastic surgeon who specializes in breast reconstruction.  After my surgery, I was referred to a medical oncologist to consult with regarding whether or not I would need to have chemo or not.  It was during my initial visits with this doctor that I requested an Oncotype DX test (genetic test of the tumor itself that was removed during surgery).   This test gives you more information regarding your risk of recurrence and what your type of tumor may respond best to lower your risk of recurrence.  Because of this score (7) chemo was not recommended, as the risk of recurrence was not going to be changed by doing chemo.  The medical oncologist referred me to a radiation oncologist to discuss whether or not I was going to need any radiation therapy following the surgery (which it turns out I did not) I am currently taking Tamoxifen for hormone therapy, because I am premenopausal and this works best for those of us in that category. I understand that Aromatase Inhibitors work best for women who are postmenopausal with BC.  Hang in there. Take one day at a time and come back to BCO when you need a sounding board of supportive people.",
      "MessageIndex": 13,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824078",
      "Title": "Just diagnosed, overwhelmed about future nomoretears850 Moderators"
    }
  ]
}