{
  "AuthorID": "BlueLotus",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251119/profile",
  "Posts": [
    {
      "AuthorID": "BlueLotus",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251119/profile",
      "Content": "Apr 27, 2017 05:13PM - edited Apr 27, 2017 05:16PM by BlueLotus @MelissaDallas: The dr who did the ultrasound said that on the left breast I have the lump, the cyst and the swollen lymphatic nodes and on the right one i have the milk ducts dilateded(but i don't have kids) and also swollen lymphatic nodes, even if i don't have pains in this area - i think this is why the dr said that i have dysplasia. @tonyaberryman: thank you for the advice! the gyn said that i don't have any recommendations for an operation when i asked her about a biopsy and that i should get checked in 6 months. i don't like those swollen and painful lymphatic nodes at all - even if the lump is only 2 mm.",
      "MessageIndex": 3,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854543",
      "Title": "Lump, cyst, pain, 25 BlueLotus djmammo"
    },
    {
      "AuthorID": "BlueLotus",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251119/profile",
      "Content": "BlueLotus wrote: I've started to have pains in my armpit in February. At that moment I haven't felt anything when I checked, so I wasn't really worried. In March I had a sharp pain during the night in my left breast and when i checked it was something there. I did an ultrasound (since I'm 25 they didn't recommed a mamography) and the doctor found a cyst. Since the pain was still there I got checked again and they found a lump of 2 mm (additionally to that cyst of 2 cm) and swollen lymphatic nodes (18 mm) and I've got the diagnosis of dysplasia. Another check in 6 months was recommended. My gyn didn't recommend any other blood tests, even if she knows that my grandmother(from my mother side) had breast cancer. I feel quite worried since the pain in my armpit didn't stop and the lymphatic nodes are even bigger than 3 weeks ago ( now I can feel them when i check them). I don't know what to do....should i wait and see? or should i check a second opinion? i think that she didn't pay attention to my case. i don't want to ignore it and then find out that it's advanced. On the other hand i don't want to exaggerate. It's hard to be fully rational in this situation. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854543",
      "Title": "Lump, cyst, pain, 25 BlueLotus djmammo"
    }
  ]
}