{
  "AuthorID": "Blue0202",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274256/profile",
  "Posts": [
    {
      "AuthorID": "Blue0202",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274256/profile",
      "Content": "Aug 7, 2018 07:27AM Blue0202 wrote: Hi JanaF - I am so sorry you are going through this! I had been a bundle of pure anxiety since it all began. I really never got an answer in my case but the specialist believes it is nothing sinister and was satisfied at leaving it at that as it was a single episode. As for the lump and indent, she was not concerned as my breasts are apparently naturally lumpy. I spoke to the GP about potentially causes and he spoke of the external causes (benign) and said there were many that can cause bleeding. He mentioned hormones as one potential factor but said no definite cause could be established and I had to settle for just knowing it wasn't malignant. I am still not overly happy with the doctor leaving it at that but I am all out of energy. I have had chronic pain in my shoulder, neck and upper arm that started shortly after the nipple incident. Ultrasound and the like have attributed it to shoulder issues (bursitis, AC joint dysfunction and scapula dysfunction) which showed up about the same time. Bit weird but yeah. If the specialist was going to investigate, I believe a MRI would've been the next step. One thing I've taken from this so far is that clear reasons are few and far between and not knowing is what I have to do deal with...I wouldn't recommend it but I have to trust these damn doctors as it was really impacting my mental health. I am definitely someone that likes names and labels and hate hate hate waiting!!! Try and stay calm and busy while you wait, and prepare for possibility of further diagnostic testing. This is most likely benign and the statistics are on your side. Focus on eating well and getting enough rest as anxiety is unbelievably exhausting. Feel validated in your fear as it is a perfectly reasonable response to what is happening to you. I would get so frustrated at others saying don't worry blah blah blah...I was terrified. I wish I had a clear answer for you :( for me, it was one of the most challenging times of my life and still now, I feel super unsettled at the lack of a cause. Please let me know how you get on with the docs and any further testing. I hope you get a clear answer and soon!! Feel free to jump back on this thread and vent!!! Xxx  ",
      "MessageIndex": 13,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864723",
      "Title": "Potential Papilloma Blue0202 Blue0202"
    },
    {
      "AuthorID": "Blue0202",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274256/profile",
      "Content": "Jul 21, 2018 02:08AM Blue0202 wrote: Thank you for your reply!! I did end up at the osteopath with the upper back and shoulder pain blamed on muscle and joint sprain. I makes sense but the timing was strange. I have noticed a indentation on the side of the problem breast and more recently an odd shaped lump near the indent. None of the docs seem worried although my appt with the surgeon is nearly here (on Wednesday). The idea is she will refer me on for further tests if she believes necessary and assess for a reduction. My levels of worry around this has decreased I think simply because I could not sustain it. The pain is wretched and I am managing of paracetamol, ibruprofen and Targin on a daily basis. When I went the the GP about the lump (which can be a bit hard to locate) she said any lump not easily found is nothing to worry about, and followed up by saying 'you are obsessed with your health'. Loving life atm  ",
      "MessageIndex": 10,
      "PostDate": "21/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864723",
      "Title": "Potential Papilloma Blue0202 Blue0202"
    },
    {
      "AuthorID": "Blue0202",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274256/profile",
      "Content": "Blue0202 wrote: Awaiting results from cytology about nipple discharge and have mammogram in 2 days. Intellectually I know that it will be ok either way but I am feeling tired, depressed and a little anxious anyway. Trying to keep busy but why am I feeling like this if the probable outcome is a benign papilloma? It feels like a big deal but I know the chances are in my favour. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864723",
      "Title": "Potential Papilloma Blue0202 Blue0202"
    },
    {
      "AuthorID": "Blue0202",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274256/profile",
      "Content": "May 20, 2018 04:28PM Blue0202 wrote: Bloody discharge",
      "MessageIndex": 4,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864723",
      "Title": "Potential Papilloma Blue0202 Blue0202"
    },
    {
      "AuthorID": "Blue0202",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274256/profile",
      "Content": "May 23, 2018 05:54AM Blue0202 wrote: Mammogram today and showed nothing untoward however they recommended an ultrasound also to be certain nothing was missed. I see gp later this week for cytology results and ultrasound is booked in a few weeks. Given that I have large, dense breasts (16H), should I be pushing for a MRI too? The first gp I saw last week was 99% sure the bleeding duct was a papilloma and felt a mammogram +/- ultrasound would be insufficient. I was not able to make an appointment with my regular gp for this next visit so unsure as to what to expect.",
      "MessageIndex": 5,
      "PostDate": "23/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864723",
      "Title": "Potential Papilloma Blue0202 Blue0202"
    },
    {
      "AuthorID": "Blue0202",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274256/profile",
      "Content": "Jun 13, 2018 06:31PM Blue0202 wrote: Ultrasound today and I have mixed emotions. Nothing obvious and axillary lymph node size was within range. He did tell me the density of my breasts meant that the initial mammogram was ambiguous. Although nothing showed, he stated that it did not mean that there was something further down that could have caused the bleeding. In terms of the indent, he suggest it could be related to coopers ligament although I don't know much about that. I am still in pain around my collarbone and shoulder and will be heading to specialist for her advice and hopefully looking at having my breast size reduced. I don't think my partner really understood why I was still a bit out of sorts. I don't understand why I'm out of sorts. Argggggghhhhh!! Thanks for letting me vent!",
      "MessageIndex": 3,
      "PostDate": "13/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865162",
      "Title": "Indent in breast Blue0202 Blue0202"
    },
    {
      "AuthorID": "Blue0202",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274256/profile",
      "Content": "May 24, 2018 03:34AM - edited May 24, 2018 03:34AM by Blue0202 Update...cytology results showed discharge was just blood. Still recommended I go for ultrasound and suggested further investigation would be required. More waiting but so far, so good.",
      "MessageIndex": 7,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864723",
      "Title": "Potential Papilloma Blue0202 Blue0202"
    },
    {
      "AuthorID": "Blue0202",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274256/profile",
      "Content": "Jun 11, 2018 07:25AM Blue0202 wrote: Firstly I wanted to thank everyone who has commented so far. I have an ultrasound scheduled in 2 days to try to identify the cause of my nipple discharge. Cytology wad clear however showed on was just blood...no malignancy and no infection. Not sure what this could mean for the cause. I have been quite anxious since the mammogram and have had a few other issues crop up. I began having shooting from my collarbone, neck and shoulder down to my fingers on the same side as the problem breast. It isn't constant but painful enough for me to need prescription painkillers for nearly 2 weeks. I am having some intermittent pain around my breast, widespread body aches and some dizziness. My gp gave me time off work and believed it was anxiety, physical stress and complications from my 16H breasts. She has already referred me to a surgeon who may be able to assist in a reduction. My worry is if nothing is found, will I be just living with this random pain forever? I am not convinced that it is all anxiety related. My silly mind is jumping into dramatic scenarios where something is majorly wrong that is causing the bleeding and other symptoms. I am however able to function and engage and have a joke and forget about what is happening.",
      "MessageIndex": 8,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864723",
      "Title": "Potential Papilloma Blue0202 Blue0202"
    },
    {
      "AuthorID": "Blue0202",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274256/profile",
      "Content": "Blue0202 wrote: Hi. I posted a little while ago about bloody discharge from my right nipple. Fast forward to about a month later and now I have noticed a long indent along the side of the same breast. My pain levels have been a bit much and am constantly taking painkillers. Cytology from blood shows no malignancy and mammogram was clear. Given my 16h size breasts are somewhat dense, I am due to have an ultrasound tomorrow. This has been a rollercoaster ride of emotions, as with coping with the pain up my neck, around my collarbone and shoulder/upper arm. I know I have to wait and see but worries they will not find a root cause for the pain. I can't live like this!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865162",
      "Title": "Indent in breast Blue0202 Blue0202"
    },
    {
      "AuthorID": "Blue0202",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274256/profile",
      "Content": "Jun 13, 2018 06:22PM Blue0202 wrote: Thanks for that...my partner tells me now I've hit 40 I should deal with being in pain. He has a sore back most days and has done so for years. How do I consolidate posts? Should I copy/paste into this one?",
      "MessageIndex": 2,
      "PostDate": "13/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865162",
      "Title": "Indent in breast Blue0202 Blue0202"
    }
  ]
}