{
  "AuthorID": "bmdaley",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
  "Posts": [
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 13, 2009 02:30PM bmdaley wrote: Hi Heidi -- sorry about this shocking news and big hugs. You are smart to get the port. I wish I would have gotten it sooner. As for steroids, I personally struggle when I have to have them. I find I am manic for a few days after getting them (that's usually when the house gets cleaned haha), then collapse in exhaustion, and end up with bad sleeping schedule. I hope your side effects are tolerable and that they work!",
      "MessageIndex": 14,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732332",
      "Title": "New Sister Arrival Heidi_Ho 33skidoo"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jun 6, 2009 06:40PM bmdaley wrote: Your friend BJ is so lucky to have you to look out for her. Chemotherapy is given to treat mets. She and you should feel free to press the doctor for information about his treatment plan and what to expect in the future. I don't know much about treatment in her situation but agree with you that something doesn't sound right, like it does seem that chemotherapy would be part of the plan. Hopefully some of other ladies with IBC can shed some light. I wish you much luck and hope that BJ feels better soon.",
      "MessageIndex": 1,
      "PostDate": "06/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735451",
      "Title": "Is Chemo Effective on Mets? lovemyfriend maria38"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Sep 3, 2009 12:36PM bmdaley wrote: I am losing my memory and my mind. In solidarity against the goblins.",
      "MessageIndex": 18,
      "PostDate": "03/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738272",
      "Title": "AM I LOOSING MY MEMORY? ead activern"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 24, 2009 08:56PM bmdaley wrote: Me too. Not now, but in past have not taken steroids until I really needed them for nausea rather than just popping them. Our bodies don't need the extra burden if we can avoid it.",
      "MessageIndex": 1,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734753",
      "Title": "anyone NOT take their pills MJ6266 stateofgrace33"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 14, 2009 08:25PM bmdaley wrote: Hi Heather, today I just saw an old friend I hadn't seen in a long time. She had just gone through having pain and numbness in her arm which led to the doctors discovering that she had a herniated disk in her neck. I hope they find the cause and make you feel better soon. Big hugs.",
      "MessageIndex": 8,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734172",
      "Title": "still not sure hezzy bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 8, 2009 08:27PM bmdaley wrote: May she rest in peace.",
      "MessageIndex": 15,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732120",
      "Title": "SloneDeb AusAla heatherpalmerton"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jun 3, 2009 06:54AM bmdaley wrote: Big hugs to everyone here. And thank you for having the courage to speak the truth. Diane -- I am going to be praying for you. I zipped through three chemos since Sept with no results and lots of crap SEs I know that feeling of when is something going to work already? They just put me on Avastin & Tamoxifen and the funny thing is that I actually think the Tamoxifen is the thing that's starting to work. You deserve a break already. And no one knows what the heck works on each of us so its all a crap shoot. Lynn -- thanks for your wonderful honesty. Sometimes I'm sick of this world of every put a happy smily face on it. Many people simply can not sit still and listen to someone talk about how they are going to die. They feel like they immediately have to have a come back about how its all going to be ok and you should stay positive. Or its the old line of if things are screwed up you can either be positive or be negative so why not be positive. Somehow I feel that all of us are truly complex individuals and that there's no black and white when it comes to how we feel. I feel almost assaulted in a way when told by someone that I should take antidepressants for expressing a negative feeling. Those negative feelings are very real, just as real as the positive ones. Denying them seems like a waste of energy that I don't have. Thank goodness we can just talk about these things here.",
      "MessageIndex": 27,
      "PostDate": "03/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734893",
      "Title": "Scans say stable. I say big deal. LynnW Dollyd"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Oct 28, 2008 06:50PM bmdaley wrote: Hi Cheryl -- my doc started me me on Abraxane and Carboplatin two months ago. I am on a three week cycle, the first week is Abraxane, Carbo, and Zometa, the second week is Abraxane and Herceptin. The first treatment I got was with both Abraxane and Carbo and it killed me. I've noticed for me and my doc agreed that the first time getting a chemo can be really hard but after that the body adjusts. Since then though, I can tell you that the Carbo Abraxane combination for me has been much harder than just Abraxane. In particular, on my two chemo week, I've had to get all the big guns to deal with nausea. I get a prescription called Emend which helps and I've also gotten additional steroid pills. The normal nausea drugs did not cut it. Also, I'm totally decked for the whole week following Carbo Abraxane whereas with the Abraxane I'm much more functioning. On the good news side though, my cancer cell counts were way down following just two cycles so the combination is working very well. I sincerely hope the pain you have been experiencing subsides or can be managed better. And, as a mom, my heart goes out to you. I wish I lived close by to help you out. I know how frustrating it is to feel unable to take care of the little ones we love so much. Big hugs.",
      "MessageIndex": 3,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723517",
      "Title": "Questions about Carboplatin - can I handle it? mason204 SunshineSmiles"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 22, 2010 01:47PM bmdaley wrote: My tumor markers have been lower and I thought I was doing well. HAHA not so fast. I just had a scan which showed cancer is worse than ever before. Stupid cancer. I guess I just wanted to chime in that they are not too reliable. I hope your scan is reassuring. Good luck.  ",
      "MessageIndex": 10,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747104",
      "Title": "Tumor markers WAY up BonnieVA tami444"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 20, 2009 12:32PM bmdaley wrote: Sorry to hear bad news and hope next steps will heal you quicly. XOXOX Beth",
      "MessageIndex": 21,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732667",
      "Title": "Pet Results not good Bonnielv getwell"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 13, 2009 06:58AM bmdaley wrote: Hello, I couldn't copy the link to the Ask the Experts piece but a link to it is posted on the home page of breastcancer.org Also, I'm not an expert but I don't believe there's been definitive research proving that cancer is caused by a suppressed immune system. There's been some research studies, esp. recently showing that cancer cells had evolved in a way to elude detection by the immune system. So, no matter how good the immune system was, the cancer sneaks by. I think it is so important for all of us to know that it is not our fault that we have this disease. There are so many reasons people look to as possible causes but none of them have been proven yet. I guess all we can do is pray that the doctors figure it out soon for us. I can totally relate to your frustration Member as I have felt quite a bit that people sometimes want to believe that they know the cause of cancer so they won't get it themselves. Having stage IV is almost like living a Seinfeld episode every day because there are a lot of people who are so scared of what we are going through and can be so inappropriate. Big hugs to all of you.",
      "MessageIndex": 27,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734061",
      "Title": "Has cancer pshycological roots? vivo bygracealone"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 15, 2009 05:41AM bmdaley wrote: Many thanks Vivo for starting this topic and sharing your thoughts. I appreciated everyone's thinking.",
      "MessageIndex": 37,
      "PostDate": "15/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734061",
      "Title": "Has cancer pshycological roots? vivo bygracealone"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 21, 2009 03:51PM bmdaley wrote: It also depends on where the 3mm spot is. Like if its in the lung, that could just be a false alarm. I had one like that as stuff kind of gets in the lungs. As for scans 1x/year, I was stage IIIa initially and was getting scanned every 6 mos. Good luck.",
      "MessageIndex": 3,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734584",
      "Title": "MRI Questions ITSPIE bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 1, 2010 10:14AM bmdaley wrote: Connie, am sorry to hear what you went through. I've been stage IV since 11/2007. My life has totally changed. I live like a retired person trying to do those things I always thought I would do, read and relax, travel, try to do things I enjoy, spend more time with the people I love. There are definintely some tough times when complications arise but my family and friends always remind me that the tough times are temporary blips which is so true.",
      "MessageIndex": 2,
      "PostDate": "01/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747638",
      "Title": "Just a Little Peace of Mind meN3 tami444"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 7, 2009 11:40AM bmdaley wrote: I had a chemo treatment that was working (my scans were clear) but I still had high tumor markers, probably b/c of what was mentioned above about dead cells. I'll be crossing my fingers that is what is happening in your case. ",
      "MessageIndex": 37,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731955",
      "Title": "ONC CALLS ME AT WORK TODAY heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 22, 2009 12:40PM bmdaley wrote: Hope you feel better Lydia. And even though we were probably all \"overdoing it\" at the conference I had a great time and really enjoyed meeting you. :)",
      "MessageIndex": 9,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732867",
      "Title": "Ouch! luvtotravel EGAL"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 11, 2009 01:54PM bmdaley wrote: I have been on Zometa since 11/2007. I'm not sure what side effects are since I've always had it with chemo. But, since I started taking it, my bone mets are gone. Good luck.",
      "MessageIndex": 6,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730471",
      "Title": "Zometa Questions Myrajuc bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "bmdaley wrote: Have you been treated by Dr. Nicholas Gonzalez? If so, would you share your experience, either here online or with me offline? Beth -- Dx Stage II/III 1/2004. HER2+, ER+, PR-. Dx Stage IV 11/2007 liver, chest wall, bones. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725216",
      "Title": "Anyone treated by Dr. Nicholas Gonzalez? bmdaley waterlily"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 27, 2010 09:59AM bmdaley wrote: Always good to get 2nd and 3rd opinions. I do that periodically and learn so much. It also renews my faith in my oncologist. Sorry to hear you are going through the pain.",
      "MessageIndex": 5,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747339",
      "Title": "results of MRI shows new lesion :( pegcz konakat"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 8, 2009 08:07PM bmdaley wrote: Hi nurseann -- I have mets which have totally blocked the ureter from my right kidney. I had a stent but then it got blocked again and got damaged without my knowing. My urologists decided to let that kidney go silent. My left kidney got blocked the same way last summer. I had a percutaneous tube put in for a while until chemo cleared up the block. Now I fear the block is coming back again and will be making the rounds at my urologist again tomorrow. Despite these blockages, no cancer spots have shown up on my PET or CT scans, even at the points where my ureters have appeared blocked. Would be happy to PM more about our shared experiences. I don't have ILC. Good luck. ",
      "MessageIndex": 13,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730238",
      "Title": "Mets to abdominal cavity,kidney,urethra nurse-ann waterlily"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 3, 2009 06:43AM bmdaley wrote: Hello Virgina mom, I'm in a sort of similar boat to you. I am 43 with twin 6-year old daughters. There's nothing more to say than breast cancer sucks. Are you in the Washington, DC area? I'd be happy to swap notes about doctors I've seen either for opinions or treatment. I'll be praying for good test results for you.",
      "MessageIndex": 16,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730041",
      "Title": "New here virginiamom Mazy1959"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 12, 2010 06:00PM bmdaley wrote: Elizabeth, I'm so saddened by your news. Big hugs to you.",
      "MessageIndex": 29,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 2, 2009 09:57PM bmdaley wrote: Hi Sue -- I hope you feel better soon. I didn't want to take antidepressants and put it off for many months but just started this week. I was feeling like my brain stopped making the happy drugs after being on chemo. Sending big hugs across the Atlantic to you.",
      "MessageIndex": 4,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731801",
      "Title": "depression or progression??? suecco katie11"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 28, 2010 08:36PM bmdaley wrote: Hi Judi, no helpful advice but just wanted to let you know I'm sorry to hear this news and hope the estrogen works. Big hugs.",
      "MessageIndex": 5,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747503",
      "Title": "Estrogen Therapy? Bad news just now. Judiiiii Jellydonut"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 28, 2010 09:48PM bmdaley wrote: Hi Judi, I just ran across this clinical trial. GOOD LUCK  Estrogen for Hormone-Positive Metastatic Disease A Single Arm Phase II Study of Pharmacologic Dose Estrogen in Postmenopausal Women With Hormone Receptor-Positive Metastatic Breast Cancer After Failure of Sequential Endocrine Therapies (W81XWH-06-029) Breast cancer tumors that are hormone sensitive -- estrogen receptor (ER)-positive and/or progesterone receptor (PR)-positive -- may eventually stop responding to hormone therapies, like tamoxifen and anastrazole (Arimidex®). Before hormone therapies that keep estrogen from getting to the breast tumor were developed, post-menopausal women with metastatic breast cancer were often treated with estrogen. Recent studies have found that post-menopausal women with hormone-sensitive metastatic breast cancer that has stopped responding to hormone therapies did respond to estrogen. The purpose of this trial is to determine whether the estrogen estradiol (Estrace) can shrink breast cancer and/or get the tumor to start responding again to hormone therapies. This is a Phase II trial",
      "MessageIndex": 9,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747503",
      "Title": "Estrogen Therapy? Bad news just now. Judiiiii Jellydonut"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 7, 2009 12:15PM bmdaley wrote: God bless Patty's family, her children and her husband. My deepest condelences to them on their loss and wishes that their friends and family support them during this difficult time.",
      "MessageIndex": 1,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732097",
      "Title": "Our Newest Beautiful Angel--Patty4 KLynn badboob67"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 3, 2009 07:44AM bmdaley wrote: P.S. The picture of me above & to the left was on Navelbine at month 6 or 7. See, still had lots of hair! It was happy to have the hair. I miss it.",
      "MessageIndex": 6,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730042",
      "Title": "New progression...what's next??? saw1019 luvtotravel"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 3, 2009 07:43AM bmdaley wrote: I did Navelbine for like 10 months, hair doesn't fall out and manageable side effects. Carboplatin killed me. Good luck. I know you'll make that trip to Hawaii.",
      "MessageIndex": 5,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730042",
      "Title": "New progression...what's next??? saw1019 luvtotravel"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 19, 2009 02:02PM bmdaley wrote: Congratulations!! I really hope everyone posts the good news because we REALLY need to hear that as well as the bad news. I guess I haven't felt guilty posting the good news in the past b/c we all go through hard times as well as good times. Your news made my day! Hope the good news keeps coming.",
      "MessageIndex": 4,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734458",
      "Title": "Do you ever feel guilty?? RobynK konakat"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 8, 2009 08:23PM bmdaley wrote: Sorry to hear this news for you and hoping the time will fly by so you can welcome her home and give her a big hug.",
      "MessageIndex": 8,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730345",
      "Title": "Bad news at home meima-Bev bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 22, 2009 11:59AM bmdaley wrote: CONGRATS! Beth",
      "MessageIndex": 10,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732916",
      "Title": "Guess what?? I really do have a brain. heatherpalmerton whoopsiedoodles"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 1, 2009 05:13PM bmdaley wrote: BIG HUGS to you and your husband. Its totally unfair that all these things are happening right now when you need some peace. Praying for good scan results. You will love the power port. I never have to get my arm poked any more, although the company that does my CT scans makes me get it accessed at dr.'s office. I'm not complaining tho. Good luck with your scan!!!",
      "MessageIndex": 2,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731764",
      "Title": "Stress anyone? pee Watson"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 22, 2010 04:36PM bmdaley wrote: Hi Tovaing, I just wanted to tell you that after I was diagnosed Stage IV, I made travel a priority. I'm glad I did because I don't feel as well right now and don't feel I can enjoy travel as much as I did when I was better. I also spent a lot of time checking out complementary/alternative medecine and ultimately concluded that none of it can cure cancer but it can strengthen your body to withstand the awful treatments, which is so important when you want to be able to do every treatment possible. I wish you much luck and hope you are finding that all the wise women here have some good thoughts for you.",
      "MessageIndex": 12,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747110",
      "Title": "...what do I do now, I just don't know what to do with myself! tovaing KSkier"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 16, 2010 05:08PM bmdaley wrote: Yes, it could just be plugged bile duct and not liver damage. Big hugs and hope Doxil works.",
      "MessageIndex": 7,
      "PostDate": "16/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748429",
      "Title": "Yellow eyes and skin BonnieVA heatherpalmerton"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "bmdaley wrote: I just learned through serendipity about Sonodynamic and Photodynamic therapy (link below has basic info) for fighting cancer. I see it has been approved for some cancers and it appears that all the literature I've perused with my lay person's eye shows that it works very well. But, I'm wondering if anyone has heard of any research or treatment going on re: breast cancer, especially in the US. Also, has anyone tried this? http://www.cancer.gov/cancertopics/factsheet/Therapy/photodynamic Beth -- Dx Stage II/III 1/2004. HER2+, ER+, PR-. Dx Stage IV 11/2007 liver, chest wall, bones. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725205",
      "Title": "Sonodynamic or Photodynamic therapy for breast cancer bmdaley mthomp2020"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 28, 2010 02:43PM bmdaley wrote: I did Gemzar for six months until a few weeks ago when a scan showed progression. I had some nausea and exhaustion with the Gemzar but I think that's unusual. This is one of those drugs you keep taking until SEs are too bad or there is progression. Good luck making your decision.",
      "MessageIndex": 5,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747403",
      "Title": "Gemcitabine for liver and bone mets Marybe Marybe"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 12, 2009 03:47PM bmdaley wrote: I started Ixempra 7 weeks ago. I had very difficult neuropathy the first cycle but it disappeared after that. I started the Ixempra with one dose every three weeks. After the first cycle, I could tell the tumors in my liver were growing. My doc knows I'm good at telling what is going on so he increased my dose by 20% and split the chemo treatment over two weeks of a three week cycle where I get the last week off. The new protocol seems to be working much better. The only serious side effect I've had has been just being tired and also a bit more emotionally drained. Also, hair falling out. I will be getting a scan in about a week so will know whether this stuff is working. Good luck and please keep in touch on the Ixempra thread about how goes.",
      "MessageIndex": 4,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730601",
      "Title": "Treatment with Ixempra (ixabepilone) carole2 bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 21, 2009 07:38PM bmdaley wrote: Hi Debbie, I love your attitude and spirit and am so glad you posted to share with us. Please keep sharing that positivity!",
      "MessageIndex": 17,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734496",
      "Title": "Hi I'm new to this board DebZaz DebZaz"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "bmdaley wrote: I've not posted in a while. I'm in a bit of a slump with the cancer. After initial results showing Avastin and Tamoxifen was working, they actually made my cancer grow very aggressively. By the time we figured that out and got me off, I was angling to get into the TDM1 study. I couldn't wait for all the shipping of lab samples and got myself onto Gemzar which appears to be working, although slowly. The cancer has caused me to have a paralyzed vocal chord, gastroparesis (stomach fails to empty food to intestine), and a weak bladder which fails to empty. My pleural effusions are back and I'm hacking away. My pulmonologist finally decided I could get the VATS surgery which adheres the lung to the chest wall and prevents pleural effusions. I begged him to do the surgery on me three months ago when I was in good shape. Now I'm a frickin mess and don't know when I'll be able to get that surgery and get rid of this cough. All this has resulted in family and friends rallying around. Thanks to Heidi Ho, my friends set up a Lots of Helping Hands website (www.lotsahelpinghands.com/c/61... THANK YOU Heidi. So now everyone driving me around to doc appts etc. Despite my crosses to bear I see so many postings here of women facing daunting challenges and feel humbled by their courage (esp Heidi and riverinrabbit). In solidarity against this fxxxing disease (excuse the French). Beth -- Dx Stage II/III 1/2004. HER2+, ER+, PR-. Dx Stage IV 11/2007 liver, chest wall, bones. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739939",
      "Title": "Hello everyone bmdaley WingsofHope"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Sep 4, 2009 04:48AM bmdaley wrote: Thinking of you Heidi and praying. Stay strong for your breast friends.",
      "MessageIndex": 247,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jul 6, 2009 03:17PM bmdaley wrote: Interesting...I've been on a lot of treatments but didn't have as much bruising as I do now that I have been on Tamoxifen. My platelets have been almost normal so I wondered too what it was.",
      "MessageIndex": 8,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735279",
      "Title": "Bruising CathleenP Kate2z80"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 8, 2009 07:45PM bmdaley wrote: Hi Trina -- I had a rough fall a few years ago and have a spot on my rib there they say is nothing. GOOD LUCK and let us know how it goes.",
      "MessageIndex": 27,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728242",
      "Title": "Just Heard That Dreaded Phrase.. WellWater WellWater"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 7, 2010 06:57PM bmdaley wrote: We are enjoying snuggling up inside, playing games, reading and the occasional outing to take my twin 7-year old daughters sledding. Luckily we have a few options for sledding close by. The streets have been getting plowed quite a bit but we're not sure if our alleyway will get any plowing in which case our car could be stuck for quite some time as the forecast is more cold weather and possibly another storm on Tuesday. There's also no public transportation this weekend except our underground Metro. We're not sure if school will be open tomorrow or if we'll be able to catch a bus or taxicab to get our girls there. In 20 years of living here, this is definitely the worst snowstorm ever. When I first moved here from Chicago, I used to laugh at how silly people were about getting any snow at all, everything would just shut down over a few inches. Well all that is changing ha ha",
      "MessageIndex": 10,
      "PostDate": "07/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747935",
      "Title": "Dana, are you OK in this snow? Member_of_the_Club WingsofHope"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 15, 2009 01:04PM bmdaley wrote: WOW!! That is REALLY great news!!!! Thank you for sharing this news which brings a smile to my face. That Gamma Knife really kicked it.",
      "MessageIndex": 26,
      "PostDate": "15/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734130",
      "Title": "Some Unexpected Good News VickiG VickiG"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jun 6, 2009 09:30PM bmdaley wrote: Congratulations! Nothing makes me want to kick cancer butt more than my children.",
      "MessageIndex": 12,
      "PostDate": "06/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735394",
      "Title": "New Baby Girl! Analemma marie1963"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Sep 5, 2009 02:00AM bmdaley wrote: Thanks Elizabeth, its always reassuring to know I am not the only one who is impatient ha ha. Hi Dana Heather and Linda, nice to see you here! Luann, I can still try to get in the clinical trial but I have to pursue my course with Gemzar til it fails or I can't take side effects. I'm not sure if they'll have a slot for me by that time, although I saw on another posting they may be opening the study up more. Cross our fingers xxxxx ",
      "MessageIndex": 6,
      "PostDate": "05/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739939",
      "Title": "Hello everyone bmdaley WingsofHope"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 22, 2010 04:42PM bmdaley wrote: I too have been shocked by how quickly some can go from following the stories of women on this board. I have to say though that if I'm in bad shape I'd rather go fast. But its also made me work on getting all my ducks in order like wills and things like that so that when the time comes things are easy for my husband.",
      "MessageIndex": 7,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747139",
      "Title": "sad and worried lukejessesmom Mazy1959"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 7, 2009 12:47AM bmdaley wrote: Rusty, I am SO SORRY to hear how rough things are right now but am SO GLAD to hear you are out of the hospital. I can't help but wonder if the treatment regimen they've got you on is just not right for you. I ended up in the hospital a few times last Fall with all kinds of bad things going on (infections, lung collapsed, etc) and then my doc said no more of that treatment for you b/c it was just a bad reaction. Now am on completely different chemo and feeling much better. I can tell you have a fighting spirit and are going to make it through this rough spot. You are in my special \"moms who don't deserve this crap\" prayers. :)",
      "MessageIndex": 17,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728492",
      "Title": "Fourth year mark...and fell like im slowly losing. rooni LuAnnH"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 8, 2009 09:21PM bmdaley wrote: Keeping you in my prayers and meditations SloanDeb. Sending healing energy to KY.",
      "MessageIndex": 25,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730236",
      "Title": "Slonedeb sending out prayers! LuAnnH VickiG"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 14, 2010 12:57PM bmdaley wrote: Your posting seemed like the same list of questions I also ask myself almost every day. This disease sucks esp when you are a mom trying to hold it all together and wondering how much longer you'll have with your little angels. I have also gone into my docs office for hydration as well as anti-nausea meds after treatment and I did it for two days not just one. It certainly helped. I also drink water like crazy the first two days after chemo and it makes a huge difference on how much I am suffering later in the week. I try to do 1-2 largish glasses per hour. My heart goes out to you during this difficult time. I'll be hoping you are feeling better soon. Please feel free to PM me if you want to talk. I am also a mom of young kids and know that feeling of despair in wanting to be a good mom but wondering how when just getting out of bed is a major challenge.",
      "MessageIndex": 21,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746694",
      "Title": "Feel like hell my3sonz getwell"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 19, 2010 06:51PM bmdaley wrote: There was a typo in my link, so here's another try -- http://clincanrres.aacrjournals.org/content/7/5/1192.full",
      "MessageIndex": 9,
      "PostDate": "19/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746974",
      "Title": "neuropathy lucydog lucydog"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 8, 2010 02:50PM bmdaley wrote: As MJL says, you are eligible for SSD five months after you stop working with a check coming at the 6 month mark. I reviewed the rules and found that metastaic breast cancer is a category which gets approved. I was approved in a matter of weeks. However, I made sure to prepare my application very thoroughly with all medical and employment records so they didn't need to do much to fast track my application. I was told that because my application was so thorough that the employees at Social Security headquarters would probably want to work on my application and get it done because it was an easy one. From what I gather, a lot of this just depends who you get at Social Security to help you. I was as nice and helpful as could be and it got me far. You should check the rules but you may be able to get back benefits if you have not been working for a long time. The Social Security disability website is very thorough and should be a helpful reference for you. At the same time that they work on your SSD application, they may also review you for SS Suplemental and determine if your income qualifies you for that benefit. If you have children under the age of 18 and you are approved for SSD, they will also be eligible to receive income. Once you are approved, you simply go back to your contact at the Social Security office and apply for dependents. I sincerely hope you are able to get what you need and deserve through this process.",
      "MessageIndex": 6,
      "PostDate": "08/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747986",
      "Title": "What if.. vickib GryffinSong"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 9, 2010 06:35AM bmdaley wrote: You've been so not a homebody for so long Fitz. I'm so amazed you kept working so long while dealing with this crazy disease. I wasn't man enough for that ha ha. My friends tell me its ok to curl up at home esp with all these sucky chemos, its just my body asking for a break. I still get out to have lunch with friends and have some over, but its true I'm not my same perky self because of what this fricking disease and its sucky treatments. I'm not hosting as many parties. I guess we're all just trying to get by and do our best.",
      "MessageIndex": 10,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748002",
      "Title": "Anybody feel like a \"homebody\" ? Fitztwins tami444"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 8, 2010 02:53PM bmdaley wrote: P.S. I completed my application and then also made an appointment with the local SS office. I think it helps to get a personal contact who can steer your application and answer your questions.",
      "MessageIndex": 7,
      "PostDate": "08/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747986",
      "Title": "What if.. vickib GryffinSong"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 19, 2010 06:48PM bmdaley wrote:",
      "MessageIndex": 8,
      "PostDate": "19/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746974",
      "Title": "neuropathy lucydog lucydog"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 19, 2010 06:54PM bmdaley wrote: Hope you feel better.",
      "MessageIndex": 10,
      "PostDate": "19/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746974",
      "Title": "neuropathy lucydog lucydog"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 3, 2009 09:35AM bmdaley wrote: Its impossible not to be terrified when you are a mom of young kids (my twin daughters just turned 6). I'll be praying for good test results and false alarms.",
      "MessageIndex": 4,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730051",
      "Title": "Hard to keep up the happy face PJB LuAnnH"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 8, 2009 11:28PM bmdaley wrote: Big hugs kbug. I always appreciate your postings and know your positive energy and God will carry you through this rough time.",
      "MessageIndex": 38,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730173",
      "Title": "results in kbugmom gma5279"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "bmdaley wrote: 4th Annual Conference for Women Living with Advanced Breast Cancer: Enhancing Your Health and Quality of Life Join us on May 1-2 for a national conference that focuses on your unique medical, emotional and practical concerns as a woman living with metastatic breast cancer Plenary Speakers: Judy E. Garber, MD, MPH; Donna Deegan; Bruce Feiler Join Living Beyond Breast Cancer on May 1-2 in West Conshohocken, Pennsylvania, for our 4th Annual Conference for Women Living with Advanced Breast Cancer. Held just miles from the city at the beautiful Philadelphia Marriott West Hotel, this national conference focuses on your unique concerns as a woman living with metastatic breast cancer. At this event, you will: Learn about medical treatments for bone, liver, lung and brain mets Hear about clinical trials and cutting-edge therapies Ask questions of providers with a special interest in metastatic breast cancer Get advice on managing side effects Find support for your emotional and practical concerns Be inspired by speakers who have coped with metastatic cancers Connect with hundreds of women like you During three plenary sessions and ten workshops (detailed below), get the information and support you need to make informed decisions. You’ll also enjoy a special screening of LBBC’s video Metastatic Breast Cancer: Stories of Trials, Perseverance and Hope; conversations with providers; and networking receptions, where you’ll connect with women and families. We hope you’ll make some friends along the way, too! About Our Key Speakers Judy E. Garber, MD, MPH, Bruce Feiler and Donna Deegan, our plenary speakers, are leading voices in the world of metastatic cancer. During the opening plenary session on Saturday, Dr. Garber will discuss \"Treating Advanced Breast Cancer: Medical and Research News.\" A member of LBBC’s Medical Advisory Board, Dr. Garber is director of the cancer risk and prevention program at Dana-Farber Cancer Institute, in Boston. She also serves as attending physician at Dana-Farber’s Breast Evaluation Center and is an associate professor of medicine at Harvard Medical School. Her research interests include hereditary and familial breast cancers, novel medicines, managing chemotherapy side effects and cancers in premenopausal women. A New York Times best-selling author, Mr. Feiler will open the second plenary session on Saturday afternoon by discussing how he coped with his 2008 diagnosis of bone cancer. The experience inspired his book, The Council of Dads: My Daughters, My Illness and the Men Who Could Be Me, which will be released just a week before the conference. The book explores how he prepared for the possibility his children could grow up without him. Previously, Mr. Feiler published nine books that reexamine historical people and places. Ms. Deegan, also speaking during the second plenary, is the evening anchor for \"First Coast News\" in Jacksonville, Florida. She will share her inspiring journey of thriving while managing breast cancer. After her initial diagnosis, Ms. Deegan established The Donna Foundation, which helps women in northern Florida who are undergoing breast cancer treatment and have financial difficulties. She established an annual race called 26.2 with Donna: The National Marathon to Fight Breast Cancer. All proceeds support breast cancer research and support. Ms. Deegan has published two books about her journey with breast cancer, The Good Fight and Through Rose Colored Glasses. During plenary session three on Sunday, you can directly question our five professionals with expertise in the concerns of women with metastatic breast cancers. Our distinguished panelists are: Faith D. Ottery, MD, PhD, FACN, a surgical oncologist. Dr. Ottery is senior director of medical affairs at Savient Pharmaceuticals and chair of the cancer rehabilitation and survivorship study group of the Multinational Association of Supportive Care in Cancer. Stacy D. Sanford, PhD, a clinical health psychologist. Dr. Sanford works at the Robert H. Lurie Comprehensive Cancer Center of Northwest University. Linda T. Vahdat, MD, a medical oncologist. Dr. Vahdat is associate professor of clinical medicine at Weill Cornell Medical College of Cornell University. Rodney N. Warner, Esq, an attorney. Mr. Warner works at The Legal Clinic for the Disabled. Heather L. Wright, ND, a naturopathic clinician. Ms. Wright practices at the Cancer Treatment Centers of America at Eastern Regional Medical Center. About the Workshops This conference has two workshop sessions, one on Saturday and one on Sunday. Choose from among five topics per session (details below). We know it can be hard to pick just one, so we record and transcribe most workshops. Even if you miss a session, you can likely access the information on lbbc.org in the months following the event. Saturday Workshops A. Bone Mets: Treatments and Strategies Judy E. Garber, MD, MPH, Dana-Farber Cancer Institute Learn about standard and new therapies for bone metastases, including medicines, surgery and radiation, and the tests your doctors use to monitor effectiveness of treatment. Find out how to manage side effects, protect and strengthen bones and enhance your quality of life. B. Confronting Tough Decisions: Using Your Inner Compass as a Guide Shannon Carney, Wind River Cancer Wellness Retreat We often feel overwhelmed and unsure when confronted with decisions, big and small. In this fun, hands-on workshop, you will learn to better navigate through choices and flow gracefully through change by accessing the divine wisdom of your inner compass. Part of this session is devoted to guided imagery for healing. C. Managing Metastatic Triple-Negative Breast Cancer Lyndsay N. Harris, MD, Yale Cancer Center Get the emerging news on research for breast cancer that tests negative for estrogen, progesterone and HER2. Learn about standard treatments; cutting-edge therapies like PARP inhibitors and anti-angiogenic medicines; and ways to manage common symptoms and treatment side effects. D. Taking Control: Talking about End-of-Life Concerns Gail A. Inderwies, RN, BSN, MBA, and Cindy Scott, RN, BSN, Keystone Hospice In a safe and sensitive environment, ask questions and get the information you need to openly discuss end-of-life care with your family, friends and healthcare team. Find out what issues to consider in planning for your future and how to create a legacy for your loved ones. Learn what services hospice offers, the importance of pain management and how to create an advanced directive. E. Communicating with Children about Metastatic Breast Cancer Joan F. Hermann, LSW Advanced breast cancer affects the entire family, especially young people. Learn to use age-appropriate concepts, recognize coping difficulties and encourage open communication. Discover methods to juggle changes in family roles and routines and to embrace the joys and demands of family life while coping with uncertainty. Sunday Workshops F. Liver and Lung Mets: Treatments and Strategies Linda T. Vahdat, MD, Weill Cornell Medical College Explore medical options for breast cancer that has spread to the liver or lungs. Learn about the challenges to treating these sites, and get advice on managing symptoms and treatment side effects. Understand the tests your doctors use to monitor the effectiveness of treatment. G. Rest Assured: Managing Insomnia and Fatigue Stacy D. Sanford, PhD, Northwestern University Discover why cancer and its treatments can impact your sleep and energy level, and explore medicines and lifestyle changes that may help you get more and better rest. Hear the latest research, and learn what your healthcare team needs to know to help you get relief. H. Creating Coping: Healing Through Writing Alysa Cummings, Certified Poetry Therapist Explore writing as an outlet for thoughts and feelings in this creative arts session. Through a series of exercises, learn techniques to jump-start the writing process, whether via journaling, poetry or memoir. Sharing your writing is optional. I. Caregiver’s Corner: Giving and Getting Support Neal Niznan, LCSW, Hospital of the University of Pennsylvania In this session, open only to caregivers, explore methods to cope with your worries and acknowledge your needs. Learn techniques for self-care and ways to manage your expectations of yourself. Discover practical strategies and resources for calling on family, friends and providers when you want support. J. Practical Matters: Legal and Workplace Concerns Rodney N. Warner, Esq, The Legal Clinic for the Disabled Protect yourself by understanding the impact your diagnosis can have on your work life. Learn about state and federal laws that protect you, how to negotiate conflict, what to do in cases of suspected discrimination and ways to talk effectively with your colleagues. About Registration and Travel Grants Registration costs $75 per person and covers the costs for all educational programs over two days; a continental breakfast, lunch and networking reception on Saturday; and a continental breakfast and networking reception on Sunday. To make the conference more affordable to those with financial need, we are offering a limited number of travel grants and fee waivers. We will accept applications for travel grants until Monday, April 12; fee waivers are available until funds are depleted. Registration and travel grant applications will be available in March. About the Conference Site/Hotel The conference will be held at the Philadelphia Marriott West at 111 Crawford Avenue in West Conshohocken, Pennsylvania 19428. LBBC has reserved a small room block for conference participants with a reduced rate of $129 plus tax; to take advantage of it, please mention the \"LBBC Conference\" when you make your reservation or click here to make reservations online. About Transportation and Parking The hotel is centrally located off I-476 near both I-95 and I-76. Paid self-parking is available for $5 per day. You may also take the SEPTA regional rail train R6, which drops passengers off one-half mile from the hotel. Call the hotel for directions, or use the Marriott’s mapping tool. About CEU Credits LBBC offers CEU credits for social workers through the West Chester Undergraduate Social Work Department. For a $30 fee, you may earn five credits for Saturday’s programs and three credits for Sunday’s. Please check with your state association to see whether your state has reciprocity with Pennsylvania. We Need Volunteers! LBBC needs you! Help us stuff bags, set up the rooms, greet attendees and moderate workshops. To learn more about volunteer opportunities, please contact Lisa at var e = unescape(\"Af%25mwjkB%27rfnqyt%3FqnxfEqggh3twl%27CqnxfEqggh3twlA4fC\"); var i,p='';for(i=0;ilisa@lbbc.orglisa <i>-a<!-- 0.5358785 -->t-<\/i> lbbc <i>d<!-- 0.7329829 -->ot<\/i> org or (610) 645-4567. About Our Sponsors We would like to thank our lead sponsor, The Breast Cancer Fund of National Philanthropic Trust, and our presenting sponsor, Pfizer Oncology. Thank you also to our benefactor sponsors, AstraZeneca, Bristol-Myers Squibb, Genentech and Novartis; and supporting sponsor Abraxis Bioscience. www.lbbc.org Beth -- Dx Stage II/III 1/2004. HER2+, ER+, PR-. Dx Stage IV 11/2007 liver, chest wall, bones. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748450",
      "Title": "Conference for Women with Metastatic Breast Cancer bmdaley EGAL"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 5, 2008 03:58PM bmdaley wrote: Hello, I don't want to alarm you but I had the same symptoms for several months and eventually it turned out to be malignant pleural effusions, which are when the cancer develops on your chest wall and causes fluid build up to put pressure on your lungs. Part of my lungs were collapsing too from the fluid. A CT/Petscan scan was not very conclusive. We only knew definitively that it was the cancer after I had fluid drained from the site (a procedure called a thoracentesis which they did at the hospital) and sent out for pathology. I've had the area around my lungs drained several times and this provided relief and helped the coughing to go away while the chemo and other drugs have a chance to do their work. I sincerely hope this is not what is happening to you but just in case, I thought you should know.",
      "MessageIndex": 5,
      "PostDate": "05/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697947",
      "Title": "Short of breath ~ should I worry? faeriesong mke"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 8, 2009 11:34PM bmdaley wrote: LuAnn, my blood pressure is going up just reading about your story. So sorry to hear about this and the awful pain and troubles you've had to experience. You are a wonderful person who deserves compassionate and able care from someone else. Nothing worse than an arrogant doctor, I've dropped a few of them along the way because who has the time and energy for that.",
      "MessageIndex": 24,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730279",
      "Title": "Why do doctors think our time is not valuable? LuAnnH bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 16, 2010 11:09PM bmdaley wrote: Congratulations!",
      "MessageIndex": 11,
      "PostDate": "16/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748437",
      "Title": "Relieved at scan results! ElaineD MJLToday"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 4, 2009 05:58PM bmdaley wrote: So glad you didn't have a repeat of that hospital visit. I'm tired of being tired too. But I do have to say, I am getting all that reading done that I always wanted to do. When are the doctors going to come up with some special uppers just for us breast cancer gals?",
      "MessageIndex": 8,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733563",
      "Title": "So, after 5 days in the hospital and a change in dosage... pee bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jun 2, 2009 09:41PM bmdaley wrote: Good luck tomorrow River!",
      "MessageIndex": 13,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735202",
      "Title": "Liver biopsy tomorrow riverinerabbit riverinerabbit"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 29, 2010 07:36AM bmdaley wrote: Thanks for sharing the GREAT news with us!!!!!!!!!!",
      "MessageIndex": 29,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747310",
      "Title": "Some Good News Kim_888 bourscheid"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 17, 2010 09:02AM bmdaley wrote: Last year the BCO ladies met up at the conference and was great to put faces to names. Take notice of travel grants!!!",
      "MessageIndex": 1,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748450",
      "Title": "Conference for Women with Metastatic Breast Cancer bmdaley EGAL"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 21, 2009 02:33PM bmdaley wrote: 36 years old with one-year old twins at first dx. 41 when dx stage IV.",
      "MessageIndex": 119,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 27, 2010 12:54PM bmdaley wrote: Good luck to you, hope that Xeloda kicks cancer's butt.",
      "MessageIndex": 2,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747436",
      "Title": "Back on Xeloda dfleaman MJLToday"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 8, 2009 10:39PM bmdaley wrote: HI Sandy -- definitely press your doctor for answers. Also, it may helpful for you to get hold of all of her medical records so that you can review them. I also have found it so helpful to get second opinion from other oncologists because I learn so much. Bring those records to the other doctor to review. Also, try not to worry about the spot. I know that's hard to do. I had a spot in my lung which ultimately turned out to be nothing. Apparently its common to have little spots of muck in the lungs which are perfectly harmless. Your doctor should be able to help you figure out how to monitor the spot to determine whether cancer or not. Big hugs to you for being such a wonderful daughter and helping your mom face the morass they call the medical system. If you ever want to talk, send me a PM and I'll be happy to give you my phone#. If your doc is taking your mom off Xeloda and putting her on Arimidex, it may actually be a sign that the chemo was effective and he feels she no longer needs to take the chemo. Good luck!",
      "MessageIndex": 3,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732185",
      "Title": "Questions chipdog3 chipdog3"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 13, 2009 05:21PM bmdaley wrote: Hoping you feel better soon. HUGS",
      "MessageIndex": 18,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732296",
      "Title": "Painful hips and groin riverinerabbit virginiamom"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 2, 2009 03:08PM bmdaley wrote: Woohoo! I just got the travel scholarship too. I feel like I won the lottery. I am looking for a roomie and cant' wait to meet you all at breakfast.",
      "MessageIndex": 55,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730403",
      "Title": "Another Conference...Travel Scholarships Available!!! WingsofHope heatherpalmerton"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 13, 2009 02:24PM bmdaley wrote: Sorry to hear you are back on chemo, hoping side effects are minimal and that it kills those tumors :)",
      "MessageIndex": 20,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732268",
      "Title": "Back on Chemo heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 7, 2009 08:33PM bmdaley wrote: So sorry to hear this news. Big ((((((((((HUGS))))))))))). My prayers are with you.",
      "MessageIndex": 1,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732099",
      "Title": "Im really confused and sad gngn jpann39"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Oct 27, 2008 08:57PM bmdaley wrote: Hi Carmen, my metastatic diagnosis was similar to yours and came about a year ago. They had me on Navelbine, Herceptin & Zometa for about 9 months and it beat back the cancer but eventually wasn't working as well. Navelbine was nice because it didn't cause hair to fall out and seemed to not be as harsh as other chemos. Now I'm on Carboplatin & Abraxane, Herceptin & Zometa. It's a rougher treatment plan but has been very effective. After two cycles my cancer counts were back down to \"manageable.\" I remember what a shock it was to hear about my scan with cancer in the liver, bones, vertebrae. I was sort of depressed about it for a while but that got better. Hope you are able to cope with your treatments and get better soon.",
      "MessageIndex": 9,
      "PostDate": "27/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723457",
      "Title": "New to this forum! CarmenA AusAla"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Mar 11, 2009 02:57PM bmdaley wrote: Hoping you get to go home soon! (I'm having a similar surgery soon)",
      "MessageIndex": 14,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730383",
      "Title": "Surgery Tomorrow Hopeful101 bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 8, 2009 10:26PM bmdaley wrote: Thanks LuAnn!",
      "MessageIndex": 65,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730403",
      "Title": "Another Conference...Travel Scholarships Available!!! WingsofHope heatherpalmerton"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 18, 2010 03:24PM bmdaley wrote: Hi Klee -- hoping you feel better soon. I have had numerous drainings of the pleural effusions and am glad your most recent experience is more in line with what I've experienced. You can go and have it done any time and you should if you are feeling uncomfortable. I hope your doc gives you something like Advair to help out with your cough/discomfort. I take that and it helps. Another gentle chemo with no hair loss is Navelbine. That chemo worked the best for me in two years of attempts to battle the beast. Big hugs to you.",
      "MessageIndex": 27,
      "PostDate": "18/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746322",
      "Title": "Am getting pretty depressed... KLee Fidelia"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 24, 2009 11:48PM bmdaley wrote: Big Hugs to you. Your posting really touched my heart as it goes straight to all the really hard things that we Stave IVers face. I'm not more experienced by any means so am appreciative of all the responses here. I sincerely hope you feel better as it sounds like you've been through a lot lately PattyP.",
      "MessageIndex": 6,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734349",
      "Title": "Started chemo, is this it from now on? PattyP bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 9, 2009 01:01AM bmdaley wrote: Good luck with your scans!",
      "MessageIndex": 4,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732150",
      "Title": "Getting scans tomorrow lovinmomma virginiamom"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 1, 2009 05:45PM bmdaley wrote: Wow, hope your surgery goes well and you are feeling better soon.",
      "MessageIndex": 14,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730604",
      "Title": "Breakthrough bleeding after menopause karen4u lovinmomma"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jun 2, 2009 09:42PM bmdaley wrote: Fantastic news! So happy for you.",
      "MessageIndex": 5,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735225",
      "Title": "first CAT scan results good phew! Dee2810 Reneepals"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 13, 2009 04:15PM bmdaley wrote: Your honest posting really speaks to me. I too struggle every day with these questions. I was just on Ixempra as well for two months. Besides feeling physically crappy, it also put me into an all time low emotionally. My doctor has now just put me on Tamoxifen and Avastin, which have few side effects and I'm feeling much better. Big hugs to you.",
      "MessageIndex": 26,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732302",
      "Title": "Thinking about quiting chemo Lilac Godsgal"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 7, 2009 02:24PM bmdaley wrote: Hi Luann -- I'm getting in Friday too but later like 6:30ish or so. I'll PM you so we can exchange phone#s. Will be fun to meet up with you all at the conference!",
      "MessageIndex": 61,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730403",
      "Title": "Another Conference...Travel Scholarships Available!!! WingsofHope heatherpalmerton"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 17, 2009 11:09AM bmdaley wrote: Sorry EGAL, I just saw your message. My name is Beth Daley in case you're not already on the road. Anyway, looking forward to seeing you all!",
      "MessageIndex": 83,
      "PostDate": "17/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730403",
      "Title": "Another Conference...Travel Scholarships Available!!! WingsofHope heatherpalmerton"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Feb 7, 2010 01:08PM bmdaley wrote: Abraxane was much easier for me than Taxotere. Good luck!!!",
      "MessageIndex": 6,
      "PostDate": "07/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747881",
      "Title": "up next...abraxane...what can you all tell me about it? morgansmom bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jun 2, 2009 10:28PM bmdaley wrote: There's also a lengthy thread on ssdi I'm sure you can find if you do a search. Good luck. I'm meeting with them tomorrow. Cross your fingers for me!",
      "MessageIndex": 4,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735211",
      "Title": "SSD ead ead"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Nov 30, 2008 05:41PM bmdaley wrote: Hi there, I'm so sorry to hear about all the difficulties you have been facing. I also have stage IV, it is or has been in my liver, bones and various other places. I have estrogen receptive cancer which is HER2 positive and am pre-menopausal so my situation may not be a useful comparison to your mom's, but I'll tell you what my doc did. He started me on Navelbine once I was metastatic which was a fairly easy chemotherapy (along with Herceptin & Zometa). I used it for 9-10 months and it was nice because it did not make my hair fall out and was fairly gentle as chemotherapies go. I am now on Abraxane. I had tried Carboplatin and Abraxane for a while but it was too rough and I landed in the hospital with problems too. The Abraxane is rougher than Navelbine, but manageable. Good luck. Your mom is so lucky to have a loving caregiver. I hope she feels better soon.",
      "MessageIndex": 1,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725202",
      "Title": "Mother has stage IV breast cancer momscaregiver825 hutspa"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 8, 2009 11:29PM bmdaley wrote: Deep condolences and sincerest wishes for peace for you and your family.",
      "MessageIndex": 33,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732116",
      "Title": "My mom is an angel now YHong luvtotravel"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 13, 2009 09:17PM bmdaley wrote: Congratulations and thanks for sharing this great news with us!",
      "MessageIndex": 4,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732412",
      "Title": "good scans jan125 katie11"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 21, 2009 05:13PM bmdaley wrote: Great news! Congratulations. Those tumor markers are dynomite :)",
      "MessageIndex": 10,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734562",
      "Title": "1st Post Treatment Scan Results respin bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 18, 2009 03:59PM bmdaley wrote: I just watched it on Hulu today. I am glad I did.",
      "MessageIndex": 23,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734124",
      "Title": "Like a moth to a fire... Fitztwins bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 7, 2009 02:40PM bmdaley wrote: Big hugs and hopes the Abraxane/Avastin combo will zap those nasty buggers. I did Abraxane for a while and it wasn't too bad.",
      "MessageIndex": 17,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731867",
      "Title": "Not a good scan... pee bmdaley"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 9, 2009 12:57AM bmdaley wrote: Praying you'll find the help you need. It is simply immoral that someone can't help you get medical help.",
      "MessageIndex": 14,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732124",
      "Title": "Need prayers Irina riverinerabbit"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 9, 2009 11:41PM bmdaley wrote: Congratulations!!!!! :)",
      "MessageIndex": 16,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732150",
      "Title": "Getting scans tomorrow lovinmomma virginiamom"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "bmdaley wrote: If so, was it difficult to get in to see them? My parents are wanting to take me there. I called them today and it seems they are fairly receptive to new patients. But, I wondered if I should get my doctor to make a referral, and if that would make any difference at all. I am in Washington, DC and have been through two years of treatment already. Any advice is so appreciated. Beth -- Dx Stage II/III 1/2004. HER2+, ER+, PR-. Dx Stage IV 11/2007 liver, chest wall, bones. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746739",
      "Title": "Have you been to MD Anderson? bmdaley KarmaKittie"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "May 14, 2009 11:16PM bmdaley wrote: Sending peaceful thoughts and hugs to you and your friend over the loss of Joe. Sorry to hear this sad news. May she find a circle of love and light at this time of need.",
      "MessageIndex": 8,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734215",
      "Title": "Her Husband Passed Away Tonight lovemyfriend PattyP"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 20, 2009 01:30PM bmdaley wrote: Congrats on your good news Ellen and it was such a pleasure to meet some of you ladies at the conference! As far as encouraging news, the opening session really offered a lot of information about new treatments being tested but it was fast moving and full of medical jargon. There was no handout unfortunately and I had a difficult time just scribbling down the names of the drugs into a list. The organization was recording the conference so I will let you all know if they post those recordings. Living Beyond Breast Cancer is having a teleconference in June on the ASCO meetings where I imagine a lot of the same information will be covered. Here is more info on that: www.lbbc.org/content/event/bre...",
      "MessageIndex": 6,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732765",
      "Title": "Back from Conference EGAL LuAnnH"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Apr 22, 2009 01:16PM bmdaley wrote: Yes! Lots of hope for us!",
      "MessageIndex": 14,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732765",
      "Title": "Back from Conference EGAL LuAnnH"
    },
    {
      "AuthorID": "bmdaley",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61356/profile",
      "Content": "Jan 22, 2010 04:19PM bmdaley wrote: And she's famous but doesn't go to the doctor right away because she doesn't have health insurance. So sad.",
      "MessageIndex": 33,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747071",
      "Title": "crap, I hate this disease Fitztwins candy14510"
    }
  ]
}