{
  "AuthorID": "Bnbear20",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276868/profile",
  "Posts": [
    {
      "AuthorID": "Bnbear20",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276868/profile",
      "Content": "Bnbear20 wrote: Hi everyone, I've recently found a lump in my right breast, which was found due to pain in the area. I'm 20, almost 21 years old and a little worried. I went to the doctors within 2-3 days of noticing it and was send off for an ultrasound. The doctor confirmed the lump, and suggested a slight lump on the left also (I personally do not feel it compared to the right/no pain from left). She suspects hormonal reasons for the lump. The ultrasound summary of findings report \"Slightly altered ecotexture deep to the nipples more extensive on the right. This is indeterminate for developing breast tissue or a mass. Further evaluation including breast specialist opinion advised\". The area is relatively hypoechoic and measures 38 x 32 x 14mm, with no axillary lymphadenopathy. Some vascularity was found within, as well as probable small cystic space. Due to my age, I'm struggling to find any advice/experience from others in a similar situation as mine. The pain has increased since I first noticed it (about a week ago now), even with ordinary movements and sleeping (on both stomach or right side). I have a breast specialist appointment on Monday, and I'm assuming the next step will be a biopsy of the area due to the indeterminate findings. I know there isn't much more I can find out/research until further examination but the waiting is driving me crazy. I thought I would post here to see if anyone has had a similar experience to mine, as I have not been able to find any thus far. Thanks! - B. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865824",
      "Title": "Indeterminate breast findings (20 years old) Bnbear20 Bnbear20"
    },
    {
      "AuthorID": "Bnbear20",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276868/profile",
      "Content": "Jul 16, 2018 03:32AM Bnbear20 wrote: Thanks for your reply mustlovepoodles! Just had my appointment with the breast specialist this afternoon. She told me that the radiologist that wrote my report does not specialise in the area of breasts, hence why the report was so confusing. She felt the area and said that she could definitely feel a lump but thinks its developing breast tissue, yet shes not 100% sure. I have another ultrasound scheduled at her clinic in 2 months time, where she will give the results immediately after the scan, and possibility of biopsy if required on the day. I've also been told to come back if I feel the pain is worse. The pain hasn't left since I first felt it, and my right breast has gotten bigger/appears more swollen than the left. I'm still concerned about the lump as it hurts to reach/bend/lift heavy objects/sleep on, and waiting two months is going to be hard because I'm already worrying and stressing over it. So now I'm in the same situation as before, and still don't know anything. Any advice would be greatly appreciated! - B.",
      "MessageIndex": 2,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865824",
      "Title": "Indeterminate breast findings (20 years old) Bnbear20 Bnbear20"
    }
  ]
}