{
  "AuthorID": "bodynatzi",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184655/profile",
  "Posts": [
    {
      "AuthorID": "bodynatzi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184655/profile",
      "Content": "bodynatzi wrote: I had a lumptectomy in my left breast in Nov 2012 followed by 4 weeks of radiation ending mid Feb.  No problems with anything.  I just started lifting weights again on a pretty intense schedule and noticed my breast is swelled.  I just had my 6 month followup tests and all were fine. My doctor says it is most likely lymphedema from the weight lifting.  She thinks my body might adjust has time goes but if it doesn't I will most likely need massage therapy.  Just wondering if anyone else has had this happen.  Not sure if I should try to get PT now or wait.  If I don't, will it get worse or cause other problems?  Thanks for any advice. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/808113",
      "Title": "Breast swelling after lumpectomy - caused by weight lifting?? bodynatzi bodynatzi"
    },
    {
      "AuthorID": "bodynatzi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184655/profile",
      "Content": "Jan 19, 2015 12:32PM bodynatzi wrote: Thank you everyone for information. I forgot to back on this site and look! I am still working out (teaching fitness classes) and my breast is still tender. My Dr. and tests show all is well. I am going to followup on seeing someone for the LE. Life got busy and it seems that some days my breast is not as bad. It is still larger though.",
      "MessageIndex": 6,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/808113",
      "Title": "Breast swelling after lumpectomy - caused by weight lifting?? bodynatzi bodynatzi"
    }
  ]
}