{
  "AuthorID": "bondsy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
  "Posts": [
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 18, 2014 09:19AM bondsy wrote: Thank you Pam for the tip about future lung x-rays. That makes a lot of sense. I'm also having leg and foot pains post-chemo. I heard it takes an entire year before all the SE's from chemo are finished.",
      "MessageIndex": 534,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 21, 2014 01:27AM bondsy wrote: Rosie, I am also having the same problem with regulating body temperature. I am usually (pre-cancer) always hot, but these days I am always cold. I used to never need the heater on, even in winter (I live in California) but these days I'm running the heater full time. But, at night, I turn the heater off and I get really hot! It doesn't make sense at all. I'm also post-menopausal and done with hot flashes, so I'm confused by all this.  My biggest side effect so far from rads is my breast is swollen, and my nipple is so sore and painful. And the nipple color is much darker than usual. I'm taking Aleve for the swelling and pain, and that's helping somewhat. Tomorrow is day 14/25. No itching yet. Gubbyann, I love your positive attitude. I'm also trying to take it all one day at a time. I do whatever the doctors tell me to do and don't try to second guess everything. I feel like I'm just moving along, like floating on a raft in a river, and will eventually come to the end of the ride. Trying not to think of the future or the past, trying to stay in the moment is helping me get through this.",
      "MessageIndex": 569,
      "PostDate": "21/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 24, 2014 12:53PM - edited Jan 24, 2014 12:54PM by bondsy My RO told me to go ahead and start using lotions (he prefers Aquaphor) as soon as radiation treatment starts. He also said don't forget the back of the shoulder where the beam exits (the beam that is zapping the axillary lymph node near my clavicle.) I never would have thought of that! He also told me to use hydrocortisone 1% cream under the Aquaphor as soon as I start to have swelling or itching. I'm doing that now, and it's really working. I bought some cheap cotton tank tops to wear under my shirts that I'll just throw out when done because the Aquaphor is so greasy. Only ten more treatments to go. The countdown is on!",
      "MessageIndex": 646,
      "PostDate": "24/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 26, 2014 03:26AM bondsy wrote: gubbyann, I'm also told to breathe normally. Some places do the gated breathing and some don't. My RO said it wasn't necessary in my case.",
      "MessageIndex": 672,
      "PostDate": "26/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Feb 2, 2014 01:50PM - edited Feb 2, 2014 03:29PM by bondsy",
      "MessageIndex": 812,
      "PostDate": "02/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Dec 8, 2013 01:34AM bondsy wrote: I'll have my simulation appointment on Dec. 19th and will find out then when my rads will start. Just had my last chemo yesterday, so I'm thinking I'd like to start rads one month later on Jan. 6th after all the holidays. That's also going to be my first day back at work, so that should be interesting! I will do 5 weeks of rads. Thanks TeamKim for starting this new forum.",
      "MessageIndex": 10,
      "PostDate": "08/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 12, 2014 04:39AM bondsy wrote: Just finished treatment #7 out of total 25. I'm starting to have some swelling/soreness. My nipple is especially very sore and swollen. I started wearing undershirts instead of a bra! The only thing that makes this all bearable are the very nice people in the radiation department where I'm going. They all try to make the experience as pleasant as possible.",
      "MessageIndex": 417,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 12, 2014 05:23AM bondsy wrote: Holeinone, I also didn't have a mold made. Last time I was there I asked them how they know I'm in the correct position every time. They showed me the lasers that come out of the walls, one on the right and one on the left, that they line up with the tattoos they put on each side of my body near my ribcage. I was wondering why I had tattoos down there!",
      "MessageIndex": 419,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 16, 2014 04:46PM - edited Jan 16, 2014 04:47PM by bondsy I had an unbelievable experience at radiation today - I almost got locked in the radiation department overnight! I was supposed to see the doctor after my treatment, and was put in an exam room. I was so tired I fell asleep while waiting in the exam room, but the doctor never came. I woke up an hour later and the whole place was closed! Lights out and everything. I panicked because I was still in my hospital gown without my glasses or cell phone since I left them in the locker room with my clothes. I was walking around the hallways calling out for someone, but no one was there! Finally I heard a voice way down the hall, and it was a nurse who was so apologetic. She said the doctor thought he was done with patients for the day and left. She called for a different doctor to see me, then they let me into the dressing room to change clothes and then let me out to go home. The reception area was totally pitch black and the doors were locked. If that nurse hadn't been there, I'd still be there.  I cried all the way home in the car. It really freaked me out!",
      "MessageIndex": 504,
      "PostDate": "16/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 23, 2014 10:29PM bondsy wrote: Lovewins, I am not charged anything for the weekly visit with my RO. MinusTwo, thanks for the tip on the electric throw! I'll get one!",
      "MessageIndex": 640,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 26, 2014 04:48AM bondsy wrote: Thanks for the great explanation, TeamKim. I also saw pictures of my field of radiation, and saw that the heart is out of the way. Made me feel a lot more confident in the whole situation. I think my radiation facility and equipment are all fairly new.",
      "MessageIndex": 675,
      "PostDate": "26/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 28, 2014 04:49PM bondsy wrote: I'll also be done with radiation next week on February 6th. I've heard that it takes about two weeks after radiation ends for all the SE's to go away, so I figure I have another month of this terrible rash and swelling. I'm now taking mega doses of ibuprofen for the swelling, and benedryl for the itching. As for the loss of eyebrows and lashes, uggghhh, it's like adding insult to injury!! ",
      "MessageIndex": 726,
      "PostDate": "28/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 30, 2014 04:47PM bondsy wrote: Finished 19/25 today, then met with my RO. He decided to prescribe the antibiotic cream Silver Sulfadiazide which according to the insert is used \"to treat wound infections in patients with serious burns\". He also prescribed the stronger hydrocortisone ointment 2.5%. My RO said that my rash is looking like it could soon open up and become infected. He said everyone's skin is different and some people have no reaction while others have serious reactions. Just so happens that my skin is very sensitive. When I put my arms up in the little arm stirrups, the skin near my clavicle folds and the worst rash is inside that fold. Also the axillary lymph nodes that are being zapped are much closer to the neck than I realized, and the left side of my neck is very swollen and red. The breast/nipple swelling is also pretty serious. This is all much worse than I ever thought it would be. I didn't think anything could possibly be worse than the chemo side effects, but this is coming close. I'm dreading my last 6 treatments.",
      "MessageIndex": 769,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Feb 14, 2014 01:15PM bondsy wrote: I use Aquaphor only at night and then wear old t-shirts to bed that I plan to throw out after my skin clears up. The denseness of Aquaphor lubricates my skin and helps me sleep. During the day I use miaderm and the prescription antiobiotic burn cream \"Ascend\" (silver sulfadiazine) which the RO prescribed when my skin started getting severely burned. I'm now one week post-rads and my skin has blistered and is peeling. Very very sore under my armpit, my clavicle area, and nipple. It's not easy going to work every day with this underarm pain, but I'm loading up with ibuprofen.",
      "MessageIndex": 1002,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Dec 21, 2013 03:20PM bondsy wrote: I had my CT/simulation yesterday, and it went very well. I'll start rads on January 2nd. I was surprised to hear from the RO that I'll be having both my lumpectomy site and my axillary lymph nodes radiated. I didn't realize I'd have the nodes zapped. He said it's because I only had two sentinal nodes biopsied and one had cancer cells, so he wants to radiated the other nodes that weren't removed in case there is cancer in them. Anyone else having their nodes radiated too? Will this increase my chances of getting lymphedema or cause any fibrosis type issues?",
      "MessageIndex": 164,
      "PostDate": "21/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 17, 2014 04:42AM bondsy wrote: Thank you everyone for your comments about my scary experience yesterday at my radiation appointment. I plan to talk to the head of the radiation department today about it. It really threw me off and made me leery of this whole radiation experience. And yes, MinusTwo, I did have chocolates when I got home, but no wine even though I would have loved that (still have a weak stomach after chemo, and alcohol just doesn't agree with me.)  Checkers, I completely understand how you must have felt yesterday. We are all so vulnerable in this crazy cancer world, and our service providers all need to be trained in how to help make us feel better about the situation. There's no excuse for how they made you feel. And I hate that we are put in the position of having to complain to higher ups about our experiences, as it just makes us feel even more vulnerable.",
      "MessageIndex": 511,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 17, 2014 05:34PM bondsy wrote: I spoke with the manager of my radiation center today, and she was horrified about my experience yesterday. She said they have a policy to check the rooms every ten minutes, but since I was the last patient that day they messed up. She was very apologetic and plans to have a department meeting to go over procedures so that it won't happen again.  I had treatment #11/25 today. Skin is holding up, but my nipple is very swollen and painful. The RO I finally saw yesterday told me to take Aleve for swelling & pain. That helped a bit today. Last week when I saw my regular RO, I asked to see my radiation field pictures that they created from my simulation CT. He brought them up on the computer and I was able to see where my heart and lungs are located in relation to the rays. My heart is out of the way of the rays, but one little corner of my left lung is being zapped during radiation. He said there would probably be some scarring on that area of the lung, but since I'm not a smoker and have otherwise healthy lungs it shouldn't be a problem. I am glad I asked to see the pictures, but feel that he should have automatically showed them to me and explained about the lung even if before I asked. I think that's something we should be aware of, don't you?!?!",
      "MessageIndex": 525,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 22, 2014 01:04AM bondsy wrote: I had treatment #13/25 today. Developed a dark red bumpy rash yesterday near my clavicle where the axillary lymph nodes are being zapped. It feels like it's on fire. My nipple is also so incredibly sore. I'm back at work 3 days a week until rads are over. I wear a bra to work, then go to treatment after work, then I leave off the bra after treatment and put on a tank top. The bra is getting uncomfortable, so I've been wearing tank tops instead of bra when not at work. Can't wait for this all to be over!",
      "MessageIndex": 592,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 23, 2014 04:15PM bondsy wrote: Still having trouble regulating my body temperature. Last night I woke up shaking with serious chills, even though the temperature in the house was fine and I had a down comforter on. I took my temperature and it was 96 degrees. I had this problem during chemo also, where I'd get very low body temperature the day of or day after chemo. which lasted a couple of days. Now it's happening with radiation. Any ideas?",
      "MessageIndex": 625,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 31, 2014 11:56PM bondsy wrote: Congratulations, Lana! I'll be joining you next Thursday! Saw my MO today and received my prescription for Arimidex, which I'll start taking after radiation ends next week. She said I should give myself a few days in between just for a little break. I love my MO, she's so understanding and explains things so clearly. After every visit she gives me a big hug and tells me how good I'm doing. Today I was kind of an emotional wreck when I saw her and started crying out of nowhere. She said it's normal, and many cancer patients get very emotional and feel kind of lost when all the treatments start to end. Anyway, she also said don't be surprised if the fatigue and rashes get worse for a week or so after radiation ends before they start to get better. Yippee",
      "MessageIndex": 803,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Feb 10, 2014 04:30PM bondsy wrote: simply poise, I finished rads last Thursday, and started on Arimidex today. I also did the bone density test which showed that I have strong bones. My oncologist said that if the bone density test wasn't good then I'd do tamoxifen instead. Praying for minimal side effects from the arimidex!",
      "MessageIndex": 926,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 23, 2014 05:41PM bondsy wrote: Thanks, aeryno. My problem isn't hot flashes, but the opposite. I get \"cold\" flashes and low body temperature. I also get those chills and shivering fits! Anyway, I'm going in today for radiation treatment #14/25 today, so over half way done. I finally lost my eyebrows this week, and the eyelashes are thinning. It's been 7 weeks since chemo ended and my hair is starting to grow back, so losing my eyebrows now was a total shock. I'm not happy!",
      "MessageIndex": 631,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 25, 2014 01:00PM bondsy wrote: sbp1952 - I am teaching (kindergarten) three days a week while I go through radiation. I probably could have gone back to work full time, but I'm still recovering from chemo so I wanted to have an easier load. I am worried about going back full time though, because I've heard that the fatigue is actually worse right after radiation stops. But working full time is definitely doable with rads.",
      "MessageIndex": 663,
      "PostDate": "25/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 30, 2014 01:55PM bondsy wrote: Thank you everyone for commiserating with me about my skin issues! It helps to have your support. Today I noticed that the rash is now spreading to under my armpit. I hope that new prescription antibiotic cream starts to work soon. Junipergirl - my treatments are all whole breast with the boosts built in. Not sure why they are doing it that way.  TeamKim - I have those little bumps over my entire breast area now. Just got a call from the radiation facility that they would like me to come in an hour and a half earlier today due to maintenance that they have to do on the machine. Good thing I'm just working part time right now, so my schedule is flexible. After today only five more to go!!",
      "MessageIndex": 777,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Feb 6, 2014 02:09PM bondsy wrote: Lilyluv - my nipple also turned yellow when cold! But that's all in the past now that I'm doing radiation because my nipple is so swollen and dark. It's very sensitive. My RO recommended I cut up an old cotton t-shirt (a soft one) into squares and put it under my tank top to protect my nipple (either that or a gauze pad, but I tried the t-shirt and it's a lot softer than gauze.) I'm also putting the cut up cotton squares under my armpit now because it's very painful when skin touches skin. My skin has taken a turn for the worst. But today is my last radiation day, so let the healing begin!",
      "MessageIndex": 869,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Feb 7, 2014 06:03PM bondsy wrote: lonnie, I went back to work part-time a month after chemo and worked three days a week during radiation. Now that I'm finished with rads (yesterday!!) I will start back to full time next week. My radiation appointments were at 4:30 pm every day, so I left work at 4:00 and went to radiation on my way home. It was totally doable. Dawn, it's good to hear that your skin and fatigue were better by two weeks after rads. My skin is so bad right now, and I'm so looking forward to the healing! My boosts were built in to my total 25 radiation treatments. I had whole breast and \"boosts\" each time. I start on Arimidex on Sunday.",
      "MessageIndex": 892,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "May 25, 2014 12:45PM bondsy wrote: Hello all, It's been about three and a half months since my radiation ended and I'm having some serious pains in the area under my arm and on the side of my breast. My range of motion is also very limited now. Anyone else having this pain? It started about a month ago. I'm doing some arm exercises, like making large circles with my arm, which seems to help a bit.",
      "MessageIndex": 1549,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "May 26, 2014 06:31PM bondsy wrote: Thanks for your post, MinusTwo. Good to know that my pains are normal, but not fun to know they could last two years! I'll try light weights, too. ",
      "MessageIndex": 1552,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Dec 8, 2013 12:28PM bondsy wrote: Does anyone know if the CT/sim machine is confining like an MRI? I'm extremely claustrophobic and am a little worried about that.",
      "MessageIndex": 15,
      "PostDate": "08/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 12, 2014 05:25AM bondsy wrote: P.S. I also just read in the local newspaper that radiation technicians in the San Francisco Bay Area make over $100,000 salary per year, which to me means they have to be highly trained and highly skilled. That gave me a little hope that they know what they're doing.",
      "MessageIndex": 420,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 22, 2014 11:36PM bondsy wrote: Congrats, Moving Forward! I have 11 more rads to go. I haven't heard about the massaging either, but thanks for letting us know about it. It makes sense. I'll ask my doctor next week. Today when I went in everyone was so nice to me and so apologetic about forgetting me in the exam room last week. They all apologized so many times. All is forgiven.",
      "MessageIndex": 611,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 30, 2014 03:00PM bondsy wrote: Holeinone - I like your description of \"the emotional roller coaster of all the treatment\".  It has been a non-stop dizzying roller coaster ride since the end of August since I was diagnosed. From biopsy to shock and denial to surgery to chemotherapy to radiation and soon to hormone therapy, without any time in between to think about anything other than cancer. And for those who had BMX, add in the TE's and fills and exchanges. Not to mention all the various side effects with each stage. I imagine that even when the treatments are over, it'll be a while before the roller coaster finally comes to a stop. Lots of recovery time ahead.",
      "MessageIndex": 780,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "bondsy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186240/profile",
      "Content": "Jan 31, 2014 12:35AM bondsy wrote: Rosecal, I needed to hear that things get better, so thank you. TeamKim, I can't believe that about the bumps! Geez!",
      "MessageIndex": 787,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    }
  ]
}