{
  "AuthorID": "bonemetsfig…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194833/profile",
  "Posts": [{
    "AuthorID": "bonemetsfig…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194833/profile",
    "Content": "Jun 27, 2014 05:20AM bonemetsfighter wrote: dear stella, I know what it is to live wth the pain of bone mets. And like you rightly said, it is not death that we are scared of but the worry of how loved ones will cope. People will tell you different things and ways in which to cope. But the bottom line is that we are all on our own. We all have to get our own answers. Sometimes we may not get them and we feel depressed.it is ok to feel depressed since God knows we have enough reason. I hate it when people call me brave and admire me for the way I am coping and all that. This is because only my loved ones and I know the effort it takes me to go from one day to the next. Be kind to yourself. You cannot fix everything. None of us can and I just go from one day to the next. It helps to talk to childhood friends at times. Some of us can only talk to strangers on online forums since all of us are trying to share our burden with each other. In and outof hospitals. Confined to bed with pain. Well meaning relatives and friends hovering around all the time with well intentioned and oft repeated and many a time impractical advice. It is enough to get anyone down.  I am trying to make a list of all the good stuff I want to do with my family so that I can leave some good memories for them. Regarding the financial worries too, that is understandable. But god has his ways. In hindu philosophy we believe that everyone is born with attributes that surface when faced with adverse circumstances. Believe me, your family, bound by love, will learn to take care of itself. At least that is the thought that keeps me sane.  Our job is to get from one day to the next.",
    "MessageIndex": 6,
    "PostDate": "27/06/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822323",
    "Title": "Pain pain pain stellaratovsky bhd1"
  }]
}