{
  "AuthorID": "Bonitaj",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
  "Posts": [
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Bonitaj wrote: Hello Everybody.. Today I had my regular visit with my Onc.. I call him Dr. E.. We danced our Happy Dance..!! My latest scan shows my meds are continuing to work on The Beast..!! Who knew .. when they told me that I had Stage IV Breast CANcer w/ two (2) tumors 2cm each in my left breast, liver mets, bone mets to the pelvis and spine.. invasion to lymph and vasc. systems.. When we cancel my pre-surgery chemo.. the surgeries for my mx/port.. No Chemo/Rad. AFTER..  (We didn't see the point of my going through all this..) Who knew that after taking '1' pill a day.. for the last 6 months, I would move from this to 'NED'..!! Who knew my doctor and I would be dancing our 'Happy Dance of Life..' Results of my last scan.. are Neg..!!  NED.. !!!! My Onc.. said to me.. Go..!! I am happy with you..!! See you in three months.. I am a happy girl.. I am slowly.. thanks to you my sister/friends here on BCO, my family, my friends, my Med. Team and my 'Faith in God.. relearning to Live my Life.. again The Beast.. will not steal............ My Joy..!!!! I DO NOT KNOW WHAT THE FUTURE HOLDS FOR ME.. BUT I KNOW WHO HOLDS MY FUTURE.. SO AS I LIVE MY LIFE.. I WILL LIVE IT TO THE BEST OF MY ABILITY.. APPRECIATING EVERY MOMENT.. EVERY SUNRISE.. EVERY SUNSET.. AND ALL THE WONDERFUL THINGS THAT COME BETWEEN.. TAKING NO ONE NOR ANYTHING FOR GRANTED.. ((((HUGS)))))) TO ALL MY SISTERS.. FROM OTHER MOTHERS.. SENDING MY LOVE AND PRAYING FOR US ALL.. I PRAY THAT 'NED' BECOMES OUR BEST FRIEND FOR MANY YEARS TO COME AND THAT WE DANCE TILL THIS LIFE IS DONE.. Bj THIS IS A QUOTE I STUMBLED UPON..  I THOUGHT IT FITTING FOR US ALL.. If the fear of cancer keeps you from moving forward, enjoying life, being with loved ones, laughing, then the cancer won, even if it never comes back. But if you reclaim your life, then even if the cancer comes back, it didn't win, because YOU, the PERSON, survived. Lisa Weissmann Dx 8/9/2013, IDC, 2cm, Stage IV, Grade 3, mets, ER+/PR+, HER2- Hormonal Therapy 9/10/2013 Femara (letrozole) Hormonal Therapy 10/1/2014 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818804",
      "Title": "Who Knew..?? Latest Scans, NED..!! Bonitaj justjudie"
    },
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Bonitaj wrote: Hey Everyone.. I have just started taking Anastrozole. I am also taking Morphine 15mg tabs. I have had some headaches.. but not often. Now I having headaches everyday. I am wondering if it has something to do woth the new med. or maybe the Morphine. Looking for some help.. or advice.. These headaches are really bothersome.. ((((Hugs))))) to all.. Praying for everyone.. Bj Dx 8/9/2013, IDC, 2cm, Stage IV, Grade 3, mets, ER+/PR+, HER2- Hormonal Therapy 9/10/2013 Femara (letrozole) Hormonal Therapy 10/1/2014 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825135",
      "Title": "Taking Anastrozole Having Headaches..!!! Bonitaj Bonitaj"
    },
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Oct 8, 2014 09:19AM Bonitaj wrote: Thank you Beloved BC Sisters.. Thank you, for your feedback, caring and sharing.  GG27 .. aka GG, thanks for your info. I have a major sensitivity to Codiene.  In the past it has caused respiratory distress.. So, naturally my doctors, nor I want to take chances. The morphine works.. some of the other meds either didn't or they caused stomach pain/or made me very sick to me stomach aka severe nausea. Dearest Moderators .. thank you for the link and your guidance. I really appreciate your help, this blog and the BC.org website. MusicLover .. always great to hear from you and all our BC Sisters.. thank you so very much for taking the time to respond..  It always help to know someone cares.  Sending my love (((HUGS)))) and prayers going up for all of you and yours, Bj .",
      "MessageIndex": 4,
      "PostDate": "08/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825135",
      "Title": "Taking Anastrozole Having Headaches..!!! Bonitaj Bonitaj"
    },
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Oct 14, 2014 04:07PM Bonitaj wrote: Thanks for the info... GG..    Headaches are all gone. Happy days.. Heat Waves... are out of this World... !!!  Oh well..  Hope everyone is having a good week..  Love  and   ((((Hugs)))) to all, Bj",
      "MessageIndex": 6,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825135",
      "Title": "Taking Anastrozole Having Headaches..!!! Bonitaj Bonitaj"
    },
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Sep 21, 2014 05:37PM Bonitaj wrote: OMG..!!! You guys (Beautiful People.. aka Ladies) are just Awesome..!!!! I send my prayer up for all of us and our families, daily. Thank you All for your Amazing Words.. Thank you, raro  and car2tenn .. for sharing your personal stories and advice. It is very comforting and helpful. Thank you so very much.. this has deeply touched my heart and filled my soul with Joy. I have been very Blessed to have my Dad this long. Even though it is never enough time.. when it comes to being with the ones you love.. Thank you to everyone for the ((((Hugs)))), love, caring.. and prayers for my Dad and myself..  liljohnnysmommy,  Nel , TheDivineMrsM..,   lurkingnomore ,   Heidihill , redwolf8812, nbnotes and barsco1963.. my love to you all and yours, Thankful and Grateful to God and for All of you,  (((((( Big HUGS))))) to all,  Bj   ",
      "MessageIndex": 15,
      "PostDate": "21/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824721",
      "Title": "Ned.. has left the Building..!!! What will be next..!!! Bonitaj nbnotes"
    },
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Sep 22, 2014 04:00PM Bonitaj wrote: Update: Well my Onc Dr. E. called me here at home, a little earlier. He explained that he had spoken to my Primary  Phys.,  Dr. C. and that he knew I had been told there was progression. He explained to me the areas that had been affected or had more spread.. They included,  my Cervical nodes (neck area) , Mediastinal nodes  (chest area), Axillary nodes (underarm), elbow, tumors in left breast and finally left iliac bone (hip) as seen a couple of months ago on my last MRI. Ned.. has Definitely moved on..!!!! Wow..!!!! CANcer is being a Real Beast..!!!!! So we will Dr. E, myself and my team will meet on Tuesday the 30th.. to figure out our next moves..!!!! As you Ladies well know.. my head is doing a little spinning.. and I am jumping up and down on the beast.. (in my head, anyway Lol..) I know not what the future holds.. BUT I KNOW WHO HOLDS MY FUTURE..!!!!!!   MY FAITH IN GOD IS AS BRIGHT AS THE SUMMER SUN..!!!! I THANK GOD FOR WHO HE IS TO ME.. AND I THANK HIM FOR EACH AND EVERYONE OF YOU, MY BCO SISTERS.. I WISH WE HAD MET UNDER DIFFERENT CIRCUMSTANCES.. BUT SO GLAD WE HAVE ONE ANOTHER.. PRAYING FOR ALL AND SENDING MY LOVE AND (((((((((((BIG HUGS))))))))))) TO YOU ALL.. Bonitaj I CAN'T stop..!!!!! I WON'T stop...!!!!! as my little friend and 5 time.. Dx. Strong and Beautiful Lil Friend, Khyrstin (Kyssi) Andrews (Age 5) says.. #WeRGonnaKickCANcer'sButt...!!!!!!",
      "MessageIndex": 19,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824721",
      "Title": "Ned.. has left the Building..!!! What will be next..!!! Bonitaj nbnotes"
    },
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Nov 10, 2013 08:40AM Bonitaj wrote: Hello Lifelover.. I am not Stage 3.. but I came across your post and I thought that I should say something about how having BC.. makes you feel.. I have very similar worries and fears as you do. I am sure we all have them.. Having BC.. isn't something I ever thougth I would experience. It is very difficult at best..!! I don't have the answers to your medical concerns.. but, I have decided to give myself permission to have my feeling.. Sometimes I roll around in them.. then I pick myself up and do everything I can for myself and for those around me.. That's when I feel better. Thats when I feel my strongest.. I pray and ask God to help me fing the strength to Live...!! To Live Well.. and to know that I am Blessed, to Live..!! I am praying for you, your family and All f us here and our families.. God Is Able to Keep us..!! Do All you can and Let God do the rest.. xoxoxoxo... Bj",
      "MessageIndex": 2,
      "PostDate": "10/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/814313",
      "Title": "Need a Bit of Support (Worrying) lifelover lifelover"
    },
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Bonitaj wrote: To All my  Beautiful BC Sister/Friends and their Beautiful Families, here.. Yes, Ned has gone on vacation.. But, she stayed for a good while. So I figure it's time to redecorate.. and send out another flyer. This will show Ned how much I have enjoyed her stay. So she will return for another even longer stay. I had my Latest Pet/CT.. on last week and there is evidence of spread..  The Beast.. is on the move.!!!! I will be going in to see my Onc.. Dr. E. on the 30th of this month. I am very grateful for this year long run with Ned. Since being diagnosed with Stage IV BC last year my only treatment has been taking Letrozole. Since this is my first treatment med. I have at least '2' more chances for success with the hormone therapy meds. My biggest problem during this year has been pain management (I AM ALLERGIC TO CODEINE.).. My energy level has been extremely low and my Heat Waves have been of the charts.. I really can't complain.. No surgery.. No Chemo.. etc..!!! I consider that a Big Blessing..!!! Also, about 10 days ago my Dad.. was admitted to the hospital with chest pains. He is 83 years young and continues to beat the odds.. He has had 2 heart attacks in his lifetime, high blood pressure, vascular disease, surgeries and suffers from Dementia With Lewy Bodies.. (mind you he has already beaten the 5 year life span by 3 1/2 years..). However, he now has 80 to 90 % blockage in his coronary arteries. He is unable to endure.. nor does he want to.. go through Heart Bypass Surgery. Nor is he able to do deal with the Cardiac Rehab that would follow. So we are praying for his comfort and that he enjoys as much of life as possible. I have been blessed to have my Dad for so long. Thanking God for All of you and for All Things He has planned for my life. I ask for prayers for my Dad.. Please pray for me everyone. I will continue to pray for all of you.. I am so grateful that we have one another to care, share, support, pray for, complain to, ask questions of, express our fears to, be hysterical with, laugh, joke  and love on each other. You are all Awesome..!!! God Bless and Keep you and yours.. My love to all, Bj   Dx 8/9/2013, IDC, 2cm, Stage IV, Grade 3, mets, ER+/PR+, HER2- Hormonal Therapy 9/10/2013 Femara (letrozole) Hormonal Therapy 10/1/2014 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824721",
      "Title": "Ned.. has left the Building..!!! What will be next..!!! Bonitaj nbnotes"
    },
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Sep 20, 2014 02:57PM Bonitaj wrote: Thank you so much Dearest Moderators .. MusicLover .. and Bestbird , It really is good to know that we are here for one another.. We didn't ask to become members of this club.. But since we are, it's a Beautiful and Amazing Blessing to have you, my BCO Sisters.. to Stand Strong in Hope, Faith and SWAG..!!!! (Saved With Amazing Grace..!!!!!!)  #PinkSWAGLadiesClub..!!!!!  Inc. President and Founder: Bonita L. Jordan (Illinois)",
      "MessageIndex": 4,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824721",
      "Title": "Ned.. has left the Building..!!! What will be next..!!! Bonitaj nbnotes"
    },
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Jan 7, 2014 01:08AM Bonitaj wrote: Hi Katie I am still a new kid on the block so to speak. I am glad to hear you are doing well.. I pray your WBR goes well and that any side affect are minimal and that you are living and loving life for many,  many years to come. God Bless and Keep you. Bj Sending you BIG HUGS AND MUCH LOVE",
      "MessageIndex": 47,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816382",
      "Title": "I now have multiple brain mets. So scared! Please help! cmhartley MusicLover"
    },
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Jul 24, 2014 09:41PM Bonitaj wrote: To Nicole, Kazzie61 Beloved Husband, family and friends.. My family and myself are praying for you all. We are truly sorry for the lost. CANcer is A Beast..!! That we need to Rid our world of.. I Pray and try to help work to find the cure for All CANcer.. I smile Nicole, for you that you were able to share your Mum's.. final moments in this life, with your Dad. My Faith tells me that we shall see our loved ones again. May The Spirit of God, comfort you all.. The love of God, Embrace you and May the Memories of her and the love she gave..  always be fresh In your minds and hearts.. to keep you at Peace... A BCO Sister/Friend, Bonitaj and family Note: Kazzie61.. God had taken you from this place.. From the pain and sickness.. from this Journey, none of us wanted to take.. Seems to me you traveled, well.. and you are now Sent FREE..!!  CANcer Did Not Win..!!!  When our time is done.. We will say this prayer to God.. For The Families..  ",
      "MessageIndex": 35,
      "PostDate": "24/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822927",
      "Title": "Latest news on Kazzie61 chrissyb Annie62"
    },
    {
      "AuthorID": "Bonitaj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187979/profile",
      "Content": "Jan 15, 2014 04:08AM Bonitaj wrote: HI Mzmerz..  I am another newbie, but when it comes to your health, stress and all.. your financial benefits.. etc.. you should do what is best for you. We didn't get any say about traveling this road, But we can do the things that are possible. It sounds like a situation.. where I would do a pros and cons list.. Short walk to work/ pro..!! Crazy Sup/Con..!! my best to you and as Terri said, be careful to make sure how everything works and deadlines and such.. Hope and pray all goes well. Bj",
      "MessageIndex": 7,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816858",
      "Title": "My weird messy situation Mzmerz tasha_111"
    }
  ]
}