{
  "AuthorID": "Bonski68",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185030/profile",
  "Posts": [
    {
      "AuthorID": "Bonski68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185030/profile",
      "Content": "Apr 8, 2015 12:30AM Bonski68 wrote: I've been part of the Stage IV community since my dx date on 17 Mar 14. It still hasn't sunk in. I have so many things to do for my kids' keepsakes but also suffering from depression, anxiety and fibromylagia. My husband and I are currently going through a divorce (should be finalized on 8 May). My 3 kids (My boys are young adults and my daughter is 16) live with their father in the in the UK (he's Active Duty military). My daughter wants to come live with me, but I don't know know if I can give her the support she needs (she is also depressed and has learning disabilities :(",
      "MessageIndex": 646,
      "PostDate": "08/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Bonski68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185030/profile",
      "Content": "Mar 22, 2015 05:00AM Bonski68 wrote: thanks to those who have replied....I'm new to this so I'm thankful for every bit of information",
      "MessageIndex": 1510,
      "PostDate": "22/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bonski68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185030/profile",
      "Content": "Apr 1, 2015 06:10AM Bonski68 wrote: Penny, I'm so sorry to hear about the news. Sending you hugs!  Bonnie",
      "MessageIndex": 1556,
      "PostDate": "01/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bonski68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185030/profile",
      "Content": "Apr 1, 2015 06:07AM Bonski68 wrote: Cathy, You are not alone! I take Klonopin for anxiety, Effexor for depression, and Trazodone for sleep. I've tried other sleeping meds but they only worked for about 4 hours (I have problems falling and staying asleep). Unlike before, when I could make decisions with no problem, it now takes me a long time and I change my mind a lot...even for simple things. Even writing this takes me longer because I keep deleting and rewording things....I think it's all stress related. I found out about my liver mets recently too. Just curious, how big and how many lesions do you have and what kind of treatment are you getting? Bonnie",
      "MessageIndex": 1555,
      "PostDate": "01/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bonski68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185030/profile",
      "Content": "Mar 19, 2015 08:10PM Bonski68 wrote: All, thanks for your support! Penny, I'm heading there next :)",
      "MessageIndex": 5,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829622",
      "Title": "Newbie with Stage IV to the liver Bonski68 nancyh"
    },
    {
      "AuthorID": "Bonski68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185030/profile",
      "Content": "Mar 27, 2015 09:00PM Bonski68 wrote: I posted a couple weeks ago, but I'll summarize and add what's new. I had an abdominal scan last month that showed the lesions in my liver have grown. They both are quite small, 1.4 cm each and the biopsy confirmed Breast cancer mets to the liver. My oncologist's recommendation is cyberknife treatment and I already had my first appointment with my radiation oncologist and now am waiting to have gold seeds implanted into my tumors. My tumors also changed from Estrogen+ to triple negative. My oncologist is not recommending chemo....said that there have been studies that show its not effective and only makes the person suffer. It's not like I'm looking to feel miserable again, but I want to have a better chance to keep the mets from returning if cyberknife is successful. -Are you told what grade your tumor is or does that only apply to the primary cancer? -Who has had cyberknife treatment and how effective was it? -Should I get a second opinion regarding chemo or has someone else been told that chemo isn't effective? -How do I get a second opinion (if I chose to get one)? Does it cost anything or is it covered by insurance (I have Tricare Prime) -Has anyone gotten a prognosis? My oncologist said that cyberknife can cure me....I'll still be officially stage IV but it was caught early. I have read multiple times that life expectancy doesn't matter if mets has been found early or if you become symptomatic, a reason why they don't do regular scans. -For those of you that are NED, do you get regular scans now or is it back when you were 'cured' with your primary and only get scans if you are symptomatic? -Is anyone aware of a facebook support group? I find fb to be much easier to keep up with. Sorry for all the questions, I hope someone can help me out with some of them. Bonnie",
      "MessageIndex": 1526,
      "PostDate": "27/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bonski68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185030/profile",
      "Content": "Mar 31, 2015 11:10AM Bonski68 wrote: Thanks JFL, but I'm in my mid 40s now and don't want to join a group that is not within my age group. I guess there is a reason they have an 'under 40s' group. I do appreciate your reply :) Bonnie",
      "MessageIndex": 1546,
      "PostDate": "31/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bonski68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185030/profile",
      "Content": "Bonski68 wrote: I finished treatment (rads) last year. I moved from the UK to the U.S. and they wanted to do a baseline PET scan. The radiologist found something faint and I had an MRI which showed two small lesions. I had another MRI a couple months later and the lesions grew so I had a biopsy which showed Breast cancer cells. My oncologist suggest eradicating the lesion with cyber knife and then follow up with him in a month and do a repeat MRI in 2 months. Just checking to see if that's the protocol of anyone going through similar circumstances. I'm scared because one of the lesions is right by my lungs and since its in my liver it's in my bloodstream Dx 8/1/2013, IDC, 2cm, Stage IIB, Grade 3, 1/21 nodes, ER+, HER2- Chemotherapy 8/21/2013 Cytoxan (cyclophosphamide), Ellence (epirubicin), Fluorouracil (5-fluorouracil, 5-FU, Adrucil), Taxotere (docetaxel) Surgery 12/26/2013 Lumpectomy: Right; Lymph node removal: Right, Underarm/Axillary Radiation Therapy 2/26/2014 Breast Hormonal Therapy 3/24/2014 Femara (letrozole) Hormonal Therapy 6/19/2014 Aromasin (exemestane) Dx 3/17/2015, IDC, 1cm, Stage IV, Grade 3, 1/21 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829622",
      "Title": "Newbie with Stage IV to the liver Bonski68 nancyh"
    },
    {
      "AuthorID": "Bonski68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185030/profile",
      "Content": "Mar 19, 2015 07:22PM Bonski68 wrote: Im new here in this group, recommended by penny. I was dx with mets to the liver on Tuesday and oncologist wants me to have cyberknife ASAP. He thinks that can eradicate the two small lesions, but the cancer will always be in my body since it spread??? Has anyone else had Cyberknife? I'd like to know what to expect.... My full pathology came back today and I'm no longer estrogen positive. My oncologist did say that they are retesting HER2 (not sure why), other than that, he thinks I'm triple negative now and told me it's no longer necessary to keep taking my Aromasin.",
      "MessageIndex": 1503,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    }
  ]
}