{
  "AuthorID": "Boo307",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
  "Posts": [
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "Jan 10, 2010 03:41PM Boo307 wrote: faithfulc, I had Taxotere and Cytoxin as well.  I found a lot of help on the discussion boards to prepare and all went well.  I also had a port. My number one goal was to take all reasonable steps to reduce the risk of the cancer metastizing.  In addition I made decisions based on understanding the longterm negative side effects.  Because the short term side effects are \"short term\", I ignored them in my decision making.  Because I could reduce the risk of cancer returning with minimal likelihood of bad long term side effects, I never debated whether to have chemo or not.  The wait period between chemo and radiation is often 4-6 weeks, but ask your oncologist.  Betsy",
      "MessageIndex": 3,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746241",
      "Title": "Chemo after lumpectomy and possible reexcision? faithfulc Boo307"
    },
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "Sep 3, 2008 05:41PM Boo307 wrote: NancyD.  I've had four treatments so far and also wondered about the number of treatments and met with the radiologist yesterday, first time since the initial consultattion last May!  He gave me the total dose (4680 cGy) divided by 26 fractions (180 cGy) per day, then boost of 1400/7 fractions (200 cGy) per.  So that is a total of 33 with a second planning session after a month to adjust the number of days based on the actual dosage I have received to date. Regarding lymphodema, he told me there are three levels of nodes; 3 under collar bone, 2 lower, and 1 the lowest.  He said the higher the node the greater the risk.  I am having the lowest level nodes hit, so he said I unlikely will have an increased risk. I have had to work at extracting answers to my questions and my radiologist is definitely not a teacher.  His nurse gave me a copy of \"Radiation Therapy and You\" by the National Cancer Institute that was very helpful.  http://www.cancer.gov/cancertopics/radiation-therapy-and-you/allpages What sources have others found informative?  Betsy",
      "MessageIndex": 68,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "Aug 31, 2008 03:41PM Boo307 wrote: Hello ladies, I'm also just started radiation.  I had my first two treatments last week and now have a three day holiday.  I have bilateral treatments, so twice the adventure.  So far so good, although after my first treatment, my left nipple has been more sensitive since the sentinel node biopsy/lumpectomy/re-excision.  Immediately after being zapped, I felt a twinge.  Not a good start.  I expected to have no effects for a couple weeks.  I was told all I could use was 100% Aloe Vera and Aquaphor and they are so soothing. I found some great cotton jersey sports bras at Wal-Mart, 3/$9.88.  I bought two sizes larger than normal and they are so comfortable.  Cotton covers the elastic and fabric covers the mammary fold, so no skin on skin.  It's great to have a a fresh one to change into if it gets sweaty and damp.   It is great to have bras that I don't care about getting greasy with the Aquaphor. Hope you are all have a good Labor Day weekend. Betsy Dx 3-18-08 Left IDC,1.8 cm Stage, 1 Grade 3, node 0/1, ER-/PR-/HER2+ -  Right DCIS  ER+/PR- Bilateral partial mastectomy - Chemo TC x4 - Herceptin 1 year - Radiation Tx 33",
      "MessageIndex": 37,
      "PostDate": "31/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "Sep 7, 2008 08:02PM Boo307 wrote: I was really confused about all my tattoos, 12 for bilateral treatment of four fields, so I asked the techs.  I couldn't imagine what they were all used for.  The techs were so nice and patient in explaining each one.  They said the ones half way down my sides are the \"leveling\" tattoos.  Lights come in from each side of the room and they line up the tattoo on my sides so I am at exactly lined up on the table.  Then they put a Styrofoam block on the table where I lay and I saw all the lights hitting it!  They line one light from the machine up with my chest center dot, and then slide the machine over and center the machine on the tattoo in the middle of my breast by the nipple.  Then they shine the lights on the radiation field and line it up with the two chest center tattoos and the two on the upper side of my chest.  With that they hit exactly the same area every time. I thought the tattoos where to outline the radiation field, for treatment use and future reference.  I couldn't figure out why I had them elsewhere as well.  Once I saw the Styrofoam lit up it all made sense! I hope everyone has a comfortable week. Betsy",
      "MessageIndex": 99,
      "PostDate": "07/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "Sep 7, 2008 08:20PM Boo307 wrote: I found in my closet aloe that I had bought a while ago, Aloe 99.  It is 99% Aloe Vera.  I can't find it locally, but it is available various places online. Betsy",
      "MessageIndex": 100,
      "PostDate": "07/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "Nov 21, 2010 01:52PM Boo307 wrote: Thank you so much for all the informative comments.  Yes the Port-A-Cath shows up on the new scanner.  I didn't know what it was when I was selected to go into the booth with no door knobs on the inside.  When I came out the TSA asked me what I had in my right chest pocket as he looked at my knit top with no pocket.  I pulled back the neckline to show him my port and explained that I had it for chemo.  He seemed grossed out or at least quite surprised.  I had no idea the scanner would show a detailed image of my naked body at the time.  It is sickening now to think of it. I recently added up my exposure to radiation over the past three years and realized I have had 18 diagnostic procedures exposing my to radiation in addition to 6 weeks of radiation therapy.  I am now actively avoiding radiation at every opportunity.  I have a trip to Chicago coming up in January, so I may take the train and enjoy a return to an earlier era of travel, sleeper car and all. Boo  ",
      "MessageIndex": 94,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "Mar 4, 2010 11:24AM Boo307 wrote: Cruzsuz, Exercise is always helpful.  Try to find a copy of Dr. Carolyn Kaelin's book \"Breast Cancer Survivor's Fitness Plan\" and start doing the rehab exercises now that are recommended for your surgery.  I found that I didn't have full range of motion in one shoulder prior to surgery, so I was able to enter surgery with better prepared shoulders, arms, and abdomen.  Concentrate on increasing your core muscles and it will make moving around after surgery easier.  You can't have stomach muscles that are too strong for getting out of bed or out of chair after your surgery.  The second thing that is most helpful is to for you to be able to relax on command.  Not only does it reduce stress, you may need less medication in the OR. My daughter was receiving her master degree across the country two weeks after my bilateral reconstruction surgery and I planned to be there.  As my surgery had a three to six week recovery period, I set an aggressive course for myself.  This surgery would be my largest surgery ever and not essential to my life.  After completing a year of treatment for bilateral breast cancer; excision, re-excision, chemo, radiation, and Herceptin I could have reconstruction in order to return to some semblance of normal.   The surgery entailed five and a half hours in the operating and I was very anxious and wondered if I opening Pandora's Box.  I have had several bad experiences in the past with surgery so my anxiety was grounded in experience. I discovered that a patient can increase their chances of a better outcome by becoming an active participant in preparing for surgery, recovery, and recuperation.  I read the research by Dr. Guy Montgomery of a brief hypnosis within one hour of surgery and was amazed at the patient benefits.  Dr. Montgomery found that: \"Patients in the hypnosis group required less of the analgesic lidocaine and the sedative propofol during surgery, than patients in the control group; they also reported less postsurgical pain and other side effects and spent less time in surgery.  Surgical costs were also lower in the hypnosis group.\"* I began to practice progressive muscle relaxation and visualization prior to my surgery.  I worked on becoming a little stronger and healthier, and to reduce stress in my life.  It occurred to me that there may be other things I could do to improve my chances of success. I asked questions of many people and researched on-line.  From this I discovered seven key facts and from these I developed my Patient Preparation for Surgery: This may seem obvious, but it is not to someone like me who doesn't work in the field.  I asked questions of everyone and even then I didn't learn a last significant point until the morning of surgery! My surgery outcome stunned me.  It worked far better than I ever could have hoped.  I had an extremely comfortable, positive surgery and recovery experience. Not only was I extremely relaxed and in a positive frame of mind rolling into the operating room, the anesthesiologist told me I was very easy to get to sleep and to keep asleep.  He told me I required \"moderately less anesthesia than expected for a woman of my age\".   Waking in the recovery room I immediately began the deep breathing.  I had practiced this each morning upon waking in the days prior to surgery.  Because I was so tired I had to concentrate very hard to keep breathing deeply.  I was surprised and pleased to feel better with each breath.  I remember being asked several times about the level of pain and only the first time did I mention that I had pain.  As I breathed deeply I thought to myself \"I am so comfortable\". What I didn't think about was how the various surgical sites felt.  I didn't have time to think about if I hurt because I was focused on the breathing.  I suspect I used somewhat less medication because I was so distracted.  As I was rolled into my hospital room I saw a bouquet of flowers sent by my family and it made me feel very happy.  The nurse set me up with the PCA later that afternoon and taught me how to use it.   She gave me an initial dose and I dosed myself a few more times with the last time at 6:00 a.m. I was under medicated the last time I was hospitalized following a surgery, so the PCA gave me great peace of mind and enabled me to relax. Having the PCA shifted my focus from continually checking my comfort for any tell tale signs of pain to just relaxing.  Without it I would have continually surveyed my level of comfort and been alert to the earliest signs of pain.  I would have allowed thirty to forty-five minutes from the time I felt the very beginnings of pain before I would feel relief.  By supper time I had been able to keep down juice and crackers so I had soup and a sandwich.  That evening I was up walking to the bathroom three times.  The next morning I asked the nurse to switch me to pain pills.  When the anesthesiologist visited he commented that I had used very little pain medication.  My surgeon checked my incisions and told me I could go home that afternoon if I wanted to rather than staying the planned two to four days.  My preparation may have resulted in my having lower doses of narcotic drugs at each step of the way; in surgery, in recovery, and the first night post surgery.  I was active, yet had enough pain killers to stay comfortable.  My recuperation went very well and I flew across the country to see my daughter graduate two weeks after surgery.  By the time I returned a week later I felt quite recovered.  I am deeply grateful to the doctors, nurses, friends, family, and the internet resources that helped me reach my goal of an uneventful surgery and rapid recovery.   Check the research report on the benefits of the short relaxation intervention the morning of surgery.  *J Natl Cancer Inst. 2007 sep 5;99(17): 1304-12. Epub 2007 Aug 28.\"A randomized clinical trial of a brief hypnosis intervention to control side effects in breast surgery patients\" Montgomery GH, Bovbjerg DH, Schnur JB, David D, Goldfarb A, Weltz CR, Schechter C, Graff-Zivin J, Tatrow K, Price DD, Silverstein JH. Good luck and you are really on the right track. Boo",
      "MessageIndex": 4,
      "PostDate": "04/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748924",
      "Title": "Preparation for Surgery cruzsuz hollyann"
    },
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "May 28, 2009 09:45AM Boo307 wrote: BlueDasher, Thanks for that clear perspective of the absolute risk reduction.  I was interested to read the last paragraph of the summary of the results of prophlactic contralateral mastectomy.  It mentions that diet and exercise can also lower the risk of recurrence or a new primary.  See \"Lowering Risk for People with a Personal History\"  http://www.breastcancer.org/risk/personal_history.jsp It would be interesting in see what the absolute risk reduction might be for obtimal weight and exercise in relation to the benefits of prophalactic MX.  I had bilateral BC, so developing a contralateral is mute for me.  My strategy is to work on optimal weight and exercise to keep it from coming back. Betsy DX 3-18-08: Bilateral BC - IDC, 1.8 cm, Stage 1, Grade 3, 0/1 nodes, ER-/PR-, HER2+                                       DCIS, high nuclear grade, ER+/PR-",
      "MessageIndex": 9,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/734344",
      "Title": "Making the Mastectomy Decision Kaidog mikita5"
    },
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "Boo307 wrote: This may offer some prespective on the team approach to your diagnosis and treatment.  I know for me I didn't have a chance to meet with an oncologist until months after surgery and with a plastic surgeon a year later.  Apparently the best standard of care is to involve the other specialists in the beginning, a step that would have saved me many a sleepless night.  It seemed like forever before I had many of my most pressing questions answered. Hope this helps. Boo  Breast cancer surgeons prefer to go it alone By Greg Freiherr | January 19, 2010 The standard for delivering the best quality of care to breast cancer patients calls for surgeons to consult with other specialists and to provide resources and education to help patients decide their course of treatment. \"But surgeons in the community are reporting relatively little of that,\" says Dr. Steven J. Katz, a professor of internal medicine at the University of Michigan Medical School. Katz and colleagues at the UM Comprehensive Cancer Center asked more than 300 surgeons who treat breast cancer patients in the Detroit and Los Angeles areas about how they conduct their practices. The questions gauged whether the surgeons:   consult with medical oncologists, radiation oncologists, and plastic surgeons;   collect biopsy specimens or mammograms;   offer patient education videos or presentations; and   connect patients with peers, for example, through support groups. Fewer than one-third reported that they routinely discuss patients' treatment plans with medical or radiation oncologists, according to Katz, who also serves as a professor of health management and policy at the UM School of Public Health. Just 13% reported routinely consulting with a plastic surgeon. About one-third of surgeons said their patients typically participate in patient decision-support activities, such as viewing a video or web-based materials or attending peer support programs. \"Either doctors are not convinced these elements matter or there are logistical constraints in terms of building these standards into their practices,\" he said. The implications for healthcare in the U.S. are substantial. Nearly 200,000 Americans are diagnosed annually with breast cancer each year, according to the American Cancer Society. More than 40,000 die from the disease. In attending to the needs of this patient population, however, not all surgeons are so cavalier with best practices. Katz noticed that surgeons who treated mostly breast cancer patients were more likely than others to report that they performed services reflecting best practices. \"These results suggest patients might find a more integrated practice among surgeons with higher volume, but we don't know whether that matters with regards to patient decision-making, quality of life, and satisfaction,\" Katz said. http://www.cancernetwork.com/breast-cancer/content/article/10165/1511962 Dx 3/18/2008, IDC, 1cm, Stage IB, Grade 3, 0/1 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750205",
      "Title": "Does your BS offer the standard of best quality care? Boo307 Boo307"
    },
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "Jan 10, 2010 05:27PM Boo307 wrote: zoegr, I found the lump myself March 12th, had the GYN exam March 13th, mammagram and ultrasound March 14th, biopsy and diagnosis of cancer by surgeon March 18th, lumpectomy March 31st, and re-excision April 9th.   My doctors moved things quickly at each step.  In addition I followed up regularly and got the earliest date at each step along the way. Do you have your surgery date yet?  Folks may be busy, but they can SCHEDULE you for surgery.  You have waited enough.  What is the advantage for you to wait any longer?  Betsy",
      "MessageIndex": 9,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746402",
      "Title": "How long did you wait for a surgery after you have found a lump? zoegr Raili"
    },
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "Sep 21, 2010 11:28AM Boo307 wrote: JanetinVirginia, It seems perfectly reasonable to insist that all pain and discomfort that can be prevent should be prevented.  The nurse said the local would hurt, but when I told I had just had a needle loc to prep the other side for a biopsy, she had to come up with another lie.   I was denied a local by the radiologist saying he couldn't be sure the procedure would be effective if he numbed the area.  I had seen the anesthesiologist before all this and had the pre surgery meds.  That took the edge off it.  My surgeon injected the blue die while I was under general anesthesia.  In recovery, the nurse gave me pain killers for the stinging in the nipple. Insist on having the area well numbed for the radioactive injection and have the surgeon inject the blue dye when you are out.  For all the concern and support by the medical staff, this barbaric practice of giving treatment without pain killers somehow continues.  Best wishes, and this too will pass. Boo",
      "MessageIndex": 14,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758288",
      "Title": "Does lidocaine nipple patch work before SNB? JanetinVirginia Sassa"
    },
    {
      "AuthorID": "Boo307",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66710/profile",
      "Content": "Boo307 wrote:     When breast cancer surgeons regularly confer with plastic surgeons prior to surgery, their patients are more likely to have reconstruction, according to a new study led by researchers at the University of Michigan Comprehensive Cancer Center. Where a woman goes for breast cancer treatment can vary widely - ranging from small private practices to large hospital settings. That choice can impact the type of care a woman receives when it comes to reconstruction. \"Breast reconstruction is a very complex treatment issue that requires a lot of discussion. Our results suggest that discussion can be quite different depending on where a patient gets initial treatment,\" says lead study author Steven J. Katz, M.D., M.P.H., professor of internal medicine at the U-M Medical School and of health management and policy at the U-M School of Public Health. \"Patients with similar characteristics or preferences may get a different story from different surgeons - and this depends largely on whether a plastic surgeon is on the treatment decision team from the get-go. Plastic surgeons are the ones with the expertise to explain the increasingly complicated procedure options,\" Katz adds. Results of the study appear online in the journal Medical Care and will be published in the October issue. Researchers from the Cancer Surveillance and Outcomes Research Team, a multidisciplinary collaboration among five centers across the country, surveyed breast cancer patients and their surgeons about treatment choices. They found that use of mastectomy over breast-conserving lumpectomy varied little by surgeon. Primarily, women who were not eligible for lumpectomy or who preferred mastectomy received the more aggressive surgery. This supports previous research by the CanSORT team that shows surgeons generally are consistent in their approach to mastectomy use. Reconstruction is another story. About one-third of women who undergo mastectomy go on to have breast reconstruction. While there are multiple reasons why a woman might not have reconstruction, this study found that 31% of the variation could be attributed solely to how often the patient's surgeon talked to a plastic surgeon prior to initial surgery. \"This is a deeply intimate and important decision that women have to make. It should be made with the right information about reconstruction options in consultation with a plastic surgeon involved up front in the treatment planning,\" says Katz, co-director of the socio-behavioral program at the U-M Comprehensive Cancer Center. \"Patients should be particularly attentive to engaging their surgeons on the first visit about this important treatment option.\"http://nccn.com/index.php/component/content/article/1-latest-news/303-surgeons-impact-whether-a-woman-gets-breast-reconstruction-u-m-study-finds Dx 3/18/2008, IDC, 1cm, Stage IB, Grade 3, 0/1 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758319",
      "Title": "Surgeons impact whether a woman gets breast reconstruction Boo307 Boo307"
    }
  ]
}