{
  "AuthorID": "Bookwormgurl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286528/profile",
  "Posts": [
    {
      "AuthorID": "Bookwormgurl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286528/profile",
      "Content": "Bookwormgurl wrote: This is my first time posting and I am confused. I had unilateral mastectomy for a 1.2 cm idc and asmall dcis at the beginning of February and during surgery they found two positive (macro mats) lymph nodes. I was told after surgery I would likely need chemo but I am so confused because I have er+, her2-, low ki-67 (<10) and my oncotype score came back at an 8. One oncologist said he would recommend TC chemo and the second opinion oncologist I saw yesterday said she would do dose dense A-CT. it Did anyone with similar scores do dose dense A-CT? It seems like most people in this group that have similar scores etc do the tc, so I was a bit surprised to hear A-CT was recommended by the second oncologist. Her main Reason was that it had gone to the lymph nodes and it was standard of care.. I am trying to wrap my head around everything but it just seemed so different from what I have read on here and other places. Any thoughts would be appreciated. thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/870206",
      "Title": "Chemo confusion Bookwormgurl MexicoHeather"
    },
    {
      "AuthorID": "Bookwormgurl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286528/profile",
      "Content": "Bookwormgurl wrote: I am honestly so scared to even ask about this but I was dx'd with a 1.2 cm grade 2 idc (8 oncotype score) at end of December 2018. I had a unilateral mx beginning of February and they found two positive lymph nodes (macro). Since then I have seen two oncologists and am trying to figure out a chemo plan. However, I also had a bone scan a few weeks ago that showed something on my suspicious on my iliac bone and my humerus. I also had a ct scan after that and the report said nonspecific lesions on right humerus and right iliac appearing to correspond to activity on recent bone scan and that the sclerotic focus within the right iliac bone was somewhat more suspicious though. Attention on follow up recommended. My original oncologist was only really concerned about the spot on my iliac bone (a sclerotic lesion) and said we could do an mri to get a better look. He also looked at the images with me and it looks like the suspicious area on my iliac bone is in my joint.. I believe arthritis was one thing he said it could be 😬 but please tell me has anyone had anything similar happen and it was benign😬? Also, when I went for my second opinion appointment that dr seemed concerned about the spot on my humerus too... which my first oncologist didn't seem as concerned about after the ct scan. , but the second oncologist also wants me to get an mri on my humerus too now so I am getting an mri for both spots now. Unfortunately, I can't get in for my MRI's until end of next week so in the meantime I wondering If anyone has any words of encouragement or positive thoughts, and may have something similar happen and it turned out to be arthritis or something benign... etc please lmk I'm starting to have major scanxiety about this 😬 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/870232",
      "Title": "MRI on bone Bookwormgurl elise24601"
    }
  ]
}