{
  "AuthorID": "boribon",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264645/profile",
  "Posts": [
    {
      "AuthorID": "boribon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264645/profile",
      "Content": "Dec 10, 2017 10:08AM boribon wrote: thanks a lot. As there is no mass seen on US, punch biopsy may be the solution in my case. May I have one more question; what is the different diagnosis for IBC? In other words, what else may be the (bening) underlying symptom behind erythema on the breast? I know of lactational / non-lactational breast inflammation (often associated with fever and shoul respond to antibiotics), yeast infection (should respond to anti-fungal ointments). But what else may be there? Or once you have a red spot and it's not yeast&inflammation, it's IBC?",
      "MessageIndex": 6,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860726",
      "Title": "Scared of IBC boribon Traveltext"
    },
    {
      "AuthorID": "boribon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264645/profile",
      "Content": "Dec 11, 2017 03:32PM boribon wrote: Visited a third dermatologist today; and their primary guess is that my erythema may be due to Lyme's desease; with an atypical skin symptom. Was sent to blood test (will take 2-3weeks to get the result); plus a punch biopsy was carried out (2punches of 4 mm of diameter). Result will arrive next Monday. Plus I have a scheduled MRI for next week to rule out IBC.",
      "MessageIndex": 8,
      "PostDate": "11/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860726",
      "Title": "Scared of IBC boribon Traveltext"
    },
    {
      "AuthorID": "boribon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264645/profile",
      "Content": "boribon wrote: Dear All, Am a 44 year-old mum of 3. Noticed a red spot on the inner third of my breast about 5 weeks ago. Visited a dermatologist, who suggested that my red spot has nothing to do with any dermatologocal diseases (not an ekcema, fungal infection, etc), and she has no idea what may cause the discolouration. Had a mammogram and sonogram last week, that was all negative; and the doc reffered me to another dermatologist for a second check up. The second derm has also diagnnosed that the red spot has is not a dermatologic symptom and sent me back to sonogram. The second sonogram was negative again (no skin thickening, no underlying mass, no swollen lymph nodes in the axillaries, etc.), and the specialist claimed that this may be some dertmatological infection. He told me that he can assure me that IBC does not look like my red-purple skin area; because with IBC there would be an edame under the skin, the skin would be thicker, and the red spot would be in the outer, and not the inner corner; plus a peu d'orange would be prevalent. In the meantime I visited a breast surgeon, who was helpless again, but referred me to MRI for the end of December. On top, I'll undergo a punch dermatologic biopsy next week. Needless to say, I am scared to death. Do not have any other main symptoms (sometimes I feel that my breast is itchy, and I have a feeling of let down, but these may all be psychological, regarding that I keep on reading IBC related websites for the past 10 days), but the red, somewhat warm are on one of my breasts that keeps on growing in a rather worrysome pace. Have already seen 5 different docs and none of them had any usable ideas. Feels like an emotional roller-coaster... (sorry for my English, live in Europe, not native). Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860726",
      "Title": "Scared of IBC boribon Traveltext"
    },
    {
      "AuthorID": "boribon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264645/profile",
      "Content": "Dec 10, 2017 08:39AM boribon wrote: Three of them thought it could also be IBC, but only after I came up with this idea; they had no idea prior to that (one dermatologist; the family doctor and the surgeon). The latest update is that I wanted to get a core biopsy done, as to best of my knowledge that is the method suggested by the latest Consensus Statement on IBC. As I mentioned earlier, I live in Hungary, Europe, and it just turned out that here pathologists perform fine needle biopsy when they suspect IBC (i.e. do not follow the international guidelines in this respect). However, as in my case no breast parenthal lesion, oedema, skin thickening can ce seen on sonograph, they refuse to do the biopsy. Have contacted two pathologists and found closed doors each time. Luckily, the dermatologist is still willing to do the punch biopsy; but I am not quite sure whether the accuracy of the results is as high as in case of core biopsy. I am still waiting for the MRI, that will be on the 20th of December. Just feel exhausted of anxiety and my constant 'war' with the docs, keepeng on explaining them that my symptoms still can be assiciated to IBC (in spite of having one single symptom, erythema /redness/ and having a negative mammo and sonogram). ",
      "MessageIndex": 3,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860726",
      "Title": "Scared of IBC boribon Traveltext"
    },
    {
      "AuthorID": "boribon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264645/profile",
      "Content": "Dec 10, 2017 08:40AM boribon wrote: Thanks for the reply and support, I'll keep you updated",
      "MessageIndex": 4,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860726",
      "Title": "Scared of IBC boribon Traveltext"
    }
  ]
}