{
  "AuthorID": "BornInWA",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82666/profile",
  "Posts": [
    {
      "AuthorID": "BornInWA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82666/profile",
      "Content": "Apr 28, 2009 09:19PM BornInWA wrote: I like a good old Irish folk song.  I want this one at my funeral. The Parting Glass by the Wailin' Jennys Oh all the money that e're I spent I spent it in good company and all the harm that e're I done Alas it was to none but me And all I've done for want of wit to memory now I can't recall So fill me to the parting glass  Good night and joy be with you all Oh all the comrades that e're I had Are sorry for my going away And all the sweethearts that e're I had Would wish me one more day to stay But since if falls unto my lot That I should rise and you should not I'll gently rise and softly call Good night and joy be with you all",
      "MessageIndex": 58,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730432",
      "Title": "What Song Makes You Go Over The Edge? KellyC cp418"
    },
    {
      "AuthorID": "BornInWA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82666/profile",
      "Content": "Apr 25, 2009 12:37PM BornInWA wrote: 43 at first DX, Stage IIB Triple negative.  45 DX mets to the mediastinum (2.0 mass and several lymph nodes). I found my original lump doing a self exam.  It was just to the inside of my nipple on my left breast and was a visible as well as palpable bump.  Had a mamo and ultrasound (both showed nothing because I have dense breasts).  I think mamograms are good but shouldn't be the only screening tool for everyone.  In my case the mamo was pretty useless.  I'm BRCA negative with no family history of breast cancer.  My father died of brain cancer at age 62. I think my lifestyle and diet may have contributed to things and I'm trying to eat better and excercise in order to fight this.  I have three kids who need me.  Two teenaged daughters at home and one married son and brand new grandson!   I don't think an MRI is unreasonable as a screening tool if you have dense breasts.  My oncologist suggested my girls start getting screened at 25.",
      "MessageIndex": 208,
      "PostDate": "25/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    }
  ]
}