{
  "AuthorID": "borogirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
  "Posts": [
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Dec 7, 2018 09:31PM borogirl wrote: The issue for me was having my arms up over my head (like I was ready to dive) for the hour it took for my MRI, and then 3 days later I had an MRI guided needle biopsy that took hour and a half. I did a number on my shoulder and I ended up having arthroscopic surgery on that shoulder 3 months later (although orthopedic dr. said I already had issues building up in that shoulder and the MRI was just the straw that \"broke the camel's back\"). I'm sure they have some ways to alter or adjust positions some for patient comfort while still getting good pictures with the MRI, which of course it the point of the MRI. Good luck and let us know how it goes.",
      "MessageIndex": 3,
      "PostDate": "07/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868736",
      "Title": "Breast MRI ??? jessie123 jessie123"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Aug 19, 2018 06:28AM borogirl wrote: My plastic surgeon is going to do pre-pectoral TEs at time of MX. I asked about DTI but he said that in 80-90% of those cases he still has to go in later and make revisions. He said the problem is he doesn't always know what condition the skin pocket is in when the BS finishes the MX part, and PS can't control the size and shape of the already emptied pocket. By starting with TEs and then having final implant put in later, he can manage the pocket better. Good thing is that PS says with pre-pectoral implants he can go ahead and start off with about 300cc in TE at time of MX, decreasing the number of fills needed later on, therefore decreasing the time needed to complete fills.",
      "MessageIndex": 25,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866532",
      "Title": "After surgery what can you carry?how heavy Jadedjo jenndenino578"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Aug 2, 2018 11:04AM borogirl wrote: These are all the things I've been doing after my arthroscopic shoulder surgery too. Hopefully since I've been doing these and will continue to do these up until this surgery I'll be in good shape ahead of time and recover better too. Thanks for sharing, and I will be eager to hear from my PS when the time comes about when I can start movement and exercise after MX (since all doctors have different rules and procedures).",
      "MessageIndex": 178,
      "PostDate": "02/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Aug 22, 2018 08:38AM borogirl wrote: I'm posting this under multiple surgery threads as I hope to get input from several of you.In doing my own preparation for prophylactic DMX this fall, I'd read where it helps to have small pillows for under the arms to relieve pressure from your arm resting directly against your side.I had assumed that was because of pain from not only any lymph node removal, but also because of drain sites right there.I made a pair of pillows for myself, and then because I like to sew and wanted to help other patients who don't have the time or ability to sew for themselves, started making more and am donating them through the nurse navigator at my local hospital.She gives them to women (along with a bag of other comfort items) at the time they come in for a pre-surgery class to learn how to take care of drains etc.My thought was for unilateral MX you get one arm pillow, bilateral you get two (drains on two sides). ",
      "MessageIndex": 195,
      "PostDate": "22/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Oct 22, 2018 06:00PM borogirl wrote: Spiritedcharm - Welcome! 3 weeks from today! What time? I'm first up that morning - 7:15. Hope everyone in the operating room that morning had a good weekend (but not too good) before, LOL. Evily - I specifically asked PS if there was anything I could do before or after surgery to help prevent nipple necrosis and he said there is nothing. It's based partly on your own healing ability (they won't do nipple sparring if you are a smoker). My BS said in my case it would only be 1 - 5% chance. I am starting to take extra Vit. C (1000mg/day) and trying to get 100g of protein per day, both important aids in healing. I learned about doing that my researching on my own. Don't know why drs. didn't share that information, but when I mentioned it to them they both said that was a good idea (zinc important also). My dr.s have said my surgery should be 4-5 hours. I have smaller breasts so I guess it won't take as long to remove all the tissue compared to those women with larger volume to remove. I'm lucky in that I don't have to have any lymph nodes checked or removed, so that will save time too.  ",
      "MessageIndex": 15,
      "PostDate": "22/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Oct 22, 2018 09:58PM borogirl wrote: It was only about an hour or so, done outpatient. Surgery wasn't until 3:30 in the afternoon and I was home by 6pm. I took a couple of the pain pills about 4am, then one about 9am, and didn't need any more rx pain med. The incision was just to the left of left nipple, going straight back laterally about 4\" and has healed up so you don't hardly even see the scar. Of course this is basically where my MX incisions will be now. The 2 items of discomfort I had were that because the incision went back towards the side, when I would walk my arm would rub against it and that hurt some, and second was I did develop a seroma that took awhile to resolve on it's own. All in all, not too difficult or painful. I was able to do most anything I wanted to do within a couple of days. I'll be praying for you too!",
      "MessageIndex": 17,
      "PostDate": "22/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Oct 27, 2018 08:40PM borogirl wrote: I did mention to BS at pre-op appt that I wondered how anyone slept the night before this surgery. He called in an Rx for lorazepam (5 tiny pills - I plan to only take one for the night before). My surgery is scheduled for 7:15am so I'm guessing we will have to be at hospital by 5:30am. Just hoping to go to bed by 9am and get some sleep that night.",
      "MessageIndex": 41,
      "PostDate": "27/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Nov 15, 2018 07:23PM borogirl wrote: Forgot to mention that my BS has already called with pathology report. I did this as prophylactic BMX because I had already had complex scleroing lesion, sclerosing adenosis, and ADH diagnosed from biopsies this year. MX pathology showed no cancer, but BOTH sides had additional ADH, CSL & SA, so my decision to to this was the smart thing to do!",
      "MessageIndex": 141,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Oct 19, 2018 03:51PM borogirl wrote: Looks like we are three days in a row. It appears prepec is the way to go. Hoping for quicker and less painful recovery. ",
      "MessageIndex": 4,
      "PostDate": "19/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Nov 9, 2018 04:46PM borogirl wrote: RosieRed - my PBMX is this Monday, and although I have had this scheduled since July, and have had lots of time to prepare mentally, physically, and around the house, today I find myself a little sick to my stomach and finding tears coming to my eyes. I KNOW I am doing the right thing, I am blessed to have had the warnings of risk and the opportunity to prevent cancer, but I guess it’s still sad to lose that part of our body. I’m having TEs and then gummy implants, but they’ll never be the same. I just keep repeating what God said to Joshua -“Be strong and courageous, I’ve got this in My hands”. Best wishes to my fellow Monday surgery ladies, SpiritedCharm and Christine 1975. ",
      "MessageIndex": 104,
      "PostDate": "09/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Oct 27, 2018 07:07PM borogirl wrote: So we have boogirl and borogirl both in November LOL. One thing I read when looking for suggestions about reducing anxiety ahead of surgery, and soothing/inspiring help for in the hospital and once back at home for healing, was to put together a playlist to listen to. I had assumed they meant meditational music but they explained just pick any music you really like. I like Frank Sinatra so I started looking at which Sinatra songs to use. Who knew there were so many appropriate songs for us surgery ladies! Start with (for the night before surgery) “I Couldn’t Sleep At All Last Night”, then (for anesthesia) “Come Fly With Me” and “Fly Me To The Moon”. Next is “I’ve Got You Under My Skin” and “All of Me, Why Not Take All of Me”. We end with “What Now My Love” , and since my surgery is prophylactic, my grand finale is “I Did It My Way”! Actually I have that but also a couple of contemporary Christian playlists and one of meditational music. I’ve already been listening to them and it really does help keep me calm as the days count down. ",
      "MessageIndex": 39,
      "PostDate": "27/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Nov 29, 2018 08:32AM borogirl wrote: Had my first post surgery fill yesterday (PS put in 250cc at time of surgery). He only put in 50cc on each side, which what he usually does at first fill, saying he wants to take it easy in the beginning, and can do more on future fills. This now puts me at about the size I was before surgery (38B), but I'd like to go a little bigger so next week may do another 50 each, and possibly 50 more the following week, to top out at 400. It didn't hurt at all. I'm prepectoral so needle didn't go through muscle. I did take naproxen sodium about an hour ahead of time, but even this morning I don't feel any pain or discomfort from fill. I do notice that I don't feel the discomfort of the edges of the TEs quite so much, so that's a good thing too. His policy is no driving for 3 weeks, so that's disappointing, but can start using lotion/aquaphor on incision sites. Being only 16 days out I feel great and very grateful for how smooth this has been. I know many of you out there have more issues and complications that cause pain and such, and I hate that for you, but do want ladies to know that there can be good healing in this process.",
      "MessageIndex": 251,
      "PostDate": "29/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Dec 29, 2018 07:47PM borogirl wrote: So any of you November ladies having any feelings of depression or sadness? My prophylactic NSBMX on 11/12 went great, nipples good, tissue expanders annoying but not painful anymore, fills have gone fine, and exchange surgery scheduled for Feb. 8. I thought I was doing great emotionally too - feeling very blessed and relieved I was able to have MX before my atypical biopsies became cancer. When I met with After Breast Cancer advisor last week, I broke down. She was talking about the group exercise classes I can start in a week or so, and I asked her if other women in there would be annoyed or resent me for being part of this program even though I didn't have breast cancer, and that I didn't want them to feel bad that they got cancer and I didn't. That's when I started crying. She explained that just because I didn't have cancer didn't mean I wasn't allowed to be part of the group, because I had gone through the scare of cancer, and had mastectomy, like the other women who will be in the group. She then said that many women, about 6-7 weeks out from surgery start to feel emotional, sad, depressed, because we are past the intensity of the build up to surgery. She also said I might have \"survivor's guilt\" because I didn't have cancer, when these other women did. Also, in 2018 I had other health issues pop up - shoulder surgery, cataract surgery, lumpectomy, etc., that all randomly happened in this same year. She suggested I meet with a counselor to help cope with these things. Again, I thought I was doing well until she started discussing these things (she's a cancer survivor), but now I do feel a little depressed. I also am realizing I have probably worn out my friends with my continued discussions of how I am/what I've gone through. I guess we have all been so used to going from one dr. appt. to another, and suddenly we are on our own more now. In preparing for this whole process I spent hours researching what to expect and to better be prepared, but now I'm done with most everything except exchange surgery.",
      "MessageIndex": 348,
      "PostDate": "29/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Oct 18, 2018 09:43PM borogirl wrote: I'm having prophylactic nipple sparing BMX on Nov. 12. Will have pre-pectoral TEs and eventually silicone gummy implants. I've had this scheduled since early July so have had lots of time to research and prepare, and as of right now I'm pretty calm. Had my pre-op with BS today, meet with nurse navigator at hospital tomorrow, and pre-op with PS on Monday, 10/22. The countdown begins. Evily - are you having pre-pectoral implants? Those are quicker to recover with and less muscle issues they say. ",
      "MessageIndex": 1,
      "PostDate": "18/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Oct 22, 2018 02:51PM borogirl wrote: Today I had my pre-op appt. with plastic surgeon, so I have now covered breast surgeon, hospital nurse navigator, and plastic surgeon. Will have hospital pre-admission testing the week before the surgery. I've done a lot of research on line and with other patients so pretty much know what to expect, but each dr. has their own specific pre-op and post-op stuff. I'm disappointed - my PS says no showers until drains are out. Drat. He also made the point that you really need to limit your arm movements (raising high, pulling, pushing, including when you stand up) as the TE is somewhat tear drop shaped, and even though he uses a few stitches to hold the corner tabs of the TE in place, you don't want movement through the chest to loosen that TE so that it moves around. I'm having nipple sparing pre-pectoral, and I asked at what point you can feel safe about no nipple necrosis, and he said that by one week out you'll be pretty safe. He said it happens pretty quickly so to keep an eye on it every day. Sound like he sends me home with no dressings - just steri-strips across the incision (interior stitches). My Bible study group just finished studying the book of Joshua and I am holding fast to \"Be Strong and Courageous - I've Got This\" - God. Strength and courage to all the November ladies!!!! ",
      "MessageIndex": 10,
      "PostDate": "22/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Nov 6, 2018 11:22PM borogirl wrote: Had my pre-op at hospital today and was able to speak with anesthesiologist about possibility of nerve blocks for surgery. He said he has no issue with doing Pecs 1 and Pecs 2 nerve blocks and said it “substantially” reduces pain. Should reduce nausea after surgery and need for opiods for pain. My BS and PS didn’t really have much opinion about it and said to check with anesthesia people. Very happy to be able to have this option. Prayers for all of you having your surgery this week and hope all who have already had theirs are felling better everyday. ",
      "MessageIndex": 89,
      "PostDate": "06/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Nov 13, 2018 08:21AM borogirl wrote: Surgery was yesterday (took about 5 hours)and all went very well. Had the pecs 1 and pecs 2 nerve blocks and think that really helped keep from having nausea and major pain yesterday. Not much pain just sitting here in bed in hospital but boy, twisting or major arm movement is painful all around the edges on implant. I can tell there is swelling on the upper breast and it’s painful to touch it there. Only dressing right now is some gauze pads that are maybe taped down on my sides but not in front so I can pull them away to see incisions. They are around the top of areola and then out to lateral side. I see no unusual redness there so I guess that is all good. Dr always has his patients have catheter over night and they pulled it this morning and I have walked to the bathroom once to urinate. Hurt really bad to wipe from back so will need to wipe from front for awhile. They say day 2 is worse so I will make sure I get appropriate pain meds. Good luck to everyone else this week.",
      "MessageIndex": 120,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Oct 23, 2018 06:18PM borogirl wrote: Regarding nothing to drink after a certain time - you should make an extra effort to hydrate yourself for at least the 24 hours before your cut off time. They don't want anything in your stomach because they don't want to aspirate anything (like if you threw up), but you still need to be hydrated. It makes finding a good vein to put in an IV much easier if you are hydrated and better in general for you body. For 2 surgeries I had earlier this year (lumpectomy and shoulder surgery) I hydrated up until that midnight time and then stopped, and nurses said they wish everyone would do that. I replied that someone should tell us that! I will admit the morning of surgery sucking on a couple of very small ice chips just to help with dry mouth. Also, they say it's important to hydrate after surgery to help remove the effects of anesthesia from your body.",
      "MessageIndex": 22,
      "PostDate": "23/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Nov 13, 2018 08:33AM borogirl wrote: Forgot to mention that PS was able start me off with 250cc in prepectoral TEs. Also just went bathroom again and it hurts to wipe from front too",
      "MessageIndex": 121,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Nov 15, 2018 07:20PM borogirl wrote: I am post op day 3 now and am very happy with my progress. Today didn't take any rx pain meds, just extra strength tylenol. The only pain I really have is on right side, where I think drain tubing is. Certain movements feel like someone just stuck a spear deep in my side and that pain echos for a minute or so then goes away. I was told not to be doing any arm exercises, just t-rex movements, but i have better range of motion than that without any pain. It was a challenge to reach to wipe after using bathroom for first couple of days but that's better now. Two drains on each side, one of which on each side is barely draining enough to even count (1-2cc twice/day) and the other larger drains are doing 25 - 30 twice per day now. I have follow up with PS next Wed. so I'm sure at least one drain from each side will come out and maybe the other two also, as liquid is not as bright red anymore either. Got bowels moving good today, between taking colace and a bottle of citrus mag and no rx pain med today. Appetite is good and I spend most all day sitting upright (chair, computer) and several naps a day in recliner, where I also still sleep at night. Husband washed my hair in sink today so that felt good (not allowed to shower until all drains out) and am able to do decent job of sponge bath. I have two 6\" ace bandages around (not overly tight) chest, and although they didn't really explain why, based on the way she wrapped me, with most of it on top half of breast, I think it is for compression to help keep swelling down. I definitely feel swelling on top half of breasts, but I'm not seeing any bruising yet. Nipples look good (incisions are around top half of areola and lateral out to side) and have glue, not steristrips. Best wishes to those with upcoming surgery and happy healing to those of you who are healing. It is a relief to have that surgery cloud no longer hanging over my head.",
      "MessageIndex": 140,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Nov 23, 2018 10:16PM borogirl wrote: 11 days since surgery, and overall I feel good about my recovery. I was so happy to get all 4 drains removed on Wed. (9 days after surgery) although in my case it wasn't painless. I could feel the nurse pulling at the stitches on each side that hold the drains in place to cut them, and she told me to take a deep breath in and out twice. On the second breath out she yanked both of them on that side out. Yeow! Then did the same on the other side, and it hurt a little worse even. Pain was right at the drain incision site, so I don't know if it was because a scab had formed there, or I just wasn't as numb in that area as some women who claim no pain are. It was very tender for a couple of days and had a little oozing but seems to be much better today. Great news was yesterday I got to take my first full shower! Yippee! I've been sleeping in a recliner since surgery, so I thought last night, because I no longer had drains in, that I would try to sleep in bed. Only made it for about 15-20 minutes. I felt like the saline in the TEs was spreading out in a different pattern than when I am upright, and it was very uncomfortable. Also felt like extra stretching tension across chest and into arm pits, although I also may have over done some reaching into cabinets yesterday. At any rate, it was back to recliner. This is actually the first day I haven't felt the need to take a nap. I haven't taken any pain rx since day 5, but I still sometimes feel a little weak or light headed. I suppose that is partly from blood loss during surgery, general trauma to the body, and the fact I have hardly been doing anything for 11 days. PS put in 250 cc on each side at time of MX (estimating me to go to about 500 cc). I'm hoping when I get my first fill this coming Wednesday that that will ease some of the TE pain, going with the theory that the implants are still semi folded with lumps and creases, so more fill will fill in those creases. I tried to take it easier today and pain isn't as strong unless I touch the skin. I do have a little \"scabbing\" on parts of each nipple/areola but PS said that is not unusual with my type of incisions (around top half of areola and out to side 3-4\"), and that I might loose a little color to that area once scabs fall off. Hope healing continues for all of us post surgery ladies, and prayers for each of you ladies having surgery this next week. I does really feel good to have it behind you, even though it takes awhile to heal and fully recover.",
      "MessageIndex": 195,
      "PostDate": "23/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Jul 18, 2018 01:13PM borogirl wrote: That waiting period is awful. It's all you can think about. In the last 9 months I've had 5 biopsies (no malignancies). I was too antsy to be able to sit around, so I got on pinterest and started looking at projects related to mastectomies, and I have started sewing those under arm pillows for after surgery, seat belt cover cushions, and some drain bag holders. I am going to donate them locally for those patients who could use them (through nurse navigator, doctor's office, etc.) Even doing some sort of project around the house helps keep you busy. Mustlovepoodles is right - keep yourself physically busy. I also listen to contemporary Christian music on the radio in the car and at home.",
      "MessageIndex": 2,
      "PostDate": "18/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865965",
      "Title": "Young and terrified Katus28 Katus28"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Jul 16, 2018 09:05PM borogirl wrote: I had some eyelid surgery in April and shoulder arthroscopy last month, and for the 4-5 days leading up to each of them I ate about a cup of FRESH (I read it must be fresh, not canned) pineapple each day, and didn't have any bruising with eyes and very minimal for shoulder.  I'd read that some people take Arnica tablets for preventing or limiting bruising, but I felt like eating the pineapple would be the safest.  I also purchased some bruise cream ahead of time from the drug store and applied that 2-3 times a day before each surgery.  Eye surgeon was very surprised I had no bruising, but we are each different too.  The question is, if 1 cup/day worked for eyelids, how much pineapple do I have to eat a day for prophylactic bilateral MX?  Sounds like a whole pineapple LOL.  On a serious note, it truly is a blessing to be able to come to this website and read everyone's stories.  For me, knowledge is power, and being as informed as I can helps me stay calmer, and be better prepared for all that is to come.  Prayers for each and every one of you as you proceed on this journey!",
      "MessageIndex": 622,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Jan 23, 2019 03:47AM borogirl wrote: it may partly depend on where your incisions are. Mine were around the top half of areolas and out to side about 2 inches. On the one areola I developed (after surgery about three days)what they considered a deep bruise. It turned into a black scab and eventually fell off. That area is now a little paler than the rest of areola and may or may not ever regain it’s original color. The others nipple got a thin scab on it but that flaked off and is fine. I read that there may be some seepage at nipple and areola after surgery as a normal reaction to the surgery as the body deals with the trauma. Check with you PS to be sure.",
      "MessageIndex": 1,
      "PostDate": "23/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869484",
      "Title": "Aerola is peeling Labmom3 Denidom"
    },
    {
      "AuthorID": "borogirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275302/profile",
      "Content": "Sep 5, 2018 01:41PM - edited Sep 7, 2018 10:54AM by Moderators I had a wire guided lumpectomy in March (no dye though). I thought the whole wire thing would be really weird too but it wasn't any big deal. They took me in for mammogram a couple of hours before procedure, squeezing breast horizontally, then releasing and going vertically - the purpose to see where they should insert the wire to have the most direct access to the area to be excised. While the breast is squeezed in the mammogram, the radiologist inserted the wire into the breast. The \"wire\" is so thin you don't even feel it (I think they may have numbed me up just a little in that area). The wire is like a thin plastic wire, and once it was in place (they confirm by doing another mammogram), there is a little barb on the end, like a tiny fish hook, that holds it in place, and they then looped up the rest of the thin wire and taped it down on my skin nearby. There are also some youtube videos you can see of putting in wire. I put my shirt back on (no bra) and waited to be called for pre-op then. I was so fascinated about it I had to take a picture (see below). Surgery for me was about 1 hour, then 90\" or so in pre-op and then home. I only needed pain rx for that evening and once the next morning. I did keep icing it and that kept bruising down (I also ate a lot of fresh pineapple for a few days ahead of time to reduce bruising). I did eventually end up with a seroma in that area, but heat and very gentle massage helped with that, although it took several months to finally fully clear up. All in all, not too bad and my scar has almost disappeared (6 month post surgery picture below also). Sorry the pix are so big but can't figure out how to make them smaller.       ",
      "MessageIndex": 17,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    }
  ]
}