{
  "AuthorID": "brainofkjf",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130280/profile",
  "Posts": [{
    "AuthorID": "brainofkjf",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130280/profile",
    "Content": "Jun 7, 2011 02:41PM brainofkjf wrote: I had the same procedure before my lumpectomy on Feb 1st, but being insanely curious I just had to watch as much as possible. The ridiculousness of the situation helps me cope with the scary parts. The table where you lay face down and stick your breast through the hole and they lift you to work under you like a Chevy cracked me up. They numbed me up perfectly though, never felt the wires being inserted. When I sat back up and looked at the wires coming out of my breast I asked my surgeon if I could now get HBO while I waited for surgery. I wanted to grab my hubby in the waiting room and have him take a picture, as my DC IS was right behind the nipple so the wires looked like rabbit ears to my nipple being the nose. Made me laugh, which eased the tension. The pre surgery mammograms with the wires inserted were \"interesting\". The wires didn't hurt but a good ol' melon squishing is never pleasant. There was some bleeding from the insertion points during the mammo, but nothing to worry about. My diagnosis was similar to yours. I was asleep for the dye, etc.. so no pain.  The thing no one told me beforehand that you may experience is what you'll see the first time you change the bandages after surgery. I'm rather large breasted, and my nipple was no longer an \"outie\", it was inverted. That disturbed me a great deal, but within a few days it popped out again. There was some indentation in the breast for a few days after that as well, but it was almost back to normal within weeks. Best of luck to you in your surgery. You can get through this. it will be over before you know it and you'll have some stories to tell. Cheers, KJ",
    "MessageIndex": 12,
    "PostDate": "07/06/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769759",
    "Title": "Wire insertion before Lumpectomy? Chrys23 AMP614"
  }]
}