{
  "AuthorID": "Braveheart",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
  "Posts": [
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Apr 29, 2011 10:09AM Braveheart wrote: Hi Liane, I'm glad you came on here and let it all out. You don't have to believe what a piece of paper says. You will prove them wrong. Live your life to the fullest. We're here for you. We're your sisters and you're not alone. Have a good cry and then go out with your boys and family and have a blast. {BIG HUGS}",
      "MessageIndex": 4,
      "PostDate": "29/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768308",
      "Title": "I just can't do it. Chickadee Chickadee"
    },
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Apr 29, 2011 10:49AM Braveheart wrote: I had my 1st taxol a little over a week ago. For me I had terrible bone pain on the 3rd day after chemo. My pain felt like boiling water being poured over my bones. It was the scariest and most painful experience of my life. The terrible pain lasted for 2 days. After that I had pain but was a bit less uncomfortable. For me AC was tough but Taxol so far kicked my a$$. Good luck to you and I hope you get away with no side effects. [hugs]",
      "MessageIndex": 2,
      "PostDate": "29/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768273",
      "Title": "Anyone taking Taxol? Sohaila Braveheart"
    },
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Mar 18, 2011 02:30PM Braveheart wrote:",
      "MessageIndex": 2,
      "PostDate": "18/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/766351",
      "Title": "Going through Chemo and need support Braveheart Braveheart"
    },
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Feb 11, 2011 01:23PM Braveheart wrote: Hi everybody, May I join? This is my 1st post.",
      "MessageIndex": 555,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/742861",
      "Title": "Stage II Forum rumoret NativeMainer"
    },
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Mar 20, 2011 11:36AM Braveheart wrote: I want to thank each and everyone of you brave ladies for taking the time and sending positive energy my way. I love you all and my prayers are with you all. It must be so hard for my friends to know what the right thing to say and do. However, it's wonderful to get support from other survivors. I felt so much better after I cried and vent out here. I love hearing from everybody.  Thank you and God Bless.",
      "MessageIndex": 11,
      "PostDate": "20/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/766351",
      "Title": "Going through Chemo and need support Braveheart Braveheart"
    },
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Mar 31, 2012 10:10AM Braveheart wrote: Dear gardengumby, I had radical mastectomy- 1 long diagonal incision starting from my underarm. Maybe my numbness in my fingers is due to Taxol. I will have to go and talk to my doctor again but I'm giving myself \"time off\" from doctors for a little bit. I'm tired of hospitals. ",
      "MessageIndex": 7,
      "PostDate": "31/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782328",
      "Title": "A year after MX still numb Braveheart curveball"
    },
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Mar 31, 2012 10:14AM Braveheart wrote: Sorry Galena to give you disappointing news. I was also not aware that I'll be so numb after MX. However if I compare it to saving my life, I guess I can learn to live with this numbness.",
      "MessageIndex": 8,
      "PostDate": "31/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782328",
      "Title": "A year after MX still numb Braveheart curveball"
    },
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Braveheart wrote: Hi dear survivors, I guess I'm writing today because I feel sad and was crying. I need support from other TNBC survivors. My friends seem to have given up on me and think that I will die. They always look at me with pity. When I'm alone I feel strong and concentrate on doing Chemo and surviving. When I talk and see people I feel that I'm going to die, soon. I never felt regret or disappointment of what I'm going through. I always try to stay positive. I do understand that they don't mean it but it hurts so much. I don't want to be reminded of bc each second of my day. Here's a little background info: I was dx with TNBC Jan 17, 2011 at the age of 34. Had a radical mastectomy and 15 lymph nodes removal on Jan 23. I started Chemo on Feb 23, 4 cycles of AC and 4 cycles of Taxol. I'm doing Chemo every other week, dose dense. The 1st one was hell. I thought I was going to die and on top of that I got my period just before the 1st injection, I guess it was all the stress. I have very painful periods and 1st time AC was a nightmare. Did anybody get periods during AC and Taxol or after chemo? The 2nd one is a bit better. I'm having some of the side effects. Painful mouth sores, itchy runny nose, vaginal dryness, rectum discomfort, dry skin. I need help in having relief from these side effects. I feel embarrassed to talk to my onc. From your experience, does each cycle of AC+ Taxol get better or worse? I haven't started Taxol yet but I was told it's easier to handle. AC is pretty tough. I have trouble finding food to eat. I stay away from spicy food but I still have mouth sores and pain. My wisdom teeth are hurting more now then ever. My hair was falling out the after my 2nd cycle of AC and I shaved it off a few days later. I really didn't feel so bad about losing my long hair until my friends kept asking me about it. Now I don't want to see anyone because I'm tired of lifting everybody up. I also feel that nobody understands me. I feel so alone in this. Everybody was curious when my hair will fall out and if Chemo affects the mood. I guess I wasn't smiling and pretending that nothing was wrong. I'm missing a breast, still in some discomfort from surgery, my arm in numb, becoming bald, feeling sick from Chemo and people wonder if Chemo affects the mood.   I would love to hear from other fellow bc survivors. I really want to hear that having triple negative breast cancer is not a death sentence. And women with this dx live to an old age. I want to live and have a better quality of life than before. My thoughts are all over the place. I hope I made some sense. Thank you and I wish everybody only the best. February 23, 2011 started Chemo. 4 DD AC + 4 DD Taxol. Finished Chemo June 1st, 2011! Every evening I turn my worries over to God. He's going to be up all night anyway. ~Mary C. Crowley Dx 1/17/2011, 2cm, Stage IIA, Grade 3, 0/15 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/766351",
      "Title": "Going through Chemo and need support Braveheart Braveheart"
    },
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Braveheart wrote: Hi ladies,  I had a radical MX last january. I still feel lots of numbness from my back, arm and fingers. Is this normal? Even when I type my pinkie freezes and feels uncomfortable. WIll the numbness ever go away? Thank you for your support.  February 23, 2011 started Chemo. 4 DD AC + 4 DD Taxol. Finished Chemo June 1st, 2011! Every evening I turn my worries over to God. He's going to be up all night anyway. ~Mary C. Crowley Dx 1/17/2011, 2cm, Stage IIA, Grade 3, 0/15 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/782328",
      "Title": "A year after MX still numb Braveheart curveball"
    },
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Jun 9, 2011 07:04PM Braveheart wrote: Hi Texas, how are you? I've noticed that nobody commented on your post. I thought I'll stop by and see how you're doing. I had AC and Taxol and was told that the nails might fall off. So far they're hanging on. Have you contacted your onc? You should call and find out what your doctor has to say. I wish you a fast recovery and hopefully you're not in much pain.",
      "MessageIndex": 1,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769274",
      "Title": "Still losing fingernails -- 2 years after taxotere Texas357 Texas357"
    },
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Jul 1, 2011 06:41PM Braveheart wrote: Thank you Sue. Can you post the link to the thread?",
      "MessageIndex": 669,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "Braveheart",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/121995/profile",
      "Content": "Apr 28, 2011 04:55PM Braveheart wrote: Can I join you girls as well?  Braveheart - MX- Jan 23",
      "MessageIndex": 666,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    }
  ]
}