{
  "AuthorID": "Breastless",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67440/profile",
  "Posts": [
    {
      "AuthorID": "Breastless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67440/profile",
      "Content": "Nov 24, 2009 08:56AM Breastless wrote: Hi kmg1015 I found out I was BRCA2+ in Nov 2007 (dx with breast cancer April 2008).  At the time my twin daughters were 15 and my son was 13.  Having 2 teenage girls I was especially concerned of their status/risk.  When I discussed this with the genetics counsellor I was advised that they don't test children until they are at least 18 when they are able to completely understand and make their own decision.  As well the counsellor advised me that there were no childhood cancers seen as a result of this genetic mutation.  This helped to ease my mind.  I didn't think there was a need to know now (and my daughters agree with me) because it would not make any difference at this time.  No mammagrams or additional tests would be done any earlier than what the recommendations are currently for a BRCA2+ family (mammagrams 10 years before earliest onset, for example my aunt got breast cancer at age 44 so they recommend mammagrams for my daughters as early as age 34).  Right now I am trying to get them to follow a healthy lifestyle, eat healthy, exercise, stay drug free and minimize alcohol consumption.   If I knew what I know now when I was younger, I definitely would have led a healthier lifestyle.  Oh by the way I live in Canada so things may be a little different here.  I'm not sure if my comments help but thought I would share anyway. ",
      "MessageIndex": 32,
      "PostDate": "24/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/742842",
      "Title": "BRCA2+ with young daughter -do you have her tested? kmg1015 Breastless"
    },
    {
      "AuthorID": "Breastless",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67440/profile",
      "Content": "Jan 6, 2010 04:25AM Breastless wrote: Hi twinkly I read in one of your posts that you are from Alberta.  I was wondering where?  I live in Regina, Sk.  I had bilateral MX in April 2008, recon with tissue expanders then implants in Mar 2009.  Bad recon so I am now waiting to see another plastic surgeon for another opinion.  Thanks for sharing your story.",
      "MessageIndex": 39,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/695426",
      "Title": "Diary of a bilateral mastectomy twinkly pinkvictory"
    }
  ]
}