{
  "AuthorID": "Brenny",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
  "Posts": [
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Oct 2, 2008 07:11PM Brenny wrote: Thank you all so much.  It's one week until my lumpectomy and I thought I have been coping so well....until tonight.  I literally cannot breathe....it is so overwhelming and I am so alone and so scared.  You are all such an inspiration --I feel like I should be handling this so much better.  It's a little like my divorce after 33 years of marriage....I am falling apart again.",
      "MessageIndex": 8,
      "PostDate": "02/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/722155",
      "Title": "Have I made the wrong decision?? Brenny FrannyK"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Brenny wrote: Now I am most concerned - have I made the wrong decision??  Just diagnosed with IDC, 1.6cm, no obvious node involvement, clinical stage 1.  Surgeon recommending lumpectomy next Thurs,probably followed by RAD. No MRI, no Bone Scan, etc.  What I am reading in the forum is that once I have RAD, I am probably not a candidate if in the future I have to have a mastectomy and want to have reconstruction. Is that true?  Have I chosen too hastily?  Or depending on the results of the actual surgery, do I still have the mastectomy option?  For example, if there is node involvement or the margins aren't clear?   I am now just more confused than ever.  Thx for your input. I am meeting with the nurse on Monday before -- are there more questions that I should be asking?? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/722155",
      "Title": "Have I made the wrong decision?? Brenny FrannyK"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Feb 23, 2009 12:07PM Brenny wrote: Just an fyi - my onc said that Arimidex can start after rads are complete.  One treatment - one set of side effects - at a time!!!  Thankfully!",
      "MessageIndex": 379,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Feb 13, 2009 08:27AM Brenny wrote: Radiation camisoles - you might want to check out ebay:  radiation camisoles.  A seller is offering the TLC camisoles (new) at a fraction of the price --I have ordered three for less than $20 -- seems a good deal.  And then am buying some men's Hanes white cotton undershirts this weekend in anticipation -- will wash them a few times for wearing around the house.",
      "MessageIndex": 176,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 16, 2008 04:01PM Brenny wrote: I just got off the phone with BlueCross-BlueShield (our particular company plan) and learned that our plan pays nothing -zero-zip regardless of what you call it:  wig, cranial prothesis, whatever.  I am just spitting mad - and even madder that she made me cry!  Sounds like most of you have coverage via your insurance.  This is also the insurance that considers Femara a \"less-preferred\" drug and they (their medical panel evidently) have made the decision to cover only Arimedex..... Sorry - Just furious -- do they really need to add insult to injury???",
      "MessageIndex": 34,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722062",
      "Title": "How much would you pay? Fitztwins LuAnnH"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 10, 2008 03:22PM Brenny wrote: Just when you think you have made the adjustment about the inevitable hair loss, you take a shower 8 days after the first tx and there is no hair loss.....and before you know it, you are thinking maybe, just maybe I will be the exception .....  and I won't lose it.  And then you look into the mirror and say don't go there....you are so NOT going to be the exception. It will be gone and get over it!!  (But on a positive note, there were no tears involved in this private conversation with self)! Bren",
      "MessageIndex": 875,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 21, 2008 06:54AM Brenny wrote: Babyc Just another perspective --wish I were more like kerrylamb -- I think it's what you are going to be comfortable with...I intend for no one (zip) to see me bald or near-bald.  For those times when my wig is not presentable, I did buy the bangs from headcovers to wear with a cap/turban and I also bought a halo from chemosavvy for under hats.  Part of it is vanity (because my round fat face is not going to look good bald) and part of it is that I just cannot deal with strangers (and even friends) pitying me.   I don't want to look like I have breast cancer.  I plan to get a lot of wear out of everything I buy because from what I read, it's going to be not just the 3 months of tx, but another 4 or 5 months after that before I will look as good as Otter!  Maybe everyone starts out feeling like this and then gradually develops courage, but I am not sure I will ever be one of them! This is day 19 after my first TC tx and the hair is falling out faster than a dead Christmas tree -- just strands are everywhere. Thankfully I did get a new shorter cut a month ago, so there is less to fall.  I have not had it buzzed yet -- I am out of town and am trying to wait until I get back to OH and have it done Wednesday. My hairdresser suggested not shaving it but buzzing instead.  Just hope I can get throught just a couple more days --luckily my hair is (was) very thick, so I may get a couple days that others do not.  May be coincidence, but I have also notices my nails seem to be chipping easily (again I was blessed with really hard nails) and just got through cutting/treating them this am. Broke one and even glued it (something I never generally due) - I am guessing they aren't going to grow back any time soon either. Even tho you are in the Jan group, keep up with the Dec chemo posts as well for more info! The boards are all a great help. Bren",
      "MessageIndex": 952,
      "PostDate": "21/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Nov 29, 2008 04:44PM Brenny wrote: My first TC tx is Dec 3 and I am getting my hair cut and pick up my wig on Dec 2; On Dec 8 I return to work out of state.  I am hoping against hope that my hair can last until I come home on Dec 22 so I can go back to my beautician here and have it buzzed.  But I will probably be looking for some stranger in the city where I work to do it about Dec 18 and will have to try to figure out how to put on that damn wig.  And somehow I was initially thinking - I just have to get through chemo with a wig -- so not true, it's going to be part of me for the next nine to twelve months at least, I estimate at the rate that you report hair is growing........aaaaaaggggggggghhhhhhhhh!",
      "MessageIndex": 773,
      "PostDate": "29/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 16, 2008 01:42PM Brenny wrote: I just got off the phone with my very good friend -- my hair is \"scheduled\" to leave me this week -- I said I just hoped I could hold on to brows and lashes and she said she really thinks its all about ATTITUDE whether or not you keep them (not the hair mind you, but the lashes and brows) !!!!!  I am so furious -- I couldn't reply intelligently. So I says if I do lose them, it's my OWN fault because my ATTITUDE wasn't right?????  Aaaaagggggghhhhhhhhh!",
      "MessageIndex": 917,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 26, 2009 09:57AM Brenny wrote: Eyebrows - just checking out at Sally's Beauty Supply yesterday and noticed eyebrow stencils in a small package by the cash register -- bought a package for \"just in case\" - I don't think I could pencil in eyebrows if I didn't have any there to start with!! ",
      "MessageIndex": 1137,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 20, 2008 09:34AM Brenny wrote: jrgolomb -- you might contact your Amer Cancer Society for a list of wig suppliers locally --also ask them about their LookGood Feel Better Program and get yourself signed up for it - there's no charge, you get a wonderful bag of new makeup, you get wig/scarf tips, and (best of all) you will probably have some ladies in the class that have already bought their wigs and can give you personal recommendations of providers.  I bought my wig locally, but I did order the bangs from TLC -- to wear with turban or hat I hope.  The hair salon from which I bought my wig helped me match color and then she cut/styled it to my style.  You may also want to browse the Dec group postings - I think there are some good comments there.  I am doing 4 tx 21 days apart and am working through them also...or intending to do so! Brenda (Dec group)",
      "MessageIndex": 17,
      "PostDate": "20/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 30, 2008 07:08AM Brenny wrote: Snowbird - not sure where the nurse is getting her info, but you might check out the TC only topic - I don't think anyone has reported they were able to keep their hair. My onc nurse has known no one -- hopefully you will be the exception! Kim - to take to chemo -- a good book, your ipod, a dvd player and a funny movie that you can laugh out loud at - like What Happens in Vegas.  Hand lotion, some hard candy, crackers (if your facility doesn't offer them), a warm blanket.  Wear comfy sweats and take slipper socks.  I am soooo thankful for my port - I couldn't touch it for a couple weeks, but now there is no recognizable bump and the neck vein is no longer noticeable.  Good luck to all this week - I am 5 days out of tx2 and doing well. Bren",
      "MessageIndex": 119,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 5, 2009 11:23AM Brenny wrote: Jan ladies - Do check out your ACS Look Good-Feel Better Program is you have not already done so - many of us have attended the one night session and received (at no cost) a wonderful bag of cosmetics donated by folks like MaryKay, Chanel, Lancone, etc etc etc.  Good wig/scarf pointers as well.  In addition, we have a wonderful BC support group that meets monthly at our facility--a different topic each month and lots of fellowship and sharing. Bren",
      "MessageIndex": 270,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 8, 2009 01:59PM Brenny wrote: BerkeleyKim Your synthetic wig has \"memory\" -- you shouldn't need mousse or hairspray--it should return to its original style.  You do need to watch exposing it to steam heat -- don't open the oven door with your head right there, don't use any hot rollers or hot curling iron, don't work on the fireplace fire -- all this will singe your new hair .  You only need to wash it maybe once a month (unless you have exposed it to smoke or something that you want to do more often) -- just swish it through water to which you have added a very mild shampoo (either wig shampoo or Dove shampoo)  Rinse it, roll it to dry, then put it on your wig stand and just rearrange to your style. ",
      "MessageIndex": 360,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 20, 2009 01:22PM Brenny wrote: marlenet -- I did try to eat good meals, including protein, but I don't know if it had any effect on my WBC.  And I have felt remarkably good after my txs -- yes, tired and perhaps heartburn and some mild constipation issues, a little metal mouth, but I have been soooo fortunate that I have skipped many of the awful side effects that so many get--no nausea, no bone/joint pain (which most who get Neulasta seem to have).  No fevers, maybe a little sore throat -- but I can ignore most of my se's. And I am working full time except for tx day--but there are nights I go to bed at 8!  I pray you are one of the lucky ones, too!",
      "MessageIndex": 644,
      "PostDate": "20/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 20, 2009 05:19PM Brenny wrote: marlenet -- that is great!  Just remember this week is probably your low point for WBC and your most vulnerable for infections -- wear your gloves to open doors and guide shopping carts - use lots of disinfectant and stay away from sick people!!  Glad you are doing well and next week you will be even better as your counts rise!",
      "MessageIndex": 649,
      "PostDate": "20/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 27, 2009 10:54AM Brenny wrote: Lisa810 - first take a deep breath and perhaps an Ativan (or ask your onc for something else that can help in calming your nerves right now.  We've all been there in this group, and we are all surviving.  Side effects are different for everyone - some have lots, some have few.  Wait and see how you are.  Drink tons of water before your first tx, take pix of your kids or your dog, or something to remind you WHY you are fighting this fight and you WILL get through it. You may want to check for a local BC support group or call the American Cancer Society and ask them for a couple wig referral places.  There are wonderful online suppliers, but I would worry a bit about the fit.  My local hairdresser (from an ACS referral) also styled my wig when it came in - I think thinned it, cut it to my style, etc.  There are some really awful wigs out there - the first place I went to look at them - awful!  But then researched a bit more and figured out I wanted one that looked like my scalp (hand tied synthetic).  My insurance doesnt pay for mine - but I figured I am worth it - and I am going to be wearing it for probably the next year!!  Mine is comfortable and I wear it every day except maybe Sunday around the house, when I wear a cap with bangs underneath (from TLC Catalog). But others have found they like scarves and hats and no wig....you will make the decision that is best for you.  Universal throughout the postings - we almost all have the same reaction to losing our hair.  And I pray the next ten years research will result in controlling that side effect as so many others have been controlled. I was ok through surgery and recovery, but it was the day after chemo that did me in - all of a sudden it was real.  And then my SE's were not bad, but three weeks later, there goes the hair!  And now I look in the mirror and I LOOK like a cancer patient!!!  So I've added big trashy earrings to my look and more eye makeup!! Keep in touch - let us know how you are.  And just keep telling yourself that \"I can do this\" and  you can.  You are a tribute to those who came before you and those who will come after you! Brenny",
      "MessageIndex": 794,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 9, 2008 11:54AM Brenny wrote: Good day ladies, Zuffa - you go girl! Why is it that not one single person (group/etc) has made me a meal???? I am feeling pretty left out!!  Guess they figure that I have no one to cook for - just thaw out a frozen dinner or something - but no one has offered to cook me anything!!  Smile - of course, I don't look like I have missed a meal, either...... I didn't have any bandages on my port - just super glue (or dermabond) -- and it healed nicely - no itching, peeling, etc. meb - I know exactly what you mean about hair being something you could/did control.  Now even it is going to betray us!  I do agree that this battle is hopefully one of the most powerful life lessons that we can give to our children and our grandchildren. simvog - I absolutely postively refuse to be nauseous -- take the pills!!!  Hang in there all - day 6 for me after first TC -- doing okay.....waiting for the other shoe to drop...*smile* Brenda ",
      "MessageIndex": 266,
      "PostDate": "09/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 9, 2008 04:00PM Brenny wrote: Karen - Not sure what age your class is, but it might be that you could make this a great ongoing lesson for your group -- the cold and flu season, hand washing, hygiene, hugs, etc.  At my first chemo, there was a 5th grade teacher whose mother is in treatment at our facility, and she has engaged her class - they are currently making fabulous paper stars to decorate the chemo suite.  Depending on the age group, you may find something suitably appropriate without scaring your kids to death!  I have found a couple wonderful children's books on the subject.  I am back in the office and I don't think the grownups are much better with their habits! I am just enouraging my staff to stay home if they are sick and intend to stay away from others who are sneezing/coughing! Sdavis - I had my gel gloves and socks to moisturize in the chemo suite and my portable DVD player, etc etc....oh and don't forget my sock monkey!   Our center volunteers did bring soup/sandwiches and water/juice and ice cream/pudding during the day which I thought was lovely.  Good luck tomorrow, ladies!",
      "MessageIndex": 278,
      "PostDate": "09/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 10, 2008 01:16PM Brenny wrote: Cebula - This is my day 8 and I have felt fine since day 1 (except I slept through day 3) - assuming my SEs are the same for tx2, please send your Mom my way on the 29th and she can cook and I will eat!!!    *smile*  Unfortunately, it doesn't seem that the reaction to each tx is the same, so basically, it's a crap shoot!  If you don't feel like eating, she can cook and freeze for when you do! My second tx is Christmas eve - my oncologist is on vacation; however, txs still go on and another onc in the building will cover for him -- they were pretty adamant about the 21 days.  Guessing they may be closed on Christmas day.",
      "MessageIndex": 303,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 22, 2008 06:34AM Brenny wrote: Good luck to today's ladies in treatment. Thank you for the www.cjhats.com site -- the prices appear to be great and for those of us with big heads, she says she can even make the hats larger upon request.  That's great - I have a couple from tlc that have to go back -just not big enough. Bold- I have double sided wig tape (can you say \"ouch\" ) that I am hoping is going to help the slipping. But like you, not sure exactly where this thing goes - altho mine has bangs, so I suppose when the bangs hit the eyes, that's about right?!?!  It's kind of like drawing eyebrows -- how do you know where they go exactly when/if the real ones are gone??   My answer to the heat/cooking problem while wearing the wig - I'm just not going to cook (ha ha). also - my onc doesn't routinely give the Neulasta shot either -- I got thru tx 1 without it.  We'll see how tx 2 goes on Wednesday. Hair is hanging (literally) on today - day 20, but continues to fall out -- it's everywhere!  But just need to get thru today at work and then I am home until new year's - can (hopefully) figure out how to wear the wig and the hats and the bangs that I have bought.....but will definitely be bald for Christmas --thank you, Santa!  Cebula and Lisa - you look great -- I agree with Firni - younger does look better!  Sorry, but I am SO not posting my pix!!!! Bren",
      "MessageIndex": 574,
      "PostDate": "22/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 6, 2009 09:49AM Brenny wrote: Day 14 after tx2 -- no discernible SEs mmliv - I am wearing my wig pretty much 15 hours a day and it is not uncomfortable -- so there must be an advantage in the person or facility you go to.  And it does not have to be uncomfortable.   My salon specializes in wigs -- did all the head measurements before ordering it for me.  So maybe rather than just \"making\" your head fit into a wig that is instock or one that has been given to you, there may be something to be said for having the wig made to your size.  Or it may be that my head is just not that sensitive!  But mine is okay for daily wear -- today is the first day I didn't use the double sided sticky tape in the front (and that's just because I left my bag at work and didn't have it).  My wig is the very same style as my Oct haircut, but I chose a little different shade of blonde (it is less brassy) Was gone over the holidays and came back to work yesterday -- where they are not aware of my chemo -- and was delighted when two gals spent about ten minutes discussing my new color -- and neither of them had a clue that it is a wig!!! (One gal loves the softer color, one thought it was just okay).  How funny is that!  And they were looking hard at me and my hair the whole time!!  Sooooo it must look okay! Trying to plan my year -- are most of you thinking that your rads (for those who will have rads) will start about 30 days after your last chemo???? Bren",
      "MessageIndex": 849,
      "PostDate": "06/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 12, 2009 07:32AM Brenny wrote: simvog - just wishful thinking, but you left me off tx3 (TC) on Jan 14. Brenny",
      "MessageIndex": 943,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 25, 2009 03:14PM Brenny wrote: mimi  - I am doing fine -- this is day 12 after tx3 and lots of little complaints, but nothing serious.  Thx for asking! I haven't asked about port removal -- I don't mind leaving it in if we have regular blood work that has to be drawn --sure is easier than looking for a vein! Am also getting nervous about radiation - just the logistics/timing/etc.  Not sure how many tx. I did talk to my onc briefly about \"the next steps\" and the hormone choices coming up.  Mentioned the article I read that approx 31% of women discontinue their hormones due to se's -- he, of course, said, wait and see what your experience is.....but he did say (I think) that of the 3 treatments (chemo, radiation, hormones) that hormome therapy had the biggest impact on reoccurrence -- is that a fact or did I mishear him?? Brenny",
      "MessageIndex": 1145,
      "PostDate": "25/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Feb 3, 2009 06:27AM Brenny wrote: Firni I think one of the most rewarding parts of the LGFB class for me was that I actually got to see a woman bald -- and she was still smiling and going on with her life and looked ok in her wig.  Lots of the attendees were much farther along than me (I still had my hair), so their sharing of information was sooo valuable. Three ladies were wearing wigs that actually looked good, so I was most encouraged that I could also get through this.",
      "MessageIndex": 1274,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Feb 25, 2009 12:26PM Brenny wrote: Even though I am done with chemo, this is still the first thread I check-- still dealing with the lingering SE's.  Watching the eyebrows thin and know the lashes are next. I absolutely die when I catch my reflection in the mirror -- flushed fat face, bald head, weight gain -- good Lord!  And like so many others, the depression has creeped in.  See my onc on Friday and am going to demand something that I can take before I slit my wrists!  Rad simulation on Friday -- that's the March rad thread.  But I hope that everyone continues to post here from time to time -- this is our \"home\" afterall and these are our sisters.  Best to you all!",
      "MessageIndex": 1572,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Feb 20, 2009 10:04AM Brenny wrote: My center didn't do anything for last tx - don't even think they knew. For those in the group who are going on to radiation - don't forget to sign into the rad thread so we can continue to share there. There is a March thread set up. But let's do continue to check in here time to time!!  Couldn't have done it without this group!!",
      "MessageIndex": 1515,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Nov 23, 2008 04:55AM Brenny wrote: StephH - thank you for those encouraging words and I pray that we all remember how much that note meant when we are two years out of treatment and come back and post for those just starting on the journey... A little apprehensive today - tomorrow I go to get my port placed. If anyone else is having one, there is a great description at the top of the forum.  And my chemo \"education\" class.  It throws me to give BC a whole day yet again. Has anyone gone to the LookGood FeelBetter class through their hospital?  It is wonderful (and free) - done by a cosmetologist and you go home with a wonderful bag of new makeup donated by wonderful sponsors such as Estee Lauder and Mary Kay and Chanel.  They also talk about wigs and scarf tying, etc.  We had 3 gals in wigs and 1 just whipped hers off during the time we were putting on makeup.  And somehow the whole thing wasn't so scary anymore.  Went to a second wig consult Friday and am definitely cutting and restyling my hair before I go back to work on Dec 8 (after Dec 3 treatment).  She suggested that I might consider a buzz cut once my hair starts falling out instead of shaving it -- less chance of cuts (infection) and the wig may feel more comfy at first with some hair. simvog - I too am going to try to work thru the whole thing, only taking the treatment day off (but still with my blackberry).  But if one more person tells me about a \"friend of a friend\" who just did wonderful during treatments and you never would have known she had cancer...I am probably going to throw up!  I am doubtful I can live up to that urban myth and I don't want to feel bad about myself when I don't! Nerves are getting the better of me - think I will take an antidepressant this morn! We will get through this! Please keep posting - it's good to know we are not alone!",
      "MessageIndex": 21,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Nov 27, 2008 09:55AM Brenny wrote: Blessed Thanksgiving Day today -- I vow to remember all the things that I am truly thankful for (bc is NOT one of them)!  I survived the nausea caused by the twilight drug used for my port and really the port does not hurt -- just a little stiffness is all and a lot of bruising.  Not sure what I am wearing for dinner today to hide the higher incision.  Between this scar and the lumpectomy scar (both high) -- I will be wearing high collars the rest  of my life (which I hope is long!). Mimi - My hair is also long --going to get it cut on Tuesday to start the transition.  Thought this morning while washing it that in a month I probably won't have anything to wash -- deep breathing and got through that.  As my friend says, put on my big girl panties and deal with it! I too am panicking over first treatment on Wednesday -- my answer is sleep.  Slept most all day yesterday -- maybe just overtired from the reaction to the port placement, but now I am wide awake and it is sometimes hard to breathe.  The nurse who did Chemo 101 training this week was not particularly warm -- didn't see any need for prescriptions to take with me out of town (just in case of side effects), ice is just a myth - didn't work on hair, doesn't work on nails, better locate the nearest emergency center to where I work out of town.....what a bundle of warmth! Meet with the oncologist before my tx on Wed -- am asking him for his opinion. Showed me the chemo room and that was depressing to say the least -- a whole lot of sick people in there it looked like! Oh well, I will be joining the group on Wednesday.  In the meantime, have a good turkey day -- enjoy the food and the friends and the family! I read the Favre book also -- it is very good.  Now I am reading Bald in the Land of Big Hair. ",
      "MessageIndex": 55,
      "PostDate": "27/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 2, 2008 11:52PM Brenny wrote: Well, at least one of 12/3 girls can't sleep tonight!!  Thanks all for your posts; they really do help (both the scary ones and the reassuring ones!).  Went this evening and got my long hair cut -- it actually looks good (at least even strangers at the salon were telling me it did...makes you wonder how bad you have really been looking and didn't even know it!!!) and picked up my wig (Betsy is her name).  So I am \"armed and ready\" for the Christmas holiday! The trees are up, most of the presents are bought and wrapped, but not bowed -- this may be the \"Christmas without bows\" at my house--when it comes to wrapping, I am a lot like Martha Stewart, so it is quite a production. I bought eight pink/white crystal stretch bracelets -- gave 4 to my really good friend who is like a sister to me and has helped me face this -- we take 1 off after each tx is finished (4 TC treatments).  Have the bag packed -- going to take a shower and see if I might get some sleep....will report back tomorrow night! Have been obsessing about flying back to work on Mon -- finally decided I will just wait and see how I feel -- they are not giving out any blue ribbon attendance awards to my knowledge! Brenda",
      "MessageIndex": 145,
      "PostDate": "02/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 3, 2008 08:03PM Brenny wrote: Dec 3 survivor reporting in -- first of 4 TC -- was not a problem, just a very long day.  Started at 9:45 with port setup and labwork, oncologist visit and then the chemo.  Got done at 4pm.  Can honestly say that I had no problem with any of it today....now I guess I just lay back and wait for the SEs?!   No metal mouth, no flushing, nothing.  Firni - my port placement was no problem -- no pain under the twilight drug, just a little stiff neck for a day.  Actually drove myself home after a two hour wait in recovery (nope, they didn't know that and you didn't hear it from me!!).  My only discomfort was that the twilight drug caused me to be nauseous and I wish I would have asked them for a precription ahead of time. I will certainly do so when they remove it!",
      "MessageIndex": 173,
      "PostDate": "03/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 14, 2008 03:25AM Brenny wrote: Mimi - on the wine issue, I went to a party on day 8 after first tx and had a glass of chardonnay that tasted awful --I thought perhaps it was a result of the chemo.  Then I thought maybe it was just the label.  So tried a glass of my old tried and true CA chardonnay and my wine-taster is not broken!  It was fine.  Did your onc say no to wine or have you just lost your taste for it?  I often have a glass before dinner to unwind from the day at the office - maybe I should not during chemo?? Hey - send some of that chicken my way -- I was complaining (smile) that no one has made me a single meal since this whole ordeal!!  (Poor, poor me! ha) I'll take your overstock or your mom who has come to cook, or anything! Day 12 after first tx -- is this the low point for WBC as a general rule?  How does one know if the count is low (other than a blood test)?  I won't have blood work until I go for second tx.  Didn't get the complementary Neulasta shot which seems to be causing a lot of you SEs. Good luck this week to all!",
      "MessageIndex": 368,
      "PostDate": "14/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 21, 2008 10:58AM Brenny wrote: Linda -    Smiled when I read your post - I would be afraid to cook for anyone right now the way my hair is shedding!  If I had a hair net, I would wear one!  I am using the lint roller like mad but every time I move (or maybe just breathe) there is another hair on my shirt!  I'm even afraid to eat my own cooking!  *smile*  You are a day before me, so I am thinking I can get through Tuesday if it doesn't drive me crazy!! I think I am not going to chance washing it in the am -- better to have dirty hair at work on Monday (last day in the office) than no hair at all????  Brenda",
      "MessageIndex": 548,
      "PostDate": "21/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 15, 2009 10:44AM Brenny wrote: Hi ladies, Thanks for missing me - I have been reading, just not posting a lot.  Had tx3 yesterday and all is well, even the constipation \"end\" of it (took pericolace the day before, the day of, and this am and all is well). Was having a little personal pity party for myself yesterday -- came home from chemo (8:30-2:00) and my country driveway needed shoveling.  Out there in my beanie and bald head and shoveling, back hurting, thinking \"I just spent the day in chemo ...this is surreal\".  And then we are having a real frigid spell in OH and carried in about 8 loads of wood....again normal things for me to do but NOT on a chemo day!  And the sad thing is I have a grown son only 2 miles away that actually was off work yesterday.....but if you have to ask.......it's kind of like asking do you love me??? Have stopped seeing the boyfriend of two years - don't think he was ready to handle this whole thing,,,just a bit depressed, I guess. But I am in better frame of mind today....working from home and no particular day 2 issues.  Hope you all are well.  3 down, 1 to go -- yeah!!! Brenny",
      "MessageIndex": 1010,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 27, 2009 09:19AM Brenny wrote: Hi All, I did buy the eyebrow stencils at Sallys Beauty this weekend....just to have on hand.  Amd bought some Cover Girl brow thingy.  Just reminds me of the 50's eyebrows that my mom's friends used to pencil on - that perpetual look of surprise on their face!  Thankfully, my wig does have bangs, which will help some.  Also am doing big earrings and necklaces -- feel that anything to distract you from looking at my face should help! *smile*  Isn't it \"funny\" (ok, not funny at all) that as we wrap up our txs, people seem to think we're finished.....not like we have upmpteen radiations treatements (some do) or five years of hormones (some will).....but am already getting the comments....just one more tx and you're done, doesn't that feel great?????  No......it's just one stretch of the road....... Brenny",
      "MessageIndex": 1165,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Feb 9, 2009 04:01PM Brenny wrote: Awww shucks, thanks everyone!!  I am seriously considering the LARGE hot fudge sundae at Dairy Queen and catching up on three weeks of 24 tonight.   Oh, and did I mention that my nails (which always were pretty awesome) are broken and short and my feet are dry and disgusting????  *smile*  That's it for today, I promise!!   You all are the best--only you can understand that you sometimes just can't smile one more smile and say \"I'm doing fine, thanks!!\"!!!!",
      "MessageIndex": 1382,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Feb 10, 2009 08:13AM Brenny wrote: Drug my sorry a** back into work this morning...it was sooooo tempting to stay home in my funk.  I did have the hot fudge sundae AND then later pepperoni pizza and did catch up on 24 (ever notice that Jack Bauer never goes to the bathroom nor does he ever eat???). And even if I know it's not going to taste good later or cause heartburn (chocolate) -- I still eat it and then regret it later (pitiful). I also have the eye twitching thing mentioned and sometimes watering  I think I may stop at DQ again tonight for another sundae - it was perfect! Hugs Brenny",
      "MessageIndex": 1392,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Nov 20, 2008 04:27AM Brenny wrote: Count me in - I start on Dec 3, four rounds of TC, twenty one days apart.  I get my port \"installed\" on Monday because my veins are so hard to catch.  Made the wig shopping excursion yesterday; it was major emotional and I worked myself into such a headache that I went to bed at 6 last night (and still no wig)! Will this be 'our' forum?  What's in your chemo bag to take along?  I have my DVD player, my blackberry, my lotion and lotion socks and gloves, sugarless candy, pix of my grandchildren, a book, a soft throw, tea tree oil for my nails and q-tips so far -- what's in yours? Is anyone going alone or are you taking a friend for support?  I will be going alone; chemo on Wed and then flying back to where I work on Mon morning.....which may be way too optimistic.....",
      "MessageIndex": 6,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Nov 30, 2008 05:30AM Brenny wrote: Sherry - If they don't call with a reminder, can I claim I just forgot that Wed is my first appointment????  *smile* I also got my tree up and the outside wreaths out.  Shopping is mostly done, just wrapping to be done.  But I had to because I will be leaving town on next Monday and not back until Dec 22nd.  Between that and not knowing how I am going to feel, I figured that I better do it now or Christmas just might not come to my house this year. Firni - any one of us working women could be in your shoes at any time with the way the economy is going.  Don't hesitate to check out every financial resource available, including the American Cancer Society and Susan Komen Foundation -- and the ACS has a program for free wigs for those who can't afford them.  Go to the Look Good Feel Better program and get a wonderful kit of (free) makeup.  At our meeting they also brought a whole basket of hats/scarves that had been donated by survivors (and washed and pressed) -- again at no cost  If you haven't, call your bank and see about refinancing your home for a longer term.  But above all, you have to concentrate on you and getting through your treatments and getting well. For those starting this week, I am sure you are as nervous as I am -- together we can do this! Brenda",
      "MessageIndex": 84,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 23, 2008 08:23AM Brenny wrote: Well, I got my wish!  Betsy (my wig) flew home with me in my carry on bag last night -- today is day 21 (from tx 1) and I do still have hair -- but the shedding is enough to drive me crazy.  On my clothes, in my mouth, I am sure in my food...... I have not washed it since Friday (afraid to) and the brush comes out with gobs of strands of hair.  But now I am determined to hold off until after tx 2 tomorrow and then go to my hair gal and have her buzz it and give me \"put-on-the-wig\" classes.  I can still go out in public today without stares, so have some shopping to do and then finish wrapping tonite and off to chemo 2 tomorrow. Best to all....",
      "MessageIndex": 598,
      "PostDate": "23/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 19, 2009 07:03PM Brenny wrote: I was feeling a little sorry for myself - a friend sent me this inspirational message.. Please watch.  It's only 3 minutes but you'll never forget it.         Your problems won't seem nearly so big after you watch this.    A Giant of a Man - Meet Nick Vujicic - I hope you can see the video - inspiring!    http://www.4marks.com/videos/details.html?video_id=723 (copy and paste)",
      "MessageIndex": 1062,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 6, 2009 04:29PM Brenny wrote: Carlajane We are so glad you found us here! This is a great site -- take the time to read the thread for those stating chemo in Dec (or Nov or Sept) -- there is a ton of info there.  We all have the same questions and concerns and fears -- you can bet someone else has asked your question (more than once)!! I am also divorced and live alone -- you shouldn't need anyone in the house.  There is a wide range of se's -- some poor folks really get hit with all of them--fatigue, nausea, diarrhea or constipation, sores in the mouth, loss of taste, bone pain -- some of us are blessed and have virtually no se's. The one se that almost ALL of us is certain of is that we are destined to lose our hair.  And there is a specific thread on that issue as well.  Many of us are working right through the treatment (except chemo day); some simply cannot.  There are positives to living along -- when you are tired, you can simply go to bed.  You don't have to cook or clean, etc.... They will include antinausea meds in your chemo; just be sure to get and fill a prescription from your onc to have at home and take it if you feel the least bit nauseated.  You won't need to take it in advance.  If you are very stressed, ask him for something to help you relax (and take it!) like Ativan.  At the top of this topic is a great post on preparing a chemo bag to take for your first tx. Good sources for headwear online:  TLC, Chemosavvy, CJHats.  If you shop at local stores, just remember that the hat has to come down further in the back and the sides in order to cover where you don't have hair. TLC has bangs that you can get to wear under your scarf or hat when you don't want to wear a wig. For a good fit, you may want to find someone locally for your wig rather than order online (call the American Cancer Society) who will do a custom fit for your wig.  Also ask them when you can attend a LookGood Feel Better session in your area -- free class, free makeup kit, wig/scarf tip.  Altho you are some distance from your treatment facility, you might inquire from them (or ACS) about Breast Cancer Support Group meetings -- generally once a month.  Great way to meet others and share experiences and recommendations -- usually have a speaker on a petinent topic of interest.  Good luck, post often, read more often!  Ask questions!! Bren",
      "MessageIndex": 317,
      "PostDate": "06/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 1, 2009 12:23PM Brenny wrote: AZ Stacey - good luck tomorrow -- you will most likely not be nauseous at all - and be sure and ask your onc for a prescription just in case you do (and take it as soon as you even think you might be getting nauseous!).  We have a wide range of side effects here - some of us are blessed with next to none and some of us are \"blessed\" with every single one!  There's just no way of predicting -- but this thread has great tips on how to deal with those that you may get!  Let us know how you do - we are all praying for you. I think we all agree that the first tx was the worst -- just not knowing what to expect.  Bren",
      "MessageIndex": 167,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 31, 2009 05:00PM Brenny wrote: I also have not stopped eating my salads - mostly I have made them and try to make sure everything was washed carefully  but my onc didn't put any diet restrictions on me either. And my coffee continues to taste good in the am and my glass of wine in the pm.  No Neulasta shots and WBC seems to be good (taken the morning of tx) -- heaven knows what it does in between......last tx on Wednesday.",
      "MessageIndex": 910,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 4, 2009 05:38PM Brenny wrote: Just an fyi - I am 10 days after tx2 (TC) and I am working straight through - have only missed the treatment day.  It is doable, depending on your SEs. Brenny",
      "MessageIndex": 259,
      "PostDate": "04/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 20, 2009 11:42AM Brenny wrote: Carlajane -  just fyi -- have just finished tx3 TC and I have not had any neulasta shot.  My bloodwork the am of tx 3 showed high WBC (16.6!).  Seems some onc give it routinely as a preventive measure, others wait to review bloodwork results.  I am sooo happy to have not had it as I hear of the se's.  WBC may bottom out the second week after tx, but evidently rights itself in time for my next tx.  Hopefully yours will do same!  My tx are 3 weeks apart also. ",
      "MessageIndex": 642,
      "PostDate": "20/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 14, 2009 09:21PM Brenny wrote: ddlatt -- I did tx3 today (8:30 -2, incl onc visit, etc) -- got home and I had enough snow that the driveway had to be shovelled and wood for the woodburner had to be hauled in -- no time to savor the chemo day -- it was just sort of surreal -- that there I am after a day of chemo physically working my butt off -- out in my little beanie cap and bald head.  Talk about a pity party -- I do have an able bodied son who lives only a couple miles from me....go figure.   Oh well, tomorrow is another day and maybe it will help me sleep the steroids off tonight! and I love the posts about people bringing dinners....is it just me?  No one has cooked me a thing!!  I am tired of being Wonder Woman!!!",
      "MessageIndex": 531,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 27, 2009 02:50PM Brenny wrote: misty123 - not all wigs itch - the new, nicer ones don't.  But there are also nylon wig caps or gel bands if it were a problem for you.  Good luck and hang in there!",
      "MessageIndex": 803,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Feb 21, 2009 05:20PM Brenny wrote: When I attended the Look Good Feel Better class sponsored by the Amer Cancer Society, the had a large basket of scarves and hats that had been donated.  The gal said they had washed/cleaned them all and they were free to anyone there.  That's what I will do with mine.  The ACS also takes used wigs and then recycles those to patients who cannot afford a wig.",
      "MessageIndex": 1281,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 26, 2009 11:22AM Brenny wrote: Majanumba1 - I attend our BC group meetings when I am in town at our center.  They are really a great oppy to network with others - just like our forum, except they always seem to have some info on local resources that I wouldn't know about. Topics have been of interest and often one of the ladies brings a friend/sister/daughter. I also attended the LookGood Feel Better class offered at our center (thru the Amercian Cancer Society) and that was excellent.  I would enourage you to go!",
      "MessageIndex": 1150,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Nov 20, 2008 12:12PM Brenny wrote: I am 58, divorced after 33 years, an only child and both parents are dead. I have a grown son, lovely daughter in law and two fabulous grandchildren whom I want to see go to the prom and graduate and get married and give me great-grandchildren.  Their pictures are in my chemo bag and on my bathroom mirror to remind me that this is all going to be worth it.  I am praying that every time I look at that mirror and see my bald head that I will see them looking back at me telling me what really matters. horsercn - the front laced wigs are called monofiliment (I think) and they do look much more real.  My hair is fairly long now and really thick and my head is very large and it was just really hard to try to find anything that was even remotely acceptable.  Then after I regrouped, we discussed with the hairdresser what might look best with my face/features and tried on a couple shorter wigs that both she and my friend swore looked better than my real hair.  So I am thinking about going next week and getting my hair cut like the wig (instead of a wig that looks like my current hair style).  Also went online this am to headcovers.com and ordered some \"bangs\" - to wear under a hat or scarf or turban to look like your hair. And ordered a sleep turban and a couple hats....more tears but this time it was at 4 am in the privacy of my home, not in the middle of the wig shop!",
      "MessageIndex": 10,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Nov 30, 2008 05:50PM Brenny wrote: Good Luck to the Monday group -- together we can do this!",
      "MessageIndex": 95,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 7, 2008 05:43PM Brenny wrote: Just touching base - first TC tx was Wednesday and I have done okay, I think. No metal mouth, no funny tastes, a little nauseous (took my pills which made me sleep). Am packing tonight to fly to work in STL on Monday morning -- two weeks there before I come back for second tx. Hang in there all!!",
      "MessageIndex": 231,
      "PostDate": "07/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 16, 2008 06:01PM Brenny wrote: Cinda/Lisa - I'm joining your club after my discussion with the *#*@& insurance lady this afternoon -- they too won't pay for a wig regardless what you call it.   Big time just annoys you - Blue Cross Blue Shield AL -- maybe just our crappy plan - but you can bet I am going to at least make our HR/Benefits Dept aware of it.  And the customer service agent - just a warm, sympathetic, caring person......NOT!  I know it's not HER decision or her plan, but she could at least be nice about it!! Bren",
      "MessageIndex": 438,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 16, 2008 06:06PM Brenny wrote: Cindyrellacleans - we all either have been or will be where you are today.  My \"big hair day\" will probably be tomorrow since my first chemo was Dec 3. And I will cry, despite the fact that I know it's coming...and today when I talked to the insurance co about wig (excuse me, cranial prothesis), the customer service gal made me cry.  No coverage and she made me feel stupid for asking her to double check.  Your NJ program is awesome - cudos to the state!!",
      "MessageIndex": 439,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 20, 2008 09:43AM Brenny wrote: Hair is shedding biiigggg time last nite and today - (first tx was Dec 3) -- wore a black sweater to see the Rockettes last nite -- big mistake for blonde hair!  I am just not touching it -- not sure what my game plan is.  I have my wig....but.....maybe maybe maybe I can make it through Monday and get back to OH Monday night with hair.....I am just not handling this well, not at all.  Oh dear!",
      "MessageIndex": 522,
      "PostDate": "20/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 30, 2008 07:14AM Brenny wrote: Bold -  You are doing just great - and you may be pleasantly surprised to find you have very few side effects.  Some of us have almost none - others are hit with them all.  Not sure the rhyme or reason (I think there is none) -- but I have been blessed with few. I also have not had to have the Neulasta shot either (knock on wood) - have 2tx down and 2 to go.  A little tired, a little metal mouth, a whole lot hairless, but overall, not bad.  I pray that you experience the same! Good luck! Bren",
      "MessageIndex": 699,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 2, 2009 06:26AM Brenny wrote: simvog - hope your spirits are up a bit today.  apfuentes/lktracey - hang in there!  I got my bangs and hair halo (chemosavvy) this week and played with them yesterday.  The bangs are wide and  just hook onto a wig liner or cap and they will give the appearance of hair -- I wore them yesterday with a knitted cap and the look was okay.  They will be good when the weather gets warmer and the ball caps come out.  The halo looks like wig hair (med length - sort of a page boy) but has no cap -- again cooler for warmer weather.  Very pleased with them both -- will be good weekend options.  I will wear my wig to work everyday so will probably be ready for a break by the weekend. Going to see some old friends this eve - good friends that get together once a year -- will need to gently break the news to them -- wanted to do it in person rather than otherwise..... Bren",
      "MessageIndex": 756,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Nov 26, 2008 09:57AM Brenny wrote: Just an update - I got my port placed Monday afternnon in anticipation of my first TC tx on Dec 3rd.  Port incision is not pretty today -- they just used some twilight drug. I was awake the whole time and only felt a couple pin pricks.  The port incision is stiff today but really doesn't hurt - maybe a little sore throat where they went into the jugular vein. But evidently I don't tolerate the twilight drug well because I was then nauseous for 24 hours - throwing up, couldn''t hold my head up -- miserable.  Finally took an anti-nausea suppository that my friend had and it worked.  Next time I will know better and ask them to give me something in the IV.  Today I am back among the living - thought to myself that I can't even tolerate this little drug - how in the world am I going to make it through the SEs of chemo.  Not very proud of myself today! As the first treatment day looms closer, getting more and more apprehensive. Aren't you all?  Anything you can do for that?? Brenda",
      "MessageIndex": 42,
      "PostDate": "26/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 5, 2008 09:30AM Brenny wrote: Good morning ladies -- first TC on Wed - it is now Friday and I am feeling fine.  Took my Lorazapin (?) for nausea and slept like a baby for the last two nights.  Eating is fine, no side effects yet....waiting for he shoe to fall!  Smile  No Neulasta shot after this first tx.  May be heading to the office on Monday (only 1 1/2 hour fligt)....stay tuned.  Hope you are all doing as well. ",
      "MessageIndex": 198,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 9, 2008 02:39PM Brenny wrote: Zuffa - we are pretty much on the same schedule, I think (Dec 3).  My first day back in the office was yesterday, but I had to get up at 3am to catch a 6:30am flight, so you know what I did when I left the office - straight to the apt to eat and to sleep!  Today has been okay - but not intending to spend any late nights here like I usually do --I was in bed by 9 last night!  Thought I might stop at Best Buy tonight on the way home, or maybe I will just wait until the weekend.  I love the ice cream story!  This tx certainly has not hurt MY appetite! My port has been pretty much a non -issue too.  I sleep on it with no problem.  Finally touched it after a week--they explained that it is kind of like an inverted pop bottle top with a little spongy cover.  Mine has a pretty good looking scar -- ready for some Mederma I guess! Texas357 - you did move fast with your hair didn't you?  I was hoping to make it back to OH on 12/21 without having to wear my wig (then could get my buzz from the beautician) , but I'm thinking that is so NOT going to happen--that would be 19 days from first tx.  Hope I can figure out how to get it on!  Couldn't do any \"wig training\" classes because my (existing) hair is too thick for it to go over!  Oh well, it will all work out. I did bring it with me. Everytime my head itches, I am thinking, maybe it's starting......or maybe it is just an itch....aaaaggghhh!",
      "MessageIndex": 272,
      "PostDate": "09/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 11, 2008 12:08PM Brenny wrote: Lauren - I felt the same way about the hair -- and I was trying to explain it to a writer who is doing a piece for the Look Good Feel Better program - that perhaps this \"right of passage\" was something that I could control at this point when everything else was spinning out of control.  And I do actually like my new short hair - too bad it will be going!  Last nite at a little company outing, one of the gals at my table said how much she liked my new hair and I said something back, to which she replied she didnt like her hair, but it was better than being bald...which she had been. I am thinking that she and I will have another conversation - not sure what she had, but I hope that someday I can be that forthcoming in a public situation.  mmliv - I have been one of the blessed ones with basically no SEs after the first tx (knock on wood?).  This is day 9 and other than really sleeping hard on day 3 or 4 -- got nothing to report.  I know that each tx is different and I am sure I will \"pay\" for this easy one....but.....I just consider every good day one blessing at a time!! Look Good Feel Better - if you haven't, call the ACS and find out where/when it is in your neighborhood - it is wonderful.  It is free - you do get a generous new makeup kit (germ free) and lots and lots of good tips on scarves and wigs and hats.  They encourage you to bring a friend with you (they do not get a kit) - make it an outing. CindaD - I think I might go back into the Guidance counselor's office and shut the door and educate this guy on either the fact that he's an insensitive moron or an uneducated doofus -- explain to him what hair means to those of us on this forum and our identity...in the hopes that he will never make a comment like that to anyone again.   Hang in there, all!!",
      "MessageIndex": 322,
      "PostDate": "11/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 14, 2008 05:58AM Brenny wrote: Firni  We obviously are both up very early this a.m......did you also get the little Chemo & Sexuality book that strongly suggests avoiding intercourse during that second week between chemos??  I haven't seen anyone make note of that......",
      "MessageIndex": 370,
      "PostDate": "14/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 14, 2008 08:05PM Brenny wrote: Too funny, ladies. I didn't bring my little Sex and Chemo handbook with me to STL, but the onc suggested refraining the second week after chemo because of your increased susceptibility to infection due to what is probably your lowest blood count.....now when I go home on the 23rd, I will actually read the book and see if it says no sex, or perhaps only sex with condom.  In the meantime, I'm here, he's there, and it's not an issue..... My glass of wine tasted fine tonite; I am going to try a red and see how that goes -- I am not usually a red fan.  Makes sense that you refrain the days immediately before and after tx. One glass per cycle???  I don't think so!  That would be equivalent to no sex!  Maybe a glass two or three nights during week two.  I have also been drinking Crystal Light Tea and water, water, water. I did buy a treadmill for the work apartment -- just don't see me going to the company gym with my little beanie and wig in tow. And the weather is starting to get pretty crappy, so..... Good luck to the Monday warriors. ",
      "MessageIndex": 383,
      "PostDate": "14/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Dec 15, 2008 02:53AM Brenny wrote: Caroline, I have been drinking a lot of Crystal Light, both the iced tea and the lemonade.  They also have little packets that you can just add to your bottled water -- peach tea and raspberry.  Seems to help get the liquids down for me. ",
      "MessageIndex": 390,
      "PostDate": "15/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 19, 2009 06:12PM Brenny wrote: simvog - sorry for your delay in tx!  Put me down for TC tx4 on Feb 4 -- the last one! Firni - hope you are doing better today -- sometimes I think trying to be Wonder Woman just gets to be too much and pulls us under!!  Day 6 after tx3 -- doing okay.  Broke another nail (unbuckling the setbelt) - they just aren't what they used to be! And I am guessing they aren't going to grow back any time soon....",
      "MessageIndex": 1059,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Jan 28, 2009 05:54PM Brenny wrote: Firni This may sound really masochistic, but I use double sided wig tape on the front of my wig (there's a little vinyl strip at the front - about 2 inches long.  This makes really sure nothing slips or moves.  And I also used the tape with my mailboy hat when I was going out, but used it in the back -- I didn't want it sliding up. Does it hurt when you take off your wig - maybe like a bandaid -- nothing more.  But I like that \"extra\" comfort of knowing it's not going anywhere! Brenny",
      "MessageIndex": 1201,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Feb 5, 2009 06:38AM Brenny wrote: Good news - yesterday was tx4 (TC)--chemo is officially done and I removed my last chemo bracelet (I had bought from TLC I think, four pink crystal bracelets, remove one after each tx)!!  Feeling fine this am, slept well (obviously the steroids don't affect me!).  My WBC before chemo was 21.6! Without neulasta shots!! Onc wants to see me on 2/27 and my rad simulation appt is 2/27.  Totally in the depression mode - deciding this whole thing AND my life SUCKS!!! Best to the rest of you doing tx this week and next! ",
      "MessageIndex": 1312,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Feb 9, 2009 11:27AM Brenny wrote:",
      "MessageIndex": 1375,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "Brenny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72798/profile",
      "Content": "Feb 24, 2009 09:27AM Brenny wrote: Update for missing eyebrows ---   Did anyone see the model on the Academy Awards show who was wearing \"eyebrow extensions\".....I kid you not!!  Said her brows were overplucked and this was something new....wonder how much that little cosmetic procedure costs????? Unfortuntely, I think I will just have to pull my wig down a little further in the front and hope the bangs cover the brows!",
      "MessageIndex": 1549,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    }
  ]
}