{
  "AuthorID": "brendy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76654/profile",
  "Posts": [
    {
      "AuthorID": "brendy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76654/profile",
      "Content": "Feb 6, 2009 10:52AM - edited Feb 6, 2009 10:57AM by brendy Thanks everyone who responded  I really appreciate all your comments. I will look into Breastfree.org. Also, in response to Ibrewer I am considering the diep flap I had a consultation and the Doctor recommended a stacked diep flap with breast recon/lift for the other breast. I am constantly going back and forth about what to do. I am afraid of  having surgery on my abdomen as well as both breasts, though wearing breast forms I'm not sure how that will work out either. How was your Diep flap experience?  Any permanent numbing or abdominal tightness etc? Thanks, Brenda",
      "MessageIndex": 4,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/728556",
      "Title": "Can't decide about reconstruction or not brendy brendy"
    },
    {
      "AuthorID": "brendy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76654/profile",
      "Content": "brendy wrote: I am facing a unilateral mastectomy and I can't decide if I should reduce my one side (I am a droopy C cup right now) and make it smaller large A cup/small B and have just the mastectomy on the other breast. I am concerned about feeling really lopsided and back and shoulder pain, I already have some soulder and neck problems and I don't want to add to this significantly so I thought maybe making the other breast really small would help. I read that if you have unilateral mastectomy with reconstruction you need to wear a weighted prosthesis to prevent back pain?  Has anyone reduced the other side to be more symmetrical along with mastectomy on the other breast?  Also, I live in a hot climate. I heard the prosthesis can get hot?  Thanks so much. Brendy alon Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/728556",
      "Title": "Can't decide about reconstruction or not brendy brendy"
    }
  ]
}