{
  "AuthorID": "brendafromf…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
  "Posts": [
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 27, 2008 03:18AM brendafromflorida wrote: I also don't know about layered microcalcs, but you definitely need to alert your BS about the treatment you received from that radiologist.  When we are going through something like this, that type of treatment is absolutely uncalled for.  I am relatively sure your BS has choices in the field of imaging.   There are tons of hospitals, imaging centers, etc. to go to and I am sure there is a better rad out there.  While it sounds like you don't have BC, don't stop until you have a definitive answer, especially with your history.  Good luck to you, I hope everything turns out OK for you. ",
      "MessageIndex": 2,
      "PostDate": "27/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/726386",
      "Title": "Now what to do? ccare ccare"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 17, 2008 11:00PM brendafromflorida wrote: I had a PET scan that showed 2 nodes, but when the pathology came back there were 5.  The onco was not pleased with this report.  I guess he was hoping the PET was accurate. I know what you mean about the reeling.   Everyday seems to bring something else to think about that you did not plan for.  Never in my wildest dreams did I think this would be in my future.  Keep us posted.  I will let you know tomorrow after I see my onco.   I hope he will set my schedule then.  I am scared but anxious to get started.  ",
      "MessageIndex": 5,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 26, 2008 11:17AM brendafromflorida wrote: Well, I just got a call from the chemo center cancelling my appointment for today.  My trial drug did not come in so we cannot start.  They will call me Monday to reschedule.   Will let you know then what my schedule will be.   Bummer, I had myself all prepared.   Nothing I can do, though so I will spend the weekend enjoying myself, maybe shopping for a wig.   Lisa, what were the side effects from the Neulasta shot?  My man is wigged out about that.  He went through chemo 25 years ago and, of course, that wasn't available then, so he is very concerned about the pain related to the shot.   It would help just to let him know how you made out.  I hope to get started early next week.  Hugs to everyone.  ",
      "MessageIndex": 71,
      "PostDate": "26/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 26, 2008 11:49AM brendafromflorida wrote: Thanks so much Lisa.  That makes me feel a bit better.  I have a hairdresser friend who I am going to enlist to come to my house when I am ready to chop my hair.  My oldest son lives in Providence and will be coming down in a week or two.   He has never had really short hair, but said he is going to get buzzed with me.  That will be fun.  I suppose I will start Tuesday of next week.  Glad to hear you are not feeling too bad.  Talk soon, Brenda",
      "MessageIndex": 73,
      "PostDate": "26/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 1, 2009 04:09PM brendafromflorida wrote: Snowbird, dinner was great.  We have this great little intimate sushi restaurant that has the greatest sushi and rolls I have ever had.  Very reasonable also.  Family owned and we have gotten to know them so they give excellent service.  I am feeling better today.  After seeing the BS yesterday, she told me to load up on Vit.C about 2000 mg per day.  Started that yesterday so I htink she was right.  She aspirated again but didn't get as much fluid.  She said she is pretty sure that is all of it.   Auriga, I understand how you feel.  I am the same way.  You feel like you must entertain no matter how bad you feel.  I say tell her emphatically not to come.   You have the right.  You have to do whatever you feel comfortable with.  Remember, while you go through this, it is ALL ABOUT YOU!!!!!    My DSO (dear significant other) tells me that all the time.  For all of you starting tomorrow, good luck.  I love the pacman reference.    I hope none of you have a hard time.  I had a port inserted in my arm on 12/11.   The first week or so was very uncomfortable, but now I can barely tell it is there.  I have terrible veins and the port was the only option for me.  HUGS!!!!!!!!   Bren",
      "MessageIndex": 168,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 1, 2009 09:21PM brendafromflorida wrote: Hi Shavon and Carmen, welcome to our group.  Nice to have you but sorry you have to be here.   Carmen, what is your dx?  you are about a month behind me in dx but we are starting chemo the same time.   I have 4 rounds of A/C with the addition of a clinical trial drug or placebo.  Not sure what I will get.  After that I have Taxol but not sure how many rounds.   Radiation after that.  If you have not already read through the posts, there is a lot of really good information on what you should have on hand to help you through the side effects of chemo.  If you need help let us know, we can guide you through to find everything.  Shavon, I am so sorry.  This should be such a happy time for you and you get hit with this.  We are all here to listen, support or anything else you might need.  Both of you remember this:   You WILL get through this.  It isn't going to be easy, but you will kick it.   HUGS!",
      "MessageIndex": 174,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 2, 2009 01:34AM brendafromflorida wrote: Renrel, somehow I cannot picture myself doing the bald look.  I guess I will try it around the house for a while, but I am going to stock up on hats and scarves also.  My son picked out a great hat for me.  I pulled all my hair up out of sight and it actually looks pretty good.  I know what you mean about the well meaning friends.  I am actually lucky enough to be working from home most of the time because it is really hard to face everyone at work knowing they feel sorry for me.  I know they are just concerned and really want to help, but it is just so much easier not to deal with it on a daily basis.  We actually had our surgery on the same day.  It is just me and my significant other.  I haven't really had anyone coming in to help.  I was actually working on the 3rd day after the surgery.  But all I do is work on the computer.  I have wireless, so I can actually do my job without getting out of bed if necessary.  Sounds like you have had a busy couple of days.   Get some rest and enjoy your quiet time. ",
      "MessageIndex": 184,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 5, 2009 08:07PM brendafromflorida wrote: Pamela, I had numbness and swelling.   Still do to some extent.  My mast was 11/11.   I think the numbness stays for a long time.   I also built up some fluid after the drains were removed.  I was aspirated 3x after that.   The last time was last week.   Not sure how normal that is.   My BS left quite a large amount of skin which resulted in a couple pockets where fluid could accumulate.  That is for my reconstruction which I will have done after my treatments are complete.  I did very well after the surgery.  I only missed 2 days of work.   But then I was able to work from home.  Made a big difference.    I posted a pretty complete rundown on my surgery last week. ",
      "MessageIndex": 284,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Mar 22, 2009 02:49PM brendafromflorida wrote: Hi everyone.  It has been ages since my last post but I have been reading most of yours.  Sounds like we are all really sick and tired of being sick and tired.   I admire all of you who have serious se's or other family issues.  We will all get through this with patience, love and prayers. I have not been doing well myself.  I have been so weak with chemo induced anemia that I can barely make it from one room to the next.  Low hemoglobin has forced 2 transfusions, (2 pints each time).  First one lasted less than 3 weeks before the count was in the toilet again.   This one brought it back up significantly, so I am hopeful that it will last longer.  I feel much stronger this time.  I still have 10 Taxol treatments to go.  My last one on Thursday was not done because now my WBC was too low.  UGH!!!   They ordered neupogen for me to give myself shots for the 3 days following each treatment from now on.  I am also in a clinical trial for Avastin but only get that (or placebo) every 3rd treatment.   Luckily, I have not had too much in the line of other se's.  Not sure if I could handle much more.  I do have some back pain and shoulder pain, and oh God, I wish the feeling in my mouth would go away.  The only way to describe it is after you burn your mouth taking a sip of hot tea or coffee.  But it never goes away.   Anyone else have that? LisaLisa, I agree that it gets more difficult with each treatment.  We know it is the best thing for us but still don't want to go.  Now finding out I will have to go for another week is really frustrating.  You have had such a tough time with your infections and everything.  Keep your chin up.   You're almost there.   Here is hoping a good week for everyone and congrats to all who are finishing tx.    ",
      "MessageIndex": 1623,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Aug 5, 2010 01:57PM brendafromflorida wrote: Hi Jewels, It has been forever since I have been on here.  It has been a very busy several months for me.  It sounds like everyone is doing well.  I'm sorry there are just too many posts to respond to each of you.  I think of you all often even though I haven't been here.  I started my recon in January.  Developed a horrible, nasty infection and wound up in then hospital for a week on IV antibiotics the first week in Feb.   I had a TRAM flap so now I have a really flat stomach.   Love that.   Because of the infection we lost some tissue from the new one.   He did a bit of repair and a lift on the other one but they still don't match.  What a process.   But at my age (64) to have one good one is something.  My PS said after the surgery, \"You have one perky boob there.  Looks like a 16 year old)\"  I'm sure he was exagerating but it was nice to hear.   I see him again in Oct. to see about an implant in the new one to bring it more in line with the perky one.  The radiated skin has not been easy to work with so he has really been challenged.   He is wonderful though.   I really like him.   Tissue taken during the lift on the other one was all clean.   WOOHOO!   All my follow-up appts. with onc have been going well.  Everything is clean.   Lymphedema is really annoying but something I have to live with.   Lots of love to you all and good luck with everything.  ",
      "MessageIndex": 3731,
      "PostDate": "05/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Aug 15, 2010 11:32PM brendafromflorida wrote: Thanks for all the support.  It really helps.   Reading all the posts are many times encouraging and sometimes heartbreaking.  It is so hard to hear about children with a chemo future.  Jess, I agree a wet noodle is in order.  Unfortunately, the ones we love most are the ones who also hurt the worst.  I know they can't possibly realize how much.  Hang in there.  I battle a bit of a different situation.  My SO has been so supportive but he still treats me as if I am still very fragile.  I am trying to be strong and well and I don't want to be constantly reminded that I am not.  I know he means well but it is hard.  i guess I will need to speak up.  Phyllis, glad to hear you are doing well.  Yeah, those drains are a pain.  I only had 1 this last time but i still hated it.  I am doing well now.  I am pretty sure we will be able to complete the process in Oct.    I know my foob will not be perfect because of the damage done by the infection, but i will be happy if it the same size.  Not like I will be going topless anywhere.  Stay strong everyone.  Every day is a challenge to not think about recurrance.  Anyone having problems with lymphedema?  I can't wear the compression garments all day without my hand swelling even more than without them.  My arm also really aches with them on.  It may be because I am on computer all day at work.  That's it for now.  Big hugs!!!!!!",
      "MessageIndex": 3747,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Oct 16, 2010 06:20PM brendafromflorida wrote: Hi Jewels, I haven't been around for a while again, but today is my cancerversary and figured I should see how things are going for everyone.  Sounds like we are all having the same thoughts and concerns.  Lady Jane, congrats on your walk.   I am actually doing Making Strides Against Breast Cancer walk in Daytona Beach next Saturday.  It is a 3 mile walk.  I did it last year so hope I can muster up the strength to finish again this year.   Last year was very emotional since I had just finished all my treatments.  Hope to enjoy the walk a bit more this year.   I saw the onc on Thursday.  Everything seems good, just waiting for blood work results.  The week after is always stressful hoping not to get a call from them.  No news, good news is what they tell me.    I will be happy when next Thursday gets here and I haven't had a phone call from them.  Had mammo a couple weeks ago and that was all clear.  I was sure it would be though because when I had my surgery in June, (lift on the good one), they sent tissue for analysis and that was all clear.   My hair came back very curly.  Straight as a poker all my life.  It is now losing some of the curl but I am keeping it very short so it still has a bit in there.  I was told that usually a year after your hair comes in, it usually changes again.   That's what happened with me. LEG CRAMPS!!!  I can relate.  I would get terrible ones.   Onc says it is from the Femara in my case.   He recommended taking calcium and magnesium every day and it really helps.  Doesn't eliminate them but I don't get them as often.  I will certainly remember next month for Lung Cancer.  The mother of one of my good friends from work is fighting now.   Take care everyone.   HUGS, Brenda",
      "MessageIndex": 3834,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Oct 24, 2010 09:03AM brendafromflorida wrote: Just wanted to share this with everyone.  I walked in the Making Strides Against Breast Cancer walk in Daytona Beach yesterday.   We had close to 9000 participants.  It was amazing.  The survivor's walk during the ending ceremonies announced 1244 years of survivorship.  That should give us all hope for a long and happy life.  It certainly inspired me.   There was a woman pushed in a wheelchair who has 46 years behind her.   How great is that!    Anyway, just wanted to share some positive news with everyone.  ",
      "MessageIndex": 3841,
      "PostDate": "24/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Sep 5, 2011 12:25PM brendafromflorida wrote: It has been a long time since I have been here, but that doesn't mean I haven't thought about each of you.  It seems like everyone is doing well.  I have had an eventful year.  I finally retired and am enjoying a life free of the stress of the ratrace.  I wasn't really ready to retire but due to changes within the upper management team, I found it impossible to stay.  It's all good though.  I am so happy with my new life.  The beach is my new office.  Doing whatever I want to whenever I want to is absolutely a new and very welcome change.    I am trying to figure what I can do in the line of volunteer work.  Anyone have any ideas?   My next 6 mth onc visit is next month and hoping again that all is well.  Reconstruction is complete.  Didn't go quite as well as we had hoped due to a severe infection after the first surgery, but I do have a boob and that is so nice.     Hope everyone continues to receive good reports and enjoy life.   Much love, Brenda",
      "MessageIndex": 4112,
      "PostDate": "05/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Apr 30, 2009 05:37PM brendafromflorida wrote: LisaLisa, just voted.   Good luck.   Essay was fantastic.   Kim, as I told you on the other thread, I will find out Thursday where I fall in the study.   I, like you, have mixed feelings. I had my consultation with the radiation oncologist on Monday.   Same as LisaLisa, they will make a mold of where I will be positioned.   I will have blasts to the chest wall as well as the lymph nodes that are into clavicle area.   I had 5 positive nodes of 22 taken, so he wants to be sure he gets them all. Kim, I have also been having recurrance thoughts.  I guess it is something we will carry in our thoughts forever.  Try not to let it take over your thoughts, though.  You are tough.   You got through all this.   There is not much we can do except deal with it if and when it happens.   It may be a bit easier for me since I am older (63), but I have realized that we have to deal with things as they come.  My Dad was a worrier.   If there was nothing valid, he would manufacture something. Drove me insane.   My Mom, on the other hand always just took one day at a time.  I lost her much too early in my life, (I was only 36) but I also took much from her outlook on life and her way of dealing with problems.  I really miss her now because I know she would have so much to tell me that would help with this journey.    Sending hugs and positive thoughts.   ",
      "MessageIndex": 2184,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "May 21, 2009 03:26PM brendafromflorida wrote: Whew, it is finally finished!   Last chemo is done.  YEAH!   The Onc came in when he was told it was my last treatment and did a juggling routine.  He also sang Happy Birthday to one of the chemo nurses.   It was very comical.  He is such a regular guy.   Today was a great day.   Other patients and their families were happy for me even though they still have many more weeks to go.   I took a Thank You card and candy in for the nurses.   They have been so supportive and kind during the process I wanted to do something for them.  I did have my last tranfusion on Tuesday.   My hemo is 11.7 today.   That is VERY good for me.   Hopefully, it will not drop after this last treatment.      Next week will be a busy week.   PS on Tuesday, Lymphodema clinic on Wednesday and MUGA scan and EKG on Thursday.   June 3 I see the rad onc again for the simulation.  I think we will probably start the radiation the next week sometime.   It is hard to explain the rush of emotions that fell over me as we were driving to the hospital.  Those of you who have finished can most likely relate.  I am so very happy to be finished with this part of the journey, but then I really can't help but think about the future and if the treatment is sufficient.  Don't get me wrong, I don't want any more chemo, but hope it did the trick.  Kim, congratulations on your completion also.  On an earlier post you asked me about AI's.  I will getting some type of hormone therapy after the radiation is complete.  The only thing we discussed so far that it would be pill and I would take for 5 years.   I see the onc again early August so will find out then.   I am post menopausal and I know this makes a diffence in the type of therapy.   I will cross that bridge when I get to it.   I have some fine peach fuzz beginning to grow.   All very white at this point.   That'll be interesting to see what comes in.   Eyebrows very sparce but still a few there.   Eyelashes pretty much a thing of the past.   Anyway, again January Jewels, love to you all.   For those of you who are close to the finish line we will be here to support you and for those who still have a way to go, hang in there.  ",
      "MessageIndex": 2396,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "May 22, 2009 04:33PM brendafromflorida wrote: Thanks, everyone for the congratulations on completion.   It is a really great feeling to know that part of the journey is now complete.   Knowing you all were here was a great help.   LadyJane, I was on weekly Taxol and one week my WBC was down to 2.2.  They did not do the treatment and prescribed Neupogen, 1 shot each day for 3 days after treatment.  I gave myself the shots.  That kept the WBC at an acceptable level, most times close to 4 but a few times including yesterday it was down to 3.2.   You may want to ask about the neupogen.  The Neulasta can only be given if the treatments are 2 weeks apart.  It stays in your system longer.   Hope that helps. I see a few a finished today.  It is getting hard to keep track now.   We should all be close to the end of the chemo.   YEAH for everyone!!!!! For those of you who have been finished a few weeks, how long does it take for the taste buds to come back and for the numbness in hands and feet to subside?   Those are the things that are the most annoying at this point.   Great holiday weekend to everyone.",
      "MessageIndex": 2414,
      "PostDate": "22/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Oct 1, 2009 03:04PM brendafromflorida wrote: http://main.acsevents.org/site/TR/MakingStridesAgainstBreastCancer/MSABCFY10Florida?pg=entry&fr_id=19837 My team name is BB Dolls.  Small team but a lot of heart.  I have raised about $400 so far and still trying.   I hope I can complete the walk.  I think it is 3 miles.  I haven't walked much lately, but I am giving it my best shot and will go as far as this old body will take me.  This month is also my cancerversary.  I think that's what we are calling it.  10/15 is my day of the dreaded phone call.   I know that is going to be a difficult day.   Thanks KT for the link on lymphedema.  I will check it out.  Stay strong everyone.",
      "MessageIndex": 3205,
      "PostDate": "01/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "May 9, 2009 06:10AM brendafromflorida wrote: Hi everyone, I haven't been here much recently because I have really been having a difficult time.  I am feeling much better now because I have been unblinded in a clinical trial I have been participating in.   I had a treatment on Thursday and I was getting the test drug, Avastin, but Thursday was my last dose.   Thank God.  The other ARM of the study would have required another 6 months of treatment every 3 weeks.  I had mixed feelings about it for the last few weeks and began praying that if I was getting the drug I would be in this group.   I couldn't bear the thought of going back after rads for another 6 months of chemo.   I have 2 more Taxol the next two Thursdays and I am DONE WITH CHEMO!!!!!!!!!!!!   How good it is to say that.   Congratulations to all of those who are close or finished.   It is such a good feeling.   On the nail issue, all my nails have ridges.   None have fallen out, but my big toenails are really tender.   It's weird because my nails have never been very strong.  Now I have 3 or 4 that are really hard and all the others are very soft and actually bending down towards my fingers.  YUK! I have my rads sim on 6/3.   Another MUGA and EKG because of the clinical trial on 5/28.   I haven't had energy to move, much less exercise through this entire 5 months of tx.   I am hoping  some of that energy returns during rads.   For some reason I woke up at 4 AM and can't go back to sleep.   I will try again in a bit.   Don't think it would be the steroid since I had that on Thursday morning.   Good night everyone.   You are all awesome and it is so good to know there are others out there to help us through this.    Lots of love to all the Jewels.  ",
      "MessageIndex": 2278,
      "PostDate": "09/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "May 18, 2009 11:53AM brendafromflorida wrote: Congrats to everyone who is close to or finished with their chemo.   I thought the last one would never come.  Thanks to everyone here for your support, cyber hugs, love and suggestions. I'm off to be typed and cross matched for yet another transfusion.  I was hoping to get through without another one, but the hemoglobin just will not cooperate.   This will be the last one.  Just wanted to touch base and let everyone know we are all on this road together and we will stay around until we all have reached our final destination.   Love to everyone.  I will have to catch up on all the posts a little later. ",
      "MessageIndex": 2360,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Oct 17, 2010 08:28PM brendafromflorida wrote: I think we are destined to be forever hypochondriacs and I also think that is OK.   Before my mammo on the lifted side, I felt something that I was sure was another lump.   Probably just scar tissue because the mammo was clear.  I worry about every little pain I get.  There is so much going on in our bodies from surgeries, chemo, radiation and LE that it is hard to keep everything from seeming like something.   Hopefully that will go away eventually.   Not sure if I have already said this but, LE sucks.   I have pain in my neck also.  My wrist is very sore, shoulder kills me and I think that is all from being on computer all day and then laptop at night but mind tells me it's in my bones......   Can't seem to turn it all off.  I'm considering retirement soon.   Really getting tired of the rat race and looking to enjoy my life more.  My blood work is finally improving but still very low end of normal or just outside that. ",
      "MessageIndex": 3838,
      "PostDate": "17/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Sep 7, 2011 11:28AM brendafromflorida wrote: Renrel and Kate, thanks so much for your suggestions.  The LE is my most disturbing side effect of this disease.  I lost 22 lymph nodes and it has been a struggle.  I was lucky enough to change therapists who suggested a new pump made by Flexitouch.  Most therapists are not really positive regarding any type of pump but this one is a bit different.  Thank God I still had very good insurance at the time and I was able to get the machine without a dime out of pocket.  It is one hour a day of massage and movement of fluid.  It keeps it pretty controlled.  I also have a Reid sleeve which I wear at night.  Please check it out.  While it doesn't completely remove all fluid and the arm and hand are still oversized, it absolutely does keep the swelling down from what it was before I had this daily therapy.  I agree that trying not to focus on the boards is a good idea.  I still think of this every day, but try my best not to focus on it.  Enjoy every day.   Hugs, Brenda",
      "MessageIndex": 4115,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "May 2, 2013 02:52PM brendafromflorida wrote: Hi everyone.  Haven't been here or posted for quite a while now.  I am well except for the effects of the arimidex.  Coming up on my 4.5 yr date also.  Just saw onc today and he switched me over to femara hoping it helps.  Just wondering if any of you have any experience with genetic counseling.  Unfortunately, my only sibling, (brother) was diagnosed with inoperable, metastatic pancreatic cancer in January.  He is at home under hospice care and holding his own but it has been a roller coaster.  My onc is recommending genetic testing because on one side of my family in 2 generations we have 2 stomach, one colon, one breast,one cervical, one prostate and now pancreatic.  Not a very good history.  I am freaking out.  I am worried for my sons and my brothers children.  Does it ever stop?  I was beginning to relax knowing my 5 year mark is approaching.  UGH!!!",
      "MessageIndex": 4275,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 17, 2008 10:44PM brendafromflorida wrote: Hi Lisa, nice to meet you.  My name is Brenda and I live about 20 miles from Orlando, Florida.  I should begin my chemo in January also.   I had a modified radical on November 11.  I will need radiation after the chemo so I have not had any reconstruction yet.  This is my first post on the boards, although I have been reading a lot since my diagnosis.  There is a lot of great information that should help us get through this.   I am a tough old broad and don't intend to let this beat me.  I just turned 63 last Friday.  My family is afraid for me, but I am doing everything possible to stay positive and keep everything as normal as possible.   I had my port put in last week.  Mine was put in my arm.  We will get through this.  Brenda",
      "MessageIndex": 3,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 18, 2008 09:05PM brendafromflorida wrote: Good luck tomorrow, Lisa.   I saw my onco today and my first treatment will actually be in December.  Day after Christmas.   How about that for a Christmas gift?   I probably could have asked to wait a week, but it seems pointless.  I just want to get started as soon as possible. I am so glad I had the port put in.  They had to take blood again today and my veins are terrible.  I can't imagine trying to get through the treatments without the port.   My treatment will be 4 rounds of AC every two weeks and then Taxol every week, I think for 6 weeks.  Then the radiation.   Reconstruction after all that.   2009 is going to be a long year. Let us know how you make out tomorrow.   I will be thinking about you. Brenda ",
      "MessageIndex": 13,
      "PostDate": "18/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 20, 2008 09:16PM brendafromflorida wrote: Lisa, I hope you are doing better today.   Where did they put your port?   Mine was really not painful as much as annoying.  I, too, am starting my chemo in Dec., however am staying with the January group.  My computer was down last night and most of today or I would have asked sooner how you made out.  I saw my breast surgeon yesterday for the follow-up after having my port put in.  She says everything looks good and is glad I am starting my chemo next week.   Welcome to the others in our group.  I think we are all trying to wrap our heads around the whole thing.  I feel like I have been on a roller coaster since October.  Every day seems to bring something new or something I hadn't even considered.  I did some major house cleaning today.  I figure I won't have as much strength or energy once the chemo begins.  Everyone, keep smiling, keep a positive attitude.  We can all beat this monster within us.  Even at 63, I still feel like I have a lot of living to do. ",
      "MessageIndex": 22,
      "PostDate": "20/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 21, 2008 10:21PM brendafromflorida wrote: Hi Bev,  I think the most important questions would be those regarding side effects, what to expect, diet, how long each treatment lasts.  Ask what drugs are available to counteract side effects.  My doc gave me a prescription for anti nausea that I will have filled before my first treatment.  Take everything they will give you.  I am told that taking a CD player or MP3 to listen to music is probably best.  My breast surgeon put it this way:  Take music to listen to, lay back, relax,close your eyes and picture the medication going in and killing off all those bad cells. I know not everyone experiences the same side effects, but it is good to know what is possible.  I read that soy products are not good for anyone on chemo.  My onco agreed.   There are some really good posts on here with lists of products that are good for us to have on hand in case.  I will try to find them and let you know where they are. Ask which drugs you will be getting and how many treatments of each.  In my case, I have to have radiation, so that will be done after the chemo.   Don't be afraid to ask all your questions.  You need to know everything.  When were you diagnosed?   I got mine on 10/15.  Modified radical mast with axillary dissection 11/11, port installed 12/11, first chemo 12/26.      Good luck on Tuesday.   ",
      "MessageIndex": 28,
      "PostDate": "21/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 26, 2008 04:37PM brendafromflorida wrote: Hi Kim, I was told 20% chance of getting placebo.  80% chance of getting Avastin.   Of that 80%, 40% would go on to receive the drug an additional 6 months.   I went to the wig store this afternoon, but they were closed.  I guess I should have called first.  Oh well, since we were in Daytona Beach, we took a ride on the beach, stopped and watched the ocean for a bit before going to our favorite spot for oysters.   Much better afternoon than expected since I was supposed to start my chemo this afternoon.    I am not sure until Monday when I will start now.  Good luck.  Let me know how you make out on Tuesday.  ",
      "MessageIndex": 75,
      "PostDate": "26/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 7, 2009 11:55PM - edited Jan 8, 2009 12:21AM by brendafromflorida Hi living4today...great name by the way!    Holbolt said it best, sorry but welcome and you really did get a Christmas gift.  There is much support here for all of us.  My chemo starts tomorrow afternoon.  I am not sure that I am scared, but I definitely am anxious.  Hopefully I will feel well enough tomorrow night to post.   Stay connected and feel better. Kim, thanks for the encouragement.  Will let you know how I make out.      Brenda",
      "MessageIndex": 356,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 8, 2009 10:15PM brendafromflorida wrote: Kim, I don't think you are a bit paranoid.  You have to be very careful with anything like that.  Don't feel bad.   My doc said call with anything that I feel is necessary.  24/7.   I intend to do that.  Four hours and still no bad feelings.   Sorry you are feeling down.  Take anything that will help you sleep.   Hope you WBC improves in the next day or two.   Lisa, great quote.  WE WILL BEAT THIS MONSTER!!!!!!!!!!!!!!",
      "MessageIndex": 376,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 22, 2009 07:57PM brendafromflorida wrote: OK.  It is finished.   I am now officially BALD.  We had a buzz cut party at my house.  My significant other started the job, friends took a wack and my son finished the job.  I am surprisingly calm.  Just another step in the journey.   I did have a moment when I was talking to my daughter-in-law on the phone.  But it was just a moment and then it was gone.  So I am going to get in my jammies and rest now.   Hope everyone else is doing well.   Hugs. Brenda",
      "MessageIndex": 697,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 25, 2009 06:57PM brendafromflorida wrote: Hi everyone, like Lisa, I have been feeling really good so have not been posting much.  Kim, I had my 2nd A/C treatment on Thursday and I definitely feel flushed the day or 2 after treatment.  I seem to have a constant dull headache also.  Not sure if that is the Avastin or what.  Other than that, I am feeling good.  I am almost afraid to say it, but I feel almost normal.  I do have very dry mouth most of the time and am much more tired, but otherwise not so bad. Renrel, thanks for the encouragement.  I have always been pretty tough, but this cancer thing was something I never expected.  Hope you feel better about the hair thing.  I worried about it for a while, but once I did it, it wasn't so bad.  My DSO thinks I look pretty good bald.  Can't say I agree, but is good to hear him say that.  I was really worried about the Neulasta shot also, but so far, I have just had a little bit of achy feeling but no real pain from it.  I actually went to the golf course today and hit some golf balls.  It felt sooooo good.  The sun was out, it was finally normal Florida weather.  It's been really cold the last week or so.  Good luck to all who have tx this week.   Welcome to all the new members.  Again, we are all sorry you are here, but glad you found us. ",
      "MessageIndex": 752,
      "PostDate": "25/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Mar 26, 2009 10:21PM brendafromflorida wrote: Well, I managed to keep my counts up and was able to have my treatment today.  The treatment I missed last week just goes away, so I am 1/3 finished with Taxol.  My hemo is at the same level as last week, so it appears this last transfusion is lasting a bit better than the first.  My onc did tell me today that he was a bit worried about me because of these fluctuating levels.  He will watch carefully and perhaps change dosage or may have to skip additional treatments.  Tomorrow I have to begin giving myself Neupogen shots for 3 days following each tx.  Kim, you are right about the best gift to give your kids.  I have two sons.  My oldest is 43 and youngest is 38.  Keeping positive and strong for them helps me also.  I want to be around to see my grandchildren graduate high school and get married.  I want to be a great grandma some day.  My oldest grandson is 16, youngest 14.   They both belong to my youngest son.  Oldest does not have any children.   There are so many emotions attached to this journey we are all on.  It is difficult to keep them all sorted out.  One day I am so afraid I won't get through it and the next I know without a doubt that I will.   It's crazy.   Anyway, Jewels, you are all awesome.  I am pretty tired and unable to identify each and every one of you, but for those who have completed tx, congratulations.   For those of us still having challenges, stay positive and we will get through it.   Sorry that some of you have had to have tx delayed because of other health issues.  Keep your chin up.   WE WILL SURVIVE!!!!!",
      "MessageIndex": 1675,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Aug 25, 2009 07:02PM brendafromflorida wrote: Hi everyone, seems like a long time since I have been here.  It looks like everyone is well on the way to the rest of our lives.  I am so happy to hear that things are getting back to somewhat normal for everyone.   I have been very busy since treatment is complete.   I had my follow-up with the oncologist and everything is good.  Blood work came back clear.  I will have my port removed on Friday.   It seems such a part of me, I am not sure how I will feel.   I still have to wait a while for the reconstruction.  PS says at least 6 months after rads.  That puts me around December.   Maybe new boobs for Christmas!   I started Femara this week.  Is anyone else on that drug?  I was amazed at how much it cost.  My new insurance plan requires that I meet my deductible before my co-pays kick in.  Won't take long at that rate.   I'm looking at $10 per pill.  Anyone else have experience with this?  I hope I'm not getting ripped off.   5 years of that every day is going to be VERY expensive.  I am also getting a bit of hair, although it seems to be growing very slowly.  No bangs here either.  Salt & pepper for me.   I have always highlighted my hair so that won't be anything new.  I do have lashes and brows.  They seem to have come in pretty quickly.  I agree that the hair on our heads should come in as quickly as that on the face and legs.  LOL............ I had my sons and grandsons here for 5 days last week.   It was so much fun.  I am exhausted, but I wouldn't have traded the time for anything.  My oldest grandson passed his drivers test in NY yesterday.  His brother is a couple years down the road, but I am almost glad I don't live closer.  I'd be a nervous wreck all the time.   At least this way what I don't know doesn't hurt me.  This has been an experience none of us will ever forget and I thank God everyday we had each other to lean on.  I hope everyone continues to do well.  It is hard to keep your mind from going to the dark side, but we must try to stay positive and stay focused on everything good.  Love to all you Jewels.   Brenda    ",
      "MessageIndex": 3086,
      "PostDate": "25/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Sep 19, 2009 09:32PM brendafromflorida wrote: Kmmd, the LE thing is really a bummer.  It is difficult to know what your own personal limitations are.  I want so much to get back out on the golf course, but they say that is high risk.  I'm definitely going to try after my compression sleeve and glove get here.  I've waited too long already.  I'm not a really good player but I find it so relaxing and I love it so much I will not stop playing because of this.  It seems I have already given up so much, I just won't give thatup too. I finished the therapy yesterday but it will still be a couple weeks before I get the sleeve, glove and Reidsleeve for nightime, so I am doomed to these ridiculous bandages until then.  My insurance will cover the garments and the special sleeve for nightime wear so I don't have to do the bandages so I am very grateful for that.  I have such mixed feelings about the entire process.  On one hand I want so much to take the bandages off and see how long it takes for swelling to begin, bit on the other hand, I am afraid all ther therapy will be lost if I do that.   I really think more time should be spent explaining exactly what can happen with this.  I did not feel at all prepared for this.  While I knew LE was a risk, I had no idea what was involved.  I am thinking of starting some sort of campaign for LE awareness.  I hope everyone is doing well.  Oh, my anniversary date is coming up also.  Oct. 15 was my dreaded call from the Dr. although I was pretty certain before that. Kim, good to hear from you again.  Glad you are doing well.  I think we all still have our moments of grief for what we have lost but I am trying to stay positive for the future knowing there are many good people out there in much worse condition than I.  I am so thankful I found all of you during this time.   Thank you all!",
      "MessageIndex": 3165,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 25, 2008 08:31PM brendafromflorida wrote: Welcome Butterfly,  you certainly have been hit with a real zinger.  I hope you are feeling a bit better after hearing from some of us.  We are here for you.   We will get through this together!    HUGS!",
      "MessageIndex": 69,
      "PostDate": "25/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 27, 2008 08:09PM brendafromflorida wrote: Nothing from Lisa since yesterday.  I hope she is OK too.  She said she hadn't been sleeping so well.   Maybe she is just exhausted.   I will find out Monday when my 1st treatment will be.   I was cancelled yesterday because my test drug didn't get in.  ",
      "MessageIndex": 88,
      "PostDate": "27/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 27, 2008 08:36PM brendafromflorida wrote: The clinical trial is for Avastin.  They are testing to determine if it will help with recurrance.  I had the Muga scan on my birthday, Dec.12.   I had just had the port inserted in my arm the day before so the Muga was no fun.  Had to stay still and hold my arm above my head.  It ached and all I wanted to do was move.  I have been having difficulty sleeping since my dx.  I tend to nap and then that is not good because when it is time to go to bed, the sleep just doesn't come.   How is your 16 year old handling everything?  Hope she is OK.   My boys are 38 & 43 (yes they are still boys), and they are a bit freaked, but very supportive.  They don't live near me so they are making arrangements to come to Florida and spend some quality time with MOM.   Get some sleep.   Hugs.......",
      "MessageIndex": 90,
      "PostDate": "27/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 2, 2009 09:30PM brendafromflorida wrote: Hi Pamela,  my surgery went extremely well.  I am a relatively fast healer so I really didn't have any issues.  I have had my fill of surgery in the last year and a half.  In July of 2007 I had a total hip replacement and then in Feb. of 2008 I had total knee.  We were amazed at how quickly I healed and was back at work from those two.  I had just gotten back out on the golf course and thought I was home free when this hit.  I had 2 nodes show up on my PET scan so they didn't even do the sentinel.  Just took them all.  Turned out to have 5 with cancer so good thing they took them.  The worse thing now is just the numbness.  I had my surgery on Tuesday, home  Wednesday and working on my computer from home on Thursday.  Haven't really missed a day of work since.   I am very lucky that I can work from home.  I am a Customer Service Director, but I have a Manager who handles all the day to day stuff so I can actually consult from here.  Everything else I do is computer related so it is very easy for me to complete everything from here.  Thank God.   I really can't deal with all the \"Oh, Brenda, how are you doing?\"  For a while after dx, it didn't take much to set me off with the tears.   Not sure I ever really let loose, but had a LOT of tears.  I know everyone was really concerned and wanted to encourage, but all I wanted to do was cry.  Over that now, almost. LOL Really glad to hear you didn't have many SE's.  I can only hope.  I had very little pain from the surgery.  My port was inserted exactly a month after the mast.  I had the port put in my left arm.  While it was uncomfortable for a week or two, now I don't even feel it.  Please let me know how you do.   Kim, I hope you start feeling better about the wig thing.  I'm trying to muster up the courage to get some sleep caps and maybe a couple more hats.  I don't think I can do the scarf thing.  Hugs everyone and welcome to all the new members of our group.  Sorry you have to be here with us, but glad you found us.   Hugs, Brenda     Going to try to get some rest.   Sleep is really hard to come by these nights and I haven't even started chemo yet.   ARGH!!!!!!!!! ",
      "MessageIndex": 216,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 7, 2009 09:12PM brendafromflorida wrote: Hi everyone,  well my treatment starts tomorrow and I am beginning to get a bit anxious.  My wig came today and I am not sure about it yet.  I think after my hair goes, it may fit better and I will be glad I have it, but at this moment, I am having a really hard time with it.   My oldest son came from RI to stay for a while so today was a really good day.   It will be good to have him around during this first round of treatment.   I am going to try to get some rest.   Good luck to anyone else out there starting this week or soon.  ",
      "MessageIndex": 342,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 8, 2009 08:05PM brendafromflorida wrote: Alo, I will definitely keep you posted.   Good luck when you start.   I had A/C with test drug Avastin.  (Maybe placebo).  Won't know until they unblind.   I have 4 A/C every two weeks, then 12 Taxol every week.  ",
      "MessageIndex": 368,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 9, 2009 09:39PM brendafromflorida wrote: Sweetpam, I had fluid drained 3x after the drains came out.  Really didn't feel anything.  Still numb from the surgery and the BS puts something else to further numb before doing the aspiration.   Don't worry.   It isn't bad at all.  I am now 27 hours since my 1st A/C, with or without Avastin,(test drug).  I am feeling fine.  I keep waiting for something to happen.  I am sure it will eventually.  Can't be so lucky to come out of this with no SE's.   Take care.  Hope everything goes well.   Lisa, wonderful news on your test.    Brenda",
      "MessageIndex": 400,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 13, 2009 11:54AM brendafromflorida wrote: Hi everyone, I am now 5 days out from my first treatment of A/C, +maybe Avastin.  Day 1 was uneventful.  I felt really good.  Day 2 I spent sleeping the entire day and feeling a bit of nausea but not unbearable.  Day 3 just felt a bit blah all day, but nothing major.  Nagging headache since treatment.  Since my treatment did not end until after 6 PM on Thursday I could not get the Neulasta shot until yesterday.  So far, I am not feeling too bad from that.  When did most of you begin feeling the flu like symptoms from the shot?   I feel a tiny bit of it today but nothing major.   Sweetpam, I am also experiencing burning in my arm just below where my port was inserted.  Not sure what that means?    Not all the time, just once in a while I get the burning. I am going to go to work beginning tomorrow until my next treatment on the 22nd.  Hoping that goes well.   I have not be on the past few days, but tried to read most of the new entries.  Welcome to our new members.   Sorry you have to be here, but glad you found us.   I will have 12 tx of Taxol after this series is over.  That will be every week.  I am wondering how that will affect me.  ",
      "MessageIndex": 486,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 17, 2008 11:21PM brendafromflorida wrote: Really glad both of you are here too.  We will all kick this.   My treatment is through Florida Hospital Cancer Institute in Orlando.   I will find out tomorrow what my treatment will be an when it will start.  Have to work tomorrow, so signing off now.   Stay close.  We will need each other.  ",
      "MessageIndex": 7,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 25, 2008 08:15PM brendafromflorida wrote: Hi Jess,  I start my chemo tomorrow.   Back Monday for the Neulasta shot.   4 rounds of AC every other week and then Taxol 5 rounds every week.   Radiation after that.   I am also in a clinical trial testing Avastin.  They are trying to determine if it is helpful in fighting recurrance and how much is enough?  If only during regular chemo treatment or extended for a full year.  There has been much success with Colon Cancer.   If I get into the arm of the study that extends treatment an additional 6 months, I will have Avastin for 6 months after my radiation is complete.  I can't say I am ready for tomorrow, but I think I have myself prepared as much as anyone can prepare for something like this.  It is really nice to have everyone out there who is going through the same feelings and emotions.  Hope everyone had a wonderful holiday and I will post again tomorrow evening after my treatment. Thanks everyone.",
      "MessageIndex": 68,
      "PostDate": "25/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 31, 2008 05:46PM brendafromflorida wrote: Snowbird, thanks for the encouraging words.  I figured why not with the trial.  If it is something that may help me or someone else, it is worth it.   Cold is really getting on my nerves now.  I have been in Florida for almost 14 years and have not had a cold since I got here.  (From upstate New York, so I had plenty of them up there.)   Talk about luck.  If I didn't have bad luck, I wouldn't have any at all.   To get this the week I was supposed to start chemo is crazy.  Oh well, as I said before, the drug no show is the best thing that could have happened.  Imagine having a cold like this on chemo.  AUGH! Saw the BS today to have some fluid drained and she said the same thing.  Hopefully, by next Thursday, I will be good as new so they can load me up with chemo. Going out for dinner in a few so Happy New Year to everyone.   I hope next one is better than this one.   Hugs to all!",
      "MessageIndex": 147,
      "PostDate": "31/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 20, 2008 10:11PM brendafromflorida wrote: Thanks for the encouragement, Caya. It is good to hear from someone who has been there.  I've been giving that cleaning service some real thought.  My friend has someone she uses and I am going to get her name.  Even for the heavy stuff.  Thanks again.  Brenda",
      "MessageIndex": 24,
      "PostDate": "20/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 2, 2009 09:42AM brendafromflorida wrote: Your situation was different from mine since you had bilateral.  I only had right done with no expanders.  Just did skin sparing for later recon.  And I didn't have any children at home to care for.  That would make a huge difference in having help.   I did a lot of research late at night when I couldn't sleep.  Still do.  The sleeping is still a problem.   It is great that you had the help when you needed it.   I am sure you will look lovely no matter what you wear or not.  Let's decide that hair doesn't really matter and go for it!   LOL       ",
      "MessageIndex": 190,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 2, 2009 04:01PM brendafromflorida wrote: Kim,  which Gabor wig did you get?  I think the name of mine was Precedence.  I am really anxious to see what it looks like.   I have a friend who just finished her chemo from lymphoma so she is going to give me a couple wigs for some variety.  Not my color, but it may be fun to change it up once in a while.   Jilly, hope you kick your cold before Monday.  Stay warm, drink a lot of fluids and pump that C.  Welcome to our new members, even though we know none of you really want to be here.  Holtbolt and Renrel, when I told my youngest son (38) about my BC, he said a big SHIT first a DAMN, and then another four letter that I better not post here.   That pretty much said it all.  ",
      "MessageIndex": 206,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Feb 3, 2009 10:02PM brendafromflorida wrote: Kim, so sorry to hear about your daughter.  Fortunately, my kids are older and it is a bit easier for them to deal.   I cannot imagine how difficult it is.  A trip would be great.   I think that is probably what I will do.  We went to Amsterdam and Scotland a couple years ago and I think another trip over there may be nice.   Will have to think that one out.   Your daughters teacher sounds like a real b_ _ _ _!!!!!  Don't worry, what goes around comes around in due time.  She'll get hers.   Just hope it is sooner than later.   Hawaii, this past week I had a couple days where all I could do was cry.  I think it was a mixture of not feeling well and being bald.  I am really having a harder time with that than I thought at first.  You're right about it feeling like an eternity.  Things will get better.   Take care.   ",
      "MessageIndex": 982,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Dec 30, 2008 12:07PM brendafromflorida wrote: Hi Jess, well I just got word back from my research nurse.  Evidently, my Avastin got lost somewhere in the course of the storms up north.  They were afraid it had been compromised so they have ordered it again.   I am fighting a cold and sore throat so we are going to wait until Jan. 8 for my first treatment.   I am still unsure how many rounds of Taxol I will receive.  I know I get 4 A/C plus Avastin to start.   I will update after I go next week and ask again how many Taxol.   Thanks for keeping track of everyone.   Lisa, sorry you have started to feel bad.  I guess by the time we start to feel better it is time for another round.   Chris, welcome to our group.  I am really sorry to hear that you have been so sick.  But also, I agree it is essential that we are honest about our SE's so everyone has the best information we can get.   Much love to everyone Brenda",
      "MessageIndex": 126,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 1, 2009 05:05PM brendafromflorida wrote: Kim, I just ordered a Gabor.  It shipped so I expect it sometime this week.  I'll let you know how it looks.  About 30 years ago I went through the wig phase when it was oh so chic!!!!!  LOL  Never thought I would have to wear one because I was BALD!   I am still having a hard time seeing myself that way.   Haven't really had long hair in quite a few years, but never been bald either.   When I first moved to Florida trying to find a good hairdresser was not easy.  My first haircut was a disaster.  My DSO, (should really call him husband because we have been together 14 years) called me BEN for weeks.     Like you, I can't believe I am going through this either.  It is surreal.  I have a family history of stroke, heart attack and that sort of thing.   When my company offered AFLAC, I got both cancer coverage and significant event, i.e. heart attack, stroke, and I was so sure I wouldn't get cancer that in 2004 after paying for a couple of years, I cancelled my AFLAC Cancer coverage.  Go figure!   I think I have now purchased every remedy known to man or at least referenced on this site.  I hope I have everything I need.   Not sure what to do with items we don't need.  Maybe we could all put our unused products on e-bay after this is finished.   Second hand drugs for sale.   How do you think that would go?  Sorry to welcome all the new members to our group.  None of us want to be here, but we will be here for you.  We will kick this together.  ",
      "MessageIndex": 170,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 2, 2009 01:13AM brendafromflorida wrote: Jilly, it was kind of a coincidence with me.  My test drug was lost in transit so my treatment was cancelled.   I got the cold the same day I was supposed to have my first treatment.  When I finally got hold of my onc, he did say it was better to wait until the next week.  I saw my BS yesterday and she said they probably would not have started chemo with me like I was.  She suggested 2000 MG of VitC everyday.  It has definitely helped.  I was feeling much better today after 2 doses.  You are well within time limits to delay if necessary.  I would definitely let them know tomorrow.   Better than showing up Monday and them sending you home.  IMO.    Hope you feel better.    Bren",
      "MessageIndex": 183,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 8, 2009 08:00PM brendafromflorida wrote: Well, I made it through my 1st treatment today.  It was nowhere nearly as scary as I had pictured.  I am feeling no side effects so far, but the treatment just ended about 2 hours ago.  Just waiting to see what comes up in the next couple days.  The Neulasta shot will be Monday because a 24 hour gap is necessary and we don't have that much time to get tomorrow. Hope everyone else is doing well.   I am going to try to rest tonight. Good night all.   (((((((((HUGS)))))))) Brenda",
      "MessageIndex": 366,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 9, 2009 11:19AM brendafromflorida wrote: Lisa, best of luck today.  I will be thinking of you.   So far, I have no visible effects from my treatment yesterday.   Feeling OK and working from home.   Take care.  Positive thoughts coming your way.Brenda",
      "MessageIndex": 382,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 15, 2009 02:25PM brendafromflorida wrote: ddlatt, I had my Neulasta shot on Monday.   So far, I have not had what I would consider bone pain.  I have had some achy feelings but nothing major.  I am having a few stomach issues that are new and I am not sure that is due to the A/C or the Neulasta.  Some cramping is the only way I can describe it.  I would assume that is from the regular treatment though.    I really had myself worked up about the shot, but so far it is not too bad.   Sorry you had such a rough night from the treatment.   Hang in there.  Hope it gets better for you.  ",
      "MessageIndex": 542,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Mar 23, 2009 12:52PM brendafromflorida wrote: Kim, it must be nice to have your kids home.  Sorry you're feeling bad.  Keep your chin up.  This will be over soon.   I have been eating red meat but doesn't seem to be doing much for me.   I did have a follow up MUGA a couple weeks ago.   I think I see my onc this week, but not sure since now my schedule is off.   I'm sure the MUGA was OK or they would have certainly said something by now.   My trial coordinator did say she thought I was getting the Avastin based on everything that is going on.  I guess we'll see.  I am to be unblinded on the 8th treatment.  Now that will be a week later than originally thought.   I am feeling pretty good so I am sure my hemo is still up there, just not sure of the WBC.  I guess I will find out on Thursday. Ddlatt, thanks for the info on the red meat also.  Maybe I will try eating more from now on.   Gotta get back to work.   Thanks everyone for your posts and keep positive thoughts.  ",
      "MessageIndex": 1634,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Feb 5, 2009 06:42PM - edited Feb 5, 2009 06:43PM by brendafromflorida Made it through tx #3.  So far, just a major headache.  No transfusion.  Hemoglobin is still very low but not to the point that the transfusion is necessary.  I am going to start with the protein also and try to get it to a more acceptable level before next tx.  Only 1 more A/C and then on to the Taxol for 12 weeks.   I did lose 10 lbs. since last treatment and they were not thrilled about that.  Can't say I wasn't.  I can still afford to lose more, but they said no more until after treatment ends. My other younger son is visiting from New York this week and is cooking dinner.  Steak tonight so getting that protein in.  Going to try to rest.  Hope everyone is feeling better this evening.  Will catch up later.   Brenda",
      "MessageIndex": 1016,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 22, 2009 05:15PM brendafromflorida wrote: Returned from 2nd A/C treatment.   So far, so good.   I have had minimal s/e so far.  Hair is starting to go.  I had it pixie cut on Sunday, but this morning noticed much more in my comb and now can just pull it out.  I will probably buzz tonight.   I have decided to have some fun with my wigs.  My friend who just completed another round of chemo for lymphoma gave me 2 and I ordered 1 of my own.  My hair is naturally very fine so any wig I wear is going to look like too much hair.   I am just going to make the best of it.  Hopefully, when it returns it will be thicker than before.   Hope everyone is doing well.  I am going to try to catch up on all the posts since I have not been here for a few days.   Welcome to any new jewels.  Sorry you have to be here. ",
      "MessageIndex": 695,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 25, 2009 07:04PM brendafromflorida wrote: Patti, I am sorry to hear that the shaving was so difficult for you.  I understand.  Go to the mirror and look at yourself.  You can do this.  Do you have wigs or are you doing the scarf and hats?  I know what you mean about the secret being out.   Please don't feel that way.  You will be OK.  Just hold your head up and know you are going to beat this and the baldness is just another step in your journey.   I wore my wig for the first time today to my country club to hit some golf balls.  I felt like it was so fake, but no one I saw looked at me any differently than before.  ",
      "MessageIndex": 753,
      "PostDate": "25/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Apr 9, 2009 09:25PM brendafromflorida wrote: Everyone, it sounds like we have had quite a week.   LisaLisa, hope everything works out.  II am so sorry you have had to go through all these other challenges along with the chemo.  UGH! DDlatt, I agree that your doctor is being cautious and checking for potential issues.  We will all pray that this is the chemo causing the problems.  Sending positive thoughts. Bev, cograts on finishing, Patti, a new granchild.  Wonderful.  BerkleyKim, glad you were able to get away.   Me, I am headed for another transfusion tomorrow.  Just can't seem to keep that hemoglobin level up.  This will be my third.   I see my onc next Thursday, so he may be sending me for some other tests.   He was not happy the last time.   That was just over 3 weeks ago.  Good thing is I can now start counting down.   I have 6 more Taxol to go.  My end date now is May 21 if I don't have any more treatments delayed.   My WBC is staying up now because I am giving myself a shot of Neupogin 3 days after each treatment.   I start rads after that.   Not sure how much time between.  I will ask next Thursday.   Hope everyone has a pain free, pleasant weekend.  ",
      "MessageIndex": 1869,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Feb 3, 2009 12:57PM brendafromflorida wrote: Hi everyone.  I haven't been here much this week.   Until today, I have been really weak and not not feeling well at all.   My hemoglobin dipped very low after my last treatment.   I was fine days 1 through 6.   7 through 11 were extremely difficult.   Day 8 I wound up on the kitchen floor after I finally got up enough energy to get off the couch and try to get something to eat.  I thought I was fine and then all of a sudden my legs just buckled and I was down.  DSO was frantic, ready to call 911.  I must have been a sight.   Anyway, things got a bit better the last few days.   I may need a transfusion when I go Thursday for my next treatment.  Thankfully, my son will be here so I'm thinking they may be able to use his blood.  I haven't had a chance to catch up on all the recent posts, but am hoping everyone is doing OK.  This whole thing really SUCKS!   I recently (before this last treatment, obviously) had lunch with a good friend who had just finished chemo for lymphoma.  She had the right idea.  This was a recurrence for her.  After the first treatment a few years ago, she treated herself to a Coach bag, which she still had.  After this one she upgraded and is now driving a bright red, sporty corvette.  She looked sensational.  Quite an upgrade, I'd say but deserving none the less.   I think we all set our sights on something extemely extravagant for when we finish this thing.   What do you think?    ",
      "MessageIndex": 967,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Feb 3, 2009 09:16PM brendafromflorida wrote: Jess, I didn't have a lot of scalp pain, but definitely the itching is about to drive me insane.  I am having radiation after my chemo ends.  I was told that because of the number of lymph nodes I have involved I would need it.  5 weeks, 5 days a week.   I can't wait for all of this to end.   Have a good evening and I hope everyone gets some rest tonight.  ",
      "MessageIndex": 978,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Feb 11, 2009 02:36PM brendafromflorida wrote: Hi everyone, I am finally feeling a bit better.  Haven't been posting much because I have just been too wiped out.   Ladyjane, I have also lost weight.   10 lbs. between my 2nd & 3rd treatments.  Like you, my Dr. as not pleased.  I was elated.   They don't want me to lose any more.  I am also anemic and have been trying to do the iron rich foods.  I have found that raisins, dried dates and dried apricots are good.  Also Special K cereal.   I was also told to drink Instant Breakfast in between meals.  My youngest son (38) has been here with me for the last week and he used to be a chef.  He has been cooking all this great food and I am trying to eat, but nothing tastes good to me.  He goes home tomorrow and I will really be sad to see him go.  He has 2 boys and doesn't want to be away from them for too long.   He is divorced and he has custody on the weekends.   I hope everyone is doing OK and will try to catch up on all the recent posts since I am feeling a bit better now.   ",
      "MessageIndex": 1111,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Feb 20, 2009 10:52AM brendafromflorida wrote: Ddlat, I was just about to post on the same subject.  I have been anemic since my 2nd treatment of A/C.  My hemoglobin in now down to 8.5 and I will need a transfusion next week if it goes down to 8.  It has been dropping at least 1 point after each treatment.  I had a treatment yesterday so in a week I am sure I will be headed to the blood bank.   I have to go back in a week to have it checked again.   Everytime I move from one point in my home to another, I feel as if I have just run a marathon.  Pounding in my head, shortness of breath.   I am with you when you say you want this over with.   They tell me though that the transfusion should last for a while.   I begin 12 weekly treatments of taxol on March 5.   Also am told my counts should go up with this series. I have also had very sensitive teeth and jaw pain, so it has been difficult to eat solids.  I have lost 13 lbs. in the last 4 week.   They were not thrilled with that either.   Hang in there.  It will get better.    It's got to.   ",
      "MessageIndex": 1250,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "May 15, 2009 02:29PM brendafromflorida wrote: Hi Lisa, I have one more session on May 21.     ",
      "MessageIndex": 2329,
      "PostDate": "15/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Aug 3, 2009 01:50PM brendafromflorida wrote: Hi everyone, I  haven't been around for quite some time but have just tried  to catch up on some of the happenings with the January Jewels.   Lisa, I am thinking about you and hope your surgery goes well and you get home soon.  So sorry to hear about your friend.  It is so difficult to lose our friends and loved ones.  Misty, I am sorry to hear about Malcom.   My SO's mother is waiting for a kidney.   It is so hard.  She is on dialysis 2x a week until they find one for her.  Jilly, we went to Scotland 2 years ago.  It was fantastic.  We loved it.  You will have a wonderful time. I finished my rads last week and will see the oncologist Thursday for my follow-up.  My reconstruction will not be scheduled until sometime in November.  Sounds like we are all pretty much through with chemo and rads and getting on with life.   I have to tell you, it seemed like this day would never come.  I've been very busy with my job, thank God, because it kept my mind off everything else.   Now things have calmed down a bit and I am trying to continue with a positive attitude about things to come.   Love to everyone and keep on keeping on!!!!!",
      "MessageIndex": 3004,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Sep 15, 2009 01:08PM brendafromflorida wrote: Hi everyone, I haven't been here for a while either.  Have just been reading trying to catch up.  I am sorry to hear about all the other issues everyone is dealing with.  Seems I am one of the older ones here (63) so I will offer a different perspective.  Having gone through divorce myself, I can relate.  There comes a time in our lives when we need to be #1 no matter what else is going on.  I spent 30 years with a man who was unsupportive in every way.  I was a slow learner.  I cannot even imagine him taking this last journey with me.  For the last 14 years I have been with a man who is supportive, loving and had cancer himself when he was in his twenties.  He understands what I have been going  through and has been my rock through this past year.  I tell you this because as sad as it may be right now as you are beginning a new journey yourself or possibly finding a way to work through the problems, there is a very good chance your life will be 1000 times better than before.  The thing you must remember is that you are the most important person and you do what is best for you and no one else.  We spend much of our lives taking care of everyone that we lose sight of our own importance.  Now is OUR time.  Now for a bit of a rant of my own.  Is anyone else dealing with lymphedema?  I was totally unprepared for the severity of this SE.  Talk about life altering.   I thought, OK, I will have to wear a glove and a sleeve during the day, do a bit of self massage each day and it would be controlled.  I am finding out it is much more cumbersome and time consuming than I expected.  I have been having the decompression therapy the last 2 weeks now.  My arm is wrapped up from fingertips to shoulder in ace like bandages which only come off during the hour or hour and half of light massage every morning.   After this therapy is finished I will have to wear the sleeve and glove during the day and then at night either wrap my arm like this or buy a Reidsleeve for about $1000 as an alternative.  I have decided that is what I will do.  I cannot imagine wrapping like this every night for the rest of my life.    URGH!!!!!!!!!!!!!!!!!!!!!!!  I am interested to know if anyone else has been given any other alternatives to this.  Anyway, everyone, stay strong.   Love to everyone.   Brenda",
      "MessageIndex": 3147,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Oct 20, 2009 01:37PM brendafromflorida wrote: Kim, glad your walk went well.  I am walking this coming Saturday in Daytona Beach.  I am getting excited.  I have begun walking a bit around the neighborhood the last week to get ready.  Hope I make it all 3 miles.  With bad back and other things going on I have not walked a lot.  I am going to do my best.   I am so sorry about your DD's friend's mom.   I know it is difficult not to go to the dark side when things like that happen.  Try to stay positive though.  Everyone is different.  You WILL be fine.    I have put away my wigs.  It was tough initially, but I really don't think much about it anymore.  No bangs here, a little curl in the back.   Good to hear everyone seems to be doing well.  I see the PS next month to begin my reconstruction process.  I am anxious to get that behind me also.  ",
      "MessageIndex": 3245,
      "PostDate": "20/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 1, 2009 08:03PM brendafromflorida wrote: Starting chemo January 2009? We are growing as a group much too rapidly, but there are so many wonderful souls in our group.  Everyone is very helpful and I am sure you will find someone with a similiar treatment plan.  Actually your dx is very close to mine.  I am in a clinical trial for the drug Avastin.  I will begin my tx next Thursday the 8th.  I was supposed to start last Friday, but there was a problem with the trial drug and then I got a terrible cold so we delayed a bit.  Think about joining us.   It has been a great help to me already.  Hugs and good luck.    Brenda",
      "MessageIndex": 11,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/726627",
      "Title": "Nervous about starting Chemo 1/2/09 AZStacey2008 AZStacey2008"
    },
    {
      "AuthorID": "brendafromf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74037/profile",
      "Content": "Jan 1, 2009 10:59PM brendafromflorida wrote: Good luck.  You will do fine.  We'll be thinking of you.  ",
      "MessageIndex": 14,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/726627",
      "Title": "Nervous about starting Chemo 1/2/09 AZStacey2008 AZStacey2008"
    }
  ]
}