{
  "AuthorID": "BrendaAreYo…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97477/profile",
  "Posts": [
    {
      "AuthorID": "BrendaAreYo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97477/profile",
      "Content": "Feb 13, 2010 05:41PM BrendaAreYouA4 wrote: Judy,  I hated the side line cheer leading too.  A GF would gleefully say, \"You're half way there\" or \"You're done\" on the day of infusions.  I think chemo is a great thing in that it saves lives but it sucks to go through it.  I had TC X 4.  Today is the 83rd of 84 days and it still sucks but thank God I don't have to go in for another infusion on Monday.  My legs and knees ache and I'm headed for a hot soak in the tub as sonn as I finish here.   I know how you feel and sympathize.  Sometimes people just say dumb things but they don't even know how dumb it is -- because they lack the 'life experience' or they don't really think about what they are saying.  I don't think most people can even imagine how difficult chemo can be.  I think we are all warriers!  I wish you peace during this very trying and difficult time!",
      "MessageIndex": 32,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748082",
      "Title": "After 1st T/C chemo: What nobody tells you JudyM mslrg"
    },
    {
      "AuthorID": "BrendaAreYo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97477/profile",
      "Content": "Jul 5, 2010 07:26PM BrendaAreYouA4 wrote: I had a terrible infection after surgery that almost did me in.  I had a 18 hour bilateral DIEP MX on 9/22/09.  On 9/23 the vein supplying the blood to my right breast came loose.  I bled profusely and required emergency surgery to reconnect the blood supply and to stop the blood loss.  I was given a transfusions of over 6 liters of blood.  I stopped breathing because of the low blood volume and was placed on a ventilator.  With the blood supply reattached I was moved to the PACU and kept on the ventilator.  I then developed a huge hematomia that required surgical removal.  Then I got a blood clot that had to be removed.  In all I was in surgery 30 hours over the 3 days.  On the 7th day at the hospital I had surgery to do the nipples but the PS discovered an infection and they did debriding instead.  I required 2 types of  IV antibiotics for 7 days 3 times which took 3 hours each time.  They also made me very sick.   I ended up with a pic line because my veins were so poor by the end of the week.  I had 3 more surgeries to debride the breast.  I was in the hospital for 19 days.  I was sent home with a large gaping hole which required packing 2 times a day by a visiting nurse.  I was put on keflex at home for over a month.  I saw the PS several more times between mid-October, when I was released, and Mid-November.   Because the open wound was so large the PS had to do a skin graft to close the area so that I could start chemotherapy ASAP.  Two of the three surgeries ended up being debriding and finally on 11/15 the PS was able to do a successful skin graft.  I started chemo on 11/24 but the breast, skin graft, and donor skin graft site (hip) took a long time to heal.  In fact the donor site, my hip, ended up getting infected and required packing, and I was put on keflex again.  I survived chemo!  On 6/22 I had surgery to fix the skin graft and to add volume to my right breast which had lost a lot due to infection.  That was my 14th surgery.  (I had my ovaries removed in February.)  I will still need 2 to 3 more surgeries to fix the skin graft.  Some times I feel guilty about having the skin graft fixed because it is not medically necessary.  My PS could be helping other people and this is just cosmetic -- for me.  But...if we can get it fixed so it doesn't look so bad then maybe when I see myself I won't be reminded of the nightmare I went through.  If I had it all to do again I would do the same procedure with the same team.  I think it is because of them that I survived!   This has been a long and unexpected journey.  All my treatments and surgeries have been at a renowned, ivy-league, National Cancer Institute cancer center.  I just goes to show you that it can happen any where.",
      "MessageIndex": 7,
      "PostDate": "05/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754892",
      "Title": "Infection after surgery? 1marmalade1 1marmalade1"
    },
    {
      "AuthorID": "BrendaAreYo…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97477/profile",
      "Content": "Jul 6, 2010 11:25PM BrendaAreYouA4 wrote: Debbie, I am dong better,much better.  I am coming up on my 1 year anniversary of when it all started with the 'worrisome' mammogram on 6/15 so it gives me a little bit of a 'flashback'.  But I am sooooo glad to be through the worst.  and on the other side so to speak.  If I had it to do again I would still pick the DIEP.  In the end it was a success..  The flap survived.  I require reconstruction of the skin-graft which includes liposuction of the hips and thighs -- that's good in and of itself!  Mine was a fluke.  Thanks for asking how I was doing. Brenda ",
      "MessageIndex": 10,
      "PostDate": "06/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754892",
      "Title": "Infection after surgery? 1marmalade1 1marmalade1"
    }
  ]
}