{
  "AuthorID": "Briannek",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/232772/profile",
  "Posts": [
    {
      "AuthorID": "Briannek",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/232772/profile",
      "Content": "Briannek wrote: Hello fellow fighters- I'm back. On July 8, I had a SNB that was clear--yeppie!!! Since that time I have had bleeding at my incision site. When I went for post-op they said I had a hematoma and gave me the option to 1.) keep it covered with gauze. 2.) they could pack it 3.) take me into the OR and drain it. I choose to keep it covered with gauze. On Monday morning I woke up to a pool of blood that continued to bleed throughout the day. I called the doctor and they just returned my call today. They want me in the OR on Friday to drain. I have had so much trouble with the SNB procedure I'm scared to go back. I was so sick and in so much pain. I couldn't move my arm and needed help showering and such. I was shaking and vomitting. So I guess my question is has anyone had a hemotoma drained and what should I expect. Also, I want to request my original anesthesiologist has anyone done that? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846394",
      "Title": "Draining hematoma Briannek Briannek"
    },
    {
      "AuthorID": "Briannek",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/232772/profile",
      "Content": "Briannek wrote: I really don't know where to start.  A few weeks back I noticed a small lump under my left breast and went to my family doctor.  During my examine she felt a lump in my right breast and sent me for a mammogram.  The mammogram showed a \"mass\" and I had an ultrasound.  Both reports came back as a fibroadnoma and I scheduled a biopsy.  The Dr. Who did the biopsy felt it was a fibroadnoma and sent to pathology.  Initial reports, report a fibroadnoma.  However, the sample was sent to the Mayo clinic and the new report is Atypical Duct Hyperplasia.  I am scheduled with a follow next week but I was hoping to get some advice on what to ask the doctor.  And can anyone tell me what's the difference between a fibroadnoma and ADH.  Do most people have it removed.  I am 37 years old with no family history of breast cancer.  Will the doctor recommend Tamoxiflin (sp) as I'm concerned because I already severe from severe insomnia and that is a side effect.  I would appreciate any guidance you can provide.   Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/844047",
      "Title": "I don't know where to start Briannek ChiSandy"
    },
    {
      "AuthorID": "Briannek",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/232772/profile",
      "Content": "Briannek wrote: I hope you can find humor in this post but I also hope you can help me. I had a SN biopsy last Friday. They placed steri strips on the incision site and told me to remove when they started to pull off. I felt they had \"peeled\" off enough yesterday and I took them off. Now the funny part... I work in an office and while on the phone with a client my co-worker starts screaming from her cubicle. I quickly end my call to check on her. There is a crowd of people forming around here. I look at her and see pure terror in her eyes and she looks at me and says \"it's a mouse\". I immediately jump on my swivel chair. I have enough sense to realize that's not safe so.... Well the ground is not safe,there's a mouse, so I then proceed to jump on my desk. The crowd as now gathered around me and they say it's under my desk. I can not move because of shear terror. My other coworker says it's over here now can someone get it. Hearing her say that means to me the coast is clear, I then jump off the desk, over my chair, look at my coworker and we run out of building like ours lives depended on it. Fast forward two hours later I'm visiting my aunt and she wasnts to see my incision. I look down and there is blood on my shirt and bra. She then looks at the incision and says it has opened up. I do not believe its infected I believe it was the excitement over Micky or Minnie. My surgeon is two hours away and my local hospital is nicknamed as \"dead central\". I really do not want to make a trip to either if not necessary. I have a post-op in Cleveland on Tuesday. Has anyone had this experience and do you have any recommendations? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/845997",
      "Title": "Incision after SNB just opened up Briannek ChiSandy"
    }
  ]
}