{
  "AuthorID": "bridgegal25",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
  "Posts": [
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Mar 10, 2015 05:16PM bridgegal25 wrote: Doc Babs -- just saw your post. My kids live in Tenafly.  I just wondered how you were doing on the Aromasin. I just started Aridimex tonight.  Trying something a little bit different. Neo adjuvant hormonal therapy hoping to shrink some of what is in my left breast before surgery.  So -- reading all the posts on enzyme therapy and the potential side effects is a little scary but this whole disease is.  Tennis used to be my passion -- great sport.  I played the singles leagues in Washington Twp. But my hip started to be tricky so I gave it up for other kinds of exercise which are kinder to my body.  Wish I played now -- your Sunday group sounds great. ",
      "MessageIndex": 15,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829167",
      "Title": "Just diagnosed, looking for surgeon in Northern NJ or NYC wenben bridgegal25"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Feb 7, 2015 02:27PM bridgegal25 wrote: I chickened out the first time -- went again this week armed with valium.  Looked at the machine and said to myself I can do this. That was until they placed me on my stomach and I got huge pain in he sternum area from the pressure.  Then my hamstring cramped and also the pain started in the lower back. I am in good shape, work out all the time and I knew that being on my stomach wasn't going to be easy. I made the effort but I said there is no way I can do this and I bid them adieu and went across the street to my favorite bar and grill and had a couple of vodkas and a large pizza.  So -- my surgeon will have to do the surgery based on my ultrasound and mammo.  Would I have liked to do this? You bet. But I felt like I didn't want to compromise my joints when I know that there are other methods that can be used.  I will be calling my team  on Monday to have a discussion. I have read that the breast MRI is controversial because of the false positives.  I also know that my surgeon has done many without the MRI because of dense breasts which I have.  The powers that be really need to come up with something better than this machine. Probably not in my lifetime but wanted to weigh in. Would love to hear from others with with a similar dx  who couldn't do this test and how it turned out.",
      "MessageIndex": 25,
      "PostDate": "07/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/823274",
      "Title": "Please describe your breast MRI CeciliaVera Trvler"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Mar 10, 2015 04:05PM bridgegal25 wrote: Hi there -- just saw your post and I'm sorry you have to be here.  I am in Northern NJ and am being treated out of Valley Hospital in Ridgewood, NJ.  My breast surgeon is Dr. Laura Klein and I am very pleased with how everything has been so far. She is a great gal, very compassionate and takes her time with you.  I recommend that on your first visit with anyone regarding bc that you bring a tape recorder with you. It helps so much because your head is spinning on the first visit and to listen after is very helpful.  Good luck and if you need any more help, just give us a shout.",
      "MessageIndex": 13,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829167",
      "Title": "Just diagnosed, looking for surgeon in Northern NJ or NYC wenben bridgegal25"
    },
    {
      "AuthorID": "bridgegal25",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "bridgegal25 wrote: Hi there -- not happy to be here but seeing how great this site is I felt I had to join. Dx'd yesterday with Invasive Carcinoma.  Following is how the pathology from the biopsy reads:   A.Left breast at 3:00.Core biopsy. Invasive Carcinoma. Moderate to poorly differentiated measuring  8mm in greatest dimension and involving all the submitted cores. B.Left breast at 4:00. Core Biopsy. A small focus of invasive carcinoma measuring 1mm in greatest linear dimension. Both tumors are morphologically similar. Breast cancer marker tudies (ER, PR,Ki67) will be done on blockAI at the Valley Hospital lab and reported separately.  Her2/neu by Fish will subsequently be done and also reported separately. Have appt. with breast surgeon l/23.So can't get my staging until she does surgery.  Had uterine cancer 11/09.Had complete hysterectomy  with no further treatment needed. Strong ER of 99% positive. Progesterone - same as ER..Ki67 borderline. Her2 test by Fish is pending. Any feedback is appreciated. Scared it could have metastizied already. Wasn't there four years ago when I had a mammo and ultrasound.         Dx 1/12/2015, IDC, <1cm, Grade 1, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Jan 13, 2015 01:14PM bridgegal25 wrote: Thanks Moderators.  This is an amazing site and before dx I browsed a lot.  This is some complicated disease.  I did go to your  Pathology Report on this site,  but was unable to fill in the grade and stage because my understanding is that these things are staged when the breast surgeon does the surgery. She is the next one I see on 1/23. And then she will prob. tell me I need a lumpectomy to take the \"thing\" out, and from what I have heard, that is where the staging comes in. I am older,way over 60 and am hoping that I will hear her say that in older women, this IDC is not aggressive.  I did post as much info as I could into my first post and that is pretty well all the info I have up to now.   Initially I was happy that the two \"masses\" which were called \"architectural distortions\" were tiny. Now I see from information, that the size doesn't matter so much. If I am incorrect in this assumption, would love to hear from anyone who has been on this roller coaster ride. Thank you for this amazing site which most of us would rather not be on.   ",
      "MessageIndex": 2,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "bridgegal25 wrote: Hi there -- not happy to be here but seeing how great this site is I felt I had to join. Dx'd yesterday with Invasive Carcinoma.  Following is how the pathology from the biopsy reads:   A.Left breast at 3:00.Core biopsy. Invasive Carcinoma. Moderate to poorly differentiated measuring  8mm in greatest dimension and involving all the submitted cores. B.Left breast at 4:00. Core Biopsy. A small focus of invasive carcinoma measuring 1mm in greatest linear dimension. Both tumors are morphologically similar. Breast cancer marker tudies (ER, PR,Ki67) will be done on blockAI at the Valley Hospital lab and reported separately.  Her2/neu by Fish will subsequently be done and also reported separately. Have appt. with breast surgeon l/23.So can't get my staging until she does surgery.  Had uterine cancer 11/09.Had complete hysterectomy  with no further treatment needed. Strong ER of 99% positive. Progesterone - same as ER..Ki67 borderline. Her2 test by Fish is pending. Any feedback is appreciated. Scared it could have metastizied already. Wasn't there four years ago when I had a mammo and ultrasound.         Dx 1/12/2015, IDC, <1cm, Grade 1, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Jan 14, 2015 04:36PM bridgegal25 wrote: Thank you for the driver help. I am fine. Very healthy, drive all over the place and intend to say this way,.  This \"thing\" in my left breast is not going to get me.   Good for you on spinning. I thought of trying but not confident I can keep up. Girl friend loves it and goes daily.   ",
      "MessageIndex": 9,
      "PostDate": "14/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Jan 18, 2015 05:04AM bridgegal25 wrote: Hi Greenae -- I think you and I have very similar diagnoses.  My biopsy says 8mm also with another 1mm \"small focus\" of IDC right next to the 8mm mass.  However, these are all in the same area of two previous biopsies. So at first I thought they were scar tissue.  Showed up on mammo and US as \"architectural distortions\"..  Left breast.  Of course this breast after biopsy done almost two weeks is itching and bruised still.   I have reflux on that side so now of course, with my imagination running wild, it is metastisis. The mind plays tricks after this dx. Some mornings I wake up feeling so positive and others there is that horrible feeling of negativity.  I see you are in the city -- great hospitals there. I am in NJ but Valley Hospital is a few mins. from my house so opted for that instead of going through the hassles of travelling to NYC. I will post results from whatever the breast surgeon says on Friday.  Let's stay in touch with each other and talk it through. We will get through this.  By the way, without having met with a doctor yet, how do you know yours is a Grade 2. They did not put any grade on my biopsy report.",
      "MessageIndex": 22,
      "PostDate": "18/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Jan 19, 2015 03:10PM bridgegal25 wrote: Actually I got up feeling that way today.  Enough already I said to myself with the negative thoughts. Went and played bridge -- very distracting for me. Skipped the treadmill today -- tomorrow's another day.  But to repeat I'm not going to let this stop me from doing what I want to do and need to do.  Just came home and yes, sipped a vodka and cranberry and feel even better.  One day at a time. My appt. is Friday with Dr. Klein at the Valley Hospital Breast Center and I am looking forward to what she has to say. My kids will be with me and also my two great loves who have passed. They will be with me in spirit.",
      "MessageIndex": 34,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Jan 14, 2015 03:23PM - edited Jan 14, 2015 03:24PM by bridgegal25 Hi Proudtospin. Thanks for the msg. Yes, Valley Hospital in Ridgewood, NJ. 10 mins. from my house. The gal I am going to see is head of the Breast Center at Valley. Highly recommended. I am taking my two children with me and of course, my tape recorder. Have a lot of experience unfortunately, since I lost two husbands to this disease and have had early stage uterine cancer five years ago.  This disease is testing every bit of strength I have but I have decided that I will be the winner.  From your \"name\" on here, looks like you spin. I workout about five times weekly with walking on treadmill and weight training.",
      "MessageIndex": 7,
      "PostDate": "14/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Jan 15, 2015 06:39PM bridgegal25 wrote: To Dede 22023. Thanks for the encouraging words in this journey none of us wanted to take. I wish you well on this trip.   Shirl",
      "MessageIndex": 10,
      "PostDate": "15/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Jan 18, 2015 05:10AM bridgegal25 wrote: Hi hopeful -- thanks for your reassurance. So glad the meds are working for you.Yes, I have been shivering since I got the dx.  But I am also eating myself out of house and home. Have gained 4 lbs. in a week.  I wish you the best.  I will post as I go along on this journey I never wanted to take and thanks for staying in touch.   Shirl",
      "MessageIndex": 23,
      "PostDate": "18/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Jan 19, 2015 02:30PM bridgegal25 wrote: You go girl. Don't let anything stop you.  This is just a blip in the road of life. We have all suffered some extreme losses but life goes on. Just do what you want to do and kick ass.  Don't sit home thinking about this all the time.   Distract yourself any way you can and know that in the end you are going to be OK.   After my dx last week I felt awful, but did a lot of research, talked to a lot of people and saw that I am not in a very bad place. Just need some work to get through it.  Sipping my vodka right now,  know that I am going to be fine and so are you.   Shirl",
      "MessageIndex": 32,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Jan 17, 2015 06:56PM bridgegal25 wrote: This is a tough ride to take but has to be taken.  I always wonder to myself how my grandmother and my mother lived to be in their late 90s without ever  going for mammograms and yes, colonscopies.  What if they had cancer in their bodies and never knew it and it never grew and they lived their lives normally. I am over 70 and thought twice about going for a mammo since my oncologists for the uterine cancer told me not to bother any more since breast cancer in older women is not that aggressive.  So I went and started the roller coaster ride. All of this being said (I am ranting here) my greatest fear is the spread of this thing. We don't know until the surgeon does what he or she has to do and then we wait again.I am prepared for my breast surgeon appt. Have notes, questions, and of course, my tape recorder. I have heard good things about the surgeon I am about to see.  By the way I do not take Xanax to calm myself but an old med called Donnatal which calms my stomach down. I have IBS. and it sure does help.  Also a shot of vodka here and now does the trick. I have gone over my path report with a fine toothcomb. I am ER and PR strong positive.  Have good Ki67 readings, but am waiting for HER2. If I knew for sure whether this \"thing\" is just confined to my breast only I would be a much happier camper. I also was on HRT for 20 odd years -- that probably did it a well as giving me uterine cancer. I also would love to find out if having no reproductive organs (had a complete hysterectomy five years ago) is a good thing at this time but haven't gotten any info on that either. I also am getting night sweats and am wondering if this has anything to do with the \"thing\". Prob. not but am changing to a pillow wih only cotton material.Now with every ache and pain I have in my body, I imagine the worst.  My other breast is now aching -- it probably ached before the diagnosis but never noticed. Now I am aware of every little twinge. Sorry for the rant but thought I would just put down on paper what I am feeling at this horrible time.  ",
      "MessageIndex": 19,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Jan 14, 2015 03:00PM bridgegal25 wrote: Thank you Hummingbird for your words of encouragement. This site is so amazing with so so much info. And thanks for the recommendations.. Me being me am going over the path report with a fine toothcomb and attempting to find info that way. On the 8mm mass, the poorly to differentiated description doesn't sit well with me, having done some research.  This mass says \"8mm in greatest dimension and involving all of the submitted cores\" Confusing -- does this mean that the radiologist submitted the whole mass instead of a piece? \"all sumitted cores\" is throwing me a little bit and that's where I am confused. Also they say \"invasive carcinoma\" with no mention of what type of carcinoma. I am aware that there are different types of carcinoma. After having spoken to the radiologist office (head nurse), radiologist has the flu -- she told me that everything will be explained after the breast surgeon goes in there and actually sees what it is there. So this waiting in limbo is hell.  A shot of vodka sure does help. LOL. but I am one of those people who needs a little more explanation and since I don't meet with the breast surgeon until the 23rd, am left wondering and waiting, like 80% of the women on here. And...I also realize that regardless of the size of the masses, it's the lymph node involvement that really counts.   Again, thank you for any information that I can get.            ",
      "MessageIndex": 4,
      "PostDate": "14/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/827567",
      "Title": "Just diagnosed yesterday bridgegal25 greenae"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Feb 9, 2015 04:54AM bridgegal25 wrote: Hi Maureen -- So happy for you that your husband is out of the hospital and that you have help for your daughter. When I first read your most recent post, I got so angry at your doctor telling you to be treated somewhere else and not where you are comfortable even with you paying for your reconstruction.  I liked Wrenn's advice to you to you to just deal with one thing at a time and think about reconstruction at a later time.   I don't know where you are being treated now. If it's a cancer center or a hospital, I think a call to the top brass there might bode you well with your current circumstances. I have to presume that this is closer to home for you rather than where it was suggested you go now.  I realize you felt comfortable with your doctor, but there has to be some compassion on her part under these current circumstances.  That's why I suggested calling the powers that be where you are being treated now.  I also realize that this is a very personal decision on you and your family's part so forgive me putting in my two cents.  I just sometimes feel that doctors are too quick to dismiss circumstances without going the extra mile.   Vent away on here -- we are listening.   Shirl",
      "MessageIndex": 19,
      "PostDate": "09/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/828130",
      "Title": "Very nervous about Bi-rads 5 Mkulsar46 Moderators"
    },
    {
      "AuthorID": "bridgegal25…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210011/profile",
      "Content": "Feb 8, 2015 08:47AM bridgegal25 wrote: Hi there -- I have been reading your posts and you sure have a lot to deal with right now.  This board is the best and you will get a lot of support here as you already have seen.  I would love for you to be able to get some counselling or therapy. It would help you so so much.  They have come so far with breast cancer and there are many many support groups out there and so many new treatments.  Ask for help -- don't refuse it -- seek support where you can get it.Your surgical team can help you with that,.    My story is for another day.  One day at a time, breathe deeply and yes, do not seek the help of Dr. Google. This is the best place to be.  We are all here for one another.  The best to you and hang in there.  This is a fight you will win.    I am going to do just that.   Shirl",
      "MessageIndex": 15,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/828130",
      "Title": "Very nervous about Bi-rads 5 Mkulsar46 Moderators"
    }
  ]
}