{
  "AuthorID": "bride",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
  "Posts": [
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Feb 22, 2015 10:53PM bride wrote: Hi, Are you at a NCI designated cancer center? If so, they might have a Hope Lodge attached. There is no fee to stay at a Hope Lodge, but you must live more than 50 miles from your treatment center. Also, many cancer centers that don't have Hope Lodges have made deals with local hotels, my treatment center had both. When the Lodge is full, the overflow is directed to a specific hotel -- the cost of which is predicated on a sliding scale which tops out at around $15-20/night. You might want to check with your center's social worker or ask your RO",
      "MessageIndex": 5,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/828639",
      "Title": "switched radiation to other center? oceangirl654 Hopeful82014"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Jun 17, 2015 12:56AM bride wrote: Aprilinprogress and MichelleB, IBC presents itself in many, many different ways. None of us presented in exactly the same way. But IBC is extremely rare. Still, you should see you doctor if you're concerned enough to be looking for information on the net. You both describe bruising which isn't common with IBC -- a red band is more indicative. There is no reason to buy panic and worry when IBC is the last of a very, very long list of probable causes. Best wishes, bride",
      "MessageIndex": 44,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/816522",
      "Title": "When is a bruise not a bruise? LMJ62 Kicks"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "bride wrote: There is a lawsuit pending against the manufacturers of Taxotere because they neglected to disclose that Taxotere has a high rate of causing permanent hair loss — to your head, eyebrows, eyelashes, nose, as well as everywhere else. There are many lawyers involved and over 2,400 women seeking redress. I’m one of them. I usually hang out in the IBC forum and certainly have no stake as to which lawyer you chose if you have Taxotere induced hair loss. Having said that, after much research into various law firms, I chose Arentz Law. My lawyer, Andrew, has been very responsive. Again, I’m not trying to fish for clients. It’s just that after several sorry experiences with other law firms, I was relieved to find a good one. If you do have hair loss or thinning and you were given Taxotere, please do your own due diligence and join the lawsuit. Drug manufacturers SHOULD NOT BE ALLOWED TO LIE TO US. And that is exactly what the makers of Taxotere did. Having cancer is bad enough, having drug makers put profit ahead of patient wellbeing is outrageous. After 3 years post treatment, my head hair is much, much thinner than it was and my eyebrows, eyelashes, and nasal hair are basically gone which means I now have to use eye drops because I keep getting stuff in my eyes that my eyelashes used keep out. I’m also on meds to control sinus issues I didn’t have prior to treatment. All because I was lied to. There are other, similar drugs to Taxotere that are just as effective. So yes, I’m pissed off. And yes, I want the lawsuit to succeed. I know I’m not likely to receive much recompense, if any. But, by god, people with cancer deserve to be informed of all of the risks and side effects of our treatment. We should not be victimized by profit-driven drug companies that knowingly LIE to us. bride Each friend represents a world in us, a world possibly not born until they arrive, and it is only by this meeting that a new world is born. ~Anais Nin Dx 12/2/2013, IBC, Stage IIIB, 0/12 nodes, ER+/PR+, HER2+ Hormonal Therapy 11/18/2014 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862582",
      "Title": "Hair Loss and Taxotere bride bride"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Jun 17, 2015 01:55AM bride wrote: Hi, I've no magic words to ease the pain of waiting for results. We've all gone through it and there isn't a way to avoid it. But you are strong enough to make it through the waiting. I'd take breaks from it -- stay off the net, read a novel or whatever. Even a short break will help. And if you need to, don't be shy about asking for meds to help your anxiety. And rage, vent, cry, or whatever you need here. We may not be able to fix it, but we can offer lots of support. Best wishes, bride",
      "MessageIndex": 4,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832661",
      "Title": "Being sent for Diagnostic Mammogram and U/S SOOOO scared!!! RockMamaof2 crmnsuga1973"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Feb 3, 2015 12:34AM bride wrote: Hello, I think your docs are being cautious and thorough. Did your wife's post-surgery pathology report say any thing like \"there is no evidence of disease\" or something like \"no cancerous cells were found\"? If not, I think your docs want to use radiation to destroy any cancer cells which may be present. Since your wife is triple negative, there are fewer meds available to wipe out any remaining cancer cells. Radiation is generally far less grueling than chemo. Please note that all I can do is guess. You need to ask you wife's doctors why they added radiation. Wishing you and you wife the best, bride",
      "MessageIndex": 1,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/828129",
      "Title": "My doctor changed is mind about radiation jd44 bride"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Feb 3, 2015 05:00PM bride wrote: JD, Please don't worry about your English, you're perfectly understandable. I know very little about IDC but there is forum here for it. You will probably get better information there. Although your wife's tumor is small, the pathology report suggests that it is more aggressive than average. Between your wife's triple negative status and the nature of her tumor, it sounds like her doctors are cautious and are wanting to make sure they eliminate all cancer. That may be the reason that they added on the radiation. I know things are very confusing and scary right now. Try not to panic -- IDC makes up 80% of breast cancers. You might want to call the American Cancer Society (if you are in the US) at 1-800-227-2345 and ask if they can provide you with a cancer navigator. The center that is treating your wife will have social workers who can help you with dealing with the doctors. The social workers can also help you find a second opinion. For now you might want to use the left handed side menu to go to the IDC forum -- I'm sorry but I don't know how to link you there. Take care, bride",
      "MessageIndex": 8,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/828129",
      "Title": "My doctor changed is mind about radiation jd44 bride"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Jan 1, 2016 01:18AM bride wrote: Lily23, I can offer you one example of how quickly IBC presents and changes. I have IBC. I woke up one morning with a swollen, hot, breast with an inverted nipple. Within three weeks all of my preliminary tests and scans were done and I was ready for my first infusion. By then, my breast skin had thickened, had well developed peau d' orange, and had become more swollen. Now, we are each unique but I find it hard to believe that you would've had no changes in 10 months if her were IBC. Note: this is just my personal opinion; I am not a medical doctor. bride",
      "MessageIndex": 13,
      "PostDate": "01/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838862",
      "Title": "I'm back again Lils23 bride"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Nov 25, 2014 08:00AM bride wrote: Akevia, Human hair grows about 6 inches a year. Although I'm still on Herceptin, since the beginning of August I've managed to grow about 3/4 of an inch of hair. Like several other posters my eyebrows have yet to start regrowing. Keep the faith, your hair will eventually grow back. Best, bride",
      "MessageIndex": 33,
      "PostDate": "25/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826475",
      "Title": "Hair growth after AC Akevia Akevia"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Jun 17, 2015 03:45AM bride wrote: Why should anyone apologise for Kicks? She makes a point which must be made: we can offer much but we cannot make a diagnosis. BC is a tricky disease. For example, Kicks and I were DXed with the same type of cancer, at the same stage though years apart. Our cancers presented in very different ways. And either openly or implicitly, we are often asked if this or that could be cancer. No one here can answer that. All we can do is tell you to be checked out, support you through the process, and wish you the best. We've all been through the pain of waiting and while I know how bad that is, I also know you have the strength to get through it. I know nothing about discharge. It seems unlikely that discharge from both breast would be cancer, but you are doing the right thing by being checked out. Keep us posted. Best wishes, bride",
      "MessageIndex": 8,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832665",
      "Title": "Beyond Freaked Out! velvetstorm78 Jonnilynn"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Oct 27, 2014 02:33AM bride wrote: Hi TwoTabbies, What do you think of Teavana.com as a shop? There isn't any place to buy green tea directly in my tiny town. Thanks for the great post!",
      "MessageIndex": 619,
      "PostDate": "27/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Nov 24, 2014 01:00PM bride wrote: WT, Did you black out or have a seizure? I blacked out in the middle of the infusion center because of a low sodium level. I spent 5 days in ICU and had a transfusion. Lots of things can cause a blackout wrt to BC. The most common is the result of us being told to drink lots and lots of water and NOT telling us that water washes out sodium and potassium. If you've not had further blackouts, I'd suggest going over your labs to see if anything is wonky. Have you gone to http://cancer.ca ? I typed in Quebec and got a list of free transportation, sources of money, and a bunch of other stuff. You might find this useful. I, too, wanted a BMX. However, when I was knocked out for that surgery, my blood pressure fell to 60/40. Woke up to still having both breasts. Given that scare my surgeon didn't want to risk doing a BMX. I was already in a bad state from my sodium misadventure and really didn't want to crash in the OR. So I had a UMX. So far my appearance hasn't been an issue. Like you and Wren, I have PTSD. Mine is evidently well treated because I've had no additional problems during my BC saga. I use my GP (PCP) and my MO has my 2 main docs. Following the excellent advice I received here, I managed to retain some sense of control and have managed to keep my healthcare team on the same page. Cancer.ca also has volunteers who can act as your navigator to get everything coordinated. Perhaps this might also be of use to you. best, bride",
      "MessageIndex": 227,
      "PostDate": "24/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/821871",
      "Title": "New, scared, and sleepy WhiteTiger farmerlucy"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Feb 3, 2015 05:03AM bride wrote: I imagine that your RO is waiting for the surgery pathology -- from your posts I'm a bit confused as to whether your wife has had surgery. When you use the term radiotherapist are you referring to a Radiation Oncologist? If so, I'd try to understand why the RO and the MO don't agree. It might make things clearer if you felt comfortable telling us what type of cancer your wife has, what her stage is, and what treatments she has had. That your wife is having reconstruction is not as important as making sure she has no evidence of disease. I understand that you know the risks and benefits of radiation. I hope you are equally familiar with the risks and benefits of reconstruction. And remember that you have the right to get a second opinion about what both your RO and MO are telling you",
      "MessageIndex": 6,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/828129",
      "Title": "My doctor changed is mind about radiation jd44 bride"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Feb 17, 2018 03:17PM bride wrote: My daughter-in-law and one of my granddaughters got the flu despite having had flu shots. The CDC says the flu vaccine is only about 32 percent effective this year. My stubborn DIL didn’t get treatment and was sick for 10 days. My granddaughter got Tamiflu (?) and was sick for 2 days and, honestly, she had no symptoms after 1 day on the antiviral. I think getting the flu shot and then seeking treatment immediately if you get flu symptoms really lowers the risk of serious danger. I understand your anxiety but, hopefully, it will come to nothing. I do think you don’t need the anxiety about your son — it’s not good for your own health. And that’s exactly what I would tell your son. Best wishes, bride",
      "MessageIndex": 132,
      "PostDate": "17/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Mar 2, 2015 11:34PM bride wrote: Sas Schatzi, One of the first case studies using the hygiene hypothesis was done during the polio crisis. Kids who lived in settings in which they were exposed more infections from going barefoot and living without toilets were much less likely to get polio or had many fewer symptons and long-term effects. Seems these kids had developed many more types of antigens and produced antigens more quickly. Makes sense to me. bride",
      "MessageIndex": 272,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Oct 27, 2014 01:29AM bride wrote: davida58, I also have Sjogrens, although I have few symptoms. My rad onc started me on PT as soon as I started rads to address any possible issues. I do have problems with freeing my shoulder blades and my chest and armpit are amazingly tight. PT is helping greatly! Thanks to all who responded to my earlier post. I have 3 rads & then 5 boosts and I'm done, yea! Skin has held up beautifully but the damn tape does itch. Despite Magic Mouthwash, I still get a sore throat -- it eases within a few hours, thankfully. As I said before, I've found radiation to be the easiest part of my almost year long treatment program. After rads, all I have is 9 months of Herceptin infusions and a whole bunch of PT. It does seem to get easier to handle. I hope everyone who is worrying about rads or struggling wit the side effects can find some comfort in knowing it really does eventually end. bride",
      "MessageIndex": 692,
      "PostDate": "27/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Oct 16, 2014 05:37AM bride wrote: Hi all, I just finished 15/30 rads -- that doesn't count the boost sessions. I have triple positive IBC, stage IIB, and, luckily had a 100% response to chemo. Radiation has been easy compared to my almost 6 months of neo-adjuvant therapy. I've only got one hot spot  I credit Miaderm for heading off other skin issues. I do have a bit of a sore throat from rad spillover and, between my surgery and rads, my back and shoulders are a mess. Otherwise, I have to say rads have been the most livable part of my experience. bride",
      "MessageIndex": 565,
      "PostDate": "16/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Oct 27, 2014 07:12AM bride wrote: Davida, I'm glad you get to skip chemo! And you sound like you have your sjs well in hand. 3D external beam radiation is the gold standard now for most BCs. I imagine that within a few years, radiation done with antimatter and/or nano particles will become the new standard. Hopefully, none of us here now will need it. :) bride",
      "MessageIndex": 697,
      "PostDate": "27/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Nov 1, 2014 12:56PM bride wrote: Hi Jstepp, I can see why you're confused. I'm not a doctor so I can't DX you. But you might consider an US before a biopsy. MRI's aren't the best tools for detecting different BC's. Right now you are doing everything right: asking questions, trying to get an answer as to why these 2 docs saw different things, and even how to handle the insurance. It sounds rightfully that the most important thing for you is getting correct information and so are correct in demanding that. I'll be thinking of you - let us know how you're doing, okay? bride",
      "MessageIndex": 1,
      "PostDate": "01/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/825927",
      "Title": "So confused Jstepp Jstepp"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Feb 23, 2015 07:11PM bride wrote: Kris, You did a great job in finding your way to a really fine treatment center. Robert Wood Johnson is the main hospital. The general cancer center is the Steeplechase center. The team led BC center is the Sanofi center. A really good contact there is Agnes Salmon, a Breast Cancer Patient Navigator, who can be reached at 908-704-3781. She'll guide you through the process and can access all kinds of resources for both you and your gf. I'll repeat what I said in my PM. Get copies of every test, lab, report there is. Depending in the type and stage of BC your gf has, you'll have to go through lots of tests and, given Janofi's team approach, you may have meetings with a MO, RO, OS, among others. Write down questions and record the docs answers. I know that the beginning is the hardest part in many ways -- there's too much to do, to learn, and seemingly no way to cope with the fear and anxiety. But remember that you also need some caregiving. We're here for that. Please tell you your gf that there is no shame in having cancer. And though some folks say really inane things, most people respond with kindness. Whenever, if ever, she wants to post here, please let here know she's very welcome. Stay in touch, ok? bride ",
      "MessageIndex": 12,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828714",
      "Title": "Just Diagnosed / 32 yrs Young Girlfriend Facing Breast Cancer leafuponleaf bride"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Nov 3, 2014 08:47PM bride wrote: Kwhitmo, I'm finishing rads tomorrow. My RO had me positioned so that my head was turned to the left and my right hand rested on top of my head -- typical for aiming at both the chest and lymph areas. The right side of my throat was often sore and I had trouble swallowing. My RO suggested Magic Mouthwash which didn't help, though it did help a couple of others I've met. What worked for me was avoiding anything too hot or too cold when drinking or eating. I did also notice that if I basically rested my throat, it wasn't as bothersome. As soon as my boost started my throat issues stopped completely. One side effect that didn't linger. :)  bride",
      "MessageIndex": 809,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Jan 7, 2014 12:52PM bride wrote: trekwriter, if plain water is starting to bore you -- goodness knows I was boring myself even worse than plain water -- you might want to try making a weakish brew of camomile tea, chilling it, and mixing it with your water. One of my docs said tap water is actually pretty rough on your innards and camomile is rather soothing. It sure helped me. I'm sorry you're feeling so rough. I really do understand. What was surprising to me was how, after days of feeling blah, I woke up feeling just fine. It's weird, almost like an on off switch. Tekwriter, you're doing a great job of taking care of yourself -- big, big kudos! bride",
      "MessageIndex": 86,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Dec 24, 2013 10:18AM bride wrote: I'm an almost January starter: my first chemo is 12/27. I have Stage IIIB, IBC, am triple positive, and, luckily, only one lymph node is involved. I'll be receiving Herceptin, Perjeta, and Taxone. Like everyone else, I'm wondering what this trip will be like.",
      "MessageIndex": 7,
      "PostDate": "24/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Jan 7, 2014 04:14AM bride wrote: Hello all, I had my first chemo on 12/27. I was scared witless. And then promptly slept through the whole infusion. No nausea. For the first couple of days I had constipated diarrhea (??), then three days of nasty joint pain. Followed by a week of endless diarrhea. Worst of it was that I had the attention span of a gnat. Then I felt fine. It wasn't fun by any means, but it's manageable. I had gotten my hair cut short enough so that I could buzz it -- no way was I going to risk stopping up the drains in my old house. Still waiting for the shedding. It was one wild ride, but I believe those who have been through it that it does get less wild.  I realized something that I hope everyone here will come to understand about themselves: we really are strong and more resilient than we know. bride",
      "MessageIndex": 83,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Jul 6, 2016 01:56PM bride wrote: Hello Dreamfisher and welcome. You are right in seeking a definite answer. Your GP should order a mammogram at least. Since you also have pain in your extremities, it may not be cancer. But given your family history, the NHS should okay you being thoroughly checked out. I believe there's a really good but private breast clinic if I remember correctly is called Madsen. Having lived in London for a while, I understand how frustrating the NHS is. Please keep us posted. Cheers, bride",
      "MessageIndex": 1,
      "PostDate": "06/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/845591",
      "Title": "Pain on both breasts, ruled out by GP!?! Dreamfisher Dreamfisher"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Jan 1, 2016 03:32AM - edited Jan 1, 2016 03:32AM by bride As Kicks said, pain is not a major feature of BC. Having said that, yes, BC can be missed on a mammo although the newer 3D mammos are very sensitive. A biopsy done by a breast radiologist will give you the most clarity. Given your family history and earlier biopsy, your PCP should be able to order one. If you run into problems (and seeing a dermatologist isn't a problem) call the American Cancer Society -- they can help in many, many ways. The best you can do is not assume the worst. Please don't convince yourself it's cancer -- take it one step at a time. brid",
      "MessageIndex": 5,
      "PostDate": "01/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/839136",
      "Title": "Breast Pain Gracemarie Weneke6"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Jan 1, 2016 03:02AM bride wrote: Weneke, Hopefully all your questions have been answered by now. And hopefully all the answers were good. Please ease up on the fear of IBC. IN 2014, of the 254,600 new cases of BC in the USA, 1,435 were IBC. That is a very tiny percentage. There are dozens of other conditions that can cause a breast rash or difference in the skin. All of them are more common than IBC. So please try to relax. If you do belong to the minority group of IBCers, remember IBC isn't a death sentence. The treatment is rough but it's something you can handle. I did, others did. Don't fall into despair. BCO is here for you and it's a great resource. bride",
      "MessageIndex": 25,
      "PostDate": "01/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838786",
      "Title": "So I am back and worried.... IBC????? Weneke6 Djabi53"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Oct 27, 2014 05:55AM bride wrote: I, too, am hoping your MRI shows nothing negative. My thoughts are with you.",
      "MessageIndex": 6,
      "PostDate": "27/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825766",
      "Title": "MRI Tomorrow.... smiler324u SlowDeepBreaths"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Sep 18, 2014 10:45PM bride wrote: Hi Emma, None of us can diagnose IBC. But I think all of us would agree that you should keep pushing until you do have a diagnosis - hopefully one the eliminates IBC. If you can afford it, I'd recommend going to a non-NHS doctor.  You've clearly schooled yourself on IBC and I applaud you for doing so. Until IBC is ruled out even as differential DX, you have to hang in there and push for answers. You can win through and get a definitive DX but you may have to tell your GP to sod off and switch docs or go outside the NHS. Having said all that, I hope that this snippet of information might slightly ameliorate some of your fears: in the US, for 2013, over 260,000 cases of breast cancer were diagnosed. Only 11,800 cases of IBC were reported. At least statistically, the odds are in your favor. Wishing good things for you bride",
      "MessageIndex": 11,
      "PostDate": "18/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/824490",
      "Title": "Good news and confusing! Emjay76 angelaisscared"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Oct 27, 2014 06:33AM bride wrote: Davida, After my surgery my ROM seemed pretty good, especially after I got those nasty tubes out. In my case, I had an ALND and when the three vessels that feed into my nodes were cut, they sort of merged and created a lump that reacts much like a ganglion cyst -- but you can't smack it with a heavy book. So the PT has to harass it until it breaks. Since I have IBC my surgeon wanted to be very thorough and she was. Even though I had a 100% response to chemo, my surgeon took most of my minor chest muscles and in doing so left my pectoral muscle really tight. Still, it is resolving. I checked more on my rad onc's recommendations for dealing with Sjogrens. Not much you probability don't already know: if you're not using a RX mouth rinse, biotene dry mouth rinse is very effective. And watch your eye lubrication, rads, especially in the cooler, dryer weather, can worsen dry eyes. My rad onc also suggests yoga or PT, though she is adamant about balancing that with the fatigue (I've had minimal fatigue).  The other bit to note is that chemo increases your risk for cataracts and that risk increases in the presence of Sjogrens. But basically, she said that rads shouldn't worsen your sjs. Let me know how you're doing, okay? bride",
      "MessageIndex": 695,
      "PostDate": "27/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Oct 31, 2014 09:13PM bride wrote: Cobindle, I had six months of neoadjuvant chemo with difference meds. And it kicked my butt. I was even in the ICU for awhile. But the first was the worst -- I felt like WWIII was going on in my chest. I'm not sure if my side effects decreased or if I just got better at managing them. I had to celebrate the smallest victories; one day yogurt really didn't taste like soured metal. My MO tried everything to ease my discomfort and nothing worked. There were times when I just wanted to walk away from all of it. Thankfully, I didn't and, in fact, had a 100% response to the chemo. You have the right to get the best medicine available. You also have the right to speak with mental health worker. Mine kept me afloat when I was sure I had sunk.  This may the most difficult thing you've had to endure. But you can do this! there are all sorts of resources to help you. Please use them and also this group: these are some of the wisest women I've encountered. They are certainly the most giving and care group I know. You are stronger than you believe and with help, you can find positive ways to get through this. {{{HUGS}}}",
      "MessageIndex": 12,
      "PostDate": "31/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825787",
      "Title": "Day 5 and I don't feel strong enough Coblndie Coblndie"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Feb 22, 2015 02:15PM bride wrote: Mandy, Thank you for your kindness in posting here. Your mother was of great spirit and generosity. Rebecca gifted me with some of her needlework and, more important, her messages to me were full of joy. Mandy, your mother and your family are in my thoughts and prayers. Joha",
      "MessageIndex": 51,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828643",
      "Title": "My Mother raro stagefree"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Nov 24, 2014 03:00PM bride wrote: Hi, kjybaby, Sorry that you are joining us. I was DXed a year and 2 days ago with triple positive IBC. I did 16 chemo infusions, then surgery, then 30 rads. I'm still getting Herceptin infusions every 3 weeks. I've had no side effects from the hormonal treatment though I was allergic to Taxotere, the chemo agent and got every known side effect. There can be excellent outcomes to what seems to be the worse possible situation: after my UM, my pathology report came back showing no evidence of disease. Your emotional response is perfectly normal. When you see your MO, ask her for a referral to both a support group and a mental healthcare worker. And, of course, this group is always here for you. Let me give you some advice I was given when I was first DXed. Get a large file and keep copies of every piece of paper you get. I have sections for labs, breast tests, other tests (Petscans, echograms, etc), chemo, rads, etc. I have a separate file for all my insurance stuff. If possible, please take someone with you to your appointments. They can take notes, ask questions, and, generally, ease some of the fear. Also, get a notebook to write down your questions. You wrote that you've had to drop out of college because of this. You might want to check whether you can continue your insurance if you pay the premium. If that's not possible, there are other ways to get help with your medical bills. And don't fret about dropping out of college: I taught college for 30 years and know that eventually going back to finish will not be a big deal. After a year during which I had little time for anything but dealing with my cancer, it still feels unreal at times. Disbelief, anger, fear, and bargaining are part of the emotional response we've all had. Despite all your emotions (mine felt out of control), you can do this. best, bride ",
      "MessageIndex": 10,
      "PostDate": "24/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826459",
      "Title": "Diagnosed with breast cancer at 27 kjybaby Cuetang"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Dec 15, 2014 12:34AM bride wrote: Yes, radiation does increase your odds of having lymphedema. But there are things you can do to lower your risk. My RO started me in therapy with a certified lymphedema therapist (CLT) while I was still in rads. I've been told to keep my BMI under 23, be wary of infections in the affected arm, and don't wear any jewelry on the bad side. Anyone who has had either a SLND or an ALND carries some risk of lymphedema forever. But 80% of those at risk don't develop it. Think of it as just another part of your treatment -- one you can have a bit of control over. Assume you will not have lymphedema or a recurrence, do what you can to make that true, and please believe there is no reason why you willhave more bad things happen. You're making it through a very bad thing right now. Yes, it's easy to fall into the slough of despair, but it's a lot more fun to enjoy life and remember the odds for good things are in your favor",
      "MessageIndex": 14,
      "PostDate": "15/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/826521",
      "Title": "Stage 3, pathology question Nursie bride"
    },
    {
      "AuthorID": "bride",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193385/profile",
      "Content": "Jan 25, 2015 05:11PM bride wrote:   Mary, I have 3 more Herceptin infusions -- I will have had a full year of it. It's very different than chemo, other than a perpetually runny nose, I've had no issues. Yeah, I did have echos every 12 weeks, but that's no big deal. You can get Herceptin as part of your chemo and while you're doing rads. I'm having it as I take Anastrozole, I'm guessing you could take Tamoxifen while on Herceptin as well. Honestly, I'd be more active on the lymphedema-- I started with a CLT while still doing rads. But hopefully you'll not need Herceptin at all. bride",
      "MessageIndex": 19,
      "PostDate": "25/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/826521",
      "Title": "Stage 3, pathology question Nursie bride"
    }
  ]
}