{
  "AuthorID": "Brip1geneticmutation",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209927/profile",
  "Posts": [{
    "AuthorID": "Brip1geneticmutation",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209927/profile",
    "Content": "Brip1geneticmutation wrote: Hello, I tested positive for a new gene mutation called BRIP1 in November. As you may know, it carries a elevated risk for ovarian and breast cancer. It is a fairly new gene mutation and there are not clear cut guidelines on how patients should proceed. So, here's what has happened so far: My mom told me she had the BRIP1 gene mutation and when I went to my OBGYN in Nov. he recommended that I see a genetic counselor. So, we mapped my family cancer history (high in ovarian and breast, especially on my maternal side) and she ran the genetic panel. So, like I said, I have this BRIP1 mutation. Next- the genetic counselors recommended I see a gynecological oncologist. I did that, and she was very informative and we discussed options. She said she could do a laproscopic surgery and remove the ovaries, but also mentioned the possibility of taking out my uterus as well. She said that way, I may be able to take some low dosages of hormones to help with the instant menopause onset (hormones are still very controversial too). She said this can be a lifestyle change and can cause problems for some people. A friend told me her surgical menopause was horrific and that she still deals with the side effects on a daily basis. There is no screening for ovarian cancer and it is a silent killer and often when found it is too late. I don't want that, but also have a history of depression and those side effects scare me. In the meantime, Dr.set me up with a transvaginal ultrasound to check on things until I make any decisions about my ovaries and any possible surgery. The genetic con. also recommended that I see a breast oncologist, so I did that too. I met Dr. Oncologist for breasts and she set me up with a breast MRI on this Friday, and I had a 3d Mammogram last week, she wants to do the MRI this week bc I have dense tissue. Dr. Breast Oncologist mapped out some plans of action that I can take- ranging from least aggressive to most aggressive. Of course, she said I can get 3d mammos twice a year, or I can see a medical oncologist and take a preventative med... I think tomoxifin or something like that??? My friend at work took tomoxifin and it caused severe blood clotting issues, so I am just trying to learn as much as I can. The breast oncologist also looked at my breasts and gave me a few options if I wanted to do a double mastectomy. She referred me to plastic surgeon to discuss those options for different types of mastectomies. So, I am definitely in the information gathering stage and am seeking as much info as I can find. Any insights would be helpful and appreciated. I'm scared and confused. Thank you. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "11/01/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/827521",
    "Title": "BRIP1 Positive Genetic Mutation- Anyone else out there? Brip1geneticmutation MelissaDallas"
  }]
}