{
  "AuthorID": "brookside",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
  "Posts": [
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Jun 28, 2009 04:24PM brookside wrote: Hi Linda Sue It will be some time in July.  I will know more Tuesday (radiation oncologist) and Thursday (surgeon amd PS).  My sister wants to take me to Ireland in August, do you think I'll be up to it if I have my surgery in the beginning of July?  From the sounds of it, no.  I had a hystectomy in1999 and I was back to work 4 weeks later.  Can it be any worse than a hystectomy??? I had no ill effects from that.  I will be farmingout my dogs and I hope I can have themback home in 2 weeks post-op.  I need them so much.  I've not beenn without at least one of my newfies by my side for 35 years.  I need them but will I be able to have them. ",
      "MessageIndex": 22,
      "PostDate": "28/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733744",
      "Title": "Exhaustion Kaidog lumineaux"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Jun 28, 2009 04:20AM - edited Jun 28, 2009 04:21AM by brookside I have 4 Newfoundland dogs and one little chinese crested.  I have to have a bilateral mastectomy and thinking about reconstruction.  I walk all 4 dogs (total weight is about 600 pounds on the other ends of the leash) all together.  When do you think I'll be able to do that again.  When will I be able to just open the van door to let them in to take them to the dog park?  I am a chiropractor, when will I be able to adjust my patients normally again?  I am strong and I went back to work 1 week after my lumpectomy and had no problmes but that was just a lumpectomy.  My poor dogs need me.  Can you just give me a clue?  My dogs and my patients need me so badly and I want to do the best for them.",
      "MessageIndex": 17,
      "PostDate": "28/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733744",
      "Title": "Exhaustion Kaidog lumineaux"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 1, 2009 03:42PM brookside wrote: Hi there already is an october rads thread.  Maybe you could do that one?  I just started yesterday myself and I'll be done oct 30.  I do chinese mushrooms, beta glycans (both are anti tumor and helpful with boosting immune system) vitamin d3 (5000iu).  I do a good multivitamin (metagenics) and I am honoring the request of the rad onc and stopping heavy duty usage of antioxidants (he says vit c and e interfer with effects of radiation and I can wait one month to honor his request on this and then I'll start them again.  See you maybe on the other october thread thing! Becky",
      "MessageIndex": 1,
      "PostDate": "01/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/741324",
      "Title": "October 2009 rads Helen-Jackie Helen-Jackie"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "brookside wrote: HI I'm not new here but now I have a new worry.  i just finished radiation October 30 and November 2 I came down with H1N1.  i am pretty much recovered now but i am exceedingly tired.  I went to the Med Onc today to speak to him about tamoxifen and he brought up the fact that I have a septated cyst on my left ovary (8 cm).  He thinks it is nothing but wants an US anyway.  i have been reading about ovarian cancer and the two cancers (breast and ovarian) can go hand in hand.  I of course have no symptoms but I am indeed worried.  Should I be or am I just dealing with a cyst.  I read that septated cysts are complex and can be cancerous.  I just thought I won my battle but it may be that i may have another war to battle.  Has anyone ever had such an experience like this????  i need your help.  Dx 5/23/2009, IDC, <1cm, Stage I, Grade 2, 0/1 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/744790",
      "Title": "should i be worried brookside Lisa1962"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 22, 2009 05:59PM brookside wrote: hi VTmom My rad onc asked me if I noticed any swelling and pain and he told me that they theorize that the pain is from the slight edema that is occurring on the breast (he said just mm's) because the edema is affecting nerve endings that are sensitive, therefore the pain.  he said that it will go away after a bit (like more than a week).  My pain did go away.  this dude is so nice and really knowledgeble (has a phd in radiation and his collegue who I also see is world renowned...I guess).  he doesn't have a wedding band on....if only. sigh.",
      "MessageIndex": 282,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 26, 2009 06:26PM brookside wrote: Dear Linn56 Here is some info on iodine and tyrosine. Thyroid hormones are manufctured from iodine and tyrosine. Even with iodized salt, iodine deficiency is still possible for individuals who use salt substitutes, seasalt preperations or choose not to use salt.  25-50 per cent of us population suffers from moderate to severe hypothyroidism.  Tyrosine, which is synthesized in the body ffrom another amino acide (phenylalanine, is  precursor of thyroid hormones.  A deficiency with l-tyrosine is associated with low blood pressure and low body temperature (both indicators of hypothyroid conditions).  Getting sufficient tyrosine from the standard american die is difficult.  Recommended dosage:  500 mg 3x daily for tyrosine. You can geet iodine from kelp and that would be 900 mcg 3x daily.  You can PM me if you have a chiropractor or a health food store for specific names of products. ",
      "MessageIndex": 302,
      "PostDate": "26/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 28, 2009 10:53AM brookside wrote: Hi I only have 2 more days of torturous burning to my poor little right girl.  I am sure that on Saturday, I'll wake up and be back to normal!  Also I am also relieved that Sunday is November 1 so I can take down that big pink ribbon around my house, put away my pink car, change my and my dogs hair from pink to brown and black respectively and put away all my pink clothing.  I can also stop writing on pink paper with dark pink ink and smash to bits all those little pink angels everyone seems to think I want. I just hope my boob is on track too and that sunday morning, it will no longer be itchy pink either!.  Just a wish.",
      "MessageIndex": 312,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 2, 2009 10:55AM brookside wrote: Hi debnyc I am doing that shortened version, but I am doing 23 visits.  I started my radion on wednesday so i only have 20 more visits after today.  I am getting tomotherapy by the rad onc who developed tomotherapy so i think I'm in good hands.  (UW Madison radiologist).  He shortened my visits from 28 to 23 and followed the canadian and european protocols.  He said they have great success with the shortened protocols but the mean weight of the patients so far have been around 110 lbs.  he said that as soon as they find that all weights have good outcomes, it will be adopted in the US as the standard protocol and he said it would save alot of people alot of money and time. .  He modified the european to fit me and that is how he came up with the 23.  I get the same amount of radiation as a 28 day person and simultaneously I receive boosts with the tomotherapy.  with tomotherapy, I get a CT daily (10 minutes), wait to see if the ct matches the original ct (5 minutes) and get the tomotherapy (9 minutes).  That is a long time to have my arms over my head and not move but oh well.  I get spasms and just will them to stop.  But I figure it is a stretching program and I'll ultimately be more flexible!  Tomotherapy is relatively new (12 years) and there are only 200 machines in the US and only 12 of them do breasts (Madisonn Wi and my podunk town are two of them) so that is kind of scary but I guess they are getting more and more abundant and it is proven.  My doc told me that this is advanced IMRT and advanced hypofraction so I hope it works. ",
      "MessageIndex": 100,
      "PostDate": "02/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 4, 2009 03:51PM brookside wrote: WLL - Hi do have only done 3 radiation treatments but I do them over my lunch hour and it so far is workable.  I go at 11:30, have a half hour of treatment (really mine does last a half hour) and then I go home...but I do have a 2 hour lunch break which is nice so if I need to nap, I guess I will be able to do that before I return to work at 2.  I did throw sticks for my dogs today and my boob really really hurt which kind of surpised me as I have been doing that since my lumpectomies and no problem.  that made me worry but I don't know.  Take care.  Becky",
      "MessageIndex": 121,
      "PostDate": "04/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 26, 2009 09:31AM brookside wrote: Hi after today, I only have FOUR more to go!  I use radiaplex but BOY am I ever itchy.  it looks like I have the measles on my boob and now it is spreading up to my clavicle and over to my other boob.  I sometimes think I'm allergic to that but I do feel it sooth after it is on but BOY do I ever itch.  I can hardly wait until this is OVER.  But I guess I'll itch for a couple of weeks after that too.  Boy knowing that it is only 4 more days of this is a blessing. However, I am getting kind of anxious.  It is not the fear of the unknown after this, it is just anxious, like okay, October 30 (last day) is the beginning of my new life and how am I going to make is more memorable than the previous 57 years.  I love my job and hate it too (can't figure that out) and I want to retire like all my other friends but I was the 'hare' and they are the tortoises and i don't think a person can retire on no savings and a huge medical bill ahead of them.  I want to find peace and calm but I only can come up with anxiety.  Oh well.  It is my life and I am responsible to make it better.  Is anyone out there like that too????",
      "MessageIndex": 295,
      "PostDate": "26/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Nov 30, 2009 04:10PM brookside wrote: Hi guys It is officially one month since I have finished radiation and I haven't looked back.  However, I am just soooo tired all the time.  I yawn all day at work and go to bed early.  I continue to try to walk daily but I just amble along and then rest afterwards.  Is anyone else kind of done with radiation and tired still?  I am usually lazy but I am just way lazy these days.  Is there anyone else like that??? good to see everyone finishing up on radiation too.  We're all in the home stretch!",
      "MessageIndex": 560,
      "PostDate": "30/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 8, 2009 02:27PM brookside wrote: Oh my gosh! I'm developing a red boob of courage.  I looked down today and my little scarred friend is now pink.  I've just completed my 7th visit and I do moisturize 4 times daily.  My treatment (originally 28) has been condensed to 23 treatments...I get the same amount of rads but in a shorter time frame.  I also just got my bill for sims and my first treatment.  I just don't know what to do as the sims was 15000 and ONE treatment alone costs 2,000.  No insurance.  They are saving my life to kill me in another way...what really is the point.  I do not qualify for medicaid and I cannot afford insurance.  I just don't know what to do.  I keep on hearing from my friends that being indebt and cancer free (i hope) is better than the alternative.  I'm not quite sure.  I wouldn't have any bills in heaven.  Why is this such a struggle....I'm ready to give up. (I was okay until I got that bill today).......sorry.",
      "MessageIndex": 167,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 22, 2009 04:14PM brookside wrote: Hi all thank you MTG for the apple cider protocol.  i did ask my doctor about that and he said the pH may be too acidic but I did it any way, after I wiped off the other stuff and that is sooo cooling and the itch does subside.  Phew.  I only have 6 more days!  I hired a dog walker today so my poor bears could get some exercise because they started to look mopey.  They were so happy after their walk.  I can hardly wait to resume that activity with them because it is such a rejuvenating thing to do but right now, it is good to just rest that little bit when they are gone and I don't feel like I'm ignoring them.  They have been so good to me during this time. ",
      "MessageIndex": 277,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Nov 2, 2009 03:03PM brookside wrote: Dear MTG You know, I think you're right.  When I bathe, there is just this big slick spot that just never goes away on my chest.  I'll try your suggestion.  I did follow someone else's suggestion of after a shower, just patting it dry and just letting it breathe with nothing on it at all (lying in bed au naturalle).  It was chilly but it worked too.  A light application of aloe after that does help but only temporarily....I wonder how long I'll have this redness to contend with.  Anybody out there??",
      "MessageIndex": 380,
      "PostDate": "02/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Nov 8, 2009 04:02PM brookside wrote: congratulations to little red and sakura!!!! All the rest of you, just hang in there and your day will come too. I have been battling the swine flu all this week.  Then on Friday, I thought I felt okay to take a drive and drove to my home town to put flowers on the graves of my mom, dad and brother to thank them for watching over me and it was a beautiful day.  I got there late at night, got a hotel room and spent the night hacking and coughing up a lung.  Didn't sleep the whole night.  So I got up at 5, drove around town until the sun came up, put the flowers on the graves and was home by 3 (this was a 7 hour drive both ways).  I took a bath because when I cough I pee (TMI -- too old) so I smelled like a nursing home. I went to bed and again I have a fever.  Almost went to the hospital but got OJ and overloaded on vitamins and tylenol.  Today I have no fever but am as weak as a kitten.  I am afraid that I may actually have that fatigue they talk about and if it is, you guys watch out.  It is a killer.  I walk around the house for 10 minutes and have to sleep for 2 hours.  I am okay just being still but any activity like brushing my hair or brushing my teeth or getting my dogs water is a burden.  Does anyone else out there have any fatigue like this???? Besides this, I thought my boob would be better by now because I moisturize it to death during all this too.  It is hotter than ever and weeps!  I bet I could iron a shirt or fry an egg on it, it is that hot.  I did see the onc surgeon on Thursday during all this and all she said was, boy it that ever red.  That probably cost me $300.  Oh well, I'm still alive for now.  Let me know how you are battling your fatigue.  I HAVE to work.  I just don't know if the fatigue is from the swine flu or radiation.  I am so lucky. ",
      "MessageIndex": 428,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 5, 2009 11:00AM brookside wrote: kt57, where in wisconsin do you live?  I live in Wisconsin Rapids and went to the Marshfield Clinic for one surgery.  Did you go there too??",
      "MessageIndex": 126,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 15, 2009 02:26PM brookside wrote: Hi I'm half way done with radiation!  I have only 11 more to go!!!!!!!!!!  Yippee.  My red boob of courage is holding up well with the new radiation cream radiaplex from the doc...better than miaderm as it helps alot with controlling the little rash and itching!!! What am I ever going to do after I'm done?  They said once you do something daily for a month, it becomes ingrained and a habit.  I guess I'll just have to go to the radiation place, eat a cookie and lie on their floor with my hands over my head for a half hour.  I'll miss it!  (no, not really!!!!)  I look so forward to going down to my hometown in Iowa and sitting by my mom and dad's grave and talking to them about this and telling them I'm okay. I'm leaving for there right after my last radiation.  My dogs will be in the car and off we'll go.  And after that, even though I owe a zillion dollars to the medical world, I'm going to live a well lived life...no more sitting around waiting for something good to happen.  I'm going to live!!! Ta ta for now.",
      "MessageIndex": 231,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 28, 2009 04:17PM brookside wrote: Dear Liz What type of animal did you hit?  Did you mess up your car too???",
      "MessageIndex": 318,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 29, 2009 06:26PM brookside wrote: I have less than 18 hours and I will be DONE with my last radiation!  Woohoo!",
      "MessageIndex": 331,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Nov 2, 2009 09:43AM brookside wrote: Hi sopris I used that Radiaplex and I do believe I was allergic to it...not sure though.  My sternal area is all red and really itchy..so much so that I can't sleep at night well.  The rest of the area is just red.  I am now using pure aloe vera and that does help a little better I believe.  I FINISHED friday and I was hoping I would feel better just KNOWing that, but I now have the flu.  I FEEL worse than I did getting radiation.  Does anyone know if I should be worried about the flu and just getting over radiation???",
      "MessageIndex": 377,
      "PostDate": "02/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Nov 3, 2009 12:08AM brookside wrote: Dear DSgirl I just read some postings and saw you went to a chiropractor.  That is GREAT and I'm glad he/she helped you.  I am a chiropractor and I love it.  We don't end up killing our patients like the medical profession does and we actually help AND it doesn't cost a zillion of dollars!.  Keep up the good work and stick in there.  The best thing to remember is to do your stretches and follow his protocol.  Wish I would have seen the cake pic!  Well must be off to bed and fight this swine flu!  The irony of this is that cancer didn't get me but something from a pig is killing me right now!  AND I'm originally from Iowa and I used to LOVE the little bastards and now look.",
      "MessageIndex": 385,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Sep 30, 2009 11:43AM brookside wrote: Hi guys i would like to join you all cuz I am a true October girl. I will start today and end Oct 30.  I am so tired to this little detour of my life.  It started in May that I went to the doctor to have a checkup because I had a stomach ache and he took a CT which lead to a chest CT and bone scan and i said while you'r at it, do a mammogram cuz I had not had one in 9 years.  He objected to that but I insisted and out of my stomach ache, I found out I had breast cancer in an early stage.  Thank god for the stomach ache.  I had a lumpectomy, was told i was a candidate for the 5 day/twice daily radiation and when i started to ask about the price (I don't have insurance), they then told me I needed a mastectomy.  I went to see about a mastectomy at another facility and was told I needed a reexcision which I did and it was successful.  So that was JULY.  I waited all of august and September to see the radiation guy again and I had to call them to insist that I start getting radiation.  So I start today.  I'll do it every day at 11:00 and then I can go home and rest until 1:30 and go back to work again.  The facility is right across the street from my office and that is great, it takes me 5 minutes to get there.  That is great. I will be doing tomotherapy.  Is anyone else out there doing that?  I have my little Miaderm in my purse and I'm ready to go.  I think that October 31, I'm going to go out and get drunk.  Hopefully the worst will be over and all I'll have left are the scars and the bills. Here's to a great October radiation bunch with no sunburns and no bad side effects! Becky, the crazy Newfoundland dog girl",
      "MessageIndex": 83,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 2, 2009 12:06PM brookside wrote: I KNOW ... I can see Europeans being thin but I've seen ALOT of Canadians, and, no offense, but they are built to last...my sister being one of them. ",
      "MessageIndex": 102,
      "PostDate": "02/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 7, 2009 09:48AM brookside wrote: Dear linn 56 don't worry.  It isn't bad at all.  You'll do just fine. just drink alot of water, have a glass of wine at night and moisturize your boob alot and before you know it, it's all done. I have a question, since I am doing tomotherapy, which I guess is different from everyone elses radiation, what is yours like?  I go into this donut, it sounds like its from outer space and lie there for 10 minutes to get the ct, then after that I get the tomotherapy which sounds really out space like and cool but weird.  It goes from my right to the left with a sterophonic ching-ching-ching-ching sound.  That lasts for 9 minutes.  Are these the sounds that you get too?  Do you also get lined up with lasers all over the place?  This tomotherapy is a radical approach but I wonder how much different or similar it is. Also, I've got 6 under my belt and so far so good.  Little tired but I ws tired before.  thanks, becky",
      "MessageIndex": 157,
      "PostDate": "07/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 12, 2009 10:29AM brookside wrote: Hi I too have started to get a tiny little rash on the upper medial portion of my radiation area.  It started Saturday and I thought I must have had a little mosquito bit but then i checked it out and it's about a quarter sized area.  i moisturize religiously and that actually burns (miaderm) so I am almost curious if that isn't the cause.  I really appreciate MTG's suggestion regarding vinegar/water to sooth the area...I'll try that, sounds old fashioned and those generally work great.  i cannot find aloe vera...I looked at Walgreens and they have stuff with other ingredients so I will not use that but keep my search. Where did you all find pure aloe vera? I have completed 9/23 visits so far and so i am one third done.  Yippee!  lucky elimar,  done!  Kudos to her.   I also figured out that this thing isn't going to get me down and since it is supposed to help me live, I went out and bought some clothes over the weekend and that made me feel so much better.  I'll pay those people monthly but I will not sacrifice my life to pay them off expeditiously.  I'm going to live and express my life joyously and I'll pay what I can monthly for my bill medical bills.  Nuff said!  Have a GREAT COLUMBUS DAY!  No mail so no bills today!  Double yippee!   ",
      "MessageIndex": 200,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 12, 2009 04:03PM brookside wrote: debnyc - I had my lumpectomy in July and then i didn't do a sims until August 30 and it took them until September 28 before they started radiation.  I also had to call my other doctor to get them to even start it then.  I was told that my radiation was just for prevention and that there were more pressing radiations there were ahead of me.  I don't mind that but I just wanted it over and done with.  From your dx, perhaps yours is also more of a preventative type and therefore they see no rush.  that said, start pushing them and have another Md involved in your care to also call and push.  good luck.  You just want it done so you can just get this behind you. Take care kiddo.",
      "MessageIndex": 207,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 21, 2009 10:09AM brookside wrote: Hi Tara I am working through radiation and I have a stressful and kind of strenuous job (I'm a chiropractor) and it isn't as easy as you think! :)  I was scheduled for only 23 radiation treatments and only have 7 more to go after today!! Yippee!  Also, the radation I am getting is a concentrated radiation than is normally given in 28 treatments.  My poor little scarred friend is really itchy though and my poor little nipple looks like it took a job as a cowboy as it is kind of rough and calloused-like .. really weird but not itchy.  You will do just fine.  That said, I can hardly WAIT until October 30....I'll be done!!! (with radiation at least and then on to tamoxifen!...i can hardly wait). Becky",
      "MessageIndex": 267,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 21, 2009 03:38PM brookside wrote: for two days now, i have been weak as a kitten.  i work but I just dragged myself through the day...also my tummy is hurting.  i don't have a fever or a headache but I feel like a bull dozer has driven over me and the road rash on my boob is so darned itchy...even with lotion and apple cider vinegar soaks.  Does anyone else have a crummy tummy and general malaise...only seven more to go.....I'm pooping out......",
      "MessageIndex": 270,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Oct 26, 2009 11:02AM brookside wrote: Another thing that can be used to help increase energy is the amino acid l-tyrosine.  It is supressed during times of stress.  It helps the thyroid function properly (as does iodine) and it helps provide additional energy and suppresses hunger ideations so I know some people even losing weight without even trying and their thyroid levels improve.  Try that one.  I am going to give it a try myself.  I really need the energy and losing weight would be a plus.",
      "MessageIndex": 297,
      "PostDate": "26/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "brookside",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85673/profile",
      "Content": "Nov 8, 2009 07:32PM brookside wrote: Hi MTG Thanks for that reminder.  I did do that initially when you told me about it but then the MD said don't do it and I forgot....but now I'm FREEE to do as I wish with my red hot boob.  So vinegar here I come again. Sukara - I have ordered L-Tyrosine and that is a thyroid supplement and am hoping that will help.  Thanks for reminding me because I ordered that a bit again and it should be in.  I'll check tomorrow. Thanks MTG - I am just chopping at the bit do soak my boob so herrreee I goooo!!!",
      "MessageIndex": 432,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    }
  ]
}