{
  "AuthorID": "BrooksideVT…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
  "Posts": [
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jun 4, 2013 05:06PM BrooksideVT wrote: My breast looks just fine after a pretty good sized lumpectomy; breast surgeons can have amazing cosmetic skills.  If your result leaves something to be desired, your insurance should cover cosmetic repair. Meanwhile, as you have a little time before surgery, there is no harm is asking about an MRI or chasing down a second opinion. ",
      "MessageIndex": 3,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805699",
      "Title": "Surgeon wants to remove it... Freaking Out- Have Questions nlmlillysmom chef127"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 25, 2015 03:08PM BrooksideVT wrote: Daisy, don't hesitate to call your onc with questions about the accuracy of the aftervisit summary he posted--He'll be referring to this in future, and it might as well be accurate. Yes, I obsessively read my reports over and over and over. Love, absolutely love that this information is available.",
      "MessageIndex": 9,
      "PostDate": "25/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830758",
      "Title": "Visit diagnosis wording has me worried! daisylor daisylor"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 25, 2015 02:55PM BrooksideVT wrote: Daisy, I'm at Dartmouth too. I find my docs do sometimes post their visit notes right away. The radiologist report and any blood tests do always seem to take their normal three (I think) days after their official reports have been submitted. in other words, yes, at DHMC it is normal for your MD's notes to appear several days before the mammogram report (which, I believe, is normally read the day after the imaging).",
      "MessageIndex": 6,
      "PostDate": "25/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/830758",
      "Title": "Visit diagnosis wording has me worried! daisylor daisylor"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Dec 17, 2018 01:29PM BrooksideVT wrote: Like you, I was not committed to rads. After a week or so, I indicated to my R/O that I was thinking of abandoning treatment. She was very clear in telling me that if I stopped, neither were any remaining cancer cells in my breast taken care of , nor, should I have a local recurrence, could I ever have rads in that area again. They do not schedule partial treatment. Please have a nice long conversation with your RO. It might be that a break of a couple of days could lessen your side effects. It is definitely not normal for you to have burns this early in your treatment, and, I think, somewhat unusual for actual burns to occur even in the last days of treatment. If this is happening (not just something you fear) you absolutely need to bring this matter to your RO's attention. Your R/O should have already told you whether there is any risk of damage to your heart or lungs. Please also grill him or her on this matter. I am so sorry your family member needs your care, but do remember that you will be in the best position to take care of this person, or anyone else, if you first take care of yourself.",
      "MessageIndex": 5,
      "PostDate": "17/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868867",
      "Title": "Stopping radiation treatment midstream. Cindy-smith nat_blue"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 4, 2015 04:15AM BrooksideVT wrote: Anna, do keep in mind that anyone can post anything on those sites, and that if the doc you are researching is a plastic surgeon (couldn't quite figure out whether you were writing about a breast surgeon or a plastics guy), lots of women have unrealistic expectations. Also, those who have amazing results rarely post. To really determine his qualifications, check where he did his training and also at which hospital/s he has privileges now, and how long he has been there. Hospitals have regular meetings where they look at the poor outcomes and examine how to prevent them in the future. Bad docs don't get to hang around long. Blue Cross/Blue Shield also has to have high standards. If you are still uncomfortable when you meet with him, feel free to bring along the \"ratings\" when you see him and ask away. He will not be able to address specific cases, of course, but he can address his personal overall results. Once you have met with him, chances are your confidence level will soar.",
      "MessageIndex": 6,
      "PostDate": "04/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/833136",
      "Title": "I need help fighting my insurance! anna42 Moderators"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 4, 2015 08:40AM BrooksideVT wrote: I'll add that I would totally panic if I felt forced to use a doctor I didn't trust, and that it is absolutely appropriate for you to be frightened, enraged, and any other way you might be feeling. I would think your insurer would be required to have more than one option up their sleeve--what if their one-and-only goes on vacation? Someone must cover his patients. Who is that, and why can't you use him or her?",
      "MessageIndex": 9,
      "PostDate": "04/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/833136",
      "Title": "I need help fighting my insurance! anna42 Moderators"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Mar 19, 2015 03:29AM BrooksideVT wrote: Unlike MombieZombie, i slathered emu oil on my breast after my morning shower, but at least three hours before my rads appointment. I wore a soft, soft, super absorbent men's cotton Tshirt next to my skin, under everything, day and night. I felt it protected my skin from anything that might irritate it, and also protected my clothing from both the oils and creams, and even from the black sharpie marks the techs used to highlight my tats (the better to be certain the machine and I were properly lined up for zapping). The Tshirt was always inside out because the seams irritated my sentinel node incision. After rads, I used the cream the RO gave me; when I got home, it was more emu oil, then more again at night. My very pale, very tender skin did just fine. I asked everybody (nurse, RO, tech, head tech) everything! And I asked over and over and over.",
      "MessageIndex": 4,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/829672",
      "Title": "Starting Radiation next Monday merdeka10 merdeka10"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 14, 2016 06:15AM BrooksideVT wrote: The biopsy can be trusted. It will not only confirm cancer, but will determine the specific type of breast cancer, which determines the specific treatments that will be helpful. All cancers are not alike. Some types of cancer (prostate, ovarian, etc.) produce reliable cancer markers. Breast cancer does not. Your nutritional practitioner, by suggesting that cancer markers would have validity in a stage 2 breast cancer, has demonstrated insufficient knowledge of breast cancer. I'd be careful. Please ask for specific cases in which she has treated the exact same type of breast cancer that your wife has: How many? What were the outcomes? What is her training? Is she licensed? These are exactly the same questions you would, and hopefully will, ask a traditional provider. Please do not think that I'm flatly anti-alternative; I am not. I just am concerned that your provider would suggest an inappropriate and unreliable diagnostic tool to call into question a clinically proven biopsy.       ",
      "MessageIndex": 2,
      "PostDate": "14/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/840023",
      "Title": "Biopsy confirmed cancer but nutrition medicine? Patch agness"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Mar 14, 2015 08:20AM BrooksideVT wrote: Well, do you normally wax? If not, I, who have never done so, probably would not choose this occasion to delve into waxing, as I'd be concerned about whether the hair would grow back all prickly around the sentinel node incision. I'm sure i shaved my armpits the morning of surgery, but maybe the morning or the night before would be preferable bacteria-wise?",
      "MessageIndex": 4,
      "PostDate": "14/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/829489",
      "Title": "I've got a doozy question Cmo65 Kicks"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Nov 28, 2017 11:18AM BrooksideVT wrote: You might also consider an appointment with a breast surgeon. They are the experts in assessing breast changes, including totally benign changes.",
      "MessageIndex": 10,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860230",
      "Title": "Swollen nodes and breast changes johnson38 KBeee"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Mar 19, 2015 09:05AM BrooksideVT wrote: I definitely applied the oil 3-4 hours before rads, no later. Luckily, I'm a really early riser! The cotton Tshirt probably absorbed most of the oil; my skin got the rest.",
      "MessageIndex": 6,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/829672",
      "Title": "Starting Radiation next Monday merdeka10 merdeka10"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 15, 2014 08:41PM BrooksideVT wrote: With apologies for intruding on a Stage IV thread, I just want to point out that Dr. Bach is not an oncologist.  He is a pulmonologist and epidemiologist, and is head of Memorial Sloan Kettering’s Center for Health Policy and Outcomes.  Keeping in mind that the major task health policy groups are charged with is reducing health care costs (to me this translates into health care access), still, I was stunned when in the article EnglishMajor posted, he mentioned that some experts feel the number of lives saved by mammograms might approach zero. I've seen an old study that indicated no real benefit from mammograms, and wonder whether he is referring to this, or or other information?  His Sloan Kettering website lists several of his publications.  I immediately chose his wonderfully loving New York Magazine article about his wife's illness.  To me, it seemed he wrote from the point of view of an absolutely devoted husband, of course, but also as an epidemiologist and health policy administrator, holding small, but pointedly different, views from those of the oncologists who treat this disease.  That article raised my consciousness about the overlapping circles of similar but separate disciplines that study and treat breast cancer.  ",
      "MessageIndex": 23,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823637",
      "Title": "Oncologist Takes on Amy Robach's Pink Warrior Rhetoric EnglishMajor Marple"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 14, 2016 08:08AM BrooksideVT wrote: Please let me clarify that while cancer markers are valid in some types of cancer, they still are not diagnostic, as multiple factors can lead to, for instance, a high PSA. Generally, some markers lead to diagnostic procedures (biopsy) and some are used to track progression after diagnosis. ",
      "MessageIndex": 4,
      "PostDate": "14/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/840023",
      "Title": "Biopsy confirmed cancer but nutrition medicine? Patch agness"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 30, 2016 05:51AM BrooksideVT wrote: Give them a call. A radiologist (or surgeon, if that's who did the biopsy) has to be on call. I think it's a hematoma, but the redness could be an infection.",
      "MessageIndex": 3,
      "PostDate": "30/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/840863",
      "Title": "Quick question about stereotactic biopsy afterwards Sarasmiles Sherri-lynn02"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 10, 2016 10:48AM BrooksideVT wrote: I don't think the RO will be impressed with your oncotype (sorry!). 1. The RO is concerned only with local recurrence and it is his or her job to evaluate and treat your breast and only your breast. Hopefully he or she has already shared the studies with you that show the large difference in recurrence (both local and distant) between those who received rads and those who did not? If not, do ask for this information so you can make an educated decision. 2. The oncotype is a predictor of distant recurrence. In other words, it addresses your risk of mets to your bones, lungs, liver, and brain, plus the occasional other site (not the RO's territory at this time, although rads can later be used to treat mets). Your oncotype score assumes that you have had either a mastectomy or a lumpectomy plus rads, and assumes moreover that you will take tamoxifen for five years. If you do not have radiation, or do not take tamoxifen (or an AI), its predictive value is questionable at best. Here's one article that might be somewhat helpful, although it is valid only for pure DCIS; IDC would probably increase the risk. http://www.breastcancer.org/research-news/20131004 I realize you are very interested in having only part of your breast receive radiation. Or parts? I think you might have mentioned more than one site? Rather than exploring invasive (ouchy) techniques, perhaps you could ask your RO about directing the beam only to those specific areas? I think you'd actually have less chance of scatter, and less chance of skin issues/discomfort with a more traditional approach.  ",
      "MessageIndex": 2,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/839760",
      "Title": "Partial Breasst Radiation dazedandconfused123 dazedandconfused123"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Feb 14, 2016 05:32AM BrooksideVT wrote: Definitely see a lymphedema therapist (specialized physical therapist) now. Most likely it is not lymphedema, but the therapist will be able to assess your swelling, show you how to encourage healthy lymph drainage, and give you guidance on safe and effective exercise. If she believes it is indeed a bit of lymphedema, you will be better off for having addressed it sooner. Your surgeon or your RO can give you a referral. In my case, my hospital offered an exercise class for breast cancer patients. The class was led by two lymphedema therapists, so I just made an appointment with one of them. I believe I saw her three times in all. I had cording and terror (second diagnosis my own) and am eternally grateful for her expertise. It was her goal, by the way, for every surgeon to refer every patient to her for an early assessment. She did mention that my surgeon was the least compliant in this area. He did know I had slightly reduced range of motion (cording) but felt it would resolve on its own. Perhaps it would have, but the emotional support from the lymphedema therapist's knowledge base, and her assurance of what constitute safe exercise, were a significant benefit",
      "MessageIndex": 5,
      "PostDate": "14/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/841273",
      "Title": "How long does post radiation swelling/lumpiness last? Ltam16 ChiSandy"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Oct 9, 2014 09:16PM BrooksideVT wrote: I told my three children and their wives within a few days of diagnosis, but only because I felt obligated to do so.   Frankly, I'd have much preferred to have gone into a virtual cave and licked my wounds for a year or so.   I told my best friend a week or two after my children, and within a few months another friend or two.  Eventually, I told my manager (female, but young, young, young), but none of my coworkers (all men).  I know I didn't need to tell the manager, but strangely wanted to \"practice\" voicing what I was viewing as secret.  BAsically, I guess I followed a need to know policy.  Two years later,  I've told a few more people, when it seemed a normal, natural part of the conversation, not a personal revelation.  At first I was too traumatized to share the information, so I consciously withhold (yes, hid) my dx.  I'm now well past treatment, hopefully forever, and the subject is no longer the first thing I think of when I consider myself.  Does that make sense?  Finally, I am comfortable sharing the information, but, thankfully, it is not at the forefront of my consciousness, so it just does not come up, any more than, say, my 1990 gallbladder surgery.  I think it was my woundedness, as well as the treatment thing (in my case, lumpectomy and radiation) that held my tongue.  I was not at all interested in receiving those looks, those questions, because I was simply not equipped to deal with them.  Instead, I shared right here on these threads, nicely anonymously, and also at a breast cancer-specific exercise class at my treatment center.  We're all different.  Some people (mostly those extroverts, I'm sure) are strengthened by the support of many.  I'm not one of them and, two years after diagnosis, I'm really glad my health is not a conversation starter everywhere I go.",
      "MessageIndex": 14,
      "PostDate": "09/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/825195",
      "Title": "When diagnosed- did you share with family & friends? MamaM whatnow"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Dec 17, 2015 06:44AM BrooksideVT wrote: What they're really saying is that you should be wearing a bra, any comfortable bra, because they will give you a nifty little soothing ice pack to stuff inside it. If your underwire pinches, you can ask for a second ice pack to stuff wherever needed. They do numb the area, so you should have no problem wrestling an over-the-head bra on or off. My procedure was pretty much a team effort with the ultrasound tech providing the picture show while the radiologist took the samples. All three of us could see the screen. Afterwards he told me that while of course we needed to wait for pathology, he was pretty sure \"we\" were dealing with cancer. He asked if I would like him to telephone me with results, or if I would like an in-person meeting (wih him, my pcp, or whomever). He thought results might be available the next day, but that two days would be more normal. They also implant a tiny marker to help locate the area biopsied, so you follow with a mammogram to check its location. Because all they need to do is check the metal marker, the mammo is very, very gentle. ",
      "MessageIndex": 2,
      "PostDate": "17/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838654",
      "Title": "Spiculated, Hypoechoic, Solid Mass............oh, my! HopingThisIsNotStrikeTwo Strongnserene"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jun 10, 2016 04:27AM BrooksideVT wrote: Rosie, the dots and swelling are most likely perfectly normal, but do not hesitate to schedule an appointment with your RO, or even his nurse. Most likely you will see him in a couple of weeks, but, if there are concerns, considering all that you/we have been through, it is always better to put one worry to rest. Also, please do keep an eye on that swelling. If it seems to be increasing, please see a lymphedema therapist (PT with special training and certification), who will show you how to move fluid out of the area.",
      "MessageIndex": 6,
      "PostDate": "10/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/845022",
      "Title": "A month after radiation question please advise rosierosie BrooksideVT"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jun 7, 2018 10:56AM BrooksideVT wrote: See a plastic surgeon who specializes in breast reconstruction.  S/he will be able to explain your options .   There is no doctor of any kind in my town.  The nearest breast surgeon is an hour away, but last I checked, there is no on-site plastic surgeon there.  I travelled two hours to a teaching hospital for all my breast cancer treatments.   I had two lumpectomies in a smallish breast and, when I'm standing in front of a mirror, all you can tell is that the operated-on breast is slightly perkier than the other.",
      "MessageIndex": 11,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865074",
      "Title": "You Mean You’re Not Going to Fix It?!?! Lorih555 Micahmom"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 12, 2014 05:09AM BrooksideVT wrote: I was so grateful to start boosts.  My area of sensitivity was my nipple and areola, and the boosts spared that area, which could then begin healing.  As long as you are having skin issues and concerns, please ask to see the nurse or doc every single visit.  Truly, they are used to this, and expect it, and you will find they consider your symptoms firmly in the expected range.  Also, do keep in mind that the techs are also aware of the normal range of skin reactions and will be quick to call in a doc should the see anything out of the ordinary.  In my case, the out of the ordinary issue was my absolute terror of everything.  An hour-long meeting with the head tech did wonders for my understanding of risk/reward and for my comfort with the treatment.",
      "MessageIndex": 9,
      "PostDate": "12/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/822596",
      "Title": "Help someone I need to talk to someone, is this normal? shellbell1963 BrooksideVT"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Nov 13, 2014 01:56PM BrooksideVT wrote: I didn't know my scar had an issue until I saw a lymphedema therapist.  I had been bothered by cording, and saw her to find out if that was likely to lead to a problematic situation (not!).  She pointed out that my scar was getting pinned down and she stretched and lifted it. A lymphedema therapist, by the way, can also give you guidance on safe and effective stretches, and exercises, and so forth.",
      "MessageIndex": 1,
      "PostDate": "13/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/826245",
      "Title": "Scar massage--what should I be doing? CeciliaVera KJSUN"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Nov 10, 2014 11:41PM BrooksideVT wrote: I had two lumps, one found through my regular mammogram, and one that showed up only on an MRI.  Biopsies showed the first lump to be IDC, the second ALH.  It was recommended that I have two lumpectomies.  The reason was that the biopsy collects only the cells it happens to collect.  The area around the biopsied ALH could have been anything.  Turns out in my case, the lump was composed of ALH, ADH, sclerosing adenosis, papilloma, fibrocystic change, calcification, and maybe a couple of other things.  Everything was benign, but the key word here is \"everything.\"   Yes, it would have been perfectly fine to leave it right where it was, but I'm really glad all the \"everything\" is gone.",
      "MessageIndex": 6,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826147",
      "Title": "Anyone else feel they are being treated with extreme prevention? JaniceB2003 besa"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Nov 11, 2014 12:29PM BrooksideVT wrote: Yep.  You're normal.  One of the peculiar things about all this breast stuff is there are so many choices and so many gray areas, and there's so much to learn, most of which is staggingly new.  Your breast surgeon is the expert who can help you put your options into perspective.  Probably it will come down to whether you are the type of person who is comfortable with ongoing monitoring, or whether you want to get this thing the heck out of there so you can find out exactly what is behind door #1.  My double lumpectomy was no biggie, by the way, and my breast looks just fine.",
      "MessageIndex": 11,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826147",
      "Title": "Anyone else feel they are being treated with extreme prevention? JaniceB2003 besa"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Sep 30, 2015 09:18AM BrooksideVT wrote: Ughhhhh! Chances are there is very little additional informationspecific to you that anyone can give you until you have the results of the genetic testing and your surgical pathology, but that is no excuse for rudeness bordering on hostility. Not to worry about who your bs works with--all breast surgeons work with multiple oncologists, often in pretty far-flung geographical locations. Chances are your bs is very much aware that you are not the first person to opt out of treatment by this particular oncologist. Why don't you call the breast center where your Monday consult is set up and see if you can see an oncologist as well? Long term, you might prefer to work with someone closer to home, but often the docs at the top centers direct, or at least, discuss, care administered by local oncs. I don't know if you are angst-ing as I did about surgical options, but just in case, I'll mention that I remember being absolutely, and equally, torn between surgical options: Lumpectomy, mastectomy, double mastectomy (with DIEP reconstruction). I simply could not decide. Eventually I chose lumpectomy, just to get the darned thing out and find out exactly what we were dealing with. If I didn't like what I learned, insurance would have to cough up the one or two mastectomies. As it happened, I found I was very happy with the lumpectomy. ",
      "MessageIndex": 2,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/835387",
      "Title": "Terrible Experience with Oncologist Girl53 MsVeryDenseBreasts"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Nov 20, 2015 10:55AM BrooksideVT wrote: Kandy, if you switch to Medicare, you will absolutey need a Medigap policy in addition to Part D, or deductibles and copays (particularly for hospitalization and skilled nursing facilities) can really clobber you. I do not know why Medicare makes it so difficult to figure out what they do not pay, but this article kind of summarizes the issue: https://www.senior65.com/medicare/article/cant-aff.... I have medical insurance through work, and Medicare Parts A & B in addition. My medical coverage takes care of Rx's while Parts A & B take care of all my deductibles and so forth. Part A (hospitalization) is free; the small-ish cost of Part B is less than the benefit I receive.  ",
      "MessageIndex": 3,
      "PostDate": "20/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/836895",
      "Title": "Medicare Kandy Lynn1234"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Sep 24, 2013 06:05AM BrooksideVT wrote: Show up a little early today and ask to see the RO before treatment.  I had a similar problem (breast red and hot) after my first treatment, went into full panic mode.  I asked for the RO, they sent me to the nurse, who called in the RO.  In my case, it was apparently an issue of my skin reacting to a new irritant.  The RO gave me the next day off.  It happened to be a Friday, so I had a long weekend.  On Monday, all was well.  Although my skin was still red, it actually faded over the next couple of weeks, despite treatment, and it was at least two weeks before my (now perfectly normally reacting) skin was as red as it had been on day #1.  Thereafter, itching and redness were perfectly within normal range. And, yes, my skin is very, very pale.",
      "MessageIndex": 2,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/811535",
      "Title": "3 treatments & skin already acting up?!! KristinaA slv58"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 27, 2015 09:53AM - edited Jan 27, 2015 09:56AM by BrooksideVT What a pickle you're in! First, I'm not sure the person at Planned Parenthood was correct. Unless you have just gotten married, the open enrollment period at your husband's work will most likely have closed and he will not be able to add you for many months. Please call the Planned Parenthold national 800 number and ask to speak with a supervisor. The breast center at your local hospital probably has a patient services person who maybe can help you. You can also try the NYS Department of Health (www.health.ny.gov). The website lists resources by county. Most non-profit agencies receive special donations specifically restricted to helping those who need their services but just barely slip through the cracks. Not every employee is aware of every funding source, so do not hesitate to ask for a supervisor. If none of this (or any ideas others might have suggested) do not help, please try your State or Federal congressperson. I would not rush into a divorce without legal advice, ",
      "MessageIndex": 1,
      "PostDate": "27/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827931",
      "Title": "My husband won't put me on his insurance mombo4 bobogirl"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 23, 2013 12:02PM BrooksideVT wrote: I met first my MO, and then my RO, on the same day.  The very first thing the RO said was that while the MO had just talked to me about systemic risk and treatment; she would talk about using radiation to prevent local recurrence.  Just those few words clarified their very separate their roles, as well as my/our very different and very separate (local/regional/distant) risks.  A consult is just an opportunity to gather more information.  I know, you are already drowning in new information, but what the heck? ",
      "MessageIndex": 7,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803391",
      "Title": "Do I really need radiation? paknew PeggySull"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 25, 2014 03:12AM BrooksideVT wrote: WhiteTiger, your PCP is probably a great resource for navigating through the morass you're slogging through.  Your surgeon, as normal procedure, will have sent your records to her, so she will be aware of your surgery and the issues that have arisen. Chances are she is aware of a volunteer organization that provides rides to and from local hospitals; you cannot be the first patient to need transportation.  I don't see any harm in a psych consult. Considering that you're not thrilled with your primary doc, perhaps you will mesh better with the psychiatrist and, in future, renew your Rx's through him or her. ",
      "MessageIndex": 137,
      "PostDate": "25/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/821871",
      "Title": "New, scared, and sleepy WhiteTiger farmerlucy"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 25, 2014 04:09AM BrooksideVT wrote: Sorry.  PCP is primary care physician.  Nobody wants that kind of consult!  Lots of psychiatrists are lovely, warm, caring people who really enjoy working with people whose processing is a little out of the ordinary.  Probably there is someone in your area who particularly enjoys working with people with autism and/or PTSD.  I guess the trick is to chase down the correct referral.  Maybe your primary care?  Maybe the local hospital?  If you belong to a group or network, maybe others can refer you?  To tell the truth, in my humble opinion, a new cancer diagnosis is such a game changer, we probably all should have a pysch consult, just to reassure us that maybe our emotions and reactions are kind of out of whack, but that this is a normal-ish reaction to the trauma of the diagnosis and treatment.",
      "MessageIndex": 139,
      "PostDate": "25/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/821871",
      "Title": "New, scared, and sleepy WhiteTiger farmerlucy"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 11, 2013 10:04AM BrooksideVT wrote: Where is the pathologist sending the slides?  Chances are they're going to facilities with particular experience with these lesions.  If any of these locations are geographically acceptable, perhaps that might be where to start.",
      "MessageIndex": 6,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/803145",
      "Title": "Diagnosed with something rare... Where to go treatment? chercoco chercoco"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 9, 2016 09:10AM BrooksideVT wrote: Other than the general health of the patient, the main criteria seems to be how aggressive the individual cancer is. In general, it seems older women tend to have less aggressive tumors.",
      "MessageIndex": 3,
      "PostDate": "09/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/839734",
      "Title": "Age as it relates to chemo cubbieblue BrooksideVT"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 9, 2016 03:54PM BrooksideVT wrote: I don't know much about chemo, Cubbieblue, but I was told that studies showed early stage women aged about 70 (decidedly not 50) could possibly/probably skip rads.",
      "MessageIndex": 6,
      "PostDate": "09/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/839734",
      "Title": "Age as it relates to chemo cubbieblue BrooksideVT"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Nov 13, 2015 06:53PM BrooksideVT wrote: Etnasgirl, it is not an all or none decision. Even if your genetic test comes back positive, you can have a lumpectomy now, then take a little time planning your double mastectomy in the future. You can also have one or two mastectomies now, and delay reconstruction until a more convenient time. I know--having more choices does not make your ultimate choice easier, but it might give you time to really consider your options and plan around your son's sports seasons and activities. Do read the reconstruction threads here, and also the information on the main website, and quiz your docs as well--they have to give you the real story about recovery, limitation, risks. I think some kinds of reconstruction offer fairly easy recovery. I was one who was completely stressed out over all the options and spent a lot of time researching each and every possibility. Still, I was completely undecided as to which way to turn, ultimately deciding on a lumpectomy just to give the tumor the old heave-ho--I'd work out single/double/flat/DIEP later. With the tumor gone, and with good pathology, I felt I had time to explore my options. I was surprised at how happy I was with just the lumpectomy/radiation.  ",
      "MessageIndex": 4,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/836713",
      "Title": "My next step - Question! etnasgrl dtad"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 7, 2014 05:07AM BrooksideVT wrote: I was happy to find scar tissue developed and replaced most of the volume I'd lost from two lumpectomies in my B-C cup breast. .  I did see a lymphedema therapist, who \"mobilized\" the scar tissue so it did not stick (not her word) and distort my breast.  I guess I saw her once or twice early on after my skin was healed, and again a couple of months later. I highly recommend you (and anyone [all of us] concerned about post-surgical appearance), try this.",
      "MessageIndex": 8,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/819943",
      "Title": "Shrinkage - Please Respond percy4 percy4"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Nov 22, 2015 01:20AM BrooksideVT wrote: Sounds like you know exactly what you do and do not want, etnasgrl. Even better, you know your options for repair if you are not happy with how your breast looks after surgery. As to that, nearly everyone who posts here about post-lumpectomy appearance says the same thing--a thin, fading line of a scar marking the incision site, and that's it. Your surgeon can tell you what to expect, but he really won't just scoop out that golfball, leaving a hole-in-one. I know I posted this somewhere else today (maybe even here?), but I had two golfball-sized tumors removed from my less-than-C-cup breast and, except for that very thin line, you cannot tell at all.",
      "MessageIndex": 6,
      "PostDate": "22/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/836923",
      "Title": "Now I'm REALLY confused! Help please?! etnasgrl etnasgrl"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Nov 21, 2015 08:29PM BrooksideVT wrote: I think the issue for most of those of us who responded on your other thread was that you indicated the ps would do only a very minor reduction on your other breast, in hopes of matching the post-rads size of your post-lumpectomy breast. You did not indicate any wish for reduction, or, for that matter, for any plastic improvement. If what you would like is smaller, higher breasts, then go right ahead. This is indeed the time for that. If, however, your concern is simply to give your cancer the old heave-ho, then, unless your surgeon indicates a need for plastic repair of the procedure he or she is considers appropriate, your risk of complications and your normal recovery will both be affected. What is your goal?",
      "MessageIndex": 2,
      "PostDate": "21/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/836923",
      "Title": "Now I'm REALLY confused! Help please?! etnasgrl etnasgrl"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 13, 2013 10:56AM BrooksideVT wrote: Yes!  They do document their work with before and after photos and want you to see them so you will have a realistic idea of what to expect.",
      "MessageIndex": 1,
      "PostDate": "13/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/803250",
      "Title": "Pictures of surgeon's results? CassDugan dltnhm"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "May 16, 2015 08:33AM BrooksideVT wrote: A red ring can sometimes be a sign of Lyme disease. Did your doc test for that? (Or maybe you do not live in an area where there are ticks?)",
      "MessageIndex": 3,
      "PostDate": "16/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/831517",
      "Title": "Woke up with very sore left breast. b3ck BrooksideVT"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 21, 2018 04:31AM - edited Aug 21, 2018 04:36AM by BrooksideVT As it happens, I'm having that very same test in a few weeks .  I did ask and learned that the test is valid for both legs with the blood pressure cuff on one arm only, so no worries there.  I suspect that if there is one spot on our legs where the risk of irritating a tendency toward lymphedema is next to nil, it would be the ankle.   I'm guessing that, like me, you want to find out what the heck is causing your symptoms and maybe fix them?  Or figure out how to keep them from getting worse?  For immediate stress reduction, I suggest a couple of phone calls.  First, please ask your onc about the risks that concern you.  He knows you and your history and can really put your concerns in proper perspective.  Your vascular person (or whomever ordered the blinking test) can also discuss risks and rewards and give you a full explanation of how the test is expected to help and whether there is another option for accurate diagnosis.  Once he or she walks you through the test (yes, I'd insist that s/he do this), I think you'll be a lot happier. Oh, yes--It will also be a good thing when the ordering doc lets the test techs know they'll be using only one arm.  I was told they do this all the time, but it's always better (i.e. quicker) when they don't have to check with the doc before changing their setup.   ",
      "MessageIndex": 4,
      "PostDate": "21/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/866717",
      "Title": "Question about lymphedema in legs wrenn BrooksideVT"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 6, 2014 05:22PM BrooksideVT wrote: Franny,  I am very happy with the result of my two lumpectomies in the same breast.  The IDC was 1.1 cm in the upper right quadrant, not far from my nipple.  All margins were 9mm or greater.  Another lesion at about 6:00 was all benign: ADH, ALH, sclerosing adenosis, papilloma, and a couple of other things.  I think it was over 2 cm, but cannot find the numbers just now.  Again, all margins were 9mm or greater.  I am only somewhere between a B and a C cup, but my breast looks absolutely fine from the front.  From the side, the underneath looks a bit flattened, but the top looks fine.   Had it been only the one IDC lumpectomy, I don't think anyone could notice anything except a now faded line with a very slight indentation.  I was very happy, by the way, to find that scar tissue replaced some of the lost tissue, but did make a couple of appointments with a lymphedema therapist, who showed my how to keep scar tissue free and maleable.  To tell the truth, I had expected large divots and followup plastic surgery to repair an unsightly result, but I'm quite content with the new \"me.\"  Of course, everybody's different, and you might be less happy with your result, so please do be certain to meet with a plastic surgeon (as I did) before your surgery, so s/he can address your questions about  radiation and reconstruction.",
      "MessageIndex": 16,
      "PostDate": "06/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815593",
      "Title": "Thought I'd be one of the 80% FrannyM424 sweetjam"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jun 8, 2013 11:44AM BrooksideVT wrote: And probably the reason you're feeling sore is that, like all of us,  you've been poking and prodding.  Probably best to lay off within the next couple of days just so you won't be all sore and inflamed when you go in for the biopsy.",
      "MessageIndex": 4,
      "PostDate": "08/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805844",
      "Title": "I feel like I need a plan nlmlillysmom BrooksideVT"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jun 29, 2017 08:19AM BrooksideVT wrote: Your surgeon, your medical oncologist, your radiation oncologist, and your plastic surgeon (if you're considering mastectomy) will all have lots of statistics for you and can help you figure out exactly where your risks lie. Your hospital may be able to assign you a nurse or social worker whose job it is to help you navigate all the options, and maybe even go doctor appointments with you. From my point of view, I could not decide whether to choose lumpectomy, mastectomy, or double mastectomy, with reconstruction. Eventually, I decided to go with lumpectomy plus sentinel node, in my mind, a second, more complete biopsy. When all the results were in, I could then decide. My results were good and I chose radiation. I was truly surprised to find how happy I was to have kept my breast, and also how happy I was that I'd avoided the various risks and problematic outcomes associated with mastectomy and reconstruction. Read, read, read the threads on this site. Do keep in mind, however, that people unhappy with their treatment decisions, or who have had side effects, are far more likely to post than those who are happy. Some threads might give you the impression that particular problems are far more likely than they really are. Your doctors can give you real statistics, helping you to put into perspective all you might read or hear about, whether here or elsewhere.",
      "MessageIndex": 4,
      "PostDate": "29/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/856496",
      "Title": "I am alone trying to decide between radiation or mastectomy pattiebfromblo shaneswife828"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 20, 2015 02:43PM BrooksideVT wrote: Both imaging techniques are different and regularly produce slightly different measurements. Three mm is a very tiny variation. The only truely true measurement is the one the pathologist makes after the mass is removed. That said, your tumor is very small and that is always good news. Do you have any other diagnostic info?",
      "MessageIndex": 2,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/834421",
      "Title": "Mass Measurement- HELP 98765 JellyShoes"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 20, 2015 03:19PM BrooksideVT wrote: 1.2 cm is less than half an inch. It is tiny. My radiologist told me that tumors smaller than one centimeter are often not detectable through mammogram. ER+ and HER- is a very good sign. You can add that info to your profile and it will help others to help you. The mammogram image fits the size of the screen on which the radiologist views it. I asked to see my images and found the viewing room (whatever they actually call it) had several chairs, each facing a large screen, perhaps three feet in its largest dimension. The software allows the radiologist to magnify areas of concern to study them more closely; the measurement software adjusts accordingly. In addition, they can split the screen to simultaneously view different views (at least 8, maybe 16), including comparisons between current and past images. I suppose they can view an ultrasound in similar fashion. By the way, because of patient confidentiality, all the other radiologists had to clear the room and clear their screens to allow me to enter, so my visit was short. Do spend some time on the info part of www.breastcancer.org; there are oodles of dropdown menus that hold almost every bit of info you might want right now. Also, if your breast center has a nurse or social worker whose job it is to guide you through treatment, please do not hesitate to ask her everything. Once you meet with your surgeon (probably your next step), you will have a much better idea of that same everything.",
      "MessageIndex": 5,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/834421",
      "Title": "Mass Measurement- HELP 98765 JellyShoes"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 14, 2015 07:59AM BrooksideVT wrote: Did the dentist say anything about your gums? Often gum issues is the culprit behind dental bone loss. ",
      "MessageIndex": 1,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834241",
      "Title": "Teeth nanahagg rdeesides"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Sep 6, 2018 06:01PM BrooksideVT wrote: If the tech could not find your lump, normally, the radiologist would have come in and personally continued the ultrasound. If i understand your post correctly, this did not take place. The next diagnostic step would be a visit with a breast surgeon. This is the doc best qualified to assess a lump and recommend further imaging. Alternatively, your gyn might send you for an MRI. Whatever the next step, it is important that there be one.",
      "MessageIndex": 3,
      "PostDate": "06/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/867046",
      "Title": "Found lump/doc found lump US shows nothing Vance326 ksusan"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Mar 24, 2018 09:26AM BrooksideVT wrote: I couldn't decide either, and I just wanted the thing out, and out immediately if not sooner, so I chose lumpectomy, secretly considering it an excisional biopsy.  If I didn't like the pathology I could then have a mastectomy and a little extra time to deal with the flat/double flat and the prosthesis/implant/transferred tummy fat issues.  As it happened, the lumpectomy was the correct choice.  It wasn't until quite a while after surgery that I realized I was happy to still have my breast/s (I'd always considered them sort of disposable).  It was quite a while after that that I realized how happy I was to have avoided all the additional risks, discomforts, and issues pertinent to mastectomy with or without reconstruction.  It is my understanding that health insurance has to pay for a mastectomy after a lumpectomy if that's what we choose.  Please do not take my word for this, but check with your insurance company. And yes, the belly issue is a concern.  I have a hard enough time camouflaging my tummy now, and I don't have big boobs.  The one woman I know who chooses to go flat makes sure everyone knows that she is a survivor. ",
      "MessageIndex": 5,
      "PostDate": "24/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/863481",
      "Title": "Happy Satisfied Endings?!?!?!? Iamladyt SajeScents"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Feb 16, 2016 11:36AM BrooksideVT wrote: The specialist he referred you to most likely a breast surgeon. S/he is the expert who will evaluate your lump and make recommendations for imaging, possibly a biopsy or just a re-check in six months. It is also possible that your doctor's recommendation is to a breast imaging center, but my sense is that your doctor wanted the breast surgeon's opinion before sending you for other tests.",
      "MessageIndex": 2,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/841325",
      "Title": "Found a lump in my right breast! KirstyT Logang"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Mar 3, 2016 12:59AM BrooksideVT wrote: Quite possibly your tendons are not happy with the arimidex. I had not only joint issues, but tendon difficulties as well while on arimidex: Recalcitrant tendonitis in hamstring and Achilles tendon, and trigger thumb as well.. PT helped (actually, below the shoulder it is OT), but switching to a different anti-hormonal really, really helped. Do speak with your onc about possibly trying another AI.",
      "MessageIndex": 3385,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "May 30, 2014 02:47AM BrooksideVT wrote: Hi, Lori.  I had two lumpectomies, one of which was IDC.  The other was ALH, ADH, papilloma, sclerosing adenosis, apocrine metaplasia, microcysts, and columnar cell change.  Maybe there was more \"stuff\" as well.  I couldn't develop any real interest on the part of any of my doctors in any of this gobbledygook, so kind of forgot about at least some of it until just now.  The IDC, however, retained and retains my interest, and that of the medical team, and is therefore the basis of my treatment and followup, so that's the basis of my posts.  Personally, I feel this other stuff raises my chances of another primary sometime in the future, but nobody but me (and, of course, you) seems interested.  I think there is a thread addressing the various benign findings. Like you, I had no family history of breast cancer, and, although I actually found the  lump, didn't suspect a thing.  Thank goodness for mammograms!",
      "MessageIndex": 7,
      "PostDate": "30/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/821480",
      "Title": "Am I a hot mess? loris66 vbishop"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 27, 2016 07:27PM BrooksideVT wrote: Probably your RO sees rads patients one, or maybe two, days per week. At my facility, at least two RO's were always available. Tomorrow morning, you might give your center a call and tell them your RO missed your appointment and that you insist that they give you a same day appointment (preferably before treatment) with either your RO or whomever is on call. There is absolutely no reason for you to wait for next week. if the receptionist cannot help you, please ask for your RO or her nurse. You might also ask about a schedule change. Apparently, your current schedule does not work for your RO. Radiation is stressful enough without your having to worry about whether you'll have time to ask all your questions. Next week, before your appointment, I'd ask the nurse to please be certain that an RO (yours or another) appears at the appointed time. When you see your RO, I'd also suggest a very frank inquiry as to whether she needs to see you at a different time. I'm looking at what I wrote and it does seem a bit, umm, assertive, but, really, you do need to get this straightened out now.",
      "MessageIndex": 2,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/840764",
      "Title": "Really annoyed with my RO! etnasgrl etnasgrl"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 13, 2014 06:00AM BrooksideVT wrote: My hospital had a social worker who organized those initial appointments.  Other areas have nurse navigators.  Do you have someone like that?  If in doubt, you can call your surgeon; he or his secretary can fill you in on what happens when.  As I see you had a couple of positive nodes, it's for sure that you want to get started bombarding your MO with questions, so yes, you are absolutely right to get proactive in lining up that referral.",
      "MessageIndex": 5,
      "PostDate": "13/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820076",
      "Title": "What to look for in a MO - any veterans who can help? Ddkath70 vbishop"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Dec 29, 2015 05:51AM BrooksideVT wrote: You need to see your primary care provider. It could be so many things that are totally unrelated to your cancer. Most likely, it will all turn out to be tamoxifen-related, but you'll feel so much better after your pcp rules out a whole slew of ailments.",
      "MessageIndex": 3293,
      "PostDate": "29/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Sep 16, 2013 11:10AM BrooksideVT wrote: Sure sounds like an infection, and it won't do your general health any good to ignore it.    I know you know this, but your BS or MO needs to check this out before it gets really uncomfortable.  So what are your plans for today?",
      "MessageIndex": 7,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/811041",
      "Title": "Swollen breast firestorm531 firestorm531"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 22, 2016 09:11PM BrooksideVT wrote: AryaS, have you seen an allergist? I'm not at all certain there is anything he can do, but that's one stone you might not want to leave unturned.",
      "MessageIndex": 3456,
      "PostDate": "22/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 4, 2016 08:49AM BrooksideVT wrote: My first gallstone episode after my gallbladder went bye-bye scared the stuffing out of me. I was convinced I was having a heart attack. The ER doc knew right away what it was. Apparently only 5% of us have repeat gallstones. Lucky us!",
      "MessageIndex": 3640,
      "PostDate": "04/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 12, 2016 12:02AM BrooksideVT wrote: So very sorry. Here's hoping for a plan that will knock the heck out of those bad guys!",
      "MessageIndex": 3678,
      "PostDate": "12/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jun 27, 2015 11:44PM BrooksideVT wrote: Also, when they do the biopsy, they will re-image your breast in order to locate the correct area/s. If, in fact, it is an artifact, the images will be clear and they'll send you right home. Hoping that's the case!",
      "MessageIndex": 2,
      "PostDate": "27/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832958",
      "Title": "Perfume artifact misdiagnosed as new cluster calcification? Neurotic Neurotic"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 12, 2015 05:36AM BrooksideVT wrote: Oh, and do consider contacting the pathologist, who has introduced you to such a lengthy new vocabulary list. For myself, moving from the more general to the very specific, I'd call the nurse first, then the radiologist, then the pathologist. As for the breast specialist/surgeon,although you do not \"need\" him (i.e. surgery), do not hesitate to set up an appointment, if that would make you more comfortable.",
      "MessageIndex": 24,
      "PostDate": "12/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/832958",
      "Title": "Perfume artifact misdiagnosed as new cluster calcification? Neurotic Neurotic"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 17, 2016 12:47PM BrooksideVT wrote: I have portals at four hospitals. All of them hold back results for three days (one with a most annoying countdown until liftoff). Some of these allow the doc to override the wait and post immediately. If your portal is of the three-day variety, as Monday is a holiday, that might keep your result under cover until you see your onc. Also, if the news is not good, knowing the portal is out there,won't your onc call you?",
      "MessageIndex": 3,
      "PostDate": "17/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/840348",
      "Title": "I'm \"afraid\" of my patient portal LifeAloft luvmygoats"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jun 24, 2016 11:57AM BrooksideVT wrote: Now that we all can read our test results online, the days of, \"It's fine,\" should be over. The nurse should have read the entire report to you and explained the alarming details. Incidentally, I also went online and found the exact same, non-scary information as Zarovka. I hope you will \"encourage\" your onc to direct his nurse to always go over every single detail.",
      "MessageIndex": 3571,
      "PostDate": "24/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Dec 21, 2015 08:05AM BrooksideVT wrote: I'd ask about scheduling and about billing. Where I go to PT, they schedule an hour, with 45 minutes patient time and 15 minutes paperwork. If you are being seen for half an hour, but billed the same as when your sessions were an hour, well . . . . I've had lots of experience with PT for various body parts and never had less than a full session. Wall crawling is great, but addresses only one set of muscle/soft tissue. Your therapist should (says the lay person here) be working your cording and range of motion from every angle. I saw a lymphedema therapist for cording and always did several exercises. My favorite was to lie on my back (maybe even in bed), stretch out my arm somewhere out to the side, then gently turn away. By the way, are you making progress and do you have a good home program that you follow faithfully? Are you seeing a certified lymphedema therapist? If not, maybe you can find someone with that particular training.",
      "MessageIndex": 2,
      "PostDate": "21/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/838735",
      "Title": "How long should physical therapy sessions last Sallyellen BrooksideVT"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "May 8, 2016 04:12PM BrooksideVT wrote: Do ask for the RO to examine you, maybe before treatment tomorrow. Probably they'll have the nurse take a look, but if she is at all concerned, an RO will speedily appear. Chances are everything is completely normal, but there's only one way to be sure.",
      "MessageIndex": 2,
      "PostDate": "08/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/844102",
      "Title": "Last week of rads questions? rosierosie BC2015"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 19, 2019 09:40PM BrooksideVT wrote: Your R/O will tell you directly and clearly if any part of your lungs or heart will need to be in the treatment field. As AliceBastable explained above, a plan will be pepared that shows exactly where the rays go, and do not go. I am six years out (right side). My R/O told me that a tiny slice of my lung would be in the field. She explained that this was not avoidable and woud be highly unlikely to cause any problems. I have noticed absolutely no issues. More importantly, x-rays and CT scans I've had for other reasons (including one a few months ago) have shown absolutely no scarring resulted from the treatment. Do keep in mind that the reason rads is an appropriate treatment is that, generally, it clobbers the weak cancer cells, but normal cells tolerate the treatment.",
      "MessageIndex": 11,
      "PostDate": "19/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869415",
      "Title": "Anyone on Here a few years out from doing Radiation treatments? kec1972 ruthbru"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Dec 2, 2015 08:24AM BrooksideVT wrote: Yep. The breast surgeon is the breast specialist. If there is any question as to whether to biopsy any of the sites that the different imagings show, s/he is who can give the best evaluation. It's not that your doctor does not trust the radiologist, but simply that, because of your other condition, he would like an expert point of view. Still, without a biopsy, not even the breast surgeon can be certain of exactly what each of those sites is up to. Perhaps you are already aware, but 80% of biopsies turn out to be benign, so a determination of whether to biopsy or play the watch and wait game can be a pretty tough call. Even more fun, it is you, the non-expert, who has to make the decision. I had two lumps, one found only through MRI. The first was pretty clearly cancer, the next was indeterminate. I am not the kind of person who could relax for one minute with a six-month rescan and set up that second (MRI) biopsy right away. Although the #2 biopsy result was benign, I was very happy to have both the malignant and the benign lesion removed at surgery.",
      "MessageIndex": 1,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/837192",
      "Title": "My primary doesn't trust radiologist ScredMomma dtad"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Sep 2, 2014 08:26AM BrooksideVT wrote: MarieBernice, there are general surgeons and general surgeons.  All breast surgeons are technically general surgeons.  Some do little or no breast surgery, some focus their practice on it.  If your surgeon spent a year at Sloan Kettering, which is a cancer hospital, he or she spent that entire year doing cancer surgery and only cancer surgery.   You will want to ask how much of that time was dedicated to breast cancer, and how much of his or her practice is devoted to breast cancer.  That Sloan Kettering fellowship tell us this doc does not specialize in gall bladder and appendix surgery, but is a cancer specialist.  It is perfectly appropriate to ask.  It is also perfectly appropriate to seek a second opinion. Right from the start, you will have three oncologists:  Your breast surgeon is your surgical oncologist.  Your medical oncologist follows you medically and manages your hormone blocker and, should you need it, chemo.  Your radiation oncologist addresses your radiation therapy.    Your PCP manages your health in general and is a great resource in helping put into perspective the recommendations from the various oncologists.",
      "MessageIndex": 14,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824078",
      "Title": "Just diagnosed, overwhelmed about future nomoretears850 Moderators"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "May 7, 2016 02:23AM BrooksideVT wrote: If you are still concerned that this is a bone issue, do speak to your onc about a bone scan (different from a DEXA scan). I had what I thought was rib pain and asked about an x-ray. My onc indicated that he feels a bone scan is the best way to look for bone mets. They inject a radioactive substance into your vein, you sit around a while (I think I went to the cafeteria and had lunch), then return, and slide through a donut-shaped scanner. The result is a whole-body view, both front and back, with black spots where you have mets or arthritis. My scan was peppered with black blots, and I was terrified, but they all turned out to be arthritis. Strangely, the arthritis was in every place that I did not hurt. The radiologist and onc agreed that my rib issue was actually due to a little arthritis where my rib meets my spine. Big relief (except for finding out that I am not, after all, immune to arthritis)!",
      "MessageIndex": 3494,
      "PostDate": "07/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "May 7, 2016 06:33AM BrooksideVT wrote: I'm pretty sure it just shows bone density.",
      "MessageIndex": 3496,
      "PostDate": "07/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 4, 2016 08:28AM BrooksideVT wrote: GooniesGirl, believe it or not, you can still have gallstones. Yes, I've had them several times in the twenty-ish years since gall bladder surgery. Sometimes they have had to be removed, sometimes they passed. Once, a nasty infection was involved. Your symptoms do sound to me as though you might have passed a nasty stone, but if the pain returns before Thursday, the ER would probably give you a quicker dx.",
      "MessageIndex": 3638,
      "PostDate": "04/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Feb 9, 2016 07:49AM BrooksideVT wrote: Well, this is the first I've heard about Ralph Moss. Initially, I was disturbed by the bio you posted, kayb, where Moss uses the euphenism \"scientific communications\" for letters to the editor. These letters normally fall into the category, \"opinion piece,\" not \"article.\" On the other hand, in journals such as those listed above, these pieces are often commissioned by the publication. Their primary role is to print actual research, but they also have a need to present supplementary information that will help place the published article in a larger context. Whether these letters are specifically invited or not, their very appearance in these journals does indicated a significant credibility for their author. I then followed your link. He calls himself a cancer advisor, but his expertise seems to be in reporting on cancer issues. I'm thinking he is journalist, an in-depth reporter with a truly extensive background--and interest--in his field. My guess is that he would indeed be an excellent resource for information on both the pro's and the con's (journalists need to present both sides of any story) for various treatments and protocols. He does offer telephone consultations. I read a few of the blogs on his site, and found them informative, but not particularly in-depth. I'm thinking his book might be a compendium of many of his articles, covering a really huge swath of both traditional and alternative remedies. As such, I'd think it worth reading, but yikes! The price! Couldn't a nice publisher give him a huge advance and then market it for the masses?",
      "MessageIndex": 51,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/841032",
      "Title": "Data On Alternative Vs Conventional Treatment? DivineMrsM barbe1958"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Mar 29, 2014 12:12PM BrooksideVT wrote: Whatever you do, do not walk away now--Neither have any remaining cancer cells yet been eradicated, nor can you ever have rads in that area again.  The radiation field can be modified, although this might not be the best long term strategy.  You need to talk this out with someone on your medical team, and you need to do it now.   If you do not feel comfortable with your RO, bring someone who with you, or write your conerns, or ask to speak with a different RO, perhaps the head guy, or demand a team meeting--RO, tech, physiologist, lymphedema therapist, etc.  Right before your next scheduled treatment is an ideal time for this.  That way, if they need to re-tool your field, you will not be sidelined longer than absolutely necessary.  You can either call in advance, or just show up a little early and ask to speak with the doc. I found I was more than terrified of rads.  I was actually horrified. The head of the techs was a tremendous help--his job was to solve problems and he walked me though all the steps, explaining exactly what was going on, and why. It seems I had a lot of preconceived notions about how my body would be damaged, and they were mostly just notions, not reality.  It really is true that healthy cells (your lymph system,for instance) are clobbered right along with the  cancer cells, but those good structures heal; the cancer cells do not. Because of its powerful beam, there is no scatter with rads, but the field is designed so that certain areas receive more radiation, and some receive less.  It seems neither your RO nor your techs explained this particularly well, but if you give them a chance, I think they'll make you feel more comfortable.  ",
      "MessageIndex": 2,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/819667",
      "Title": "Having another meltdown jessica13 BrooksideVT"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Mar 30, 2014 08:24AM BrooksideVT wrote: Well, no wonder you're having meltdowns!  It would be pretty strange if you were not.  And itsn't it lucky that you have a real pill of an RO to \"help\" you process all that turmoil. It seems she's clarified the treatment field a bit, which must be a relief, and that she backed you and not the other docs on the lymph node issue, which is good.  Warm and fuzzy, however, she ain't!  Someone at your center can sit down with you tomorrow and go over (and, if necessary, over and over) all your concerns, in particular the lymphedema issue, which certainly needs clarification.  Believe me, you are not their only current patient with significant issues.  I'd also suggest digging in your heels (and heals!) and taking all the time, and all the docs/techs/nurses/whatevers you need to work through this.  it really is important that you complete treatment, and equally important that you understand exactly what is happening, and why.",
      "MessageIndex": 6,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/819667",
      "Title": "Having another meltdown jessica13 BrooksideVT"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 12, 2014 07:45AM BrooksideVT wrote: Yes, I too wanted everything right away too--there is so much stress, so much to learn, and such pressure to get it all together.  Breast cancer, at least early breast cancer, just seems to involve so many choices, and so much research, and all the pieces need to fit together.  Your topic is MO (medical oncologist), yet your post seems to be about your RO (radiation oncologist).  As for the RO, s/he is usually scheduled around the time your incisions heal, because treatment can't start until that's been taken care of, so the 28th is fairly normal.  I did not have chemo, but I'm pretty sure that, with some exceptions, the same holds true for that. I had a recommendation for my MO.  My hospital had a program that, if you wished, matched you with someone who had a similar diagnosis, or treatment choice, or age, or (whatever) concern.  My buddy strongly recommended her doc, and I asked for him.  When I called to make the appointment, it seemed so far away, that I \"expressed my concern\" to the secretary.  Clearly, I sounded pretty frantic, because a couple of days later, the MO telephoned me, apologized for not being available, and spent an hour addressing that first round of concerns. Chances are your hospital has some sort of support program.  You may not want to join, but you could call whomever runs it and ask if one of the members would speak with you.  Chances are she'll have heard a lot about the different docs.",
      "MessageIndex": 2,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820076",
      "Title": "What to look for in a MO - any veterans who can help? Ddkath70 vbishop"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 23, 2016 01:01PM BrooksideVT wrote: Your short term disability paperwork may or may not ask for medical history. If it does, your hyperplasia would not be an issue. At worst, they may exclude coverage for treating (removing) the hyperplasia.",
      "MessageIndex": 6,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/840543",
      "Title": "Does being at high risk for breast cancer affect insurance? StaceySue2U SpecialK"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 7, 2016 06:47AM BrooksideVT wrote: Heidi, to find the Canadian threads, go to \"All Topics\" in the box at the upper left, then scroll down to the Community section.",
      "MessageIndex": 16,
      "PostDate": "07/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/846674",
      "Title": "Hypofractionated radiation therapy Greyt2mphrn Lala6349"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jun 1, 2013 07:58AM BrooksideVT wrote: Raspberry, that cordlike thing is most likely cording, a pretty frequent result of sentinal node, or, I guess, any, surgery.  Apparently, it is a blocked lymph vessel and a lymphedema therapist (specially trained physical therapist) can teach you how to treat it.  Gently stretches and specific massage techniques are the mainstay. You really want to ask your BS or MO or RO or PCP for a referral. I believe the theory is that these things go away by themselves.  Mine went away just a couple of weeks ago, after a lot of coming and going, and, I suppose, might still return from time to time if I overdo.  My surgery was January 7, so, even with guidance and treatment, that's a long time to have limited motion and compromised lymph flow. Where I had my surgery, the lymphedema ladies are trying to educate the breast surgeons that every patient should have a post surgical meeting with one of them.  Apparently, all the surgeons except mine are pretty compliant.  Figures!  It took me a while to get there, but, boy, am I glad I went--so much information these ladies have!",
      "MessageIndex": 509,
      "PostDate": "01/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 16, 2016 07:21PM BrooksideVT wrote: What does matter is sticking with rads, not because of any guarantee, but because once you've gotten this far, neither have you fully treated the area, nor can you ever have rads to that breast again. Here I loosely quote my RO at the time I began to make backing off sounds. What you can do is ask for a day or two off from treatment. Also, if I were having skin issues and/or beginning to balk, I'd insist on being seen by an RO every day. If \"they\" gave any pushback to that, I'd let them know I was having trouble continuing. Your rads center will always have a doc on call. Might not be your RO, but sometimes a different personality can be helpful, and a daily confidence/commitment booster may be just the thing you need.",
      "MessageIndex": 39,
      "PostDate": "16/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/846674",
      "Title": "Hypofractionated radiation therapy Greyt2mphrn Lala6349"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 15, 2014 09:39AM BrooksideVT wrote: MomtoIrish, the oncotype is not about the low, mid, high range.  It is about your specific, individual, personal, statistics, based on the genes in your very own tumor.  It shows your individual risk of recurrence, then how much that is reduced by five years on tamoxofen.  It also shows how much that risk is reduced by adding chemo.  You need to look very closely at those three numbers, not the range.  Kindly call both your oncs and ask them to walk you through those numbers.  Speaking with both will help you determine whether your current onc is someone you want to keep.  In my case (and I'm grade one), tamoxofen reduced my chance of recurrence by about half, so that's a number I can't ignore.  Chemo added only a 4% reduction, so my onc and I agreed to waive that option.  As I am postmenopausal, I'm on an AI drug, rather than tamoxofen, so, although the oncotype report does not yet show this, my recurrence rate is actually somewhat better than the report shows.  Have you addressed your concerns about chemo side effects with your current onc?  Maybe he can adjust your \"recipe\" a bit?  None of us like anything about our treatment, and sometimes I think the main role of the onc is to help us make our peace with the fact that we are no longer able to protect our bodies from toxic stuff, that, indeed, for our own good, we absolutely have to set aside our perfectly normal,carefully developed, fears of chemicals and radiation.  No doc is going to tell you what to do.  Painful as that often is for them, they cannot do that.  What they can, and should, do, is walk you through all the details of your case so that you can make an informed decision, and, yes, they can make very strong recommendations.",
      "MessageIndex": 7,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822794",
      "Title": "Standard of Care? MomtoIrishQuads voraciousreader"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 18, 2014 06:07AM BrooksideVT wrote: Mom of Irish, it seems to get curiousier and curiousier.  A patient threatening to ditch chemo is very different from one who wants to schedule a routine exam. These dolts should have figured out you need to see the onc, and you need to see him asap.  Have you tried emailing him?  By the way, we are all pains in the butt, at least in the early days (my only experience) when we have so many questions and concerns, and so little knowledge, and are aways on the verge of panic.  Oncology staff have to be (or learn to be) the absolutely most patient people in the universe.  I know I'm a challenge.  If only you could have seen me with my rads doc and techs, you'd never feel the least bit guilty about being a bit of a squeaky wheel.",
      "MessageIndex": 29,
      "PostDate": "18/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822794",
      "Title": "Standard of Care? MomtoIrishQuads voraciousreader"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 18, 2014 08:38PM BrooksideVT wrote: Wow, that's the first I've heard that the oncotype is being validated (or perhaps not) next year.  I guess we'll all be waiting with bated breath for that one.  Listen, we all have to learn a new breast cancer \"language,\" obtain, it seems, a PhD in treatment, make seemingly bizarre decisions in a ridiculously short time, then learn to deal with multiple new doctors, with new office procedures, and, sometimes, assistants who are useless, or worse.  I don't think any of us function like real humans for months.  We all do what we can, and that's all anyone can expect of us.",
      "MessageIndex": 37,
      "PostDate": "18/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822794",
      "Title": "Standard of Care? MomtoIrishQuads voraciousreader"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 8, 2014 10:02PM BrooksideVT wrote: Maybe line up an on-call substitute cleaner just in case there is a day when you just don't feel up to a particular job?  Scheduling rads between two cleaning whirlwinds (as you've already done) might give you a welcome break, or might just add to travel time stress.  Pay attention to how that's working out.  And drink lots and lots of water.",
      "MessageIndex": 2,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/819988",
      "Title": "Working during rads? faerywings faerywings"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Feb 14, 2015 07:42AM BrooksideVT wrote: Please excuse me for intruding on a stage IV thread, but I can so easily see myself in the very same situation. My mother was there, so I've always expected the same for myself. Pretty early on, she nixed the idea of the bed and lived the last years of her life in a comfortable chair, with a potty right next to it, so she needed very little help. I'm thinking maybe the reason Raro wants to get up so often is that she similarly just does not want to be in bed. I wonder whether placing a comfortable chair, maybe even a recliner, right next to the bed would help? All you'd need to do to help her transfer from one to the other would be to help her kind of swivel and take a couple of steps. And if she finds being in a chair rather than a bed to be quite a comfort, then perhaps she'll happily stay put for longer periods. Maybe, like my mother, she'd even be happier there at night.",
      "MessageIndex": 67,
      "PostDate": "14/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828336",
      "Title": "Update on Raro raro"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 2, 2013 06:50AM BrooksideVT wrote: April, can you maybe work in a few visits with a physical therapist?  My bursitis was treated by a PT a couple of years ago and it made a huge, huge, huge, and permanent,  difference.  And maybe you could give your primary care a quick call--that twice daily painful position could irritate your shoulder, making an already problematic situation worse.  Possibly a temporary medication or injection can set you up for a pleasant-as-possible 10 treatments.  Yay for the five days and done!",
      "MessageIndex": 54,
      "PostDate": "02/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jun 6, 2013 08:03AM BrooksideVT wrote: Regbeach, as you are already probably very tired of hearing, everybody is different.  Your mom may experience absolutely no fatigue, or she might.  What you need to do is have a very open, and probably, lengthy, discussion with each and every one of her docs, about both her health and your concerns about caring for her.  Is there any chance you can gather them all together, either in person or through a telephone conference?  I will tell you one thing my RO said, and very pointedly: The absolutely worst thing you can do is quit rads part way through.  If that happens, neither is the area treated, nor can you have rads in that area in the future, should there be local recurrence, .   I know this is a ridiculaously difficult situation--making decisions for ourselves is hard enough, but for a parent, it must be truly difficult.",
      "MessageIndex": 528,
      "PostDate": "06/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 20, 2016 02:04PM BrooksideVT wrote: I'm also extremely fair skinned, but that is apparently a factor in who gets burned and who does not. As I said, I had no problems, other than terror. I used emu oil in the morning (rads four hours later), then whatever cream the facility handed out after treatment, then emu oil again at night. I wore a white cotton man's Tshirt under everything, which absorbed some of the goo and just plain felt protective.",
      "MessageIndex": 10,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/840478",
      "Title": "After only ONE treatment! etnasgrl MomOfTwins98"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Feb 12, 2016 12:48PM BrooksideVT wrote: It seems to be a normal abnormality. Do see your RO today (or whichever one is seeing patients if your doc is scheduled to be elsewhere). If you are concerned, show up early and ask to be seen before treatment, as I did (see my post above). In my case, my breast stayed the same shade of pink until a couple of weeks later when the expected pinkness appeared throughout the radiation field. From then on, it was textbook.",
      "MessageIndex": 14,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/840478",
      "Title": "After only ONE treatment! etnasgrl MomOfTwins98"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 17, 2014 11:42AM BrooksideVT wrote: Ruth, I love your idea of sitting in front of the door, and might just use it when next I see my ENT in September.  He's normally an absolutely lovely man, but last visit, he answered one of my questions as he backed out the door!  He might have been done, but I was not.  I'd never run into this before and was so flabbergasted, I just slithered out of there.  Lintroller, maybe this vitamin D focus is new?.  My PCP has been hammering me about this only for a couple of years.",
      "MessageIndex": 25,
      "PostDate": "17/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822794",
      "Title": "Standard of Care? MomtoIrishQuads voraciousreader"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 21, 2016 12:25PM BrooksideVT wrote: Your hyperplasia should not affect your insurability, but you will probably need to have completed treatment for your broken pelvis before you can apply.",
      "MessageIndex": 1,
      "PostDate": "21/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/840543",
      "Title": "Does being at high risk for breast cancer affect insurance? StaceySue2U SpecialK"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Mar 17, 2018 05:04PM BrooksideVT wrote: I guess you're referring to my post from July 2017.  My surgeon examined the lump and recommended a surgical procedure which completely remedied the problem.  I'm aware of others whose surgeons strongly advise against surgery. I'd suggest calling your bs and asking whether a surgical fix is possible in your particular case.  ",
      "MessageIndex": 15,
      "PostDate": "17/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856983",
      "Title": "Developed a hematoma after my lumpectomy LLS1993 Moderators"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "May 19, 2014 08:21AM BrooksideVT wrote:  Goofytoo, with a T1BNO finding (the main Breastcancer.org website will help you translate), chances are pretty good you will not need chemo.  It is your onc who will order (or not order) the oncotype.  Your surgeon might have been indicating that your stats are so excellent that chemo is highly unlikely.  As for measuring the tumor--the ultrasound measurement depends a great deal on who is doing the measuring, and rather variable reports happen.  I watched my radiologist measure the wrong diameter, but never thought to point out her error.  All my presurgical assumptions were for a tiny tumor.  The radiologist had said .4 cm, and it turned out to be 1.1 cm.  Had I not watched her measurement, I'd have panicked about a superfast growing invader.   Enjoy the cruise--so jealous!",
      "MessageIndex": 25,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820176",
      "Title": "Can I delay treatment after surgery? goofytoo goofytoo"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Feb 29, 2016 01:43PM BrooksideVT wrote: Maggerle, the surgeon can only determine whether this is a seroma (or one of multiple other possibilities), and whether it needs to be treated, by examining you. If you are still uncomfortable, please call the surgeon and ask to be seen asap. If you traveled for surgery, an alternative would be to visit the ER in a local hospital. And yes, in some cases, gardening could exacerbate the leakage of blood or lymph fluid, so I'd stay a bit quiet until a surgeon has examined you. My seroma appeared on a Sunday, so I went to the ER. They scheduled a visit to the BS on Monday, and I had surgery on Tuesday. I use the term, \"surgery\" because rather than inserting a syringe and removing fluid, they took me to the OR, reopened my sentinel node incision, found the bleeder, and fixed it. It was a very minor procedure, as was the recovery.",
      "MessageIndex": 10,
      "PostDate": "29/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841585",
      "Title": "Does a seroma always have to be drained? ducky179 Lemint"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 15, 2014 04:29PM BrooksideVT wrote: I'm almost absolutely certain the risk reduction from adding chemo was on the oncotype.  The purpose of the test, after all, is to help determine whether chemo will be benficial.  I've somehow lost the report, so cannot check.  Do you have the entire report?  (Other ladies, do you have that info in your oncotypes?)   Have you gone on one of the chemo threads to ask whether your chemo side effects are normal-ish?",
      "MessageIndex": 13,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822794",
      "Title": "Standard of Care? MomtoIrishQuads voraciousreader"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 17, 2014 08:19AM BrooksideVT wrote: The \"standard\" range for vitamin D is 30 - 100, with higher rather than lower preferred.  I'm pretty sure all oncs and pcp's are checking this level in their bc patients, and am surprised your nurse/PA didn't know this.  Maybe your onc is fine, maybe not, but this babe is hopeless.  Certainly time for a lookaround.  Also, please be certain your onc knows about your experience, as either oodles more training or a speedy departmental transfer is called for before other patients experience her incompetence.",
      "MessageIndex": 21,
      "PostDate": "17/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822794",
      "Title": "Standard of Care? MomtoIrishQuads voraciousreader"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 26, 2016 08:35AM BrooksideVT wrote: Yes, it'll be just fine. The radiation passes right through your body. With a lumpectomy plus rads, you'll be far less likely to have ouchy spots on that breast when it's baby holding/lifting/cuddling time. ",
      "MessageIndex": 1,
      "PostDate": "26/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/847346",
      "Title": "Radiation question Bock BrooksideVT"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 6, 2016 12:22PM BrooksideVT wrote: I was in my late sixties with 10 isolated cells in one of two sentinel nodes, which is technically considered node negative. Grey, perhaps you might post on one of the Canadian threads, as this approach has been done there for quite a while longer than here.",
      "MessageIndex": 8,
      "PostDate": "06/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/846674",
      "Title": "Hypofractionated radiation therapy Greyt2mphrn Lala6349"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 16, 2017 09:34AM BrooksideVT wrote: Ditto what everyone else said. Seromas and hematomas are a normal (and not infrequent) side effect of surgery. Like you, I developed a seroma (racketball-sized lump) just below my sentinel node incision. A very minor surgery located the bleeder, fixed and drained it. I did develop the absolutely most gorgeous royal purple hematoma on that breast. All my doctors were impressed with the color. Of course it is a good idea to discuss your normal activity with your surgeon, but, really, after breast surgery, the main objective is to avoid stressing the arm on your surgical side, both to allow surgical healing and to protect your lymph system. Nothing you report could have done any damage. ",
      "MessageIndex": 11,
      "PostDate": "16/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856983",
      "Title": "Developed a hematoma after my lumpectomy LLS1993 Moderators"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Oct 20, 2015 06:31PM BrooksideVT wrote: Oops! Sorry. I knew there was no pathology, didn't I? I guess I meant the infirmation in the radiologist's report.. I would add that in my case, my first thought was to request an excisional biopsy (get it out, right?), but the radiologist indicated that, again, in my case, the chance of clear margins would be higher with the core needle biopsy, so that was what I did.",
      "MessageIndex": 3,
      "PostDate": "20/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/835924",
      "Title": "Open biopsy vs Core Needle biopsy?? JM29 JM29"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 23, 2015 05:04PM BrooksideVT wrote: Thanks for explaining about the half life of the radioactive injection, Downdog. I'd been wondering why I came in the morning of surgery, but others were injected the day before. It had seemed to me (and still does) that the extra time would allow extra nodes to light up. I made certain to ask the radiologist (it's a doctor who does the injections, not a tech) to confirm that she was using lidocaine. She indicated that she was, but that it probably does not make much difference. Maybe not, but knowing it was in the syringe sure reduced my fear level. My injection was nowhere near my nipple, I'm guessing because of the tumor location. The lidocaine stung, but it was no biggie. At the time, I'd never heard of Emla. Could I go back in time, I don't think I'd bother.",
      "MessageIndex": 29,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/833592",
      "Title": "Sentinel node biopsy - do I need Emla cream? rleepac Aug242007"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jul 24, 2017 07:20PM BrooksideVT wrote: A breast specialist is the proper doc to evaluate any breast weirdness, so your primary care did exactly the right thing. The information packet is just information the breast center automatically sends out to every new patient. It's designed to give you a sense that you are not alone, confidence that the hospital has all the right resources, and answers to some basic questions. The nurse navigator is a particular gift. Do not hesitate to contact her. ",
      "MessageIndex": 2,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857294",
      "Title": "Being sent to cancer center Fionathepug MTwoman"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 4, 2013 06:17AM BrooksideVT wrote: My RO said the rads cause blood vessels to expand (reason for the pinkness) and recommended Advil before treatment.  I took it about an hour before each tx and had no out of the ordinary problems.",
      "MessageIndex": 1,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802748",
      "Title": "Has anyone ever had pain in their breast during radiation? Cancer-schmancer CarolynVM"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jun 17, 2015 05:43AM BrooksideVT wrote: Gooseberry, maybe your experience was similar to mine? My surgeon's approach was to explain the odds, predicting a very high probability of surgery and rads, no chemo. The medical oncologist's approach was to kind of introduce me to, and prepare me for, the possibility of chemo, and to explain why it might be needed. Yes, my HER2 was also in question, as I suspect it might be for most of us. I am not sure whether this meant my initial numbers were wishy washy, or just that they waiting for the definitive (FISH) test. Obviously, until your pathology is complete, whether you might need chemo is anybody's guess. As it turned out, I did not need chemo, but was (sort of) grateful that I had been prepared for the possibility, so that it would be somewhat less of a shock if it turned out to be adviseable.",
      "MessageIndex": 3,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832668",
      "Title": "Confused by oncologist gooseberry windingshores"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 20, 2016 12:45PM BrooksideVT wrote: I had the same experience on my Day 1. The next day I insisted on seeing the RO before treatment. She explained that my breast was reacting to the rads, and that all would still be fine. She gave me the day off. It happened to be a Friday, so I had a three-day weekend. On Monday I resumed rads. The breast stayed pink, but got no pinker until two weeks later, when pinkness was expected. I then progressed exactly normally, with pinkness and, eventually itchiness, but no skin issues. I was in an absolute panic, of course, and it took a while to climb down from teeth-clenching fear, but really, the heat and pinkness were just a normal abnormality.",
      "MessageIndex": 6,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/840478",
      "Title": "After only ONE treatment! etnasgrl MomOfTwins98"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Oct 3, 2013 05:36PM BrooksideVT wrote: Green smoothies tonight mean smooth sailing tomorrow.  Thursday is the best night for TV--all my favorite shows.  Can't wait for Scandall either.",
      "MessageIndex": 18,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/812045",
      "Title": "Best Doctor for 90 Year Old Patient DoRightByMom salspecs"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 20, 2015 03:26PM BrooksideVT wrote: Perhaps call the radiology department anonymously? And not identify the technician? I suggest anonymously because if you give your name they will be able to identify the technician.. They would be able to keep an eye out, or at least move the chair.",
      "MessageIndex": 29,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/834247",
      "Title": "Appointment with surgeon - more questions than answers solfeo ShetlandPony"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Oct 20, 2015 06:01PM BrooksideVT wrote: As you have not given us any information about the pathology you've received so far, none of us can give you any specific help. If it were me, though, I'd be calling both the radiologist and the surgeon, gathering details. Also, if you've been assigned a nurse or social worker to guide you through everything, you could call her.",
      "MessageIndex": 1,
      "PostDate": "20/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/835924",
      "Title": "Open biopsy vs Core Needle biopsy?? JM29 JM29"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Aug 6, 2016 06:37AM BrooksideVT wrote: Me too. As ChiSandy pointed out, your cancer has to fall within certain guidelines, but as far as I can tell, this is becoming the standard treatment for those for whom it is technically appropriate. This approach is not that new, and oodles of encouraging statistics have been published. If you are concerned, do gently grill your RO, and maybe seek a second opinion from someone in another practice as well.",
      "MessageIndex": 4,
      "PostDate": "06/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/846674",
      "Title": "Hypofractionated radiation therapy Greyt2mphrn Lala6349"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Oct 2, 2013 04:50PM BrooksideVT wrote: An ICU nurse told me that anesthesia has progressed to the point where they can do just about any surgery on just about any patient.  Of course, there is always some risk, but a lumpectomy is such a minimal procedure that your mother will probably be a pretty durned good candidate for surgery, followed by a speedy recovery.  After my lumpectomy, I took painkillers for one day.  On day four I was outside chopping ice on the walkway. The best place for your mom to start will be with her primary care doc.  S/he can direct you to the best local-ish breast cancer center in the area, where the docs will, by definition, have oodles of experience treating patients of all ages, and all stages and grades of breast cancer.  Of course, they will treat a 90 year-old differently than a 40 year-old.  Frankly, there is little advantage, particularly for an elderly person, in travelling about for multiple consultations.  Your local cancer center can send slides and records to wherever you would like a second opinion. There is a tremendous amount of information on breastcancer.org, and on these discussion threads.  In addition, your local hospital/s probably have lots of literature and possibly even informational meetings that can help you get grounded. ",
      "MessageIndex": 11,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/812045",
      "Title": "Best Doctor for 90 Year Old Patient DoRightByMom salspecs"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Oct 2, 2013 05:07PM BrooksideVT wrote: Also, I might add that there is really no one standard protocol.  Each patient, each individual tumor, is, well, individual, and treated as such, and there is always a range of options.  And by the way, we know, and understand, that you've been thrown for a loop, but how is your mother handling the situation?",
      "MessageIndex": 13,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/812045",
      "Title": "Best Doctor for 90 Year Old Patient DoRightByMom salspecs"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 29, 2016 09:23AM BrooksideVT wrote: Good point, Golden. I've been known to ask for an afternoon surgery so that I can stay overnight. Although I go home the next day, it is within 24 hours so OK with insurance.",
      "MessageIndex": 8,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/840821",
      "Title": "MIght Have to Go To Surgery Alone MarcellaPa MarcellaPa"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Nov 9, 2014 09:52AM BrooksideVT wrote: It would be wonderful if we could identify contributing foods, but, then, there are so very many of us who have never, never eaten whole categories of food:  Meat, fish, eggs, dairy, veggies, grains, fruits, sweets, anything cooked, anything packaged, anything that has touched plastic or a microwave.  Total abstainers from each category find themselves right here.  And of course, there is the movement toward foods our ancient ancestors ate.  They had breast cancer too.  I believe I've read that they've found cancer in the fossilized bones of dinosaurs.  Thousands upon thousands have tried to find a cause and/or cure.  Have you been on the website of the National Cancer Institute (www.cancer.gov)?  Many, many ongoing research projects, some of them mighty interesting to us.  The Moderators regularly post research results for us on a regular basis. There is a lot of cancer in my family:  Brain, blood, sinus, lung, pancreas, colon, skin, esophagus, prostate, but only one aunt on my father's side (both my parents came from families of five girls, two boys), well into her 80's had breast cancer, and she died of something entirely different.  I've been a cancerphobe since my teen years, but breast cancer never even touched my radar.  Having now had nearly two years to read, read, read every study I could find, and everything on this website and almost all the posts, my biggest conclusion is to be thankful that, of all the kinds of cancer my two parents, 12 aunts and uncles, and 27 first cousins had, I wound up with a total outlier whose prognosis is way, way better than that of any of my long gone relatives.  And to be thankful that researchers everywhere are working toward both prevention and cure.    Yes, I continue to search (don't we all!) for answers, and am trying my best to lose weight, get 30 minutes of exercise each day, and slow the digestion of starchy foods by nibbling on protein and/or fat just before I eat them.  I'm committed to my aromatase inhibitors.  As I look back, I compare my really healthy choices with those of what I think of as''normal,\" and I certainly come out ahead.  Years ago, I remember Helen Gurley Brown mentioning in one of her books that, although most of us try to stay away from foods containing preservatives, one of her friends believed that preservatives might preserve us as well!",
      "MessageIndex": 24,
      "PostDate": "09/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Nov 8, 2014 05:09AM BrooksideVT wrote: Sunny, I think we all go through the same process.  \"Why me?,\" is a natural, normal, and pretty much required, part of every loss, every bereavement, every diagnosis.  At first it appears a no-brainer that something we are--or are not--doing or have done has caused this.  As others have indicated, people around the world with different food opportunities, different environmental factors, different cultural practices, and different genetic histories, develop breast cancer, and have developed it for centuries.  Sometimes we hear that it is virtually unknown in third world countries, but these are areas where, sadly, women rarely live long enough to develop breast cancer.  We worry about plastics and food additives and emissions from autos and power plants, yet Hippocrates wrote about breast cancer over 2,000 years ago, when organic living was everyone's cup of tea. There's lots of conjecture about the role of our immune system in the development of cancer, yet we all know people who seemingly fall prey to every bug that's going around and never develop cancer, and those who never even have a cold, yet here they are.  Some feel stress is the culprit, but probably all of us experience moderate stress much of the time and significant stress on occasion.  Is there a specific cause?  Maybe.  Maybe it's a whole compendium of factors.  Maybe it's a genetic time bomb.  Whatever.  For us, we have it.  We are lucky to live in a age where so many scientifically proven treatments are available to help us.  We are lucky that there is treatment.  Some of us (me, for instance) are lucky to have a cancer that is proven to be slow growing (and possibly completely removed through surgery) and to allow me to live my life, maybe for decades, with just one little pill/day.",
      "MessageIndex": 13,
      "PostDate": "08/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Apr 29, 2015 04:57PM BrooksideVT wrote: Thank you for posting that link, April. I had not read the previous link because, believe me, I researched causation to the nth degree (three children, one miscarriage at the beginning of the fifth month) and was already aware there is no link between breast cancer and abortion, spontaneous or otherwise. I was not, however, aware of the large number of studies that quite clearly remove from consideration the possibility of abortion as a causative factor. Carrie, most of us find links to scientific studies helpful, but not links to opinion pieces. If you are interested in looking further into breast cancer risk factors, try the address below (sorry--will not turn itself into a clickable link for some reason). You will find a list of 30 or so risk factors for bc; abortion is not one. Oh, and please do check out the link April provided. http://www.breastcancer.org/risk/factors",
      "MessageIndex": 77,
      "PostDate": "29/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Jan 29, 2016 06:23AM BrooksideVT wrote: I've always gone alone, just arrange for someone to pick me up when it is over. I suppose if I were having open heart surgery, I'd look at it differently, but for same-day and overnight procedures, it works out fine. The doctor knows who to call if anything goes wrong. It sounds as though your mother is planning to be with you, so the issue is transportation. If your current schedule is too early for her to share the cab with you, you can either arrange for two cabs or maybe move your procedure to a later time. Also, I believe your hospital or the American Cancer Society can put you in touch with a volunteer driver. Probably a local church can do so as well. Relatives sometimes just do not understand.",
      "MessageIndex": 3,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/840821",
      "Title": "MIght Have to Go To Surgery Alone MarcellaPa MarcellaPa"
    },
    {
      "AuthorID": "BrooksideVT…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/170717/profile",
      "Content": "Sep 20, 2015 08:47AM BrooksideVT wrote: I did not have your skin issues, but my RO really drummed into my hard little head that as long as any of us are having sores, oozing, or any skin concerns, we should be showing up at the rads center at least weekly. Unannounced dropping in was fine in my hospital, as there are always nurses and at least one RO on site, ready to see anyone and everyone who needs to be seen. Ditto for your skin/muscle tightness, which is no doubt a result of rads, and any post treatment trauma (I showed up with PTSD). You can try gentle stretching (I used to lie on the floor, reach my rads arm out to the side, then just gradually turned away, just until I felt the pull). A lymphedema therapist can also be helpful in managing that tightness, but may not be able to touch you until your skin has healed ",
      "MessageIndex": 1,
      "PostDate": "20/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/835128",
      "Title": "2 questions CAMommy Spookiesmom"
    }
  ]
}