{
  "AuthorID": "browneyedsu…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118491/profile",
  "Posts": [
    {
      "AuthorID": "browneyedsu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118491/profile",
      "Content": "Jan 9, 2011 02:43AM browneyedsuzi wrote: I am new to the site.  Routine yearly mammo on Dec 13th, found micro calcification, back for coned down views on Dec. 16th....Core needle biopsy on the 22nd, then hospitalized same evening due to totally blanking out due to pain from core biopsy.  MRI on brain on Dec 23rd...them thinking I had stroked or TIA.  Great news!!! No stroke....not so great news....biopsy shows DCIS....Great news stage 0.   After our initial meeting with BS she ordered an MRI of both breasts.   MRI on Jan 5 shows same findings as biopsy, with no involvement of left breast but remarks were 2 non specific lymph nodes in right axilla.  After talking out options we have decided on lumpectomy with balloon brachytherapy IF my margins and sentinel node mapping come out clear.  I feel so fortunate with this initial diagnosis....but at the same time I am scared to death.  I am going to be going for a needle placement on Jan 24th the evening before my scheduled surgery on the morning of the 25th.  Is this any way as painful as the core biopsy? ",
      "MessageIndex": 7,
      "PostDate": "09/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/762724",
      "Title": "11 days post-lumpectomy and SNB-why so much pain? slcst12 browneyedsuzi"
    },
    {
      "AuthorID": "browneyedsu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118491/profile",
      "Content": "Jan 9, 2011 06:03AM browneyedsuzi wrote: Hi Renee...with DCIS were you not a canidate for lumpectomy?  I also was diagnosed with DCIS and am scheduled for lumpectomy and balloon brachytherapy.  I am now wondering if the right choice has been made. Suzanne",
      "MessageIndex": 159,
      "PostDate": "09/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    }
  ]
}