{
  "AuthorID": "BT39",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
  "Posts": [
    {
      "AuthorID": "BT39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
      "Content": "Oct 30, 2018 01:55PM BT39 wrote: MtKushmore: I'm also in my 30s and have felt similar this week. Although I know at any age, there is such a range of emotions. I started thinking about endocrine and other therapies that will be coming next year and that kind of bummed me out, just thinking about the different options and more decisions. I'm trying to just focus on the step I'm on now.",
      "MessageIndex": 570,
      "PostDate": "30/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "BT39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
      "Content": "Oct 30, 2018 06:25PM BT39 wrote: dolceb70: I'm 8 days past my second round of TC. Glad to hear your first infusion went well so far! I think staying active is super helpful. I took Claritin for 4 days the first time and ended up getting a day of bone pain on night 6 into 7. Very manageable still, took 2 Advil twice and still walked a lot with my kiddo during the day. This round I kept the Claritin up for 7 days and didn't - at this point - get that day of pain, just a few minor twinges here and there. I did get a mild fever both times with Nuelasta, ranging from 99.4-100 on day 5. So you might notice that as well.",
      "MessageIndex": 575,
      "PostDate": "30/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "BT39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
      "Content": "Nov 18, 2018 05:40PM BT39 wrote: Sunocean: I'm 39 too. I had a double mastectomy in August with no reconstruction and am currently on round 3 of 4 of TC. I decided not to reconstruct - and while this is a very personal decision for everyone - I just wanted to let you know that I'm really happy with my decision and don't think about my breasts really at all. There's lots of great styles to wear that are sexy and feminine. Just wanted to offer my perspective and let you know I've felt very positive and happy after surgery. I think it is a hard thing to imagine and think about, also why I didn't overly think about it once I made my decision. Different is scary and concerning and sometimes inconceivable, but sometimes it just is what it is and it's all okay! Big hugs!",
      "MessageIndex": 647,
      "PostDate": "18/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "BT39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
      "Content": "Sep 30, 2018 03:43PM - edited Sep 30, 2018 03:44PM by BT39 I'm starting TC x4 this Wednesday. I'm 39 and have a toddler. I thought I would be skipping chemotherapy but my Oncotype came back very high. Here we go ... Good luck to everyone!",
      "MessageIndex": 409,
      "PostDate": "30/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "BT39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
      "Content": "Oct 13, 2018 08:53AM BT39 wrote: Tigerlily318: I'm on day 11 after my first infusion of TC. I've felt pretty normal so far, though I agree the steroids and Zofran can be tough. I didn't notice anything going on them but coming off I felt my body had a lot of adjustments to do. I didn't have any nausea and am wondering if I may be able to cut back on the Zofran, or just take it a day or two after instead of three. My biggest issue so far has been a stye on my right eye that developed on day 6. First one I have ever had! I've been doing warm compresses for a week and may have to see another eye doctor today to figure out next steps. DCIS is tricky for sure. I'm 39 and my journey started with widespread DCIS. After surgery, they found a 4mm tumor which is how I ended up on four rounds of TC. That tiny tumor happened to have a very high Oncotype. At what point did your hair fall out with TC? Any eye issues?",
      "MessageIndex": 500,
      "PostDate": "13/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "BT39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
      "Content": "Oct 30, 2018 02:00PM BT39 wrote: Fairchild: I was wondering how the chemo infusions will progress as well. My oncologist actually said not to fear the worst. Though it is of course different for everyone, she said she has lots of people who proceed similar to the first, that sometimes fatigue accumulates and temporary neuropathy symptoms - but to not assume it will be awful each time. I can only hold on to that hope and hope I don't learn differently! :-)",
      "MessageIndex": 571,
      "PostDate": "30/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "BT39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
      "Content": "Nov 2, 2018 09:05PM - edited Nov 2, 2018 09:09PM by BT39 MissouriCatLady: Re: the Nuelasta Onpro. I've had it twice now and don't find it hurts at all. The little puff of air / dart noise may startle you or make you jump just because it's something new and you don't know what to expect, but compared to a blood draw, an IV, etc., I literally feel like it's nothing. It's just my opinion but thought it might make you feel better. :-) Once it's in, I don't notice it at all. How the medication makes you feel once injected is very individual. I took Claritin the first 4 days my first infusion and found I got very manageable SI and hip joint pain on night 6 and into day 7. Two Advil were fine to manage it. So for infusion 2, I took Claritin for 7 days and didn't have very noticeable bone pain, little twinges here and there. I do get a fever between 99.4-100 on day 5, caused by Neulasta. Like clockwork the first two rounds. I think it can make people feel a little cruddy, but my approach was to go in thinking it will be just fine and adjust from there. While you don't know for sure, you might do just great!",
      "MessageIndex": 597,
      "PostDate": "02/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "BT39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
      "Content": "Nov 23, 2018 09:55PM BT39 wrote: Asaka: It will be interesting to see what research emerges. Good luck with TC! I'm done with 3/4 rounds and haven't had many side effects at all - just wanted to share that good news!",
      "MessageIndex": 664,
      "PostDate": "23/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "BT39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
      "Content": "Oct 26, 2018 09:04AM BT39 wrote: I'm sure you have, but have you tried gargling and rinsing with 1 tsp of salt water and 1 tsp of baking soda in like 6-8oz of water several times a day / after meals? I have been doing that 4-5x a day. I know, things just sometimes pop up - so frustrating!",
      "MessageIndex": 547,
      "PostDate": "26/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "BT39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
      "Content": "Nov 18, 2018 06:25PM BT39 wrote: Sunocean: My surgeon did a really great job in getting me flat so I actually find my chest - though no breasts - still very attractive. It's funny, even my husband said it's not that noticeable (not having breasts). Like, not as much of a focal point as one would think. Any change is scary, for sure. I'm focusing on how amazing it is to not wear bras and other positive things though! Feel free to message me at any point in your journey if you need a pick me up!",
      "MessageIndex": 649,
      "PostDate": "18/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "BT39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276282/profile",
      "Content": "Sep 6, 2018 05:28PM BT39 wrote: Hi windingshores and others, I am also trying to decide what to do. My Oncotype came back high (54), grade 3 tumor, with high Nottingham score (8), and high ki-67 (60%). I started out with widespread DCIS in one breast, had a bilateral mastectomy, and a 4mm invasive tumor was found, clear margins and node. It seems like the recs will be to do 4 rounds of chemo and hormone therapy. It's so challenging to sort through this and the odds. It does seem like women with aggressive small tumors, esp. under age 40 or early 40s, have issues with an aggressive cancer showing up down the road. Trying to sort this out with my decision to have chemo, and if it will help.",
      "MessageIndex": 12,
      "PostDate": "06/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/857270",
      "Title": "Mammaprint and oncotype dx and need for chemo Brightness456 Meow13"
    }
  ]
}