{
  "AuthorID": "Bubblebeard…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
  "Posts": [
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "May 25, 2019 09:37PM Bubblebeard wrote: hi Stage 4 diagnised in 2018. Not de novo",
      "MessageIndex": 662,
      "PostDate": "25/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Oct 25, 2018 01:39PM Bubblebeard wrote: thank you so much for all the kind words! After reading I knew that this was the place to ask my questions :-) I have been doing the Google self torture for way too long. They did a biopsy and I am estrogen receptor-positive. So the plan was after this scan DOES show some shrinkage they were going to switch me to the combination of ibrance and an estrogen receptor blocker along with zoladex. There was also some talk about taking out my right ovary as it's the only one I have left and it would rid the need of taking zoladex. I guess the less meds the better. My friend had offered up the suggestion that I didn't feel it before because I had so much bloating and then there's the possibility that was suggested above... I didn't know it was there before so every feeling I had I probably wrote off as something else. I'm not glad that I have stage 4 cancer but I am certainly glad that I found this particular forum. I have never heard of the y-90 treatments until I came here and I will be talking to my oncologist about that next Friday. Thank you again ladies for bringing me back to reality. Being that my son is only 6 he does not really understand the seriousness of all this. And I don't think I want him to quite yet. He remembers me going through it the first time and I think he just thinks it's going to be like that. Mommy will lose her hair for a while and be sick but then she's going to get better. So I've been doing my best to act normal for him and I think that's why I end up breaking down when I'm by myself.",
      "MessageIndex": 10027,
      "PostDate": "25/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Oct 31, 2018 02:25PM - edited Oct 31, 2018 02:26PM by Bubblebeard Bad_at_usernames...  First of all you win at usernames LOL. While I was setting up my account my kid was in the bath. I looked over as I was doing the username and he had a huge bubble beard like Santa. So that's where my username came from.  Anyway, I was just transferred to a doctor Armanghani (sp. ?). I've only gotten to see her twice but she's really really nice and listens to all of my neurotic questions and takes the time to answer everything. I truly appreciated my other oncologist but she always seemed like she was in a rush whereas this doctor has a wonderful bedside Manner and from all the research I've done and what she's recommended so far she seems to be right on point. The only thing she has not brought up that I'm interested in looking into now is the y-90.",
      "MessageIndex": 10053,
      "PostDate": "31/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 2, 2018 01:13AM Bubblebeard wrote: well, I've tried and tried to sleep but it's just not happening. I go in tomorrow first thing in the morning to get the results from my pet scan and brain MRI. Seeing how the first three months of eribulin has worked. I feel like it's working, I feel much healthier than I did. But I'm terrified still, I know you guys can all relate. So I'm just sitting up watching Rick and Morty, just thought I'd pop in and say hi. I'll definitely keep you guys updated. With the good news🤞",
      "MessageIndex": 10054,
      "PostDate": "02/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 10, 2018 02:35AM Bubblebeard wrote: Thank you for your replies everybody! I thought I had seen other people with other mets get the y90. Like I said I booked a second opinion ...when I go talk to that oncologist, who is very experienced, hopefully he can point me in the right direction.  JFL: i am at Moffit, and its a fantastic place that I have had very few bad experiences at, however they just lost a major oncologist in the breast clinic and I think they are scrambling to get all these patients who are already established taken care of. Being that I am at the premiere facility in the area, if not if the state, unless the other doc points out some big errors... I think I'm gonna try to switch to another oncologist in the breast clinic at Moffit. It will take a few months to get me in with somebody but now that she's actually started me on treatment I'm OK with waiting if I have to. Really if there's anybody in the area that's going to do something it's going to be somebody at moffit. However, I feel that the doctor I have did not fight for me. I know my old oncologist would have if she believed I was a candidate. This doctor told me last week she thought I was a candidate but this week totally brushed it off. After she started me on the treatment today I thought about canceling the 2nd opinion but my mom told me to go ahead and keep it, she said ...you're stage 4 so you might as well have a doctor that's completely unconnected to the situation look at it. A second set of eyes is always a good idea. Also just because I got this situation resolved with her doesn't mean another one won't come up in the future and she's already shook my confidence in her too much.  I have no experience with blood transfusions but sending you a big hug. Hope everything resolves, definitely keep us updated💜",
      "MessageIndex": 10097,
      "PostDate": "10/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 12, 2018 01:11AM - edited Nov 12, 2018 01:24AM by Bubblebeard HLB... How incredibly frustrating for you! At my last doctor's appointment I almost checked out not feeling comfortable with our plan. She wanted to wait 5 weeks to start my AI because she needed follow up blood work or some crap... When I expressed that I was not comfortable waiting 5 more weeks to start treatment she gave me the same \"It will be fine\", \"OK\", \"yeah\", \"I understand how that's frustrating\" crap. I just could not imagine going home and sitting around for 5 weeks stressing and doing nothing.I had a moment of clarity and sat down near the check out and told them I wasn't gonna leave until I talked to the doctor again. I talked to her about 15 minutes later and miraculously I started my AI already ( I'm on my 3rd day, she let me start at the same day that I put my foot down) and I'm just waiting for the pharmacy to acquire my Ibrance. Like JFL said, you really have to be your own advocate. This forum has taught me so much in just a few weeks. I had never heard of Y90 before coming here because nobody ever brought it up to me before. Google can be so incredibly confusing. Anyway, I hope you get it sorted out. I agree with the call until you're in annoyance Tactic.",
      "MessageIndex": 10128,
      "PostDate": "12/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 14, 2018 09:19AM Bubblebeard wrote: HLB... Thank you so much for the tip! That hospital is only that's only about an hour and a 1/2 away from me! I will start looking into him.  It is a big tumor but I don't see why we shouldn't at least go for it… if they want to shrink it some more using something else and then do the Y90 I'm down for just about anything. It is a big tumor, but it shrank very quickly on the chemo (half the size in 3 months!). But she just switched me over to hormonal and targeted therapy. I'm on the fence about how I feel about that. thus, the 2nd opinion. Along with her being completely clueless. Tennille... I hope you start feeling better soon! You are not the 1st lady to let me know that I shouldn't be giving up. The only other mets I did have were extremely small and one was in my sacrum and 1 was in a vertebrae. They're both sclerotic, she told me that meant the chemo worked.",
      "MessageIndex": 10165,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Oct 26, 2018 08:51AM Bubblebeard wrote: JFL,  I had heard that from so many women and never felt it myself... I really hope that is what I'm feeling (that this feeling is the treatment killing this nasty cancer). This morning I woke up with kind of a dull ache in the area , I can still kind of feel what I think must be the tumor. I had not thought to be grateful for just having one big tumor instead of diffuse ones but that's a great point.  I'm somewhat anxious also because they took me off the zoladex when they found this tumor and started me on the chemo but if there is shrinkage and I'm going to be starting Arimidex or something similar next Friday I feel like I should have been getting my zoladex injections to prepare me for that ( thanks to chemo brain this did not occur to me until last night, and I know it's unrelated but how annoying is chemo fog? I used to be so sharp and I feel like an idiot now). I know that chemotherapy kind of shuts down your ovaries but I'm definitely not going through menopause... I haven't had any of the hot flashes or symptoms that I had when I was on the zoladex. I called my nurse today to see if I could at least get the injection Monday when I went in for the scan so I'm a week ahead so she is asking my doctor... you really do have to be your own Advocate don't you? This is all in preparation for what I hope is an improved scan... If not at least stable.  I'm so sorry to hear about your diagnosis while pregnant, I can't imagine. What a miracle baby . . I know that there are other women in my situation which gives me hope but at the same time makes me sad because I don't want anyone to be feeling the way that I'm feeling now. Your little one is such a blessing but I know how scary it must be with them being so young.  My little guy was almost 4 when I started my treatments, he's almost 7 now and old enough to talk about it and he really seems to only remember bits and pieces. He remembers that I had no hair and then I had to wear wigs. He remembers the surgery a little bit, but not much I don't think. And I think that's about it. I know he looks at me like I can beat anything, so I just have to keep trudging forward. In a way I guess I'm lucky... I have the biggest tumor that I've seen on any of these forums but my liver enzymes are normal and I'm really not sick at all. Except for the chemo side effects at the moment.  I'm trying not to dwell on it too much because there's really nothing I can do at this moment I guess. My pet scan and MRIs are on Monday so since I have no other symptoms (slightly decreased appetite... But that's been going on since the beginning) just trying not to think about it over the weekend. We're taking my little guy to his schools Trunk or Treat tonight and I'm just trying to enjoy my family .  Much Love, Jenna ",
      "MessageIndex": 10030,
      "PostDate": "26/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Oct 27, 2018 01:01AM Bubblebeard wrote: pboi... I was really surprised they were already talking about anti-hormone tx already as well. I was expecting to be on chemo for quite awhile and although I don't like it, I am tolerating it well. Another patient at Moffit, I don't know how much truth there is to this, says that often large tumors shrink quickly. I'm hoping that's the case but you never know.  I am learning a lot just from this one thread and I have so many more questions to ask my oncologist on Friday. Why have I not started on zoladex already if she wants to even consider anti-hormone tx? It doesn't hurt to be on zoladex and chemotherapy at the same time so where is the hesitation? What percentage of shrinkage is she looking for before switching me to anti hormonal? Why have I never heard of y-90?  Maybe it's because clinically I'm doing so well... That is one thing that I have going for me. And my blood work is always normal. My elk Foss is elevated but it always has been. Since before I was ever diagnosed. My primary says it's a sign of information so God knows. I have so many autoimmune disorders.  here's the thing, and this is what I told my oncologist, I'm willing to do anything. I do not mind being sick to stick around for a few more years for my kiddo. I want to be here for my friends and family, and the holidays, and all the milestones. My son is starting to read, I'm not ready to go. I told her all this, she said she was going to look into trials and we would have a long discussion at our next meeting. And we sure will LOL again I'm so thankful to have found you ladies. You give me information and Hope. ",
      "MessageIndex": 10032,
      "PostDate": "27/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Oct 30, 2018 05:04PM Bubblebeard wrote: hi raven, I don't want you to think that this is the case with you but this is what happened with me.  I actually found my liver mets because of the tumor fever. I was spiking at night which made no sense and honestly I thought I was septic. Went into the hospital had a CT scan and they found the masses in my liver. The way they explained it to me was that the tumor releases certain compounds that caused the fever but they did not tell me if those compounds are present when the tumor is growing or shrinking or any of that. They basically said it was diagnosis of exclusion. They did all the same things with me... Blood cultures and cbc's and urine cultures and everything else. Everything was normal except the fever. My tumor fever went away when I began treatment. I've only been on treatment for 3 months... I just had my follow-up pet scan yesterday so I don't know if my tumor is actually shrinking or what it's doing but it feels like it is.  When I did go and research the tumor fever it seems to be something that's common with liver tumors but definitely make sure that they've ruled everything else out.  Sending lots of love  ",
      "MessageIndex": 10050,
      "PostDate": "30/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 13, 2018 02:33PM Bubblebeard wrote: JFL... I had that feeling the other day, That our lives are so far from normal and nobody really knows what we're going through. Normally I would have gotten my chemo towards the end of the week and Monday and Tuesday's my son would have went to aftercare at school bc I usually felt awful. I didn't get my chemo because they've switched me over to hormone therapy and targeted therapy which is great. I did have doctors appointments that day but I told my son I would let his teacher know if he needed to go to after care. But my little six-year-old was so used to going that he just went. Part of me is proud of him because he took it upon himself to know where he usually is. Part of me was so sad that he had to remember that at all. But when I walked into the front office to get him and explain to them he never needed to go to aftercare and ask if they were gonna charge me for the day… I got all sorts of attitude and the run around for 15 minutes, Before the condescending remark that I should make sure that my child knows where he needs to be. I kept my cool but I felt like reaching over and shaking the woman! I don't know why people need to be reminded to be kind to others, it's been said a million times but it's true… you never know what somebody else is going through. I wear wigs and make up so it's the same with me, nobody really knows unless I tell them I also want to say… you are superwoman! I got exhausted reading that",
      "MessageIndex": 10145,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 13, 2018 04:58PM - edited Nov 13, 2018 08:25PM by Bubblebeard I've often thought about how this would be different if I didn't have my son. Most of those thoughts come from guilt as possibly leaving him much too soon, despite the fact that women are living longer and longer with the diagnosis. I think I would be a lot more open about it. So much of what I do is to continue a sense of normalcy for my family, a lot of it's not really for me. At the same time if I didn't have my son I don't know if I would be as strong.",
      "MessageIndex": 10150,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 14, 2018 07:57AM Bubblebeard wrote: Tennille... So much yes! You just described exactly where my darkest days have been. When I had to rely on someone else to take care of my kid for his very basic needs. In my case it was my mother, as I only have one small child with no older siblings. But I spent many hours crying listening to him out there playing and running around while I laid in bed. I'm hoping being on hormonal and targeted therapy will make my life somewhat more normal. Sending you hugs all the way to Australia . I bet we're both doing a way more awesome job than we even realize 💜",
      "MessageIndex": 10159,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 15, 2018 01:32PM - edited Nov 15, 2018 01:34PM by Bubblebeard omgoodness Lynne! I cannot imagine being awake for a port procedure… I was completely knocked out for mine. When I had it the 1st time around it really made things so much easier. I never used the numbing cream but that's because nobody ever offered me any lol. But it really wasn't any worse than a regular needle stick and 99.9% of the time they get in with one poke. This last time I went to go get chemo I think I got poked 5 times before they found a vein they were happy with. So I went and got my second opinion. I'm so glad I did! Not because I'm on the wrong treatment, he thinks we're headed in the right direction which is definitely reassuring. But… he made sure I was aware that there is no rule that says I have to go to a radiologist at Moffit. He gave me a referral to the interventional radiologist that he uses and thought that the y90 or radioembolization are both very good options for me. He knows my old oncologist, and word is she will be back at Moffit in January. If that's the case my gut is telling me to stay where I am. She knows my case inside and out and has always been fantastic. Now that I know that I'm on the correct treatment and I have the referral to talk to somebody about y90 I feel a lot better. If I do hear that for whatever reason she's not coming back in January… I think at that point I would just switch over completely to Dr. Wright. There are so many benefits to being at a place like Moffit. One huge benefit is they do a lot of research there so if it ever comes to it and I have to start looking at trials that's where I wanna be. But over all it was a really good day. I am very happy with the outcome and grateful for this forum and all of you lovely ladies because if not for you I wouldn't have ever done any of this!  On a second note I've been arguing with a mail order pharmacy about my insurance and getting a pre authorization for Ibrance. I didn't make a stink at the doctor's office just to get held up by the pharmacy lol. Well today I transferred the prescription over to the pharmacy inside of moffit and walked out with the Ibrance in my hand. So I will be starting that tonight, finally  And now it's lunch time and I'm exhausted already lol.",
      "MessageIndex": 10177,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Oct 30, 2018 02:27PM Bubblebeard wrote: skyfly  Unfortunately while I have been going through this craziness of cancer my oncologist has had a hell of a year also. She lost her mother to stomach cancer a few months ago and then her husband was in a terrible car accident and is now brain dead. Before that he was a cardiologist that worked at the same hospital as my father. So she has gone on a break of course, and obviously she needed to take that time. However that left all of her patients being transferred to other oncologists at Moffitt in Tampa.  I got switched to a fantastic doctor with great reviews so I don't have any complaints about that, however everybody is so booked that I couldn't get an appointment until Friday. My original appointment was Wednesday morning with my original oncologist.  In hindsight this might actually be a little better for me, my son is 6 years old and we're going trick or treating Wednesday night. I have every reason to believe that my scans will be good, but God forbid they're not I would have hated to ruin one of the holidays I know that I will get to be here for... If you know what I mean. I'm really a positive person. I have a lot of good reasons to believe that I will survive this for quite a while. I have the estrogen receptor-positive thing going for me so hormone treatment is an option. Physically I have responded to treatment really well. I went from being a very sick individual to pretty much normal... Except for the chemo side effects. I just feel like now I'm taking each holiday, each day really, and savoring it because I never thought I would be in this position at 37 and I will take nothing else for granted.  I am looking into fasting as we speak, what I'm finding and what you guys were saying makes complete sense and I think I'm going to jump on the fasting train. And now thanks to Z I will be looking into oxygen therapy as well :-). I will definitely keep everybody updated when I get my scan results. In the meantime I'm going to do my very very best to just enjoy Halloween",
      "MessageIndex": 10048,
      "PostDate": "30/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 2, 2018 02:47PM - edited Nov 2, 2018 03:36PM by Bubblebeard Ok... I got pretty good news today :)  My pet scan shows that pretty much all of the places that lit up 3 months ago besides my liver are now Either gone or they are showing what they believe is stenosis. Meaning the chemotherapy has worked in those areas.    I guess they don't measure things the same way on a pet scan as they do you on a CT scan so I can't tell you exactly how much my tumor has shrunk… but I can tell you that it has shrunk \"markedly\" but its still there. I can say for sure that my mood has gone from scared as h*** to grateful and hopeful.  My oncologist said after reviewing my case and talking with the Tumor board they feel confident that my best bet at this point is targeted therapy and hormonal therapy. I guess it tested really really sensitive to estrogen and they seem to think that will be the best way to continue its shrinking.  Anybody in here on these zoladex/ai/Ibrance combo?  And thanks to all the ladies who have been so supportive and praying and thinking about me, you are so appreciated  Edited to add, my doctor is talking to an interventional radiologist this week about the possibility of Y90 for me. You really have to be your own advocate because she didn't bring it up, I ended up asking her and then after she thought about it for a minute she seemed to think it was a really good idea. So fingers crossed and thank you to everyone on here! I had never heard of y 90 before coming on this forum",
      "MessageIndex": 10056,
      "PostDate": "02/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 10, 2018 01:08AM Bubblebeard wrote: thank you shetlandpony! I will check it out. I used to just go along with what the doctor said but I'm learning quickly that I have to stand up for myself and I really feel like this is a good thing for me to try. As of right now despite what my doctor says the disease is really only in my liver. I would love to at least give it a try or have somebody who knows what they're talking about explain to me why I can't have it, you know?",
      "MessageIndex": 10093,
      "PostDate": "10/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 14, 2018 08:08AM Bubblebeard wrote: On another note, I am going for my 2nd opinion tomorrow with who is supposed to be a really fantastic doctor in Tampa. I'm going to be bringing up the Y90 again. My doctor at Moffit kind of blew me off and I feel like this could be something that would help me a lot. I have a very large tumor, the only active tumor left after my last pet scan has decreased in size quite a bit but it's still around 10 cm. I don't know if the size of that tumor would be a bad thing for the Y90 but since all my disease is in the liver right now I don't see why we shouldn't go for it. So fingers crossed he can get me in to see an interventiomal radiologist at the very least. Even if I end up staying with my current doctor I need to talk to a different radiologist. The reasons that she gave me for not being a candidate, having prior mets to very small places in my bone and inflamed lymph nodes on my previous pet scan, was why I could not have the Y90. Like my life is less worth it because I had previous mets. Not to mention I know that's not correct... i have seen so many women on the site who have had this procedure done with other locations of metastasis. I'm getting more and more comfortable being the pushy patient. And if I have to that's what I'll do with this. You guys are all a bit more experienced than I am. I know I need an interventional radiologist to do this for me. Any tips on what I could say or how to bend these people to my will lol. I know I'm not a doctor and I know I should not be coming up with my own treatment plan. I have just lost all faith in this oncologist that I have. She didn't know the very basics of the hormone medication, stuff I knew from years ago. She also has absolutely no urgency. I have a 10 cm mass that I can feel sitting under my ribs. Feels like there's a softball under there and she's like \"OK… I'll see you back in 5 weeks after some more hormone testing\". I'm ready to lose my mind",
      "MessageIndex": 10160,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 14, 2018 11:06PM Bubblebeard wrote: Thanks for all the advice and encouraging words! I will definitely be back on tomorrow to let you guys know what the new doctor says. I'm going to try to call Shand's myself. Not only is this other oncologist not familiar with Y90, she doesn't seem that familiar with anything. She's contradicted herself so many times that I'm just not comfortable in her care anymore. It's a tricky situation there with my insurance. They turn down a lot of stuff and being at moffitt they just write it off, I have never got me one Bil from them. I don't have the money to pay for stuff myself so switching to a new oncologist is a bit scary. But I only have one life so I have to see what my options are. As far as going off the chemo, I thought the same thing. The way she explained it to me was that my tumor was so reactive to estrogen they thought this was the way to go. Since I'm not comfortable with her I pulled aside a couple of nurses that have worked there under my other oncologist and they are extremely experienced. They both seemed comfortable with this treatment plan, which was some reassurance. I'm very nervous about this appointment tomorrow but excited as well. Either hes gonna tell me I'm on the right track which is great… or hes gonna start pointing me in the right direction. Either way I've heard great things about him",
      "MessageIndex": 10173,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 26, 2018 12:05AM Bubblebeard wrote: Aadd24...  1st I just want to say that I'm sorry you have to be here. I'm fairly new here myself, but these ladies on this forum are so well informed. Your moms story sounds very similar to mine, I was stage 3 and thought I beat it. I was on arimidex/zoladex since 2016. Went to the hospital with some bloating, I thought I had appendicitis or I was septic. That's when they found my liver mets. I'm not familiar with that chemotherapy, it sounds like they're doing everything they can to get her symptoms under control and I'm hoping the oncologist can shed some light on this for you tomorrow. It is frustrating having to wait several months, but the 1st three months for me went by very quickly. I know it seems like it's forever, but that 1st scan comes up quickly and then there's anxiety over that 💜 I don't know what kind of cancer your mom has… if it is estrogen receptor positive, I'm assuming it is since they had her on an AI. There are so many treatment options for estrogen and progesterone positive cancers. Quite often they start us off on chemo to get things under control and then I've seen a lot of women, depending on their clinical situation, get switched over to hormonal and targeted therapy. I had also never heard of something called Y90, it is done by an interventional radiologist… basically they go into the liver and treat it from that angle. I'm personally researching that and looking into an interventional radiologist for myself, Despite the fact that my oncologist does not seem too excited about it. I've seen a lot of women on this particular forum have wonderful results with it and if I've learned anything in this journey it's that you have to be your own advocate. Start doing research and asking questions now… sometimes something you mention in the Room can change the course of treatment. I'm sure one of the more Informed ladies will chime in soon. But know that we are all here for you if you ever need to ask questions or just vent. Sending you and your family hugs and love Jenna",
      "MessageIndex": 10241,
      "PostDate": "26/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Oct 25, 2018 01:41PM Bubblebeard wrote: pboi....  I am sorry to hear of your similar situation. It's so tough with little ones. But I was kind of in the same spot as you, I hadn't seen anybody on here mentioning a tumor anywhere near my size and it completely freaked me out. Hoping it's not that big when I go check it out on Monday and yours is shrinking as we speak",
      "MessageIndex": 10028,
      "PostDate": "25/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Oct 29, 2018 05:02PM Bubblebeard wrote: hi raven4...  I had a very similar experience when I was hospitalized. It was when I actually was diagnosed with the liver Mets but I would run a normal temperature all day and then spiked a fever at night. They told me it was what was called a tumor fever.  If you look into it a little bit online it has a pretty distinct pattern usually. I wasn't allowed to take Advil so they just had me using cold compresses under my arms to bring my temp down. I don't know if this helps or not but you're definitely not alone. After my first round of chemo I stopped getting the tumor fever so I'm not sure exactly what it's related to  Best wishes",
      "MessageIndex": 10043,
      "PostDate": "29/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Oct 29, 2018 11:48PM - edited Oct 29, 2018 11:49PM by Bubblebeard well I had my pet scan and my brain MRI today. Now I get to wait till Friday to find out the results so my scanxiety is through the roof. Has anybody else felt any discomfort after a PET scan. I'm having some abdominal pain and fatigue but that could be 10 million different things 😣 I only asked about the Pet Scan because I felt so good today going in to get it done and now I'm just exhausted and feel pretty crappy",
      "MessageIndex": 10046,
      "PostDate": "29/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 5, 2018 09:31PM Bubblebeard wrote: Good evening ladies… I am supposed to be starting my hormonal and targeted therapy this Friday. I will be on Ibrance, zoladex, and an AI.  I don't know if you guys have been following along but my original oncologist is no longer working because of personal issues so I was switched to a new oncologist recently. I had been told by my previous oncologist that the zoladex needed to be in your system for 3 weeks before starting an aromatase inhibitor. This oncologist is telling me that I can start them both at the same time. anybody ever heard of this? I am pre menopausal Is it weird that I'm afraid to go off the chemo? They were happy with how much progress I had made on the chemo in 3 months and my on colleges seems really positive about this drug combination. Any other ladies in here on that combo? Let's hear some good results stories!",
      "MessageIndex": 10070,
      "PostDate": "05/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 14, 2018 09:20AM Bubblebeard wrote: Candy, you don't owe me any apologies! I understood what you were saying. We all handle this differently and that's completely fine. So although the apology wasn't needed, it is accepted. And I'm sending you love as well",
      "MessageIndex": 10166,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Oct 25, 2018 01:23AM Bubblebeard wrote: hey there everybody, newbie here. I've been reading a bit and I seem to be joining at such a sensitive time, I was so sorry to read about your friend Babs. She sounds like a truly amazing woman.  I am 37 years old... My son is going to be 7 in January. I was diagnosed with liver Mets the beginning of August this year after being disease free from stage 3b (er+ , her-). I went through the gamut the first time... AC and taxol, bilateral mastectomy with lymph node removal on the left side, and radiation on the left. I continued on hormone therapy with the combination of zoladex and Anastrozole. I did not react well to the Anastrozole so after a year on that they switched me to tamoxifen.  After finding the liver metastases and confirming with biopsy my oncologist immediately started me on eribulin. I have done 4 rounds and each time on my week off I felt fantastic. I felt like the tumor was shrinking, I looked good again and I felt good again. I am on my week off and about to have scans Monday and I feel great. Except for one thing. My liver tumor is 22 + centimeters. Well it was, I'm hoping to see some shrinkage on my scans. I guess my main question is kind of odd... I couldn't really find anybody describing this anywhere. And it just may be because my primary liver met is so large. But the past day or so it's felt like I have a softball sitting under my ribs. I had never felt the tumor before and I'm absolutely terrified this means that it's all of a sudden growing. just to be clear I'm not having pain on my liver at all, I can just feel it inside me when I'm moving around. I am in a really dark place right now to be perfectly honest. I know most of us are at the beginning. I wish I had the positive attitude that so many seem to show. I am crying on and off with the thought that my little boy won't have me around anymore but at the same time I see all these women living years and years. Any and all advice is welcome and anyone who has any words of wisdom about what I'm feeling under my ribs would be greatly appreciated. It's caused me two panic attacks today already.  So that's the beginning of my stage 4 story. I look forward to learning from all of you beautiful Warriors",
      "MessageIndex": 10021,
      "PostDate": "25/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 6, 2018 12:39AM Bubblebeard wrote: I am actually in the middle of trying to set an appointment with OB gyn at moffit to have the one ovary I have left removed. I figured the side effects from a laparoscopic surgery would be much less than that of Zoladex or anything else. Until they get that sorted out they were going to put me on the Zoladex.  The plan was always to move me over to the Ibrance and hormone therapy when the oncologist was happy with my pet scan. Clinically I was responding to the chemotherapy very very well so we planned to start the targeted therapy but had chemo on the back burner in case we were not happy with my 1st pet scan at 3 months. Well, I guess she was happy enough. Like I said in an earlier post, my scan results showed that the main tumor shrunk markedly on the chemotherapy And any other suspicious spots are gone. When I started the chemo my other oncologist made it very clear that she wanted to get me on this particular chemo initially to get things under control. She's also looking into the y90 for me. Last appointment she was supposed to talk to an interventional radiologist and we should be discussing that again Friday to see if I'm a candidate. After the 1st time I went through this with the stage 3 cancer and started on hormone therapy, I absolutely hated it. It was an everyday thing, that while it was not as rough as my chemo side effects, I felt like it was never going to end. I'm 37 and I had every side effect imaginable from arimidex and Zoladex together. So I'm actually not really looking forward to this but It's not chemo and my doctor seems very confident that this is the way to go",
      "MessageIndex": 10073,
      "PostDate": "06/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 7, 2018 05:37PM Bubblebeard wrote: I am magine everybody's different with their children. My son saw me go through stage 3 cancer already.  We explained to him that the cancer is back but we did not explain that it could possibly be terminal. And the reason for this is simple, people with stage 4 breast cancer can live a really long time and I didn't see any point in scaring a six-year-old when I may be around for another 10 years And we can have that discussion at a later date. If things start to decline than I think I would have the talk with him about the possible terminal nature of this disease Sending big hugs to you and your sister ❤",
      "MessageIndex": 10076,
      "PostDate": "07/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 10, 2018 12:48AM Bubblebeard wrote: Hoping for awesome outcomes with your upcoming scans ladies!  Today I began the Zoladex/Letrozole/ibrance combo. Tell me your stories ladies! I know the basic side effects like hot flashes and possible anemia but what have your experiences been? Just looking for any input. I always get a little nervous when I start new medications.  Also anybody with experience with the Y90… when I talked to my new oncologist today she said that the interventional radiologist told her I was not a candidate for the Y90 because I had previous mets in my bone ( She only told me this after I questioned her and it almost looked like she had forgotten all about it). My last pet scan showed they were all sclerotic and no longer taking up the dye. I could have sworn that I read on here that there were other ladies that received the Y90 when they had more than just liver mets. I'm very frustrated, Why is my life worth less than somebody who doesn't have previous metastasis somewhere else? I don't understand what one has to do with the other and she was very very bad at explaining it to me. She's done some other things that are starting to make me question her ability. I was only switched to her when my main oncologist had to leave for personal reasons. I feel like I'm more well versed in the hormonal medications then she is sometimes. She wanted to make me wait another 5 weeks to start all my medications today because they forgot to get estrogen levels on me last week when I was there. I refused to leave until they started me. There's no way I was going to wait another 5 weeks with absolutely no treatment at all. My a tumor grew to 22 cm within less than 6 months And with what they call a markedly reduced tumor and all of my other metastasis gone, I don't want to backslide. In the end I won and I got the medications and they went ahead and drew the blood again for me today. Made an appointment with another onc today for a second opinion. I only have one life and I want to make sure we're headed in the right direction with my treatment. Regarding the Y90, she couldn't even tell me who I should talk to. Should I try to make an appointment with a radiation oncologist? Where would you ladies go from here because I feel very lost right now 😕",
      "MessageIndex": 10091,
      "PostDate": "10/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 10, 2018 01:09AM - edited Nov 10, 2018 01:13AM by Bubblebeard",
      "MessageIndex": 10094,
      "PostDate": "10/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 13, 2018 04:52PM Bubblebeard wrote: Most of the wig and make up is to make myself feel better. It was much harder for me to lose my hair than it was to lose my breasts as weird as that might sound. And I feel so, for lack of a better word , naked without my eyebrows and eyelashes  Another is that my six-year-old son is having a little bit of a hard time dealing with the change in my appearance again. This is the 2nd time we've been through it and hes older now. His friends are asking him questions that he can't answer. When I go up to the school I almost always look \"normal\". If I'm tired or I don't feel like it I have no problem just going out with a hat on and no eyebrows lol. But just to make his life a little easier, I do tend to not be so open about it at the school. And that is different for every family, some kids handle it better than others. My son has his own special issues",
      "MessageIndex": 10147,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Bubblebeard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281648/profile",
      "Content": "Nov 13, 2018 08:28PM Bubblebeard wrote: Hey Lisa, I'm not familiar with that particular chemo but I can tell you that my liver enzymes jumped up when I started my chemo as well. My alk phos has always been high for some reason, they said that could be a general marker for inflammation also. But my ALT and AST went up and then what came back down when I went off the chemo.",
      "MessageIndex": 10153,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    }
  ]
}