{
  "AuthorID": "budrfligal1…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182241/profile",
  "Posts": [
    {
      "AuthorID": "budrfligal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182241/profile",
      "Content": "Jun 17, 2014 04:27AM budrfligal13 wrote: Chrissy and Dlb thank you!!!",
      "MessageIndex": 2489,
      "PostDate": "17/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "budrfligal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182241/profile",
      "Content": "Jun 16, 2014 11:32PM budrfligal13 wrote: Hi ladies. I'm new to this forum. I have so many questions and concerns. My oncologist said she will just do blood tests now to check cancer markers. I'm so afraid of cancer coming back somewhere else that I'm wondering why I won't get full body scans, MRI's, etc. I had BMX so I don't know if I'll need mammograms or what!!! My lymph nodes were clear at the time of surgery. But ladies, every cough, every upset stomach, every headache Scares me. I start to think its spread! I'm trying not to let this type of thinking last too long, and I've come a long way, trust me. But I can't help but feel like I should be doing more as far as monitoring goes. Then again, maybe not. Maybe I can relax in knowing that my scans last year showed no cancer anywhere else. And that the surgeon woke me up and said the nodes were clear and just two were removed. Maybe I AM okay!!!! It's like I'm afraid to think that I'm cancer free. It's scarier to say that than say \"I've got breast cancer!\".  Wow, this is crazy. I'm 1 year since diagnosis and having implant exchange on 7/25. ",
      "MessageIndex": 2484,
      "PostDate": "16/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}