{
  "AuthorID": "buggy1996",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124914/profile",
  "Posts": [
    {
      "AuthorID": "buggy1996",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124914/profile",
      "Content": "Jun 8, 2011 10:04PM buggy1996 wrote: Thank you so much for your reply!! I am just having a difficult time figuring out what is best to do for me.  Protocol would be lumpectomy with radiation or mastectomy no radiation.  My medical oncologist feels there may be some oncological benefits to radiation to the chest wall.  She is just tyring to be as aggressive as possible.  Three radiation oncologists sad that mastectomy would eliminate the need for radiation, but why go down that path now.  My surgeon feels there is no cancer left in the breast.  I have basically had a partial mastectomy and implant replaced with Alloderm.   Now I just feel I could go back and do the full mastectomy and avoid radiation.  I just dont understand how much more benefit radiation could have in a metastatic person who has NED. ",
      "MessageIndex": 2,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770047",
      "Title": "Mastectomy/radiation/implant buggy1996 buggy1996"
    },
    {
      "AuthorID": "buggy1996",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124914/profile",
      "Content": "buggy1996 wrote: I am stage IV at initial diagnosis in june with one liver mass that resolved itself after 9 rounds of TCH. There is no metabolic activity to the one mass and it is now what is thought to be scar tissue. The original surgery had negative margins, but the invasive cancer was gone. There was just DCIS left, but due to the aggressive nature of the cancer her+++ we went right into chemo and decided a rescission would be after I was done with chemo. Three weeks ago I had a recession with no cancer not even DCIS and basically a partial mastectomy with a replacement implant and alloderm. My cancer was originally in the fold of the breast. My problem now is I have met with the radiation doctors and all have said that I obviously need radiation with no boost. No boost due the fact there is only implant and no tissue in the original tumor site. All three radiation when I asked said if I ended up going down the route of a skin sparring/nipple sparring mastectomy I would not need radiation. They all feel health benefits are the same lumpectomy/radiation versus mastectomy. My medical oncologist feels that radiation in my case may benefit the chest wall since I had no node involvement and she has been as aggressive as possible given my young age of 33. With that said I followed up with my surgeon and feels there is absolutely no cancer in my breast, but the mastectomy with skin sparring if that is what I want wouldn't be much more than the partial lower pole mastectomy I have already had. I am a bit confused because I realize I am stage 4 and responded very well to chemo, margins clean and really feel radiation since I have an implant is going to be a cosmetic issue and that can be more controlled through a nipple/skin sparring mastectomy. Sorry for the long tangent and explanation. I am just not sure if radiation is the way to go. I feel that if I choose a or b, my health benefits would be the same, but I can't get out of my mind what my medical oncologist said, that radiation can reach parts of the chest wall and that could be beneficial. all three radiation docs and surgeon ( he is director of st. Johns Santa Monica) great dr. Feel that it would be such a radical approach and radiation would be a breeze and I will be fine and the implant can be fixed. I feel it is so subjective to what is easier and what is considered radical. My surgeon is fully supportive since he feels there will be no cancer left after there being none in his rescission. Anyone have an opinion!! Greatly appreciated. If anything, thanks for listening!!! I really need a better understanding of recovery from mastectomy that is skin/nipple sparring. if Anyone did immediate straight to implant if they already had stretched skin from an original implant. Also, health wise does anyone Agree radiation may just be the best way to go. I am not afraid of surgery or of radiation, just want this behind me if at all possible with the added benefit that maybe I could have a nice cosmetic outcome. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770047",
      "Title": "Mastectomy/radiation/implant buggy1996 buggy1996"
    }
  ]
}