{
  "AuthorID": "bunnysnap",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194601/profile",
  "Posts": [{
    "AuthorID": "bunnysnap",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194601/profile",
    "Content": "Oct 10, 2014 01:12PM bunnysnap wrote: Hi - I tried posting this last night but it's not here so apologies if it appears twice in a couple of days... Hey lady - hope you are well and hope this is helpful. I had a DMX 01/10/13 and immediate reconstruction. I had what can only be described as a 'watery balloon' of a seroma immediately afterwards and this continued for months. And months. I have posted on this site a lot about it so please do 'find' me and my posts. It filled my life (and sports bra!) It was wobbly, noticeable and made me miserable. I poked it, wobbled it, examined it from all angles and cried over it on a daily basis. My consultant drained me on a weekly basis - anything between 90 and 250mls and the nurses would look at me, with one eyebrow raised, shaking their heads and muttering that this draining process, whereas I was totally compliant, if not actively encouraging, was only delaying the inevitable; the inevitable being that my body needed to learn to absorb the seroma on its own. They were right. Your body WILL learn to absorb the seroma fluid. But I had to go along with / hate / ignore my body collecting the fluid before it started happening. I stopped being drained in January 2014 and it was June 2014 before I looked in the mirror one day (which we all either stop doing for weeks at a time or do it every other hour yes?) and thought, 'oh'. The fluid had gone. I had poked at it, wobbled myself in the shower etc but not really looked. And it had gone. It is not encouraging, I know, to read posts and think 'But I want it gone NOW! How much longer does this 'journey' (thanks X-Factor for that expression!) go on for??' But try and be patient (so hard), it gets better. Seroma is a pointless, upsetting, unreasonable side affect of a life-changing experience. It's very annoying and shouldn't happen when we are already struggling with everything else. But..At the risk of being an irritatingly positive person (!), remember this.. Be proud of your Tic-Tac-Toe appearance.Your irritating and frustrating fluid is a symbol of you winning, not losing. Stay in touch - there will be a day when you smile because it's gone and post a mesage like this to someone else. Honestly :-) I will have my fingers crossed for some positive developments for you. Stay strong Seroma Sister. Love, Another Seroma Sister xx",
    "MessageIndex": 7,
    "PostDate": "10/10/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/64/topics/824889",
    "Title": "Unusual Seroma issue ilytib tangandchris"
  }]
}