{
  "AuthorID": "burner",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251047/profile",
  "Posts": [
    {
      "AuthorID": "burner",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251047/profile",
      "Content": "Oct 24, 2017 04:52PM burner wrote: NotVeryBrave- I don't feel \"normal\" yet. Had immediate reconstruction with tissue expander and then implants, so my 3 month post-recon check-up is coming soon. I'm in physical therapy now since they are worried about the scar tissue causing a frozen shoulder. I still don't sleep well because I worry about the implants rotating and/or moving into my armpits. And my mastectomy side always feels tight / uncomfortable. I wince when I try to open a door or open a bottle/jar and my pec muscles start to compensate and help my arm/hand strength. I think the implant on my native side bottomed out, so I'm definitely asymmetric. And I wonder whether I'll ever have inframammary folds ever again... the implants still just sort of stick out there. Aesthetically, all the doctors tell me that I had great results, but there are many days where I feel greedy and wish I looked \"normal\". The lipo for fat grafting was some of the worst pain I've ever experienced, so I am skittish about doing more fat grafting to correct the ripples and edge asymmetries, but I know I will do it, despite my abdomen and back being lumpy and scarred (I had blistering and post inflammatory hyperpigmentation). The fluffy mullet and effects of chemopause are more disheartening than the breasts, frankly. But! My energy has returned along with my eyebrows and about half of my eyelashes, so on a good day, I suppose I look normal - just far more haggard and older than I think I should look. I know I had relatively few complications with my surgeries, but I can definitely empathize with you. I am thankful for everything I've been given- and yet, still wish for more. And then there is a part of me that goes to dark places and thinks, \"what's the point of working so hard to get cosmetically back to as close to normal as possible if the cancer comes back soon?\" It's a horrible mental game to play over and over in my mind. All the best with your check-ups - I hope that the tests are all negative and I am raising a virtual coffee mug/wine glass/whatever you prefer in solidarity of being tired of everything related to this disease!",
      "MessageIndex": 442,
      "PostDate": "24/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "burner",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251047/profile",
      "Content": "Jun 11, 2017 03:02PM burner wrote: I hear you! The biggest surprise to me were the new SEs I developed PFC. I never had neuropathy or nail issues until after I completed my 6 rounds of TCHP. And then that's when I finally told the nurses that yup, I had finally gotten all the SEs, head to toe, that they listed. I was surprised by how many SEs I got hit by as well, having been in great health. Most were just annoying - not enough to land me in the hospital - but enough to severely impact my quality of life. Thankfully, I'm starting to notice *some* recovery, finally- almost 2 months out. The tinnitus isn't AS frequent, and my watery, itchy eyes aren't leaking constantly! Hang in there - I hope your SEs go away, and that in the meantime, keep reporting them to your doctor and nurses. The remedies they offer can be helpful, and if anything, you want to be sure you're doing what you can to prevent permanent damage. Good luck!!",
      "MessageIndex": 6,
      "PostDate": "11/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855950",
      "Title": "Carboplatin /Taxol and Vertigo Sam0623 susanella"
    },
    {
      "AuthorID": "burner",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251047/profile",
      "Content": "Jun 9, 2017 06:56PM burner wrote: Oh, I'm so sorry that you're going through this. I remember the nurses telling me that \"not everyone gets all the side effects\", but that I appeared to be one of the ones that got even the \"rare\" side effects. :( I'm with you - perhaps get a referral to an ENT just in case? Our hearing and vision is so important, and I worry about permanent damage, too. But you may be like me- so sick and tired of spending most of my time in doctors' offices these days, that I wait until things get bad to take any action... All the best to you during and after treatment!",
      "MessageIndex": 4,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855950",
      "Title": "Carboplatin /Taxol and Vertigo Sam0623 susanella"
    },
    {
      "AuthorID": "burner",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251047/profile",
      "Content": "Jun 9, 2017 02:50PM burner wrote: Sam062- I did not have vertigo as you describe during chemo, but got tinnitus from Carboplatin which still hasn't resolved, 8 weeks PFC. The erratic throbbing in my ears at random times, even when there is nothing but silence made me nuts. You should tell your doctor about it. I suspect that the Carboplatin (or taxane!) is affecting the growth of cilia in our ears which can cause vertigo spells, tinnitus. Hopefully it is not a sign of an ear infection, although I suspect you would know, being in pain or with fever if that were the case? Take care.",
      "MessageIndex": 2,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855950",
      "Title": "Carboplatin /Taxol and Vertigo Sam0623 susanella"
    },
    {
      "AuthorID": "burner",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251047/profile",
      "Content": "Jun 9, 2017 05:59PM burner wrote: I, too did not experience neuropathy during my Taxotere, Carboplatin x 6 chemo, but it started about 2 weeks PFC, and I'm about 8 weeks PFC now. I took L-glutamine throughout chemo and continue to do so and am not sure whether it's helping the neuropathy stay limited to my fingertips. My toes seem to be OK. I don't hike, but I was active prior to treatment, and am getting to the point of being able to walk a measly half a mile without getting utterly winded now. I wear compression socks all the time now when walking - chemo really did a number on my veins, and they bulge with just the slightest bit of exercise. That, and the compression socks make my joints less sore since they help with the edema a bit. Good luck wit hyour recovery!",
      "MessageIndex": 1,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855654",
      "Title": "neuropathy starting several months after chemotherapy sealight burner"
    },
    {
      "AuthorID": "burner",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251047/profile",
      "Content": "Jun 9, 2017 05:22PM burner wrote: Autum1031- just adding to what others have said. I would definitely have a driver for the first session. I was so loopy from the Benadryl on infusion days, that I wouldn't have trusted myself to drive. I drove myself to all of the day-after-chemo sessions for hydration and Neulasta, largely because I was hopped up on the steroids from the pre-meds that they give you during chemo. Give yourself ample time so that you're not stressed or feeling rushed about being late. I used to get such road rage, but the perspective from treatment has chilled me out a lot, go figure. There are some organizations that offer those with cancer treatment driving help: https://www.cancer.org/treatment/support-programs-and-services/road-to-recovery.html",
      "MessageIndex": 5,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/856007",
      "Title": "Can you drive yourself to chemo? Autum1031 lrwells50"
    }
  ]
}