{
  "AuthorID": "bwbly",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
  "Posts": [
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Mar 26, 2009 11:11AM bwbly wrote: Hi all. Been out of touch for a few days since my mom was here for my 1st chemo .... Taxol/Herceptin. Still catching up on posts, but thought I'd give an accounting. Took 5-1/2 hours for this tx. Port worked wonderfully, so good to be able to get up and around while stuff running in. Onco believes in lots of hydration  during tx, so started with Heparin followed by pint of saline. Then steroids and Zantac. Then Benadryl. More saline. Taxol took 2-1/2 hours, then 1/2 pint saline. Herceptin took 1-1/2 hours, followed by 1/2 pint saline. Then on my way out the door. The time for the Taxol and Herceptin will be decreased next time, and again for tx #3. Then I should be down to about 3 hours for the whole thing. So the only SE's I've had are minor itching of head and upper torso for 1st night only and dry mouth for 2 days. Didn't sleep well at all Tuesday night, but slept like the dead last night. Regular diet. Actually, I feel really good (surprised even me LOL). Mom decided Im ok and went home today. I'm on vacation all this week, but will return to work on Monday. Chemo is on Tuesday mornings for 11 more weeks of Taxol/Herceptin. Had my hair buzzed last Saturday. No wigs, just hats. I find I'm perfectly comfortable in public with no head covering at all, but it does scare the little kids LOL. My 2-yr old great-nephew flatly told me he DOES NOT like my haircut LOLOL. Ok, back to catching up on posts. Bunny",
      "MessageIndex": 457,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Mar 29, 2009 08:34AM bwbly wrote: ann-idiot, why take another pill???? just smoke it ... i know that's what one un-named person is doing",
      "MessageIndex": 561,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Mar 29, 2009 09:21AM bwbly wrote: LOL Britt. I admit I have opinions .... strong ones .... and, of course, mine are right LOLOL",
      "MessageIndex": 568,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Mar 31, 2009 11:18AM bwbly wrote: need to catch up on 2 days of posts, but here i sit in radiologist's office. Just finished 2nd tx and feel ok so far. Onco wants radiologist to look at site of balloon (MammoSite). It has gotten red and warm since late last week. So she just wants him to check it, just in case. No fever, blood counts ok. Bunny",
      "MessageIndex": 665,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 7, 2009 12:13PM bwbly wrote: Just home from 3rd tx of taxol/herceptin. as usual, still reading <sigh> beginning to wish i was a speed-reader LOL. both drugs went in at a faster rate today .... 1 hr for the taxol and 30 minutes for the herceptin. the taxol made me feel light-headed this time, but nothing i can't handle .... drove myself home. when i finish these (9 more), then i will do ac once every 2 weeks for 4 rounds. here's hoping i do as well on the ac as i am now. hope everybody that's been down and out is feeling better. Bunny",
      "MessageIndex": 975,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 8, 2009 06:16AM - edited Apr 8, 2009 06:17AM by bwbly michele drink LOTS! i usually have dry mouth the day of and 1 or 2 days following, so makes it easy to drink. the 1st tx i was constipated for 3 days, then diarrhea overnight. the next week, the diarrhea hit 2 am following tx. yesterday, it came at 8 pm. and nobody told me about chemo poop ...... boy does it STINK. you'll know when you're done with the diarrhea because the smell will drive you from the house .... and possibly from the neighborhood LOL. and it BURNS. keep some baby wipes handy. I also will use a preparation h cream just for the pain relief. fatigue is there by the end of the week, but manageable. i take Zofran for nausea, with Compazine in between if required. Bunny",
      "MessageIndex": 1004,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 3, 2009 06:35AM bwbly wrote:",
      "MessageIndex": 798,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 19, 2009 12:52PM bwbly wrote: Chris, I am also doing the Taxol weekly. Like Nana, Tuesday will be #5 for me also. All of my pre-meds are given at the time of tx thru my port .... steroids, benadryl, anti-nausea, and anti-gas. As to SE's, I have had very few .... the abdominal pains usually the weekend following tx, i tire a little easier than before ... have had very little tingling/numbness and what I have had goes away fairly quickly. Hope you do well on the Taxol. I am working full-time and plan to continue all thru Taxol/Herceptin.",
      "MessageIndex": 1418,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 12, 2009 03:10PM - edited Apr 12, 2009 03:12PM by bwbly OK, here's my guys   Charlie (the Jack Russell) is 4 years old and Bosley (an English pointer) is 3 years old. Bunny",
      "MessageIndex": 1143,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Mar 28, 2009 01:28PM bwbly wrote: Just got home from shopping ..... went to the baby shop and got me some of those baby headbands with flowers attached. Summer starts here real soon and I figured these would be much cooler than hats LOL.",
      "MessageIndex": 533,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 14, 2009 03:44PM bwbly wrote: Home from 4th weekly taxol/herceptin .... dry mouth, metallic taste, and tired this afternoon. my hair started going last thursday. hair on head (buzzed really, really close) is patchy and the brazilian wax is coming along nicely. Potassium levels are up for some reason 2 weeks now. So we're going to start playing with meds (i currently take 17 scripts) to try to bring it down. Have to see primary care next week. Pets .. i love seeing everybody's pets. i like all kinds of animals. used to have a yellow lab who also though she was a lap dog at 120 lbs. besides my 2 dogs, there are also 3 fish tanks here that belong to my son ... 2 fresh water and 1 salt water. Tattoos ... a little bit of info for those of you who think you may want your first, but are maybe afraid. i know you've all heard horror stories about how much it hurts, blah, blah, blah. Just know that WHERE you get your tat determines how much pain there is. Muscular areas hurt MUCH less and I mean very minimal pain. Bony areas hurt A LOT. So if you're thinking of getting your first tat across your lower back (just below the waist area), you'll probably never get another. The pain factor is why I chose the locations I did. As to the needle phobias, not a problem. You don't see the needle really and it's not like a needle poke for a blood draw or IV. No veins to find or collapse or roll. Smaller / simpler is better for your 1st go-round. Personally, I prefer a male tattoo artist. The females I have used have a much heavier hand. Bunny",
      "MessageIndex": 1233,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 28, 2009 03:19PM bwbly wrote: ok, I think I'm caught up LOL. Haven't kept up this past week, due to problems not related to BC. Had to work 2 late nights last week .... monday til 830 pm and thursday til 930 pm. tired, tired, tired. Plus Hospice and the nursing home each called me twice last week about my hubby, so made a trip to San Antonio over the weekend. so now i'm extremely over-tired and not sure i'll recover. actually i know i will, but it doesn't FEEL like it LOL. Tx today went well (is this #5 or #6? can't remember). Nurse was amazed that i haven't gained any weight from the steroids..... guess I'm doing something right. good luck to all, hope everybody feels well or gets over whatever it is they're suffering from. Bunny",
      "MessageIndex": 1677,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 29, 2009 10:11AM bwbly wrote: Chris, forgot ..... food/drinks also taste \"funny\", but that sensation comes and goes. Bunny",
      "MessageIndex": 1700,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Mar 31, 2009 06:34PM bwbly wrote: Wow, Nana, what a lot of pills!! I'm also doing the Taxol (and Herceptin) for 12 weeks and I don't take ANY pills before or after (except anti-nausea of course). I do my blood work the day before tx .... just stop in at lab on my way to work. My liver functions were also up (this week and last week), but i take lots of other drugs that also can affect it. The first one she wants to look at changing is the cholesterol meds (which I've been taking for 2 years). So I'm trying to get in to see my neurologist. Just to catch you up ...... I had a stroke in 2002 so I take LOTS of meds .... 3 blood pressure meds, aspirin, Nexium, cholesterol meds .... all told about 15 prescriptions daily. So be aware that, if you take other meds not related to your BC treatment, THEY could be the culprit with your liver enzymes. Also, your oncologist is just a cancer doctor and will try to take care of whatever comes up, but you must still maintain all your other doctors regimens/appointments/meds as well. I know it will take ALL of my doctors to get me through this .... and I have PLENTY of doctors LOLOL ... primary care, neurologist, gastroenterologist, hemotologist (for anemia), with pulmonologist to come up soon ..... all in addition to my new breast surgeon, radiologist, oncologist ..... and the list goes on. Gettin old ain't for sissies.  Bunny",
      "MessageIndex": 683,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Mar 28, 2009 11:00AM bwbly wrote: \" mce_src=\" \" alt=\"\" border=\"\" hspace=\"\" vspace=\"\" width=\"\" height=\"\" align=\"\" /> Hope this goes thru LOL ...... got my hair cut last Saturday Bunny",
      "MessageIndex": 531,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Mar 29, 2009 09:16AM bwbly wrote: Now that the illegal stuff has been mentioned, I'm sure there are some of our Princesses who will strongly disagree with this \"treatment.\" I say .... whatever works. And, for those of us that are children of the 60's, we know this works. Bunny (stepping down from soapbox)",
      "MessageIndex": 566,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "May 6, 2009 06:31AM bwbly wrote: Once again, I'm finally caught up with posts ..... whew! So glad Buddy is better and healing. Keep it up. Hair - I go everywhere bald. I put a hat on outside just to protect head from the sun. Otherwise, my attitude is \"if you don't want to see my bald head, then just look away\". Sex - Desire, or lack of it, doesn't matter. No partner. Periods - Post-menopausal for 7 years .... yippee!! Now for my update .... Took a few days off and did nothing but rest. Laid around the house in my pj's from Friday noon til Monday morning. TX this week was moved up to Monday, so got that done, then back to the couch. Felt really, really good yesterday all day. Onco is worried that Herceptin is beginning to affect heart. She usually gets an echocardiogram every 3 months, but she's sending me for another after only 6 weeks. Blood pressure is \"managed\" but high for me, pulse rate is running high and short of breath. So I also have to see a pulmonologist on Friday. I'm one of those people that is VERY aware of what's happening in my body, since my stroke several years ago. So I'm keeping check on BP and heart rate, and keeping all dr's informed. After last week's TX, BP was extremely high. Thought I was going to have to call EMS, but I finally got it down to acceptable levels. So basically, I'm just resting as much as possible. Work has been great ..... my schedule has been adjusted so I don't have to work late any more and if I get too tired, I'm allowed to go home early. Bunny",
      "MessageIndex": 1858,
      "PostDate": "06/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 9, 2009 06:33AM bwbly wrote: Regarding tats .... whatever design is decided on should be available for the ones of us that want one but can't make it to Miami, so we can all still be connected!",
      "MessageIndex": 1053,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 11, 2009 09:07AM bwbly wrote: Luv2sing .. I would go with whichever YOU are most comfortable with. For me, the choice would be a cap/hat .... but then I decided no wigs a long time ago and don't even have one. I just go bald LOL.",
      "MessageIndex": 1108,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 3, 2009 06:21AM bwbly wrote: gina, i had lumpectomy on my 36DDD with a lemon-sized cavity left behind. Can hardly tell, except for all the healing that's still going on. Bunny",
      "MessageIndex": 797,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 5, 2009 09:48AM bwbly wrote: I have 4 tattoos across my back. Got my first one at age 55. Will definitely have another when all this is over. Bunny",
      "MessageIndex": 898,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 5, 2009 10:05AM bwbly wrote: duh .... forgot to describe tats..... left shoulder is a bunny with wings left side of spine is Chinese characters that says \"crazy bitch\" right side of spine is a red rose right shoulder is Chinese character for rabbit Bunny",
      "MessageIndex": 900,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "May 26, 2009 07:19PM bwbly wrote: oh ..... forgot ..... speaking of marriages and anniversaries .... ours is on the 29th, 24 years.",
      "MessageIndex": 2197,
      "PostDate": "26/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "May 26, 2009 10:47PM bwbly wrote:",
      "MessageIndex": 2205,
      "PostDate": "26/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jun 11, 2009 09:19PM bwbly wrote: Gina, thanks. Pickle, yep, everybody in south Texas has AC ..... in our houses, cars, work places, stores, everywhere. We're in a sauna outside and a nice cool cave inside. Any of ya'll that go to a gym .... wear your long sleeves, jeans and hats in the sauna ..... just to get a taste of my summer. Probably why I've been in the house in my pj's for the last 2 days LOL. Bunny",
      "MessageIndex": 2380,
      "PostDate": "11/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 11, 2009 08:12AM bwbly wrote: Sorry, Ladies .... my turn. I too am a Christian and I worship when and where I please, whether anyone else likes it or not. BUT -- I do NOT discuss religion or politics simply because those discussions seemingly always degenerate into arguments. I have much more important things to concentrate on than stupid arguments that are not going to change anyone's mind. I could certainly unload those life and death things here, but I choose not to ... BC is enough to deal with here. Should anyone ask, I will certainly fill in the blanks, but they are MY crosses to bear, not yours. I suggest we remove the religious (and future political) \"discussions\" to another forum where that is the topic and not clutter this thread with conflict. Bunny",
      "MessageIndex": 1100,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 2, 2009 06:59AM bwbly wrote: Good morning, all.  As usual, I'm way behind on posts. I guess if I want to keep up, I need a direct link implanted LOL. Had 2nd tx of Taxol/Herceptin on Tuesday. Up at 2 am Wednesday with diarrhea and nausea. Never threw up, but sat on pot til about 8 or 9 am. Got up this morning with nosebleed. Nosebleed may be nothing more than the fact that we are blessed with extreme pollen counts. On a good note, got a new baby yesterday! My 2nd cousin had her first. Her mom (my 1st cousin) died of lung cancer when the girl was a very young teen and I got adopted as her 2nd mom. So I got a new grandbaby!!! And he's close enough to play with YIPPEE. Bunny",
      "MessageIndex": 753,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jul 8, 2009 03:48PM bwbly wrote: As you know, the first round of Adriamycin/Cytoxin hit me really hard. My white counts dropped and were \"unacceptably low\" (my oncologist's words). About the time I started feeling better from the chemo itself, the infections started. A severe UTI was first. That finally started clearing up with antibiotics, then the lumpectomy site got infected.   I saw both my surgeon and oncologist yesterday. The surgeon opened and cleaned out the lumpectomy site, then packed it with antibiotic gauze. He told me that this site now will NOT heal, since I am taking chemo. He will be sending Home Health to clean and repack every couple of days. He also told me I will need plastic surgery to close/heal this site. He called my oncologist while I was on the way down to her office. The oncologist told me chemo is on hold for now (should have had chemo yesterday). She and the surgeon came up with a plan during their conversation. He will keep a close eye on the lumpectomy site until such time as I can have the surgery. Since I only have 3 chemo infusions left to do, we will finish the chemo before having surgery. She told me I will get a reduced dose of chemo since the first one hit me so hard. I have appointments with both doctors next Tuesday. He will check the site and let her know know what he thinks. If he says ok and I feel ok, then we will do chemo on that day. Otherwise, we will wait another week. Crap. Bunny",
      "MessageIndex": 2682,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jun 10, 2009 03:43PM bwbly wrote: Had last Taxol yesterday. Now I get a week off, then start ACx4 Tuesday after next. Gina, please update me in our Warrior list. Sun sensitivity has set in. So, lucky me, I get to wear long sleeve shirts, long pants and hats all thru the Texas summer. Summer on the Texas Gulf Coast is hot and humid enough with NO clothes, much less all covered up. Talk about miserable. Bunny",
      "MessageIndex": 2366,
      "PostDate": "10/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 29, 2009 10:08AM bwbly wrote: Chris, I'm on week 6 of Taxol/Herceptin. NO bone pain. A little tingling/numbness in fingers. That's it. Bunny",
      "MessageIndex": 1698,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jun 25, 2009 09:21AM bwbly wrote: Hi all. Been away for a while since I had a break last week between finishing Taxol and starting AC. Got my first AC on Tuesday and Neulasta yesterday. So far, so good. No bone pain. Very minor queasiness which I'm controlling with food. Fingertips all still numb from the Taxol, but no nail problems. Tip of my tongue is numb. Skin really dry (very unusual for me). Steroids got to me yesterday afternoon .... had a major shouting match/breakdown at the gasterenterologist's office LOL. I KNOW the wait there is always long, but it got to me yesterday. After waiting 2 hours, everybody in the building knew I was unhappy! And, guess what .... they took me in right away LOL. My mom is here with me this week, but I think she's going home tomorrow since I'm doing so well so far. Only 3 more tx to go, then on to just Herceptin. Bunny",
      "MessageIndex": 2537,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jul 1, 2009 02:36PM bwbly wrote: update .... i feel better today. Pain from cramping was unbearable yesterday, so I called onc. She said come in to get checked. She suspected UTI and sent me to lab ..... urinalysis and blood work. Gave me antibiotics and Vicodin. She called late yesterday. UTI confirmed and WBC very low. Said if not better today, come in again for neupogen shot. Temp went up to 99.7 last night, but came right down with a couple Tylenol. Today I am still cramping but the Vicodin definitely helps LOL. Will call her later to see what she says. Good luck, Francine. Bunny",
      "MessageIndex": 2618,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "May 26, 2009 07:17PM bwbly wrote: I'm doing well. Just depressed, I think .... in spite of anti-depressants. Fatigue has arrived. Still working, so too tired to get on puter when I get home. This is my last week at work (I'll be on short-term disability til done with chemo), so hopefully things will be a little better and I'll have more time. Tx moved this week to Wednesday due to holiday. Then 2 more Taxol/Herceptin. Then on to AC. I'm sooooooooo ready to be done.",
      "MessageIndex": 2196,
      "PostDate": "26/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jul 8, 2009 08:54PM bwbly wrote: Janine, yep I had the Neulasta for all the good it did LOL. It just seems like this never ends. Why can't it just be straight-forward? I did so well on the Taxol ..... guess this is just chemo's revenge.",
      "MessageIndex": 2685,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 19, 2009 05:10PM bwbly wrote: Chris, I haven't had diarrhea much. My abdominal pains seems to be more constipation, but not totally stopped up LOL. It's mainly a major discomfort .... not put me to bed painful. I haven't had any problems with blood counts .... just high potassium levels, which we are trying to bring back down by adjusting my meds (the ones I've been taking for years ... nothing to do with BC). I've said before ..... Nana sure seems to take lots of steroids by mouth. I only get steroids on day of chemo and they are IV not oral. So I'm usually up quite a bit Tuesday night, but sleep just fine the rest of the time. The numbness/tingling in my fingers is nothing new .... left hand is the one already affected by my previous stroke and right hand, I have mild carpal tunnel. So I wasn't surprised that's where the numbess/tingling comes and goes. Overall, the Taxol is no biggie .... as I said, I still work full time + overtime, with no problems at all. On Friday, I'm a little more tired than before BC, but nothing I can't handle. I just go to bed early on Friday nights LOL. Bunny",
      "MessageIndex": 1439,
      "PostDate": "19/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "May 16, 2009 05:48PM bwbly wrote: I'm so happy for those of you finishing up your chemo. BUT........ it certainly depresses me, knowing I've still got such a long time to go... 4 more Taxol/Herceptin, then AC for 4 bi-weekly tx. So it will be August before I'm done ......... booooohooooooo.  But then I think ...... I'm already finished with my radiation YAYAYAY and it was a breeze .... just twice daily for 5 days. Had my follow-up echocardiogram last Tuesday right after chemo. All looks good. Saw Pulmonologist the last 2 Fridays ..... all does NOT look good. Only 63% lung capacity with 43% oxygen transfer. No wonder I feel short of breath. Of course, 2 new meds, bringing my total daily meds up to about a zillion. I'm tired of all this shit. Why me?????",
      "MessageIndex": 2064,
      "PostDate": "16/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 24, 2009 10:32AM bwbly wrote: i feel sorry for sessna ..... i would hate to be so bitter all the time",
      "MessageIndex": 1549,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Apr 24, 2009 10:33AM bwbly wrote: but i reported her also",
      "MessageIndex": 1552,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Nov 15, 2009 04:59PM bwbly wrote: crap, having problems uploading fotos of my HAIR!!!!",
      "MessageIndex": 3495,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jul 3, 2009 01:53AM bwbly wrote: Drat!! Chemo delayed until infections clear up. Saw onc again today and gave away more blood. Got even more antibiotics. Still running afternoon fevers. Feel really good in the mornings, then like a pile of dog doo in the afternoon/evening. I'm just bitching because I'm tired of feeling bad, I think. See onc again on Tuesday for follow-up and to see if and when we can reschedule chemo. Really sucks that my 1st AC tx did such a job on me. She said I'll get a reduced dose when we start up again, so maybe next time will be better. Bunny",
      "MessageIndex": 2642,
      "PostDate": "03/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jul 15, 2009 06:25PM bwbly wrote: Been away for a few days because my AC broke..... 95 inside my house YUCK but better than the 102 outside. Here's today's update ..... Saw surgeon and oncologist yesterday. Surgeon cultured stuff he removed last week. There was bacteria there but only normal skin bacterias, no infection. He took scrapings again yesterday. He says there IS healing going on, so home health will put in a wound vac which will suck out any drainage and promote new blood vessel growth which will promote healing. If this works, maybe I won't need additional surgery to close. Will see him again in 2 weeks, barring any complications/infections/problems. Next went to oncologist. Told her what surgeon said, so we decided to go ahead with chemo. So ran to lab for blood tests and cafeteria for lunch. Labs still pretty good .... WBC still a little elevated and anemia showing back up. Then chemo. Finished around 5 pm. Barring any problems/infections/etc. back on schedule and will have next chemo in 2 weeks. Go late today for Neulasta shot to raise WBC count. So here I sit, waiting on chemo SEs to start showing up. Told my roommate to watch out .... roid rage will show up soon and don't be offended if I start yelling at him LOL. Bunny",
      "MessageIndex": 2735,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jun 30, 2009 12:51AM bwbly wrote: Sakura, this is south Texas LOL ...... everywhere is air conditioned !! Think I've also been kind of afraid to be around too many people since I've become a germophobe! Just told my SIL that I think I'll try to get dressed and out tomorrow (if my tummy will quit cramping). I have friends come by most days and my son has been doing my running for me since it's so hot. Maybe I should start forcing myself to get out every day.",
      "MessageIndex": 2587,
      "PostDate": "30/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jun 4, 2009 11:11PM bwbly wrote: Hello ladies!!! Been awol for awhile ..... internet connection been on the fritz. Finally caught up reading - again. I had #11 of 12 Taxol last Tuesday. All still going well, with very minimal SEs. Numbness/tingling in fingers, minor swelling of feet/hands, nosebleeds and the ever-present exhaustion. I will have final Taxol next Tuesday, then a week off before I start bi-weekly AC for 4 rounds. As is usual these days, my mom will come stay with me when I start the new drugs. She worries, you know LOL. Last Friday was my last day at work til this is all over. Short-term disability til the end of August. So I'm a lady of leisure. Sure wish I had some spare time to enjoy it LOL. Hope everybody has a good week!",
      "MessageIndex": 2329,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "May 30, 2010 10:23PM bwbly wrote: Hi all ..... just checking in. And, no, I'm not going to read 50 pages of posts to catch up LOL. Finished treatment on May 26th --- YIPPEE!!!! YAHOOOOOO!!!! Still perpetually tired, nosebleeds and fragile fingernails, but surviving. Working 50 - 60 hours a week just adds to the fatigue, so I do absolutely nothing on the weekends. Now gotta get port removed ..... YIPPEE!!! On another note, husband died on March 10, after many, many years battling Huntington's Disease. And he must have needed a dog, because my little Jack Russell died about a month later. But, all in all, life is good.",
      "MessageIndex": 4524,
      "PostDate": "30/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jun 30, 2009 12:36AM bwbly wrote: well, i don't know if i can do this or not. 1st AC tx kicked my butt. no bone pain from the neulasta and very minor nausea from the AC, but i feel like s**t.... just plain miserable. Roid rage was horrible for 4 or 5 days. As I said, no real specific complaints, just feel awful. Today having bowel problems and so tummy has hurt all day. Haven't been out of my pj's since about wednesday or thursday last week ... too hot to go outside anyway. Been a string of 100+ record-breaking days here with heat indexes around 110 (just check the Houston area on your local weather). Even the dogs don't want to go out. Sure am hoping next week's tx is not so disabling. I keep telling myself only 3 more, but it may be too hard. Bunny",
      "MessageIndex": 2585,
      "PostDate": "30/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Sep 25, 2009 03:42PM bwbly wrote: Surprise! Guess who!! I know I've been away for a long time. I had a really tough time. I got mega-infections from the AC. They were so bad that we only did 3 rounds instead of 4. One of the infections set into my lumpectomy site, and since it had already been radiated, it wouldn't heal. It just HURT .... I lived on pain meds for 2-3 months. I did absolutely nothing ... stayed in my recliner and let my son wait on me hand and foot. Home health nurses came every day to clean and repack the open wound in my breast. Finally got things cleared up enough and chemo out of my system enough to get reconstructive surgery on Sept 2. So I had a partial mastectomy (about 1/4 to 1/3 of breast) to remove dead tissue, then a lat flap to fill everything in.... overnight stay in hospital. Drains came out about 10 days after surgery and stitches finally came out last Friday. Started driving (I drive a standard) this week and hope to get back to work next week. I currently get Herceptin weekly, but hope to switch to every 3 weeks. I didn't realize how bad I actually felt until after the surgery. I feel really good now and feel like things are starting to get back to some kind of normal. I still tire very easily, but stamina is returning slowly but surely....only took a 1 hour rest yesterday. Now I just have to finish healing and getting used to the way my body feels now .... tight across the back and boob does funny things LOL. I've missed everyone and of course, have not read posts. But I'm finally back up and running, thankfully. Anybody have any suggestions on bras/support for after lat flap? The ones I have are too uncomfortable now. Glad to be back!",
      "MessageIndex": 3202,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Nov 15, 2009 05:03PM bwbly wrote: Doing well. No time any more. Working 6 days a week, hyperbaric chamber every day, Herceptin every 3 weeks. Lat flap got infected (of course), but after 27 hyperbaric treatments, it's finally started healing. ",
      "MessageIndex": 3496,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Nov 15, 2009 04:59PM - edited Nov 15, 2009 05:08PM by bwbly",
      "MessageIndex": 3494,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730884",
      "Title": "**NEW** Starting Chemo March 2009 ginagina celia088"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jun 8, 2009 02:41PM bwbly wrote: My onc AND my pulmonologist both told me DO NOT try to quit smoking during chemo. Treatment for BC is more than enough stress at once .... their words, not mine. OTC drugs (quit smoking aids) are ok, but the prescriptions can have some of the same side effects as the chemo (upset stomach, digestive .... ahem ..... problems, etc) so those shouldn't be taken during chemo unless you enjoy being sick. As to drinking, I voluntarily quit as soon as I was diagnosed ... my personal choice. I have a survivor friend (not bc) who drank heavily thru his chemo .... and was absolutely miserable. Alcohol CAN affect the way the chemo drugs work. Bunny",
      "MessageIndex": 10,
      "PostDate": "08/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735468",
      "Title": "ALCOHOL / SMOKING - during chemo!!! HELP!!! TravisC bwbly"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Mar 29, 2009 03:43PM bwbly wrote: This thread is GREAT! You are all so ...... um ...... eloquent. The descriptives really do bring a mental picture LOL. I'll probably have my own weird SEs, but none yet. Bunny",
      "MessageIndex": 23,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/731431",
      "Title": "What's your wierdest side effect ann-idiot ann-idiot"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jul 10, 2009 10:07AM bwbly wrote: There is an approved 2x/day rads, with either the Mammosite or Contura. These can only be used if you qualify ..... lumpectomy, size of tumor, placement of tumor. Effectiveness is the same as external radiation. I had the Contura balloon. It was great! Bunny",
      "MessageIndex": 5,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736805",
      "Title": "Twice a day rads? cancerkicker bwbly"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jul 4, 2009 06:24PM bwbly wrote: cancergrl, I had the Contura after my lumpectomy in March. It was a piece of cake! I had absolutely no problems at all and am sorry everyone can't use this method. I had a cat scan every morning to be sure everything was still in place, then went in for my rads. 7 minutes of radiation, then off to work for me. Go back in the afternoon, just for rads. Just be sure to keep the incision site covered and use some type of topical antibiotic (like Neosporin or Walmart's Triple Antibiotic). Also don't get the incision site wet because it is so open. Good luck and Happy 4th! Bunny",
      "MessageIndex": 1,
      "PostDate": "04/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736949",
      "Title": "Contura Balloon APBI cancergrl cancergrl"
    },
    {
      "AuthorID": "bwbly",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80107/profile",
      "Content": "Jul 6, 2009 09:45AM bwbly wrote: I didn't relly have any drainage. The dressings were changed twice daily by the radiologist after treatment. Other than those, I didn't do any dressing changes. I never felt bad during radiation and worked the whole time. My employers have been great at letting me have any and all time off that I need. I hope your treatment goes well.",
      "MessageIndex": 3,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736949",
      "Title": "Contura Balloon APBI cancergrl cancergrl"
    }
  ]
}