{
  "AuthorID": "C130sunshine",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72251/profile",
  "Posts": [{
    "AuthorID": "C130sunshine",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72251/profile",
    "Content": "C130sunshine wrote: First...I have just found this web site.....I have learned more from all of you then any of the \"official\" information web sites....so thank you.  Very short history...please bare with me I am new at this. I was diagnosed back in April 2008 while stationed in Korea.  After diagnosis I was sent to Hawaii for treatment.  Unfortunately I did not have easy access to computers.  My surgeon was great but I had problems with my oncologist.  I eventually got my self stationed in California.  Now I have a great oncologist.  I did not start chemo treatment until 16 Jun 2008.  Even though I am stage 1, my Oncotype DX was 42 (I am 39).  I am receiving Taxatere, Cytoxan, and Adriamycin all at once every 21 days for 6 treatments (I just finished treatment number 5).  Then I will start radiation. Here is my question:  I noticed after treatment number 3 my pupils are no longer the same size.  I have no other symptoms (no changes in eye sight, no headaches, no problems walking, etc).  I have had a MRI of the head and neck, CT of the neck and chest plus a spinal tap.  Everything has come up negative (they were first worried that I might also have brain cancer).  I have seen an Optometrist, Ophthalmologist, and a Neurologist.  No one can figure out why my pupils have changed or even if this is a permanent change.  Does anyone have any ideas?  Has anyone seen or heard of this? C130sunshine Dx 4/4/2008, IDC, 1cm, Stage I, 0/4 nodes, ER+/PR+, HER2- Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "17/09/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721366",
    "Title": "Have Doctors stumped C130sunshine C130sunshine"
  }]
}