{
  "AuthorID": "CactusPixie80",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201060/profile",
  "Posts": [{
    "AuthorID": "CactusPixie80",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201060/profile",
    "Content": "CactusPixie80 wrote: Good morning,  I am 34 years old. About 1-2 months ago, (sorry for not remembering exactly when, but at the time I didn't think anything of my symptoms), I noticed a small lesion on my right breast. I tried neosporin, cortizone10 cream, and goldbond extra strength medicated lotion. Nada.....So I showed one of my (female) coworkers the lesion (2 o'clock position, so didn't have to whip out my whole breast) and she said it looked like her hubbys basal cell ca. Easily treatable.....  About 2 weeks later I see my PCP, by then I had tenderness and swelling and a funny looking nipple and slight lymphadenopathy around the right breast. He rules it an abnormal breast exam and hands me orders for a mammo. I went on Thurs 5/29 for diagnostic mammo, they also did an ultrasound. I was at the breast center for almost 2 hours. The radiologist read the images right away. Not long after I got home, I received a phone call that I needed a biopsy asap. Totally FREAKED....Needless to say I have an appointment for Monday (6/3).   I have access to my med records via a patient portal. I was \"messaged\" a copy of my report the same day as the mammo...\"differential includes inflammatory breast carcinoma or infection, but patient has no fever, chills etc....biopsy requested for diagnosis\"  So here I am, 2 days since my mammo and u/s, and 2 days away from what could be a life changing appointment with a breast surgeon....waiting is the hardest part. Side note: I also have slight peau de'orange and a bruise like appearance to my right breast which was noted during the mammo and u/s, images via mammo and u/s also showed edema and thickening of the right breast from the 2 o'clock thru 6 o'clock postions. May the saddest day of your future be no worse than the happiest day of your past.....Irish blessing Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "31/05/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821549",
    "Title": "Scared to death CactusPixie80 Kicks"
  }]
}