{
  "AuthorID": "Caedwyn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199263/profile",
  "Posts": [
    {
      "AuthorID": "Caedwyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199263/profile",
      "Content": "Caedwyn wrote: I just got recommended to have an MRI with tracer dye based on atypical cells on needle biopsy. How much does MRI typically cost? The surgeon guessed about $1000-$2000 (though strangely she didn't even want to make a guess on cost of surgical biopsy). I've heard of much higher costs for MRI, and I'm a bit concerned because I do have a 10% copay that I'll need to plan for. I live in Orange County, CA. Anyone know what I can expect? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/821127",
      "Title": "MRI cost Caedwyn DocBabs"
    },
    {
      "AuthorID": "Caedwyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199263/profile",
      "Content": "Apr 24, 2014 10:15PM Caedwyn wrote: I am going through this currently. My Dx from path report was usual ductile hyperplasia, and flat epithelial atypia. The nurse who gave me results said they would need to do an excision biopsy, and scheduled me for surgical consult. I am very confused because there's no agreement about surgery vs. not for flat atypia, but my understanding is that surgical biopsy is generally done for ADH. Was your Dx specifically atypical ductile hyperplasia? If so, I'm not sure why some surgeons are suggesting a 6-month follow-up. But I think if you have another kind of atypia, like flat epithelial, they could reasonably recommend putting off surgery. I don't know, and I'm planning to ask all these questions at my surgical consult (May 15).",
      "MessageIndex": 4,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/820488",
      "Title": "Atypical Intraductal Hyperplasia Helen_1991 grammakathy"
    },
    {
      "AuthorID": "Caedwyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199263/profile",
      "Content": "May 16, 2014 12:17AM Caedwyn wrote: Chrismarie, if you don't feel comfortable with what the surgeon is saying, and if he didn't explain the reasons well enough for you to understand, you can pursue a second opinion. I don't know if most surgeons are just interested in getting you into surgery, but you have to understand that they do it every day, so to them it seems like no big deal. So they may not understand why you would NOT want surgery \"just to be sure.\" And a lot of women would agree with that. But if you don't, or don't understand the recommendation, then insist on an explanation that makes sense to you.",
      "MessageIndex": 13,
      "PostDate": "16/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820929",
      "Title": "Duct excision scheduled Catie19 Moderators"
    },
    {
      "AuthorID": "Caedwyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199263/profile",
      "Content": "Apr 17, 2014 05:12PM Caedwyn wrote: V8grrl, I see that you were scheduled to have surgery today, but you were also thinking about doing nothing.  I hope all goes well, and please let me know what you did! I'm 45 too and I'm new here. It seems we're in the same boat, only my path report said flat epithelial atypia, not atypical hyperplasia. Now they want to do excision. I don't know about you, but I'm sick and tired of inconclusive results! I know a lot of people here would take that over the Dx they got, but the uncertainty is making me a wreck.",
      "MessageIndex": 4,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819645",
      "Title": "what a month! V8grrl MelissaDallas"
    },
    {
      "AuthorID": "Caedwyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199263/profile",
      "Content": "May 16, 2014 12:37PM - edited May 16, 2014 12:40PM by Caedwyn I just got a recommendation today for alternating MRI and mammogram every six months in the future. I have flat epithelial atypia, which apparently puts me at a 23.2% lifetime risk. But, without any atypia I'm not sure why you're being put on high-risk surveillance. Are there other factors (family history?) that put you at high risk? Or maybe you have very dense breasts, which make mammograms less accurate?",
      "MessageIndex": 2,
      "PostDate": "16/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/820516",
      "Title": "Alternating MRI and mammogram alicki Cowgirl13"
    },
    {
      "AuthorID": "Caedwyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199263/profile",
      "Content": "May 2, 2014 12:32AM Caedwyn wrote: I'm pretty new to all this, but from what I understand of MRI is that it picks up a lot of stuff that mammo and ultrasound don't, both benign and otherwise. My guess is that whatever they are seeing is not new, but is just something that wasn't picked up before. If they are calling it birads 4 though, it is potentially malignant, but with a high probability of being benign. Maybe some of the more knowledgable folks out there can confirm.",
      "MessageIndex": 1,
      "PostDate": "02/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/820730",
      "Title": "Follow up and new questions dlgmom1 WolfsLady"
    },
    {
      "AuthorID": "Caedwyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199263/profile",
      "Content": "Apr 17, 2014 09:12PM Caedwyn wrote: bunny, I just had a stereo guided core needle biopsy on Monday for a single cluster. The worst part was having to lie still (I'm very fidgety!). My understanding is that a single cluster is more suspicious than many scattered, though I can't imagine why. For scattered I'm not sure they would even recommend a biopsy. A single cluster is ambiguous, and more likely than not to be fibrocystic changes (benign). Just be aware though, that results of a core biopsy aren't always definitive; and if so they have to do more testing. That's what I got on mine, and I really wasn't prepared for that. Bottom line: concerning but not alarming, although I know I was, and am, plenty alarmed! ",
      "MessageIndex": 2,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820279",
      "Title": "Only one cluster of calcifications bunny78 KorynH"
    },
    {
      "AuthorID": "Caedwyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199263/profile",
      "Content": "Apr 19, 2014 10:46PM Caedwyn wrote: thanks for starting this thread, my path report suggests I'm high risk, and when I have my surgical consult in a couple weeks to talk about excision biopsy (results were from core needle) I plan to ask about Tamoxifen.",
      "MessageIndex": 2,
      "PostDate": "19/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/820351",
      "Title": "Tamoxifen kk12903 midnight1327"
    },
    {
      "AuthorID": "Caedwyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199263/profile",
      "Content": "Apr 20, 2014 12:51AM - edited Apr 20, 2014 12:53AM by Caedwyn what is SE? Edit: just read abbreviation key. Sorry, new here.",
      "MessageIndex": 4,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/820351",
      "Title": "Tamoxifen kk12903 midnight1327"
    }
  ]
}