{
  "AuthorID": "Cagey87",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/28492/profile",
  "Posts": [
    {
      "AuthorID": "Cagey87",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/28492/profile",
      "Content": "Apr 24, 2009 10:28AM Cagey87 wrote: I thought I would login and write about this as it is truly information.  I recently had two bad mammos, this time on the \"good\" side.  It's been 3 years since my original diagnosis, and the 2nd time around is much worse.  Anyway, they determined there was a small area that was suspicious and I needed a biopsy.  My oncologist gave me two choices--I could have the core biopsy or go straight for the lumpectomy.  I think she was favoring the lumpectomy, but I am not one to have unnecessary surgery, anesthesia, etc. so I said I wanted the biopsy first.  Well, it was scheduled for today, and what a day it was.  They first performed additional digital mammograms of the site, then put me face down on the biopsy table and waited for 10 minutes.  During that time, the four microcalcifications rolled downward and all gathered together in some formation.  They came over and told me that when this happens, they are cysts and 100% benign, and I didn't even need the biopsy.  I can't describe the feeling, but I wanted to let others know of this possibility, as I hadn't heard of it--it might be something to consider if in a similar position--Kris",
      "MessageIndex": 6,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732928",
      "Title": "skip biopsy and remove lump dlogan momo3esb"
    },
    {
      "AuthorID": "Cagey87",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/28492/profile",
      "Content": "Jun 27, 2015 11:12AM Cagey87 wrote:",
      "MessageIndex": 4,
      "PostDate": "27/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/832581",
      "Title": "Vibrating from left chest 9 years later! Cagey87 ICanDoThis"
    },
    {
      "AuthorID": "Cagey87",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/28492/profile",
      "Content": "Cagey87 wrote: Hello all. I had DCIS in 2006--lumpectomy and radiation. I got through everything pretty well, and stayed on these boards for a bit. I eventually had to let it go--I didn't want to think about breast cancer anymore. I felt guilty, but it was how I had to move on. Fast forward 9 years, and I have a vibration, like a cell phone in my pocket, in my chest through my left breast and sometimes even down my arm. It is intermittent and not palpable and evens stops sometimes. Other times it feels like I'm holding onto an electric fence. I'm in the middle of testing now, and so far the heart exams are normal. They are sending me for a cat scan in a couple of weeks, which is even more radiation, because they thought they felt a lymph node enlarged in my neck too. Needless to say I am freaking out all over again. In the meantime, I am trying to do a bit of research, which I know can be dangerous. But has anyone had any similar symptoms, and could it be the brachial plexopathy? I don't have pain or lymphedema, so I'm not sure if this would really fit? Any input or experience would be greatly appreciated. Thanks, Kris Dx 4/2006 DCIS Stage 0/0 Nodes, ER/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/832581",
      "Title": "Vibrating from left chest 9 years later! Cagey87 ICanDoThis"
    }
  ]
}