{
  "AuthorID": "Caitlin1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171682/profile",
  "Posts": [
    {
      "AuthorID": "Caitlin1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171682/profile",
      "Content": "Mar 13, 2013 09:37PM Caitlin1 wrote: I went to see another doctor recently and she said she felt something but wasn't quite sure what it was.She referred me to ultrasound.I went today and checked,it was just normal pregnancy premilk breast tissue.I feel so much better and relaxed after checking.",
      "MessageIndex": 5,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800875",
      "Title": "Should I ask for screening? Caitlin1 Beesie"
    },
    {
      "AuthorID": "Caitlin1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171682/profile",
      "Content": "Caitlin1 wrote: I am 7 months pregnant right now and regularly check my body for lumps and bumps partly because I lost my 16 year old to cancer.I recently found a few lumps in my right breast and brought them to my obgyn's attention yesterday.He felt the lumps and said they feel like cysts and definitely movable they hurt when pressed.He said he was confident Thats what they are.He said that even to screen further,Id have to wait until I deliver the baby anyway.He said not to be worried unless I notice bloody discharge or an indentation on the breast.Is this reasonable?Am I just paranoid? Should I listen to the doctor or demand more testing?Cancer seems to run in my family's background but not so much breast cancer. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800875",
      "Title": "Should I ask for screening? Caitlin1 Beesie"
    },
    {
      "AuthorID": "Caitlin1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171682/profile",
      "Content": "Feb 22, 2013 05:00PM Caitlin1 wrote: Thanks for all the advice.I just made the phone call to my doctor to give me the referral to ultrasound.Id rather be sure than take any chances and I have to remember the number one rule: Always be proactive in your own health care",
      "MessageIndex": 4,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800875",
      "Title": "Should I ask for screening? Caitlin1 Beesie"
    }
  ]
}