{
  "AuthorID": "Calcon",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124918/profile",
  "Posts": [
    {
      "AuthorID": "Calcon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124918/profile",
      "Content": "Apr 11, 2016 05:56PM Calcon wrote: I had TCHP, and my treatment ended August 2015. My hair came in very slowly, and I had distinct male pattern baldness. More than 7 months later, my hair is long/thick enough on the top of my head to obscure the bald spots. However, I would say that I've lost about half my hair and I have no doubt it is as a result of taxotere. Growth is still very slow on top, but the sides and back requires regular trimming as it is thicker and grows at a faster pace.",
      "MessageIndex": 114,
      "PostDate": "11/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761295",
      "Title": "Did anyone had her hair back after taxotere??? melania janet11"
    },
    {
      "AuthorID": "Calcon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124918/profile",
      "Content": "Dec 6, 2015 04:44PM Calcon wrote: tessu, I had FEC100 back in 2008 when first diagnosed. I was prescribed Neulasta after the second round of chemo because my neutrophil count was borderline following the first chemo. I continued to take the Neulasta until the end, i.e. sixth cycle. It really helped keep my bloodwork at an acceptable level, though I had significant side effects from it. Good luck with your treatment",
      "MessageIndex": 7,
      "PostDate": "06/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/836731",
      "Title": "Neulasta with FEC (fluorouracil-epirubicin-cytoxan) chemo? tessu Calcon"
    },
    {
      "AuthorID": "Calcon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124918/profile",
      "Content": "Mar 30, 2016 06:15PM - edited Mar 30, 2016 06:44PM by Calcon SSInUK, I'm so sorry this has happened to you. I also had a recurrence in my internal mammary nodes after surgery, chemo and radiotherapy. Details are in my profile, but so far I've had a lot of success with my treatment. I am currently NED. If you're still Her2+, this may mean that you go back on herceptin. I would also inquire about having perjeta added to any further treatment, along with an AI and the zoladex. Additional radiotherapy to your chest wall is another possibility, specifically targeting the remaining mammary nodes. If you find out you have spread following your CT and bone scans, there are still many available options to knock this on the head. TDM1 comes to mind as a very effective therapy for advanced her2+ cancer. However, I sincerely hope that this won't be the case. Hang in there, I know the wait is hard. (((hugs)))",
      "MessageIndex": 7,
      "PostDate": "30/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/842619",
      "Title": "Please help - dark & terrified by more bad news SSInUK ash123"
    },
    {
      "AuthorID": "Calcon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124918/profile",
      "Content": "Dec 6, 2015 10:01PM Calcon wrote: Yes, I am still on Herceptin and Perjeta for that matter. I'm also taking an AI, and I have read that this too can slow hair growth. The plan is to continue with these drugs for the next five years. I have invested in some nice wigs for the interim. I would love for my hair to be long enough for a nice pixie cut.",
      "MessageIndex": 22770,
      "PostDate": "06/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Calcon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124918/profile",
      "Content": "Dec 6, 2015 08:34PM Calcon wrote: OK guys, I am so frustrated with my hair. I am now three months PFC, and I feel the Taxotere has done irreparable damage. This is my second bout of chemo, and my hair came back without a problem back in 2009. There is such a difference now. When my hair started coming in at the end of September, I had distinct male pattern baldness. I have since shaved the sides and back of my head three times in the hope that the top will 'catch up'. If I let it grow too much, the look of it depresses me. I'd rather be totally bald. I do however have growth on the top - about 1-2 cm, and the bald patches are not so obvious any more. Thankfully there is some coverage, but I can also see through to my scalp. It's just that it's growing soooo slowly compared to the rest, where the growth is quite good. The hair on the top is very fine, like a baby's. The crown has the shortest strands, probably under a cm. So my question is, did anyone experience a similar growth pattern and eventually get a full head of hair? I know my hair will never be the same, and that's OK because given my advanced disease, I really needed to do this treatment. I don't have any regrets and would still have taken the chance with the Taxotere. I appreciate hearing anyone's advice/experience.",
      "MessageIndex": 22767,
      "PostDate": "06/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Calcon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124918/profile",
      "Content": "Dec 27, 2015 08:39PM Calcon wrote: Thanks for your input ladies. I suppose the main distinction to consider in my case is that I've been treated aggressively with curative intent, as opposed to being treated palliatively. I'm receiving very targeted therapy at the moment, and I think this would have been the same even with distant metastasis. I'm also due for my next CT/bone scans in Jan, so anxious times ahead. (Hope all goes well for you rossileo.)",
      "MessageIndex": 3280,
      "PostDate": "27/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Calcon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124918/profile",
      "Content": "Dec 26, 2015 09:37AM Calcon wrote: I have a query about staging specifically. Details of my diagnoses are in my profile. Basically, I have had a recurrence in all my internal mammary nodes plus significant spread in the soft tissue surrounding the nodes - 10cm in total. My pathology report does not specify a stage, only that I have \"metastatic\" disease. My MO says that I am in a grey area in terms of staging, but that a case can be made for placing me at stage 4. I know it's just a number, but I'm curious to get your informed opinions as to whether I'm stage 3C or 4. I realise that a true stage 4 diagnosis involves distant spread into organs or bone, and I'm not officially at that point. However, there's so much spread outside the nodes which has now affected my left side (originally diagnosed in right breast). What do you think? I feel like I'm skating a line, so to speak.",
      "MessageIndex": 3276,
      "PostDate": "26/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Calcon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124918/profile",
      "Content": "Calcon wrote: I'm particularly interested in anyone for whom AIs and/or Faslodex has failed, and had progression to the bones. How long have you been stable on this combo? I'd love to hear of any successes. I am also on Herceptin and Perjeta, but I have an inkling that the ER+ is the culprit for the bone mets. Dx @ 38y/o originally. Wife & mother of two. Currently on Xgeva. Dx 9/2008, IDC, Right, 2cm, Stage IB, Grade 2, 0/1 nodes, ER+/PR+, HER2- Dx 1/2012, IDC, Right, 1cm, Stage IB, Grade 2, ER+/PR- Dx 3/2015, IDC, Both breasts, 6cm+, Stage IIIC, Grade 2, ER+/PR-, HER2+ Dx 2/2017, IDC, Stage IV, metastasized to bone/liver/other, ER+/PR-, HER2+ Targeted Therapy Kadcyla (T-DM1, ado-trastuzumab) Hormonal Therapy Femara (letrozole), Zoladex (goserelin) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853584",
      "Title": "Anyone on Xgeva and Tamoxifen? Calcon Partyoffive"
    }
  ]
}