{
  "AuthorID": "califsun",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62864/profile",
  "Posts": [
    {
      "AuthorID": "califsun",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62864/profile",
      "Content": "Apr 22, 2008 11:44AM califsun wrote: I had an MRI prior to my lumpectomy, it showed some other areas of concern so they did an mri guided byopsy because the areas didn't show up on the mamo or ultrasound, they found LCIS which is basically pre cancer cells. I went a head with the lumpectomy and SNB, no drains and felt good right a way, no pain pills after the 2nd day...and just a little sore in the arm pit area for a week or so. The MRI was very uncomfortable but doable...the first time I didn't take any meds, the second time I did, they gave me vicodin and it made it much easier...I highly recomend it. Good luck to you, Carol",
      "MessageIndex": 21,
      "PostDate": "22/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704270",
      "Title": "Drains & Time Off Work For Lumpectomy Kim32 Solihull"
    },
    {
      "AuthorID": "califsun",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62864/profile",
      "Content": "Jul 24, 2008 11:25PM califsun wrote: The one thing I haven't seen any one mention that I wish I would have had was a back scratcher the first day and a half I couldn't even reach my face and you know when you can't reach an itch it's going to drive you crazy. I'll tell you when I got home I used my back scratcher every five minutes to reach places on my back, arms, legs and anywhere else I couldn't reach on my own. Also the first night I was really really thirsty, my dh was there to give me sips of water when I needed them but in the middle of the night I didn't want to wake him for that and I could'nt reach the water because the bed table was just a little too far away so when the nurse came in he moved the table and water cup within my reach which was a lifesaver...I felt like I was in the desert and I could see the water but I couldn't reach it...so those are the things I suggest",
      "MessageIndex": 6,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709628",
      "Title": "HELP...PLEASE...NEED ADVICE... nourtneybhorn BustersMom"
    },
    {
      "AuthorID": "califsun",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62864/profile",
      "Content": "califsun wrote: I was just diagnoced with invasive carcinoma favoring infiltrating lobular carcinoma. I can't get in to see the surgeon until the 26th so I have no idea how bad it is and it's freaking me out. It doesn't help that I lost my Mom to b/c. Does anyone else out there have this type of cancer? It's not a very common type so I've had a hard time finding someone to talk to that knows about it. Everyone on this site seems so nice, I'd really like to find some support here. Thanks Dx 1/1/2008, ILC, 1cm, Stage I, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/700010",
      "Title": "Just diagnoced with lobular carconation califsun awb"
    },
    {
      "AuthorID": "califsun",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62864/profile",
      "Content": "califsun wrote: I've had my drains in now for 4 weeks, the one on the left is doing good, I see the ps tomorrow and I think the one on the left will be coming out. The problem is the one on right, that side hasn't done as well, I had a hematoma so I've had a lot of drainage on that side so I know I won't be getting that one out for a few more weeks. The problem is the last few days the stitch that is holding in the tube is pulling and it feels like it want's to pull right through my skin, when I look at it it still looks like it's in there ok but when I do anything with my right arm and hand it burns so bad I can hardley stand it, I'm just wondering if that has happened to anyone else and what was done about it, I would kind of like to know what I'm in for tomorrow. Thanks, Carol Dx 1/1/2008, ILC, 1cm, Stage I, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709648",
      "Title": "Help with drains califsun otter"
    }
  ]
}