{
  "AuthorID": "callmesisixoxo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225924/profile",
  "Posts": [{
    "AuthorID": "callmesisixoxo",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/225924/profile",
    "Content": "callmesisixoxo wrote: Hey everyone :) , I'm new to this community and for the past 4-5 days or so I've been researching breast cancer symptoms and various benign conditions to try and figure out what is happening to me, I've had lots of ups and downs and mixed feelings about it, so at one point today I was pretty tearful but then there are moments I calm down slightly and convince myself that it's probably nothing serious. I was guessing that I could have either an abscess or fibroadenoma but I would like to see what other women might think from my background and the symptoms I describe. I know that the stats for an 18 year old to have breast cancer are apparently less likely but I'm still really scared and concerned. I'm going out tomorrow to spend the day with my boyfriend then the day after that I'm going to get an appointment booked to have it checked out. I'm just wondering how urgent this is. So I'm only 18 and I've never had any cysts, infections or other benign lumps before, only aching breasts coming up towards my period and the usual large achey lumps you get when your breasts are growing. However, just a few days ago I found a hard, palpable lump within the nipple area of my right breast, I wasn't sure if the actual lump was mobile or just the tissue around it but it seems pretty solid and rooted in the breast, I don't usually give myself self breast exams as I am pretty young and never thought to do it but lets just say I am pretty familiar with my body XD so I'd know that it wasn't there the other day, It was a shock to me because I didn't understand how it had appeared over night, for the next few days it has been growing a bit larger and slightly sorer and I've now noticed slight redness within that area, where the mass is it's a little bumpy in a small area on my nipple but the rest is smooth, my left breast is absolutely fine, nothing out of the ordinary, besides my right breast and my underarms where I have an ache and it feels a little sore to touch now where I'm pretty sure my lymph nodes are located but not palpable lumps or serious swelling has spread there. Was it a lump that I couldn't feel over time that grew to become more prominent? How long does it take for cancer to spread or cause other symptoms? I also hear that with abscesses you can also have trouble within lymph nodes? This has happened over a span of a few days and pretty rapidly. I think it would really help if anyone has had similar stories or experiences or is going through something similar to me right now who is also concerned. Any feedback would be greatly appreciated! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "21/12/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838829",
    "Title": "Hard breast mass and achey underarms! :( callmesisixoxo MelissaDallas"
  }]
}