{
  "AuthorID": "cancervikin…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
  "Posts": [
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Jan 12, 2008 10:29AM - edited Jan 12, 2008 10:34AM by cancerviking",
      "MessageIndex": 10,
      "PostDate": "12/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698125",
      "Title": "telling my class Angie WendyK"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Jan 12, 2008 10:33AM cancerviking wrote: I teach a class of 4th graders for Family Faith Formation for our Catholic church. I feel the best thing to do is be honest. I told them the day before my lumpectomy and gave them the assignment to say a prayer for me for my surgery and for the surgeon performing the surgery. They asked some questions nothing I couldn't answers. One student stated \"This means you are going to go bald\" I explained that sometimes the medicine used to get rid of the cancer cells also kill other cells such as the one that make your hair grow. That this is only temporary and that my hair will grow back in again. Besides they will be able to see me is so many neat hats. I believe sharing just the basic information is important and to answer questions as they arise. There are many good books out there for children about cancer you can use as resources best of luck...Pam",
      "MessageIndex": 11,
      "PostDate": "12/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698125",
      "Title": "telling my class Angie WendyK"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Mar 7, 2008 07:28PM cancerviking wrote: Artsee-- beautiful artwork. I wish I could paint. I enjoy cross stitch and many other crafts. I shared in earlier notes that I turned 42 in February. I have been married for 10 years to my wonderful husband my rock and support. We have been blessed with 2 daughters Gretchen age 9 and Megan age 7 We have been very honest with our children and they are part of my team in fighting this battle. FYI there are some good books for children about breast cancer our favorites are The Year My Mother Was Bald by Ann Speltz for my older daughter and Our Mom Has Cancer by Abigail and Adrienne Ackermann for both daughters. My daughters took the second book to school and shared the story with their class. As for me, I am a registered nurse and have worked for 18 years in postpartum, nursery and neonatal intensive care units. For the last 2 years I have been working my dream job doing Newborn home visits for new moms and babies in conjunction with a state early childhood developmental program called Help Me Grow. I am very blessed to have a very understanding boss and I schedule visits for my good days. Unfortunately this week the flu threw me for a loop! Di53 Try some Gold Bond Extra Strength body Lotion for Extra Dry and Itchy Skin. My daughters job at night is to massage my head with lotion, They love it and think it will make my hair grow in faster Ha Ha. Anyway it feels good :-> I have a wig also. I call it my $200.00 dollar deductible . ( I am blessed with excellent insurance which covers 100% besides co-pays after meeting my personal $200.00 deductible. I had to fight with the insurance company to pay for the wig but at least I can tell people I know where my deductible is at all times Ha Ha. I save the wig for church and work but prefer to wear hats at home and out in public. I'm feeling great today and decided to go to work for a while. Well guess what after being in the office for only one hour the the snow accumulated at least 3 inches and It keeps on coming the weather forecast is predicting the snow estimates in feet. Got to love Ohio weather our slogan is \"If you don't like the weather, Wait 10 min\" Ha! Ha! Hope all are well and are enjoying better weather Crazypam",
      "MessageIndex": 356,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Apr 11, 2008 08:19PM cancerviking wrote: Way to go Aurora!!! I'm dancing for you!. Sorry I haven't been on lately, our computer, dishwasher, telephone all decided to quit in the same week. We lost everything on the hard drive OUCH!! I think it is God's way of distracting me. Stress, what is stress? Anyway got a new hard drive, telephone and dishwasher out of it. Had AC #4 ,my last, on Friday 4/4. I'm excited to check that off my to do list. On to Taxol x 12 weekly. The nurse in the office said this should go easier. This round was easier I convinced my oncologist to assume the inevitable that I would be dehydrated and came in for hydration Mon, Wed and Friday (today) wow this made a huge difference. I wore a crazy hat for chemo once again. A hard plastic viking hat with two large horns and two blonde braides hanging from the side. The Doc looked at me and burst out laughing and said she doesn't even know what to say about this hat. Made all the nurses and other chemo patients laugh. My goal is to choose laughter rather than crying whenever I can. Found the next chemo hat the local Goodwill yesterday and this even tops the Viking hat. It is a huge Mexican sombrero blue velvet with sequins and hand stitching It weighs as much as my 7 year old daughter. Ha Ha!! I'm looking forward to going to the looking good feeling better on Tuesday. this will be the 3rd attempt to attend. the first 2 were canceled due to snow. I'm praying for no snow on Tuesday, but living in Ohio you can expect anything when it comes to weather. I'll be praying for all and hope everyone has a wonderful weekend!!! Pam",
      "MessageIndex": 605,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Mar 6, 2008 10:11PM cancerviking wrote: Chris your hair story made me laugh. I'm still not sure who is looking at me in the mirror!!! I'm feeling much better today. Another visit to a doctor, at least this time was for my daughter. She turns 7 on Sunday and had a routine physical. Here in Ohio we had a nice weather day today actually we had sun and the thermometer reached above 40 WOW!! Can't wait another snow storm is on the way. News just said possible 1-2 feet by Sunday Happy B-day Nolana. I started chemo on my 42nd birthday, a birthday I will never forget. Keeping the attitude that I'm doing all this to assure I have at least 42 more birthdays. Here is to many more birthday celebrations to you!! :-> crazypam",
      "MessageIndex": 337,
      "PostDate": "06/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Mar 8, 2008 07:00PM cancerviking wrote: My family is nuts!!! Well my mom is anyway. When I was in the hospital last weekend, the brought me a \"Hair Do Harriett\" the womans version of the bald man. I guess since I can't style my hair I can do Harriett's. Guess that is where my humor comes from. Told my aunt that I have a wig for my head but was having troubles finding a pubic wig. First time I heard her laughing since I was diagnosed and now she believes I will be alright. I am definitely enjoying not having to shave my underarms or legs. I keep telling my friends I pity them this summer because I won't have to think before wearing shorts. Saving a lot of time in the morning. Told my husband I'm doing my part in saving on water. Recently told my family that if there is hair in their food, don't look at me!!! Our wonderful neighbors just dug us out. We have had a least 14 inches of snowfall since yesterday at 12N. Hope the snow stops soon!! I can't wait until spring. Hope everyone else is enjoying better weather than I am. I'm developing cabin fever here! Keep Laughing! crazypam",
      "MessageIndex": 370,
      "PostDate": "08/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Mar 10, 2008 05:42PM cancerviking wrote: Having a good day but I'm still tired!! Fell asleep in the chair last night watching TV around 10pm and woke up when my daughters woke up for school at 7 am. We finally are digging out from the storm We got about 16 inches from Friday to Saturday at midnight. My next AC #3 is on Friday I feel like I'm feeling good, now it is time to kick me down. Plan to work as much as possible this week so I can get a pay check next. My daughters enjoyed massaging my head on Sunday. They were counting all the little black hairs on their hands after my head. Oh how much fun. This is what we do for entertainment here in Ohio during a snow storm. Ha Ha Hope all are well and feeling good!! Crazypam",
      "MessageIndex": 389,
      "PostDate": "10/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Apr 27, 2008 10:00PM cancerviking wrote: Donna... My eyelashes and eyebrows have been thinning since my last A/C treatment but are coming out much faster now. Just went to the looking better feeling good last week I guess just in time to learn how to draw in my eyebrows. I'm scared to use any mascara because I'm afraid that cleaning the makeup off my eyes will make the lashes come out faster. Oh Well as least we know the chemo is doing it's job but what a bummer. I had very long thick lashes and thick brows but I know they will grow back. Evie... be careful with dental cleanings during chemo or if you have a port in. I would check with your oncologist to see if you need to take some antibiotics to prevent any infections. My oncologist suggested I wait until after chemo and so did the dentist. 2 days out from Taxol and I'm feeling achy and having some joint and general pain. Also experiencing a lot of bladder pressure. Donna I hope your enjoy your trip to florida. Our family has planned our dream trip to disney world for the end of September to the beginning of October. I can hardly wait and my daughters age 9 and 7 can hardly wait. Best of all my parents are coming along to allow my husband and I to have some special time alone. Hope all are well and enjoying the spring. Pam",
      "MessageIndex": 680,
      "PostDate": "27/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "May 15, 2008 10:33AM cancerviking wrote: Laurel, sorry your going through this. I'm sure that the pain is miserable and you are in my prayers. Granny-- I too will be having radiation and have never second guessed this decision. I chose the lumpectomy route and want to do all I can to beat this cancer. I will be having my 4 dose of taxol tomorrow and have 8 more weekly doses before starting radiation. I did get an unexpected tour of the unit because I was asked to make a nursing appreciation poster for the unit. The nurses and staff seemed very nice and knowledgeable and I trust this will be my final assault on this battle against breast cancer congratulations to all who have completed their chemo journey I can't wait to be able to finish with the chemicals :-> My prayers and blessings to all of you Pam",
      "MessageIndex": 718,
      "PostDate": "15/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Jul 23, 2008 11:33PM cancerviking wrote: pacman, I'm thinking about you.  Good luck with your LAST chemo treatment tomorrow.  I am so happy for you.  I'm looking forward to the remaining side effects to leave but I'm glad that phase is over.  Had another scare though--I found a lump in the breast I had the lumpectomy on.  The lump is the size of a small grape and along the original incision line.  I had a pre scheduled appt. on Mon.  with the surgeon who I assumed would do an ultrasound he palpated the breast and then said It was nothing to worry about not a good thing to say to a nurse who is concerned.  Had my final chemo that Thursday and the oncologist palpated the lump and said she wasn't concerned but I still was!! Finally on Friday (the next day) I had an appt with the radiation oncologist who I didn't say anything about the lump and let him find it.  I told him regardless of what the doctors were saying I was still concerned and he ordered a mammogram and ultrasound because he was concerned also.  Thank you God!! It turned out to be a small hematoma in my breast and not cancer!!  As I say, We have to be our own advocate.  I refused to leave the office until the order was in my hand.  Always make someone listen to your concerns!!! Well on to radiation starting  7/31 the last phase of this long journey. hugs and prayers, Pam ",
      "MessageIndex": 755,
      "PostDate": "23/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Mar 1, 2009 09:19PM cancerviking wrote: Hello everyone,  I'm still here !!  I've been working more these days and am so happy to be on this side of breast cancer.  I've had followup mammo and all looks good.  I'm still suffering some of the effects of the lovely chemo and have had a lot of r. shoulder pain.  MRI show tendonitis and no torn rotator cuff or cancer.  After 6 weeks of physical torture ...oops I mean therapy.... It still hurts!!  I refer to it as my Charmin shoulder from the lovely side effect of diarrhea experienced during the chemo.   What a journey we have been on this past year and I hope this note finds all well!!  I know that this year has made me a stronger person, a better mother, a better wife and more understanding nurse and a better friend.  I've learned what is important in life and have seen Christ working in so many wonderful ways through so many wonderful people.  This site has helped me get through the tough times and  I hope I can help someone through their journey of breast cancer.  I pray this is a disease my daughters will never have to encounter.  My love to all!! Pam ",
      "MessageIndex": 759,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Mar 22, 2008 09:00AM cancerviking wrote: Hello everyone, had a rough time again with A/C#3. nausea and diarrhea is not much fun. I'm finding I have chemo on Friday and by tuesday-friday I'm shakey and need iv fluids. It is hard to drink when you are nauseous and everything tastes like you are sucking on an old rusty nail. Anyone have an ideas??? I can't do sports drinks I've thrown then up. Went in on Friday for IV fluids and now I feel better. Easter is supposed to be at my brother's house with the family but my temp has been 99.0 and my 2 nieces are not feeling well one with the flu and one with a rash and sore throat. I'm nervous about exposing myself to all these germs. I have a prime rib I pulled out of the refrigerator so I think we are going to have a quiet private Easter at home. I pray that all have a wonderful Easter and enjoy family and friends. Love, Pam",
      "MessageIndex": 475,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Mar 4, 2008 07:57PM cancerviking wrote: I would like to join on the Feb 08 fighters group! I started my first ac on feb 1 and received my second on feb 22. did well with the first chemo and the onc (who I think is awesome) told me the n/v would not be as any worse with the remainder ac. Boy I wish this was true . After chemo on fri 2/22 I did alright with the anzemet for the first 2 day then phenergan from mon on. Had neusasta on mon and still having much nausea and diarrhea and trouble taking in fluids. Ended up in the office on 2/29 one week post chemo for hydration. Zofran not working for nausea and received dose of ativan that did nothing for me. Spent fri-mon in hospital for hydration and low white count fri 0.6 up to 5.0 by monday. I still feel very shakey when up and counting my oz of fluids to keep enough going in. Onc thinks I got the stomach flu and doesn't feel it was a chemo rx. I'm scared of my next ac treatment on 3/14. any suggestions???",
      "MessageIndex": 313,
      "PostDate": "04/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Mar 13, 2008 12:25AM cancerviking wrote: Hi everyone!! Well Thurs. pre chemo day is here again Fri will be #3 of 4 A/C I'm definitely not looking forward to it! Today is what I refer to as water loading day. I've always been terrible drinking fluids but for the next 5 days I drink until I bust. I'm praying my white count doesn't nose dive this time like it did with my last treatment. I'm trying to work and the fatigue is getting the best of me. I shoveled out the front walk after getting my daughters off to school then needed a nap before going into work. This is not like me, I'm one of those people who usually cant sleep during the day. Auroa-- sorry about the hive. Have you tried a cool oatmeal bath or alveeno bath they help for the itching. I've been sleeping with a flannel pillowcase-- It seems stay warm and soft and feels better on my bald head. Why do you loose the hair where you want it and not where you don't. I just started my period after not having one for 7 weeks. Ughh!! Having to wear pads again. The nasty adhesive always seems to have a way to find what little hair you have left!! Ouch!!! Well time to tun in Prayers for all. Crazypam",
      "MessageIndex": 416,
      "PostDate": "13/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Apr 26, 2008 08:13PM cancerviking wrote: Hi everyone I'm still here also. I had my first round of weekly chemo on Friday. So far just tired and did not sleep much last night due to the iv decadron. They also gave me 50 mg of benadryl which has the wires me and does not seem to make me sleepy. Oh well! Made a new friend at Kohls a couple of weeks ago she saw me in a fancy baseball cap and started to ask questions about where she could get hats like that. I soon realized that her question was not about hats. She is 42 like me and just starting down the chemo journey. I've been supporting her, answering questions and shocked her on Thursday by showing up at the the office for support with her first treatment and dinner for that evening. It feels good to be able to help someone else out and make a new friend. Between the chemo drying out my eyes, my eyelashes falling out into my eyes and the maple trees all in bloom, my eyes feel like they are full of sand. Finally got some allergy drops today. hope this works!. Also have an unusual se. I have had an earache off and on and when cleaning my ears last monday had fresh blood in both ears. called the office and was started on antibiotics. On friday the doctor checked my ears and said she saw old blood in the canals and evidence of infection in the l. ear but no perforation of the ear drum. She said this is strange but not overly concerned. Who knows maybe part of the lovely spring allergies in Ohio. I wore a huge mexican somboro to chemo and asked for a margarita. made everyone laugh. They are still talking about my viking helmet and now calling me Helga. I will have to come as Helga again because I am getting requests. I would like to post a picture but don't know how yet!!. hope all are doing well as we go for the homestretch Pam",
      "MessageIndex": 677,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Mar 5, 2008 10:26PM cancerviking wrote: believer, aroura and wetcoast thanks for all the suggestions on the fluids. I'm feeling better today. I took the whole week off from work and plan to lay low and recover. As for the sports drinks-- I tried some grape g2 gatorade yesterday and couldn't get it down. Tastes just like the antacid Bicitra I use to make the poor patients in labor take. Grape, sweet, and salty Yuk! Switched back to old fashioned water and force myself to drink al least 6 oz every hour. It is a chore but has to be done. Onc still thinks it was some sort of flu. Here in icy snowy Ohio everyone is sick I know that being on chemo doesn't make me immune to the same crud everyone else has. My next treatment is on March 14,(AC) I have a crazy wig to wear it came from the local craft store it is gray with about 20 pink rollers in it. My Onc already thinks I am crazy because my first AC was on my birthday and I decorated the IV pole . When she comes in the room I'm going to tell her I didn't have time to do my hair that morning. Fight with Humor!!! Take care everyone and thanks for the advice. Crazypam",
      "MessageIndex": 329,
      "PostDate": "05/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Mar 14, 2008 02:18PM cancerviking wrote: Hi everyone. Just got home from chemo #3 AC went well. I asked for something to help with the jittery and inability to sleep SE from the decadron. She gave me a script for Ativan. I'm exhausted and hope this will help me sleep well tonight. I'm also sending my snoring husband to the spare room this may help also. I wore the gray wig with curlers in it to the appointment. god a look laugh. Told my oncologist that my appoint was much too early today (10am) and I did not have time to do my hair. She told my I'm insane but gave her a good laugh for the day. Everyone in the chemo room also liked the new look Made me look like Maxine from the shoebox greetings. Hey How about a joke. There was a man who just got married and to show his love and devotion to his new wife he had her name tatooed to his manly part. Her name was Wendy and usually appeared as a Wy except during those intimate moments when her name was spelled out. On his honeymoon he had to use the bathroom and at the urinal next to him he noticed the man standing there had a Wy tatooed on him. Getting up the nerve, he asked the gentleman next to him explaining. I just got married and my new wife is Wendy and to show my love and devotion to her I got this tatoo. Do you have a wife or girlfriend named Wendy too? The man looking at him in shock replied \"No mon My tatoo says \"Welcome to Jamaica have a nice day\" HA! HA! HA! hope this makes you laugh!! Time to go have to drink more water. Pam",
      "MessageIndex": 424,
      "PostDate": "14/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Apr 30, 2008 08:07PM cancerviking wrote: Hi everyone! I went to work today. wow I am tired. This chemo sure takes the energy out of me. I am still slowly losing my eyelashes and brows. Everyone is keeps commenting on how I still have my eyebrows but they use to be thick like Brooke Sheilds now they are thin and sparce maybe I can hold on to a few for a while. Has anyone noticed their hair starting to come back? If I look closely my head looks like a peach with some white fuzz starting to come in. My hair was brown before coming out I hope it does not all come in white. I may have to take a brown sharpie marker to the stubble to make it brown again Ha Ha! Friday will be Taxol #2. Not looking forward to it but at least it is one more closer to done!! Wishing all are well you are in my thoughts and prayers Pam",
      "MessageIndex": 689,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "May 17, 2008 10:34AM cancerviking wrote: Chris terrific news I truly believe in the strength of prayer and I have been praying for you!!! Our God is an Awesome God!!! Grannie/Rose Wishing your many blessing and prayers for you as you begin your Radiation journey I was told by a coworker that after the first appt. when they do measurements and markings your actual time for radiation is about 2 min. She said that changing from her clothes to her gown was the worst part. Make sure if you have any skin sensitivity or pain you let them know right away they have creams and lotions to help. You may want to buy some camisole or tank tops to wear if skin is sensitive to wear your bra. Also she advised me to stock up on some aloe gel to help. I am a little jealous I must admit. You may be finished by the end of June. My last chemo will be on July 11 before I begin the radiation route. prayers for all Pam",
      "MessageIndex": 725,
      "PostDate": "17/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "cancervikin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61491/profile",
      "Content": "Jul 9, 2008 04:01AM cancerviking wrote:   Hi everyone,  I'm still here and will be having my last taxol on thursday 7/10 Yeah! Yeah!  Has anyone noticed the weekly side effects get worse and seem to be accumulative?  I'm so ready to be done and start the next venture the rads.  I have the appt with the radiation oncologist on Friday 7/11.  Plan to go to the chemo appt as Helga with the viking helmet and may lip sync some opera music because as they say \"It aint over until the fat lady sings\".  I can't say I'm not scared with  my triple neg breast cancer.  How are they going to reassure me that the Ca is not mets. in lungs, liver and brain?  I have not had any pet scans and am nervous.  I guess this is just part of my new life after breast cancer.  Hope rads are going easily for all you on that adventure and you all remain in my thoughts and prayers Pam S ",
      "MessageIndex": 752,
      "PostDate": "09/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    }
  ]
}