{
  "AuthorID": "CandyLuna",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
  "Posts": [
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "CandyLuna wrote: Any advice will be greatly appreciated! I will be having a mastectomy on December 1st, it will be 1 year on December 13 that i was diagnosed with breast cancer that has spread to the bones. Anyway just wanted to know how long is recovery after mastectomy and how long hospital stay is. Thanks I will fight and survive this disease! Dx 12/13/2007, IDC, Stage IV, 1/21 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724329",
      "Title": "Scared CandyLuna ailenroc"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Nov 12, 2008 07:02AM CandyLuna wrote: Thanks Lucy, i will not be doing reconstruction anytime soon, i opted not to, going to wait, might not ever go back to do it, not sure! I am 40 years old and to tell you the truth, am so tired of hospitals and Drs offices, if you know what i mean!",
      "MessageIndex": 5,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724329",
      "Title": "Scared CandyLuna ailenroc"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Nov 12, 2008 07:18AM CandyLuna wrote: Thanks so much and good luck to you!",
      "MessageIndex": 7,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724329",
      "Title": "Scared CandyLuna ailenroc"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Nov 13, 2008 09:19PM CandyLuna wrote: Hey MoodyK, glad to hear you are doing good! I hope all goes well with my surgery and i will keep you posted!",
      "MessageIndex": 16,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724329",
      "Title": "Scared CandyLuna ailenroc"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Nov 12, 2008 10:13PM CandyLuna wrote: Thanks for all the advice and hope all are well! I just hate i have to do this right before holidays, since Hurricane Ike decided to come straight to Galveston where i was doing all my chemo and stuff, it was put off until now, but i guess i should be glad they are back up running again, parts of Utmb anyway!",
      "MessageIndex": 11,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724329",
      "Title": "Scared CandyLuna ailenroc"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Nov 12, 2008 07:00AM CandyLuna wrote: yeah, when they called yesterday she said something about day surgery, and i was like \"wow, coming home same day, and then she said no, that i would be staying overnight, but still thinking is it that easy? Wow, 4 to 6 weeks, thats a long time!",
      "MessageIndex": 3,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724329",
      "Title": "Scared CandyLuna ailenroc"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Nov 13, 2008 08:20PM CandyLuna wrote: wow, with all this encouragement and positive feedback, i bet i will be back on my feet very quick! LOl ThanksGryffinSong and Carol. I will keep yawl posted!",
      "MessageIndex": 14,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724329",
      "Title": "Scared CandyLuna ailenroc"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "CandyLuna wrote: Hi all, i haven't been posting lately, but i really need help on this one. Doing chemo every three weeks, as of today, i have had 3 treatments of taxotere, going for 4th treatment of a/c next week, anyways, does anyone have any suggestions for the funny odor i've been getting, or has anyone else experienced this? It's mostly under my arms (armpits) it also looks like a diaper rash under there, and itches and hurts more and more everyday. Any suggestions would be greatly appreciated. Thanks I will fight and survive this disease! Dx 12/13/2007, IDC, Stage IV, 1/21 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706066",
      "Title": "funny smell CandyLuna CandyLuna"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "CandyLuna wrote: Hi all, i haven't been posting lately, but i really need help on this one. Doing chemo every three weeks, as of today, i have had 3 treatments of taxotere, going for 4th treatment of a/c next week, anyways, does anyone have any suggestions for the funny odor i've been getting, or has anyone else experienced this? It's mostly under my arms (armpits) it also looks like a diaper rash under there, and itches and hurts more and more everyday. Any suggestions would be greatly appreciated. Thanks I will fight and survive this disease! Dx 12/13/2007, IDC, Stage IV, 1/21 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706068",
      "Title": "funny smell CandyLuna twink"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 8, 2008 06:44PM CandyLuna wrote: Hi Sue, thanks for your thoughts and prayers, same to you!  guess no one else has any advice. Thanks anyway all.",
      "MessageIndex": 70,
      "PostDate": "08/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 16, 2008 12:16PM CandyLuna wrote: Hello all, just got home last night, first week over! Since i live 2 and a half hours away, have to stay in motel over in Galveston all week and then come home on Fridays. Missed my 2 girls so much and of course hubby, didn't miss the cooking and cleaning, lol. Took my 3 year old with me. Did chemo on Monday and radiation all week. There doing radiation on my spine area, so not sure what to expect, but so far, just been getting more exhausted as the days go by. Port is making me uncomfortable, used to sleeping on belly, now it seems i can't breathe. Probably all in my head. Sure good to here from you all, so far the people i've had to communicate with, drs. receptionsists, etc. have been pretty good! I don't know why people have to be so rude sometimes, especially when they have to work with people all day.  Quick question, what is Tamox? Sue, thank you for keeping me in your prayers, every one of you is special in your own way, and i will be thinking of you all as i go another week. Good luck and Be Strong, thats me, the crybaby talking! LOL.",
      "MessageIndex": 88,
      "PostDate": "16/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 24, 2008 06:19PM CandyLuna wrote: Hello all, just finished packing to get ready to leave for my 3rd week of rads.  Was reading all about what to eat and not, its funny, but my radiologist told me stay away from fruits and vegetables, spicy foods, and then my oncologist turns around and says eat all you want and can. ??? I'm not taking any medications right now, onc. took me off of steroids because blood pressure was going up to high, i take my pills for nausea the first 3 days and also benadryl, but the rest of the week, i don't take anything. Right now i'm having pain on my left side because of my port, i think because i can't sleep on my back, i sleep on my stomach, all my weight is there. Will keep all of you in my thoughts and prayers and will check in when i come home on Friday. One quick question is Taxotere the same as Tamoxifen?",
      "MessageIndex": 151,
      "PostDate": "24/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 25, 2008 12:58AM CandyLuna wrote: Thanks Lisa! Suppose to be asleep, leaving tomorrow for Galveston, but i have a pain on my left side where port is at, i'm thinking something is not quite right, my whole arm hurts, and it hurts more when i lay down, don't want to go to emergency just trying to hold off until i see onc. tomorrow. I sleep on it, so maybe that is it, can't sleep on my back. Any advice would help if anybody is still awake. Hugs and Prayers for all!",
      "MessageIndex": 154,
      "PostDate": "25/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 17, 2008 12:05PM CandyLuna wrote: Hello blessme, and there is no need to apologize, i'm sure we all understand, i was diagnosed on the 13th of Dec. and schuleded for a mastectomy, but was cancelled due to the fact that my cancer has mestasized to my spine area and at the moment trying to get that under control before we do the surgery. I have two large tumors on my spine area and am going through radiation and chemo. Just finished first week. Going back Monday to Galveston for another week. I will keep you in my thoughts and prayers.",
      "MessageIndex": 90,
      "PostDate": "17/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 17, 2008 03:11PM CandyLuna wrote: Congratulations Doe!",
      "MessageIndex": 94,
      "PostDate": "17/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 22, 2008 08:33PM CandyLuna wrote: Hi everyone, just got back from second week of radiation with chemo down in Galveston, glad to be home, back is starting to feel kind of funny, like a burning sensation, radiation is coming in from 3 different angles on spine. Chemo went okay, one more week of radiation to go and then we'll see where we go from there, i know i still have a bit of chemo to go, but hopefully radiation will be over. Good to see so many of you on here, pleasure to come home and read and see how each of you are doing. Be strong and hugs to all, kind of tired, so going to bed early. Love Candy from Texas",
      "MessageIndex": 140,
      "PostDate": "22/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 7, 2008 07:24AM CandyLuna wrote: Good Morning All, will be starting radiation on Monday the 11th with a total of 15 treatments, so far. I will also be getting chemo on Mondays. The radiologist said that diarrhea would probably be my biggest problem for the fact that i am going to be getting treated on my whole spine area and that the radiation would be hitting my small bowel. Just wondering anyone going through this process?  I have mets that have gone to spine and pelvis area. Any advice would be appreciated. Nice to meet all you Febs. Rad Team. Good luck to all during your treatments.",
      "MessageIndex": 66,
      "PostDate": "07/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 22, 2008 08:36PM CandyLuna wrote: Hi Allison, thanks for remembering me. Going pretty good, the week away from home is the worst for me, missing my 2 oldest girls and hubby lots, so fridays is the best for me, i get to come home. One more week of radiation and then we'll see where we go from there, right now i'm doing taxotere, i think thats right, trying to get rid of tumors first before we do the mastectomy, so i've only had 2 chemo treatments and 10 rads so far, thanks for thinking of me and hugs to you from hot Texas. lol",
      "MessageIndex": 141,
      "PostDate": "22/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Mar 4, 2008 11:12AM CandyLuna wrote: Hi Michelle, i just finished 15 treatments of radiation to my L3 and L5 last Friday, i was told it would give me diarrhea as it would be hitting my small bowel, but i didn't get diarrhea, i was more constipated if anything. Sorry to hear your mom has to go through this, but i hope it helps. I have two tumors on spine and hopefully this helped, i was also getting chemo once a week for those 3 weeks (taxotere) so its hard to tell what side effects came from what. Now i start A/C in April, oncologist gave me a 4 week vacation. I was diagnosed in December with b/c, after all tests, found out it mestasized to bones, so radiation was for that, now we start treatments for the breast cancer and then see if mastectomy is still needed after A/C. Will keep your mom in prayers!",
      "MessageIndex": 4,
      "PostDate": "04/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701524",
      "Title": "radiation to the spine ejohn ejohn"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 18, 2008 05:48AM CandyLuna wrote: Hi Sue, will be doing the radiation atleast for 3 weeks straight, and chemo every Monday, for not sure how long, go see my oncologist this morning after rad. Yesterday when i was drinking water it tasted really funny, thought it was the water, my sister said there wasn't anything wrong with it,  just wondering, does this chemo medicine Taxotere change your taste? I have really long hair and thinking about cutting it when i come home next week, chemo nurse said i had a 25% chance it wouldn't,  any suggestions?  good luck and hugs to all!",
      "MessageIndex": 99,
      "PostDate": "18/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 24, 2008 06:21PM CandyLuna wrote: Oh Trish, forgot to answer your question, really don't know what is going to happen after week 3, i know i will continue my chemo., but not sure how often, onc. said something like when i was done with rads. will let me rest for 3 weeks and then go ahead with mastectomy and then I assume will continue with chemo. Will keep you posted and thanks for asking. Hugs to all",
      "MessageIndex": 152,
      "PostDate": "24/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Jan 30, 2008 04:34PM CandyLuna wrote: I'm assumng tx means treatment? I'm learning little by little! Now what is \"sim\"?  HER1 and 2 is another ??? as well as ER and PR,  hope i'm not being annoying asking all these ???? I have them written down to ask the radiologist on Friday, very young and very understanding, so will be thrilled to stay alittle longer. LOL",
      "MessageIndex": 258,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Jan 31, 2008 11:40AM CandyLuna wrote: Hope it gets better paxton, sorry to hear you're feeling that way. I haven't even started and just reading about all this makes me tired, every little thing my husband does or asks me annoys me, i yell alot, last night i just went off on him, i was crying, he was crying, big mess! My kids are really trying to do everything right, poor things, i will be gone for my treatments, leaving on Mondays and coming back Fridays, going to miss them lots! I sit here and wonder why me? But I guess God has a plan for each of us and this was my plan.",
      "MessageIndex": 265,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "CandyLuna wrote: Just wondering, did radiation and chemo at same time last year, and my hair fell out, just growing back, fixing to start on 6 weeks of radiation, had mastectomy on December 1st, does your hair fall out just doing radiation? I will fight and survive this disease! Dx 12/13/2007, IDC, Stage IV, 1/21 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728051",
      "Title": "Will hair fall out? CandyLuna vhqh"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Jan 24, 2008 01:27PM CandyLuna wrote: Hi all, I was diagnosed on December 13th of last year, had lump on right breast for about 3 years and finally got financial help so went to check out, came back it was cancerous, lymph nodes positive, don't know how many, i think 3, anyways went for all usual test, cat scan blood work, colonoscopy, cat scan showed a suspicious mass on my spine. I have been having these terrible pains on my pelvic area that goes down to my legs, can't even bend over sometimes or I pee on myself, lol, well got scheduled for a bone scan this past Tuesday, just got results this morning mass was cancerous on spine, another suspicious mass on my skull, but Dr. said we are not going to worry about that right now. I was scheduled for a mastectomy, but all is put on hold for now, so we can take care of this tumor on spine, my question is to all is why am i going to do radiation first?  Is this stronger than the chemo? Forgot to tell all, dr. said she wants to do 7 to 12 days of radiation, if spot on skull gets smaller with radiation, then thats probably cancer too! Any input on this will be greatly appreciated. I am from Texas and going to UTMB in Galveston. Hugs to all.",
      "MessageIndex": 219,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "CandyLuna wrote: I have posted several times since being diagnosed, but just wondering why some of us get chemo before the mastectomy, while i read that some get the mastectomy right away. I was diagnosed back in December and my cancer has mestasized to my spine, don't have any pain yet, but they did find two masses on spine and just assumed it was cancer. I am Stage 1V. Done 15 treatments of radiation to spine and 4 rounds of Taxotere, will be starting A/C this coming week. Another ?  Why some get Taxotere first, i've read alot of posts, alot get the A/C first. Any advice would be greatly appreciated I will fight and survive this disease! Dx 12/13/2007, IDC, Stage IV, 1/21 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/703045",
      "Title": "chemo before mastectomy CandyLuna Callygee"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 5, 2008 05:17PM CandyLuna wrote: Had port put placed today, doing radiation first, so don't know why they when ahead and put it. Does anyone know how long it hurts, or when the pain will go away where they placed it, can hardly turn my head!",
      "MessageIndex": 24,
      "PostDate": "05/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699632",
      "Title": "Decided to get a port Analemma shafali"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Jan 30, 2008 10:57AM CandyLuna wrote: Hello all, going in to put port on the 5th. Am going to do 20 rounds of radiation with chemo, chemo being on Mondays only! Does anyone know if i can have one more night of just forgetting it all, like getting kind of loaded? LOL Will that hurt my first treatments, i just feel like having a few margaritas before i begin. All my sisters (4) and my brother (1) are getting together here at my house Saturday to discuss who will be taking me and who will be staying with me at motel and etc. Since i live 2 and half hours away i will be staying, they arranged for me to stay at the Quinta, so i will be staying 4 nights and coming home Friday after treatments. Any advice would help. Lots of hugs to all!",
      "MessageIndex": 255,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Jan 31, 2008 10:35AM CandyLuna wrote: I hear alot about redness and burning, i will be getting my radiation i'm assuming in my spine area for now, Dr. said we are going to start there to see if we can get this pain in pelvic area under control, just took pain pill, helps, but doesn't make it go completely away, bet if i took two, but then i would probably be in lala land. LOl Anyways, will that area be the one getting sore and red?  When i talked to Dr. on Wednesday he also said something about the suspicious spot on skull, is it possible to give radiation on your head too? Kind of scared, but will find out tomorrow when i go for MRI's. Hugs to all and be strong!",
      "MessageIndex": 263,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Jan 30, 2008 04:43PM CandyLuna wrote: Thanks so much 12954, much appreciated!",
      "MessageIndex": 260,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "CandyLuna",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61019/profile",
      "Content": "Feb 25, 2008 02:09AM CandyLuna wrote: Just trying to find someone out there in one of the many posts who might me able to help! I'm ususally on one of the radiation sites, but i can't sleep, i'm in terrible pain, where my port is, it goes all the way down my arm, not sure what it could be, i took two Tylenol Pms and just took a hydrocodone, hope i don't overdose!  Leaving tomorrow for Galveston for another week of rads and chemo, so i will be seeing my onc. also tomorrow, will let him know, but until then any comments would help, if theres anyone awake. Hugs to all!",
      "MessageIndex": 253,
      "PostDate": "25/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    }
  ]
}