{
  "AuthorID": "candybar1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128418/profile",
  "Posts": [
    {
      "AuthorID": "candybar1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128418/profile",
      "Content": "Apr 29, 2011 07:39PM candybar1 wrote: Thanks beacon800 for your input.  I'm new to this post and will have to look up what PLCIS means.  So sorry you had to go thru the mastectomies but from what I read you were cancer free so that's great!",
      "MessageIndex": 2,
      "PostDate": "29/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768295",
      "Title": "Lots of benign results candybar1 wonderfullymade"
    },
    {
      "AuthorID": "candybar1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128418/profile",
      "Content": "May 1, 2011 12:20AM candybar1 wrote: The excisional biopsy really wasn't bad.  It left a golf ball size void in my breast but you really can't notice visibly, can just feel it.  It does fill in with fluid.  I do have a 2in. scar but that's no big deal to me either. Can anyone tell me if the \"ductal hyperplasia of the usual type\" ever turns into the atypical type?  I would really like to just forget about all these lumps an bumps but feel like I have to watch them very closely as who knows when they'll change.  I had a niece who is in her 20's and was told she only had a \"cyst\" but turned out to be stage 3 cancer and has had a double mx and has had to have chemo and radiation.  Thank God she didn't do the \"wait and watch\" like they wanted her to...she went and got a second opinion.",
      "MessageIndex": 6,
      "PostDate": "01/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768295",
      "Title": "Lots of benign results candybar1 wonderfullymade"
    },
    {
      "AuthorID": "candybar1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128418/profile",
      "Content": "May 1, 2011 12:28AM candybar1 wrote: bdavis...It sounds like you've had a long haul with all this!  I'm just starting this \"watching and waiting\" game.  It's very exhasting to say the least.  You try and forget about it all but it's always lingering in the back of your mind.  Good luck with your surgery and hopefully the peace of mind that will follow.  Prayers coming your way right now...",
      "MessageIndex": 7,
      "PostDate": "01/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768295",
      "Title": "Lots of benign results candybar1 wonderfullymade"
    },
    {
      "AuthorID": "candybar1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128418/profile",
      "Content": "May 1, 2011 03:34PM candybar1 wrote: Thanks everyone for your postings, I think what I need to do is 1. get a copy of my mamogram and US results and see what they actually say as the doctor only says \"no problems found\" and 2. watch all the lumps and bumps and if anything feels different get it checked out.  So many of you have much bigger problems than mine and I really want to praise you all for your strength and determination.  May God bless you all!",
      "MessageIndex": 12,
      "PostDate": "01/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768295",
      "Title": "Lots of benign results candybar1 wonderfullymade"
    },
    {
      "AuthorID": "candybar1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128418/profile",
      "Content": "candybar1 wrote: My breasts are quite lumpy and ropey.  I found a lump last Sept that felt different and made a appt. with my GP who ordered the mamogram, ultrasound and an appt. with the surgeon.  The mamogram and ultrasound were \"negative\", the surgeon suggested we wait 6weeks and watch it but to return sooner if I had any concerns.  I waited the 6 weeks and it did get slightly smaller but I was still concerned so he did a FN biopsy.  I was looking for peace of mind but he called stating the pathology report stated \"aspirate is quite cellular and a neoplasm can't be excluded\".  I then went in for a excisional biopsy and those results were \"small intraductal papilloma(s), Fibrocystic changes including ductal hyperplasia of the usual type, apocrine metaplasia, sclerosing adenosis and cyst formation. Fibroadenomatous changes\".  All benign results but sure sounds like a long list of abnormal stuff!  I recently had my 6 month mamogram follow up which again was negative.  My difficulty is in trusting this and waiting another six months for the next mamogram.  I also feel like my nipple on this side is slightly retracted, could this be due to the void left when they removed two hunks of breast tissue with the biopsy?  To complicate things more I was diagnosed with Atrial Fibrillation the same week so have been dealing with all the meds and tests for this.  Ugh!  Has anyone else had all these things show up on their biopsy? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768295",
      "Title": "Lots of benign results candybar1 wonderfullymade"
    }
  ]
}