{
  "AuthorID": "candi07",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
  "Posts": [
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jul 10, 2013 09:42AM candi07 wrote: With tears rolling down my face...I thank you ladies for sharing your experiences. I'm scheduled to have my LX on 7/18. Lots of great tips, pulling strength from all of your posts. Thanks again!",
      "MessageIndex": 51,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/804030",
      "Title": "Lumpectomy: Your tips for preparation & recovery? CassDugan carol57"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Nov 29, 2013 06:39PM candi07 wrote: I had my last chemo today, my MO told me once I get my rads schedule to call her because she wants to see me 2 weeks after I finish rads. She also sent a request for me to get my port out 2 weeks post chemo treatment. I believe there will be a schedule for me to see my MO regularly.",
      "MessageIndex": 3,
      "PostDate": "29/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815184",
      "Title": "What did you Oncologist tell you on last chemo? jnprsn badger"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "candi07 wrote: Ever since I had my core needle biopsy with titanium clip I've been having pain in my upper arm. Seems weird that it would be related, however I didn't have this pain prior to the biopsy. Did anyone have the same experience. Dx 6/25/2013, IDC, 2cm, Stage IIA, Grade 3, 0/2 nodes, ER-/PR-, HER2- Surgery 7/18/2013 Lumpectomy: Left Chemotherapy 8/16/2013 AC + T (Taxol) Radiation Therapy Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/807676",
      "Title": "Post Core Needle Biopsy and arm pain candi07 LoriIB"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Sep 29, 2016 02:30PM candi07 wrote: Hi All, got my results today. Great news both enhancements are benign lesions...yay! My MO said they were sclerosis capillary lesions / atypical. She is recommending an wire needle localization / excisional biopsy. The MO, surgeon and pathologist all spoke and suggested the lesions be removed. However, there is some resistance by the surgeon as she commented 'but they are benign'. I have an appointment with the surgeon this coming Tuesday to discuss the pros and cons. But I want those jokers out ASAP. Only thing I'm not sure of is if this procedure is really the same as a lumpectomy and a little concerned about scarring as one is at 2 o'clock and the other is at 6 o'clock. Also, they will do another pathology report once they are removed as they will be removing extra tissue within a couple of millimeters of each lesion. I sure hope everyone else has something good to report. I'm so happy...this weekend I will be celebrating my wedding anniversary and now it will be two fold.",
      "MessageIndex": 3,
      "PostDate": "29/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/848412",
      "Title": "Looking for advice?!? Topete keepthefaith611"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Sep 27, 2016 04:34AM candi07 wrote: Hello, I totally understand I'm waiting too not as long as you have and it is very nerve racking. I had my biopsy last Friday 9/23 on right breast; they took samples from 2 sites. I had an MRI 2 weeks prior and my MO ordered the biopsy as they saw 2 enhancements and several other scattered suspicions. My breast surgeon didn't think the enhancements were anything to worry about and didn't think the MRI was necessary. Well I'm glad I had the biopsy to put my mind at ease. I'm 3 years out from IDC in left breast had chemo and radiation. Oh the thought of going through that again makes me sick to my stomach. Guess we have to hang in there and pray for the best results. ",
      "MessageIndex": 2,
      "PostDate": "27/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/848412",
      "Title": "Looking for advice?!? Topete keepthefaith611"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Oct 10, 2016 08:09PM - edited Oct 10, 2016 08:10PM by candi07 PBinKC so glad I saw your post. I had an MRI guided biopsied 2 weeks ago in 2 areas of my right breast. Both are atypical hyperplasia and atypical apocrine metaplasia. The surgeon says they are nothing to worrying about and doesn't think surgery is necessary. I said based on my research I've read that once these types of lesions were removed the path report came back cancerous she agreed that has happened. I opted to have them removed. Surgery scheduled for next Wednesday. I have the same fear as you.",
      "MessageIndex": 9,
      "PostDate": "10/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/846747",
      "Title": "So Far Benign, but still have more testing to go. momof4va Sweet_Pea"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 4, 2014 11:06PM candi07 wrote: Well I only have a few lashes trying to hang on and half my brows are gone...looks weird.  I looked under the light again for hair growth and I can see more than I feel I guess that's because the hair is so fine, looks like more gray too!! I keep forgetting to take my Biotin pill,,it's ironic that they are pink.",
      "MessageIndex": 19810,
      "PostDate": "04/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 8, 2014 04:08PM candi07 wrote: chiming in on the nail issues, all of my finger and first two toes have black streaks. My thumbs however are completely black. I had to start wearing dark nail polish to cover them. Pre chemo I was getting acrylic nails with light colored natural looking polish. Has anyone gone back to acrylic nails since finishing treatment?",
      "MessageIndex": 19841,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 20, 2014 08:30PM candi07 wrote: I'm seeing a little more hair growth, not sure if its the Biotin which I've been taking about 2 weeks now. The back and sides are coming in nice a flat, the front top is still fuzz like and sticking straight up. The very top is still shiny and bald...I guess that will be the last to fill in.  I can see some very fine bumps on my scalp...not sure what thats about. Anyone else have that problem? My eyelashes all fell out about a week ago and already both the bottom and top are growing back. My lashes were kind of fine to begin with so it wasn't that noticeable. I bought some fake lashes but don't think I will need them. My eyebrows are coming back as well. Also noticed the pesky one hair strand under my chin came back..welcomed it back with open arms and tweezers.",
      "MessageIndex": 19930,
      "PostDate": "20/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Feb 10, 2014 10:19PM candi07 wrote: Lago, I agree with you about new lashes pushing out the old. My lashes fell out and within a week later I saw the new set coming in. It took my eyebrows about two weeks but they grew in nicely. I too love feeling the hair fuzz. ",
      "MessageIndex": 19980,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Mar 13, 2014 05:23PM candi07 wrote: Hello ladies, for those of you taking Biotin can you share what brand you are using. I've been taking Biotin since January and I only have 1/2 inch of hair. I'm wondering if the brand makes a difference. I'm taking Nature Made Biotin Maximum Strength 5,000 mcg twice a day. I heard there are some brands of Biotin with Keratin...anyone taking that?",
      "MessageIndex": 20141,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 24, 2015 08:48PM candi07 wrote: Well ladies I had to buy another wig, my first one is old and a lot of the hair came out from using it so much. Now I only wear it when I go to the gym. The new one was costly and a little longer than my real hair was. But im to the point where I dont care if people notice it's not my hair. I am 1+ years PFC and my hair is a only 4 inches long and I have about 3 different textures....so frustrating so im still wearing an wig.",
      "MessageIndex": 21769,
      "PostDate": "24/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Dec 27, 2013 05:10PM candi07 wrote: Has anyone experienced acne with taking Biotin?",
      "MessageIndex": 19769,
      "PostDate": "27/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Dec 29, 2013 08:49PM candi07 wrote: I started taking Biotin today, Hopefully it will help with both hair and nails. I have black marks on my nails and can't wait for them to grow out. ",
      "MessageIndex": 19781,
      "PostDate": "29/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 3, 2014 08:43PM candi07 wrote: I looked into cold caps it is very expensive you rent the caps, then you have to find a place to get dry ice to store them and you have to change the cps like every 20 To 30 mins during treatment. I did A/C and Taxol and was told the cold caps don't work with those drugs. Please let us know how they work out for you should you choose to use them. ",
      "MessageIndex": 19795,
      "PostDate": "03/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Dec 27, 2013 05:00PM candi07 wrote: Hello, all I'm new to this thread. For those of you taking Biotin, how many milligrams are you taking? My PCP told me about it but I haven't started yet. I'm about 1 month PFC and think I'm ready to start taking something to boost the hair growth. Also, do you need a prescription for Nioxin shampoo? Thanks in advance for your responses.",
      "MessageIndex": 19768,
      "PostDate": "27/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 14, 2014 10:18PM candi07 wrote: Well I can finally see the little hair growth without holding my head under the light. I have little fine spike. I washed and massaged my scalp and it felt sooo good. I too remember all the bad hair days and all the money I spent at the saloon. I used to get my hair done every 2 weeks, wish I would have put that money aside to treat myself once this is all over. ",
      "MessageIndex": 19891,
      "PostDate": "14/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 21, 2014 06:47PM candi07 wrote: Hi Warrior, I'm 7 weeks PFC.",
      "MessageIndex": 19932,
      "PostDate": "21/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Mar 14, 2014 07:42PM candi07 wrote: Hi Lago, thanks for responding. I'm 3 1/2 months post chemo. I haven't taken any pictures. The back is growing more than the sides and top. I can still see my scalp on top. My hair was past my shoulders and I miss it so much. I guess I'm just a little impatient. I just tired of wearing Faith (my wig), its itchy and I think it makes the back of my neck break out. I'm not bold enought to go without Faith. Last week my husband and I were getting ready to go out and I had on my scarf and my husband said \"where's Faith\" I said \"downstairs waiting for me\"...we both got so tickled.",
      "MessageIndex": 20143,
      "PostDate": "14/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Dec 29, 2014 10:02PM candi07 wrote: triple negative, drugs ACT, no hormone therapy for m",
      "MessageIndex": 21621,
      "PostDate": "29/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Dec 29, 2014 09:18PM candi07 wrote: Hello ladies, for all of you with your georgeous hair growing back I'm happy for you and jealous. I'm 1 yr PFC and my hair is still very short I'm still wearing a wig because I'm so used to long hair that short hair doesn't look good one me. Plus I'm still angry that chemo took my hair and I'm fully recovered. I took biotin pills and they did nothing for me. Everyone kept telling me my hair was going to grow back fast and with a better grade a better well it does have a better grade, dont think ill need a perm again it's just frustrating dont mean to sound negative",
      "MessageIndex": 21619,
      "PostDate": "29/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 13, 2015 09:55PM candi07 wrote: I lost my hair 21 days from the start of chemo. My hair growth is slow everywhere, don't mind not having to shave my legs and under arms. I'm a little leary of trying different products to speed up the process, so I be a little more patient and let nature take its course.",
      "MessageIndex": 21721,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 25, 2015 08:33PM candi07 wrote: wind girl, yes I've worn extensions for the past 5 months, which I think contributed to the hair growth. However I don't like to wear the extensions because it hurts my scalp and it's hard to wash it. I never feel like I'm getting my scalp clean. The extensions get to be expensive because they only last about 2-3 months and you have to pay to get them tightened. IamNancy, I take the wig off when I get home to allow my hair and scalp to breathe plus it gets really hot. I like being able to take the wig off so I can take care of my hair. I just wash and condition it, I haven't put any heat or chemicals to my hair I let it air dry since it is so short. mommom, it's not that my hair is uneven my hair has three different textures, the front is semi straight the middle has really tight curls and the back has loose curls. I'm very grateful for the hair growth I have just wish it was faster and one texture.",
      "MessageIndex": 21776,
      "PostDate": "25/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Dec 27, 2013 09:46AM candi07 wrote: smrivr, I had my port removed 2 weeks after my last chemo it was an outpatient procedure. Very little to no discomfort. I started Rads 3 weeks after chemo. I had the option of waiting til after the new year but I wanted to get started as soon as possible. I'm due to complete rads 2/5. I told my husband to plan something really special for Valentines Day. ",
      "MessageIndex": 202,
      "PostDate": "27/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Dec 27, 2013 09:56AM candi07 wrote: I hope everyone had a great holiday. Today is rads 3/33 so far all is well. The techs are very nice, the appointments are right at 15 mins except for the day I saw the doc which was an additional 15 mins. There was one little discrepancy the nurse said not to use anything on the treated area until it's needed, the doc disagreed and said to use something right away and apply twice a day. She recommended Aquaphor and calendula cream.  Hugs and kisses to all!",
      "MessageIndex": 203,
      "PostDate": "27/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Feb 5, 2014 11:21AM candi07 wrote: I have four more boosts to go then I'm done. I am extremely exhausted, it's weird that this is caused by rads. ",
      "MessageIndex": 840,
      "PostDate": "05/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Feb 11, 2014 01:43PM candi07 wrote: I did it, I finished rads today. It was bitter sweet after I met with the doc everyone came around while I rang the bell then the staff presented me with a knitted shawl and a bracelet. It was beautiful. Although I didn't have any issues besides some mild fatigue and some itchy spots I don't think mentally I could have made without the fabulous people on this thread. Even though some stories are sad it is encouraging because it shows how strong you are. Great big hugs and kisses to all.",
      "MessageIndex": 951,
      "PostDate": "11/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Feb 16, 2014 09:13AM candi07 wrote: Hi All, Happy Belated Valentines Day! I'm done with Rads but wanted to check in to encourage everyone to hang in there...you can do this!   Hugs and Kisses to all.",
      "MessageIndex": 1021,
      "PostDate": "16/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jul 25, 2013 07:28PM candi07 wrote: I found my lump myself, it was hard and unmovable, the shape felt like a jellybean. Cousin is the only other known family member with bc.",
      "MessageIndex": 50,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/695857",
      "Title": "WHAT did YOUR lump FEEL like? gscott MomOfTeenGirl01"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Sep 29, 2016 05:49PM candi07 wrote: MelissaDallas, thanks...now I know what to look forward to since I've had a lumpectomy before.",
      "MessageIndex": 747,
      "PostDate": "29/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Dec 17, 2013 04:19PM candi07 wrote: Hello everyone, I'm joining this thread as I will be starting rads Monday 12/23. I go for my dry run this Thursday. I will be getting 33 treatment includes 5 boosts. My rads will be done in prone position is anyone else? I'm excited to get started and ready to start counting down to the finish line. I will spend some time tonight reading up on the posts on this thread for information so thanks in advance for sharing. I will post my experiences as well.",
      "MessageIndex": 118,
      "PostDate": "17/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 15, 2014 01:38PM candi07 wrote: Congrats to those who are done and welcome to all who are new. Today is 14/33, it's going by really fast..no issues to report. Today I went to the gym worked out on the treadmill, did some light weight lifting and sat in the sauna. I had a long day at work but really wanted to go and I'm glad I went.  Hugs and kisses to all. ",
      "MessageIndex": 485,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 21, 2014 08:01PM candi07 wrote: Algranna, I only get undressed from waist up. There is a woman that gets treated before me at 7:30 a.m. she wears her work clothes and goes to work right after. I only wear my bra when I'm out, when home I don't and its not because of discomfort but because of the creams and ointments I'm applying througout the day....I work from home which makes it easy to stay lubed up. ",
      "MessageIndex": 584,
      "PostDate": "21/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Dec 28, 2013 07:57AM candi07 wrote: Well today is rads 4/33 I noticed my areola on the treated breast is larger than the other. Rads tech said each week they will do x-ray for sizing...anyone else getting x-rays weekly? I still have some SE from chemo (last treatment 11/29), neuropathy in toes. Also, see some fuzzy hair when I look close under the light.  Hope everyone is doing well, take care and have a great weekend.",
      "MessageIndex": 210,
      "PostDate": "28/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 5, 2014 02:53PM candi07 wrote: Hydavis42, I go Mon thru Fri, I check in at the front desk then change into a gown, the techs come get you and get you positioned on the board. They make sure the markings on your back are aligned with the machine, this takes some adjusting you on the boards. Once everything is lined up the techs step out of the room then you get zapped, it only takes about 5 mins total time there is 15 mins. I see the doc once a week after treatment on Mondays so she can examine me and answer any questions or concerns. Before I see the doc the nurse takes my vitals total time for this appointment is 30 mins. I also get weighed and x-rayed once a week. Sometimes the techs rotate to different offices so you may see new faces frequently. ",
      "MessageIndex": 313,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 9, 2014 07:45AM candi07 wrote: These treatments affect  us on soapy different ways. Of the best advice I was given was not look for things to happen. Before I started chemo I went out and bought all this stuff, my night stand was my chemo drawer. Well I was blessed that I didn't even use half the stuff and ended up returning it he stuff to the store. Do be encouraged!  Today was 11/33 rads for me seems to be going by so fast. I can't wait to be a rad grad. ",
      "MessageIndex": 376,
      "PostDate": "09/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 14, 2014 12:03PM candi07 wrote: Good Evening, today was 14/33...15 more reg and 8 boosts to go. So grateful for nice weather no delays weather related. Scheduled my CT scan for my boosts, was told I will have to lay on my side. Everything is going well. I'm scheduled for a mamo in 2 weeks, RO wants me to wait so the two docs will figure it out. I thought it was odd to have an appointment for mamo while doing rads...ouch. Has anyone else had a mamo while going through rads?",
      "MessageIndex": 464,
      "PostDate": "14/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 1, 2014 01:29AM candi07 wrote: Lindacam congratulations!",
      "MessageIndex": 258,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 4, 2014 10:55PM candi07 wrote: Rosie9037 my rads also started about 1 week after my simulation. I was told that my treatment was 33 rads because BC was triple negative. I haven't heard of 2 doses a day. I'm praying that everything works out for you...take care! Hobbesla and Barbola, congrats on finishing Rads. ",
      "MessageIndex": 309,
      "PostDate": "04/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 11, 2014 07:31AM candi07 wrote: a couple of you have asked what creams others are using. I'm using Hydrophor (same as Aquaphor), I also just started using Calendula which doesn't spread on easily. So I put Aquaphor on first then Calendula. No issues to speak of. Today is treatment 13/33 it's going by so fast. ",
      "MessageIndex": 408,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Nov 15, 2013 08:43PM candi07 wrote: Hello, I had my rads consult yesterday, doc recommended prone position. Anyone else have the same that can share their experience?",
      "MessageIndex": 9,
      "PostDate": "15/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814355",
      "Title": "Diagnosed Stage 0, Grade 2, PR positive 80%, PG positive 20% ClaireFraser candi07"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jul 30, 2013 03:25PM candi07 wrote: Hey JeriGrace, welcome home I'm so glad to hear you are out of the hospital.",
      "MessageIndex": 714,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Aug 2, 2013 09:13PM candi07 wrote: momx2 sorry for the loss of your mom.",
      "MessageIndex": 807,
      "PostDate": "02/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Dec 2, 2013 06:40PM candi07 wrote: 2bluestar praying things go well for you tomorrow",
      "MessageIndex": 1769,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Aug 11, 2013 07:15PM candi07 wrote: Honeybunny96, get some rest and please try to eat small meals and stay hydrated. KTLe, hope your head sores subside, sounds painful. Stonel, sorry you are not feeling well. Better days are coming. To everyone else you are always in my heart and in my prayers.",
      "MessageIndex": 975,
      "PostDate": "11/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Oct 25, 2013 07:45AM candi07 wrote: Congratulations to all who have finished chemo and thanks for sharing your stories. I have definitely pulled strengh from you awesome ladies. I have 3 more Taxol treatments left...can't wait for this to be over. Hugs and kisses to all.",
      "MessageIndex": 1622,
      "PostDate": "25/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Oct 25, 2013 07:00PM candi07 wrote: 2bluestars, I'm so happy for you congratulations.",
      "MessageIndex": 1625,
      "PostDate": "25/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Dec 21, 2013 03:14PM candi07 wrote: Greetings everyone, had my dry run on Thursday. It went well there was a lot of re-positioning and a few more markings. The techs are nice, polite and very informative. My rads are in prone position my arms got tired and the side of my face was aching from being in the same position for awhile, other than that all went well. My first rad tx is Monday, can't wait to start. The facility is nice they actually have a rock garden where you can take a rock home and decorate it and place it in the garden after your last tx, there is also a bell to ring. Can't wait for that day. Also, had my port removed Monday, I'm so happy to get that out.  Hugs and kisses to all",
      "MessageIndex": 163,
      "PostDate": "21/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 2, 2014 10:15AM candi07 wrote: onerunneralwasyrunner, my RO recommended calendula cream, which I will be ordering from Amazon. In the meantime I'm using generic brand of Aquaphor the doc gave me  which is very light and not as thick as the one you purchase in the store. ",
      "MessageIndex": 288,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 2, 2014 03:58PM candi07 wrote: annika12, welcome! You will find a lot of good information on this thread. Sorry you have to be here with us, but glad to have you. Everyone on here is very supportive and open to share their experiences.",
      "MessageIndex": 290,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 7, 2014 12:25PM candi07 wrote: Holeinone you and I are on the same schedule, I had #9 today as well. I don't have any issues so far, doc says they may creep up one me. ",
      "MessageIndex": 351,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 8, 2014 01:02AM candi07 wrote: aeryno, I've been working out almost everyday during rads no issues yet, RO says it's ok as long as my body can tolerate it. I say go for it. I'm actually thinking about doing a half marathon, it will be my first just not sure where to start or how to start getting myself ready. ",
      "MessageIndex": 361,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 30, 2014 12:53PM candi07 wrote: Welcome to all who are new and congratulations to all who are done! Today was 25/33 tomorrow I start my boost so excited. I have no skin breaks, rashes or pain just an occasional itch and some slight pulling. I ordered calendula but only used it a few times I've men using the Hydrophor the doc gave me and when ran low they gave me more. I can't wait for February 10th. ",
      "MessageIndex": 759,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Sep 29, 2016 05:38PM candi07 wrote: Question ladies, is an excisional biopsy the same as a lumpectomy?",
      "MessageIndex": 745,
      "PostDate": "29/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jul 28, 2013 07:51PM candi07 wrote: Can someone tell me what 'fills' are?",
      "MessageIndex": 663,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jul 29, 2013 06:09PM candi07 wrote: JeriGrace, I'm sorry to hear you are in the hospital. Prayer that your wbc numbers rise so you can go home. Sending warm hugs to you .",
      "MessageIndex": 689,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Aug 1, 2013 12:16PM candi07 wrote: Good morning Daisy, Praying everything goes well!",
      "MessageIndex": 763,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Aug 7, 2013 05:24PM candi07 wrote: Hannariggs, I love the story about your dog. I needed that.",
      "MessageIndex": 901,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Aug 9, 2013 10:44AM candi07 wrote: Hannariggs, thanks for sharing that story about the woman who didn't do chemo. I was feeling so upset this past weekend about chemo and was thinking well maybe I just won't do it. In the back of my mind I know that wouldn't be the right decision. My doc did the adjuvant online tool to show my rate of non-recurrence; without chemo its 55% and with chemo 77%. At first I was like that's not a major difference, but I'm going to do what I can to prevent this cancer from coming back. ",
      "MessageIndex": 927,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "candi07",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183749/profile",
      "Content": "Jan 2, 2014 02:27PM candi07 wrote: Girlstrong, I can feel hair fuzz everywhere except the top of my head and near my temples. Praying its just due to slow hair growth and not a sign of permanent hair loss. No hair on legs, armpits..hope this is not TMI but in the private area I never lost all my hair, there is just one spot that is bald...LOL. I started taking Biotin Sunday, hoping that will help speed things up a little. I'm sooo tired of the wig, tugging an pulling making sure its on right and trying to make it look natural. My eyebrows and lashes are almost gone...I started using Brian Josephs brow and lash gel, hopefully it will help salvage what I have left. I been drawing in my brows, everyday they come out differently...UGH.",
      "MessageIndex": 1889,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    }
  ]
}