{
  "AuthorID": "candlemason…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142784/profile",
  "Posts": [
    {
      "AuthorID": "candlemason…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142784/profile",
      "Content": "Jan 9, 2012 03:03PM candlemason wrote: If he doesn't shape up, I would get a new doctor as this is your life you are talking about.  He obviously is overbooked or something.  My doctor called me the day after my core biopsy and then made an appt that evening after his last appt to sit with me and my husband and go over everything.   Of course I was in bad shape and not able to comprehend too much but now after the shock has subsided somewhat, I can continue with the testing he has arranged and meet with him this Thursday to find out what's next. I know I will be having a masectomy but not sure when.  I'll be sure to bring a pad of paper to take notes as I'm finding that there are lots of things to think about and decide!  Good luck and bless you all that are going through this.",
      "MessageIndex": 7,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780728",
      "Title": "Feeling so upset at doctor liveit56 liveit56"
    },
    {
      "AuthorID": "candlemason…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142784/profile",
      "Content": "Jan 9, 2012 06:20PM candlemason wrote: oh boy, it's amazing how everyone's situation is different.  I had my core biopsy on January3rd and they told me that they would have the results in 24 hours and would call me either way.  That was okay with me.  So we waited for the call (I work at home) and it came right on time and the dr asked first how my biopsy was as it was a difficult one and bruised really bad.  And then he said, \"well, I have bad news\".  That was it and I was shocked and horrified and he said my surgeon would be calling me to discuss treatment.  Then 30 mins later, my surgeon called and asked me to come in after his last appt so he could go over everything with me.  We went in and the office was closed and he sat with us until I stopped crying and was very reassuring.   Today I had a bone scan and a chest xray to see if it's spread as one cancer was invasive and the other was ductal - I think (I was in a fog).  I'm not up on the vocabulary yet but I'm gradually researching everything and will be ready for my followup appt this Thursday.  I'm glad I found this group.  Good luck to everyone.",
      "MessageIndex": 152,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780533",
      "Title": "How did you hear biopsy results--phone or appt? frazzledmom schoolmom"
    }
  ]
}