{
  "AuthorID": "Cannoli1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198421/profile",
  "Posts": [
    {
      "AuthorID": "Cannoli1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198421/profile",
      "Content": "Mar 30, 2014 01:36PM Cannoli1 wrote: Hi peacestrength, I am really not sure. When I went to see my oncologist, I asked her what the chances of my cancer returning were after treatment (chemo, radiation, and hormone pills), and she said that after looking further into the report that was generated from my surgery....about 15%. I am not sure what this is based off of. She did say that without treatment the odds of returning were 50 - 60%.",
      "MessageIndex": 366,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "Cannoli1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198421/profile",
      "Content": "Mar 31, 2014 05:20AM Cannoli1 wrote: Holeinone, From everything I have read, and everything I have been told by my doctors, I know I have every reason to stay positive. It seems as if all information leads me to the glass being much more than half full when it comes to a positive prognosis. Has anyone had tissue expanders inserted at the time of a mastectomy? I am currently having my tissue expanders filled on my off weeks from chemo, but, the radiologist I will be seeing after chemotherapy has told me that my tissue expanders are in danger of being damaged from radiation. Has anyone had experience with this? Thanks",
      "MessageIndex": 370,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "Cannoli1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198421/profile",
      "Content": "May 12, 2014 05:50AM Cannoli1 wrote: Hi RobinLK, How are you feeling on the Tamoxifen? I am nervous about beginning to take it. I am also nervous that side effects state it can cause hair loss. I've just begun to see hair growth from my chemo.",
      "MessageIndex": 385,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "Cannoli1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198421/profile",
      "Content": "May 29, 2014 02:30PM Cannoli1 wrote: Hydavis42, Yes, I started my Tamoxifen last Friday night (May 23rd). The only SE so far from the Tamoxifen is that I think my nightly hot flashes have gotten a bit worse. Did my CT Sim for rads 5/15. I called today, and they said it was \"still in progress.\"  I need to wait at least one more week for rads anyway because I had my chemo port removed yesterday. It was on the same side that I will be radiated, so my breast surgeon felt it should come out. He said sometimes rads will tighten the skin and make it more difficult to take out....glad to have it gone because it one less reminder of everything I have been through since January, but I am a bit sore today from it, and there is no way, at the moment, I could raise my arm above my head for radiation. I am so thankful for this board. Truly people that understand.",
      "MessageIndex": 402,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "Cannoli1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198421/profile",
      "Content": "Jun 10, 2014 09:32AM Cannoli1 wrote: Holeinone, Thank you for the reply. My plastic surgeon said that I need to wait at least 6 months after radiation to have my permanent implants put in. If all looks good after radiation, I am going to try to talk her into having it done before then. I am glad that rads went well for you. What did you use on your skin during rads? I am going back to work June 25th, with 2 weeks of rads still to go after the 25th, so I hope I do not have any trouble with my skin. I am so very tired of being home all of the time. I've been fortunate that my job has allowed me to work part-time from home during treatment, but I miss the human interaction, and they need me back at work. My husband is gone most of the day, and it gets very lonely at home by myself.",
      "MessageIndex": 421,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "Cannoli1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198421/profile",
      "Content": "May 11, 2014 03:32PM Cannoli1 wrote: I just finished my last chemo treatment a week and a half ago, and I have new hair growth starting!!!!!!!!!!!  This brought me happy tears. My normal hair color is dark brown, and my new hair growth seems to be a salt and pepper mix of gray and dark brown. I start radiation and tamoxifen in a few weeks. By the way, has anyone taken tamoxifen while radiation, or have most waited until after radiation is over? My ONC says ok to start during radiation. I am meeting with my radiation oncologist Wednesday, and I am going to ask him.",
      "MessageIndex": 383,
      "PostDate": "11/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "Cannoli1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198421/profile",
      "Content": "Jun 10, 2014 07:59AM Cannoli1 wrote: JFV, Please tell me how you kept yourself strong. We have a similar diagnosis. I am finished with chemo, started Tamoxifen a couple of weeks ago, and I will be having my 5th of 27 rad treatments today (23 regular, and 4 boosts). I am so afraid of what it will do to my skin. I have an olive skin tone, so I hope rads spare me a bit. My tissue expanders hurt so bad that some days I feel as if I am going to go out of my mind. The doctor at my radiologists office feels that putting my arms over my head during radiation is probably making the pain worse. He suggested I take Aleve, but it did not help. I am going to be going back to work June 25th, and I don't know how I will handle work and the pain.",
      "MessageIndex": 419,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "Cannoli1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/198421/profile",
      "Content": "Mar 29, 2014 11:02AM Cannoli1 wrote: Hello everyone. I am a \"newbie\" to Stage III BC. In January, I was actually diagnosed with what by breast surgeon thought was Stage II, but, in February, after surgery for a double skin and nipple sparing mastectomy and tissue expander breast reconstruction, my cancer was found to be Stage IIIa due to the involvement of 7/16 lymph nodes. I had my first of 8 rounds of chemotherapy about a week and a half ago, and I will follow chemotherapy with 25 rounds of radiation. I had a PET Scan 2 weeks ago that showed, thankfully, that I am currently cancer free, but I am still so frightened of everything I will need to go through the next 4-5 months in terms of treatment. My oncologist said that my prognosis is good if I follow her treatment plan, only about a 15% chance of my cancer ever returning during my lifetime, but I so just want to feel normal again. I have a very supportive husband; he is a blessing. My employer has allowed me to work part-time from home while I am on chemotherapy, which I am also thankful for. Can anyone who has completed treatment for Stage III breast cancer let me know if feeling normal will ever happen again? When will I stop being afraid? Will I ever feel like just a normal functioning human being again; like a beautiful woman again?",
      "MessageIndex": 360,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    }
  ]
}