{
  "AuthorID": "cantgarden",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123527/profile",
  "Posts": [
    {
      "AuthorID": "cantgarden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123527/profile",
      "Content": "Mar 24, 2011 04:59AM cantgarden wrote: srbreastcancersurvivor, no idea about the pathology.  I've read that a re-excision is necessary in about 40% of lumpectomies done, so you would think there would be a better way.  I know my doc said they took an xray of the mass they took out while I was still on the table to confirm the clip was in there, but maybe pathology while-u-wait is an impossibility.  I was just wondering why they wouldn't take out more initially, but I guess they try to be sparing? thegood5 - thanks for the info.  I'm only planning on taking a few days off from work this time, so I'm just wondering if I'm going to be able to make it!  Figured I'd bring a pillow in...  Thanks for the input - onward!",
      "MessageIndex": 20,
      "PostDate": "24/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765568",
      "Title": "How many others had to have more surgery? BioAdoptMom3 cantgarden"
    },
    {
      "AuthorID": "cantgarden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123527/profile",
      "Content": "Mar 31, 2011 07:08AM cantgarden wrote: Had my re-excision this past Monday, 3/28.  Waiting for pathology now.  Really hope I don't have to do this again!  They did a good job, the incision is exactly the same as last time and you probably wouldn't even be able to tell I had a 2nd surgery.  Oh, except that my boob keeps getting smaller!  I swear it's almost a cup size smaller than my other breast, kind of weird, but I bet no one else would notice.  Radiation oncologist appt. next week....",
      "MessageIndex": 23,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765568",
      "Title": "How many others had to have more surgery? BioAdoptMom3 cantgarden"
    },
    {
      "AuthorID": "cantgarden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123527/profile",
      "Content": "Mar 23, 2011 07:00AM cantgarden wrote: I had a lumpectomy (DCIS) on March 7th and have a re-excision scheduled for this Monday, March 28.  My doc said the margins were negative but she wasn't comfortable with the size of the margin.  I was really bummed when I found out I had to have more surgery and part of me wanted to just take my chances and move on, but I'm in pretty good headspace about it now.  For all of you who had to have them go back in, how did you find the recovery the second time around?  I kind of feel like since they are cutting open the incision that's been healing for a couple of weeks, it will almost be worse!  I also have a massive purple bruise on the opposite side of my breast where the incision was made and I'm hoping that doesn't become even more aggravated.  Thanks everyone, this was my first post! Julie",
      "MessageIndex": 17,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765568",
      "Title": "How many others had to have more surgery? BioAdoptMom3 cantgarden"
    },
    {
      "AuthorID": "cantgarden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123527/profile",
      "Content": "cantgarden wrote: Hi all, I'm almost two years out from my lumpectomy.  I went through radiation in June of 2011.  I took Tamox for a year but became a raging beatch (!), so I took a break from that and my onc put me on Evista.  I've been taking that for a little over a month now.  The last few days, I've had a throbbing, dull pain in my affected breast and in my underarm, which is now alternating with a burning sensation.  Wondering if this is a side effect of the Evista (although the SEs are supposed to be the same as Tamox and I've never experienced this before) or if this is something else.  I'm scheduled for a mammo at the end of Dec. and a follow up MRI sometime after that, so I figure I'll wait for those, but just curious if any of you have experienced anything similar.  Just weird after all this time!! Thanks! Julie Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797501",
      "Title": "Stinging Throbbing Pain! cantgarden hugz4u"
    },
    {
      "AuthorID": "cantgarden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123527/profile",
      "Content": "Dec 11, 2012 02:54PM cantgarden wrote: Thanks, yeah, the more I read about lympedema, the more it seems that might be the case.  Blah! It's gotten worse as the day has gone on, so I made an appt. with my doc for tomorrow.  Will update as soon as I know more.",
      "MessageIndex": 2,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797501",
      "Title": "Stinging Throbbing Pain! cantgarden hugz4u"
    },
    {
      "AuthorID": "cantgarden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123527/profile",
      "Content": "Apr 6, 2011 07:55AM cantgarden wrote: My doc told me that although I could go back to the gym right after, I could only walk on a track or use the bike that has a seat with a back.  They didn't want me exerting my arms at all.  She specifically said \"no weights\" for two weeks after surgery and said I shouldn't lift anything generally over 10 pounds until after my post-op appt. which is scheduled on April 26.  My 2nd lumpectomy was on March 28.  Hope this helps.",
      "MessageIndex": 3,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767066",
      "Title": "lumpectomy NurseBeth cantgarden"
    },
    {
      "AuthorID": "cantgarden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123527/profile",
      "Content": "Apr 28, 2011 10:43AM cantgarden wrote: I'm starting today too.  What I thought was pretty wild is the tech I'm dealing with is my age and just finished her own treatment 3 weeks ago.  She just started on Tamox, so I assume we will have a lot to talk about over the next couple months.  I'll be thinking about all of you today! Julie",
      "MessageIndex": 40,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "cantgarden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123527/profile",
      "Content": "Apr 19, 2011 09:28AM cantgarden wrote: I have my simluation this afternoon and I will likely start next week sometime, so \"mostly\" in May!  I have also signed up for the Herceptin clinical trial for DCIS and I will find out where I stand with the randomization today. ",
      "MessageIndex": 4,
      "PostDate": "19/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "cantgarden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123527/profile",
      "Content": "Apr 26, 2011 09:05AM cantgarden wrote: Had my simulation last Tues and I start this Thurs.  33 treatments, 28 full-breast and then 5 localized.  Feeling pretty comfortable with it at this point.  I'm more worried about the tamoxifen than anything else, but one step at a time.  I signed on to do the Herceptin clinical study (DCIS) but was randomized into the group that won't get the 2 doses.  Will stay in touch. Julie",
      "MessageIndex": 26,
      "PostDate": "26/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    }
  ]
}