{
  "AuthorID": "CantStopNow…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114402/profile",
  "Posts": [{
    "AuthorID": "CantStopNow…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114402/profile",
    "Content": "Nov 30, 2010 10:39PM CantStopNow wrote: Hi, I am 26 years old as well... I am recovering from my bilateral mastectomy I had 12 days ago (ace bandage and all). I just got my drains out yesterday. I HAD DCIS (had not have... yea!!); I also had atypical ductal hyperplasia as well as papilloma. My DCIS was not high grade. However, it grew very fast, as my tumor/mass was larger than a golf ball after 8 months. I do not have the BRCA1 gene. The cancer was only in my left breast. The reason I choose to have a bilateral mastectomy, is because I have been playing the \"what if\" and waiting game for almost 5 years. I had had 3 surgeries prior to my bilateral mastectomy. The first surgery, which was 2 years ago, came back as papilloma and it was benign. Just less than 2 years later (after the doctor told me it could come back maybe in 10 years, but that it was unlikely), I was diagnosed with DCIS, atypical Hyperplasia, and more papilloma. Making a decision was extremely hard. However, I knew in my heart from the start what was right for me, based on my past, my present, and my future (my dreams/goals). My advice to you would be to educate yourself (knowledge is power). I spoke with amazing doctors, such as the CEO of LIVESTRONG. I went to as many lengths as possible to learn about my options. Learn what you can, stay calm in this dark and scary time, lean on friends and family, but most of all trust your core and know that this is your body and your life, take control!  Your health is more important than ANYTHING. Talk to your school/work and see what you can do to put things on hold right now. Having to take an extra semester is nothing (believe me). You need to do what is best for your health.  = I know the \"not knowing\" game - it's the worst, and it's one of the main reasons I decided to move forward with my choice of treatment. All my very best to you, from someone in who knows, from someone who is recovering. *There is a book by Andrea Schneider, who was also diagnosed with DCIS - it might help (it was a little scary for me to read, but I told myself it was more for me to learn) You Are Not Alone: Life After a Breast Cancer Diagnosis",
    "MessageIndex": 7,
    "PostDate": "30/11/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/758908",
    "Title": "26 years old, considered extremely high risk and worried meechell83 aslatenrn"
  }]
}