{
  "AuthorID": "capippy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
  "Posts": [
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "Sep 12, 2015 06:49AM capippy wrote: That's wonderful!!! So happy for you. xoxoxo",
      "MessageIndex": 6,
      "PostDate": "12/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/834829",
      "Title": "Waiting for oncotype...just venting! Ltam16 Englishmummy"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "Sep 11, 2015 04:59PM capippy wrote: I'm with you, Ltam16! I met with the MO today and we decided to do oncotype. She'll send it off Monday so I'll have another 2-3 week wait. Won't it be wonderful when we AREN'T waiting on some test result to live our lives?",
      "MessageIndex": 3,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/834829",
      "Title": "Waiting for oncotype...just venting! Ltam16 Englishmummy"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "Oct 3, 2015 11:26AM capippy wrote: Oh my goodness, Meezers, you poor thing. That made me weak in the knees. I hope you heal quickly and get passed this. Many hugs. Five days of rads and I'm not even pink. That's a good sign, right? And remember when I said it smelled funny? I was right - my incision is infected. The funny thing was that I saw my breast surgeon before my radiation and told her I thought my breast was weepy and smelled funny; she looked at it and said 'No, looks fine, just stop putting any cream on it for a few days.' Then I went to radiation (literally ten minutes later) and the technician told me that there was a smell coming from the incision and it looked infected to her. After Rads I saw the RO who told me it was infected. WTF Breast surgeon? So I'm on heavy duty abx and cream over the weekend and they'll check it Monday morning to see if I can continue with rads. They wouldn't stop after 5 because of an infection, would they? Give me infection-fighting vibes so I can keep going on Monday! ",
      "MessageIndex": 584,
      "PostDate": "03/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "Oct 16, 2015 10:23PM capippy wrote: Hi all - I thought I'd give a progress report for those coming behind me, as I've had a remarkably easy time. Today I had my 14th treatment - only two more to go. (In Canada - doing 16, no boosts). I'm slightly tender and pretty itchy, but other than that, no pain, burns or skin issues. I'm still wearing a regular bra during work without issue. My RO said the week after I finish may be worse before I'm out of the woods, but honestly, I've had it so easy. I was tired the first week but not since - and that may even have been the tamoxifen as I started it a few days before rads. Just wanted to share that so others just starting know what a wide range of experiences are possible. :)",
      "MessageIndex": 916,
      "PostDate": "16/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "Sep 17, 2015 01:18PM capippy wrote: Looks like I'm here too! Still waiting on oncotype to be sure we don't need chemo first, but we've set my first of 16 treatments for Sept 28th just in case. Did simulation today!",
      "MessageIndex": 211,
      "PostDate": "17/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "Sep 25, 2015 07:35AM capippy wrote: I received my Oncotype score (17!) - no chemo so I start Rads on Monday! Yea to getting this bloody show on the road. I've been so scared of having to have chemo that I've not really thought too much about radiation. Now that it's Monday - eek. What should I know? Any prep other than moisturizing as much as I can between now and Monday? How fast will the fatigue set in? I've got a busy work schedule for the next few weeks... (I'm doing 3 week plus two). Do most people just continue to work no problem?",
      "MessageIndex": 359,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "Sep 30, 2015 05:47PM capippy wrote: hi everyone. :) I had my third today (doing 16) and so far so good. I also started tamoxifen on Friday, so it's hard for me to tell what is causing what symptom. I've been quite nauseous and tired since Monday but I'm guessing that could be the tamoxifen. My incision also seems to be weeping and crusty - is that a result of radiation ? I'm seeing my surgeon on Friday, so of course I'll ask her. And strange question, but does anyone else sort of 'smell' something while the machine is delivering the rads? It freaks me out, like I can smell my own flesh burning. Of course, it is probably just in my paranoid head ... ;)",
      "MessageIndex": 520,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "capippy wrote: Hi Everyone. I feel a little like I am underwater or going through sort of a surreal out of body experience, but hopefully this will all be just a blip on my life's radar. Here is my situation. I get regular mammograms, my last one in May showed some clusters of calcium or something like that. Had a compression mammogram, still suspicious. Had Ultrasound - radiologist said 'much ado about nothing' so I was surprised to be called back for biopsy. Had biopsy - showed ADH cells. Met with surgeon who said she wasn't concerned but wanted me to do lumpectomy to be sure. Had lumpectomy on July 2nd. Had follow up appointment with Surgeon on Friday and it is cancer. My surgeon is not very communicative. She just said a 'small cancer' - I pushed for more info and asked her what type, etc so she (almost unwillingly) told me it was mucinous carcinoma - a rare but usually slow moving invasive cancer. My pathology report is going to the Tumour Board on Tuesday and they will decide action. She said I was Estrogen positive so would be out on tamixofen, and the board would decide if I need radiation and/or re-do the lumpectomy. I'm kind of lost. I don't know what to ask. I've been reading up (this board is awesome) but it feels like they are just going to 'tell' me what's happening. Do I have a choice? I guess it's my body, but shouldn't I leave it to the experts? I asked the surgeon if there is a chance that I have it in the other (left) breast and she was very dismissive - that they were not signs of that on the mammogram. I pointed out that they were surprised to find cancer in the right breast when they got the path results, so maybe it's in both. She didn't agree, so I guess that's good. I do not want this to be my life now - always waiting, always worrying, another lumpectomy, another biopsy. I can't deal with that. Maybe the board will meet on tuesday, say it was a clear margin and that I'll just start tamoxifen and monitor with mammograms yearly. But if they want me to do radiation and another lumpectomy… won't I limit my reconstruction options if it comes back? Am I crazy to even ask the question if I'm a candidate just to have a double mastectomy and move on? I can't believe all these words are part of my vocabulary now. I'm sorry for the ramble. I'm kind of lost. Am I overreacting? Any advice would be welcomed. CA 46 at Diagnosis, Oncotype 17 Surgery 7/2/2015 Lumpectomy Dx 7/24/2015, IDC: Mucinous, Right, <1cm, Stage IB, Grade 2, 4/6 nodes, ER+/PR+, HER2- (IHC) Dx 7/24/2015, DCIS, Right, Stage 0 Dx 7/24/2015, LCIS, Right Surgery 8/6/2015 Lumpectomy; Lymph node removal: Sentinel Hormonal Therapy 9/24/2015 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Radiation Therapy 9/27/2015 Whole-breast: Breast, Lymph nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/833686",
      "Title": "I guess I am here now. What questions do I ask? capippy capippy"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "Sep 21, 2015 12:40PM capippy wrote: Thanks fralaliso! Good to know that I could get them if I need to! I guess they tell your oncologist that you got them? I don't want to make her think I'm second guessing her..lol Just ridiculously anxious to have this over. Thanks for the info! Keepthefaith - I'm not doing any other tests at this point. My MO wouldn't even have done the oncotype; she was comfortable going straight to radiation, but for my peace of mind, she ordered it. She said it would have to be very high for her to recommend chemo, so I'm just anxious to find out. I think if I don't hear by Friday morning I'll call the MO's nurse and get advice. I'm glad you are feeling fine and wish you continued health! xo ",
      "MessageIndex": 3,
      "PostDate": "21/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/835161",
      "Title": "Curious: Calling genomic health to get oncotyope results? capippy SueH58"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "Jul 27, 2015 07:56PM capippy wrote: Thank you so much for replying everyone; for the support and for the advice. I'm feeling a bit calmer today and have spent the weekend reading as much as possible. I do think my surgeon is very to the point (and has very little communication skills) but I really trust my family doctor with my life so I called her today and had a grand chat. She is going to get all of my reports and I'm going to see her Thursday morning to get all the details of the cancer and to discuss everything with her in detail. I will feel a little bit more in control when I know the type, size, grade etc and get my Doc's feedback and benefit from her experience. I'm feeling much more positive, knowing that I will get the info I need in a couple of days - so I'll not panic until I need to. :)",
      "MessageIndex": 4,
      "PostDate": "27/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/833686",
      "Title": "I guess I am here now. What questions do I ask? capippy capippy"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "Sep 24, 2015 11:27AM capippy wrote: thank everyone! My MO just called with the results! Only seven business days for turn around - pretty damn good! It's 17! No Chemo! Starts rads as scheduled on Monday! :)",
      "MessageIndex": 11,
      "PostDate": "24/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/835161",
      "Title": "Curious: Calling genomic health to get oncotyope results? capippy SueH58"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "capippy wrote: While I feel myself age exponentially every day while waiting for results (lol) I've been searching to see how long it takes on average. I'm a little under the gun, as I am booked to start Radiation on Monday (Sept 28th) but that will be cancelled if the oncotype results come back high. That means, I am assuming, that if my MO doesn't get the results before this Friday, it will have to be postponed. :( We decided on the 11th to do the test, and she said it would be sent on Tuesday 15th, and in her experience the results are back by 6-7 business days, which would be Thursday 24th. eek - tight. (Her nurse, however, told me that it can and has taken up to three weeks!). How long is it taking lately? I'm not sure what will happen if I don't hear anything before Monday. Do I still go for radiation and assume that the RO and MO are talking to each other? Do I call and cancel? I noticed in many other threads that people have called Genomic to get results. Would they actually give me results over the phone? How do they know it's me? lol. I really don't want my sessions to be delayed or cancelled as I have a trip booked for the day after I finish. (Is that a bad idea? I'm assuming I'll be tired and sore, but still able to travel?). Well this turned into 20 questions... ;) 46 at Diagnosis, Oncotype 17 Surgery 7/2/2015 Lumpectomy Dx 7/24/2015, IDC: Mucinous, Right, <1cm, Stage IB, Grade 2, 4/6 nodes, ER+/PR+, HER2- (IHC) Dx 7/24/2015, DCIS, Right, Stage 0 Dx 7/24/2015, LCIS, Right Surgery 8/6/2015 Lumpectomy; Lymph node removal: Sentinel Hormonal Therapy 9/24/2015 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Radiation Therapy 9/27/2015 Whole-breast: Breast, Lymph nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/835161",
      "Title": "Curious: Calling genomic health to get oncotyope results? capippy SueH58"
    },
    {
      "AuthorID": "capippy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218378/profile",
      "Content": "Sep 21, 2015 01:09PM capippy wrote: Thanks, Hopeful! Good to know - I never really thought about possible delays. The trip was booked before I knew I'd be dealing with all of this - it's for work so I'm okay to wait and see how it goes before deciding! If I finish in time and feel well I'll go, if not - no biggie. :) I think I'm going to have to accept I can't control any of this and just go with the flow. Something I'm quite unaccustomed to, lol.",
      "MessageIndex": 5,
      "PostDate": "21/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/835161",
      "Title": "Curious: Calling genomic health to get oncotyope results? capippy SueH58"
    }
  ]
}