{
  "AuthorID": "carandkensmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44675/profile",
  "Posts": [{
    "AuthorID": "carandkensmom",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/44675/profile",
    "Content": "carandkensmom wrote: Okay, so I am not sure that I can say I am really worried... But I would like some support! A year ago I found a lump in my R breast, went to MedExpress clinic and the DR gave me a Rx for infection of milk duct. So a year later I decide to go to ObGyn, who sends me for mammo (my 1st, I am 40) and US of R breast. He felt the lump and 2 others felt nothing in the left. Mammo: Moderately dense some faint microcalc bilaterally althogh more so on the Right than the left. In the upper outer R breast these appear to be very loosely grouped without pleomorphic apperances and there are no significant clusters of mico... in either breast. Recommends one year follow up... that was great. However the US results say: On right side there are no cystic or solid nodules or any architectural distortion... What?????????????? I and the MD can feel something! And on the L, there are 3 cysts. Normal exam except for 3 simple cysts involving the l breast. So today my ObGyn said he was surprised but not concerned and is sending me to a breast surgeon, who by the way can not see me until 3/8/07... unless when she sees the results of mammo and US decides I should be seen sooner... I really thought that this would be over today, or that at the least he would send me to repeat the US... because I ofcourse assumed that the tech messed up, didn't push hard enough or something?!@#?! There isnt a history on my mom's side and we have no idea about my dad's side. Whould I be at risk if on dad'ws side??? Also gave birth to my beautiful son 5 years ago, from what I understand child birth after 30 increases risk??? Sorry to babble....I dont have anyone to talk to about this (Hubby to nervous and anxious!) THANK YOU ALL FOR LISTENING!!! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "31/01/2007",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/519437",
    "Title": "Mammo and US different results carandkensmom nurseekp"
  }]
}