{
  "AuthorID": "caregiverdaughter",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163773/profile",
  "Posts": [{
    "AuthorID": "caregiverdaughter",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163773/profile",
    "Content": "caregiverdaughter wrote: My mom was recently diagnosed with IDC.  They have not yet staged her.  She is staying away from the internet but I'm trying to get an idea as to what questions should be asked and what I need to know as her primary caregiver in this process. My mom is 56 years old.  The mass that I assume is the leader of the pack is 3.2cm.  They performed a needle biopsy and it obviously came back as malignant.  Two other needle biopsies were performed, one on what I believe was a breast lymph node, and the other was an axillary.  Both were malignant.  I was not there when she received her results so this is the best that I have. The first step is to meet with a surgeon, not an oncologist.  We do not know what they will recommend but my mom is pretty well set on a mastectomy.  Surgeon appt is this week and I'm really unsure as to what questions to ask because I simply don't know what I don't know.  After the surgery (whatever surgery is decided upon) we wait for pathology reports and then see an oncologist.  I'm confused as to the order of doctors here; I would have thoughts that an oncologist would be guiding us along the way? I see all these identifiers on this board: ER+/PR+, HER?, stage, grade, nodes...when do we get all of this information?  Is that information the surgeon identifies or the oncologist? Also, my mom had not had a mammogram in nearly a decade (or any other cancer screenings for that matter). This causes me to be concerned about the cancer having spread over time.  How do they determine if it has spread and when do they start down that path? Any guidance you can provide would be appreciated. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "04/11/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795905",
    "Title": "Mom recently diagnosed; so many questions caregiverdaughter mgdsmc"
  }]
}