{
  "AuthorID": "CarlaK",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
  "Posts": [
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Dec 17, 2013 02:03PM CarlaK wrote: HVV-I'm so sorry you are in a difficult place and trying to make this difficult decision. The release of that study has really sent me second guessing my decision to have surgery (had left mastectomy in Aug). I  feel like you have to jump into the unknown as best you can, because it's only after your path report is back and you recover will you know if you did the right thing. I just got out of the hospital for a mastectomy/radiation related cellulitis and abscess-they don't tell you that this stuff can happen in 5% of patients months to years out from surgery. If I'd had a crystal ball and known that I was going to have unclear surgical margins and get this infection, would I have decided against surgery? Maybe. But there's also such a strong urge to do everything possible that if I hadn't gone ahead with surgery, how to explain that to the family, and there still would be plenty of second guessing from the other side. It's kind of a no win place to be. I wish you all the best figuring out what works for you. Hugs, Carla",
      "MessageIndex": 15,
      "PostDate": "17/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/815670",
      "Title": "Surgery or not? Please help del3 Redmond"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Jul 1, 2013 08:27AM CarlaK wrote: I intend to go back to having a glass of wine occasionally, as soon as it tastes good again! When my tastebuds are back I'm probably going to gain 10 pounds",
      "MessageIndex": 15,
      "PostDate": "01/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806994",
      "Title": "Mice, Mets, and Margaritas Bestbird ABeautifulSunset"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Oct 20, 2013 04:13PM CarlaK wrote: Hi Amy- All I have to go by to help answer your question is that when people have chemo before mastectomy or lumpectomy, they wait about a month after the last infusion before doing the surgery. You need to have your white and red blood cells and platelets all back to normal to prevent infection or bleeding. If you are Her2 positive and on Herceptin, you can continue that during/immediately after surgery. Have you asked about a referral to an orthopedist or sports medicine specialist? They make a lot of excellent knee braces that could give you the support you need, and you could put off surgery and not worry about falling. An orthopedist could prescribe one that is best for whatever is going on inside your knee. Good luck-Carla",
      "MessageIndex": 1,
      "PostDate": "20/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813233",
      "Title": "Surgery and chemo Fluffernutter Fluffernutter"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Aug 25, 2013 03:23PM CarlaK wrote: Please vent! I think there is a strong unspoken rule that to be a \"good\" patient you suck it up and make light in order to lighten the load for those around you. As women I think this is our default position in general. I'm guessing that very few of us have more than just a handful of people in our lives that really want to hear about the real physical and emotional battle we are going through. And yet it is so helpful to be heard and validated. This seems like a good place for that to happen, with people that \"get it\".  I hope tomorrow feels better for you... Carla",
      "MessageIndex": 6,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809926",
      "Title": "Sorry to vent - just need to get the pity out blondie1 MartyMart"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Jul 7, 2016 07:43AM CarlaK wrote: Hi Stage 4 from the start 2013, lung mets ",
      "MessageIndex": 46,
      "PostDate": "07/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Feb 27, 2014 10:43PM CarlaK wrote: Hello lung mets experts-I'm wondering if anyone has had a similar experience...a year ago I was diagnosed Stage 4 right off the bat when a PET showed 2 small nodules in my right upper lobe and the bigger one was + for breast cancer on CT guided biopsy. I did perjeta, Herceptin and taxotere and my next CT about 4 months later at the end of chemo was full of ground glass opacities in both lungs that seemed to be due to a reaction to the taxotere and indeed my shortness of breath and cough that had started about 2 cycles in got almost completely better after stopping. This month we finally did a follow up CT which showed a 9mm \"ground glass\" nodule left lower lobe that's persisted and gotten more solid since last summer and another 14mm one in left upper lobe that is new (and much bigger than my original mets on the right side!)  My onc does not feel these new lesions mean anything, or at least not enough to change treatment right now because I'm fine and the nodules may be gone next time we check. But I felt fine when I was first diagnosed, too! Of course I hope she's right, but it's hard to feel totally confident. Has anyone else had confusing CT's and trouble figuring out if they've progressed or not?",
      "MessageIndex": 514,
      "PostDate": "27/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Mar 3, 2014 04:14PM CarlaK wrote: Adnerb-my scans were all with contrast, but 2 different machines and a different radiologist reading each one. I'm trying to stay \"in the moment\" and just try to forget my concerns; my onc assures me that even if the new lesions are a progression, we don't lose anything by waiting 3 months to rescan, but it would be sad to abandon an easy treatment (Herceptin/tamox) if we really don't need to. So more news in May, I guess. Jab-everything on CT scans that are less than 1mm are very hard to biopsy and they can come and go and not mean anything. I had a bunch of little tiny nodules on my CT from July that are now gone. But the watch and wait thing is really hard when you want answers!",
      "MessageIndex": 530,
      "PostDate": "03/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780588",
      "Title": "mets to lung bhd1 movingsoccermom"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Jul 8, 2013 05:09PM CarlaK wrote: You've have multiple scans so they know your baseline-if they ignore new findings, why are you being scanned??  Seems you at least should push for a PET to see it these light up, because I'd think you'd be a candidate for a new treatment if this represents progression.  You're not \"borrowing trouble\", you just want to know what is going on so you can deal with it. Good luck!",
      "MessageIndex": 8,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807416",
      "Title": "A question on lung nodules keepingon SyrMom"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Feb 18, 2014 08:18PM CarlaK wrote: This won't work for everybody but I started on gabapentin (Neurontin) a few months ago for neuropathy that bothered me at night and since drowsiness is a side effect, I fall asleep and stay asleep pretty well on it.  Just using 300mg at night. I also find benedryl to be too long lasting and makes it too hard to get going in the morning. Also there's a drug interaction between benedryl and tamoxifen, so if you're on tamox you should avoid Tylenol PM and all the other OTC variations of benedryl-it may keep your tamoxifen from working like it's supposed to.",
      "MessageIndex": 8,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818159",
      "Title": "Sleep issues Kjones13 Kjones13"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Jul 16, 2015 04:36PM CarlaK wrote: Leaving Sunday to visit my BFF in England! This will be the first time my kids and husband have been to Europe. Kebab you are brave to go post treatment! We splurged on \"premium economy\" tickets in hopes it will make the flying less awful. Once there my friend is organizing the whole first week and housing us. Then the last 4 days we'll be on our own in London. I've been having some worrisome symptoms in the last few weeks but decided to not look for trouble but just go, enjoy, and deal with it all when I get back.",
      "MessageIndex": 4,
      "PostDate": "16/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833462",
      "Title": "Travel! Please post your plans, photos and details here. starbrightlyshines Karz72"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Jul 17, 2015 09:11AM CarlaK wrote: I want to hear more about Alaska too. My parents are thinking an Alaskan cruise might be a doable trip for them (approaching 80) and the teenage grandkids. Not sure if they are going to invite the middle generation...there would be advantages to going, but also to being home alone ;-)",
      "MessageIndex": 14,
      "PostDate": "17/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833462",
      "Title": "Travel! Please post your plans, photos and details here. starbrightlyshines Karz72"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "May 6, 2014 10:20AM CarlaK wrote: A couple of things have been key for me. First is good sleep and if it takes meds to get it, so what. Right after my diagnosis, I lucked into a nice, small support group that really helps. A couple of times I've needed to see the therapist that runs it for a private session, and she's helped my daughter as well. I realized that nobody but a counselor can handle the scary stuff I need to get off my chest. Keeping busy with family life helps. Having little fun events planned just around the corner also helps.  I found a motto on the internet that I love: If you keep walking they can't catch you to nail down the lid of your coffin. Kind of harsh, but I say it to myself whenever I need a kick in the butt :)",
      "MessageIndex": 2,
      "PostDate": "06/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820835",
      "Title": "Getting out of a bad mood? RosesToeses DivineMrsM"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Oct 26, 2015 07:25PM CarlaK wrote: Linda, that is awesome! I was wondering, are you having any side effect issues with tamoxifen/Herceptin over the long haul? Have you and your oncologist ever talked about whether you might stop treatment at some point? I'm on the same meds, minus the Zometa, and NED for about a year and a half. How often are you getting scanned now? I hope you and NED are together for many years to come ",
      "MessageIndex": 9,
      "PostDate": "26/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/836124",
      "Title": "PET Results--NED for Over 5 Years! Cafelovr libertylady504"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "May 12, 2014 05:44PM CarlaK wrote: Musiclover: \"I miss the old you\"? Oh, man, I'd be floored too if somebody said that to me! Mouths fly open before brains engage, apparently. Orpheus: You guys hang in there, I was diagnosed Stage 4 from the start too and everybody wanted to give me the third degree about how my diagnosis happened, insinuating that I had somehow screwed up to end up in this spot. It makes you feel terribly guilty! Eventually people move on to other things (like asking why you aren't done with treatment yet, LOL) If you have more patience than I do, you can educate people about Her2+ cancer and how it doesn't behave nicely, but can progress like wildfire.     ",
      "MessageIndex": 936,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Feb 22, 2014 03:19AM CarlaK wrote: I am definitely in the Taxotere Haters club! I'm so glad it's working for you, but yes, it is a rough ride. It was my first chemo so I had nothing to compare it to. I like to remember it as my initiation into the sisterhood  Hang in there!!  Carla",
      "MessageIndex": 2,
      "PostDate": "22/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818320",
      "Title": "Taxotere is nasty. Epic whine and rant. pattih CarpeVinum"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Aug 7, 2014 05:09PM CarlaK wrote: I don't quite fit your description, but almost. I got a PET scan during my original work up prior to starting neoadjuvant chemo, and it showed 2 spots in my right lung (my breast lump was on the left side). They biopsied the biggest one and sure enough, it was positive. Those spots still show up on my CT but they don't glow anymore. And so far, nothing else-fingers crossed!",
      "MessageIndex": 3,
      "PostDate": "07/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823460",
      "Title": "Anyone with single lung met...and no other mets anywhere else? wrsmith2x LindaE54"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Jan 2, 2014 02:31AM CarlaK wrote: Hi Kjones-I'm triple positive too. I turned 50 this past summer but in my head I'm 40, so does that count as young? :)  My kids are 13 and 11-their hormones are surging and mine are being turned off-it can be really fun at our house! I did 6 rounds of Perjeta/Herceptin/Taxotere, then a couple more rounds of P/H then they dropped the Perjeta (I was doing rads and they said there were no safety studies of P with rads) so since Oct I've just been on Herceptin and Tamoxifen. I don't have bone mets so I don't get Xgeva. I'm so hoping to stay awhile on this combo, but if we have to change treatments my onc says Kadcyla is next. I'll be getting a scan sometime this month, fingers crossed.... Hope your run with stable lasts a very long time. Hugs to you and your kids! Carla",
      "MessageIndex": 5,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816361",
      "Title": "Her2+ gals Kjones13 Kjones13"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Feb 20, 2016 07:24AM CarlaK wrote: Hi-I was diagnosed Stage 4 from the start with 2 small lung mets in 2013. My team treated me like I was Stage 3.999 so got chemo, mastectomy and rads. By May 2014 I was NED and have stayed that way so far with Herceptin and first Tamoxifen, now Arimidex. Working 1/2 time, raising teenagers. Keep hopeful, hang in there",
      "MessageIndex": 2,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/841445",
      "Title": "Any er/pr/her+ with NED/stable if so how long and what treatment Dezymarie Dezymarie"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "May 22, 2015 10:08AM CarlaK wrote: 2 years, Stage 4 at diagnosis with 2 mets in the lung (on the opposite side from my primary breast tumor, so that was weird!) My onc said at the beginning \"I'm pretty sure we can get you 5 years, 10 would be a stretch\". I need 5 more years to get to both kids' HS graduations. Let's do this",
      "MessageIndex": 5,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831838",
      "Title": "How long have you been Stage IV? goldie0827 dormouse"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Feb 7, 2015 12:27AM CarlaK wrote: Exbrnxgrl-the rain is wonderful tonight and with any luck it may lead to snow and skiing! Maureen-California is full of bucket list worthy things to see; we are totally spoiled and would love for you to come share it.",
      "MessageIndex": 32,
      "PostDate": "07/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828214",
      "Title": "Bucket List- what did you include? Maureen813 Maureen813"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Sep 8, 2014 05:49AM CarlaK wrote: On a similar note, this weekend my husband and I booked a weekend in Vegas for our 17th anniversary coming up in November. Why wait for a round number? Celebrate whenever the opportunity arises!",
      "MessageIndex": 14,
      "PostDate": "08/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824331",
      "Title": "Celebrating Life....now.. Fitztwins Sue2009"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "May 29, 2014 01:51PM CarlaK wrote: Beautiful pictures and posts-congrats to all the proud moms watching their kids wrap up the school year and move on to their next adventures! Last night was my 14 year old's 8th grade promotion. I used to think it was very silly that the school district had a ceremony with gowns and speeches-but now my tune has changed. My goal is to get to see both kids graduate high school (and beyond!), but if that doesn't happen, now I have this wonderful memory. He was one of the top 4 students, gave a speech, and referenced our family's experience with cancer in it. I knew it was coming so I brought Kleenex...it was such an emotional moment, as he has never really talked to me about how the past year affected him. I know there's a lot of distance between now and adulthood, but somehow seeing him up there made me feel confident that he's going to turn out ok.",
      "MessageIndex": 122,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Aug 22, 2015 09:35AM CarlaK wrote: School's been back in session for 2 weeks here. I think everybody was ready to see their friends and get back to learning (although they'd never admit it!) Son is now a sophomore and daughter an 8th grader. We had a great summer with some camping and a memorable trip to England. They didn't want to go but I dragged them anyway, and it turned out really well. Looking forward to a very busy September-football, softball tournaments, a family wedding at a big hotel in San Francisco. Keeping busy keeps me from too many sad thoughts and helps me ignore side effects. The kids and their whirlwind lives are the best distraction and the best motivation for me!",
      "MessageIndex": 536,
      "PostDate": "22/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Sep 3, 2013 03:27PM CarlaK wrote: Hi debsing--I haven't been at this as long as you, but wondering why your onc doesn't want to add a hormonal treatment along with kadcyla? I just finished PHT, will be continuing the herceptin (dropping the perjeta because I'm about to do some post mastectomy rads and they haven't studied the safety of perjeta plus rads like they have with herceptin) and just started tamoxifen. Makes sense to hit it from another angle if possible. I've heard great things about kadcyla, hope you get a great run out of it!",
      "MessageIndex": 5,
      "PostDate": "03/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810353",
      "Title": "new to the board, but not stage IV debsing debsing"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Feb 6, 2015 10:47PM CarlaK wrote: I don't like feeling pressured to do something grand, and my big goal is getting to the high school graduations for my kids. That said, I do try to come up with some reasonable fun things to look forward to because it helps me stay focused on the short term.  I want to go skiing again (or at least hang out at the lodge with a drink in hand). I want to eat at the French Laundry, one of the best restaurants in America and is only an hour from my house-I've never been there. We're supposed to go camping near Santa Cruz in April and I want to ride the Big Dipper on the Boardwalk with my kids. I'm about to get serious about planning a trip this summer to see my best friend who lives in England and it will be the first time out of the country for my kids and my husband. I keep telling myself that if something happens and we have to cancel, so what, make the plans anyway. I've always been a delayed gratification kind of person so I try to work on just taking the plunge, now!",
      "MessageIndex": 28,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828214",
      "Title": "Bucket List- what did you include? Maureen813 Maureen813"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Apr 6, 2014 11:02PM CarlaK wrote: Cancer and middle school-not a good combination! I was diagnosed a year ago and after the initial shock my 11yo daughter and now 14 year old son seemed to do well (we have not had the \"what does Stage 4 truly mean\" talk yet-saving that for when I have progression) But this first middle school year has been tough on my daughter. She's very clingy and anxious, and it got much worse after I was hospitalized for an infection out of the blue before Christmas. I'm actually well enough to be back to work and back to some of my previous professional activities now requiring a little bit of travel-and she hates it! Luckily I got a recommendation for a great therapist who has been helping us and I'm just trying to be very patient with her. I'm crossing my fingers that I stay stable for a stretch so she can keep working on skills to manage her anxiety. I worry that while DD is very vocal about her fears, DS is totally the opposite. I hope that when he goes through tough times he will reach out to us.  I haven't written any letters/made scrapbooks or done anything tangible like that, I guess because that would mess up this nice denial we have going :)  To me, the pain of seeing my kids, my husband and my parents so upset is easily the worst part of my cancer experience so far. But if we love and are loved, there is no getting around it.",
      "MessageIndex": 7,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Jun 17, 2014 09:19AM CarlaK wrote: Markers do bump up if you've had surgery/infection. I had this happen after I needed an abscess on my chest wall opened and drained. They went up and came right down again the next time. Several times we've had confusing scans or marker numbers and my onc advocates for patience, and she's always been right. I have to remind myself all the time, this is a marathon, not a sprint! So glad your port is in and working. Hope your mood is lifted a bit this morning-take care!",
      "MessageIndex": 5,
      "PostDate": "17/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822019",
      "Title": "feeling a little down chris1959 roberta37"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Sep 4, 2015 05:27PM CarlaK wrote: Hooray Goodie and Bosco! My news is turning out good so far too-neg PET and so far the results from the LP look fine (although the main thing we're concerned about, cytology, won't be back until next week). I'm very relieved! Still seeing double and still losing weight though. Today I saw the lowest number yet on the scale-down 34 lbs this year. So I'm happy but still perplexed about what's going on :(",
      "MessageIndex": 706,
      "PostDate": "04/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Sep 24, 2015 08:53PM CarlaK wrote: I'm finally able to give up my seat in the waiting room! After 6+weeks of tests (brain MRI, PET scan, lumbar puncture and upper/lower endoscopy) they have come to the conclusion my double vision doesn't mean anything dire and my weight loss (now 36 pounds) must be a side effect of treatment. I'm happy it's not progression and now I can reassure everyone who's been worried about me wasting away-especially my kids and my mom :",
      "MessageIndex": 751,
      "PostDate": "24/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Aug 20, 2015 12:41AM CarlaK wrote: Happy dances for everyone who's gotten good or stable news! You guys are so kind to be worrying about me-I'm still waiting for Radiology to get me scheduled. Bleah. I may make some phone calls tomorrow to try to get this show on the road.",
      "MessageIndex": 666,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Aug 26, 2015 04:13PM CarlaK wrote: Finally scheduled: PET on 9/2, lumbar puncture 9/3. Hopefully I can get at least the PET results back before the holiday weekend! To all that are waiting-hang in there",
      "MessageIndex": 688,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Aug 26, 2015 07:03PM CarlaK wrote: Mets in the CSF because I have double vision and some subtle droopy forehead, brow and nose on one side for about 6 weeks.Brain MRI was fine but I guess that doesn't completely rule mets out as a cause. They will also check for MS-wouldn't that be grand, to have 2 scary diagnoses instead of one! Trying very hard not to buy trouble and hoping it's all just a weird getting old thing.",
      "MessageIndex": 691,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Aug 15, 2015 12:02AM CarlaK wrote: If there's an open chair here I'll come in and have a seat. I'm waiting to schedule a PET-CT and a lumbar puncture. I've been losing weight (32 lbs) over the past 6 months which has not improved with rearranging my meds and now in the last month developed double vision. My brain MRI was negative, so at least that's out of the way! I've seen the eye specialist, my oncologist and a neurologist in the past 10 days, and basically they aren't sure what's going on. Could be something, could be nothing. I feel like I'm playing \"medical procedure bingo\" and going for the blackout card! In the meantime I need to keep my head on straight for work and family. Ugh. Thanks for listening to me whine! PS-great to see that many people have been getting good news and I'm going to try to visualize the same for my tests!",
      "MessageIndex": 634,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "CarlaK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174308/profile",
      "Content": "Aug 26, 2015 08:21PM CarlaK wrote: Wow, Annie, talk about lightening striking twice, you have my admiration for walking a difficult path. Now I know who to connect with if I need to...",
      "MessageIndex": 693,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    }
  ]
}