{
  "AuthorID": "CarolC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
  "Posts": [
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Oct 28, 2007 07:50PM CarolC wrote: Great interview and you look gorgeous!",
      "MessageIndex": 2,
      "PostDate": "28/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/694257",
      "Title": "My TV Interview bisous3 bisous3"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Nov 24, 2007 03:15PM - edited Nov 24, 2007 03:16PM by CarolC I know Oz...this is just so sad. I am planning to pay my respects tonight at the funeral home even though I've only had an email relationship with Jacqui. She was one of the first bc survivors who had reached out to me with such kindness and compassion even while her own situation was worsening.",
      "MessageIndex": 16,
      "PostDate": "24/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695303",
      "Title": "Jacqniel ozzie2 waterlily"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 28, 2009 08:59AM CarolC wrote: My thoughts and prayers to Deb's family and to all of us whose life she touched. I was new here in late 2007 and asked so many questions. Deb always responded with kindness, humor and a positive attitude. She touched so many of us and will be missed. Carol Chandler",
      "MessageIndex": 272,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Nov 28, 2007 01:44PM CarolC wrote: Traci, Thank you for posting this - I am so sorry to hear this horrible disease has claimed another good woman. My heartfelt sympathy to her family. Kathy lost her battle and the reality is that it IS scary to learn what some of us will go through.",
      "MessageIndex": 26,
      "PostDate": "28/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695981",
      "Title": "Another Angel.....Stage4.....Kathy.. Traci-----TripNeg Calico"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Nov 15, 2007 09:51AM CarolC wrote: Hi Jacque, I've missed your posts as well. I know you're in good hands - we share the same great onco! Prayers winging your way that your counts start going down soon..",
      "MessageIndex": 12,
      "PostDate": "15/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695303",
      "Title": "Jacqniel ozzie2 waterlily"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Oct 15, 2007 08:09AM CarolC wrote: Well, today is my day. I'm leaving for the hospital shortly. I was diagnosed last month with a very small 7mm IC grade 3. I'm a triple negative, it seems which is a bit worrisome based on what I've read as far as treatment options. I would be thrilled if it hasn't reached my lymph nodes but guess I'll find out since they're doing the sentinel node biopsy first. I've opted for a bi-lat mastectomy w/immediate reconstruction. I'v been reading here voraciously but haven't posted much - now I know I'll be a regular reader and participant.  Your stories have been inspiring and informative. I admire  you all Wish me luck! Carol",
      "MessageIndex": 13,
      "PostDate": "15/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/693656",
      "Title": "Getting ready for my surgery AnneW CarolC"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Oct 21, 2007 09:59PM CarolC wrote: Anne, I drove to the store yesterday - only a couple of miles but out of necessity I did so. I felt a bit shaky because I was still taking vicodins and I certainly don't feel up to driving very far. But it was a big deal. Carol",
      "MessageIndex": 18,
      "PostDate": "21/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/693656",
      "Title": "Getting ready for my surgery AnneW CarolC"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Nov 7, 2007 07:47PM CarolC wrote: Hi Loretta, I'm sending you positive healing energy too...hope you're back online soon telling us all about it. Carol",
      "MessageIndex": 8,
      "PostDate": "07/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/695061",
      "Title": "Surgery tomorrow -- a little prayer! loretta Jellydonut"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Nov 22, 2007 06:14PM - edited Nov 22, 2007 06:16PM by CarolC I am new here but had been so touched to have Jacque reach out to me - we both live in Omaha and had planned to get together as soon as she felt up to it. I am so saddened to have just read her blog - her son Greg just posted the following message. We have lost our Jacque to this horrific disease and I just think it's so damn unfair.   Carol http://www.jacqnielsplace.blogspot.com/ This is Jacque's youngest son, Greg, checking in. I'm sorry to say that my mother passed away earlier this morning. Yesterday, the doctors discovered that her liver was failing, and they gave her two to four weeks. Over the night, her breathing became labored, and the doctors called us to come in at 5:30 this morning. She was able to hear us, and we were all able to say our goodbyes to her. She went peacefully with her family around her. Her visitation will be at the Crosby-Kunold-Burket Funeral Home from 6pm to 8pm on saturday. Directions to the funeral home are Here Her funeral will be on sunday afternoon at Faith Westwood United Methodist Church at a time to be announced. Directions to the church can be found Here We would like to thank all of you for your continuous support and many prayers as she fought the battle of her life.",
      "MessageIndex": 14,
      "PostDate": "22/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695303",
      "Title": "Jacqniel ozzie2 waterlily"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Oct 17, 2007 07:10PM CarolC wrote: Hi Anne, I'm home and pretty amazed that so far it went so well. I was released from the hospital about 4 hours ago. Today is your day and I'm sending positive energy. I'm holding my breath til the path report comes back next week but they took 4 nodes during the SNB and they all came back preliminarily free of cancer. he says that's probably a 95% chance that they'll be clear after pathology checks them out. I'm sore and feel like someone hit me in the chest with a chain, but it's not nearly as painful as I thought it would be. The drains are a pain and my hospital gave me 3 cami's with pockets, but they're still pretty irritating. It sounds like that's short-lived however. I'll write more as I feel up to it. Anne, can't wait to hear how yours goes. Gentle Hugs, Carol",
      "MessageIndex": 16,
      "PostDate": "17/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/693656",
      "Title": "Getting ready for my surgery AnneW CarolC"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 8, 2008 05:02PM - edited Jan 8, 2008 05:10PM by CarolC Hi Sister Jewels, Well I see I'm not the only one still having this horrible cold or flu or whatever the heck it is. I stayed home from work again today as well - getting nervous because now that I've decided to do the chemo, I just want to get it out of the way. Debbie - I wanted to wish you an easy first treatment tomorrow. I'll be doing Taxol along w/Xedoda so it will be interesting to compare SEs. Vettegal - Just wanted to tell you that not only do you make me smile with the way you share; but I'm a Pittsburgh girl myself. I just moved to Omaha a year ago to be near my elderly mom. I was a tad bit in the doldrums that the Steelers couldn't pull it off again. Carol - you are a doll to take care of the shirts - I clicked on the link and I still think a L would fit me. I love the style you chose - it's very feminine which is just what I think we all need right now. How do we send the money - is it to you or them? If you've already said, sorry - I'm feeling a bit spacey these days:) Kimberly - Good luck tomorrow and I love the poem! , D1- sending positive energy your way, Cisd - thanks for checking in - you look so beautiful in your pic with your big smile. It made me realize I have to get a grip here and stop moping around and just get through it.  I think I'll take my dog's photo down and replace it with my own. That's progress I guess... I'll check back soon.",
      "MessageIndex": 406,
      "PostDate": "08/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 11, 2008 04:57AM - edited Jan 11, 2008 04:59AM by CarolC Hi Dana, Just wanted to say that I am starting 12 weeks out from my surgery because I insisted on getting a second opinion on treatment options and whether I really even needed chemo. (I was trying to weasel out of it). I'm now at the UNMC Breast Cancer Center with the Director of the Cancer Program as my onco. He's the best! He took the time to answer all my questions and agreed to off-protocol treatment due to my concerns about cardiotoxcity, etc. I was concerned about the same thing you are - had I waited too long to start? Dr. C told me it's ideal to start within 8 weeks after surgery, but 12 at the outside. He wouldn't advise waiting much beyond that, especially for triple negs, which I am. So you are in good shape still and even the fact that you are ER/PR + is indicative of you having a slower growing cancer. Hope you get that new appointment scheduled soon - it's disconcerting to not know what/when we're doing things... ",
      "MessageIndex": 467,
      "PostDate": "11/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 19, 2008 06:19PM - edited Jan 19, 2008 06:27PM by CarolC DianeB! you've been through hell with this stuff. I'm so sorry you have to go through it. I'm 60 and divorced, live alone with pets.  I was invited to a birthday get together at a local bar for my 38 yo niece.. but I just don't have the energy to do anything. I think I'm getting that metallic taste, gas pains on and off all day, food doesn't taste good and who's hungry anyway? Looks like se's are coming to town. On top of all this, I'm anxious because of a financial crisis I managed to get myself into since I was dx in Sept.  I have a fairly new job but haven't been there long enough to get any kind of short term disability when I take off.  Work that I missed after surgery, I just didn't get paid for.  I'm so worried because I'm a month late on my mortgage which I've never been. I've been spending time calling my creditors and the bank to explain why this is happening and to please work with me since I've always had good credit with them in the past. they all feign concern; sometimes switch me over to a supervisor; but then say sorry - there's nothing we can do except extend the due date by a few days!! What is this country coming to???!! Sigh. I had to put together my budget and just sent it to them on Friday in order for them to consider modifying my mortgage in any way. This cancer is kicking my ass and now I'm starting to feel sorry for myself. Thanks for listening. I would guess most of us are being impacted by cancer in all kinds of ways we didn't even consider. Mine's been a long day as well... i'm focusing hard on \"this too shall pass\".",
      "MessageIndex": 653,
      "PostDate": "19/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 25, 2008 04:59AM CarolC wrote: WVgirl, PALady, Deb and Billsgirl - you're in my thoughts today having your 2nd round. And I join our sisters in the Jewel toast to Vettegal and Jenny, who are getting their first chemotini today.  I'll have more time to read & update everyone over the weekend but checking in here at least once a day has become a habit! Happy Friday Jewels ",
      "MessageIndex": 808,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 5, 2008 06:47PM - edited Feb 5, 2008 06:52PM by CarolC D1, Carol  and Kathy (and anyone else whose going in for tx tomorrow) good, positive energy is being sent your way! I'm right behind you - my 2nd tx is Thursday... Today I was back to work and wore my new wig for the first time. I really need to get it trimmed - it needs shorter bangs. Vettegal, we both got the same Noriko Reese model - are you having the same problem? I was ready to take scissors to it myself today. By the end of the day I couldn't wait to get it off. I so apologize for not having the time to send individual shout outs to all - I can't get on at work either. I hope you know I read everything everyone posts and so appreciate the support. And Kimberly - don't think  I 've told you how much I love, love love your poetry - I've read it to several of my friends. You are quite the linguist, my friend. WVA girl - last night's Look Good - Feel Better was fun, although there were only two of us in my class! Oh well, we got lots of attention, extra makeup and hats & scarfs.  No wigs. I'd recommend it to anyone. Til later Jewels - I need a hot soak in some mineral salts.",
      "MessageIndex": 1099,
      "PostDate": "05/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 7, 2008 01:46PM - edited Feb 7, 2008 01:50PM by CarolC Hi Sister Jewels, a quick shout out to all of you. I just got home from treatment and feel fine so far, so need to get some chores out of the way. I'll check in later. Dana, I really want to have a chat with you later as well! You do NOT deserve to be mistreated. We've all made poor choices in life; that's part of growing & gleaning wisdom. You've had some tough challenges it is true, but now you're going to find your way out of this emotionally abusive relationship. My advice is to keep a low profile from him while you're living there and quietly start putting out feelers for another place to live. Join a support group like Co-dependants Anonymous or call a Woman's Shelter and ask for contact names of therapists and organizations that can help you. Take advantage of the free counseling they offer at most cancer centers and let someone know what's going on. You don't need a man like that - he has shown his true colors IMO. Any man who would threaten to leave a woman while she is battling cancer is not a man worth keeping - he is a narcisstic coward. Sister, you are smart and beautiful - you deserve much more than this. Before I sign off...here is me about 3 hours ago...everyone loved my FUBC shirt, too! Actually, I have a F*ck You Breast Cancer Message going as a screensaver and my onco (who I am developing a crush on) stopped in to see me in tx. I showed him the screen and told him what my shirt message stood for and he actually blushed... Oh well, he probably thinks I'm a bad girl now..  ",
      "MessageIndex": 1138,
      "PostDate": "07/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 12, 2008 04:20AM - edited Feb 12, 2008 04:22AM by CarolC Good morning Jewels, Well, I didn't have a totally se free day yesterday - I ended up feeling puny most of the morning and came home about 1 pm and climbed under the covers. It wasn't horrible - just a feeling of mild nausea, fatigue but also chills and then hot flashes. I always feel guilty when I try to explain to my boss that I just can't work because she seems to have an attitude of knowing what I should be going through. She's told me that her mother-in-law and someone else she knows went through chemo \"just fine\"....whatever the hell that means? All in all it wasn't horrible but I just didn't feel up to sitting there and toughing it out when I had no idea if it would continue to get worse. I ended up sleeping most of the afternoon, getting up to feed my dogs and then back to bed... Anyway, the only other issue I'm wondering if any of you are also dealing with is neuropathy? At least I'm thinking it's got to be neuropathy since I didn't seem to have it after tx#1. My hands are red and blotchy and itchy - I kept rubbing bag balm on them as my onco suggested. But then last night I noticed the bottom heel of one foot has the same numbness and raw feeling. I applied bag balm to that for the rawness but it's not helping that tingling feeling. I've been taking 500 mg. L Carnatine daily which supposedly helps prevent the neuropathy, but wonder if I need more or if there's something else that might help. I'm going into work but feel like I'm going to have to hop around and keep the weight off the heel of my right foot. CHJ - love your picture! We should have an album of all of us in our shirts or with our bald pates. I'll catch up later - wishing everyone a comfortable day!",
      "MessageIndex": 1252,
      "PostDate": "12/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Mar 19, 2008 03:06PM - edited Mar 19, 2008 03:40PM by CarolC Hi Jewels! KathyL, I'm here at my cancer center chemo suite too! Just started my last TC about 15 minutes ago. I'm so glad this is the last one but like you Therese, it's got to feel pretty \"naked\" and for me scary to wonder what it will be like the next 3 months til my oncologist wants to see me again. First he said - 4 months and I blanched so he said \"ok, lets make it 3\". Geesh, I feel so dependant. I guess I'll be distracted after tomorrow for a bit though when I see my plastic surgeon to schedule my exchange surgery - hopefully in April. Maz, I'm so sorry to hear about your bff - how devastating. I don't know what I'd do if I heard that news about my bff Kathy - she lives in AZ but has been so concerned and supportive of me. She rarely goes to doctors herself though - she is very proactive about homeopathy but I do worry. I can only imagine how sad this makes you. Kimberly, I didn't remember that it was you who made that comment but I wasn't offended. It was very gracious of you to bring it up and explain and I thank you. I hate when I say things that come out sounding differently than I meant them. We've got such a group of strong, sensitive and empowered women in our little Jewel club - I'm honored to be a part of it. Deb, I had the same problem you did with the raw peeling on my hands on on one heel - it hurt like hell. My doc said it was hand/foot syndrome and also suggested I use bag balm on it. About a week ago, a layer of skin peeled off most of the bottom of my right foot - the heel and even sole and around my toes of that foot. Good luck! Thank you so much for all the validating words of wisdom so many of you shared regarding my depression and some of your own. Julie, Jennifer, Amy, Cathy, SheShe, Carol, Dana, D1, Tina,  CHJ, Paula and I'm sure my chemo brain is causing me to forget some  of you. I so appreciate the understanding and support you give me. I can see that I'm coming out of the funk I was in. But sure enough, while I was getting ready to leave this morning - Good Morning America had Maalak Rock (Chris Rock's wife) promoting her work with the Triple Negative Cancer Foundation which Robin Roberts admitted she has too.While I'm glad they're heightening awareness, they are promoting this so women become aware of how limited we are in our treatment options. Chemo is our only choice. Believe me,  I know how lucky I am that I didn't have node involvement and many of you have much more challenging treatment plans than mine. We all know feelings are neither right or wrong - they just are and fortunately I'm feeling more optimistic every day. Happy Spring tomorrow to us all...it's been a tough winter, hasn't it? Hugs to all, Carol",
      "MessageIndex": 1970,
      "PostDate": "19/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 3, 2008 06:04PM - edited Jan 3, 2008 07:53PM by CarolC I've been terrified of doing chemo and really didn't think I would initially. However, I've gotten some additional opinions and I'm finally convinced that with my triple neg disease, I'd be too worried about mets if I wasn't aggressive. I had been concerned about the cardiotoxicity of most chemo drugs because of a family history of heart disease. But, I was finally able to convince my onco to let me try XT (capecitabine (Xeloda) + 4 x Taxol) I had really hoped to combine the Xeloda with Avastin to avoid hair loss, but apparantly it's not approved in an adjuvant setting . Xeloda supposedly doesn't cause hair loss but I've read different things about Taxol - one says there is usually complete hair loss and another says hair thinning can be expected. Anyone have any experience with just Taxol & hair loss? My first treatment is scheduled for Jan 16th...12 weeks after my bilateral mast. I probably should have started this sooner but the fear was keeping me from moving forward. I know I'm lucky that it's only 3 months of treatment but I'm still so nervous and like everyone, I would love any suggestions about getting ready physically, diet wise and emotionally. Thank you so much for being here.",
      "MessageIndex": 277,
      "PostDate": "03/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 3, 2008 07:57PM CarolC wrote: Hi Diana, I hope you continue to get through this first time and have the shot help. Fingers crossed for you. I did not have a muga scan, but I am going for labs in the morning of the treatment so maybe they'll do it then? I have had a fairly recent stress test, echo etc. - what else does the muga scan show?",
      "MessageIndex": 280,
      "PostDate": "03/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Dec 18, 2007 09:49PM CarolC wrote: Dear Bimmer, Your love for Diana and your journey together through her illness has touched my heart and soul. You did everything you could to love and support her. I am so sorry you have lost your soulmate to this horrible disease. May you and your entire family take some comfort in your memories. In Sympathy,",
      "MessageIndex": 86,
      "PostDate": "18/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697113",
      "Title": "Very advanced B.C.: Diane's final gift. Bimmer ilenee"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 16, 2008 01:19PM CarolC wrote: KathyL! Great news! I'm actually sitting here getting my infusion right now with my laptop. It's Taxotere instead of the Taxol which I was initially prescribed. That's all I'm getting here and then go home to take 14 days of oral Xeloda - 1 week off and then back for my 2nd Taxotere. You're right - it's not so bad. Maz, hope it's going well for you as well. Will write more later.",
      "MessageIndex": 571,
      "PostDate": "16/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 16, 2008 02:28PM CarolC wrote: Hey Jenn51. I'm almost finished with my first tx. Wanted to tell you that I'll be sending positive energy your way tomorrow. Your grandson is a cutie!! And I really love your signature line!",
      "MessageIndex": 575,
      "PostDate": "16/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 17, 2008 05:06AM CarolC wrote: Good morning, Jewels Just a quick check in and observation before I leave for work. I felt a little spacy last night from the steroid but nothing really difficult before bedtime. The worst thing was that I was not able to sleep the entire night! Not a wink! I kept getting up to read, watch tv - nothing would help. I bought a product called Schiff's KnockOut that was recommended to me but I'm a little nervous about taking it without checking with my doc - it should be ok - Valerian and Melatonin and something else to help sleep. Anyone else have that problem? I have to take 1 x a day today as well...wonder what that's going to do? Geesh. So other SE's for me.. Julie, I hope we have a Wig Wednesday here - I saw the Raqu'reel Wigs and they're really nice. I found one I really liked by Noriko called Reese. The store was selling it for $199 and I found it online on sale for $88!!! Juliek and Donna - thinking of you today.",
      "MessageIndex": 590,
      "PostDate": "17/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 19, 2008 09:36AM CarolC wrote: Hi Jewels, Just reporting in from freezing Omaha, NE...-9 - looks like everyone is cold this weekend. I've not had any serious se's yet but I just feel kind of sluggish and feel like I constantly have to poo w/stomach cramps. I'm not exactly constipated but it's probably time for some Smooth Move tea. I'm also feeling down and depressed - probably part of it and some other challenges going on in my life. Still no word on whether the Xeloda will be approved by my insurance company's appeal board so I'm worried now whether Taxotere will be enough. Sorry to be so me. me. me. but just wanted to check in and let everyone know I'm thinking of you. Carol, when do we send checks for the tees? I can put mine in the mail anytime - I just need an address. you shouldn't have to front the money for all of them. Be well Sister Jewels.. and stay warm.",
      "MessageIndex": 643,
      "PostDate": "19/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 24, 2008 05:18AM CarolC wrote: I'll check in and get caught up on my reading later after work. Couldn't do it last night because a co-worker came to visit and I admit I drank 3 glasses of wine - probably not very smart. But I want to wish the best of luck today to Sista2 on your maiden voyage!!! to all others having tx today - best of luck. And to wvgirl - you look beautiful with your bare head!!! Hope I'm as courageous when it's my turn.",
      "MessageIndex": 772,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 4, 2008 02:03PM CarolC wrote: The FUBC shirt came!!! I love it! Carol, thank you so much! I'm wearing it tonight to my Look Good class... I'm still feeling a little weak but much better than I was. Maybe it was food poisening... Julie and all who are dealing with the financial impact of this due to co-pays, deductibles, work loss etc...I've been calling alot of my creditors, explaining my situation and asking if I can make reduced payments for now. I am shocked that most of them are being so supportive. My Target Visa was up to $4,000 and when I called; they told me they have a hardship program whereby they are putting me on $50.00 payments til August!!  I told them that I didn't need that long but they insisted...if I want to pay it off earlier fine; but just in case. A couple of other creditors also put me on a reduced payment plan with no penalty for the next 3 months. I would suggest doing this - I spoke with some very sympathetic people when I called. The customer service rep I had from Target Visa told me she had had Hodgkins disease when she was younger and all about her chemo. There are some decent and caring people out there. Well, I'm off to class... I sat around topless all day and it actually felt great;  but I'm putting my wig on now..",
      "MessageIndex": 1069,
      "PostDate": "04/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 8, 2008 06:37PM CarolC wrote: Dana, you are in my thoughts and prayers that this will be ok. I would wonder more if it was breast cancer that had mets to the liver rather than liver cancer... ? and don't you think it's strange that your doctor and the onco saw it and weren't more concerned? Who said they think it's liver cancer - the nurse?",
      "MessageIndex": 1176,
      "PostDate": "08/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Mar 19, 2008 06:01PM CarolC wrote: LJ13, I agree with you - I was just sharing what was shared on GMA this morning by Maalak Rock and her work with the Triple Neg Foundation. My doc told me that after my bilateral mastectomy there was a 75% to 80% chance that I was \"cured\" Radiation was not necessary since I didn't have a lumpectomy. The chemo would add another 10 to 15% in his opinion. Of course on an emotional level I would have preferred a promise that it wouldn't come back at all, but I know intellectually these are pretty good odds. Any cancer sucks and I was certainly not minimizing anyone else's experience. I hope that didn't come through. I was just honestly sharing my own fears regarding my own diagnosis. I like your sig line. Worrying doesn't affect the outcome of anything.",
      "MessageIndex": 1973,
      "PostDate": "19/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Mar 20, 2008 07:49AM CarolC wrote: ((((Dana)))))Happy Birthday! Have a great one!   LJ, Donna & Tina - go get em today ladies. Hope those se's are mild for all today. I slept well last night and hope mine hold off til at least the weekend. Happy Spring .... Carol",
      "MessageIndex": 1986,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Mar 30, 2008 11:31AM - edited Mar 30, 2008 07:52PM by CarolC Oh my gosh, Jewels - I've just finished reading a week worth of posts! I'm so sorry that I'm not going to shout out to everyone other than to say I read everything and loved hearing what was new, seeing all the pics and overall just sharing of what we're all going through. And sorry to hear the sad news too, such as your sister's diagnosis Vettagal. Before I get into my update - just want to add that I'd love to participate with a Secret Pal. Carol, I have a cool magnet on my fridge that came this week! Love it! And glad your AZ trip was so great - I love AZ! I've not had  horrible se's from my 4th and last TC tx. but I've felt pretty dragged out the past few days - upper respiratory thing is back with the constant watery eyes and runny nose. And, remember that hand/foot syndrome I had that I thought was just neuropathy? It was actually red, raw peeling abrasion looking things on my hand and bottom of one foot.  This time I have a little neuropathy in my toes, but I have the red raw abrasions on one arm that burn like heck! I'm thinking that I can deal with anything now that I know the treatments are behind me. FUBC!! But here's the real reason I've not been on -you will not believe this and it's a great example of how horrible people who do not understand can treat those of us with cancer. This is long and you will be shocked that this kind of thing can happen. I was fired this past week and the reason given was \"unprofessionalism\"! Some of you might remember that I shared early on that I was given a hard time and questioned by my dept manager and supervisor about why I had to take time out of the business day for doctor's appointments and treatments?  I was asked (fortunately in emails that I have copies of) why I couldn't schedule these appointments evenings and weekends? And also I was chastised in an email because my doctor called me and I spoke to him for less than 2 or 3 minutes at my desk. I was told I should have taken that call in a conference room because it \"upset co-workers to hear me talk about my cancer\". Can you believe it? There was lots more harrassment and finally in January I reported the supervisor who was actually out and out rude and insulting to me to our dept. manager. The dept. manager Cindy who I used to respect, told me to just toughen up - Suzanne is rough around the edges she said, but I could learn alot from her. She said I was being too sensitive. I had just been promoted and admittedly asked alot of questions about the database computer program that was necessary to perform my job. Almost everytime I asked a question, this supervisor  would loudly say so that our dept manager could hear, that she couldn't understand why I couldn't grasp it and maybe I wasn't qualified to take over the responsibilities of my new position? Initially I made light of it and tried to just joke that I wanted to make sure I did it right and/or possibly my chemo brain was kicking in. Well that seemed to just make it worse. Both she and the dept manager began to insist that I was making excuses - there was no such thing as chemo brain... and the insults just got worse and worse. Here's the deal - I'm 60 years old but not to sound vain -most people tell me I look like I'm in my 40's. Most of the people in my department are much younger - some even in their 20's & 30's. I never told anyone my age because I was the oldest by far in the dept and had heard snide comments about older people ( they consider anyone over 50 \"old\" ...anyway, the nastiest of the two - my immediate supervisor began to answer questions similar to mine asked by a couple of the much younger ones by saying things like \"I don't mind answering your question because I know you won't ask me over and over and you'll just get it\" while looking over at me. My doctors were appalled and my oncologist suggested I send them a copy of the EEOC's Americans with Disabilities Act re. Cancer in the Workplace. (great piece if you haven't read it) I don't know if they didn't read it or what, but finally after the nasty treatment continued - I again reported the supervisor to the dept manager and said she was bullying and harrassing me and that it was causing me extreme distress. i asked if I could be transferred to one of the other supervisors in our department? Sadly, I should have known that the dept manager who considered my supervisor her right hand person would protect her and told me to toughen up and not be so sensitive. And she began to also say that I was using my cancer as an excuse and that maybe I wasn't grasping some of the job duties. By the way- I was an account manager for a medical staffing firm - I worked with hospitals around the country to get them contract respiratory therapists for 3 or 6 month assignments. I met all my sales goals which I think irritated my supervisor as well - So the dept manager also said that all my asking of questions was distracting to the supervisor and why couldn't I grasp this as quickly as everyone else. Again, I explained that I was doing very well considering that I was working through cancer treatment and that I didn't understand why asking questions to want to do every aspect of my job correctly was seen as some kind of professional or intellectual failure. So my complaint was sent to Human Resources where supposedly it was investigated and it then became a situation that I was the one who was out of line and insubordinate by constantly trying to explain myself - it was coming across as argumentative. This was in spite of the fact that 2 of my co-workers told me they were asked their opinion in HR and they verified that I was being bullied and harrassed.  long story short - after that situation in early march the harrassment got worse - almost as if the supervisor was trying to provoke me to react angrily which I didn't. I knew better. But she actually took two other conversations we had regarding rates I gave to a hospital and insisted I didn't listen to her advice and therefore I was insubordinate again. Oh dear sisters - this saga just got worse. Finally I was called in and told I wasn't a good fit in the department because my questioning and trying to defend myself was perceived as insubordination and disruptive in the department! This week I've spent talking to the EEOC, a new therapist I had started going to who was so appalled she gave me the name of an employment lawyer who I then met with on Thursday. He is willing to take my case on a contingency and believes it's Discrimination due to my Disability and even Age (which I was surprised at). My insurance is going to be cut off as of the 31st and I have to pay for Cobra - but curiously after I wrote to the CFO and Owner of the company to tell him my version of the story  and that I had continuing treatment for my breast cancer - the company wrote and offered to pay for my Cobra for 3 months if I would sign an agreement not to sue them! Hah! The jerks! My new attorney is sending a letter certified out to them tomorrow telling them that we are declining their offer and would like them to pay me a year's salary and 6 months benefits and legal fees or we will file a lawsuit! If this got into a courtroom - it would look pretty bad for this company who is in the medical staffing business to have treated an employee in the throes of BC treatment this way. I also borrowed the money from my 401k to pay my Cobra so I can have my exchange surgery in April, continue going to my therapist and I'm scheduling everything else I can such as dentist, ob/gyn etc right away to get it done asap. And if I have to keep borrowing the money to pay the $450 cobra premium - I will do that. So that's where I am on this - a part of me is so fired up and on an adrenalin rush to see justice served.  How dare they treat me and potentially others in our situation so shabbily! I've also updated my resume and started job hunting and do have a couple of interviews set up - I was advised to not say anything about a lawsuit or even that I was fired at this point so that will be weird because I prefer to be up front with people. Especially because professional sales jobs aren't easy to come by at my age. Supposedly I should be able to collect unemployment because I wasn't fired for willful misconduct. Being a whistleblower or reporting a supervisor for harrassment and getting fired is not grounds to have unemployment denied - also the company in their offer to me if I would sign their agreement to not take legal action mentioned that they would not do anything to deny my unemployment... So there you have it..I needed to regroup before posting all this. You would think women in business would show some empathy for another woman dealing with breast cancer. CarolC.",
      "MessageIndex": 2185,
      "PostDate": "30/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 14, 2008 08:13PM - edited Jan 14, 2008 08:17PM by CarolC Hi Sister Jewels... Just thought I'd pop in to say hello to you all... what a stressful past few days I've had - not due to health but severe computer/email problems..I won't bore you with the details but we all know that isn't fun. I was able to read but not send messages. Ick. I'm getting more and more apprehensive for Thursday - D -Day.I can't stop thinking about it  - I feel like I'm going to the gallows. Today I picked up my steroid script. I hit the store for several items in preparation over the weekend but now see all kinds of other things I need to grab - Slow Move Tea - I drank that a few years ago - Great idea...I'll grab some of that. I've been writing to Edge  of \"Breast Cancer Watch\" and he suggested a few things for my Xeloda/Taxol regimend...\"Acetyl-l-carnitine for the neuropathy/numbing I might get from the Taxol, Pyridoxine (Vitamin B6, at 150mg / daily in three divided doses) for Hand/Foot Syndrome often a SE of Xeloda; probiotics like lactobacillus (from any health food store, and many pharmacies) during chemotherapy to re-seed the GI tract with beneficial flora and Traumeel S gel for mouth sores\". He's been a goddess send to me! My taxol tx will be 4 hours long. Sigh. I am so exhausted tonight after work and playing catchup; but please know I think of everyone on their tx days and am sending positive energy your way.  I wish you all mild SE's.",
      "MessageIndex": 536,
      "PostDate": "14/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 22, 2008 04:51AM - edited Jan 22, 2008 04:57AM by CarolC Good morning Jewels, I'm so enjoying reading all of your stories & experiences. In the interest of time needed to get ready to go back to work; I'll just again let you know that this sharing of all of our experiences and all of the great advice is truly inspiring. I didn't post much yesterday because I was physically and emotionally exhausted. I spent alot of time on the phone getting alot accomplished, considering it was a national holiday and banks were closed. However just to update you, I was able to get someone sympathetic from Wells Fargo Mortgage on the phone who walked through the  budget that I sent (but they hadn't yet received). He was able to set me up on a repayment plan over the next six months and stop any kind of foreclosure process. That was a big relief - at least for now. I also spoke to the Social Work office at UNMC and they are sending me a letter to share with creditors as to how my cancer has had an impact on my financial earnings and for how much longer treatment is scheduled to last. She tells me that this is usually enough to encourage even utilities and credit card companies to work with people. She's also sending a form for me to complete for the hospital co-pays & deductibles to be set up on a payment plan. I called Roche re. the Xeloda and I was told right off the bat that I don't qualify for their assistance program because I make too much money! Funny, if I make too much money how I'm getting behind on everything, but oh well. My group insurance company was closed so I couldn't check the status; but I did speak with my onco and agreed that if they don't cover the Xeloda after the appeal process, I will switch to Cytoxan - so my next treatment which is scheduled for 02/07 will probably be TC - continuing my Taxotere of course. He is actually glad that I'm willing to do the Cytoxan because not only does he doubt they're going to end up covering the Xeloda, but he feels the TC regimend has better proven results for triple negative bc than the Xeloda - I was the one who wanted the Xeloda. At this point - I just want to get on with the show and get it behind me as we all do. Any advice about Cytoxan symptoms are welcome - sounds like nausea will be a part of it. Also, is it always necessary to get neulesta afterwards? Last but not least, I  ordered my wig yesterday.... after all of this I was too exhausted to call any other creditors but want to do that before I'm late on anything. I am feeling so much better that at least I'm being proactive - I was so depressed over the weekend that I couldn't think straight. Thank you Jewels! You're all in my thoughts. And Carol - I thank you for your sweet generosity.",
      "MessageIndex": 693,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 6, 2008 06:47PM - edited Feb 6, 2008 07:13PM by CarolC Jewels, this is only my 2nd time using photobucket so I'm hoping these will come through.. One is shortly before being buzzed when my hair was thinning down to threads - then buzzed - then wigged... If they don't come through I'll try again. I'm still thinkin' this wig looks pretty phoney baloney...  Paula, Carol and all ofyou - you look awesome bald - let's face it - good lookingwomen are good looking women! You give me such courage!",
      "MessageIndex": 1120,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 8, 2008 06:48PM - edited Feb 8, 2008 06:50PM by CarolC Jewels - you are all the best!!! I love reading here and the open, sincere sharing we all do - it's a the sign of a real comfort level to be able to trust each other enough to say whatever is on our minds and not feel we will be judged in anyway. I'm still feeling ok although a bit like a cat on a hot tin roof waiting for the se's to kick in.. I got up almost every hour on the hour last night to pee and couldn't get back to sleep after 4:30... At work today I had lots of gas pain so I'm drinking my Smooth Move tea tonight and going to bed. We have a Democratic caucus here in Omaha tomorrow that I want to go to to so I'm hoping I still feel ok in the morning.  Just bring 'em on and get it over with already..it's this waiting that's the killer. Sorry to fink out without chiming in on all the news but I do want to say that I would love nothing more than to do a get-together or retreat at someplace like Vegas/Beach/Spa - anyone ever been to Sedona, AZ? That's a very healing environment and there are great spas there - some pricey and some not. Just another option. Sweet dreams..",
      "MessageIndex": 1177,
      "PostDate": "08/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 19, 2008 07:46AM CarolC wrote: Oh gosh sisters...i feel like such a whiner. thanks so much for asking about the neuropathy. It does seem to be getting better every day. Not sure if it's just a cyclical thing that comes along for a few days or if i have to stay on the meds. But  I'll find out today because after feeling like a truck hit me all day yesterday and dragging myself out of bed, I finally took my temp. I know I should have done it before but I didn't feel like I had a fever. This morning it's 100.9. I'm waiting for the docs office to open to call - he told me I'm to come in immediately if it hits 100. It's always freakin' something with this chemo journey, eh? Funny, I have a fever but I'm sitting here with a pounding headache, chills too. and then this runny, slightly bloody nose. Anyone else have that? I see several of us are going through some uncomfortable se's this time. It actually crossed my mind this morning to go in and say to my doctor \"I quit\"!! Dana, you're in my prayers that you don't have liver cancer. Anyone having tx today - just remember it will be over in a few hours. And to the rest of you - I love you Jewels - what a gift to have this group for support. Carol",
      "MessageIndex": 1410,
      "PostDate": "19/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Mar 22, 2008 10:28AM - edited Mar 22, 2008 10:29AM by CarolC Hi Jewels, Just checking in briefly to wish everyone a Happy Easter. I don't think I'll be on much this weekend because I'm feeling some se's kickin' in....chills, nausea and then clammy. Uh Oh. I'm going back under the covers, I think. Paula, I always take my pets into bed with me - so I'll probably spend some time snuggling with my 3 little King charles spaniels and 2 fat cats. I feel so badly for them when I'm like this because I feel like they must be bored. I'm trying to catch up on reading everyone's posts but don't seem to have the energy for individual shout outs except to say I'm thinking of you all and will check in when I can. Gentle Hugs, CarolC",
      "MessageIndex": 2032,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Mar 31, 2008 08:55AM CarolC wrote: Thanks everyone for your compassion and support. The treatment I was receiving at work was a large part of the depression I think that I was feeling a few weeks ago. Even though this is going to be challenging - I've been sleeping so much better since knowing I don't have to face that horrible treatment. I've never seen such mean people in my life. Happy Monday all - glad to see no one has chemo today... ....my eyes are still watering and nose running and I've had an ache on one side of my lower back for weeks that is making me a little nervous. If it moved around or was in more than one location I guess I would think it was just muscularskeletal pain from the taxotere. I finally dug out my heating pad and used it all weekend. Anyone else have anything like that?",
      "MessageIndex": 2194,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Nov 22, 2007 12:30PM - edited Nov 22, 2007 01:50PM by CarolC I am so very sorry for the loss of your mother - what a sad day this must be for you. I hope you take some small comfort in knowing that we all understand what you are feeling. You are not alone in this. Hugs and Deepest Sympathy, Carol",
      "MessageIndex": 18,
      "PostDate": "22/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695828",
      "Title": "My Mom is a Angel Momrita lastminuteD"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 10, 2008 06:37PM - edited Jan 10, 2008 06:43PM by CarolC Hi Jewels, I am just so grateful that I'm a member of this group! What a great bunch of women - and this kind of sharing is so comforting to me. I'm the kind of person that hates surprises - or at least about my body & life. As I get closer and closer to my *C* date, I'm getting very nervous. Reading about how prepared you all are, I realized that no one had told me what to expect next week or how to prepare for my particular regimen...so i panicked today and called my Onco's office, and told his nurse I needed to have some information about what to expect. She told me that they would go over  that with me when I get there!! I had a strong reaction to that - how was I supposed to know if I would need a driver going home, what to eat ahead of time, steroids,etc?  I admit I even told her I was a member of a January chemo group of women on BC.org and everyone else was prepared. wah!  wah! Nursy seemed a bit frustrated with me until I asked her how she would feel if she was getting chemo for the first time and expected to show up without any preparation??    She sure changed her attitude fast -- called me back twice today telling me about the steroid prescription she called in for me, eat lightly, etc.  LOL you know, we've earned the right to have all of our questions answered.... D1 your hair loss saga is fascinating and is taking a bit of the fear out of it - you're right on in that it shows the world we're sick and that will be very uncomfortable for me.  I need to toughen up, I guess. But I have a hair loss question and wonder if anyone can help? I'm doing Taxol by IV and Xeloda orally.  X doesn't cause alopecia.. Both my onco last week and now today his nurse,  told me that usually women don't have much hair loss with taxol - thinning definitely but they have very little incidence of alopecia. Is this possible? Everything I've read on taxol including it's own literature says it often causes complete hair loss... my biggest fear was/is the baldness so I'm trying to hold out a bit of hope.  Do any of you sister jewels know of anyone who didn't lose alot of hair with taxol? Dana -prayers are winging your way for your dad... Welcome to our newest  jewels - Carol - hope things went well today and I'll be sending positive energy for Billsgirl and Amy's first cocktail!",
      "MessageIndex": 460,
      "PostDate": "10/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 17, 2008 08:41PM - edited Jan 17, 2008 08:52PM by CarolC D1, let me start be by saying you are the bomb! And you're beautiful with or without hair. You're so blessed!  I'm going to be worried now when I have my next txt of Taxotere. My first one yesterday was so easy. Sending prayers to you DianeB, that this one is much easier. And also sending positive energy to everyone else. I had a bad experience today; but not with SE's  I was to begin taking my Xeloda orally  today and I got a call from my doc's nurse that they couldn't get my insurance to pay for it since it was off protocol to give it in an adjuvant setting! Duh!They just find this out now??  Indeed It was originally used only for mets but is being prescribed in some trials for my kind of cancer.. Now my doc is the Chief of Medicine for the University of Nebraska Eppley Cancer Center and used to be the head of the breast cancer center of the NCI in Bethesda. He is very respected and actually our dear Constantine referred me to him. My doc responded to my fears of anything that could cause cardiotoxicity and also was aware of a few trials that had been done using  XT (or Cap+Tax) for triple negs. Well, I was freaked out. Actually this nurse who was supposed to have had it authorized beforehand, was acting like a dolt. I told her I was going to call my insurance co myself  and appeal it. Well, when I called my insurance co 2 minutes later, they insisted that it had *not* been denied, but that it just had to go before the review board. They said they had explained all of that to my nurse who was supposed to just have my doctor call over there or fax a letter and then their own review board of docs would decide.. I called her back to tell her this. But she acted like there was nothing odd about her misunderstanding their message and then calling to tell me it was denied.  We left it that she would have Dr. Cowan call the insurance co. when he got out of some meetings he was involved with. Next thing you know - nursy called me back mid afternoon to say that now it was definitly denied and that I would just stay on the Taxotere and nothing else. Finally, I  decided to just accept that. Don't you know that I stopped for groceries on the way home from work and when I got back to the car there was yet another message from her that Dr. Cowan had asked for it to be appealed and that now it was going through that process! Can you believe what a big clusterf**k  this is! Anyone else have any problems like this? Oh well, I'm going to take one of those Shiff's knockout pills w/melatonin. I'm so wide awake but exhausted too! The fun begins -  fighting the medical system is just another great big SE.",
      "MessageIndex": 617,
      "PostDate": "17/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 23, 2008 04:48AM - edited Jan 23, 2008 04:52AM by CarolC Dear RN2teach - who wouldn't be needy with the challenges you are facing?  Prayers for Eddie are winging your way. And dear Dana - I am so sorry you got the news you did - it's like a kick in the gut, isn't it? You are strong though and you will get through this along with the rest of us.  There are other her2 neu+ on this board - I'm a triple neg so I've not followed all of those challenges because I've been so nervous about my own. But we are warriors, remember? Why don't you go to the Cancer Center's Social Work office like I had to do and ask about making arrangements for your co-pays right up front?  UNMC told me that they get these requests all the time and they totally understand. Don't avoid it until after the bills are late. I did that with one from just this past October and yesterday got a notice that they turned me over to collection for a $160 co-pay that I hadn't sent payment for! I didn't intend to let it go this long, but my lesson is that I should have contacted them right away. Now I have to call and get this one resolved. I'm learning we need to be proactive up front if we anticipate financial problems due to our cancer medical bills. Thanks to the great advice I've received from some very wise jewels - I'm speaking up rather than worrying. To all the rest of the Jewels - hope today is better than yesterday - no one starting treatment til tomorrow, I see. Stay warm.",
      "MessageIndex": 728,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 31, 2008 04:41AM - edited Jan 31, 2008 04:48AM by CarolC Hi Jewels, I am so out of it - I've been missing reading at our group but I'm again having horrendous computer/virus problems - some kind of a strange trojan got into my system on my laptop; and the Spyware program tech people are even having trouble removing it. So I'm staying offline as much as I can. Just need to tell you that I'm here in spirit and can't wait to catch up on everyone's journey. My hair started coming out the day before yesterday - even though I expected it, it made me queasy to actually see the clumps in my brush. Foolishly I wore a black sweater to work yesterday and everyone kept brushing the hair of my shoulders and back. I have a business event tonight so probably won't have a chance to cut/shave it til Sat. And I will send pics. No other se's for me - hopefully that will last til my 2nd tx on 2/7 - my first combo of Cytoxin along w/the taxotere. As I mentioned, my insurance co wouldn't approve the Xeloda even after we appealed it because they consider it experimental to use in an adjuvant setting. Sigh. JackieB- I see you get your first cocktail today - good luck. And to all of you who've been treating this past week - know I was sending positive energy. I promise that I'll have the time to read everyone's posts from this past week and catch up by the weekend.  I feel so out of it and  one of the few bright lights in this journey we're on is the understanding and support we all get from each other here. What a great bunch of savvy, smart and beautiful women - I'm always quoting one or the other of you to my friends. Big Hugs,",
      "MessageIndex": 975,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 6, 2008 04:34AM CarolC wrote: Julie, Just checking in and saw your post about sleeplessness - mine was about a week or so out. Constantine, our wonderful breast cancer research guru gave me the name of a wonderful product for those nights which I picked up at a health food store - or you can order it online through Vitacost. check with your onco but I find when I can't sleep that this does the trick \"Knock-Out\" by Schiff - a combo of Melatonin w/Theanine & Valerian. No aftereffects at all for me.... Sorry about your weather - how horrible these tornados have been  - were you getting some of that residual effect? We've just got blustery snow here in Omaha today. Off to work but wanted to send my best wishes to all my sisters in survival. ps. my 2 cents if it helps with the shirt sizing - I'm a size 10 or 12 but a bit large boned ... I ordered the Large and even after washing it - it fits fine - it's very generous and I could have probably taken a Medium but wouldn't want to chance it after washing.",
      "MessageIndex": 1104,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 8, 2008 06:54PM CarolC wrote: Oh and Maz - just had to tell you how much I loved your pics! Your son is a cutie, as well.",
      "MessageIndex": 1179,
      "PostDate": "08/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 13, 2008 05:13AM CarolC wrote: Carol - Happy treatment day, Sister!! Just another one another the belt on our way to being better! Again, I went to bed early last night - any whining I can do is mostly due to the neuropathy - D1, like you experienced, I have the tingling, the red, raw & peeling knuckles and still the bottom heel of one foot. So I limp around a little - guess it could be worse. Woke up to go to the potty and decided to check in with the jewels - what a life. Just a quick welcome to Wendy & Denise as well and a shout out to all our other sisters. I'm going back to bed for at least another hour or two.. Hugs to all... Carol",
      "MessageIndex": 1277,
      "PostDate": "13/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 14, 2008 06:28PM - edited Feb 14, 2008 08:19PM by CarolC Happy Valentine's Day Sister Jewels - warrior women! I continue to be so inspired by you all. I've been pretty miserable the last two days.  My Tx # 2 a week ago today brought very few se's or so I thought, until the past couple of days when the neuropathy has become almost intolerable. It's all over my hands which is unsightly but at least manageable. In addition though  I have a patch of it on the heel of my right foot.  The entire heel is red, tingling and becoming more and more numb each day. Yet even putting a shoe on it  or any pressure walking is excruciating. I've been taking the L.Carnatine & B6 that was suggesed.  I picked up some Capsacian roll on lotion that I read helps and it did- for about 10 minutes.   This morning I called my doc's office and he called in a script for Lyrica which of course my insurance co. wouldn't approve. (My new group insurance carrier is horrible, IMO) Finally they approved Gabapentin which I am praying will kick in soon. I had to go to work with my shoe half off looking like I was drunk probably; and then walk around the office on tiptoes in my socks - between that and my wig slightly askew, I was a vision of loveliness! I'm so sorry to be so whiney, but this hurts like hell! Wah! Wah! Wah!!  Even nausea is better this. Take good care dear jewels... and thanks for letting me vent. ps. oh, i have the runny nose too!",
      "MessageIndex": 1322,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 18, 2008 07:36PM CarolC wrote: Hi Jewels, Just checking in after a weekend of pretty much being offline due to just extreme fatigue and the continuing neuropathy on now both feet. Don't get me wrong - it was much more tolerable than when it started, but still difficult to put on shoes and walk much. I pretty much tippytoed around the house and slept and read. I also had chills and this constantly runny nose - went to work this morning til noon and had to come home because of the fatigue and achiness. For some reason while I type, every few words gets deleted. Is there something going on on the site? I'll check in again later but wanted you all to know that I just finished reading everyone's posts and caught up. Sending positive energy to you all. Carol",
      "MessageIndex": 1402,
      "PostDate": "18/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 7, 2008 06:32PM - edited Jan 7, 2008 06:34PM by CarolC Hi Carol, I've been down with a bad cold so haven't been writing much this past weekend. Just wanted you to know that I'd love a shirt - I love the idea of FUBC on the back! Or maybe small on the front at the breast instead of a polo pony...lol Any color is good - does anyone like black w/maybe pink writing- or is that too gaudy? I would probably take a large - or whatever size 10/12 fits. I've been really getting apprehensive about starting my chemo - I'm so nervous about all the side effects and still totally traumautized about losing my hair with my XT treatment. I had asked for Avastin instead of the Taxol but my doc insists my insurance won't cover it for adjuvant treatment. I wanted it because there's so much evidence that it's good for triple neg; but also I wouldn't have lost my hair. I know that's an immature reason, but there you have it. I'm a much bigger baby about the chemo than I was before my bilateral mast. Well, please know that while I've not been posting much - I'm reading all of your experiences and learning so much. The one thing we all seem to share is a sense of irony and humor. Sometimes I believe that's the best medicine there is- too bad it can't cure cancer, eh?",
      "MessageIndex": 380,
      "PostDate": "07/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 15, 2008 04:46AM CarolC wrote: Trudy, Just want to wish you good luck today starting your tx. ! Wishing everyone else a good day of mild SE's..",
      "MessageIndex": 537,
      "PostDate": "15/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 15, 2008 07:55PM - edited Jan 15, 2008 08:01PM by CarolC Kimberley, I love the SE Circus! What a hoot! You're such a talented writer - you have to know that, right? I love the sense of humor that most of us on here seem to have. Everyone I've told about my being a member of the January Jewels seem almost envious. LOL Julie, I'll be anxious to hear about what you think of the free wigs from the American Cancer Society? Like Sista2, I'm curious to hear about what different chemo rooms are like. Guess I'll be seeing my first one soon enough. I  hope I don't cry when they lead me in. My treatment doesn't  start til 2 pm Central, that means I don't take my first steroid til 2 am and then at 8 am - does that seem normal?  - what am i thinking? there is *nothing* normal about cancer!! D1 - I keep thinking of you looking like Chucky! You're a great role model on how to handle losing one's hair with dignity... Carol .. will you be telling us where to send our checks for our FUBC shirts soon? I don't want to forget once I get chemo brain. Seriously tho, I'm so glad to be here during this strange journey we're sharing. KathyL and Maz - well here we go girls...   let's buckle our straps and hold onto our hats!",
      "MessageIndex": 562,
      "PostDate": "15/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 16, 2008 06:37AM CarolC wrote: What timing! Did anyone see Robin's celebration of her last chemo treatment on GMA. I am sitting here watching it with tears running down my face before leaving for the UNMC chemo department. If you haven't seen it - go to the Good Morning America website where the story is told. Her oncologist gave a great analogy of why we need to go through this.. To my sister warriors....have a good day and take good care of yourselves.",
      "MessageIndex": 566,
      "PostDate": "16/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Jan 21, 2008 06:35AM - edited Jan 21, 2008 06:37AM by CarolC Good luck Cathy-Ca!! You know we're all there in spirit with you. I called off for at least half the day today because I'm still having chills, achiness  and just feel weird. However, just my luck - I had also planned to call my bank again re. my mortgage and the Social Work office at the Cancer Center at UNMC to discuss counseling for my financial difficulties. Of course of all days to stay home - it's Martin Luther King Day and banks are closed! Sigh. Maybe someone will be at the Cancer Center - we'll see. But at least I'm trying to develop a game plan here. Thanks for such great ideas and understanding. In the past I would never have shared something like this but I'm not going to take this treatment without excercising all my options. I also wrote last night to Roche re. my Xeloda denial in the event that it doesn't get approved on appeal. Interestingly enough I found that they have an assistence program which includes Xeloda. So I wrote to them at https://www.pparx.org/Intro.php. Check this site out because it explains the process that you can request assistance for any of their treatments. I imagine it's similar with other drug companies in case anyone else ends up having a similar experience. Kathy L,thank you so much for this great idea!! Lastly, Carol I was about to write your check and I'm so sorry I'm confused. Is it $11.74 plus $3.00 shipping or did that price include the shipping? You probably told us but I can't seem to find it. My thoughts are with all of my sister jewels today - I am so glad we have each other! Well I'm getting on the phone now to see who I can reach. Take gentle care of yourselves today, Jewels.",
      "MessageIndex": 676,
      "PostDate": "21/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 4, 2008 06:45AM - edited Feb 4, 2008 10:44AM by CarolC Oh gosh Jewels - here I am dragging back to you. What a horrible weekend. I had plans to get my hair cut off Saturday morning because it was coming out in clumps. Friday night a couple of gfriends and I went to the Mediterrean Cafe that we've gone to lots of times - the last supper w/hair. They were going to go to the salon with me the next morning and take pics of my buzz cut so we ate well and I drank a couple of glasses of wine. At about 3:30 am I woke up w/horrible gastro pains and began to throw up on and off til morning. I was convinced I must have food poisening since it had been 2 1/2 weeks since my tx. Anyway, I insisted on trying to drag myself to my car to go to my 9am appt. on Sat...my friend Eva who thank God is a nurse, told me I should reschedule but I was determined to just get the hair off. Next thing you know I felt faint, sat down on a step to the driveway of my condo and began to throw up outside. OMG - how humiliating. Eva insisted on walking me back inside and all I could do was lay in bed - well, that is between getting up to throw up more and then the diarrea. I spent most of yesterday feeling like a truck hit me and couldn't eat anything other than a little cereal in the morning and some chicken soup last night. I stayed home from work today because I still feel pukey and have a slight case of the runs. My friend is convinced that I had some kind of virus; but I'm still not convinced it couldn't have been food poisening - I did eat some things they didn't. This couldn't possibly be from chemo this far out, could it? I felt so awful that I didn't even feel like checking email - that's not like me. I did drag myself out yesterday to one of those quick hair cutting places and got my buzz cut and dragged myself back home to bed. I couldn't stand the handfuls of hair and my scalp being so sore. I'll take pics today or tomorrow. Kathy L....you and Maz are probably at the same place. Tonight is my Look Good Feel Better class - I hope my tshirt comes in time for me to wear it! It's exciting to read that you're all getting them. PaLady - you look gorgeous bald, with scarf and wig. I'm reading everyone's post but still trying to get my energy back. I'm sorry it seems like it was a tough week for se's for our jewelbox. It will be interesting to see how much different my reaction is to my 2nd tx - this Thurs on the 7th. Since I couldn't get the Xeloda approved - we'll be adding Cytoxan to the Taxotere. Last time I drove home myself afterwards - do you think I'll be able to do that this time? I was told the TC is about 3 hours - is that about right for the rest of you on that cocktail? Well, I think I've worn myself out typing (how pathetic) - I'm going to take a nap and will check in later. Anyone having tx today - I wish you well. And I wish us all a gentle week of few se's.",
      "MessageIndex": 1061,
      "PostDate": "04/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 6, 2008 05:28PM CarolC wrote: Hey D1 - just noticed my revised treatment wasn't in the header - it's now Cytoxin Taxotere 4 times 3 weeks apart.  You are amazing to be able to stay on top of all of our tx - I can barely keep track of my own. See you at the bar tomorrow  CHJ,  LJ13, Maz, Sista2, and DianeB I'll have my laptop there tomorrow - maybe I can get a photo or two like Carol did with my FUBC shirt on!! Cool idea!",
      "MessageIndex": 1118,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 11, 2008 04:45AM CarolC wrote: Happy Birthday D1!!! CHJ and CathyCa-have a calm and easy infusion cocktail today.. Today is day 4 after my #2 tx and I still don't know that I've had any real se's to speak of. I did keep a low profile all weekend (after going to the caucus Sat) because I just feel dragged out and tired; but I'm afraid to get my hopes up that this could be the worst of the se's. I've not had the bone pain yet either. I'm going to work today and will see how it goes... Here in the midwest we've still got the freezing temps and it would be so nice to stay under the covers but I need the $$$... if you know what I mean. Kimberley and JKiss - Love your pics!!! Have a good day sister Jewels!",
      "MessageIndex": 1227,
      "PostDate": "11/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Feb 15, 2008 04:38AM CarolC wrote: WVGirl, PALady, Deb, Paula, peg1212 and Vettegal - wishing you a gentle day as you partake of your chemotini's today. As for me - I think the pain meds are kicking in and the neuropathy on the bottom of my foot is starting to feel better. At least I can walk without ouching with every step. Have a good day Sisters -so glad it's almost the weekend! Carol ",
      "MessageIndex": 1328,
      "PostDate": "15/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Mar 16, 2008 09:16PM - edited Mar 16, 2008 10:22PM by CarolC Hi Sister Jewels, I'm so sorry I've been away so long. I don't know exactly why I've been off the thread - I think I've been in a bit of a funk and depression since my last tx which was my third.  I had some bad side effects and then just couldn't shake this feeling of overwhelming sadness. I became a bit overwhelmed and needed to stay away from everything pertaining to breast cancer. One thing that had been bothering me is that I'm a triple neg and get google alerts for anything having to do with triple neg breast cancer in the news. I was getting two or three of them a day and it became pretty depressing reading about how aggressive it is; even after chemo. I was lead to a link on a woman's blog who said the world needs to know that triple negative breast cancer is the kiss of death no matter what they say. Her mother had died from it! While I know she was expressing her feelings about her own experience and the loss of her mom; it felt like someone kicked me in the gut when I read that because I had been so optimisitic. Since reading that, I've had trouble  shaking this feeling of doubt and believe I've been having a big fat pity party for myself.  I'm not proud of that because I am usually such a positive and optimistic person and believe in the power of faith and positive thinking. Actually yesterday I finally came on and peeked at our Jewel thread but felt so overwhelmed at how far behind I was and what a baby I was being. We're all going through tough times and deserve each other's support and I am so sorry that I've been isolating. I'm going to do a quick post tonight and try to get caught up in the next couple of days. I've been just so fatigued and achey and that foot and hand issue that I thought was neuropathy; my doctor said was hand/foot syndrome which usually isn't a SE of TC. I have a constant pain in one hip and watery eyes and runny nose. Ick! I'm a mess! Has anyone else experienced this overwhelming depression? Anyway, this Wednesday is my last tx as well - and then I'm done like some of us are! You would think I would be thrilled instead of wallowing in self-pity. I am also hoping to have my exchange surgery for my implants in April. On a positive note; I'm loving all of the new pics posted and laughed at all the funny hoot stories Carol has shared and all the inspirational and courageous feelings everyone shares. Dana, I'm sorry you got this latest news but you continue to be in my prayers. I'm interested too, in hearing what tx. they recommend. I promise to be better at staying involved. I've always had a tendency to be an isolator when I'm worried, depressed or sad. I've scheduled an appoint with a therapist because I think I need to talk through some of these feelings. I'm divorced and live alone and letting it get to me and I know that isn't healthy. Love and Hugs to you all, Carol",
      "MessageIndex": 1928,
      "PostDate": "16/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Mar 17, 2008 07:34AM - edited Mar 17, 2008 07:37AM by CarolC Veggegal asked \"Does anyone have peachfuzz growing on there head during treatment?\" I do! I have actually more than peachfuzz...some of my hair is close to an inch long. I wonder if it's because I never actually shaved my head - I just had it cut very close to my scalp? I'm pretty shocked that I have as much as I do and it hasn't seemed to fallen out since the 2nd tx. Thanks Gals for understanding my absence the past couple of weeks - it's good to know it's ok to just read. I had read a post from someone wondering if those of us that hadn't posted still wanted to be considered \"Jewels\"? Knowing now how sometimes being in a funk but still needing to know there is a place to read and check in when we feel up to it; is a gift. Once a January Jewel - always a January -08 Jewel, in my book! Off to work! Have a good day! CarolC",
      "MessageIndex": 1934,
      "PostDate": "17/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Apr 1, 2008 10:14AM - edited Apr 1, 2008 10:18AM by CarolC Good morning Sisters, Kimberly & Carol - good luck today with your treatments! May your se's be mild and few. Just wanted to check in to say hi and let you know I'm thinking of you and so grateful to have your understanding and support. No matter what we share and discuss here - there are always wise opinions and great advice... Your supportive indignation over my work situation is so appreciated. I just spoke to my lawyer who will be sending over the draft of the letter he's sending to my former employer today for me to ok. He is claiming both disability & age discrimination. He suggested we not ask for anything from them at this point - he doesn't want to show our hand - he's telling them if they'd like they can call him to discuss the situation before we take any action. I told him I'd defer to his opinion. He wants to get any info from them before I meet with the EEOC on April 8th.  CathyCa - I think the FMLA law can only be enforced once someone is there for a year. I had just relocated to Omaha from Pittsburgh last year and had only been employed by this company since last June. One lawyer I spoke with said she wonders if that's why they decided now might be a better time to terminate me rather than after this June so they could avoid being accused of violating FMLA guidelines? Especially since I had already reported the harrassing treatment to HR. I have no idea... my friend told me that their treatment of me reminds her of the movie \"Mean Girls\".... I'm now off to my wonderful new therapist, then checking in at the Workforce office since I was able to file for unemployment wages (the company said they wouldn't contest it) and will check in later. Just don't want to get behind on my reading again. Sending hugs and positive energy to all you jewels. Ps. kathyL - I couldn't get your link to your page to work..",
      "MessageIndex": 2214,
      "PostDate": "01/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "CarolC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57132/profile",
      "Content": "Apr 2, 2008 12:02PM - edited Apr 2, 2008 12:06PM by CarolC Wendy, Sheebas & Joan - good luck at the chemobar today! Won't be online much today but just wanted to check in to say hi and send good thoughts to all of you. Still so appreciative of all the good advice and concern you have all been sending re. my employment situation. I'm feeling cauteously optimistic that something good will come of it. But in the interim, I'm busy getting resumes out and job hunting... Kim - thanks to you and your dh for the cobra advice...I'll mention it to my lawyer when he sends me over the final draft of the letter today. I already sent my own money for April's cobra pmt. but we shall see what happens after they get the letter. D-1 - prayers being sent for your bil's medical crisis. Paula, glad to read you're beginning to feel better. Tina - let's just keep hoping our midwestern weather begins to warm up - they're saying we're headed for a nice weekend. ..to all have a nice day. Love you ladies! CarolC ...and that Reggie is a real cutie pie, Carol!",
      "MessageIndex": 2230,
      "PostDate": "02/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    }
  ]
}