{
  "AuthorID": "CaroleH",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136310/profile",
  "Posts": [
    {
      "AuthorID": "CaroleH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136310/profile",
      "Content": "Oct 23, 2011 12:28AM CaroleH wrote: Hi Deb and anyone else out there, Had my bilateral Masectomy 2 weeks ago, with lymph nodes removed under one arm. Have the chest expanders in, and after initial pain, things seem to be settling. Am about to start my Chemo on the 4th Nov. I sunk into abit of depression about this, as my Oncologist said he is putting me on the highest dose for 10 weeks, I was hoping for something mild. He is giving me FEC - combination of Fuorouracil,Epriubicin Hydrochloride and Cyclophosphamide. Has anyone out there had this combo, and what is Chemo like? I know its different for everyone, but how bad does it get? Are there any tips for getting through easier? Thanks. xxx",
      "MessageIndex": 15,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/775065",
      "Title": "Help, am scared about making wrong decision CaroleH CaroleH"
    },
    {
      "AuthorID": "CaroleH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136310/profile",
      "Content": "Oct 27, 2011 02:35AM CaroleH wrote: Thank you so much for that info on the Chemo, it was really great to read that it is 'doable', I think I have been too focused on what could go wrong, instead of the positive side of what could go right.Its so easy to get your head into a bad space at this stage. I will click on the link you said and have a look. But I really appreciate your words of advice, they have helped alot. xx",
      "MessageIndex": 18,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/775065",
      "Title": "Help, am scared about making wrong decision CaroleH CaroleH"
    },
    {
      "AuthorID": "CaroleH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136310/profile",
      "Content": "CaroleH wrote: Have just had my biopsy done on Friday and am waiting for results, but not looking good, the doctor who did the biopsy said i would definetly be requiring surgery. I have a cluster of 8 on my left breast and a big lump on my right, with another 4 in different area on my right. Have spoken to a friend who ran a breast clinic for years who said that a mascetomy is delinetly on the cards,the doctor who did the biopsy said the same thing. So am playing the waiting game.Have of course been flipping from denial to absolute grief all weekend. At first i was just scared about an operation, now I'm just plain scared of dying. Everyone says be positive and stay focused, but am finding it hard. I have one really big question amongst the many, and that is, we ,as in my family were mean't to fly out for a 2 week holiday in Europe on Friday. If my surgeon says I can go, do you think I should? Am I jumping ahead of myself here until I find out exactly what I will be having done? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/775065",
      "Title": "Help, am scared about making wrong decision CaroleH CaroleH"
    },
    {
      "AuthorID": "CaroleH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136310/profile",
      "Content": "Sep 25, 2011 01:56AM CaroleH wrote: Hi everyone - well I didnt end up going overseas, but I am going away for 3 days after my MRI tomorrow, to a beach just 2 hours up the road. My diagnosis is Invasive Micropapillary Carcinoma, so if there is anyone else out there that has that, I would love to hear from you. I am having a Bilateral Mascetomy, and not sure about afterwards, whether it will be just Chemo or Chemo and Radiation. Wont know much more until after the op, which am still waitng to hear back about, probably in a week to 10 days. What's the MRI like, will I get claustrophobic? Also is it normal for your breasts to ache a week after the Biopsy, or is it because I'm going through Menopause?",
      "MessageIndex": 10,
      "PostDate": "25/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/775065",
      "Title": "Help, am scared about making wrong decision CaroleH CaroleH"
    },
    {
      "AuthorID": "CaroleH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136310/profile",
      "Content": "Sep 17, 2011 04:32PM CaroleH wrote: Thank you so much. I think I will. I just didn't know if it would be the 'elephant in the corner'. Are any of you going through menopause at the same time. I just started about 3 months ago and have been on estrogen and progesterone. Do you think I should stop taking that? I've heard its really bad for this type of cancer. You are all so nice and supportive. When will I stop crying and face up to all this?",
      "MessageIndex": 4,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/775065",
      "Title": "Help, am scared about making wrong decision CaroleH CaroleH"
    },
    {
      "AuthorID": "CaroleH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136310/profile",
      "Content": "Sep 17, 2011 04:36PM CaroleH wrote: Hi Julianna - thank you for your lovely positive message. I noticed you had all the imfo about what you have in your details. I'm abit dumb with all this, but does this mean youve had an mascetomy?If so, did you have reconstruction at the same time, as there seems to be alot of deate about whether to do that or not? Again thank you so much, it so helps talking about it with people.",
      "MessageIndex": 6,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/775065",
      "Title": "Help, am scared about making wrong decision CaroleH CaroleH"
    },
    {
      "AuthorID": "CaroleH",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136310/profile",
      "Content": "Sep 17, 2011 05:29PM CaroleH wrote: Thank you Rachel for your good advice. Yes I think I should go, otherwise I will just be sitting around waiting for the inevitable to happen. Am just hoping I don't spoil it for the others. Yes I will have my results, and its great to have this site to talk to all you lovely ladies. You all seem to know so much about your results, i guess I'll have to start writing everything down.This waiting is dreadful, and I find I'm already acting like a sick person, when I feel fine.Its a beautiful day outside, so am going to leave now and enjoy it. Thank you again, I no longer feel that I am facing this alone.",
      "MessageIndex": 8,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/775065",
      "Title": "Help, am scared about making wrong decision CaroleH CaroleH"
    }
  ]
}