{
  "AuthorID": "Carrie61",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
  "Posts": [
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "Dec 19, 2015 03:59PM Carrie61 wrote: Thanks for this info. Unfortunately for me the Afinitor write up was not very encouraging. I am supposed to start this drug on Monday together with aromasin. How can they promote these drugs when all the trials found no overall increase in survival rates. 64%of the group had to give up or reduce the dosage...this does not give me much hope for this drug :",
      "MessageIndex": 22,
      "PostDate": "19/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/838663",
      "Title": "2015 SABCS - Anne's Perspective Bestbird artistatheart"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "Carrie61 wrote: I was dx stage 3a last year, did my treatments, then had a MRI which showed 3 tumours in my bones and was told that they were bone metastasis by radiologist(it was a private MRI). Then had a PET scan which showed no cancer activity.  In the meantime I had changed MO's, and the 2nd oncologist said that I would never know if the tumours had ever been cancerous in the first place since I didn't have a Pet scan prior to chemo.  Although I. Am overjoyed that the PET came back clear, now I'm wondering if in fact the chemo killed these cancerous tumours or not.  Any one else run into this?  Carrie Dx 8/8/2013, IDC, 3cm, Stage IIIA, Grade 3, 4/10 nodes, ER+/PR+, HER2- Surgery 9/2/2013 Mastectomy: Left; Reconstruction (left): Tissue expander placement Chemotherapy 11/26/2013 AC Hormonal Therapy 3/20/2014 Arimidex (anastrozole) Radiation Therapy 3/24/2014 Breast, Lymph nodes Dx 7/24/2015, IDC, Left, 3cm, Stage IV, Grade 3, 4/10 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/821241",
      "Title": "Am I stage 3 or 4. Carrie61 Kicks"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "May 19, 2014 10:39PM Carrie61 wrote: Posting this so you can see my stats. Carrie",
      "MessageIndex": 1,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/821241",
      "Title": "Am I stage 3 or 4. Carrie61 Kicks"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "May 20, 2014 10:02AM Carrie61 wrote: I Had a bone scan and ct scan done prior treatment as well and these turned up nothing.  I also had another bone scan done to confirm MRI tumours and these showed up clear as well.  I really do want to go with stage 3 but also want to be realistic.  Thanks for your input holeinone (I'm a golfer too) and tectonic...",
      "MessageIndex": 4,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/821241",
      "Title": "Am I stage 3 or 4. Carrie61 Kicks"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "Apr 19, 2014 07:03PM Carrie61 wrote: I am the ultimate lurker, and after stage 3 dx was already reading many of your Stage 4 posts.  I somehow knew that I would end up here so not totally shocked, however my DH and children ( all grown) are in shock.  Private MRI found 3 tumours, 2 on spine, one in pelvis, so even though no pain at all, and just finishing radiation, I find myself here with you all.  Hope to learn a lot from you all!  Carrie.",
      "MessageIndex": 549,
      "PostDate": "19/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "Sep 6, 2013 02:31AM Carrie61 wrote: Hi everyone, just want to update you on my UMX done on Tuesday. I also had a sentinel node injection done, which was less painful than I had read about (only 1 needle). Then 3 hours later had my operation, everything went smoothly, no nausea upon waking and home by 4:00. Felt nauseous later on and thru the night but took a sleeping pill so slept well. The pain is manageable, I take tramadol every 4 hours along with antibiotics and stool softeners. I haven't looked at my scar yet, but noticed a lot of bruising around my armpit and top of breast area, and very swollen and tender. I also have a lot of tenderness from my tissue expander, I participated in a Botox study and was hoping that I was in the 50% that would get an injection for the pain, but not sure with the pain I'm having. feels like when I breathe it's very tight. I did have some saline injected right away, but not sure how much. My drain is slowing down, only about 40cc a day so far. Wishing everyone a successful surgery and speedy recovery, Carrie.",
      "MessageIndex": 77,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "Sep 17, 2013 04:48AM Carrie61 wrote: Hi ladies, I had my UMX on sept 3 along with sentinel node dissection. So hugely disappointed that 3 of 4 nodes were cancerous, so back under the knife on sept 25 for an axillary dissection. had a ct scan today, so will be waiting for results of that as well. So guess I need to go back on the sept. Surgery list :( Wishing you all well with your surgeries and recovery! Carrie",
      "MessageIndex": 188,
      "PostDate": "17/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "Jan 2, 2015 12:04AM Carrie61 wrote: MCJnot to scare you but I would have the lump removed, then biopsied. I say this because I had a lump monitored for 10 years, repeatedly told it was a fatty deposit, then when I insisted on a biopsy they found it was grade 3 IDC. My point is after the tumor was punctured 4 times, normal for a biopsy, I had it removed 4 weeks later, letting this punctured aggressive tumour leach into my body. for 4 weeks. Don't make the same mistake I did...and all the best to you...Carrie.",
      "MessageIndex": 5,
      "PostDate": "02/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827285",
      "Title": "Two doctors each different results. mcj mcj"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "Sep 19, 2013 05:33PM Carrie61 wrote: Hi BellaFriday...it has been 16 days since my UMX, left side, and TE put in, also 4 sentinal nodes removed, and I'm feeling pretty pain free right now. I took zoplicone for pain for about 3 days, then switched to Advil. I wore the hospital stretch tube top for about 5 days, then wore a button up sports bra (10$) from Walmart (advice: buy 2-3 sizes larger than normal since you don't want it tight under your scar). My drain came out 5 days after surgery, but I should've kept them in a few days more since the minute it was out I started to feel very sore under my arm and had very painful lumps (seroma) which took a few days to go away, the fluid was causing swelling that was painful. My tissue expander feels very hard and uncomfortable so I have been rubbing Voltaren on every few hours which really takes the tightness away. Also rubbing cocoa butter on my scar to help it heal faster., Hope some of this helps you in some way, wishing you a successful surgery and speedy recovery. Carrie Sleeping is hard since you have to sleep on your back so I would take 1/2 sleeping pill before bed, then second half when I would wake up, which works out very well.",
      "MessageIndex": 214,
      "PostDate": "19/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "Sep 27, 2013 08:48PM Carrie61 wrote: Hi all, I survived my second surgery in 3 weeks. This time it was an easier surgery but still recovery is hard. back to a drain again, and arm movement is limited. now to wait and see how many lymph nodes were taken and how many are positive... About painful tissue expanders, I found Voltaren (muscle relaxant cream) rubbed on my chest really took the tightness and pain away. Hope everyone is recovering well! Carrie.",
      "MessageIndex": 311,
      "PostDate": "27/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "Sep 29, 2013 12:15AM Carrie61 wrote: That is wonderful news Stacie...very happy for you. I'm pretty nervous about my pathology results next thursday, I pray every day for clear nodes. hope you all feel better soon, Carrie.",
      "MessageIndex": 320,
      "PostDate": "29/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "Aug 28, 2013 06:03AM Carrie61 wrote: May I join this group as well? I am scheduled for a UMX with TE on Sept 3, including sentinel node biopsy. I am looking forward to having this tumor removed, but also very worried that it has spread to the nodes. So encouraging to have found others going through this as well. I am also worried about the dye injections before surgery, I have heard this is a very painful procedure :(. I will be glad when it's all behind me... best of luck to all of you! Carrie.",
      "MessageIndex": 22,
      "PostDate": "28/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "Carrie61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186006/profile",
      "Content": "Apr 25, 2015 09:23AM - edited Apr 25, 2015 09:24AM by Carrie61 https://shar.es/1pGqUV This might be a reason... ",
      "MessageIndex": 67,
      "PostDate": "25/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    }
  ]
}