{
  "AuthorID": "CarsonAriesGrl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136245/profile",
  "Posts": [{
    "AuthorID": "CarsonAriesGrl",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136245/profile",
    "Content": "CarsonAriesGrl wrote: Hi, I'm new here and I know this is not the place for introduction ;) but my name is Candice and I'm 28 years old. I was diagnosed with breast cancer about a month or so ago. I have a scheduled bi-lateral mastectomy with reconstruction set for September 28th! I was curious to know if anyone knew what \"stranding\" meant? I am in a whirlwind of pathology reports, MRI reports, reports reports reports and I'm trying my best to understand the lingo (and the pathology tools in these message boards are priceless!) but I came across my MRI report today and it talks about stranding. What the heck is stranding? Apparently, my tumor has a tail...which puts very funny images in my head of an animal growing in my boob....anyways...I tried to do some research but didn't find much info. Here's what the report says: \"At the 4 o clock position anteriorly in the left breast there is a 2.6 x 2.2 x 3.3 cm lobulated mass. Multi-nodular stranding to the nipple present. There is posterior stranding also present creating a tail that extends posteriorly over a length of approx. 2CM with a total length of the mass from tumor to tail posteriorly of approximately 5cm. Medial to the primary tumor in the central inferior retoareolar aspect of the left breast are several nodular enhancing elements, the largest with a length of approximately 16mm. There are also some linear and nodular strand like areas of enhancement in the left breast at the 8 to 9 position. No mass or suspicious enhancement in the right breast. Several nonspecific auxiliary lymph nodes bilaterally more so on the left. Most prominent lymph node left extra region with a short axis dimension of 11mm.\"  If anyone can help decipher, I'd sure appreciate it! :) killerboobsattack.blogspot.com Candice C. - killerboobsattack.blogspot.com Dx 8/8/2011, IDC, 2cm, Stage IV, 7/7 nodes, ER+/PR+, HER2- Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "16/09/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774996",
    "Title": "Stranding? CarsonAriesGrl rjbaby69"
  }]
}