{
  "AuthorID": "casaredonda…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94635/profile",
  "Posts": [{
    "AuthorID": "casaredonda…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94635/profile",
    "Content": "Dec 27, 2009 11:50AM casaredonda wrote: Hello all, I can remember when I saw the tumor on the on the real time ultrasound and realized by it's shape that it was most likely malignant.  This was confirmed by the biopsy and I immediately panicked.  As a former registered nurse, I thought every minutes was my last.  When I saw the little bright spot on my knee after the bone scan, I just knew it was mets, but it wasn't.  Just a little inflammation from an old fall.  Until my mastectomies (I opted for bilateral), I could hardly think, and then right after surgery, I felt cured but because of the type and node involvement, I went on with chemo, radiation and now on Arimidex, just to make sure.  I ordered some CDs of meditation by Dr. Carl Simonton, an oncologist to prepare myself for treatment and see chemo as a strong beneficial medicine and see myself stronger than cancer. After I started Arimidex, I experienced severe shin pain and of course, my first thought was of mets to my bones, and then I went to an Arimidex website and saw posts about how much shins can hurt on Arimidex.  So, it's all normal, the fear, the confused feelings, the need to remember our own strength and courage at all times.  My mother had BC in the early 60s and went through agony with the brutal treatments of the day.  No support groups, one could not even talk about cancer. I'm so grateful to be living now in these modern medical times.  To all of you, I send my support and wish you much courage and patience.",
    "MessageIndex": 24,
    "PostDate": "27/12/2009",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/745862",
    "Title": "Just diadnosed and petrified SPoole Frankie_"
  }]
}