{
  "AuthorID": "caseyblue",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142918/profile",
  "Posts": [
    {
      "AuthorID": "caseyblue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142918/profile",
      "Content": "Jan 12, 2012 10:19AM caseyblue wrote: I posted earlier, but it has disappeared!  I'm sure it was my error. I don't know how to find other doctors.  I know of this one I saw years ago, and found a breast specialty center nearby via Google.  I don't know how/where else to search, or what the options might be.   ",
      "MessageIndex": 8,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780867",
      "Title": "Getting in to see doctor for lump? caseyblue coonie"
    },
    {
      "AuthorID": "caseyblue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142918/profile",
      "Content": "caseyblue wrote: The quick version is that I found a large lump in my breast, and am having a lot of pain in both breasts, and am scared to pieces.  I called the specialty center associated with the hospital nearby.  They cannot see me for two months! In desperation,  I called a doctor who removed a cyst in the same breast several years ago who can see me tomorrow.  The problem is, I did not like this doctor at all.  I looked at online reviews for this doctor, and they are not good. I am struggling with going to see a doctor I don't like or trust, or waiting weeks and weeks.  My inclination is to go tomorrow just to gather information & be referred for testing.  I just don't know what to do, and thought perhaps asking here might give me some clarity.  Thank you so much.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780867",
      "Title": "Getting in to see doctor for lump? caseyblue coonie"
    },
    {
      "AuthorID": "caseyblue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142918/profile",
      "Content": "Jan 11, 2012 06:09PM caseyblue wrote: I guess I have to take comfort in not being the only one.  It is insane to me that it is so difficult to be seen!   The doctor I don't like does not have a partner.  She is condescending and I am not convinced she is nearly as skilled as she believes  herself to be--and this is echoed by others.  The specialty center was sooo disinterested.  I told them I was very frightened, in pain, and could not possibly wait weeks and weeks.  The response was that they are very busy.  I asked about a cancellation list and was told that she could add me, but I would be \"quite a ways down the list\".   Are there any other options I haven't considered??  I don't have an OB/GYN, but perhaps I could get an appointment with  one faster than the specialist, get the mammo/US or whatever that way, and search for a specialist in the interim.   I have not told anyone, and may just go crazy soon.  Thank you all for your answers! ",
      "MessageIndex": 5,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780867",
      "Title": "Getting in to see doctor for lump? caseyblue coonie"
    }
  ]
}