{
  "AuthorID": "Cashasmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260077/profile",
  "Posts": [
    {
      "AuthorID": "Cashasmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260077/profile",
      "Content": "Sep 29, 2017 02:51PM Cashasmom wrote: My diagnosis came as a complete shock to me as well! You think you are doing all the right things and taking care of yourself and then wham! It's so unfair! Who knows why or how this happens? Thinking and stressing about that is not helpful, I know, but it is so hard. I feel great! I feel healthy! The mind can go to dark places, so we must be careful. I've indulged in some good cries, then take some deep breaths and focus on one thing at a time. Today I am having my port placed. I have fixed my hair up nice and put on a cute outfit. I'm going in style! Next week I will get my hair cut and start chemo Oct 5th. Hang in there Longtail. Sending you hugs",
      "MessageIndex": 11,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858876",
      "Title": "Shell Shocked Longtail Longtail"
    },
    {
      "AuthorID": "Cashasmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260077/profile",
      "Content": "Sep 30, 2017 08:19AM Cashasmom wrote: Hi Longtail, it looks like you and I will be on close to the same schedule, I'll be a few days ahead of you. Lucky us! Are you starting with AC? So maddening that we start down this rabbit hole feeling perfectly fine, only to be bombarded by stuff that will make us feel yucky! But we have to keep this at bay, there is so much life left to live! The port procedure really wasn't too bad, the site is sore now that the local has worn off so keeping up with Tylenol/Ibuprofen. I'll let you know how my chemo day goes. Haha I get to be a baldy before you, so there",
      "MessageIndex": 15,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858876",
      "Title": "Shell Shocked Longtail Longtail"
    },
    {
      "AuthorID": "Cashasmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/260077/profile",
      "Content": "Sep 30, 2017 11:46AM - edited Sep 30, 2017 12:40PM by Cashasmom",
      "MessageIndex": 16,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858876",
      "Title": "Shell Shocked Longtail Longtail"
    }
  ]
}