{
  "AuthorID": "cassylou",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217132/profile",
  "Posts": [
    {
      "AuthorID": "cassylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217132/profile",
      "Content": "Oct 5, 2015 02:24AM cassylou wrote: Hi everyone, I was diagnosed with HD as a 19 year old in 1995. I was treated with upper mantle radiation. Fast forward to April 2015 and routine screening found 2 tumours in my left breast. I'm undergoing chemo and I only have 2 weekly taxol treatments to go. I was offered genetic testing for BRCA when I was diagnosed and have since discovered that I possess the mutated BRCA2 gene. I didn't stand a chance really :) I'm scheduled for my BMX and reconstruction and ovary and Fallopian removal next month. I'm glad I've found you guys. I've also sent a request through to join the Facebook group. Cass x",
      "MessageIndex": 273,
      "PostDate": "05/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "cassylou",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217132/profile",
      "Content": "Nov 25, 2015 11:58PM cassylou wrote: hi Ally, I too had HD. Mine was diagnosed and treated with rads in 1995. I was diagnosed with triple negative breast cancer earlier this year. The docs were fairly confident that the cause was my radiation treatment in 1995 but decided to do genetic testing anyway. Surprisingly to us all, it came back BRCA2 positive. Since then my mum and uncle have tested positive and various other family members are being checked. This thread isn't vary active. It might take a little while for someone to activate you in the Facebook group, but once they do, it's very active. If you have any questions for me through, please just ask away.  Cass X",
      "MessageIndex": 275,
      "PostDate": "25/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    }
  ]
}