{
  "AuthorID": "catemarie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70713/profile",
  "Posts": [
    {
      "AuthorID": "catemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70713/profile",
      "Content": "Aug 22, 2008 07:14AM catemarie wrote: Thank you, thank you to all of you wonderful women who are sharing your wisdom, experience and hearts!  This is a great place to learn and gain support in many ways. I have been away a few days.  Had imaging and met with my surgeon.  The chemo did more than any of my Drs expected!  This is such great news, because I have IBC and my tumor area was so large. It will be so possible to get clear margins after surgery. My surgeon was great with the bilatteral discussion.  All the points he made were ones I had covered, and we were in agreement with them all.  Now, we're just waiting for final insurance approval.  I'm scheduled for next Wednesday, the 27th.  He did say I can change my decision any time up to the day before. As could be expected, after I thought I felt settled with my decision to have both removed, and had positive support from my OC and surgeon, it totally \"flipped\" for me that night and for the next few days.  I started re-thinking everything, then realized that the main reason to keep \"the good one\" was for my husband.  After a lot of talk and soul-searching, (we've had 30 years of practice),  it became clear that I am so much more important to him than any breast.  It has actually even brought yet another deepening level to our relationship.  So - a weekend of preparing the house, garden and my clothes, enjoying family and friends.  Blessings to you all!",
      "MessageIndex": 27,
      "PostDate": "22/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719436",
      "Title": "Need to decide one breast or two? catemarie catemarie"
    },
    {
      "AuthorID": "catemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70713/profile",
      "Content": "Aug 13, 2008 10:26AM catemarie wrote: Thank you all so much!  I really appreciate your honesty and care.  A few things that also add to my decision is because I have Inflammatory BC, I don't have a choice of a lumpectomy.  Chemo first, surgery, radiation, tamaxofin - life!   Also, if I would choose reconstruction, I would have to wait at least  a year.  At this point I feel pretty certain I don't want reconstruction and the surgeries that would come with that. I'm not wimpy - have had five babies (nursed them all) and three other surgeries, but I don't really want to fill my time with elected surgeries.  Saying all that, it seems like I'm saying I don't really want my good breast.  There's nothing wrong with it, it plays a good part in wonderful times with my husband.....whew, here's the time of going back and forth.  You're right wishiwere, I could go up to the last minute, but I would love to have decided much ahead of time. There's also a good chance this could go to my brain b/c of node involvement in my collarbone and neck - but I'm not going to have my brain removed!  Although I think a little is missing after chemo! :) Thank you all so much, and I wish you the best of health.",
      "MessageIndex": 4,
      "PostDate": "13/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719436",
      "Title": "Need to decide one breast or two? catemarie catemarie"
    },
    {
      "AuthorID": "catemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70713/profile",
      "Content": "catemarie wrote: I was diagnosed with Inflammatory BC on3/13/08.  Started chemo two weeks later, and finished this past Thursday.  Yea!  I have to have a mastectomy of the involved left breast, and need to decide about keeping or removing the right.  I understand it will be a personal decision, and there is no one correct answer, but I would love some input. Briefly, my thoughts include:  Do I want to chance another surgery with a high chance of recurrence?  If my time is shortened, do I want it to include more surgery?  I think it would be easier to look and feel \"balanced\" if I have prothesis on both sides.  I'll miss them, but things have changed anyway.  Obviously I'm leaning toward a bilatteral, but would appreciate input from \"both sides\". :) Catemarie Dx 3/13/2008, IBC, 6cm+, Stage IV, Grade 2, 9/14 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719436",
      "Title": "Need to decide one breast or two? catemarie catemarie"
    },
    {
      "AuthorID": "catemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70713/profile",
      "Content": "Aug 14, 2008 03:24AM catemarie wrote: Thanks Lorena.  You post is a perfect example of why it's important to make this decision yourself, knowing so many factors go into it.  Your defining moment about not losing another part of your body that might be perfectly healthy helped you see clearly how to move forward. The closest I've come is based on the advancement and type of my BC, if my time here is shortened, I don't want to fill it with surgery, or checking my breast all the time for \"signs\".  My skin involvement is so close to the other breast....my tumor area was 8-10 cm.  Really my whole \"C\" cup breast. Well, you're all helping me by just getting things out. Thanks!",
      "MessageIndex": 7,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719436",
      "Title": "Need to decide one breast or two? catemarie catemarie"
    },
    {
      "AuthorID": "catemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70713/profile",
      "Content": "Aug 30, 2008 06:43PM catemarie wrote: I'm back and breastless!  I did have my bilateral on Wednesday afternoon around 4:00.  Yes, I was scheduled as an \"add on\" which apparently happens often and isn't usually a problem.  Surgerys cancel for various reasons regularly, then the add on's scheduled go in.  The problem for my scheduled day is that no surgery had canceled, so there was no extra time or surgical team for me. After my husband put in a call for help to the hospital's Patient Advocate Department, we got a call from the director to get my story.  They were horrified and agreed this should never be, and especially with me having my breasts removed.  You don't put that on a \"waiting list\".  Everyone at the hospital was wonderful to talk with, and they do see it as a systemic problem that needs addressed.  What happened to me is rare, but it does happen and it shouldn't! We went on in, still thinking we may have to \"wait and see\".  Instead, they were waiting for me!!  They met me at the desk. walked me through admitting, and took me directly to pre-surgery.  They all knew my name!  I was prepped and ready less than an hour after I got to the hospital.  My surgeon met with me, and agreed this should never happen.  I went comfortably into surgery and was out by 7:30, then into a quiet comfortable room by 10:20.  I had great care and came home yesterday afternoon. My pain is tolerable, most of it being in the left side where all the nodes were removed.  There is some pressure, short stinging pains, and some incision pain if I bend over - but it is all tolerable.  My DH and DD are great helpers and are there for everything.  I took a bath, leaving on my camisole with drain pockets just rolled up, and didn't get my drain incisions wet.  It felt great! Lesson learned - it never hurts to be kindly assertive and firm when the need arises.  Thank the Lord for my husband and a hospital who admits a need for change, and gave excellent care.  I have a website...www.carepages.com   Name of page is CatesCare if you're interested.  Many of you might like this website created to give updates and communicate with people.  It's free. Jane - re: reconstruction..I have to wait at least a year anyway because I have IBC.  Next is 6 wks of radiation.  I have thought I probably will not, but the surgeon left a small flap at the bottom of my breast in case I choose to, so there will be a \"base\" to work with.  Prayers continue for all.",
      "MessageIndex": 49,
      "PostDate": "30/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719640",
      "Title": "AUGUST/SEPT SURGERIES?? harmonysun museumlover"
    },
    {
      "AuthorID": "catemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70713/profile",
      "Content": "Sep 2, 2008 04:14PM catemarie wrote: It just really hit me today as I was reading about all your stories - how many women are going through this...right now.  I have and will again pray for all of you. Wink, I also have lots of sensations along with some pain.  I am very numb and swollen under my arms and at the areas where my drains exit.  There are many \"electric\" type pains and some deeper ones if I bend over or give pressure.  Nothing horrible, just drags on. Sometimes I have an itch, but can't find it!!  Wierd.  Night time is difficult still.  I resorted to taking a pain pill.  I sleep on my back in bed with pillows under my arms for about four hours, then come out to the recliner.  I'm always glad for morning. Jane, so sorry about your infection.  I hope your care will help you get on top of that soon.  I can see how it could happen with these drains. I have finished 5 months of chemo, so washing my hair is not an issue!  I use a cloth and shampoo as it's about 1/2 inch long.  It also came in all white! Today I'm struggling a bit mentally and emotionally.  Going a little stir crazy at home, and tired of being tired and hurting.  I think we all will have these times, I'm just looking forward to them being over!  By the way...SILKY PJ'S WERE GREAT even in the hospital just to put the bottoms on.  It helps you slide and move easier.  I also put on a silky top and a pretty bedjacket that could be opened easily for them to check everything.  I wouldn't have done this for a one day thing, but good for an overnight or more.  Slip on slippers were also helpful.  Other than that, I didn't need to take anything.   Love and care to you all.",
      "MessageIndex": 56,
      "PostDate": "02/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719640",
      "Title": "AUGUST/SEPT SURGERIES?? harmonysun museumlover"
    },
    {
      "AuthorID": "catemarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70713/profile",
      "Content": "Aug 27, 2008 09:57AM catemarie wrote: I'm scheduled for a bilatteral with no reconstruction today.  I have Inflammitory in my left breast and nodes under my arm and in my neck.  I'm choosing to have the right taken also.  Here's the wierd thing - as if it's not ALL wierd.  I'm on some type of \"add on\" for surgery at the hospital.  So today, I have to check in, then wait.  Maybe they will be able to take me at 3:00.  If not, I will have to come home, and maybe come back Friday, or get on the list again for next week.  Does somethiing sound wrong with this picture? What we think is going on, is that the \"scheduling people\" are only doing just that, and that my OC and Surgeon don't even know.  So we've made some phone calls, and are now waiting on return calls.  My husband is trying to get through to someone who can make something happen.  He's very kind but firm.  So, I'm trying to manage my hunger, headache from no coffee this morning, and the chance that I may or may not have my breasts off today.  As if what we're going through isn't enough...",
      "MessageIndex": 40,
      "PostDate": "27/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719640",
      "Title": "AUGUST/SEPT SURGERIES?? harmonysun museumlover"
    }
  ]
}