{
  "AuthorID": "Catherinemk…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/259278/profile",
  "Posts": [
    {
      "AuthorID": "Catherinemk…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/259278/profile",
      "Content": "Oct 30, 2018 05:18AM Catherinemk wrote: I had u/s guided biopsy last Thursday, I received a call first thing this morning (Monday) and was told that the surgeon would like to talk to me about my results tomorrow (Tuesday). All this in 5 days.. I am nervous about this because last year I had 2 biopsies done and it took 2 weeks to get a call about the results which were benign. And I am using the same surgeon I had last year. This wouldn't mean anything, right? That I'm reading too much into ths",
      "MessageIndex": 11,
      "PostDate": "30/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/693997",
      "Title": "Long wait for results-is that bad? hopefor30 Catherinemk"
    },
    {
      "AuthorID": "Catherinemk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/259278/profile",
      "Content": "Catherinemk wrote: Hi all! Ive been snooping around here till I finally decided to create an account. I applaud you all for sharing your stories, knowledge, and support to those who are uncertain. I want to my dr for a bloody discharge issue from my right breast and as a result the dr sent me for a mammogram. All in the same day, I had my base mammo, then additional images due to abnormalities found, and then an ultrasound. I was stunned to learn that there was something suspicious in my left breast as i thought my right breast was my problem child. I have to have biopsies on both breasts. Has anyone gone through this? And, can any of you help me with the readings of my ultrasound report? For the right- ultrasound demonstrates significantly abnormal dilated duct projecting into the subareolar right breast from the nipple at 6 o'clock measuring up to 6mm and within this dilated duct there is debris and more distally within the dilated duct, there is either impacted debris but more likely a 10x4mm intraluminal soft tissue mass. This could represent intraductal papilloma or malignancy. Needs further evaluation. What could the debris be? Within the left breast in atea of symmetry upper outer there is a 8x4x9 mm solid ovoid mass not completely circumscribed with no shadowing. It is approximately 6cm from the nipple and would correlate with density seen mammographically. Is no shadowing a good thing? And what does it mean exactly when it said \"would correlate with density seem mammographically? Also, when asked about my symptoms, i only focused on my right and reported nothing for my left. That was noted on the report. If i had mentioned the swelling and itching symptoms to the tech, would that have made a difference on the radiologist's findings? Thank you all Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858530",
      "Title": "Disc abnorm in both breasts&hlp w/ report Catherinemk djmammo"
    },
    {
      "AuthorID": "Catherinemk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/259278/profile",
      "Content": "Catherinemk wrote: Hello all! I have a quick question. 3 days ago I had an excisional biopsy done. As usual, I had to have a wire localization done. Last year I had an excisional biopsy done with a ultrasound guided wire localization which was easy peasy. This year - they said they needed to do a mammo guided write localization which was unsuccessful because of the extreme pain I endured while being compressed. It was so bad that I was crying and begging for it to stop. Fortunately, the radiologist said to stop and do the ultrasound guided wire localization. I was so thankful. The ultrasound guide was easy peasy again. My question is this - why would a mammo compression be extremely painful while laying down on your side? Standing mammos are fine. Can anyone shed light on this? Thank you Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868161",
      "Title": "Painful Mammo Wire Localization Catherinemk CasM"
    },
    {
      "AuthorID": "Catherinemk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/259278/profile",
      "Content": "Catherinemk wrote: hello all. I'm being scheduled for biopsies to be done on both of my breasts. On one of my breast I have a suspicious looking mole. You can't see it unless you lift my boob up but it's on my breast. Can this cause breast cancer? My consultation with my bs is not till Wednesday so I haven't been able to show it to her yet. This mole has been worrying me for a long time cuz it itches & bleeds. Thanks in advance!! Cathy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858559",
      "Title": "Mole on breast Catherinemk Catherinemk"
    },
    {
      "AuthorID": "Catherinemk…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/259278/profile",
      "Content": "Sep 11, 2017 06:04AM Catherinemk wrote: I guess I should have explained my circumstances better. 😊 I went to the dr for complaint of bloody discharge from right breast. I was sent for a mammogram.. they ended up doing an ultra sound and found (I can't remember the exact wording. Lol) something in the duct in my right breast. Then surprisingly, they found a mass in my left breast. I only went in for my right breast and didn't report any symptoms that I've been having on my left (because I was so worried about my right). After hearing about the mass on my left side, I started realizing that I do have symptoms and thought nothing else. My left is swollen or sightly bigger than my right, itches like hell, redness around nipple, and that mole I was inquiring about. I'm just a mess and confused about all this as I was not expecting this.  Thanks.",
      "MessageIndex": 3,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/858559",
      "Title": "Mole on breast Catherinemk Catherinemk"
    },
    {
      "AuthorID": "Catherinemk…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/259278/profile",
      "Content": "Nov 5, 2018 09:21PM Catherinemk wrote: There is absolutely no need to be tortured like that. Sedation or numbing agent are available to prevent things like this from happening. 😑 Thanks for the agreement! 😊",
      "MessageIndex": 6,
      "PostDate": "05/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868161",
      "Title": "Painful Mammo Wire Localization Catherinemk CasM"
    },
    {
      "AuthorID": "Catherinemk…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/259278/profile",
      "Content": "Nov 5, 2018 11:55AM Catherinemk wrote: Maybe that could be it. It was just painful and it was bothering me in my head as to why. 😊 I'll just be grateful that the radiologist stopped it quickly and did the ultrasound. I do know that I will object to having any mammo guided anything again. The diagnostic mammo I will do but not the guided one. The pain was comparable (well almost) to giving birth  Thank you for responding. 😀",
      "MessageIndex": 2,
      "PostDate": "05/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868161",
      "Title": "Painful Mammo Wire Localization Catherinemk CasM"
    },
    {
      "AuthorID": "Catherinemk…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/259278/profile",
      "Content": "Nov 5, 2018 09:18PM Catherinemk wrote: That is awful! Something needs to be done about that. I was lucky that my radiologist came in and saw me crying in pain and immediately stopped it. I'm wondering, since my lump being palpable would have anything to do with it since you mentioned that yours was not palpable.  Thank you for sharing your experience. 😊",
      "MessageIndex": 5,
      "PostDate": "05/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868161",
      "Title": "Painful Mammo Wire Localization Catherinemk CasM"
    }
  ]
}