{
  "AuthorID": "Cath57",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
  "Posts": [
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Dec 15, 2014 05:17PM Cath57 wrote: well, ok then.... Just waiting to hear about my rad plan after having my sim a week ago. I feel like such a whimp as I read through many of your comments & see that most of you have had chemo & are such troopers as you're venturing into the next stage of your journey. I did not have to have chemo... My Oncotype was 10. I had a lumpectomy with a second recision to get clear margins. I' m taking Arimidex with very few side effects so far. I should feel ever so greatful that I haven't had to go through chemo yet I started crying while they were doing the sim. I really don't want to do radiation & have been vacillating between opting out & doing alternative methods, but after looking at all the numbers, I feel that I need to do this. I think the reality of this whole year has finally hit me face on . I was dx in March of this year , & finally had my 2nd surgery in Oct. (long story) . I am ready to be done with this & am grateful for this community to vent to. Blessings to you all!",
      "MessageIndex": 406,
      "PostDate": "15/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Dec 19, 2014 06:35PM Cath57 wrote: hey Ladies, I just got my start date..Dec 29th. I just want to thank everyone so far that has shared info ie: lotions , bras,, the bolus thing( never heard of that one before), & tons of encouragement. I even discovered that I'm not the only one who has had a crying jag on the table for my Sim. I'm looking forward to updates & cheering you all along in this journey. Merry Christmas to all!",
      "MessageIndex": 476,
      "PostDate": "19/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Dec 28, 2014 08:34PM - edited Dec 28, 2014 08:34PM by Cath57",
      "MessageIndex": 576,
      "PostDate": "28/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Dec 31, 2014 05:22AM Cath57 wrote: meanmomto3, I was just getting ready to post when I read your post..... I haven't started rads yet ... Was supposed to on the 29th but still had some unanswered questions. I have been vasilating between not doing rads due to all my good numbers, ie Oncotype 10 , node neg , stage 1 , grade 1 Er Pr+... So many side effects that I really never knew about until I really started to delve in. I asked why I didn't have the opportunity to have Brachyo ( so) therapy. They said it's because you didn't ask. Here, I went for a 2nd opinion when first diagnosed because I was first going Togo with a mx, double mind you, but the 2nd opinion led me to the lumpectomy option., which would allow mme to keep my own breast. I feel that I should've read more at the time about rad side effects ; short term & long term because now I wonder if it's going to be my breast at all by the time I'm done. I did meet w/ my RO yesterday & she assured me that I would do well. She answered all of my questions so I go to scheduling & set my first Rad up for Jan 5. She comes in the room & tells me she forgot to mention one thing to me... She's leaving the practice & today would be her last day. I really liked her, had confidence in her & she's not even going to be my RO. She reassured me that she had my plan set & was conversing with the new Dr. On my treatment plan as well as the therapists. One thing she told me is that I needed to stand up for myself when I didn't feel comfortable with things..... Hmmm, this is all I have to say about that!L",
      "MessageIndex": 613,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 1, 2015 04:57PM Cath57 wrote: thank you Beachlady28 for the tips... You finish up when I start! Hmmmmmm, about the SE for rads... I think that I mentioned my meeting with my RO about the many unanswered questions that I had. All of my questions involved SE. She proceeded to answer all my questions & said \" you'll do fine\" .... We'll see . After reading so much info on rad SE , it doesn't seem so \"fine\".",
      "MessageIndex": 647,
      "PostDate": "01/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 1, 2015 07:53PM Cath57 wrote: Nomatterwhat, what is \" clean up \" surgery?",
      "MessageIndex": 650,
      "PostDate": "01/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 9, 2015 10:24PM - edited Jan 10, 2015 07:12AM by Cath57 My first week of rads done! I only cried the first day! So far so good! CoyoteNV , I am a muralist /faux finisher.(as soon as I figure out how to post pics here, I'll share :) . I can't figure out how to change the photo settings. Anyway , here is my FB pg that shows some of my work in various albums www.facebook.com/ImagineThisDe... Right now I've been working on a home for 5 mos. My RO said he wanted me to not use my right arm so I'm working hard to get this last portion done : kitchen Island & built in china cabinet. We just finished a master bath in Venetian Plaster which is a workout. I am looking forward to taking some time off soon & actually rest !. I just think that is horrible how your supervisor is treating you dacre! Stand strong! Congrats No Matterwhat!! I can't imagine being at that point but I know I will one day at a time! zjrosenthal , thank you for your words of encouragement!",
      "MessageIndex": 841,
      "PostDate": "09/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 11, 2015 08:56AM Cath57 wrote: CoyoteNV my RO prescribed this cream to help with itching . She just started prescribing it to rad patients & they said it has been helpful...Mometesone Furoate Cream USP, 0.1% .",
      "MessageIndex": 869,
      "PostDate": "11/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 16, 2015 07:46AM Cath57 wrote: Everyone tells me that I have a positive attitude... I just vent & complain here :). Every once in awhile I need an attitude adjustment & have to regroup with an attitude of gratitude. I guess we never know what's going to take us from this earth. One thing I have realized that since my BC diagnosis, no one is exempt from it. I felt like I fit all the criteria that would eliminate BC in my life & lived in the bubble of \"it will never happen to me\". I now apply it to other areas of my life & am trying to live in the moment , cuz you never know what is around the corner. I realize also that I am a high anxiety/stress type of person & am working on that.... One day at a time",
      "MessageIndex": 979,
      "PostDate": "16/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 20, 2015 06:42PM Cath57 wrote: 13 rads down , 20 more to go . So far so good...getting used to the routine and not getting used to my long days., 40 min to cancer center , 45 min to my job , then 45 min home after work. Wash, rinse , repeat. No SE except yesterday I hit the wall with fatigue. I told the contractor on the home that I'm doing decorative painting in\" I'm outta here ... I just need to go home & take a nap\" . They are all very understanding & it helps to be my own boss & take care of ME for a change & listen to my body. I have about 4 days left at the most on that job & no more commitments for awhile so I'm looking forward to reading a book! I'm using an aloe Vera lotion & it seems to be doing the trick.",
      "MessageIndex": 1047,
      "PostDate": "20/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Dec 21, 2014 05:34PM Cath57 wrote: I have implants & am wondering the same thing SCMom. I start on the 29th & am very nervous about it in regards to my implants. My lumpectomy surgery cause a lot of internal scarring , which could most likely be exasperated from the rads. There is a thread in the Radiation section where implants are mentioned.",
      "MessageIndex": 490,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 8, 2015 06:07PM Cath57 wrote: Saltygirl, I know exactly what you're feeling ! I was on again off again for weeks.i went to my Sim, scheduled my first rad & the day I was supposed to start, called & said I wasn't comfortable with starting until I had some questions answered.Mind you, I had researched so much ( to my detriment) & I was certain that I would deal with every side effect known. I met with my RO & she spent her whole lunch hr answering all my questions . I was settled, I would go through it. It is my 4th day out of 33 . So far, so good! I only cried once on the table... I know I'm a whimp, especially that I didn't have to go through chemo as many of you have, but I also know that I can do this one day at a time. I suppose that I came to the conclusion that I don't want to deal with this again. Beach lady, congrats on completing this part of your journey & what a wonderful , supportive hubby you have! CoyoteNv, love your work! I also make my living doing my art. All of you are so encouraging & I'm grateful for this group!",
      "MessageIndex": 816,
      "PostDate": "08/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 1, 2015 10:37AM Cath57 wrote: Thank You WndrWoman & CoyoteNV for words of encouragement, & Beachlady28, I thought I was a wimp when I cried on the Sim appt .... I know I'm not the ony one that has meltdowns :). eileenpg , how frustrating for you, but you're getting closer! Blessings to you all in 2015!",
      "MessageIndex": 639,
      "PostDate": "01/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 3, 2015 09:02PM Cath57 wrote: CoyoteNV... I was supposed to start on Dec 29th but now it is Jan 5th.... Nervous, but am armed with Aquafor, calendula, aloe Vera gel, camisoles, cornstarch , makeup brush... Am I missing anything",
      "MessageIndex": 697,
      "PostDate": "03/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Dec 15, 2014 07:22PM Cath57 wrote: yes, Pita119, I was just discussing that with my son.... We are not alone! I hope you are doing well on this leg of your journey! Keep us posted! I've only been on Arimidex for 2 weeks.. So far, so good except that I dealt with insomnia which is a side effect, so started taking it in the AM. I've had a little joint pain , but manageable. So far no hot flashes! ",
      "MessageIndex": 409,
      "PostDate": "15/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Dec 28, 2014 08:28PM Cath57 wrote: Good luck tomorrow kpmacmil Poppyk Jlynn13 gretchy on starting your rads, I'm right there with you, nervous about SE , especially the long term ones..... Sigh , but we can do this!",
      "MessageIndex": 575,
      "PostDate": "28/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Dec 29, 2014 05:31PM Cath57 wrote: Lulubelle1 , hmmmmm, well there's a new question to ask my RO. I've never heard of a mammo done before rads. I was supposed to start today but felt that I needed some more questions answered so will be meeting with my RO tomorrow.",
      "MessageIndex": 592,
      "PostDate": "29/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 2, 2015 05:27PM Cath57 wrote: thank you Nomatterwhat, for the tip! I'm just going to get into my paint clothes & go to work from there! I'm a decorative painter/muralist so my clothes are always a mess",
      "MessageIndex": 664,
      "PostDate": "02/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 10, 2015 07:15PM Cath57 wrote: thank you CarynBrit& CoyoteNV! CongratsYikes on one more step forward! LilicTulip, I was concerned about!missing rads in case of inclement weather , meaning ice storms here in Mo. My RO said it wasn't much of a concern skipping a week of rads as long as you get your full treatments completed.They didn't want me to \"slide\" into the cancer center risking my life due to snow & ice. Caryn, please vent on girl! You need as much support as you can receive & we are all here for you! I know that I told my husband that I'm glad I can vent here because sometimes he just doesn't understand all the emotions that I deal with & gets weary of my rumblings. MagicalBean, yes I agree that it's hard to keep track of everyone & want to respond to everyone but forget who's who :) . I wish this sight was more like FB where we could click \" like\" on everyone's comments. Everyone have a great Sunday . I hope to sleep in in ( ha) Arimidex has not been kind to me with insomnia SE!",
      "MessageIndex": 860,
      "PostDate": "10/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 11, 2015 10:56AM Cath57 wrote: yikes1 haha! Breast cancer 101 ... So true . I have learned so many things \" after the fact\" argh!!!",
      "MessageIndex": 872,
      "PostDate": "11/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Feb 4, 2015 06:28PM Cath57 wrote: I haven't been up on everyone's rad journey since I started , 23 days ago. Plugging through ...next week I will start my boosts . My skin has being doing really well! My daughter got me some Aloe gel called \"Herbal Aloe Force\" by The Herbal Amswer. It contains Essiac Herbs:Sheep Sorrell, Burdock Root, Slippery Elm Batk, Rhubarb Root, Cats Claw chamomile , Hawthorn Berry, Pau D arco , Green Tea. I've never heard of some of these things but I have to tell you, my breast has minimal redness & a slight rash.The rad techs are amazed at how good I'm doing! I'm grateful because I am dealing with fatigue & I am coughing a lot. The nurse asks me every week if I'm coughing & every week I tell her \"yes\". My RO seems kinda noncommittal. Well, only 10 more days... I will be glad when it's done!",
      "MessageIndex": 1402,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Dec 24, 2014 09:35AM Cath57 wrote: Here I am on Christmas Eve day gathering research about rads . I start my treatment on the 29th of Dec. My RO won't be in until my first day of treatment & I still have some unanswered questions. When I talked to her nurse, I could feel her eyes rolling . I told her, \" sorry, I'm one of those that questions everything , & am a how come / why person & am proactive in my medical care.\". She said that I could go in early to talk to her. A few days ago I came across a post on FB, \"Live Strong\" a non- profit organization that was instituted by Lance Armstrong. They referred me to NavigateCancer, & an oncologist Nurse Practitioner called me & spent 45 min talking & listening to my concerns. She could not advise but she could give me questions to ask my MO. She didn't roll her eyes but was impressed with my knowledge of my cancer & my proactive approach . She wished everyone else was proactive. At any rate, after talking to her , I didn't feel like an obsessive lunatic ! I'm sharing this here because I feel that it's a safe place. Now that I \"vented\", I'm going to lay this aside , pick it up next Mon & enjoy the day in preparation for our family Christmas festivities.... Time to make pumpkin bread & brunch casserole! Merry Christmas to all of you ladies who are on this journey! Hugs!",
      "MessageIndex": 524,
      "PostDate": "24/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Dec 31, 2014 12:32PM Cath57 wrote: SandyLivesLucy- thank you for sharing your experience. What I have discovered is that there is always going to be some uncertainty with any choices we make regarding our Tx. We just have to go what feels right to us.The Serenity Prayer is a good one! It seems you are doing well with only 8 more to go! Yay! MagicalBean, I think it's really good that once you made your decision to not look back! Words of wisdom! CoyoteNV, you are so right when you say\"We can second guess ourselves to the point that we go a bit crazy.\" I guess that's why I am just learning to let go! I have so much info in my brain that it's becoming confusing. I think LMVerna states it clearly \"There are no easy options\". I'm just very greatful for this group! Happy New Year all!",
      "MessageIndex": 618,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 12, 2015 06:31PM Cath57 wrote: joining in, screaming loud! What a b&@#h!",
      "MessageIndex": 914,
      "PostDate": "12/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Cath57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200891/profile",
      "Content": "Jan 15, 2015 05:10AM Cath57 wrote:",
      "MessageIndex": 958,
      "PostDate": "15/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    }
  ]
}