{
  "AuthorID": "CathyaMom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68813/profile",
  "Posts": [
    {
      "AuthorID": "CathyaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68813/profile",
      "Content": "Jun 29, 2008 09:38PM CathyaMom wrote: NEVER WAIT! Even if something turns out benign..celebrate your awareness and concern for your body and health. Get it checked. TELL them about your fixed lump. Is there any pain? Discharge? Tell them everything. Please, keep us up to date.",
      "MessageIndex": 1,
      "PostDate": "29/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708292",
      "Title": "Found a lump...what should I do? SleepyDreams143 charmed-imsure"
    },
    {
      "AuthorID": "CathyaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68813/profile",
      "Content": "CathyaMom wrote: Hi, all...I am a newbie here. I am 45 with 4 children ages 7-18. I have no BC in my family (I know 75% of cases don't...). I fist felt a small lump when I was 30. It went to \"clear\" to solid in about 5 yrs. I had it removed. Benign. Four yrs ago, some colored, manipulated, discharge. No big deal. ..So they said. Then, about 19 months ago I had bloody, spontaneous discharge from my R. breast. had a mammo, an U?S, 2 failed ductographies, (couldn't get it to show up, DR said,), and an MRI. (They did TWO MRIs, because the tech didn't do the first one right! GRRR...) They said I have ductal estasia...\"probably\". I have that weird thing where lots of little cysts light up like sparkles on an MRI. (They didn't explain these very well to me.) I have tons of cysts. So many that if removed I would drop a full cup size or more. NOW...I am 7 mons late for my mammo. (Stupid, I know.) I have a weird, non round, irregular \"mass\" on what seems to be the chest wall of my left breast. It is not painful and I can't tell if it moves really. My husband even felt it. It is in the top center quadrant. I go for a diagnostic mammo and U/S on Wednesday...After yrs of telling me, \"cyst, cyst, cyst\", now for some reason, I feel uneasy. (Maybe because all of the previous lumps were kind of painful when manipulated and this one is not.) Thank you for letting me express my concerns...Anything sound familar?? CATHY Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708192",
      "Title": "Yet again...?? CathyaMom CathyaMom"
    },
    {
      "AuthorID": "CathyaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68813/profile",
      "Content": "Jun 27, 2008 05:31PM CathyaMom wrote: ALSO...I have an occasional \"burning\" painlike sensation deep inside, around the area of the lump. Weird sensation... CATHY",
      "MessageIndex": 1,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708192",
      "Title": "Yet again...?? CathyaMom CathyaMom"
    },
    {
      "AuthorID": "CathyaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68813/profile",
      "Content": "Jul 2, 2008 09:14AM CathyaMom wrote: Hi, Julee...yes, I went to a breast care center here...still left confused.",
      "MessageIndex": 6,
      "PostDate": "02/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708192",
      "Title": "Yet again...?? CathyaMom CathyaMom"
    },
    {
      "AuthorID": "CathyaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68813/profile",
      "Content": "Jun 30, 2008 04:42PM CathyaMom wrote: Thank you for the comments. Julee, I will insist on a biopsy. The Drs tend to want to tell me, \"It's nothing...let's just watch it.\" (The discharge and fibroids.)  Well, while I wonder if and when it will \"grow\" or change, they are out on the golf course or at Disney World. The ones that I have had just don't seem to be concerned about things. This, though, is different. I have painless \"mass\" like thing. I can't explain it. It's closer to my chest wall that the surface. Also, the one that did the MRIs said I have these little tiny dots that \"light up\". What is that?? I could never get a real answer. They just kind of blew me off.",
      "MessageIndex": 4,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708192",
      "Title": "Yet again...?? CathyaMom CathyaMom"
    },
    {
      "AuthorID": "CathyaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68813/profile",
      "Content": "Jun 28, 2008 06:30PM CathyaMom wrote: Shirlann..if there is ANYONE here that can inspire encouragement, it is YOU! God Bless your friendship here...:*) CATHY",
      "MessageIndex": 25,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707947",
      "Title": "Didn't have it in me Estepp CathyaMom"
    },
    {
      "AuthorID": "CathyaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68813/profile",
      "Content": "Jun 28, 2008 06:28PM CathyaMom wrote: Estepp...My nurse won't tell me ANYTHING on the phone. Don't be concerned yet. I KNOW it is hard not to be. I have had so many tests. (NEG for BC). I found a new lump and some aching recurring pain in the same armpit and go for a diagnostic mammo and U/S on Wed morning..I will keep you in my prayers! CATHY",
      "MessageIndex": 23,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707947",
      "Title": "Didn't have it in me Estepp CathyaMom"
    },
    {
      "AuthorID": "CathyaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68813/profile",
      "Content": "Jun 27, 2008 10:12PM CathyaMom wrote: Please, keep us posted! Big Hugs!! I go for mine on WED. morning. CATHY",
      "MessageIndex": 4,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708130",
      "Title": "I'm 22, w/ small, may have found lump, am scared! mommy0607 mommy0607"
    },
    {
      "AuthorID": "CathyaMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68813/profile",
      "Content": "Jun 27, 2008 10:48PM - edited Jun 27, 2008 10:49PM by CathyaMom Yes. A friend of mine (actually the g'ma of my daughter's friend.) was dx with a very aggressive form of Alzheimers, then 7 months later, throat cancer. Also, a man at church was DX the same way, only his was already metastatic. The grandma was in great spirits. I think the ALZ \"softened\" the blow for her. The man at church was ALWAYS cheery. He was at church eating a hucrh dinner, smiling the whole time, a week before he died of the cancer! Maybe sad, but the week he fell ill with the end stages of cancer, he wondered why he felt so bad. (He didn't remember being terminally ill.)  In BOTH cases...the people were active until the WEEK before they died! ALZ, I believe was the reason for that. God Bless...I am sorry for the DX.... CATHY",
      "MessageIndex": 11,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/706452",
      "Title": "Alzhiemer's and breast cancer cgraham cgraham"
    }
  ]
}