{
  "AuthorID": "CathyB",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102488/profile",
  "Posts": [
    {
      "AuthorID": "CathyB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102488/profile",
      "Content": "May 24, 2010 02:32AM - edited May 24, 2010 02:46AM by CathyB Busting everyone's bubble on the forum, Sepahunt22 is correct. Komen in Palm Beach County is at best an imitation of helping women while collecting millions in donations. It was started in I think 1993 by five local hospitals, who we believe now, had knowledge the Pratt and Whitney facility had contaminated the county resulting in multiple forms of cancer. The first documented report came out in 1988 and was hidden by the Federal, State and Local Health Districts. The contamination could only result in higher rates of cancer, particularly breast cancer. This lead to the hospitals franchising the name of Komen in return for 25% of the profits the local Komen made off fund raising. Those are not ideas-those are facts on records. The five hospitals in turn, garnish the greatest amount of 'grants' from the fund raising efforts. Komen in our State, went from grants to diagnosing women to utilizing donations for state programs without the knowledge of the donators, in supporting tax based programs with donated money. Meaning, not only do the tax payers fork out dollars, now the public's donations for women are supporting State run programs as well. I have met with  Holmes the director. We sincerely met when she sent out a local run mental health facility to threaten me should I expose any more. I gained that just prior to her fund raising of that year, and in the medical records we demanded, it was listed she sent them because \"she feared I would interfere with her fund raising efforts.\"  I of course continued my research into our breast cancer politics and succeeded in making them all upset and got more visits with such insinuations and threats. Some of my work has been published on TV, others have used it in different parts of the US.  Bethesda, which is spoken of, gains the most grants and its director of the Breast Program, out of that facility was once almost arrested for threatening a Top specialist in a trial where she misdiagnosed a client who has since died. That radiologists sit on the board of our local ACS as well as others who have similar pasts. In Florida, the program is used to disqualify women out of the National Breast and Cervical Screening program, in which women who are 52 and older MUST be seen at a CDC center and diagnosed out of that facility in order to gain the rights to Medicaid for treatment of breast cancer.  When the funds for Komen are used and they are sent elsewhere they are automatically disqualified out of the program without their knowledge. ACS has become the arm of the State Department of Health, and run the Breast and Cervical Center referral program out of the State. They also are long dependent on donations from Pratt and Whitney. They in turn, having this much connection to High Economy Industry, rule the health care in Florida. They are also associated with the Sugar Industry which is known to be contaminating the Everglades and Lake Okeechobee which flows down the southern part of Florida into the Everglades.  And, by coincidences have been linked to high rates of breast cancer, brain cancer, and thyroid cancers in our State and particularly the southern region of Florida. It benefits the Industries to support the Komen and ACS donation process, it also benefits the state health care system.  What troubles me most, is the great support for Komen who are to process diagnosis, but seldom follow through on treatments for women who are then diagnosed. What happens to them? They are sent home to die in our County, with no access to medical care after the $100 to $150 cost per mammogram Komen typically contracts with hospitals and facilities as pay out of the mammograms per woman. Komen locally have taken to supporting the Planned Parenthood programs, with enormous grants, though abortions are now linked with high rates of breast cancer the programs finally confessed they knew all along but withheld from the public. Komen locally has gained influence over the media as well, expanding their grants to include large payouts to multiple medias locally, thus silencing the public access to such knowledge as listed for fear of loosing those grants gained from Donated dollars and used for advertisements to gain more donations for Komen. For future referances  there are at least 16 known CDC centers in florida women age 52 and older MUST go to in order to gain medicaid if they have cancer. Broward Health Center is one, and the full list can be found at the CDC web page under breast cancers. If you are in that age group and you have not had a mammogram in a year, please contact one of the facilities the next time you are prepared to have a mammogram to protect your rights. I would highly recommend women in other states also check the CDC center for breast cancer diagnosis sights in your own state as well and follow the rules they have set up. And if the author could contact me, I would like permission to reprint your story. There are a growing documented number of women, and no they are not all registered citizens, who are having the same results in our County. Thank you",
      "MessageIndex": 38,
      "PostDate": "24/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/751841",
      "Title": "Looks Like I'll Have To Take My Wife Out Of The Country Sepahunt22 CathyB"
    },
    {
      "AuthorID": "CathyB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102488/profile",
      "Content": "May 25, 2010 04:48AM CathyB wrote: I will refrain from getting into a Statistic debate, however my data and likely others are aware of it as well, shows differant. Let me give you an example of how many of these studies work-Pratt and Whitney was linked to over 96 employee brain cancers at one of their plants several years ago. To pacify the crowds, who were filing class action lawsuits on behalf of the employees and families, DOH of that State opted to have an independant study done, to define if Pratt was actually contaminating its own employees. The man they called, was one Professor, Gary M. Marsh PhD. He did the study, decided there was nothing amiss and dismissed the whole thing. Published his work in 2008. What he did not disclose, was Pratt and Whitney paid for it. He also did not disclose that one of the Pratt founders, listed with million dollar fines for environmental contaminations all over the US, Harry Gray was also an American Cancer Society Corporate Board Member. The ACS also rewarded Dr. Marsh with large grants he did not report. Pratt donates to ACS to the tune of millions across the US. Shortly thereafter Mr. Marsh, PHD, was also appointed as a EPA Advisory Board Staff representing for the most part large industry. EPA was recently court ordered by a Federal Judge and threatened with contempt for refusing to issue fines for environmental contamination. Going further, here is a nice twist, (now recall that much of breast cancer has been linked to many environmental contaminations as has many brain, thyroid, pancreas, and intestional cancers) The Center for Disease Control recorded a study in 1984 of 30, note the 30 employees of thousands, chosen to test by several records to determine if a Cancer increase was apparent in the West Palm Beach Pratt & Whitney Plant, under the National Institute For Occupational Safety and Health (HETA Report No. 82-075-1545) This very same report would be used as evidentual in nature of a study of several plant employees to determine for the U.S. Department of Health and Human Services National Toxicology Program that Tricloroethylene just years later was indeed known to be human carcinogen used in the Pratt Facilities. Our state had knowledge the chemicals used at Pratt were capable of causing cancer, simply because EPA and CDC itself would later under branch organizations confirm that to be the case. However, the public would not find they had been mislead until I uncovered the document recently showing it was known the identified chemical caused cancer. That same chemical is now a suspect in our local Acreage Cancer Cluster child brain and adult cancers. There are also noted high cases of breast cancer, and others in the same area though those are being ignored by the State. Mr. Marsh by the way, also did an identical study for Dupont to prove Formaldehyde did not cause cancer; he almost got by with it. That same study was paid for by Dupont. The American Cancer Society along with the Komen Foundation, were the two key players in insisting The CDC funds enter the states to pay for women with breast cancer. It began as an 18 year old and up Federal Law. Each state however, has altered it dramatically, so that only the very elderly, and few have actual access, and in Florida that access is often controlled by ACS under the DOH/AHCA control. ACS and Komen are joint partners for all means and purposes. In response instead to your post-not only do I question any study put out for the benefit of ACS, I also question and look at the ties to that organization, who benefits from the outcome and why it was produced in the first place. Skeptic? No. Wisened? Yes.",
      "MessageIndex": 40,
      "PostDate": "25/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/751841",
      "Title": "Looks Like I'll Have To Take My Wife Out Of The Country Sepahunt22 CathyB"
    }
  ]
}