{
  "AuthorID": "Cathyviolet…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224067/profile",
  "Posts": [
    {
      "AuthorID": "Cathyviolet…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224067/profile",
      "Content": "Nov 17, 2015 10:51AM Cathyviolet wrote: I am 62 and a busy active healthy woman. I felt the lump myself. It felt huge. I was diagnosed on 10/8 with invasive ductal carcinoma, grade 2 stage 2 or 3 still not sure of the size. I am also TN. My only receptor was estrogen at 20%. I had several biopsies, MRI's and sentinel node biopsy done. The US indicated the mass was 2.1 cm but the MRI said it could be 5.6 cm. That is why the question of stage 2 or stage 3. I had bilateral mastectomies even though the Left breast mass biopsy was negative. I just felt better getting them both off and reconstructing after everything is said and done. The surgery was 11/12. The left procedure was simple mastectomy and the right was radical mastectomy with breast lymph node dissection. I chose a surgeon who does lymph node mapping so she could identify the nodes to take for the breast lymphatics and leave the arm lymphatic nodes to reduce the chances of lymphedema. I decided to take both breasts so I don't have to worry about it again. I had breast augmentation 15 years ago and they were able to leave the implants in place instead of using tissue expanders. Its funny, I thought they were even but the left implant is smaller and a little awkwardly positioned. Anyway. I look horrible but I know it will all be fine a year from now. With reconstruction, I can have them both look as symmetrical as possible. The breast that had cancer will be radiated along with the lymph nodes so we are not sure how easy that will be to reconstruct later. Time will tell. Its only been 5 days. I still have drains and am draining serous fluid. They'll come out next week. It is not really that painful physically, just psychically and emotionally. Sleeping is awkward. I'll be doing the A/C & T chemo starting mid December so know I'll be challenged with that. Radiation to follow in the spring. The information gathering and the decision making is the hardest part. Honestly I felt like celebrating when I finally made some decisions and began treatment. Its very challenging to navigate all the options and issues.",
      "MessageIndex": 239,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "Cathyviolet…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224067/profile",
      "Content": "Nov 17, 2015 10:41AM Cathyviolet wrote: I just had bilateral mastectomies on 11/12. 5 days post op. doing well. This totally sucks tho....need to get the drains out and get my range of motion back. Build up some strength for chemo in 3 weeks.",
      "MessageIndex": 238,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    }
  ]
}