{
  "AuthorID": "Catsme",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243398/profile",
  "Posts": [
    {
      "AuthorID": "Catsme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243398/profile",
      "Content": "Jan 15, 2018 04:51AM Catsme wrote: Hi MSQ, I too was 55 at time of DX. I chose mastectomy, so can't speak to radiation, but I've been on Arimidex for one year, and had a little bit of nausea at first, but started taking it with food and that fixed that issue. No other side effects, and no impact on QOL. As far as catching this years down the road; if you mean how is it found if it reoccures, my BS & MO, talked with me about what things to look for, and let them know of any new symptoms that don't go away or that get worse. I learned the two week rule from this community. Sorry you find yourself here, but this is a great place for support.",
      "MessageIndex": 7,
      "PostDate": "15/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/861610",
      "Title": "Just diagnosed with Stage 1AN0 (before surgery) IDC MSQ MSQ"
    },
    {
      "AuthorID": "Catsme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243398/profile",
      "Content": "Jun 7, 2018 02:36AM Catsme wrote: Hello, I'm hoping to get some help with an ongoing concern. Since my diagnosis I've tried to control my panic around any new symptom that comes up. I am working with a councilor and have come to understand that one of the emotional drivers of this reaction is the fear that I'll over look something and by the time I get it checked out it will be \"too late\". Does identifying mets early have an impact on outcome? What advice would you give regarding when to see my MO or BS outside of my regular appointments if a new symptom does pop up? Thank you!",
      "MessageIndex": 4575,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Catsme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243398/profile",
      "Content": "Jun 7, 2018 09:12AM Catsme wrote: Thank you all so much! Your words of wisdom and empathy help alot. I love the idea of giving new symptoms three weeks. It is something I think I can do. I do have long stretches of time where BC isn't top of mind (it's always in the background ), but it seems a simple heat rash or new ache can send me down a dark path. Thanks also for the education on mets, and \"early detection\" of them. Different scenario than early detection of BC. It sounds like the best plan is to keep up with check-ups, stay as healthy as possible and know there are treatments if mets do develop. You all give me hope that no matter what, even I can get through this. Thank you ",
      "MessageIndex": 4580,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Catsme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243398/profile",
      "Content": "Jun 16, 2018 03:25PM Catsme wrote: Hi FunnyBunnie, During my biopsy US my axillary lymph nodes were scanned as well as the suspicious breast area. I did see the US order, and it specifically stated that the axillary area should be scanned to see if the US corroborated the negative node appearance on the MRI. It helped me to see the biopsy orders to know what and why things were done. I think this is pretty standard. I was questioning everything when moving through this process. Keep us posted ",
      "MessageIndex": 1,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/865240",
      "Title": "Axillary lymph node on ultrasound FunnyBunnie FunnyBunnie"
    },
    {
      "AuthorID": "Catsme",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243398/profile",
      "Content": "Jun 16, 2018 04:11PM Catsme wrote: This is the toughest part of all of this, the waiting and the unknowns. I was similar to you in that I didn't share a lot outside of my boyfriend and adult son until I knew my diagnosis and plan. I did journal through this period as another outlet. That and binge watching Netflix and reading novels got me through this time. I also limited my time on Google. When is your follow-up for results of the biopsy? ",
      "MessageIndex": 3,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/865240",
      "Title": "Axillary lymph node on ultrasound FunnyBunnie FunnyBunnie"
    }
  ]
}