{
  "AuthorID": "cayenneblue…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/51998/profile",
  "Posts": [
    {
      "AuthorID": "cayenneblue-2007Jun02",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/51998/profile",
      "Content": "cayenneblue-2007Jun02 wrote: Hi everyone- I had a mastectomy last year, with a snb (5 nodes removed). I haven't developed lymphedema, and do take precautions such as the sleeve/glove when flying. So far, so good. (I even survived being stuck in the hand by cactus spines, and a blood pressure taken by accident) I feel lucky so far! My question concerns an upcoming trip. We're going on our first ever cruise, and I'm prone to seasickness. In the past, those seasick bands that go around your wrist (with a pressure point on the inside of your wrist) have worked wonders for me on windy, carsick provoking, roads. Does anyone know if they are a lymphedema risk? They are a bit tight, since they need to press on the acupressure point. They also make some that emit electical pulses on that pressure point. Does anyone think those would be a risk? I'm kind of worried about the seasickness (especially since there's a tropical storm in the Caribbean right now), but at the same time, I don't want to trigger lymphedema.... Any or all advice or opinions appreciated!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/624112",
      "Title": "Seasick bands - a risk for lymphedema?? cayenneblue-2007Jun02 NPat"
    },
    {
      "AuthorID": "cayenneblue…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53809/profile",
      "Content": "Jan 25, 2008 09:58PM cayenneblue32 wrote: My sister was just diagnosed with ALH, and because of the fact that I have bc, they will be doing the screening your doctor recommends (Mammograms and MRI's, alternating every six months) I don't believe her insurance questioned it, but maybe that's because of my diagnosis. From what I've read, and what they have told her, and because of the ALH and my diagnosis, her chance of developing bc is 45% for lifetime risk! Definitely something that an insurance company should pay to monitor..... I'd see if your doctor can intervene at all - for you to have both ALH and ADH, I would think that would certainly raise your risk, and need to be monitored. (and I am a strong supporter of MRI's, since my second lump was only found on an MRI (which wasn't even recommended by my doctors), and not seen on the mammogram I had just had two months prior) Theresa ",
      "MessageIndex": 2,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/699148",
      "Title": "ADH with ALH missz cayenneblue32"
    },
    {
      "AuthorID": "cayenneblue…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53809/profile",
      "Content": "Nov 7, 2007 01:41PM cayenneblue32 wrote: Hi Janice- You might want to be checked for a frozen shoulder. I ended up with one after my mastectomy/reconstruction surgery. Whatever happens, don't stop using the arm - if you don't have a frozen shoulder now, \"protecting\" the arm by not moving it can lead to one. And believe me, it's not something you want! Very painful rehabilitation, and tricky as well with the LE risk. Theresa ",
      "MessageIndex": 10,
      "PostDate": "07/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/694470",
      "Title": "Arm pain SheriH NativeMainer"
    },
    {
      "AuthorID": "cayenneblue…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53809/profile",
      "Content": "Jan 27, 2008 04:05AM cayenneblue32 wrote: Excellent!! Good luck and I'll be sending CLEAR vibes your way!!  Let us know when you'll be having your scan so we can be there \"virtually\" with you! Theresa ",
      "MessageIndex": 4,
      "PostDate": "27/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/699148",
      "Title": "ADH with ALH missz cayenneblue32"
    },
    {
      "AuthorID": "cayenneblue…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53809/profile",
      "Content": "Feb 5, 2008 10:58PM cayenneblue32 wrote: Wonderful news!! Make sure they test you at least yearly!  Like I wrote in my message above, my sister who tested positive for ALH has been told by two separate doctors that her lifetime risk (with my history thrown in) is 45%.......   Theresa ",
      "MessageIndex": 10,
      "PostDate": "05/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/699148",
      "Title": "ADH with ALH missz cayenneblue32"
    },
    {
      "AuthorID": "cayenneblue-2007Jun02",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/51998/profile",
      "Content": "cayenneblue-2007Jun02 wrote: Hi all- I heard of a woman on the Komen boards that developed lymphedema after painting. Is this truly a risk? I used to be the painter in the family, and I'm itching to get my guest room painted! I had 5 sentinel nodes removed in my left arm, and no nodes, but a bilateral mastectomy on my right (painting) arm. I'd just hate to have my husband have to do it all! Actually, that wouldn't be a good thing, because it would never get done! Thanks!! Theresa Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/655068",
      "Title": "Painting.......... lymphedema risk?? cayenneblue-2007Jun02 sushanna1"
    },
    {
      "AuthorID": "cayenneblue…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53809/profile",
      "Content": "Jul 17, 2007 05:53AM cayenneblue32 wrote:",
      "MessageIndex": 5,
      "PostDate": "17/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/655068",
      "Title": "Painting.......... lymphedema risk?? cayenneblue-2007Jun02 sushanna1"
    },
    {
      "AuthorID": "cayenneblue…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53809/profile",
      "Content": "Jul 16, 2007 03:56AM cayenneblue32 wrote:",
      "MessageIndex": 2,
      "PostDate": "16/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/655068",
      "Title": "Painting.......... lymphedema risk?? cayenneblue-2007Jun02 sushanna1"
    }
  ]
}