{
  "AuthorID": "CBeemer",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63213/profile",
  "Posts": [{
    "AuthorID": "CBeemer",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63213/profile",
    "Content": "Mar 25, 2008 07:20PM CBeemer wrote: Hello to all the March '08 Rad Gals! I had # 5 of 36 today (+8 boosts following???) and have had some pinkness/redness since the 1st Rad treatment (03/19).  Due to very sensitive skin, the doc thought I was allergic to the 1st prescription cream (Xclair) so now I'm trying Biafine, my insurance company did not pay for it ($56.89+ for 1 week?) and said that this product was used during surgery???  My onc needs to call BC/BS and have their prescription dept. over ride this cream so that my insurance co. at least pays something (told I would pay about $ 20 each prescription).  Unfortunately, I'm allergic to Aquaphor and any petroleum based product.  Where do you buy the pure Aloe?  The doctor told me today that I'm starting to dry out, so I'd try anything that might help at this time since I have a very long haul until the end . . . Last week when I started the rads, I was very depressed.  Thurs. eve. after the 2nd treatment, I cried out loud and couldn't stop.  My husband didn't know what to do, we were at a restaurant and I'm sure the patrons around us wondered what the heck was going on.  I'm better now, think I've just accepted the necessity of the rads, even if it freaks me out and makes me feel out of control . . . Keep thinking no chemo this time (6 rounds in '99 for Stage III Ovarian Cancer) knew that I wouldn't do chemo again unless there was a really large increase in survival and much less chance of recurrence (1-3% not nearly enough to deal with the chemo and the after affects I had for years, left leg/foot still and forever experiencing some rather bad neuropathy). Good Luck to everyone out there!  I'm trying to take it ONE DAY AT A TIME, that's all we really every have!!! All the best, Cheryl in Chicagoland",
    "MessageIndex": 115,
    "PostDate": "25/03/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/70/topics/701378",
    "Title": "March 2008 Rads Team brst26 juliajo"
  }]
}