{
  "AuthorID": "cburke51986…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175473/profile",
  "Posts": [
    {
      "AuthorID": "cburke51986…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175473/profile",
      "Content": "Jul 9, 2013 05:17AM cburke51986 wrote: I'm Candice, I'm stage 4. ",
      "MessageIndex": 430,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "cburke51986…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175473/profile",
      "Content": "Mar 17, 2014 09:56PM cburke51986 wrote: Hello! I will be continuing on Herceptin and starting Kadcyla in the next couple of weeks. I was originally diagnosed as stage 4 in March of 2013, with a tumor in my right breast, extensive lymph node involvement in my right axilla, and 3 tiny lit up spots on pelvis, illium, and sacrum... I started right away on a combination of Perjeta, Herceptin, and Taxotere. I had immediate fantastic results.... bone spots disappeared within 3 weeks, tumor shrank considerably, and lymph node activity went down to a normal SUV range in PET scan. In September 2013 the SUV in lymph nodes had increased slightly, but tumor continued to shrink. There was a very small spot that lit up my T8 vertebrae in my spine, but when a biopsy was done it came back clear and I went ahead and had a right side modified radical mastectomy. Taxotere stopped in September and Have continued on with the Perjeta and Herceptin. Just finished radiation treatment last month and had a PET/CT on March 10th that I was expecting to see clear. I felt a pulling sensation in my back last Friday when I picked up my 2 year old and thought I pulled a muscle... woke up at 4:30 am Saturday morning in terrible pain and drove myself to the ER. The ER doctor called the hospital to ask about my PET/CT results and I was told that they fund several new areas in my spine, as well as new lesions in my right femur, and 2 areas of my pelvis. They went ahead and did a CT at the hospital based on that and discovered that cancer in the bone marrow in my T7 vertebrae had caused a compaction fracture. Luckily an MRI showed that my spinal cord has not been damaged, but they admitted me to the hospital and I've been here getting tests ever since. I start radiation tomorrow for the areas in my pelvis, upper, middle, and lower back. Radiation Onc says it will nuke the cancer that is there now, and it should take about 5/6 weeks for the bone marrow to grow back and the fracture to heal. My oncologist told me that he plans on starting my on Kadcyla and continuing my Herceptin treatment. The Perjeta worked almost instantly for me and I had no progression for 6 months. I'm really hoping that the Kadcyla will work for me, because I know that Perjeta was supposed to have a higher average for progression free survival... it's just crazy that something can start off working so incredibly well and then instantly stop. To be honest, I'm nervous about Kadcyla... not because I think it won't work, but because of the very scary and serious sounding side-effects. Although I have to admit I'm pretty pleased that only 5% of the ladies on it lose their hair! I just got mine back.... it's curly now and feels slightly like a brillo pad, but it's there and I'm thrilled!! Doctors all reassured me that right now is an extremely progressive time as far as breast cancer treatments are concerned and there is a lot of great breakthrough work being done for those of us with metastatic cancer. I've also heard that bone mets are the easiest to manage on average and can be treated for years and years... so I'm going to pray my butt off and cross my fingers for myself and every one of you ladies that are on or are getting ready to start taking this groundbreaking new drug... I'll be sure to post my success with and reactions to it... and no doubt be checking back here frequently for some reassurance myself. Good luck everyone!",
      "MessageIndex": 32,
      "PostDate": "17/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    }
  ]
}