{
  "AuthorID": "CC-TigerDra…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230400/profile",
  "Posts": [
    {
      "AuthorID": "CC-TigerDra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230400/profile",
      "Content": "Mar 17, 2016 05:05PM CC-TigerDragon wrote: Mar. 17th, 2016 THANK YOU 70charger for your reassurance! I am 6 months post double mastectomy, and see improvements in periodic chunks of time. ",
      "MessageIndex": 7,
      "PostDate": "17/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/839802",
      "Title": "Is fatigue normal Kiks1 JCS28"
    },
    {
      "AuthorID": "CC-TigerDra…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230400/profile",
      "Content": "Mar 17, 2016 10:26PM CC-TigerDragon wrote: March 17,2016Book  Heathet, I,too, am so sorry you are going through this, and you can do it. I received the same diagnosis last August. I would like to double the caution of \"stay away from Mr. Google\", and stick to the factual and up to date information. Also, I think that searching through the most recent revision of Dr.Susan Love's Breast Book was very helpful in providing me information I needed to make good decisions. Good research and knowledge is also empowerment for me. Also regarding medications, I know of several women who found antidepressants helpful when they were ready for them. My advice to myself during the early post diagnosis time was: Pay close attention to the radiologists' assessments and reports. I had a diagnostic mammogram; ultrasound; then two MRI's. It was the excellent first radiologist who showed me my digital images and recommended the specific MRI. Digest and reflect as much as you are able then keep asking questions. If you have a trustworthy advocate, bounce some of your thinking/questions off that person.  Sending you positive vibes, CC-TigerDragon",
      "MessageIndex": 19,
      "PostDate": "17/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841994",
      "Title": "Just diagnosed Heathet Heathet"
    }
  ]
}