{
  "AuthorID": "ccjj",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
  "Posts": [
    {
      "AuthorID": "ccjj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
      "Content": "ccjj wrote: Clinically dx with ILC 2cm no node involvement.  Since ILC decided to have bmx with TE /recon and planned to avoid radiation.  However, after surgery 1 of 9 nodes pos.  Also, my anterior (closest to the skin) margin was clean but small, < 1 mm.  My surgeon says still no radiation needed. That the chemo and Herceptin will take care of any stray cells. Plan to get a couple of different opinions from radiology oncologists but feel like they will recommend it because thats what they do.  Anyone else encounter this situation and what did you decide? Thank you for your input and taking the time to share.  Dx 7/7/2011, ILC, 2cm, Stage IIA, Grade 2, 1/9 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774669",
      "Title": "Radiation w/masectomy and 1 pos node did you have it ccjj ccjj"
    },
    {
      "AuthorID": "ccjj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
      "Content": "Sep 13, 2011 11:21AM ccjj wrote: Thank you all for your replies. It really helped.  You all make great points as to how you came to your decisions. I am at a NCI designated cancer facility, and have decided since I am in the midwest to get a 2nd opinion from Mayo clinic in MN.  Its all set for next wed. I havent even seen the radiologist here yet, but want to get 2 opinions and then make my decision.  This cancer deal is one horrible decision to make after another.  First it was the lumpectomy versus masec. Then masectomy versus double masect. Then I obsesed about which chemo treatment I should be on. Now its the radiation deal.  I start chemo this Friday  AC x 4 dd and then dd T x4 followed by Herceptin and then tamox. And to think before this I only took a multivitamin. I have read that a lot of people do taxol weekly over 12 weeks and that its more effective. I plan to ask Mayo about that as well. Not that I want to spread it out any longer.  Also confused on how onco choose between taxol and taxotere.  Congrats Jenni_ca on your 7 years out!  That is so encouraging to hear. ",
      "MessageIndex": 5,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774669",
      "Title": "Radiation w/masectomy and 1 pos node did you have it ccjj ccjj"
    },
    {
      "AuthorID": "ccjj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
      "Content": "Jan 8, 2012 09:46PM ccjj wrote: I have three taxol tx left out of 12 and my hair has started to come in. Thank goodness.  I cant believe how grey/white it is. I had some grey prior but nothing like this. So wondering, is the grey/white my new color, or will it eventually turn to normal brown color? Feels like chemo aged me 15 years.",
      "MessageIndex": 13411,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ccjj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
      "Content": "Mar 3, 2012 11:07PM ccjj wrote: Robo, you look great.  Thanks for posting the pics.  Thanks to all for letting me know I'm not the only one feeling this way.  It really helped.  Today was a much better day for me mentally.  Question for those that have had their tissue expander's removed and implants switched out.  How is the recovery from that surgery?  Mine is March 16th.  Cant wait.  Did you all go home same day? How long till up and moving around, return to work. I have heard 7-10 days as far as lifting, but how about feeling okay and being able to drive, etc?  You don't get more drains do you? Sorry so many questions.. I obviously didn't do a good job when discussing with the surgeon. I was so excited to get it booked and the nurse I spoke with was kind of vague. Just said 7-10 days of no lifting over 10 lbs. ",
      "MessageIndex": 14298,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ccjj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
      "Content": "Mar 7, 2012 09:28PM ccjj wrote: Ossa... Love your hair color. Mine is coming in a horrible grey/black color. I've been coloring it so long I didn't realize it was that grey all over. Cancer, boobs gone, bald with grey hair coming in. All at 44. I thought 40 was supposed to be the new 30 or something like that. Not..",
      "MessageIndex": 14403,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ccjj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
      "Content": "Feb 5, 2012 03:28PM ccjj wrote: Claire.. don't give up hope yet of it growing in while on Taxol.  I didn't see any growth until round 7 or 8 of the weekly taxol x 12.  It then came in as all while fuzz.  I am one week PFC and it continues to come in.  I have scalp coverage. Its definitely grayer than I remember. My girlfriend just colored it. It looks so much better. I am so anxious to lose the wigs, I cant stand it. ",
      "MessageIndex": 13867,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ccjj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
      "Content": "Mar 2, 2012 11:57PM ccjj wrote: Caitlin... I noticed your from Greenbay.  I'm in Madison.  Triple pos but grade 2.  Diagnosed at 43. They gave me AC-TH.  AC was dose dense x 4. The T was taxol and herceptin and was given weekly for 12 weeks.  I did go to Mayo clinic for a 2nd opinion and they confirmed the treatment. I finished the chemo end of January and have had 3 muga scans.  Still doing the Herceptin, so far no changes to my heart. Good luck with your decision.  Eileen.. Hang in there. Its so hard. Reading your post and reliving the hair loss made me tear up. As others have said its devastating but you do move on and it comes to pass. Hair...so the hair is coming in. Wish it would hurry up. I'm another that wore wigs the whole time and continue to do so.  My eyebrows are getting worse... They were hanging on but as of now are pretty much all gone.  I was so excited when chemo ended a month ago. My excitement is wearing off. I need to loss the 10 pounds I gained during chemo, plus I feel like I have so many more wrinkles.  Between the hair, wrinkles, no eyebrows, weight, and the mental issues, I'm flighty and kind of crabby. I'm tired of not feeling or looking like myself. Maybe I need to go and get some wrinkle fillers or botox? Have any of you tried that since BC. Is it safe...",
      "MessageIndex": 14286,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ccjj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
      "Content": "Mar 6, 2012 09:58PM ccjj wrote: Shore... my exchange surgery is coming up on march 16th.  I also plan to wear some makeup.  Just a little eyebrow pencil and a maybe a touch of mascara on my remaining lashes.  I have also started to freak out about the hair deal during surgery. I am one of those that doesnt go anywhere without the wig. Still debating about whether to wear the wig or a little turban hat. I\"ll probably go with the hat.  The hair deal has been really tough. I feel like mine is growing in pretty fast overall and its still hard. I finished chemo 1/27/11.  It started growing in around week 7 of the weekly taxol. I have full head coverage and its about 1/2 inch long, but lays very flat and stuck to my head. I cannot wait until it grows enough to toss the wig. I'm just not sure how long it needs to be before I am comfortable going wigless. ",
      "MessageIndex": 14383,
      "PostDate": "06/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ccjj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
      "Content": "Nov 8, 2011 11:31AM ccjj wrote: You may want to look at the thread called Grey zone for radiation or something like that. A lot of us appear to be in this grey area.   I am currently going for my 2nd opinion on whether or not I will need rads. I am hoping not. Good luck with your decision. ",
      "MessageIndex": 2,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777758",
      "Title": "Anyone have axillary lymph node dissection AND radiation too? finallynow deep2deep"
    },
    {
      "AuthorID": "ccjj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
      "Content": "Sep 13, 2011 02:24PM ccjj wrote: I start chemo this Friday Sept 16 and am terrified.  Wanted to check in with you all and see how its going as your a couple of rounds into it by now. I am doing dose dense AC x 4 followed by dd T x4 and herceptin for a year.  I have a wedding to attend Oct 8 and am hoping to feel okay enough to attend.  I hope I dont have any delays.  If I can stay on track I can be done right before Christmas. Are any of you working? If so, how has that been going. How about kids. I have 6 year old twins and am hoping I am able to manage okay during chemo. ",
      "MessageIndex": 1512,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "ccjj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135754/profile",
      "Content": "Jun 12, 2012 09:22PM ccjj wrote: Dipad.. its my understanding that the guidelines didn't change but a study did come out and was reviewed at some radiologist conference in Oct 2011 showing that women with 1-3 positive nodes could benefit from radiation even though they had a mx.  This was a departure from the previous thought of 4+ pos nodes if you have had a mx. The study stated for there to be benefit there had to be other factors beyond the positive nodes.  If I remember correctly the benefit was dependent on a few factors... whether there was LVI, size of the tumor, and whether or not the nodes involved were micromets, or not.  The study also showed that the benefit of radiation increased with the number of pos nodes involved. So, three pos nodes received more benefit than someone with micromets in 1 node.  I really struggled with the radiation decision. I went to two ROs and both told me no.  That the benefit did not outweigh the risk for my situation. I'm happy to have skipped it and feel it was the right choice for me.  I would get more than one opinion, but there are real risks to all these treatments.  Look at Robin Roberts, from Good Morning America. She is 5 years out from TN breast cancer and announced this week that she is now facing a form of leukemia. Very frustrating.",
      "MessageIndex": 54,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783886",
      "Title": "Radiation Necessary marystnow55 purple32"
    }
  ]
}