{
  "AuthorID": "CCNC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244997/profile",
  "Posts": [
    {
      "AuthorID": "CCNC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244997/profile",
      "Content": "Jan 15, 2017 04:19PM CCNC wrote: First post on this site. I just completed my second round of chemo on Jan. 6th. The first round from Dec. 16th created so many side effects they backed off the dosage of the taxotere for the second round. The second round was smoother so I guess it helped but am worried about permanent damage from all of these drugs. I am on the neulasta as well and absolutely hate it. Had severe pain with the first round but I got ahead of it the second time around and it was manageable. I will be on Herceptin for a year. I don't know anything about surgery and radiation yet, doctor won't discuss it. I guess they are waiting to see how the chemo works first. My hair is about 90 percent gone, started shedding about two weeks after the first treatment. I have been wearing hats, as the scarves I ordered just don't look right on me. Taste buds are shot as well and my tongue has some numbness from the first treatment, so eating is a miserable experience right now.  I can sympathize with a lot of what I am reading in this thread. This is a rocky path to walk(crawl), just wishing for the day when the chemo is finished.",
      "MessageIndex": 456,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "CCNC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244997/profile",
      "Content": "Feb 10, 2017 04:47AM CCNC wrote: Mistyeyes - good luck with the 4th one. You are about a week ahead of me, mine is next Friday. Hope the SE are not too bad for you. I have been surprised that even though the 3rd hit faster, I pulled out of the misery a little better this time. I am hoping 4,5 and 6 repeat that pattern. The first two so far have been the worst.",
      "MessageIndex": 629,
      "PostDate": "10/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "CCNC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244997/profile",
      "Content": "Jan 22, 2017 06:12PM CCNC wrote: Dizzygirl, we are on almost identical tracks. I am doing TCHP as well and my third treatment is on the 27th. I had mouth sores with the first round. My MO reduced the Taxotere on my second treatment and I did not get any mouth sores. Have you told them all the side effects you are having, there may be an opportunity to reduce the dosage? The diarrhea and mouth sores (and I think just the sheer number of side effects that first time)were the reasons they backed off. The second time around the SE were greatly reduced. I agree that the fatigue was harder to bounce back from the second time. I am not looking forward to the third treatment. BCS2016, I did not cut my hair until there was so little left I could no longer pin up the remaining strands. I do have a very thin amount hanging on, but am kind of glad it is there as it gives me the illusion of having hair when I have my hats on. My hair loss has slowed down this week and I am curious if it is all going to go as well.",
      "MessageIndex": 506,
      "PostDate": "22/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "CCNC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244997/profile",
      "Content": "Feb 14, 2017 09:59AM CCNC wrote: Argynis - I asked my infusion nurse about the Herceptin shot and she had not heard of it. They don't do them, she wondered if it was a clinical trial?? Dizzygirl good luck this week. It took over two weeks this time for my GI to get almost back to normal, just in time to get smacked again on Friday. I am going to try the 3 week Herceptin treatments to see if I can tolerate them. The thought of going every week for the rest of the year is just too much for me right now. Jezikah - I understand your fears on the neuropathy. So far my toes have been affected but my hands are doing ok. It is a scary thing and I totally understand where you are coming from. There are such crazy and random side effects with the mess and I want quality of life after this. My tongue went numb with the first treatment, but it has come back. I also lost the sensation to pee immediately after the 2nd round but that has come back as well. That one stumped the MO I think. I was a little freaked out. My toes have improved since the first treatment also. I dread that tingling that happens after treatment because you wonder how much damage is happening. Hang in there. Notverybrave - good luck with your next cycle, hope the side effects are minimal so you can finish the full treatment. I couldn't feel the lump anymore after my first dose too, but the doctor didn't confirm until after the third treatment. All, I have seen various comments about nails in the thread. My infusion nurse said to keep my hands and feet out of water as much as possible, (no dish washing (which isn't a problem for me I'm a dishwasher gal) and no soaking in the tub unless hands and feet are out of the water. Which kind of makes sense since the nails soften when they get soaked, it might cause problems for nails that are already weakened. Just a thought. Good luck to everyone with their next treatments and congrats to those who have hopped of the chemo train.",
      "MessageIndex": 653,
      "PostDate": "14/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "CCNC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244997/profile",
      "Content": "Feb 9, 2017 10:09AM CCNC wrote: Not Very Brave and Dizzy Girl, I am on TCHP as well and we are all at about the same spot in treatment. My hair is a bit crazy also, lost most of the hair on my head but what is left appears to be growing. What I am surprised is that I still have hair on my arms, legs, nose etc. Do you still have yours or did you lose all body hair as well? Also I have read that it might start growing back before the end, have either of you seen any new growth? I have not, but I realize it is probably too early since we are midway through. The gastro side effects are the worst, I am right there with you on struggling to manage the effects. I have had those issues from the very first treatment. The bad thing is that the Herceptin only is also giving me problems with the Diarrhea. I have Herceptin every Friday (30 minute dose) until the end of the chemo which mine will be March 31st if everything stays on track. Then I start every 3 weeks (1.5 hour dose) to the end of the year. I am a little concerned about the larger doses of Herceptin starting, because I am having reactions to the smaller ones. Does it bother either of you? On the initial infusion day, the Herceptin is the only drug I reacted to at the doct. office. I had severe chills and my body jerked like a fish out of water until they were able to get it under control. It took two shots of Benadryl and about a half hour for it to stop. That was a larger dose that day. Since then I have continued to get chills in the evening after treatment and major gastro issues on the day after. I am also worried about the heart since I don't seem to be tolerating it that well. Since it is chemo first, have you discussed surgery options yet? Also have you seen any results from the chemo? At my last treatment the doctor could no longer feel my lump, which I am very grateful for. I hope when it is time for surgery there are no living cells left. I completely understand your worry about the long term effects on your body. I am having the same struggles wondering what is going to be left after chemo, surgery and radiation. I am just trying to focus on the end of March and that there are three more to get through. I have been working as much as I can during treatment, but there are days when I am in such a fog it is hard to get things accomplished. Are either of you working through it? Congrats to those who have finished - so happy you made it through! ",
      "MessageIndex": 619,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "CCNC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244997/profile",
      "Content": "Feb 9, 2017 05:33PM CCNC wrote: Argynis Thank you for the response about the shots. I was not even aware that option was available. I will ask about it at my next visit. So sorry to see this is your second round with chemo, hoping for the best for you. Sorry I got a little long winded earlier, it helps to see if other people are experiencing similar things. irishmom3, that is really scary about your port. Glad they figured it out.",
      "MessageIndex": 623,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    }
  ]
}