{
  "AuthorID": "CCRMom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183962/profile",
  "Posts": [
    {
      "AuthorID": "CCRMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183962/profile",
      "Content": "Jul 16, 2013 06:32AM CCRMom wrote: How long before you lost hair? With A/C, I lost it after the second round. Just curious how much time I have left with my precious locks it has taken 3 years to grow!",
      "MessageIndex": 5,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807524",
      "Title": "Just started Abraxane for newly diagnosed metastasis - any tips? CCRMom surfdreams"
    },
    {
      "AuthorID": "CCRMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183962/profile",
      "Content": "CCRMom wrote: Hi there! I was dx in 2009 with IIb ER/PR+, HER2-, invasive ductal carcinoma. Had bilateral mastectomy, 1 positive node so they removed 31, 4 rounds A/C & 12 of taxol. Started tamoxifen after completion of chemo. As my MO said, \"I guess your body didn't read the plan\" as the tamoxifen stopped working at some point recently. DX this time via a plueral effusion. CT & bone scans found small mets on lower ribs, both lungs, lymph node involvement in mammory chain, neck, etc., and have had 2 thoracentesis (drained 1 liter the first time, 2 liters 2nd). I started 3 weeks on, 1 off of Abraxane yesterday, at least 4 cycles. I tolerated Taxol pretty well the first time around, and I'm just wondering if there is anyone out there who has been through similar and could offer any advice? I'm a stay-at-home mom of an 8, 6, & 5 year old, so anything I can do to get ahead of something to prevent nasty side effects would be greatly appreciated! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807524",
      "Title": "Just started Abraxane for newly diagnosed metastasis - any tips? CCRMom surfdreams"
    }
  ]
}