{
  "AuthorID": "ceecee123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267376/profile",
  "Posts": [
    {
      "AuthorID": "ceecee123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267376/profile",
      "Content": "Jan 23, 2018 07:45AM ceecee123 wrote: Lula, I've tried to get her to oncologist. She refuses. Her primary is pretty passive about all of this. She just keeps verifying she doesn't want surgery to cover herself. The only way I was able to get her to agree to CT Chest was because she has COPD and just had a bad bout with it. She smoked probably for 50 years. She doesn't want to know anything, I can't talk about it. She still says she shouldn't have done the biopsy, as she feels it made it worse. She claims she isn't in pain, but the other day she had very bad pain by her kidneys (not a UTI) for days. She also complains of shoulder pain. She is unsteady, dizzy, forgetful of recent events, and has a hard time putting a sentence together finding words she's thinking of. She has difficulty walking, is out of breath walking from one room to the next. Refuses oxygen at home. CT did show moderate artery and aorta plaque. She has a hiatal hernia, gallstones as well. All she does is eat all day. She has obviously given up and is going out on her terms.It's very hard to deal with.",
      "MessageIndex": 4,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/861886",
      "Title": "CT Chest does not state Breast Cancer ceecee123 LisaAlissa"
    },
    {
      "AuthorID": "ceecee123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267376/profile",
      "Content": "Jan 23, 2018 07:36AM - edited Jan 23, 2018 07:38AM by ceecee123  Thanks for your reply. It did say lymph nodes were not enlarged. I'm guessing that would be the axillary nodes also located under the armpit? I am just surprised it didn't show any mets given the way her breast looks. It's probably going to ulcerate at some point. She is showing alot of symptoms of brain mets, but I will never know.. Could be dementia..She's always been a difficult person to deal with, but now she is getting worse and I am her only child taking care of her.",
      "MessageIndex": 3,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/861886",
      "Title": "CT Chest does not state Breast Cancer ceecee123 LisaAlissa"
    },
    {
      "AuthorID": "ceecee123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/267376/profile",
      "Content": "ceecee123 wrote: Just a quick synopsis. Mom is almost 82 years old. She had a lump in her right breast that she ignored for years. About a year ago, we were able to get her to agree to a core needle biopsy. Came back Invasive Ductal Carcinoma, not In Situ. Her mom and also her sister both had breast cancer. She is against any kind of surgery or treatment. It was the size of about an egg back in Dec 2016. Fast forward to now, it has grown, and taken over most of her breast. It is puckered and pulled in, the nipple is crusty, and she says it is very itchy and she gets pain. Breast is starting to look inflamed. I tried to get her to at least see an oncologist, but she refuses. She also suffers from COPD pretty bad. At her pulmonary appt, was able to get a CT Chest ordered. I was hoping it would shed some light on the breast cancer and whether or not it was in chest area, lymph nodes, ribs etc. Got report back on that, she has a myriad of other problems, but Radiologist did not even mention the breast cancer in his report, nor does he mention anything to indicate that it was in bones, lymph, lungs. I called the Dr to question this, and she said the CT does not show Breast Cancer, that is what mammos are for. Something about tissue and shadows??? I have never heard of such a thing. I question this whole report honestly. Any thoughts? I know I have read CT is used to detect cancer. Thank you! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/861886",
      "Title": "CT Chest does not state Breast Cancer ceecee123 LisaAlissa"
    }
  ]
}