{
  "AuthorID": "Celebrate_Life",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271522/profile",
  "Posts": [{
    "AuthorID": "Celebrate_Life",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/271522/profile",
    "Content": "Celebrate_Life wrote: Ten years ago today, I found my lump. I knew it was breast cancer due to cyclic headaches and a hormonal positive menigioma (benign brain cancer) which was removed in May 2008. It would be September before all the tests, scans, and biopsies would be completed to confirm the cancer as stage iv with extensive mets to the bones. I am alive! My quality of life has been fantastic! Yes, I have a new normal, but life is good. My mental, physical, and spiritual team are all helping me through this journey. I am truly blessed and I will continue to celebrate life each day making it the best day I can make it. I don't know what the future holds as I have a 5 cm tumor in my liver, my TM are over 3000 and my chemo is not really working. But, I can say, don't give up hope. Set milestones. My next one is in two weeks to see my grandchild go to kindergarten. I didn't think I would live to see him born! I have learned that my life is about relationships and I have tried to enjoy and love the people I am with. I want to give hope to everyone. Life with stage iv can be fulfilling. Be strong, believe, find courage and hope, have faith, trust in the unknown, look for joy, love unconditionally, and be at peace. And Celebrate Life!! You got this, one day, or one hour, or even one minute at a time. You got this! Therese Dx 8/6/2008, ILC, Left, Stage IV, metastasized to bone, 23/26 nodes, ER+/PR+, HER2- Dx 2016, Stage IV, metastasized to liver Targeted Therapy Avastin (bevacizumab) Targeted Therapy Afinitor (everolimus) Surgery Lymph node removal: Underarm/Axillary; Mastectomy Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Hormonal Therapy Femara (letrozole) Hormonal Therapy Faslodex (fulvestrant) Hormonal Therapy Aromasin (exemestane) Chemotherapy Xeloda (capecitabine) Chemotherapy Taxol (paclitaxel) Chemotherapy Doxil (doxorubicin) Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "06/08/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/866431",
    "Title": "Ten years-whooopeeee! Celebrate_Life dorimak"
  }]
}