{
  "AuthorID": "CelineFlower",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158204/profile",
  "Posts": [
    {
      "AuthorID": "CelineFlower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158204/profile",
      "Content": "CelineFlower wrote: Your breath stops, you feel your heart racing. You are affraid, affraid of procedures, affraid of being sick, affraid of dying.. Fear can keep you aware and save your life... but if can also choke the life out of you. It is normal to be affraid. Somehow  the \"c\" word.. has turned into a four letter word. Your fear is part of this journey , but it does not need to define you. Be YOU Dont try to live up to other peoples expectations. Know yourself and be kind to yourself. When you feel fear comming on... Stop: Breathe  Assess: 1-Am i in danger right now?  2- Do i have all the information? React:  Do what you need to do.  jump out of the way....run... ..... Research... share your emotions... hide your emotions.....fight... submit.. Just be you... stay true to you...and be good to you. You are not alone, the dark is brighter then you think. be well, celine  I have heard there are troubles of more than one kind. Some come from ahead and some come from behind. But I've bought a big bat. I'm all ready you see. Now my troubles are going to have troubles with me! ~Dr. Seuss Dx 8/31/2012, IDC, 3cm, Stage IIA, Grade 2, ER+/PR+, HER2- Dx 9/17/2012, LCIS Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792941",
      "Title": "Fear CelineFlower cinnamonsmiles"
    },
    {
      "AuthorID": "CelineFlower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158204/profile",
      "Content": "CelineFlower wrote: Wasnt sure were to post this... So after all my treatments... i got a blood clot in my jugular and my neck swelled up really bad... i looked like i had the mumps on one side of my neck... The swelling (later treated as infection) went down my chest and into the back of my head as well... They are giving me blood thiner shots for 6 months and a 40 day antibiotic treatment. I have read how lymphoma is often misdiagnosed....and also it can be a consequence of the breast cancer treatment So my questions are these... 1- I asked , after the ct scan, blood tests and ultrasound if this was cancer, they said no but from what i read, you can only diagnose lymphoma from a biopsy. Should i be more proactive in getting the medical team to investigate? 2- Do secondary cancers happen within a short time after finishing treatment? 3-I have had swollen nodes in the past.. docs have always chocked it up to an infection, and the swelling goes down with antibiotics... but my wbc has been high for about 5 years now (never lower then 14 unless on antib's then it goes to 10)... Should i be concerned?  just trying to understand all the... \"gifts\" bc leaves us with.... sigh thx for your help I have heard there are troubles of more than one kind. Some come from ahead and some come from behind. But I've bought a big bat. I'm all ready you see. Now my troubles are going to have troubles with me! ~Dr. Seuss Dx 8/31/2012, IDC, 3cm, Stage IIA, Grade 2, ER+/PR+, HER2- Dx 9/17/2012, LCIS Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/810904",
      "Title": "Could this be a secondary cancer? Lymphoma? CelineFlower CelineFlower"
    },
    {
      "AuthorID": "CelineFlower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158204/profile",
      "Content": "CelineFlower wrote: Hello everyone, This is my first Breast cancer forum. I found a large lump (feels like almost 3cm) in my right breast about a month ago. Went for a diagnostic mammo on the 25th of july. Within a week , i got a call at 8pm ( what doctor calls at that hour??) from the doctor saying, the mammo was suspicious (love that word...sigh), they saw \"flecks in it\" and he wanted to make sure I had the other apps set up. I told him i did... August 21st for a ultrasound and meeting with the breast surgeon. ( i'm surious.. is there a penis surgeon?)  The next day , the mammogram tech called to set up an appointement asap. She said .... \" I call back healthy women all the time! no need to worry.. it's probably just a technical issue\" I told her I had already spoken to the doctor and knew why they wanted another mammo. Her voice changed immedietly from the \" cold yet warm\" standard words... to the straight forward no bull attitude. She gave me an appt for Friday August 17th andwhen i told her my appt with the surgeon was the following tuesday and wondered if she would have the results by then.. she said .. \" remind me at the time to get you a \"verbal reading\"\" . From the multitude of reading i have done in the last few weeks.. i have not read about a \"verbal reading\"  This waiting.. as you all must know, is torture..  I am very glad to find a community to share my thoughts and to learn from reading others. thank you be well celine  I have heard there are troubles of more than one kind. Some come from ahead and some come from behind. But I've bought a big bat. I'm all ready you see. Now my troubles are going to have troubles with me! ~Dr. Seuss Dx 8/31/2012, IDC, 3cm, Stage IIA, Grade 2, ER+/PR+, HER2- Dx 9/17/2012, LCIS Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/791725",
      "Title": "Lady in Waiting CelineFlower RobinJoy"
    },
    {
      "AuthorID": "CelineFlower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158204/profile",
      "Content": "CelineFlower wrote: So after twso months trying antib's and all sort of over the counter drugs my doc is sending me for a Balloon Sinuplasty surgery on monday.. ive read some horrible things about it on FB from patients...  god i want relief from this pain but that last thing i want is more pain!! anyone else here have this? i know its not about bc...but i just didnt know where to post this... I have heard there are troubles of more than one kind. Some come from ahead and some come from behind. But I've bought a big bat. I'm all ready you see. Now my troubles are going to have troubles with me! ~Dr. Seuss Dx 8/31/2012, IDC, 3cm, Stage IIA, Grade 2, ER+/PR+, HER2- Dx 9/17/2012, LCIS Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/816882",
      "Title": "Balloon Sinuplasty info CelineFlower Fiaranch1"
    },
    {
      "AuthorID": "CelineFlower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158204/profile",
      "Content": "CelineFlower wrote: Waiting ... Some facts to help time fly  Noun: The action of staying where one is or delaying action until a particular time or until something else happens. On average people spend one third of their lives asleep, which is 318 months taken up just by laying in bed, this gives you 636 months left awake. The average person throughout their lifetime spends five years waiting in lines and queues where roughly six months of that is waiting at traffic lights. This..waiting... no matter if its a day..a week.. a month..a year.. its long. Its not about time..its about.. weight. Its so heavy, everywhere i go, i carry it on my back Like everyone else.. i read.. ressearch.. But i also, spend so much time thinking about it..even though i know i shouldnt. It's part of me now.. even if everything comes back a-ok.. i am a changed person for having had this experience and only i can choose to make that positive or negative i havent figured it all out yet.. but the path is there, and im not affraid to take it.  so many women come here.. and are \"waiting\".. i know that when i started reading here, it was so empowering to know, i was not alone. so pull up a chair.. or a purple pillow..we have some time to waste.. anyone got any jokes? read any good books? got a time machine?  I have heard there are troubles of more than one kind. Some come from ahead and some come from behind. But I've bought a big bat. I'm all ready you see. Now my troubles are going to have troubles with me! ~Dr. Seuss Dx 8/31/2012, IDC, 3cm, Stage IIA, Grade 2, ER+/PR+, HER2- Dx 9/17/2012, LCIS Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/791799",
      "Title": "Ladies in waiting CelineFlower CelineFlower"
    },
    {
      "AuthorID": "CelineFlower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158204/profile",
      "Content": "CelineFlower wrote: ok ill try to keep this short september... had a blot clot in jugular  vein neck and chest swelled up, put on 30 days of antib's and 90 days of blood thinner shots 1st week of december.... sinus infection... after antib's were finished was still sick... went to see doc on the 23rd...got more antib's, felt a bit better and was able to enjoy christmas... by the 27th... i was starting to feel worse...still taking antib's but not getting any better. My face is swelling up, i have what looks like a rash starting on my nose bridge and under my eyes.. i have 0 appetite... god knows i dont want to go to the hospital on jan 1st....  but maybe i need someone to tell me too...sigh i so much just want to feel normal again I have heard there are troubles of more than one kind. Some come from ahead and some come from behind. But I've bought a big bat. I'm all ready you see. Now my troubles are going to have troubles with me! ~Dr. Seuss Dx 8/31/2012, IDC, 3cm, Stage IIA, Grade 2, ER+/PR+, HER2- Dx 9/17/2012, LCIS Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/816364",
      "Title": "Someone tell me if i should go to the hospital or not CelineFlower ziggypop"
    }
  ]
}