{
  "AuthorID": "Celtic_Spir…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
  "Posts": [
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 10, 2010 01:12PM Celtic_Spirit wrote: This has been stuck in my craw for a couple of months now. A very good friend who lives in another state intimated to me that she was offended that I didn't immediately tell her about my diagnosis. I told her about a month later; fact is, I didn't tell many people - PERIOD - for a lot of reasons - which she knew - so she shouldn't consider herself slighted. For the first month after my diagnosis, I was too busy seeing doctors, getting tests, having surgeries, feeling terrified, and coming to grips with the poop omelette that had landed on my plate to play the town crier. Sorry that I didn't tell my story on your schedule, dear. Ironically, she's the kind of person who dribbles out information in such a way that you never feel you have the whole story. She just recently told me the truth of why she broke up with a former fiancee, and that happened 20 years ago! I'm really just stunned that she could be so petty, because she's usually a very warm & fuzzy type of person.",
      "MessageIndex": 53,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748058",
      "Title": "You know what I hate...rant! everyminute cherneski"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 1, 2011 04:11PM Celtic_Spirit wrote: You know, I can't escape from the bloody Pink Scourge. Today I received a catalog from Oriental Trading Company in the mail. Three whole pages feature Pinktober junk. Here's a sample: Breast Cancer Awareness Can Covers (yeah, I want that wrapped around my beer!), Pink Ribbon Roll Tickets (Congratulations! For your winning ticket, you receive a mastectomy! Yippee!), Pink Pom-Poms (Chemo! Chemo! Rah-Rah-Rah!), Breast Cancer Awareness Tablecloths, Knock Out Breast Cancer Pens (with little pink boxing gloves on the ends...groan!), BC Sticky Notes shaped like pink ribbons, pink ribbon hard candies, pink ribbon shaped antenna toppers, and pink ribbon footballs (yeah, how many women play football?). That wicked batch of margueritas sounds good, Weesa. I need a drink...or five!",
      "MessageIndex": 37,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774174",
      "Title": "What to do about pinktober...yuch.. weesa Celtic_Spirit"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 11, 2012 06:39PM Celtic_Spirit wrote: I had a fabulous time hiking the mountains of Washington, but dang, I'm starting to regret foregoing my annual trip to Tennessee and North Carolina now! Slouchfest is such a great way to give the finger to Pinktober! My boyfriend and I were just talking about those margaritas the other night. And your Thanksgiving sounds absolutely bodacious! So glad to hear you've reached 10 years. You give inspiration to those of us still on the climb. You've proven that a little (or a lot!) of debauchery is good for the body as well as the soul! I shall drink to your continued good health tonight with a chilled bottle of Gaelic Ale!",
      "MessageIndex": 9,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/794824",
      "Title": "Postcard from the edge of ten years out.... weesa lifelover"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 2, 2010 09:01AM - edited Feb 2, 2010 09:01AM by Celtic_Spirit I see my onc every six months, and I'm just shy of hitting my two-year mark.",
      "MessageIndex": 8,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747713",
      "Title": "Are You Sure? paml diana50"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 1, 2009 07:37PM Celtic_Spirit wrote: I will tell you what my best friend did for me. Every day, she listened to my fears. She gave me hugs when I was upset and a shoulder to cry on, and she made me laugh when my mood was lighter. She let me know if my behavior was erratic (the steroids made me crazy). She reached into the abyss and pulled me out numerous times when my faith faltered. She was my nightlight on the dark side of the moon and the calm and the rock in my very turbulent storm. She reminded me that the treatments and cancer would be over before long, and that I would have a normal life again. The two most important things she did was to assure me that she would be with me throughout the ordeal, no matter how long it took, and that she would not let me lose hope. I'm a very strong person, but I have no doubt that I couldn't have done this without her, or at least, come through it with my sanity intact. I owe her my life.",
      "MessageIndex": 10,
      "PostDate": "01/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/739580",
      "Title": "How do I help my friend? teresainidaho Celtic_Spirit"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 16, 2009 11:02AM - edited Nov 16, 2009 11:03AM by Celtic_Spirit Me, I wanted to know. Whether I had mets or not would have bearings on many of the decisions I would make. Do I keep contributing to my IRA, or do I work on my bucket list. Can I still plan to move back east in a few years, or do I stay where I am for the insurance. Do I need to start deciding on who gets various personal items. Should I take classes to update my skills, or is that a waste of time. You get the idea. I'm also the kind of person who hates limbo. Bad or good, I want to know where things stand. I don't like sailing on the River D'Nile. And I can tell you that the day my onc e-mailed with the good news was like getting a second lease on life. I consider Nov. 1, 2008, my second birthday!",
      "MessageIndex": 4,
      "PostDate": "16/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743960",
      "Title": "What would you do? Pure americanpinay"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 4, 2011 07:17PM Celtic_Spirit wrote: None of the ticky-tacky pink products I've seen in stores or catalogs say that a dime is going to research, xeloda, or anywhere else other than some CEO and his/her shareholders' pockets. In the meantime, every time I go to the store, get my mail, turn on the TV, or take a walk at work, I'm bombarded with an ocean of pink and teen-agers getting their rocks off by saying \"ta-tas\" and \"boobies\" under the shield of \"breast cancer awareness.\" Thank you, but I'm \"aware\" of breast cancer every time I take my shirt off, and I really do need to escape from that \"awareness\" now and then. It's what keeps me healthy. The majority of the bc research that I read about is funded by the NCI and the NIH, not Komen. Prior to having bc, it wasn't pink junk that reminded me to have a mammogram; it was my doctor and the memory of my mother dying from bc that prompted me to schedule an appointment.",
      "MessageIndex": 70,
      "PostDate": "04/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774174",
      "Title": "What to do about pinktober...yuch.. weesa Celtic_Spirit"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 4, 2011 03:22PM Celtic_Spirit wrote: I walk around campus every day at lunch as a means of getting some sun and exercise, clearing my mind, relieving stress, and getting away from it all. Today along my usual route, lo and behold, one of the sororities had a \"BC Awareness\" booth. Pink tablecloth...check! Pink balloons...check! Pink ribbons...Check!  Yelling \"Save the ta-tas\"...CHECK!! Aaack! I'm going into hiding. Someone let me know when it's November!",
      "MessageIndex": 59,
      "PostDate": "04/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774174",
      "Title": "What to do about pinktober...yuch.. weesa Celtic_Spirit"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 11, 2011 03:01PM Celtic_Spirit wrote: elmcity69 - Spot on! Kinda how many people complain about how Christmas has been commericalized and turned into a food and gift orgy.",
      "MessageIndex": 99,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774174",
      "Title": "What to do about pinktober...yuch.. weesa Celtic_Spirit"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 20, 2011 09:33PM Celtic_Spirit wrote: The cutesy Facebook awareness games really make my teeth hurt! Worse are the cutesy (and I find demeaning and trivializing) bumper sticker slogans such as \"Save the Ta Tas,\" \"I Love Boobies,\" and \"Large and small, let's save them all.\" If you haven't had bc or known someone with bc, it's all about \"saving boobies.\" When I found out I had bc, for me, it was all about saving my life, to hell with my boobies! I've always seen myself as being so much more than \"my parts,\" and if some of those parts are out to kill me, they're going to be whacked off and sent packing!",
      "MessageIndex": 29,
      "PostDate": "20/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774174",
      "Title": "What to do about pinktober...yuch.. weesa Celtic_Spirit"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 13, 2010 08:50AM Celtic_Spirit wrote: Melinda, I so agree with you! The grocery store I shop at always has pink ribbon-shaped mylar balloons during October. They're floating above the cash register with the birthday, new baby, happy anniversary, and Halloween balloons, which are all things we celebrate. Am I suppose to \"celebrate\" breast cancer? Really? I guess it's the context that makes me raise an eyebrow. I suppose some people buy them for a recently diagnosed friend, but I sure wouldn't find the presence of a pink ribbon balloon in my hospital room comforting...just a constant reminder of the sorry situation I was in.",
      "MessageIndex": 14,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/759281",
      "Title": "My pink problem Melinda41 daffodil45"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 13, 2010 12:43PM Celtic_Spirit wrote: One of these days, when I'm feeling especially naughty, and I see a group of pink-clad bc cheerleaders yelling \"Save the Ta Tas,\" I'm going to sidle up beside them and holler \"Save the Dickies! Support testicular cancer awareness.\" Any bets on how long before the police show up?",
      "MessageIndex": 27,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/759281",
      "Title": "My pink problem Melinda41 daffodil45"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Apr 8, 2009 12:32PM Celtic_Spirit wrote: KerryMac - I had my worst episodes of Cancer Demons during chemo. Between the steroids (which made me wild and wooly), the chemo side effects, and overall feeling crappy, it's just a prime time for the brain to go all irrational on you. I saw the Grim Reaper around every corner and just knew I was going to die before the end of summer. After chemo, my hair and my firm grip on reality returned. Life gets better. Hang in there! I just passed my one-year anniversary and had my six-month checkup with my onc today. She said she's very pleased with my progress, and everything checks out fine. So there you have it. I agree with the aggressive treatment theory. We 3ers don't really have the option to gamble (chemo/rads/tamox or not?) that some of the stage 1 ladies have. And some of them who opted out of treatment have lived to regret it. I think most of us 3ers throw everything we can at it. Sometimes that's not enough, but from what I see and hear, most of the time it is.",
      "MessageIndex": 39,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732075",
      "Title": "Am I stage II or Stage III jeanjean_chang nelia48"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 27, 2010 06:07PM Celtic_Spirit wrote: Apple - I was taking a lunchtime walk around campus one day while my hair was grey and about an inch long and I was still wearing my wig. The wig got caught on a tree twig and flipped off onto the ground in front of a whole lawn-full of college students. I was mortified, but I nonchalantly picked it up, stuck it on my head, and walked away casually to the nearest restroom so I could adjust it. Fortunately, I think most of the students were texting, so no one paid me any attention (or took a video of me and put it on YouTube. Gak!). So sorry, Jenn, about the hurtful comments. Like we really need anything extra to make us feel worse!",
      "MessageIndex": 24,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747460",
      "Title": "THAT STUNG.................. jenn3 jenn3"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 28, 2008 08:00PM Celtic_Spirit wrote: I think that thrush was the side effect I hated the most during the chemo (my onc said it was from the decadron). My mouth felt like a drain someone had just poured cold grease down. Yuk! I took nystatin for it, which wasn't too bad. It got stubborn about clearing up once, and my onc prescribed fluconazole. I took one tablet and decided thrush was better. Fluconazole made me feel like I had hot lava running through my digestive track.",
      "MessageIndex": 19,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723489",
      "Title": "Thrush...... Yuk! TripleNeg lemonld"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Apr 28, 2011 05:28PM Celtic_Spirit wrote: Where can I get an \"I love peckers\" bracelet that raises awareness about prostate and testicular cancers? What, they don't make them? Oh, that's right, men's cancers aren't sexualized and trivialized. I'm not a fan of the \"boobies\" campaign, either.",
      "MessageIndex": 16,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768271",
      "Title": "Since we all love a good rant Fitztwins WingsofHope"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 2, 2010 12:45PM Celtic_Spirit wrote: Take melatonin because it helps you to sleep, but don't expect it to kill cancer cells. I took it nightly for sleep issues for more than 10 years prior to my diagnosis. Obviously, it didn't kill cancer cells. It does help for sleep, though. ",
      "MessageIndex": 3,
      "PostDate": "02/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/746152",
      "Title": "Melatonin lionessdoe lionessdoe"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 13, 2008 04:43PM Celtic_Spirit wrote: Gosh, Janis, I'm glad to find someone else who didn't feel she had to announce her condition from the mountain tops! I've told only my closest friends and, at work, my boss and my best friend. I didn't want people at work whom I hardly know either kind-heartedly asking how I'm doing or trying to pry intimate details out of me. I didn't want to spend all day talking about cancer. Work gives me a sense of normalcy and, especially right after my diagnosis, it gave me something to think about other than cancer. I was fortunate to find a wig that looked almost exactly like my own hair style, and anyone who went on too long about how I lost weight (I was dieting pre-diagnosis, but a bilateral mastectomy does reduce one FAST in the chest region) gets the curt reply, \"Eat less, exercise more. No rocket science involved!\" LOL!",
      "MessageIndex": 8,
      "PostDate": "13/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722715",
      "Title": "people keep asking hezzy nixieschaos"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 26, 2011 11:18AM Celtic_Spirit wrote: My staging changed from diagnosis (stage I) to auxillary node dissection (stage II) to mastectomy (stage III). And neither my surgeon nor my oncologist talked much about staging; I figured that out from comparing the path report to information I found on the Web. I had multiple tumors and affected nodes on both sides, with the largest tumor in my left breast. When I asked my surgeon what stage I was, he said, \"Stage II on the right, stage III on the left.\" Okay, so does that make me a Stage II-and-a-half?",
      "MessageIndex": 8,
      "PostDate": "26/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763940",
      "Title": "Do I change Drs? Kimmom jenn3"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 17, 2010 09:53AM Celtic_Spirit wrote: My big Maine Coon cat usually sleeps by himself in the rocking chair. But during treatment, without fail, on nights when I was particularly depressed, upset or feeling sick, he would sleep on the bed next to me and purr me to sleep. My boyfriend and I still refer to him as \"the anesthesiologist\" since his presense and his purr helped me to sleep.",
      "MessageIndex": 2,
      "PostDate": "17/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/758148",
      "Title": "My cat and my BC Karen09 jenn3"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 1, 2010 09:41AM Celtic_Spirit wrote: What an inspiring video, Karen! Thanks for sharing your story. Luke is a gorgeous kitty. He must have been such a comfort. Glad you two found each other.",
      "MessageIndex": 15,
      "PostDate": "01/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/758148",
      "Title": "My cat and my BC Karen09 jenn3"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Apr 12, 2009 11:33AM Celtic_Spirit wrote: I wanted my ovaries removed for two reasons: 1) to decrease estrogen levels and 2) even though I'm BRCA1&2 negative, my mother died of bc and her sister of ovarian cancer, so there may be a genetic factor to my cancer. I'm 49, so I was pretty close to natural menopause. According to my onc, my body had received about all the benefits it was going to from the hormones and chemicals produced from my ovaries, so there was no big advantage to leaving the potential trouble-makers in there. And estrogen certainly hasn't been my friend lately. If I were younger, having my ovaries removed may have increased my chances for future heart problems, Parkinson's disease, etc. The best you can do is research the pros and cons of an oophorectomy and make your decision on what you're comfortable with. As for the oophorectomy itself, it was a rather trouble-free procedure for me. I had a mild level of pain for about four days. I was back at work in five days. I went hiking 12 days after the procedure. My hot flashes have intensified a little, but they're still quite tolerable. And I don't have to worry about getting ovarian cancer now.",
      "MessageIndex": 3,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732350",
      "Title": "Ovaries and all that stuff..... thisisme nobleanna007"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Aug 17, 2010 10:28PM Celtic_Spirit wrote: The chemo nurse was checking my bag of taxotere once when it was about 1/3 full. I joked about skipping the rest and going home early. He said, \"What's left in the bag is around $1200 worth.\" My jaw nearly hit the floor.",
      "MessageIndex": 6,
      "PostDate": "17/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756843",
      "Title": "Chemo \"Sticker Shock\"! Lynn1 LC815"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Apr 6, 2012 02:43PM Celtic_Spirit wrote: My team never said anything that made me want to scream, but during my oophorectomy, what they kept saying made me want to laugh! The day I had my ooph was apparently student doctor/nurse training day. My gynecological oncologist, who was doing the surgery, and the anesthesiologist both had student docs trailing them; the pre-op nurses and the recovery room nurses had student nurses at their sides. After the doctor/nurse did their \"hi, how are you, I'm nurse/doctor so and so,\" they'd show my chart to the student and say--each time, these very words--\"This patient is actually very healthy...except for having had cancer!\" I've always sworn that if I ever wrote a book about my cancer experience, I'd title it \"This patient is actually very healthy...except for having had cancer.\" Maybe it was the happy drugs they put in my IV, but I found it funny!",
      "MessageIndex": 20,
      "PostDate": "06/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785265",
      "Title": "What does/did your MO/RO/BS/PS say that made you want to scream? Momof2inME Wordwrangler"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 2, 2012 04:27PM Celtic_Spirit wrote: What a great post! I was around nine when the Monkees were popular, and I was fascinated with Davy Jones (I think I was too young for an \"official\" crush!). My first big-time crush was Jack Wild from H.R. Puff 'n' Stuff and Oliver. He died a few years ago of oral cancer. I credit Davy for inspiring my life-long obsession with Englishmen! I, too, feel like a piece of my childhood died with Davy. So sad...",
      "MessageIndex": 42,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783491",
      "Title": "Davy Jones of the Monkees CoolBreeze AnnieBear"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 3, 2012 10:31PM Celtic_Spirit wrote: voraciousreader - OMG, yes, Roger Daltrey! That mop of golden curls! Yep, back in the day, he did it for me! Despite having very little libido left, watching \"True Blood\" practically makes me go into HEAT! Bill and Eric and that hunky werewolf can get my juices to perculate just a bit! If I see any of them at Comic-Con this year, well, my libido just might come out of hibernation, lol!",
      "MessageIndex": 87,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783491",
      "Title": "Davy Jones of the Monkees CoolBreeze AnnieBear"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 27, 2010 02:40PM Celtic_Spirit wrote: I'm approaching three years of being cancer-free. I'm so sure that I'm going to live forever that, today, my boyfriend and I adopted two adorable, 5-month-old kitty brothers (to add to the three cats we already have. LOL!). They're ginger tabbies. My last ginger tabby, Toby, died at age 17 a week after I was diagnosed in February 2008. That was rough.",
      "MessageIndex": 13,
      "PostDate": "27/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762518",
      "Title": "Sick of the bickering..on to something good! Bugs kimber3006"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 2, 2009 09:06AM Celtic_Spirit wrote: I had 6 infusions of TAC chemo prior to radiation. I breezed through it. I began taking Tamoxifen a week prior to rads. I had 25 rads with 5 boosts over a 6-week period. I didn't start feeling tired until the end of week four. Then I learned what fatigue was all about! I was fatigued for about 5-6 weeks. I was able to take 2 weeks off work at Christmas (fortunately), and during the first week, I slept or rested most of the week. By the second week off, my energy level was returning to normal, and I was up and about, taking long walks and hiking again. I've felt great ever since. During the 5-6 weeks of radiation fatigue, I also received a Zometa infusion, had a staph infection, and sinus drainage, so I'm sure these caused me to feel even more run down.",
      "MessageIndex": 3,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730002",
      "Title": "RADIATION FATIGUE - POLL bluejay1 Siciliana"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 15, 2008 04:47PM Celtic_Spirit wrote: I breezed through a bilateral mastectomy and 6 rounds of TAC. Thirty rads sessions knocked me off my feet. I'm usually a powerhouse of energy, but I live in bed now. I didn't know it was possible to feel this tired.",
      "MessageIndex": 6,
      "PostDate": "15/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725935",
      "Title": "Please, please tell me if this is to be expected. HeatherBLocklear TenderIsOurMight"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 7, 2009 12:37PM Celtic_Spirit wrote: Hi, debisongbird, I finished radiation about 6 weeks ago now, and I had it in all the places you mentioned but on both the left and right sides. My radiation onc said I might lose some lung capacity, but it wouldn't be noticible and wouldn't interfere with my ability to hike and long-distance bicycle. She didn't think it would damage my heart at all. About a week after the completion of radiation, I had an echocardiagram (due to having a staph infection, not radiation), and the cardialogist said my heart was fine.  Now that I'm recovering from the fatigue (I'll get to that later), I'm back to hiking and haven't suffered any shortness of breath. My radiation onc did say that, in the future, if I get a chest xray to mention to the radiologist that I've had radiation because some scarring will show up on the xray. I came through fine with no signs of lymphedema. Fatigue...boy, howdy, for the first time in my life I knew what it felt like to be tired! I've always been the Energizer Bunny, even at age 49, but I became more like a hibernating bear for about a month. I still managed to go to work and run errands during radiation, but not much else. However, the natural fatigue from radiation, for me, was probably worsened by having an infected portacath (ergo, the staph infection), starting Tamoxifen, receiving my first infusion of Zometa, and sinus drainage. But I'm back to bouncing off the walls again! LOL! Skin care...I mixed pure aloe vera gel with Aquafor and used that in the morning; after receiving radiation, I put on pure aloe vera gel; then I rubbed in emu oil at bedtime. I had painful burns under my arms for about a week; chest didn't burn much, but I did peel in those places. I'm fair-skinned, and my redness is almost gone. I continue to use emu oil to keep the radiated skin soft. My skin never \"broke down\" and got oozy. Hope that helps!",
      "MessageIndex": 3,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/726954",
      "Title": "2 or 3 questions? debisongbird pip57"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 3, 2008 10:17AM Celtic_Spirit wrote: Hi! I've been lurking here for a while, but this post prompted me to sign up. During my darkest time, when I felt sure I was going to die from breast cancer (post-stage IIIa diagnosis and in the middle of chemo), my boyfriend's 85-year-old mother told me this story about her sister, Evelyn. Evelyn was diagnosed in the early 1970s, at age 49 (my age) with what was probably stage III cancer. She had a large lump and lots of positive nodes. Evelyn had a radical mastectomy and...nothing else. No chemo, no rads, no tamoxifan, no alternative therapies, etc. Evelyn is now in her early 80s. She's had some health problems, like all people in their 80s (pericarditis, arthritis), but her breast cancer never returned. I have met Evelyn on several occasions, and I can tell you she is robust and overall in good shape for a lady of her years. For those of you who have seen \"Fried Green Tomatoes,\" remember how Kathy Bates' character used \"Towanda\" as her battle cry? Well, \"Evelyn\" is my breast cancer battle cry. This story lifted me out of my BC depression and continues to inspire me. I hope it helps you, too.",
      "MessageIndex": 6,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/722217",
      "Title": "Help welcome AllyDub marianleah"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 28, 2009 02:26PM Celtic_Spirit wrote: When I was sweating the statistics back in the summer of 2008, my best friend, who's a nurse, said, \"You're lumped in with the 85-year-olds, the alcoholics, the morbidly obese, the smokers, the diabetics, the malingerers, the women with more aggressive forms of bc, and those in poor health to start with. They don't have a separate category for you.\" That became a mantra I repeated over and over when I felt scared. Having worked in academic publishing, I can tell you that an article or report that is printed today was submitted 6-24 months ago. The writers spent at least six months to a year compiling the data and writing it up. Before that, they spent 5-10 years following the test subjects. So we're talking about treatments and technologies that were used, at a minimum, six years ago, and more likely eight. During my first meeting with my onc, she said that I had a 30% chance that the cancer would recur in five years, and that was using the numbers from the low end of the scale. That was before she prescribed me zometa, before I began taking Vitamin D3, before she knew how much I exercised (3-5 hrs. a week can cut your recurrence numbers in half), and before my oophorectomy. I'm betting my worst-case recurrence rate is down to about 10% now. Something else to consider: some people are not compliant with treatment. In an article on the Susan G. Komen for the Cure site, 37% of women taking tamoxifen are non-compliant (here's the link: http://ww5.komen.org/ExternalNewsArticle.aspx?newsID=42817). I imagine the same is true for those taking AIs. Those folks are also lumped into the general statistics.",
      "MessageIndex": 37,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/742910",
      "Title": "Why do you love and hate the statistics? JudyO PatMom"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 16, 2009 12:23PM Celtic_Spirit wrote: I'm in the San Diego area.",
      "MessageIndex": 2,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745481",
      "Title": "Anyone else in So.California? Mom3 worry0ct9"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 7, 2011 07:55PM Celtic_Spirit wrote: I'm so glad for you! It sounds like your mind is in a good place.",
      "MessageIndex": 2,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774380",
      "Title": "My Breasts finally past the finish line!!!!!!!! faithfulheart faithfulheart"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 12, 2011 07:23PM Celtic_Spirit wrote: Thanks, Otter! I hope it goes down just as you described!",
      "MessageIndex": 20,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/771466",
      "Title": "Breast prosthesis & airport security 15yrscounting mthomp2020"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 12, 2011 06:37PM Celtic_Spirit wrote: I'll be flying out of San Diego International...the infamous \"Don't touch my junk\" airport...next Monday. I'm going to wear my prosthesis and refuse the scan, because what they'll see on there will just lead to a pat down anyway. I'll be flying back from Knoxville, TN, and they just got a new scanner, and I'm sure they'll be wanting to try it out on everyone. Again, I plan to insist on a pat down in a private area with a female TSA agent. I'll post my experience on the \"Outraged by TSA\" thread. Keep your fingers crossed for me!",
      "MessageIndex": 18,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/771466",
      "Title": "Breast prosthesis & airport security 15yrscounting mthomp2020"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "May 6, 2012 01:31PM Celtic_Spirit wrote: I remember the first time an Irish friend of mine told me that he and some friends went to the pub and got pissed. I asked him what they got mad about! \"Pissed\" is one of their terms for getting drunk! I was once riding an elevator in a building in Knoxville, TN, that housed a lot of arts and cultural organizations. When I noticed a flyer advertising the Smoky Mountain Shag Dancers, I nearly choked! Between spending time in British countries and watching \"Blackadder,\" I've developed quite an array of colorful terms to use on irritating locals. When a \"tosser\" gets on my nerves, I tell him/her to \"sod off\" and stop talking a load of \"bollocks.\" He he!",
      "MessageIndex": 101,
      "PostDate": "06/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786827",
      "Title": "Just Need to Wank sbelizabeth autism_mom"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 7, 2009 11:50PM Celtic_Spirit wrote: Thanks for the info! I'm extra glad that I pestered my onc into prescribing Zometa for me. I just had my third infusion yesterday. No side effects afterwards - ate a lunch that would choke a horse and then went Christmas shopping!",
      "MessageIndex": 4,
      "PostDate": "07/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745052",
      "Title": "Interesting News Pure Gitane"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 10, 2009 11:41AM Celtic_Spirit wrote: While I enjoyed meeting and talking with the other patients in the chemo room, when I learned that some of them were there due to a recurrence, it did make my confidence plunge a little. (Not all were breast cancer patients, btw.) I wouldn't put too much into what your nurse said. She was probably just making conversation. I must say, the chemo nurses at Kaiser did a bang-up job of keeping things light and positive. I really expected the chemo room to be one-step up from the morgue on the depressing scale, but it wasn't. The nurses were very professional but had great senses of humor. Most of the patients, too, had very positive outlooks and were very encouraging in their words to me. All in all, not a bad experience, but not one I hope to repeat.",
      "MessageIndex": 6,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743618",
      "Title": "Loosing it... Pure Gitane"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 10, 2009 03:21PM Celtic_Spirit wrote: I second what cbm said about steroids. Decadron was like an amplifier for every fear, every negative notion I had. My irrational mind had a field day. I'm usually...well, let's just say I've been accused of being Mr. Spock-like a time or two. Not on Decadron! I could read a death-sentence into every comment and every raised eyebrow. Like DCMom, my chemo days were more like going to a salon. It was three days after that the trouble began due to the steroids. Before each infusion, I would tell my boyfriend and my best friend to put on their catchers mitts and get out the butterfly nets because I was going to be wild and woolly and out of my mind. My poor boyfriend would come home from work and find me blubbering over that Sarah McLachlan Humane Society ad or CSI or just about anything. Take a friend or take a book to the chemo room with you. Have some kind of distraction. And know that it's perfectly normal to be hyperemotional right now and assume the worst. It goes with the territory.",
      "MessageIndex": 14,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743618",
      "Title": "Loosing it... Pure Gitane"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 10, 2009 10:24PM Celtic_Spirit wrote: Although I didn't find the chemo room that unpleasant, I nevertheless didn't want to revisit it, even mentally. However, it seemed like in just about every episode of House last year, someone was getting chemo. So much for escapism!",
      "MessageIndex": 25,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743618",
      "Title": "Loosing it... Pure Gitane"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Aug 9, 2012 01:42PM Celtic_Spirit wrote: Wow...some of your stories. And people wonder why I feel my best when I'm off by myself in the mountains.",
      "MessageIndex": 12,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791773",
      "Title": "I know there's a \"stupid things people say to you\" thread but lanagraves sbelizabeth"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Aug 9, 2012 08:09AM Celtic_Spirit wrote: You are far more tolerant than I. I would have slapped her into next week after question #1. That's one of the reasons I chose to wear a wig throughout treatment. I knew my shiny, bald head would act as an idiot magnet, and I don't suffer fools well even when I'm feeling good. Ugh! I'm sorry you had to deal with such a whacka-doodle. I really wonder if some people are missing the wiring between their primitive brains and their mouths!",
      "MessageIndex": 1,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791773",
      "Title": "I know there's a \"stupid things people say to you\" thread but lanagraves sbelizabeth"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 7, 2010 10:16PM Celtic_Spirit wrote: My doctor told me to where it as long as I felt I needed it. I think I wore in on and off for a month. It helped with the pain.",
      "MessageIndex": 5,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/759053",
      "Title": "How long do I really need to keep wearing a surgical bra? surfette mawhinney"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 18, 2008 11:44AM Celtic_Spirit wrote: I talked to my onc during chemo about diet (being that I'm ER/PR+). She dispelled a lot of myths about soy sauce, sugar, alcohol, etc. Boiled down, I can eat/drink about anything in moderation, which is what I did pre-cancer. Weight loss (if you're obese) after diagnosis can be a good thing, esp. if you're post-menopausal or have had axillary node surgery and are at risk of lymphedema.",
      "MessageIndex": 1,
      "PostDate": "18/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/724654",
      "Title": "Feer of Food roxy42 SpunkyGirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Apr 22, 2014 01:19PM Celtic_Spirit wrote: I've been wearing them for the past six years and feel totally comfortable in them. I exercise in them and occasionally take a nap in them (I do take them off at night). Mine are made by Amoena. They pretty much conform to my chest; once in a while, they'll feel a little hard, but that may have more to do with the bra I'm wearing that day. I live in a hot climate and don't find that they make me uncomfortable; in fact, my natural breasts were large and uncomfortable, and in the summer I got rashes beneath them and lots of sweat. These are a breeze compared to my real breasts!",
      "MessageIndex": 6,
      "PostDate": "22/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/820398",
      "Title": "What does it feel like to wear breast forms? jkbrca2 bluepearl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jul 12, 2011 08:31AM Celtic_Spirit wrote: I'm kinda like a shark...if I stop moving, I'll die. That's just me, and it's how I've always been. I think I'm more active post-cancer because I don't have my awful Dolly Parton-size boobs weighing me down anymore! That said, I have no trouble being still for a few hours while drinking a Guinness at a nice pub on the main drag of a small, North Carolina town with the pub's most excellent proprietress!",
      "MessageIndex": 5,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/771501",
      "Title": "I'm fially coming out of the closet as a slouch. weesa faithfulheart"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jul 12, 2011 11:30AM Celtic_Spirit wrote: Weesa - I'm hoping to head your way in mid-October. We will DEFINITELY knock down a few and eat lots of naughty food!",
      "MessageIndex": 10,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/771501",
      "Title": "I'm fially coming out of the closet as a slouch. weesa faithfulheart"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 22, 2009 08:49PM Celtic_Spirit wrote: Through the bc volunteers at my hospital, I received a free heart-shaped pillow and a small rectangular pillow prior to surgery that were made by a local sewing circle. The heart pillow was a life-saver following my axillary surgery. I put the rectangular pillow between my seatbelt and my chest for months after my mastectomy. Thanks, choca, for offering these. I found the ones I received very comforting.",
      "MessageIndex": 4,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742617",
      "Title": "Heart-Shaped Pillows choca1711 SLL101984"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 8, 2009 02:12PM Celtic_Spirit wrote: As I've said numerous times, the two women I've known who had recurrences were vegetarians. I didn't eat a lot of meat prior to breast cancer. I ate lots of fiber, fruit, and vegetables. I took gobs of supplements. While it's kept me very healthy, it didn't prevent cancer. For many years, I even cooked out of a book called The Doctor's Anti-Breast Cancer Diet: How the Right Foods Can Reduce Your Risk of Breast Cancer. Yeah, that worked. On the other hand, my boyfriend's aunt Evelyn - a 30+ year stage III bc survivor - eats diner food several times a week. She never met a French fry she didn't like, and she's in pretty good shape for an 80-something lady. So my vote is, eat what you want in moderation. And that includes the occasional steak and ice cream!",
      "MessageIndex": 4,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745091",
      "Title": "MMMMM Meat Shanagirl Shanagirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jul 14, 2011 06:07PM Celtic_Spirit wrote: Just finished a rousing game of racquetball and now could stand to do some slouching, preferably with some good pub grub and a cold IPA. What time should I meet you in downtown Hooterville, Weesa?",
      "MessageIndex": 46,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/771501",
      "Title": "I'm fially coming out of the closet as a slouch. weesa faithfulheart"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jul 26, 2011 07:49PM Celtic_Spirit wrote: I work at a large West Coast university, and I worked throughout my six rounds of TAC (every three weeks over a 3.5 month period). I had my infusions on Fridays and went back to work the following Monday. After infusions #5 & 6, I also took the following Mondays off. I had scads of leave time, so why not? I also worked through six weeks of radiation, though I got pretty fatigued during the last two weeks. I remained active throughout chemo, taking 1/2-hour walks every day at lunch and moderate hikes on the weekends. I went out to eat, shopped, did housework, etc. I had a high level of fitness prior to chemo, which may have helped. I also fasted before my first two chemos, and in all fairness, I have a desk job with little public contact and no coworker drama. It was very important to me to maintain as much normality as I could, and going to work helped me to do that. It also kept my mind out of Cancerland.",
      "MessageIndex": 46,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771494",
      "Title": "Poll: How many ladies worked through Chemo? Chrys23 Chrys23"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 8, 2009 07:12PM Celtic_Spirit wrote: Initially, I stopped eating most meats because I have a lot of problems with how our \"meat\" is raised and treated. By consuming it, I felt like I was aiding and abetting factory farms and slaughterhouses. Later, I continued to go light on meat because I learned that it really isn't that great for us, and it also makes me feel sluggish. When I do buy it, I usually eat fish or free-range chicken and turkey. I'm really quite happy with a bowl of basil tomato soup and asiago cheese bread. Yum!",
      "MessageIndex": 14,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745091",
      "Title": "MMMMM Meat Shanagirl Shanagirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jul 16, 2011 08:24AM Celtic_Spirit wrote: Those are some pretty exotic sounding concoctions, Weesa, but I'm wondering if you know how to make MY specialty drinks? How about the BMX Collins or the Hot Flash? Do you have the ingredients for Foobies on the Rocks or the Taxol Sunrise or maybe an Arimidex Sour?",
      "MessageIndex": 68,
      "PostDate": "16/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/771501",
      "Title": "I'm fially coming out of the closet as a slouch. weesa faithfulheart"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Aug 12, 2011 09:32AM Celtic_Spirit wrote: Weesa - I met you and I still like you!",
      "MessageIndex": 125,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/771501",
      "Title": "I'm fially coming out of the closet as a slouch. weesa faithfulheart"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jul 8, 2010 10:16PM Celtic_Spirit wrote: My radiation facility had machine breakdowns twice during my 30 treatments...once during the regular rads, once during boosts. Five is a lot! How frustrating.",
      "MessageIndex": 5,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/755076",
      "Title": "Rads Machines breakdown? Dilly Celtic_Spirit"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 3, 2010 02:49PM Celtic_Spirit wrote: I was given zofran and emend, and I believe the steroid (decadron) helps to prevent nausea, too. I never felt nauseated...not even slightly.",
      "MessageIndex": 17,
      "PostDate": "03/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747742",
      "Title": "First Chemo Experience Bad mimiof4 clariceak"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 22, 2010 06:20PM Celtic_Spirit wrote: I'm sorry for your loss. Losing a parent, even one we're not close to, seems to leave a hole in our souls.",
      "MessageIndex": 25,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747133",
      "Title": "My Dad Passed Away Yesterday Shanagirl Frankie_"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 28, 2011 09:40PM Celtic_Spirit wrote: I rebounded pretty quickly, but I've always been high energy. Two months after radiation, I was hiking and bicycling again. But it's quite normal to take much longer. If your onc isn't worried, you're probably fine. The fact that you are walking and exercising is definitely a good sign. During treatment, I watched a lot of TV and movies to escape. One of my favorite shows is \"House,\" and it seemed like on every episode, someone had cancer or was getting chemo! Made me crazy.",
      "MessageIndex": 2,
      "PostDate": "28/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765572",
      "Title": "So Many Questions about Recovery peverson pupfoster1"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 6, 2008 11:28AM Celtic_Spirit wrote: Hello again, Texas, My fingernails have always been flimsy and break easy. One good side effect of chemo was they became extremely strong! However, now, almost two months post-chemo, they are starting to break easily again. My fingernails and nailbeds survived six treatments of TAC just fine. You may notice \"growth rings,\" as my onc called them...slightly white, raised lines showing growth spurts of your nails. They aren't very noticeable. After treatment #6, I had some redness under several nails, and there's still some tenderness when I squeeze hard on something. I didn't loose any fingernails, though. I did have both big toe nails die (I guess that's the right term?). They turned white and are growing out now. While the nail bed was sloughing them off, I kept my feet very clean and put neosporin under the nails so they wouldn't become infected.",
      "MessageIndex": 6,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723974",
      "Title": "Finger/fingernail problems? How common? Texas357 Texas357"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 8, 2010 09:24AM - edited Jan 8, 2010 09:28AM by Celtic_Spirit I find that pretty tacky and offensive. To put \"breast cancer\" and \"game\" in the same sentence is about the most clueless thing I've ever heard. It does sound like something someone would come up with who's never had bc.",
      "MessageIndex": 9,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746451",
      "Title": "Hiding over here while the rocks fly my way... Running_Violet kim40"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Aug 7, 2012 12:49PM Celtic_Spirit wrote: My oncologist is a very kind and positive person. Had I asked for a referral to a support group, I'm sure she would have given me one. But I'm not a support group type of gal...I find that hysteria feeds into hysteria, and I didn't need anyone else ramping me up even more. The decadron did a stellar job of that on its own. My onc didn't hesitate when I asked her for some xanax, though, and that certainly helped me cope! I was treated through my HMO. I realized even then that my doctors and nurses barely had time to treat the disease, let alone address any personal crises I was having. They see so many patients each day, and many of them, I'm sure, were in far more distress than I was. I'm wagering a guess here, but I bet that, to some degree, they do see us as a particular disease/cancer. Oncologists and surgeons are trained to fight that disease. Psychologists are taught to treat the psyche. Just recently, during a routine appointment, I asked my gynecological oncologist about a patch of dry skin I had, and I might as well have asked him to explain nuclear fusion! Just not his area. So if you are in need of counseling or a support group, speak up! Or, if you have difficulty doing that, is there someone--a friend, a spouse, a relative--who could act as your patient advocate? As far as what I did to cope (other than xanax), I shared my fears with my closest friends and my boyfriend, took long walks and hikes, kept busy, and always kept sight of my goals. I told myself daily this was only a short chapter in my life, and everyone has these dark chapters, and things would be back to normal (at least close to normal) before long. And that's exactly how everything played out.",
      "MessageIndex": 1,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791685",
      "Title": "Disappointed with Care Team sbelizabeth sbelizabeth"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 6, 2008 02:36PM Celtic_Spirit wrote: I've had very little \"scent\" in my armpits since surgery. But just in case, I use Toms of Maine.",
      "MessageIndex": 8,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/722191",
      "Title": "deodorant lafera12 mariek56"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "May 9, 2011 01:45PM Celtic_Spirit wrote: I worked throughout my six weeks of radiation, which ran from mid-October 2008 to Thanksgiving. I'm a desk jockey in an isolated office, so I didn't have the stress of office politics to deal with or physical considerations. The radiation facility was half-way between work and home, so I stopped in on my way home from work. I felt pretty good for the first four weeks of rads; then the fatigue set in. My skin was also getting rather crispy around this time. After rads each day, I went home and slept. I had some vacation time to use up (or lose) by the end of the year, so I took two weeks off around Christmas. I slept the entire first week. Then I started getting my energy back. By New Year's Day, I was hiking in the mountains. The two weeks I spent taking it easy may have prevented the long-term fatigue that a lot of ladies suffer from. I've been high energy ever since.",
      "MessageIndex": 18,
      "PostDate": "09/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/768637",
      "Title": "Working Through Radiation? Katarina pat01"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 3, 2008 09:16AM Celtic_Spirit wrote: I was your children's age when my mother had breast cancer during the 1960s. That was during the era when children were excluded from \"adult\" conversations. I have mixed feelings about that. I knew my mother was sick. I knew she had cancer. I had no idea it was terminal. I knew about death, as my father had died of a brain tumor when I was six. However, day-to-day life was pretty normal and happy for me, perhaps because I wasn't burdened with all the details. My mother was admitted to the hospital for the last time in December 1969. A week before she died, my aunt told me the whole truth...that my mom's cancer had gotten worse, that it had spread elsewhere in her body, and that she was dying. I felt like I had been hit by a truck. I suddenly had visions of myself as Oliver Twist, which as it turned out wasn't too far from the truth, but that's another story. I alternated between feeling terrified and being numb. Now that I'm an adult with breast cancer myself, I wish I had more information about my mother's cancer (all of my aunts, uncles, and mother's friends have also passed - no one left to ask). I can't remember if she had her hysterectomy before or after the cancer or why. I don't know if she had lymph nodes involved. I'm not sure where her cancer metastasized to. She was diagnosed before the days of chemotherapy and hormonals and only received surgery and a crude form of radiation that absolutely tore up her chest. Every morning when I take my tamoxifen, I think of her...if she had been ER+, would that little pill have kept her alive long enough to see me grow up, graduate from college, become a published writer, etc.? So many questions, so few answers. When my oncologist e-mailed me last weekend to say that my CT scan results came back NED, I thought of my mother first. I think I could hear her sigh of relief all the way from the Other World. You know your children's level of sophistication better than anyone. A lot, too, can depend on the support structure of friends, family, and the community you live in. I've had almost 40 years to ponder my mother's breast cancer and how it affected my life during her illness and after her death, and I still don't have any firm conclusions...except, perhaps, that I wish she had had access to the medical advances available to me during my treatment. I wish you the best of luck with your decision.",
      "MessageIndex": 7,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723811",
      "Title": "To Tell Or Not To Tell KellyC KellyC"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Apr 11, 2012 09:05AM - edited Apr 11, 2012 09:06AM by Celtic_Spirit I completely agree with ICanDoThis. And let me add that the side effects from treatment of Stage IV cancer would make tamoxifen feel like a walk in the park. Take the tamoxifen. I took it for two years before switching to Arimidex. I'd much rather gain some weight and ache than be dead.",
      "MessageIndex": 4,
      "PostDate": "11/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/785635",
      "Title": "Tamoxifen dlm217 sweetbean"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 17, 2009 05:31PM Celtic_Spirit wrote: I can sympathize. My hair was 18-inches long when I started chemo, and I never felt short hair looked good on me. I wore a wig throughout my \"bald period\" that looked very much like my natural hair. I've never liked to wear hats or other things on my head, so I worried that I wouldn't adjust, but you'd be surprized how quickly you get use to it. This time last year, I looked like Uncle Fester. I'm one year post-chemo now, and I have a cute hair style (think Meg Ryan in French Kiss) that I actually like. A lot of people, esp. men, think that I look younger now. Woo hoo! Change can be good for us, even if the change wasn't our idea. Losing your hair can be pretty traumatic at first. You do get use to it, and the time really does go fast.",
      "MessageIndex": 7,
      "PostDate": "17/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740534",
      "Title": "Hair is leaving the building.... victoriasecret victoriasecret"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 12, 2011 10:11PM - edited Jan 12, 2011 10:13PM by Celtic_Spirit I live in a town where the average driver is 20 years old, driving under the influence, and yapping on a cell phone. Frankly, I think my chance of dying at the hands of one of those nutters is far, far greater than dying of breast cancer. Maybe that's why I'm at peace with my diagnosis and my stats. If that scenario doesn't cause my demise, tripping over one of these kittens running under my legs will probably do the job. Other than that, I plan to live forever!",
      "MessageIndex": 63,
      "PostDate": "12/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763208",
      "Title": "Never hearing the word Cured!!!! faithfulheart jennifer1"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 22, 2010 01:28PM Celtic_Spirit wrote: Because my swelling is slight, I don't wear the garments daily and and when I do, it's rarely without long sleeves. On the few occasions that I have (right after diagnosis) and people have commented, I've found that telling them that it's an old Civil War injury, I hurt myself wresting gators, or I got my arm caught in the door of a UFO has done wonders to deter future questions.",
      "MessageIndex": 24,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/747129",
      "Title": "Feeling a little Depressed...Mild Le. lexislove Suzybelle"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 12, 2012 12:18PM - edited Jan 12, 2012 12:20PM by Celtic_Spirit I'll admit to not feeling a lot of sympathy for Christina Applegate and her DCIS while I was watching TV in the chemo room, bald headed, constipated, whacked out on decadron and facing radiation in the near future. I wanted to reach through the TV, tap her on the shoulder, and offer to trade her \"battle\" for mine. And no, I don't feel bad for feeling this way. We feel what we feel.",
      "MessageIndex": 29,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/780849",
      "Title": "Why am I only ok talking to stage III ladies?feeling like a jerk Josiekat lkc"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "May 3, 2012 09:12AM - edited May 3, 2012 09:13AM by Celtic_Spirit Yeh, that title caught my eye, too! I'm not a Brit, but I've spent enough time there and in New Zealand to know the \"other\" meaning of that word! And I've been known to refer to obnoxious people locally as \"wankers\" because they haven't a clue that they've just been insulted! To answer your question, whether people see you as a \"huge ball of breast cancer\" depends a lot on you. If you talk about it, if you go without a wig, then people are going to feel free to quiz you. I didn't want to be \"cancer girl,\" so I kept the circle very small and wore a wig. I did tell my dentist and hygienist about my bc because I needed to let them know I was on Zometa.Fortunately, their reaction was akin to someone telling them they had a sprained ankle, and no big deal was made. BTW, if you're ever in England and someone tells you that a pub has \"good crack,\" they're not telling you where to get drugs. \"Crack\" means good conversation, good beer, good all-around atmosphere. I had a friend from England who was a smoker who came to visit a while back. I told him not to go into the neighborhood convenience store and ask for \"fags,\" especially since there was a gay bar just around the corner!",
      "MessageIndex": 51,
      "PostDate": "03/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786827",
      "Title": "Just Need to Wank sbelizabeth autism_mom"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 16, 2009 02:24PM - edited Feb 16, 2009 02:24PM by Celtic_Spirit I purposely have not told a lot of people about my condition, esp. here at work. While I work with some very kind, sensitive people, there is the knuckle-dragger element who say stupid things and, I'm sure, would be waiting for me to grow a third eye on my forehead or something. Their interest in my condition would only go so far as having something to gossip about. I don't suffer fools gladly, so for everyone's benefit, I kept the number of people \"in the know\" to a minimum. You have what is known as HIPAA rights...your employer, coworkers, etc. have no right to your personal, medical information. You are under no obligation to share your health information with anyone. For me, I found this to be a blessing.",
      "MessageIndex": 3,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729165",
      "Title": "Stupid Comments About Upcoming Mastectomy Shanagirl Kitt09"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 23, 2009 01:04PM Celtic_Spirit wrote: I really like my oncologist (Dr. D) both as a doctor and a person. The treatment plan she developed for me has been spot on, and I don't think I would have received better care or more advanced treatment if I went to M.D. Anderson. During chemo, I met with her every three weeks, two days before my infusion. During this visit, she would check me out physically, record side effects, put in prescription orders, and thoroughly answer every question I had (usually around two notebook pages worth), even though I'm sure I made her late for her next appointment. And she ends every appointment by giving her patient a hug. She is always available via e-mail for advice, questions, etc., and when I had a staph infection from my chemo port, she called me from her home on her day off. Her style is to be honest, but I think she handles tough questions very diplomatically. Dr. D was very focused and serious during our first meeting. When I later thought about it, I can understand why. Oncologists have to deliver some of the worst news to some of the most vulnerable patients. I'm sure some patients come unglued, are angry, pass out, etc. They never know what to expect when they meet that patient for the first time. Dr. D learned early on that I wasn't the type to wig out on her and that although I lost my boobs, I didn't lose my sense of humor (and yes, I have a bent for gallows humor). She actually has a marvellous sense of humor herself, and we enjoy joking around with each other.",
      "MessageIndex": 6,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731187",
      "Title": "patient-doctor relationship: your thoughts and experiences paige-allyson KerryMac"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 24, 2009 12:52PM Celtic_Spirit wrote: Paige, our diagnoses are very similar, and we're both the same age. My onc said that my risk for recurrence was \"medium,\" and I had more positive nodes than you. Everyone is different, of course, but I can't imagine why your situation would be considered worse. I also can't imagine that anyone with cancer wouldn't be \"anxious.\" Seems like that goes with the territory, no? I don't know if you've explored any of the \"extra\" things you can do to lessen your chance of recurrence, such as taking vitamin D-3, Zometa, and exercise. We had a good thread on this forum not long ago about Zometa; you may want to have a read when you get a chance. Cora - I know what you mean about separation anxiety with your onc. Believe me, I was one happy camper when chemo was over, but not seeing my onc every three weeks made me jittery. One of the things that I like to much about her is that she made me feel safe. As corny as it sounds, she was the rock I clung to during my cancer storm...someone strong, someone with the answers, someone who could fix every bad side effect and give me a pep talk every three weeks. I'm fine now, but it is reassuring knowing that she's just an e-mail away. ",
      "MessageIndex": 16,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/731187",
      "Title": "patient-doctor relationship: your thoughts and experiences paige-allyson KerryMac"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jul 23, 2012 06:16PM Celtic_Spirit wrote: My mastectomy bra fitter is a Stage IIIC survivor of eight years. She and I have the same oncologist. She told me last year (year seven for her) that our oncologist \"set her free.\" Basically, she is considered a closed case and would see our oncologist only if something came up. Our oncologist told me I would see her twice a year for five years. Unless something comes up, I expect to see her only a couple more times.",
      "MessageIndex": 1,
      "PostDate": "23/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/790995",
      "Title": "Will I ever be appt. free? ck55 overjoyed4life"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 8, 2009 04:10PM Celtic_Spirit wrote: That getting the port out in the doctor's office while wide awake under local is a trip, huh? Hurts like a *%#$@! Mine became infected last November, right around Thanksgiving. I developed a staph infection, and almost ever doctor in the hospital called me, from the head of internal medicine to the infectuous disease specialist. My onc called me from her house on her day off to tell me the horrible things that a staph infection could do. Lovely. If you ever want to hear from a doctor, just say you have a chemo port and a fever. That gets 'em real excited. I had to have an echocardiagram and near daily blood cultures and panels over a two-week period. However, mine was a walk in the park compared to yours. Glad you're okay and the problem was resolved quickly.",
      "MessageIndex": 15,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728700",
      "Title": "Another bump in the road (Sorry it's a long one) anitach sydpen2"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 21, 2009 01:46PM Celtic_Spirit wrote: I had bilat. mast. and 6 weeks of rads. My onc said it would lessen my chances of a recurrence by 10-15%. Studies have found that radiation therapy not only helps prevent local recurrences, but increases overall survival; thus, it seems to play some role in preventing distant metastasis. I never, ever, want to look back and say, \"If only I had done (radiation, chemo, etc.), I wouldn't have had this recurrence.\" Who knows, it may come back some day, but it won't be for lack of effort, and I can be at peace with that.",
      "MessageIndex": 10,
      "PostDate": "21/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/727714",
      "Title": "What % would make you do it? Estepp Scrappygrl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 30, 2009 03:36PM Celtic_Spirit wrote: Well, here's one of the 101: bone island. I'm counting on the rest of you to come up with the other 100.",
      "MessageIndex": 6,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728242",
      "Title": "Just Heard That Dreaded Phrase.. WellWater WellWater"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 13, 2010 08:48PM Celtic_Spirit wrote: I really haven't put a dog in this fight 'til now. So here's my mini rant. I come here to relax, to learn, and to socialize. Life throws enough drama my way without me looking for more. I'm finding that our usually friendly, accepting, laid-back forum is turning divisive and territorial. I feel like participating here will now involve typing on eggshells, and really, I don't need the stress. In the nonvirtual world when people get tired, they go on vacation. So I'm taking a break from BCO. See you when the sun comes out again.",
      "MessageIndex": 114,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748156",
      "Title": "RESPECTING the STAGE threads **RANT** cherneski Nico1012"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Apr 30, 2009 11:17PM Celtic_Spirit wrote: Looking good! I bet it feels great when you run. Mine is just a little longer. I'm waiting for it to grow another inch or so, then I'll get it dyed back to light brown and hopefully get a cut something like Ellen Degeneres has.",
      "MessageIndex": 10,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/733424",
      "Title": "status report and hair pic everyminute KerryMac"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 1, 2011 09:50PM Celtic_Spirit wrote: Okay, here's two stories that got me through some dark days: * Writer Susan Sontag was diagnosed with breast cancer in the mid-1970s at age 42. She had 31 positive nodes. Her doctors at Sloan-Kettering said she had virtually no hope. She lived another 30 years, dying at age 71 of a blood cancer. * My boyfriend's Aunt Evelyn was diagnosed with stage III bc in her late 40s. She had a unilateral mastectomy--no chemo, no radiation, no tamoxifen, etc. She eats whatever in the heck she wants and doesn't exercise. She's now in her mid-80s and doing great! I remember that despair. It's a nasty place to be. Hang in there...you will get through this.",
      "MessageIndex": 3,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765601",
      "Title": "Remind me of the hopeful stories elmcity69 thefuzzylemon"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 27, 2009 02:56PM Celtic_Spirit wrote: Thrush was my weirdest. Yuk! It looked like my tongue was wearing a white gym sock. Actually, the thrush was caused by decadron, which also caused me to be hyper-emotional at times, which is soooo not me. I've always had very flimsy fingernails, but during chemo, my nails grew long and strong. It's been five months since chemo ended, and my nails are soft and break easy again.",
      "MessageIndex": 11,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/731431",
      "Title": "What's your wierdest side effect ann-idiot ann-idiot"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 21, 2011 05:51PM Celtic_Spirit wrote: I felt traumatized during treatment (never a big fan of needles), but really, I went back to being happy-go-lucky \"me\" within months of treatment ending. Sure, I have moments when I'm pissed about the tamoxifen and oophorectomy turning my midsection into mush (I could lay off the ice cream; that would help, too!), and I wonder if certain aches are more than they seem. I can honestly say that driving the local interstates here scares the bejeezus out of me far, far more than having an onc visit, xray, blood work, etc. Change has been a constant in my life, as have hard times, so having bc seemed like just another battle to slug my way through.",
      "MessageIndex": 5,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763734",
      "Title": "Emotional Issues From BC PTSD? Shanagirl SpunkyGirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 29, 2008 02:32PM Celtic_Spirit wrote: I've had numerous people say \"You must admire Christina Applegate. She's been so brave.\" I'm not bragging or complaining, but since February '08, I've undergone a needle biopsy, three surgeries (one being bilateral mast.), six infusions of TAC chemotherapy, two CT scans, a bone scan, 30 rads, an infected chemo port, Tamoxifen, and next month I'll have a Zometa infusion and an oophorectomy. And I've gotten up every morning and gone into the office. So exactly what am I suppose to admire? Yeah, as ACAB said, she's the flavor of the month breast cancer poster child, but there are soooo many women out there who have fought much harder battles without having Oprah's shoulder to cry on. I feel bad for her or anyone who has to join the breast cancer ranks, but I can't find a lot of reasons to look up to her.",
      "MessageIndex": 6,
      "PostDate": "29/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725120",
      "Title": "Christina Applegate and radiation tomatojuice deadlanguages"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jun 14, 2012 01:29PM Celtic_Spirit wrote: The first CT scan I had, which was after my bmx and prior to chemo, showed a bunch of small spots on my liver that were \"too small to characterize.\" My onc said the best case scenario would be that they look the same when she scanned me following chemo. Fortunately, that was the case. They may be nerve endings, blood vessels, hemangiomas, etc., but they aren't cancer. Whew! I did spend the six months between CT scans sweating bullets, wondering if I were actually stage IV. Second scare...one day I was scratching my port scar when I felt two pea-sized lumps under the scar. I had an appointment anyway with my primarcy care doctor, so I asked her about them. She said they weren't lymph nodes, but she didn't know what they were. A month later when I saw my onc, she felt them and wasn't sure what they were, so she referred me to a surgeon. The surgeon knew right away...scar tissue had formed around a couple of inner stitches used to close the area where my port was. I've had some sharp pains under my arms and around my port scar, which my onc says are my nerves regenerating and creating new pathways. This could go on for years. Aside from the questionable liver findings, I can't say I get really worked up about these \"scares.\" My approach is to not fret about something until there's a reason to. Worry is like a rocking chair: it keeps you busy, but it doesn't take you anywhere.",
      "MessageIndex": 3,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/789086",
      "Title": "Scares anyone can share that turned out to be nothing? fondak fondak"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 1, 2008 12:54PM Celtic_Spirit wrote:",
      "MessageIndex": 8,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723726",
      "Title": "Does desperation play a role in developing breast cancer? HeatherBLocklear dlb823"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 1, 2013 12:44PM Celtic_Spirit wrote: Leecy, I was 48 when diagnosed, and I had multiple tumors in both breasts...including an 11cm lump in my left breast. Also 9 positive nodes. Scary stuff! Did bmx, chemo, radiation, four rounds of zometa, and tamoxifen/now arimidex. I'm now rapidly approaching my five-year anniversary! I have aches and pains from the arimidex, but I don't let them keep me from having a full life. In fact, the past five years have been absolutely amazing! Keep your chin up, know that it's going to be rough at times, take xanax if your anxiety gets out of control, and look forward to that day when treatment is over and you can get on with your life (and that day WILL come!).",
      "MessageIndex": 7,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/799757",
      "Title": "Just Diagnosed...huge tumor :( leecy5 Juzlyon43"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 17, 2010 04:42AM Celtic_Spirit wrote: I've been following this closely as well and am feeling rather disturbed about it. I've flown several times since my surgery, and have worn both my silicone protheses and compression sleeves with no problems. That was before these new scanners and enhanced pat downs. I don't want to be groped, exposed to more radiation, or have to get into a drawn-out discussion of my medical history. I'm wondering, now, would the best alternative be to put my protheses in my carry-on suitcase and \"go flat\" through the screening process, then duck into a restroom and put them on? Or would some yahoo screener pull my foobs out of my suitcase in front of a thousand people and ask for an explanation?",
      "MessageIndex": 39,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 20, 2012 04:48PM Celtic_Spirit wrote: Mystery solved: http://www.nbcnews.com/id/49485357/ns/local_news-san_diego_ca/ If you're going to travel grope-free, now is the time to do it!",
      "MessageIndex": 159,
      "PostDate": "20/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 16, 2011 06:04PM Celtic_Spirit wrote: I'm BRCA negative, but my onc and gyneological onc both thought it would be a good idea because (1) it would eliminate most of the estrogen/progesterine in my body and (2) my mother died of bc and her sister died of ovarian cancer (though at an old age), so they feel there is some sort of genetic component to my cancer, they just don't know what. Both do feel that removing the ovaries is beneficial to preventing bc recurrences. My onc also felt the benefits of an oophorectomy outweighed the risks/side effects for me for several reasons. She said that, at 49, my ovaries had done about all the good they were going to do and, with natural menopause knocking at my door, their usefulness had about expired anyway. Second, my bones are in excellent shape, and I have no family history of osteoporosis; therefore, loss of my ovaries was less likely to have a damaging effect on my bones. I would suggest weighing the benefits/costs of having an oophorectomy based on your own family history and physical attributes and go from there.",
      "MessageIndex": 8,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779623",
      "Title": "Removing Ovaries CherylinOhio cinnamonsmiles"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 16, 2013 05:27PM Celtic_Spirit wrote: I had surgery on a Wednesday and went back to work the following Monday. I went hiking 12 days after my surgery. It took me longer to recover from having my wisdom teeth out. Everyone is different, though.",
      "MessageIndex": 1,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/811091",
      "Title": "Oopherectomy recovery mary625 clariceak"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 12, 2010 04:05PM Celtic_Spirit wrote: Barbe and lexislove, for my part, you're always welcome here. I enjoy your posts.",
      "MessageIndex": 75,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748156",
      "Title": "RESPECTING the STAGE threads **RANT** cherneski Nico1012"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "May 23, 2012 12:21PM Celtic_Spirit wrote: I took Tamoxifen for two years before my onc switched me to Arimidex. My worst Tamoxifen side effects were leg cramps and leg pain. I took ibuprofen for the pain and potassium supplements for the cramps. Both helped a lot and allowed me to continue hiking, working out, walking, and dancing. I imagine that the side effects from treatment for stage IV breast cancer would be far, far more severe. I watched my 44-year-old mother die a gruesome, agonizing death from breast cancer. Tamoxifen was not available in the 1960s. Me, I thanked my lucky stars every day when I swallowed that little white pill and I continue to thank them for Arimidex.",
      "MessageIndex": 14,
      "PostDate": "23/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787896",
      "Title": "Anyone out there decline taking Tamoxifen? tmetz1616 shelly56"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 27, 2009 03:31PM Celtic_Spirit wrote: Gosh, Lainey, are we sharing the same boyfriend? He sounds just like mine! My boyfriend got the honors of buzzing my head and, to date, he's the only person who has seen me without my wig. He was also the first person to see my mastectomy scars. He emptied the fluid from my drains, recorded the amount, helped me bathe, washed my hair, and helped me dress. He went to my chemos with me, and the nursing staff just adored him. He went out of his way to make me laugh, even asking one of the chemo nurses how to protect himself from \"chemo farts.\" LOL!  I'll never forget the ensuing conversation between him and that nurse as long as I live! My advice...tell your wife how attractive she is, remind her that this (treatment) is a temporary situation and you'll both get through it, make her laugh (when it's appropriate), don't complain if she's too tired to do something, and listen, even if she's repeating something for the 20th time. And don't be hard on yourself because you can't \"fix\" this. That's the oncologist's job. Good luck to you both!",
      "MessageIndex": 6,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/728047",
      "Title": "How help my wife through chemo? Husband11 Ninja"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 7, 2008 03:21PM Celtic_Spirit wrote: During chemo, I experienced a fluttering, spasm-like sensation under my right ribs. Sometimes it even hurt a little, and other times it felt like hunger pangs. Of course, I attributed it to liver mets. I finally asked my onc to give me the basic layout of my innards, and I told her what I was feeling. My \"liver mets\" turned out to be gas trapped in my transverse colon. Chemo really socked it to my digestive system, so I should have known better. Hope that helps. I'm sure it's something perfectly innocent, but it's always good to bring it up when you see your doctor.",
      "MessageIndex": 1,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/724056",
      "Title": "Please calm me down (again) caaclark SpunkyGirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Aug 7, 2009 10:45PM Celtic_Spirit wrote: You might try feeding her some beef, turkey, or chicken baby food (Gerber, comes in a jar). It's very nutritious, easy on the stomach, and kitties like it. Electrolytes, such as Pediacare, may be beneficial as well. I'm glad to hear she's back home and on the mend. You must be so relieved! My best friend's dog died today. This friend literally held my hand during my cancer ordeal and fished me out of some very dark places. I feel so badly for her and wish I could take her pain away.",
      "MessageIndex": 19,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738315",
      "Title": "So Sad... not about cancer LittleFlower LittleFlower"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 7, 2012 01:08PM Celtic_Spirit wrote: bump",
      "MessageIndex": 149,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 11, 2012 03:19AM Celtic_Spirit wrote: That was the weird thing...when I traveled a year ago, I got routed into the full-body scanners before I knew what was happening. And, as always, my foobs showed up on the scan, and I was pulled aside for groping. Pretty much everyone in line went through the scanners. On this trip, I didn't even see the scanners...just the metal detectors like we had pre-underwear bomber. A lot of people didn't even take their shoes off. I'm just wondering if security has been scaled back due to all the bad press, etc. San Diego Intl. Airport has always been really strict (that's where the \"Don't touch my junk\" incident happened). Was I just lucky at the San Diego and Seattle airports, or has there been a policy change?",
      "MessageIndex": 153,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 17, 2010 09:23AM Celtic_Spirit wrote: Oh, hell, Sherri, I would come unglued if they did to me what they did to your friend. That is absolutely over the top. Unbelieveable. Between how the airlines nickel-and-dime you do death with fees and stuff you into undersized seats--and now TSA groping or radiating us--I'm seeing train, car, and cruise travel in my future.",
      "MessageIndex": 50,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 18, 2010 01:02PM Celtic_Spirit wrote: I read an article on either CNN or MSNBC this morning about sexual assault victims' reactions to scanning and esp. pat downs. It has caused panic attacks, etc., for many. I've known several women who were raped or molested, and they didn't even like to be touched or hugged by people they knew, let alone groped by strangers. Surely, there has to be a better way. I would rather us use Israel's methods and be less politically correct than traumatize people who have committed no crimes and have already been traumatized enough.",
      "MessageIndex": 74,
      "PostDate": "18/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 20, 2009 10:43PM Celtic_Spirit wrote: Judy, I Googled the site you mentioned. The page, and thus the information in it, hasn't been updated since October 2005. That's ancient information in the world of medicine. For instance, clinical trials for the taxanes in early stage (including stage III) bc were just wrapping up and being published in 2005, I believe. So you can imagine how much better the statistics and treatments are now!",
      "MessageIndex": 11,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/729428",
      "Title": "Confused about the statistics? JudyO Texas357"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 27, 2009 05:24PM Celtic_Spirit wrote: Hi, Michele, I had a bilateral mastectomy 18 months ago and, as of yet, no reconstruction. I'm in no hurry and may never opt for it. My body is once again strong and healthy, and that's what I care most about. I've adjusted well to the protheses...wear them hiking and biking and sometimes forget to take them off when I go to bed! I had large, painful breasts that prevented me from wearing nice clothes and participating in certain sports. I was actually looking into having a reduction when I was diagnosed. I dropped 3-4 shirt sizes after my mastectomy, and my body image is actually better. I'm much happier looking like Keira Knightly than Dolly Parton! I have heard from both doctors and women who've had reconstruction that it can be a painful, long recovery, and several women I've known had to have multiple surgeries due to necrotic tissue, poor healing, rejection of implants or flaps, etc. For other women, it's a few weeks of pain and they're fine. It really depends on what makes you happy.",
      "MessageIndex": 5,
      "PostDate": "27/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/742859",
      "Title": "need more support for my decision MicheleS melissa-5-19"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 28, 2009 11:09AM Celtic_Spirit wrote: Nagem - The Japanese and British are doing clinical trials on the fat transfer method using fat stem cells harvested from the patient's stomach area. So far, the results are very good, but they haven't been able to create a whole breast yet, just augmentation or filling in holes left by lumpectomy. This is one of the reasons I'm in no hurry for reconstruction; I'm hoping in another five years or so that they've perfected this method and someone in the U.S. will be doing it. Michele - A woman with my hospital's bc volunteer group waited 16 years to have reconstruction. No particular reason for the wait...just wasn't interested for a long time. You can always change your mind later.",
      "MessageIndex": 11,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/742859",
      "Title": "need more support for my decision MicheleS melissa-5-19"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 7, 2012 01:04PM Celtic_Spirit wrote: I just returned from a trip to Seattle. When I arrived at San Diego Intl. Airport (home), I fully expected to be herded into the full-body scanner or have a fight with TSA. To my surprise, I didn't even see the scanner. I went through the normal scanner...no gropes, no wands,  no testing my hands or shoes for explosives...and was sent on my merry way. I thought it was a lucky fluke. At Seattle, same thing...no full body scanners, no questions, have a nice day and enjoy your flight!?!?! What's up? I'm usually pretty news savvy, but I don't remember hearing that they've discontinued using the scanners/body groping. Has anyone else flown recently and had a similar experience?",
      "MessageIndex": 148,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Aug 4, 2009 10:26PM Celtic_Spirit wrote: I had 30 treatments, five of which were boosts on one side. I received radiation on both sides (mastectomy scar, under arms, and supraclavical area).",
      "MessageIndex": 9,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738026",
      "Title": "no bra during radiation Cherie5 Leah_S"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 21, 2009 02:40PM Celtic_Spirit wrote: Remember, too, that between now and when we reach that 5-year mark, many treatment advances will probably take place. Already, some of us are receiving Zometa. Who knows what's right around the corner!",
      "MessageIndex": 24,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/729428",
      "Title": "Confused about the statistics? JudyO Texas357"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Apr 7, 2009 07:21PM Celtic_Spirit wrote: I asked my onc about the \"sugar feeds cancer\" debate. She gave me a technical explanation of how the liver processes sugar, etc., etc., which boiled down to no, sugar does not feed cancer. During my next visit to her, I observed a birthday party being held in the oncology unit for one of the oncs. Every oncology doctor and every oncology nurse leaving that room had a big piece of chocolate cake on his/her plate, and I'm betting the cake and frosting weren't sugar-free! Everyone has their own comfort level, but I think you can drive yourself crazy figuring out what has hormones, soy, etc. I think you could end up living on water (which, these days, probably has it's own harmful rotten-nasties...sigh). I was purchasing vitamin D3 the other day and happened to read the ingredients label...the gel cap contained soy (I bought a different brand). Perhaps I'm a little nutritionally jaded because, for the past 20+ years, I've done a lot of my cooking from a book titled \"The Doctor's Anti-Breast Cancer Diet : How the Right Foods Can Reduce Your Risk of Breast Cancer.\" Guess it didn't work, huh? Think it's too late to get my money back? I'm also one of those people who did everything right...ate lots of fruits, nuts, and vegetables and avoided fastfood, red meats, highly processed foods, etc.; exercised; took supplements; had a yearly mammogram and physical; etc. However, while \"doing everything right\" didn't prevent cancer, it has kept me otherwise healthy and strong, which made the rigours of cancer treatment more tolerable than it would have been had I suffered from diabetes, high blood pressure, etc.",
      "MessageIndex": 4,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/732090",
      "Title": "BC - Should you avoid dairy and sugar??? np312 debisongbird"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 22, 2009 05:18AM Celtic_Spirit wrote: Is that you in the last photo? You don't look old enough to be a grandmother!",
      "MessageIndex": 12,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727727",
      "Title": "Thanks to Everyone LuAnnH luvtotravel"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 13, 2010 10:20AM Celtic_Spirit wrote: Mine was due to cording following radiation.",
      "MessageIndex": 2,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/757931",
      "Title": "Do you know what caused your Lymphedema? peanutchillibean sushanna1"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jul 29, 2009 11:12PM Celtic_Spirit wrote: Thanks, Binney. My normal bp (on my arm) is around 117/68; on my leg, it's ranged from 146/90 to 194/115, but they have usually taken it after I've fought traffic and galloped through the medical center and while I'm sitting up. Next time, I'll ask to lie down. Another question about leg bps...the nurses have put the cuff on my ankle, my calf, and my thigh. Which area of the leg gives the best reading?",
      "MessageIndex": 2,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/738126",
      "Title": "BP on the Wrist? Celtic_Spirit LindaLou53"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 2, 2009 11:56AM - edited Sep 2, 2009 11:57AM by Celtic_Spirit I'm not really comfortable with any of the reconstruction options. Implants...maybe, in a few years, though both sides were radiated. I just can't see cutting up my body to create fake boobs with one of the tram/diep surgeries. I'm also afraid that additional stress on my lymph system (through scars and tissue removal) would cause truncal lymphedema, and fake boobs just aren't worth that kind of bother to me. The British and the Japanese are currently testing breast reconstruction/enhancement methods using stem cells, where they grow tissue/fat with its own blood supply. The results so far look promising. I'm thinking I might wait around for them to perfect it before I jump into reconstruction. Right now, I'm just happy to have a healthy body.",
      "MessageIndex": 15,
      "PostDate": "02/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/739836",
      "Title": "Any stage 111ers had breast reconstruction alaskalady RBodem"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 14, 2009 12:18AM Celtic_Spirit wrote: Whoo-wee! I think that's the worst cancer story I've ever heard. If there's karma in this world, that nurse is in trouble! I'm so sorry...that must have been a truly terrible experience. I started taking Tamoxifen the day after my onc prescribed it, which was one week prior to starting rads. It might have made my rad fatigue worse, but I couldn't take it fast enough. From what I've read, the anti-hormonals seem to be the most important part of treatment for us er/pr positive women, and I didn't want to wait and my onc didn't say I had to. Viva la Tamoxifen! The CT scan I had post-surgery, prior to chemo showed some tiny spots on my liver that were \"too small to characterize and too tiny to biopsy.\" My onc didn't seem terribly concerned about them, but it was a cloud that hung over me during chemo. She said the best case scenario was that the spots were still there and remained the same size 'cause that would most likely indicate they were benign and/or congenital. About a month after my last chemo, she ordered a follow-up abdominal CT and a 3-phase liver study, which I have a feeling she requested mostly to calm me down. Fortunately, the spots remained the same. My onc characterized me as medium risk for recurrence and will see me every six months and do blood tests but no scans unless I have symptoms. She's wonderful; I can e-mail her anytime, and she's even called me from her home on her day off! The nurses I had were all angels. I feel blessed.",
      "MessageIndex": 7,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/727299",
      "Title": "Can we talk? debisongbird debisongbird"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 25, 2009 06:14PM Celtic_Spirit wrote: I was looking forward to having wavy or curly hair, and it just isn't happening. Still straight as a board. It's a nice salt-and-pepper color, though when it's long enough I'll dye it back to medium brown. My last chemo was Sept. 12, 2008. My hair looks slightly longer than how actress Judi Dench usually wears hers.",
      "MessageIndex": 32,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/698807",
      "Title": "does everyone get curly hair after chemo? cc01 lago"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Aug 3, 2009 11:39AM Celtic_Spirit wrote: Ahhh...I'm so sorry to hear that your kitty is doing poorly. My 17-year-old cat, Toby, died of kidney disease several days after I was diagnosed last year. Because of the craziness I got caught up in (cancer treatment), I've only begun to really mourn him now. I have had very sick kitties that the vets have worked miracles for. I'm wishing good health for Tabitha and hoping she's home with you soon.",
      "MessageIndex": 7,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738315",
      "Title": "So Sad... not about cancer LittleFlower LittleFlower"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Aug 2, 2009 04:54PM Celtic_Spirit wrote: I wore a bra and protheses throughout radiation. The radiated area didn't hurt any less when I was braless. Overall, I didn't have a lot of skin damage...just a \"sunburn\" and, later, peeling.",
      "MessageIndex": 5,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738026",
      "Title": "no bra during radiation Cherie5 Leah_S"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 16, 2012 03:17AM Celtic_Spirit wrote: Thanks for the info, Otter. I'm thinking I just got lucky on this trip!",
      "MessageIndex": 158,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 24, 2009 11:12PM Celtic_Spirit wrote: I've debated something similar to this myself. We already have three young cats (all less than 5-years old). All were adopted prior to my diagnosis. My boyfriend has been making noise about getting a fourth (we use to have 5; all lived into their late teens before dying of, ahem, cancer). I don't want him to be overburdened if something should happen to me, though I'm always game for having an extra cat to warm the bed. I go back and fourth on this in my mind. The jury is still out.",
      "MessageIndex": 3,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/729686",
      "Title": "Kids Getting a Dog SpunkyGirl SpunkyGirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 26, 2009 12:02AM - edited Feb 26, 2009 12:41AM by Celtic_Spirit As someone who has volunteered with a pet rescue organization for the past five years, I would like to encourage everyone to adopt from a shelter or rescue organization. There are even breed-specific rescue organizations. I know that the outfit I help out is being flooded with pets losing their homes due to the recession and housing crisis. Here in San Diego, we often get floods of pets each time a large military deployment takes place. That's how I met my Maine Coon, MacDougall (aka, Dougie):  He's the big one (20 lbs.!) in the photo. His former guardian is in the Navy and was sent to Iraq as a photographer. Dougie is one of the best-natured, tolerant beings to ever pitter-patter the earth. The little prissy-pants is Simone as a kitten. She's a big butterball now. My boyfriend found her abandoned in the parking lot of a Rite Aid. ",
      "MessageIndex": 21,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/729686",
      "Title": "Kids Getting a Dog SpunkyGirl SpunkyGirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 17, 2009 02:43AM Celtic_Spirit wrote: My pre-chemo CT scan said almost exactly the same thing: \"liver shows small dots that are too small to characterize or biopsy.\" My onc wasn't worried about them, but I sweated bullets for six months until the followup CT scan. The followup scan revealed that the dots looked the same, which was a VERY good thing. As part of the followup scan, my onc ordered a 3-phase liver study. This was basically a CT scan that took shots of my liver at just about every angle, with and without contrast. This pretty much put to rest any concerns that something was up with my liver. You might ask your onc for one of these as part of your followup.",
      "MessageIndex": 5,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743950",
      "Title": "Worried About Liver Mets Shanagirl clariceak"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jun 12, 2012 11:15AM Celtic_Spirit wrote: financegirl - I'm sorry that you had to experience the tragic death of your mother from bc. It's not pretty, is it? I don't know if my mom was diagnosed stage IV or perhaps stage III and then had a recurrence; such things were not shared with children in those days. My mom had a unilateral mastectomy and then radiation...lots of radiation, because that was basically all they had to offer back then. She tried to shield me from her illness, but I remember catching a glimpse of her chest one day...it was an oozing, purple and red mess of dying, radiated tissue. She wore Kotex pads over her chest because the drainage was so severe, regular gauze could not absorb it all. Like your mom, mine was sick all the time. Sitting on the couch in severe pain every day, all day, was all she could manage. She had to give herself an enema daily in order to relieve herself. At the very end, when she was at a nursing home, they had her on heroin to relieve the pain. Right now, Arimidex is playing hell with my knees from the hike I took last weekend. But that's okay. I would swallow battery acid every day if it mean't I wouldn't have a recurrence and/or die like she did.",
      "MessageIndex": 38,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787896",
      "Title": "Anyone out there decline taking Tamoxifen? tmetz1616 shelly56"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 7, 2008 05:55PM Celtic_Spirit wrote: Okay, ladies, I have the mother of all crazy symptom stories! After chemo #2 late last June, I went to the bathroom one morning and noticed that my poop was slightly green. By the end of the day, it looked like I was celebrating St. Patrick's Day early...it was green as a four-leaf clover! I was getting pretty freaked by then and feeling the itch to jot off a panicy e-mail to my onc. Then a cooler voice got ahold of me. I mentally went over everything I had eaten in the prior 24-hours. Meatloaf...no. Cereal...no. Cupcakes iced with blue frosting for Independence Day...Yes! It seems that some blue foods, esp. blue confectioners frosting, can having a \"greening\" effect on what comes out the exit door. During our next visit, I told my onc about the frantic e-mail she almost got with the cancer symptom I didn't have. Once she stopped laughing and was able to breathe again, she told me she was glad I figured it out myself because she would have been completely stumped and would have had to consult with her colleagues. Apparently, green poop isn't covered in medical school!",
      "MessageIndex": 5,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/724056",
      "Title": "Please calm me down (again) caaclark SpunkyGirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Oct 12, 2012 02:52AM Celtic_Spirit wrote: I've had sinus trouble all my life...it even showed up on my bone scan! However, until chemo/radiation, I never had trouble with my ears. Now I do. It started during radiation...slight dizziness, a feeling of fullness in my right ear. I told my doctors, but they kinda looked at me like I was nuts. Since then, I've had middle ear infections and a lot of congestion and drainage in my eustacian tubes.",
      "MessageIndex": 2,
      "PostDate": "12/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/794799",
      "Title": "did anyone have ear problem during chemo and radiation aja4173 Momine"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 16, 2011 05:18PM Celtic_Spirit wrote: Oh, Bobbie, I'm so sorry to hear this bad news. Sending hugs and warm thoughts your way. I've always loved the poem \"And Death Shall Have No Dominion\" by Dylan Thomas, especially this line: \"Though lovers be lost love shall not; And death shall have no dominion.\" My true love died in 1983, and that poem helped me to see that the love you had with someone cannot be conquered by death, for it is eternal.  ",
      "MessageIndex": 3,
      "PostDate": "16/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774995",
      "Title": "Spunkygirl (Bobbie) Fitztwins Mamita49"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 27, 2011 06:33PM Celtic_Spirit wrote: Congratulations! And I agree with you completely!",
      "MessageIndex": 4,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/775622",
      "Title": "Marking 8 years since... Trish03 CherylinOhio"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jul 27, 2011 04:54PM Celtic_Spirit wrote: I had a bilateral mastectomy over three years ago. I still have tightness and slight pain in my chest area and shooting pains under my arms. I asked my oncologist about this last spring, and she said my body is still rebuilding nerve pathways that were severed during surgery. She said it was normal and could continue for several more years. Perhaps this is what your mother is experiencing.",
      "MessageIndex": 3,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772216",
      "Title": "Breast pain months after mastectomy? pp729 Marl5900"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 4, 2011 02:34PM - edited Jan 4, 2011 02:35PM by Celtic_Spirit I took tamoxifen for a little over two years. Yep, lots of leg and foot cramps and pain, but never enough to stop me from hiking, racquetball, zumba, etc. I never had emotional issues with it. I don't need medication to make me crabby and surly; it just comes naturally! LOL! Just started arimidex on Christmas Eve. So far, a little more widespread joint stiffness, but it's liveable. If you have bad leg cramps with tamoxifen, try taking a potassium supplement. My onc recommended that, and it worked wonders for me.",
      "MessageIndex": 1,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762891",
      "Title": "Really Frustrated with New SE Shanagirl suzanneinphoenix"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 6, 2010 11:54AM Celtic_Spirit wrote: Barbe - Without getting too indepth, and recognizing that there are many different pagan schools of thought (kind of like Catholics, Baptists, Episcopalians, and Mormans), here are a few Yule traditions that we can see in how Christmas is celebrated today: In ancient times, in the northern countries of Europe, animals were brought in from the high meadows as winter approached. Because fodder was scarce, only the strongest and finest beasts were kept. The others were killed and, because citizens of the Dark Ages didn't have refrigerators, the meat had to be consumed or dried quickly. This called for a feast.  People often exchanged gifts of meat or other food they had grown, or linens they had woven, soap they had made, etc.  Thus we have the prototype of our basic Christmas morning get-togethers celebrated today. People would visit each other's homes to exchange goods, and they were often served a strong, hot drink or ale. They would toast the host and say \"waes hael,\" which is Old English for \"be hale.\" Recognize that word? We know know it as \"wassail.\" Yule fell during midwinter, the darkest time of the year. To encourage the return of the sun, fires were lit (think, today, candles and Yule logs). Pagans think very circular, and the year is seen as a \"wheel.\" The Druids of Britain would bless a log and keep it burning for 12 days during the winter solstice (how often does \"12\" show up in regards to Christmas?). Part of this log was preserved for the following year, with it would be used to light the new log, thus completing a wheel or circle. Today, we often hear Christmas referred to as \"the season of light\" or \"the celebration of light.\" The boar  (Boar's Head) was a favorite dish, as the boar was a solar animal, having bristles of gold like the rays of the sun. Today, many people serve ham as their Christmas dish. The ancient Celts and Norse also cherished evergreens, esp. at this time of year, as they are the natural symbol of rebirth and life amid winter's whiteness. Today, we decorate with pine trees and holly.",
      "MessageIndex": 7,
      "PostDate": "06/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761581",
      "Title": "Anyone NOT celebrate Christmas? Mom3 Shanagirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 23, 2009 10:46PM Celtic_Spirit wrote: Hi, Kathy, I'll tell you verbatim what my oncologist said when I asked her about alternative treatments. She said, \"If they worked, I'd be prescribing them.\" She told me of several patients who had pursued treatments in Mexico and South America and returned with kidney failure. I wish I could remember the names these herbs are marketed under to cancer patients, but their real names are mistletoe and cat's claw, both of which can be toxic. While researching cancer and treatments last summer, I came across so many blogs by cancer patients who went the natural route...colon cleansings, macrobiotic diets, herbal supplements, yoga, etc. Sadly, each of these blogs ended 1-2 years later with a member of the patient's family reporting on the blogger's death. That said, I would certainly think that positive thinking, exercise, and perhaps some nutritional adjustments would be great additions to your treatment plan. About your dogs...\"Cat therapy\" was an instrumental part of my treatment plan! There's nothing like being purred to sleep by a kitty nestled against your shoulder! Their unconditional love and funny antics helped me through the tough times. I'll bet your dogs do the same for you. Wow, your farm sounds great! My mother's family lives in New Zealand, and most of them are sheep or dairy farmers with farms around the size of yours. I spent 4 months there when I was 10 and loved it. I hope to get back to that side of the world some day soon and visit with cousins. Whatever course you decide upon, best of wishes for a total response and many years to come!",
      "MessageIndex": 29,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/724718",
      "Title": "Chest Wall Radiation and Reconstruction ninel 55andstillalive"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 1, 2008 07:59PM Celtic_Spirit wrote: I have Kaiser in San Diego. I don't have lymphedema but asked the breast care coordinator if I could see their lymphedema therapist for baseline measurements in case I do start to swell. I was told that \"she (the PT) was too busy\" and therefore could only see patients who already have lymphedema. Isn't it a little too late, then, to get baseline measurements? I'm thinking about finding a private PT just to get my measurements.",
      "MessageIndex": 8,
      "PostDate": "01/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/725079",
      "Title": "Problems with PT - Kaiser cgoody maxgirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 30, 2011 08:46PM Celtic_Spirit wrote: Thanks, Cycle-babe! I'm over the sinus infection now. When I get a bout of it, I pretty much have to slouch for a while because I can't breathe and I feel cruddy. Unfortunately, I tend to keep on slouching! I have to summon my inner drill sergeant to put myself back on track!",
      "MessageIndex": 89,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 24, 2011 07:07PM Celtic_Spirit wrote: Okay, now I need someone to post about a study that finds that stuffing yourself with Thanksgiving vittles kills cancer cells. Anyone...?",
      "MessageIndex": 46,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 3, 2009 11:44PM Celtic_Spirit wrote: There seems to be two schools of thought: to scan or not to scan. I've read...and my oncologist agrees...that success in treating a distant recurrence doesn't depend on catching it early. If the cancer is going to respond to treatment, it'll respond whether the lesion is 3mm or 3 cm. Personally, I'm torn on how I feel about this. I'm very much a \"nip it in the bud\" kind of person. I fix the car the minute I hear a rattle; I don't wait until the rattle becomes a roar and then end up broken down on the side of the road. Same with my body. On the other hand, waiting for scan results makes me looney, so I'd rather not have the additional anxiety...and exposure to radiation...every few months. As I mentioned, my onc doesn't do routine scans unless you present with symptoms. My insurance is with Kaiser, and since they have their own treatment centers, scanning equipment, techs, and doctors, I don't think they save much money if they don't scan. How they decide may have something to do with how aggressive they consider a person's cancer or the philosophy they were taught in med school. My onc has mentioned there's \"East Coast and West Coast\" schools of thought with oncology. I don't remember her explanation (it was our first meeting; my head was spinning), but perhaps this has something to do with it. Yes, the risk for recurrence is greatest during the first two years.",
      "MessageIndex": 1,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/730099",
      "Title": "What's your opinion on post-treatment tests staceyshusband bettysgirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 17, 2009 08:01AM Celtic_Spirit wrote: I exercised during most of my 9 months of treatment. I began doing strenuous hikes again 7 weeks after my bilateral mastectomy. I did moderate hikes and walked during chemo, in spite of my onc's protests. Walking helped with the painful side effects of neupogen. The last two weeks of rads, and for several weeks after, I was really too fatigued to exercise and felt I would do myself more harm than good. Now that the fatigue is gone, I'm back to the hills!",
      "MessageIndex": 6,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727376",
      "Title": "Exercise and mets LouiseIndigo LouiseIndigo"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jun 24, 2009 04:14AM Celtic_Spirit wrote: I asked my onc about this during my last visit in April. She said there was a lot of controversy about flaxseed for hormone positive cancer and no definitive answer. I told her that I put about 1/2 tsp. of flaxseed meal in my Activia yogurt each morning, and she said that's fine. She did recommend not consuming large quantities.",
      "MessageIndex": 2,
      "PostDate": "24/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736357",
      "Title": "Dr Christine Horner Program alaskalady lisasayers"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 24, 2011 01:14AM Celtic_Spirit wrote: I've got a pumpkin/cheesecake pie in the oven, but I'm getting my slouch on with a couple of glasses of Irish mead! Have a happy, healthy, yummy, \"spirited,\" slouchy Thanksgiving ya'll!",
      "MessageIndex": 43,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 22, 2009 07:43PM Celtic_Spirit wrote: Weesa, I'm all out of sass. Just spent all night at the Philadelphia Airport, waiting for my 6:15 am flight. I finally got back to San Diego around 11:30 am today. I'm working on no sleep since 10 am Monday morning and only two cups of coffee. Let me get a good night's sleep and I'll be back to wisenheiming in the morning!",
      "MessageIndex": 36,
      "PostDate": "22/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745325",
      "Title": "Can we talk? about drinking... weesa havehope"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Aug 7, 2009 11:39PM Celtic_Spirit wrote: Cancer can really put things in perspective. We're beginning furloughs at work (10% pay cut for me) and could be facing layoffs next year. Normally, this would make me sick with worry, but after cancer...heck, what's a job layoff? That's easy stuff! So sorry about your upcoming divorce. My boyfriend's brother is going through a midlife crisis divorce right now. He's alienated his kids and his entire extended family. From what I hear, he already regrets it. I hope your husband comes to his senses. Either way, you'll make it.",
      "MessageIndex": 4,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738612",
      "Title": "I Am Getting Divorced Heidi521 wallan"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 4, 2012 12:10PM Celtic_Spirit wrote: I haven't had reconstruction, but about two years after chemo, I felt two pea-sized lumps beneath my port scar. Both my primary care physician and my oncologist didn't know what they were. My onc sent me to the surgeon. The surgeon knew right away what they were...scar tissue had formed around a couple of the inner stitches used to close the area where my port had been. Perhaps you have some inner stitches that are doing the same.",
      "MessageIndex": 8,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797195",
      "Title": "I found a lump Pure Pure"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 26, 2009 02:48PM Celtic_Spirit wrote: I never felt \"sick\" during chemo. Constipated, yes, and a bit of heartburn until my onc put me on Prilosec. I worked throughout treatment. I walked at lunch every day and hiked on the weekends. I didn't even feel that tired until around infusion #6. I also worried that the chemo wasn't working. My onc assured me it was. People react to chemo in different ways.",
      "MessageIndex": 2,
      "PostDate": "26/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/741017",
      "Title": "Should I be Sick Pure Leah_S"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 23, 2009 12:37PM - edited Nov 23, 2009 12:38PM by Celtic_Spirit When I was a little kid, I remember my dad watching football games with his friends on Thanksgiving after dinner. They would put their beers on TV trays, and I'd slither underneath the trays, nip the beer can off the tray and take a sip when I thought they weren't watching! My dad thought this was hilarious, but my mom wasn't amused. LOL! When I was a teenager living with my foster mom in Tennessee, I remember getting out of bed Thanksgiving morning to use the restroom. I walked into the living room, and it was filled wall-to-wall with folk musicians, including John McCutcheon. I blinked several times and walked back into my bedroom and got back into bed. I thought I had dreamed the whole thing. She made the biggest breakfast I've ever seen that morning - biscuits, gravy, grits, bacon, eggs, toast, pancakes, sausage - for everyone there. When I was in college, I got a hankering for Thanksgiving dishes one April. I thought, why not have Thanksgiving several times a year? There's no law saying you can have turkey and dressing and cranberry sauce only once a year in November! So I bought a turkey and made the whole meal and invited my best friend over for dinner. That was almost 30 years ago, and she still talks about the time we had Thanksgiving in April!",
      "MessageIndex": 5,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744376",
      "Title": "THANKSGIVING STORIES, FOOD AND MORE........ jenn3 jenn3"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 14, 2010 09:01PM Celtic_Spirit wrote: I'm with you, Diana. I'm taking a long - perhaps permanent - sabbatical. The tone here has become...uncomfortable. Will check PMs occasionally.",
      "MessageIndex": 1,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748356",
      "Title": "Taking a break Diana63 helena67"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 19, 2009 09:56PM Celtic_Spirit wrote: I don't have a dog, but I certainly didn't part with my cats during chemo. They were an integral part of my cancer treatment...\"cat therapy,\" as I called it. I took care of their litterbox, maintained the aquarium, and cleaned the rats' cage all during chemo with no trouble. What worried me the most was using the public restroom at the large university where I work. Those girls are nasty, and I didn't touch barehanded (or bare anything else!) anything in that restroom.",
      "MessageIndex": 3,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/727657",
      "Title": "Chemo and dogs wiz2 kimbly"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 15, 2009 04:05PM Celtic_Spirit wrote: OMG, Yuengling on tap! North Carolina really IS God's Country! Weesa, I'd like my BC Cocktail with a splash of docetaxol, please.",
      "MessageIndex": 25,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745325",
      "Title": "Can we talk? about drinking... weesa havehope"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 27, 2009 03:16PM Celtic_Spirit wrote: April, My insurance/treatment is with Kaiser of Southern California (San Diego, to be specific). I double-checked everything my oncologist recommended, and believe me, I received gold-standard treatment. They didn't scrimp on anything. I don't know if you're with Kaiser, but if so, I can't say enough good things about the treatment I received here in SD. My surgeon and onc were absolutely wonderful, and the nursing staff amazing. Perhaps you could use the SD facilities? Send me a PM if you need further info.",
      "MessageIndex": 15,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/695351",
      "Title": "Stage III 010407 DCMom"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 23, 2009 04:09PM Celtic_Spirit wrote: Studies have shown that radiation not only helps prevent local recurrences, but seems to help prevent distant metastasis and increase overall survival chances. I've also been told that implants are still possible if you're willing to wait several years for reconstruction, but I'd ask a plastic surgeon to confirm that, and it may depend on how pliable your skin remains.",
      "MessageIndex": 26,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/724718",
      "Title": "Chest Wall Radiation and Reconstruction ninel 55andstillalive"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 2, 2011 11:37PM Celtic_Spirit wrote: The healthcare complex where I had radiation therapy also housed a gym/health center for fire fighters and EMTs. I walked passed it every day when I went for treatment, and everyday I saw these gorgeous, ripped men in tight-fitting clothing working out. I, of course, looked my worse, having come through eight months of surgeries and chemo. I was so tired I couldn't even get excited. I kept thinking, \"Ten years ago, I would have been tripping over my tongue.\" {Sigh} In my next life, I'm gonna be a cougar! So sorry for your emergency. I hope you're feeling better.",
      "MessageIndex": 11,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774128",
      "Title": "Fantasies don't always happen when you are ready. Chickadee debstar"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 30, 2011 11:30AM Celtic_Spirit wrote: I had my ovaries removed laproscopically in March 2009. The surgery was in the morning on a Wednesday, and I walked out of the hospital before noon the same day. I took the next two days off work and returned to my job (desk job, btw) the following Monday. My gyn oncologist said he wanted me to take it easy the day of the surgery but to get up and walk around the next day. I did, and I had no problem doing so. I took Vicadin as needed. Twelve days after my ooph, I hiked Cowles Mountain, the highest peak in the city of San Diego. I drove the weekend following my surgery. Really, I had a harder time when I had my wisdom teeth removed years ago. You'll do fine!",
      "MessageIndex": 6,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/775741",
      "Title": "Ooph kim40 jennyboog"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 7, 2008 05:10PM Celtic_Spirit wrote: Are you receiving a shot of Neulasta or a round of Neupogen shots? If not, talk to your onc about receiving one or the other. I stayed pretty healthy during chemo, most likely due to the Neupogen. Green phlegm...no, that's one side effect I didn't have. Doesn't sound fun. Talk to your doc.",
      "MessageIndex": 2,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724081",
      "Title": "Phlegm wblibrary wblibrary"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 1, 2012 05:56PM Celtic_Spirit wrote: Many years ago, I got through a particularly hurtful breakup with a louse by watching the Blackadder series (a British comedy, can be found on DVD). I highly recommend it if you have a bawdy sense of humor. I literally laughed my way out of a depression. Exercise helps, too. And time. Just about everything gets better with time.",
      "MessageIndex": 4,
      "PostDate": "01/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/795765",
      "Title": "i guess i am depressed fredntan CherylinOhio"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 19, 2009 05:37PM Celtic_Spirit wrote: I did TAC from May to September 2008. It was quite doable. I worked throughout, took long walks, etc. Worst side effects were constipation and thrush. Well, and losing my hair. Long-term side effects: some bone pain in shins, lost both of my big toe nails, and just a little peripheral neuropathy in my left big toe. While I hope to NEVER do it again, chemo wasn't as bad as I thought it would be.",
      "MessageIndex": 14,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729091",
      "Title": "Is anyone else out there having TAC treatment? kat4pink NatsFan"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 6, 2010 10:53AM Celtic_Spirit wrote: I'm pagan, and I do celebrate Christmas because it falls within Yule. I don't put up nativity scenes because that has no meaning for me, but much of the familar trappings of Christmas evolved from our celebrations.",
      "MessageIndex": 4,
      "PostDate": "06/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761581",
      "Title": "Anyone NOT celebrate Christmas? Mom3 Shanagirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jun 25, 2009 05:13PM Celtic_Spirit wrote: My eyesight began to diminish around age 41 (I'm 49 now). This was years prior to cancer and chemo. I recently had a total eye exam, and nothing was wrong except for a little age-related sight loss. The doctor recommended 1.5 magnification reading glasses, which I was already using. I don't think you have anything to worry about.",
      "MessageIndex": 5,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736499",
      "Title": "Is this normal or is my brain fried?? lovinmomma lovinmomma"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Apr 27, 2009 11:58AM Celtic_Spirit wrote: Ugh! I had thrush during chemo, too, and I hated it! In addition to drinking gallons of Nystatin, I found that using a tongue scraper once or twice a day helped. Also, eating anything greasy or covered in gravy/sauces made my mouth feel worse, like I had coated my mouth with vegetable oil. Foods like ice cream, oatmeal, cereal, and soups seemed to go down best.",
      "MessageIndex": 6,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733168",
      "Title": "Help with Thrush VickiG AusAla"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 25, 2011 11:25PM - edited Nov 25, 2011 11:27PM by Celtic_Spirit Slouchfest continues tonight at our house. Witch Creek Hard Apple Cider is on the menu, and oh mama, it's GOOD!!! Had T-Day leftovers today, and I'm about to bust, too! I'm thinking that Slouchfest may have to give way to Gymfest or Hikefest on Sunday, or I'm going to be shopping for new pants, lol! Weesa, you're a trooper, pulling off a meal like that! Your stuffing sounds delicious! Will let you know if I find a study to justify the gorging I've done in the past two days. Surely there's something in cranberry sauce that can kick cancer's butt! Slouch away, ladies! We deserve it after all we've been through!",
      "MessageIndex": 59,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 29, 2011 08:33PM Celtic_Spirit wrote: Weesa - I've been a little slouchy since my last bad sinus infection in September. You aided and abetted a little (with my full cooperation!), but the onset and continuation of my slouchiness are totally on me!",
      "MessageIndex": 85,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 18, 2011 06:51PM Celtic_Spirit wrote: Glad to be the bearer of good news, Weesa! Wish I could join you in that nice little pub on the corner! But since I can't, I'll toast your continued good health by wetting my whistle tonight with a bottle of Black Hawk Stout! Slainte mhor agad!",
      "MessageIndex": 5,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 26, 2009 12:47AM Celtic_Spirit wrote: I went home about five hours after surgery. My surgeon said he only usually admits if the patient is elderly, in poor overall health, or doesn't have someone at home to help them. That was fine with me...at home, the bed is softer, the food is better, there's less dangerous germs and viruses, there's no one in the bed next to me screaming all night or bringing in a roomful of visitors, and it's where my boyfriend and cats are! I felt okay during my first week home. I had trouble raising my hands/arms over my head. My boyfriend had to help me showering and wash my hair and help me get dressed. By the end of week one, I was talking long walks, driving, going out to eat, etc. I went back to work after 16 days.",
      "MessageIndex": 3,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731379",
      "Title": "How long was your Hosp stay for BLMas LynnVA NancyD"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 29, 2012 03:59AM Celtic_Spirit wrote: Congratulations, Diana! You're an inspiration!",
      "MessageIndex": 32,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/783260",
      "Title": "Diana50!!!!!! ck55 kimf"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 22, 2010 01:18PM Celtic_Spirit wrote: I had my ovaries removed primarily as a means of shutting off the hormones, secondarily due to family history of ovarian cancer (though I'm not BRCA+). I don't know how old you are; if you're younger than 40, please talk to your onc about the pros and cons. I was 49 when I had it done last year.",
      "MessageIndex": 8,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743848",
      "Title": "Extracapsular Extension gfrey jdootoo"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 6, 2010 04:28PM Celtic_Spirit wrote: You are correct, lmc1970. And I remember reading years ago that, by using references to events mentioned in the Bible relating to Jesus' birth (shepherds in the field, the census taking), Biblical historians were able to determine that Jesus was born in the summer, and I want to say in August. What I've always wondered is, why didn't the early priests affix \"Christmas\" to the pagan celebration of Lughnassadh, which takes place around August 1, instead of Yule.",
      "MessageIndex": 11,
      "PostDate": "06/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761581",
      "Title": "Anyone NOT celebrate Christmas? Mom3 Shanagirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 3, 2009 12:03PM Celtic_Spirit wrote: Do you have a chemo port? Have you had it flushed recently? The reason I ask is, I thought I had a little 24-hour bug, and it turned out my chemo port had become infected. When my port was flushed, it seemed to kick an extra dose of staph into my system for around 12 hours. Please mention your symptoms to your doctor just to be sure. Radiation doesn't usually cause nausea, but it sure can cause fatigue!",
      "MessageIndex": 2,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/743217",
      "Title": "2 WEEKS INTO RADIATION Shanagirl cherneski"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 23, 2012 09:02PM - edited Sep 23, 2012 09:07PM by Celtic_Spirit Hey, Weesa, I've been wondering where you've been! Screwtober...love it! I began seeing stink (my word for \"pink\") in stores and catalogs back in July {groan}. I'm afraid I won't be making Slouchfest this year...I'm headed to the wilds of Washington State this week for nine days of hiking and photography in Mt. Rainier and Olympic National Parks. I'm hoping the only pink I see will be the petals of a wildflower or the underbelly of a trout. I'm sure I'll find some nice little pub to have a brew in, but it won't be the same as your nice establishment, nor will the company be as fine!",
      "MessageIndex": 11,
      "PostDate": "23/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/793927",
      "Title": "Screwtober is almost upon us once again... weesa MandalaB"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 22, 2011 01:38AM Celtic_Spirit wrote: Slouchfest, for me, was tempered with a hike/photography shoot in the DuPont State Forest early the next morning. I'm still a slouch in training. I'll have to get the ants out of my pants before I can call myself a slouch professional! Happy Hour at BCO = Virtual Slouchfest. Pour yourself a strong one and join in!",
      "MessageIndex": 26,
      "PostDate": "22/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 23, 2009 10:00PM Celtic_Spirit wrote: Excellent story! Thanks for sharing, mmm5!",
      "MessageIndex": 7,
      "PostDate": "23/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745793",
      "Title": "Good stage 3 story!! - Happy Holidays!! mmm5 BonnieK"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 15, 2009 02:46PM - edited Dec 15, 2009 04:04PM by Celtic_Spirit I'm visiting my best friend right now who lives in a gorgeous little town in New Jersey about 1/2 an hour east of Philly. Her stepdad just gave me a case of my favorite beer, Yuengling, which is only sold in a few Northeastern states. You can bet your sweet bippy that I'm going to indulge! I'm going to be swimming in Yuengling this week! Ha! Seriously, though, I usually only have 1-2 drinks per week, and I plan on continuing to do so. Weesa, I can just picture you sitting in the window of your sons' pub, drinking Irish coffee! I would be reluctant to give that up, too.",
      "MessageIndex": 22,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/745325",
      "Title": "Can we talk? about drinking... weesa havehope"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 23, 2009 11:02PM Celtic_Spirit wrote: I always say, \"Did you hear a spider coughing?\" LOL!  And when I do it at home, my boyfriend says, \"What did you say?\" Wear shoes that make funny sounds when you walk. That provides good cover. I keep a remote-controlled fart machine in my desk at work. I often torment my boss with it, so nobody knows when that \"phoot\" sound is me or the machine! Joking aside, try Beano and keep eating the veggies, beans, and fruit.",
      "MessageIndex": 6,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/727873",
      "Title": "Gas roxy42 LizM"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jul 9, 2009 10:06PM Celtic_Spirit wrote: One of the lab techs told me during a blood draw that it's common for women my age (49) to experience anemia, even those who haven't been treated for cancer. (I don't know if you fall into the \"approaching menopause\" age group or not). My six-months post-chemo blood test revealed slight anemia still, and I feel fantastic. Another good natural source of iron is blackstrap molassas.",
      "MessageIndex": 2,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/737167",
      "Title": "anemia... helena67 KerryMac"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 23, 2011 06:49PM Celtic_Spirit wrote: I'm very sorry, Yan. How wonderful that you were there for her all the way, even at the end. I'm sure that gave her a lot of peace and eased her passing. My true love died in a car accident when I was 23. This passage from a Dylan Thomas poem always gave me comfort: \"Though lovers be lost, love shall not, and death shall have no dominion.\"",
      "MessageIndex": 69,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766537",
      "Title": "Olga Simkin Z\"L leprechaun Bestbird"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jun 15, 2009 12:37PM Celtic_Spirit wrote: My niece's 85-year-old grandmother in-law is receiving chemo for BC and apparently is doing fine with it. I guess there's no hard-fast rule about age and chemotherapy.",
      "MessageIndex": 9,
      "PostDate": "15/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/735869",
      "Title": "Could Use Some Advice for My Mom Kaliaja Brenda_R"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 8, 2010 07:34AM Celtic_Spirit wrote: Snow? I don't know what you guys are talking about. I spent this afternoon walking around the San Diego Zoo in a T-shirt. Actually, I rather enjoy the snow and wish we got it here sometimes.",
      "MessageIndex": 5,
      "PostDate": "08/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747976",
      "Title": "Appreciate the confessions... weesa jenn3"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Aug 16, 2010 11:48AM Celtic_Spirit wrote: Hi, Sher, I have mild LE in my dominant arm. I cross-stitch, bead, and do stained glass. I wouldn't dream of giving up any of it. I've gotten cuts and scratches on my affected arm from non-craft situations; I wash the area, put some Neosporin on it, and go on. As far as other crafts you might do...can you paint? Are you good at drawing?",
      "MessageIndex": 2,
      "PostDate": "16/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/756787",
      "Title": "Crafting with LE Sher lvtwoqlt"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 25, 2012 05:43PM - edited Sep 25, 2012 05:45PM by Celtic_Spirit What I hate the most are the \"I love boobies\" bracelets and \"Save the Ta Tas\" bumper stickers. Really, when I was diagnosed, saving my ta tas was the last thing I cared about. Those traitors could go to hell! Saving my LIFE was what concerned me. Saving the ta tas and loving the boobies seem to sexualize breast cancer...they cutsify it...and it seems to say that saving what's \"sexy\" about a woman is more important than saving her life. And I don't for a minute buy that most teenagers are wearing those bracelets because they have a burning desire to erradicate breast cancer...it's a \"legal\" means of being racy, of getting to say \"boobies,\" without getting into trouble. The whole thing just leaves a bad taste in my mouth!",
      "MessageIndex": 25,
      "PostDate": "25/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/793927",
      "Title": "Screwtober is almost upon us once again... weesa MandalaB"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 29, 2011 04:46PM Celtic_Spirit wrote: Cycle-babe - Yes, I had a pretty slouchy Monday night. Instead of going to the gym, I went to all-you-can-eat pizza night at Mountain Mike's. Yum! I had a 1:00 meeting at work yesterday, which I used as an excuse for not taking my lunch time walk. I think I'm getting too good at slouching! I even forgot my supplements a couple of times over the Thanksgiving weekend. In the meantime, my pants are getting tighter and tighter.",
      "MessageIndex": 80,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 3, 2011 05:16AM Celtic_Spirit wrote: Any rogue cancer cells roaming through my body, looking for somewhere to metastasize, had better watch out! I'm sending some Bailey's Irish Cream out to get 'em tonight! Lol! Hope you ladies are enjoying your TGIF!",
      "MessageIndex": 96,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 21, 2011 04:54PM Celtic_Spirit wrote: cycle-babe - At Slouchfest, the only thing we ride are barstools! It's kind of hard to explain in short. Below is a link to the original thread weesa posted: http://community.breastcancer.org/forum/67/topic/771501?page=1 There is no \"official\" Slouchfest; it's just a title I gave to lovely evenings spent at weesa's pub imbibing in spirits, good food, and excellent company.",
      "MessageIndex": 20,
      "PostDate": "21/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778300",
      "Title": "Good News for Us Slouchfest Attendees! Celtic_Spirit cycle_babe"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 1, 2008 10:11PM Celtic_Spirit wrote: Thank you, SoCalLisa! I might just take you up on that after the holiday craziness subsides a bit. And thanks, too, for the PT referral. Overall, my treatments with Kaiser have been good, and I love my oncologist, but I was disappointed with their response to lymphedema prevention...kind of the \"shut the barn door once the horse is out\" approach.",
      "MessageIndex": 10,
      "PostDate": "01/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/725079",
      "Title": "Problems with PT - Kaiser cgoody maxgirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "May 20, 2011 10:56AM Celtic_Spirit wrote: Prior to my bmx, I had very large breasts, so I was unfamiliar with the geography of what lay below them. During the middle of chemo, when I was at the height of my freak-out period, I went poking around my rib area and...guess what...found this bulge in the middle of my chest. Thank God for Xanax! Next visit, I had my onc check it out, and of course it was only my xiphoid process, which I had never heard of before. I wouldn't make a special trip to see your doctor, but you might ask him/her to check it out during your next scheduled visit.",
      "MessageIndex": 2,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769224",
      "Title": "Xiphoid Process ..Lump??? Not sure JeninMichigan chele"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jul 13, 2009 09:21PM - edited Jul 13, 2009 09:22PM by Celtic_Spirit Beesie, I looked at the table you provided the link for. That data is from 1989, which is like the Stone Age in the oncology world. Data that old might scare the bejezus out of recently diagnosed ladies. Since 1989, chemotherapy has come a long way, including the introduction of the taxanes and Herceptin. I'm not sure if tamoxifen was available in 1989 (and for the women in this study, many years prior to 1989), but the AIs were yet to appear on the scene. Radiation wasn't nearly as advanced as it is today. A member of my hospital's tumor board said not to pay attention to any cancer data more than five years old, three years preferably. Things have improved so much since 1989. I'm really rather shocked that Komen would have such outdated information on their site.",
      "MessageIndex": 2,
      "PostDate": "13/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737359",
      "Title": "What is my risk of recurrance? Luna5 Luna5"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jun 28, 2011 08:11PM Celtic_Spirit wrote: I just talked to a lady this afternoon who is Stage IIIC and seven years out with no problems.",
      "MessageIndex": 14,
      "PostDate": "28/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/770848",
      "Title": "A Couple Of Success Stories Pure gillyone"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jun 4, 2009 03:05PM Celtic_Spirit wrote: Ice cream did the job for me, too...and it still does, LOL!  Foods that tasted good and also didn't hurt my mouth were: pancakes, french toast, cereal, oatmeal, rice, hamburger dishes (meatloaf, Salisbury steak, etc.), yogurt, chicken soup, clam chowder, and SlimFast, to name a few. I'm not a fastfood person either, but Ronald McDonald and I became great pals during chemo. The friendship ended, sadly, when chemo was over and I began packing on the pounds!",
      "MessageIndex": 11,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735285",
      "Title": "Food Suggestions - Please mln8428 nelia48"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 9, 2012 02:18PM Celtic_Spirit wrote: I added vitamin D3. I took melatonin daily for many years prior to diagnosis. Needless to say, it did nothing to prevent breast cancer. Same goes for broccoli and other vegetables. They did, however, help to make me healthy overall, which I'm sure had a lot to do with how well I did during treatment and recovery.",
      "MessageIndex": 2,
      "PostDate": "09/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/793239",
      "Title": "Complementary supplements/therapy---what did you take? Charliestweetie lovujja"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "May 20, 2011 10:40PM Celtic_Spirit wrote: I'm sorry. I wish you lived nearby so I could take you out for a drink or a cup of coffee and let you get away from the stress for a while! Instead, I'm sending you good thoughts and a hug.",
      "MessageIndex": 2,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/769256",
      "Title": "Need encouraging words! Ranting! kathleen1966 duckyb1"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 26, 2009 03:11PM Celtic_Spirit wrote: Excellent news! I'm happy for ya! My boyfriend and I took our bikes to the desert last weekend and rode for miles. I soaked up lots of vitamin D. I also went wigless. I figured if a strong desert wind caught my wig, it would blow it all the way to Phoenix! LOL! It felt great to feel the breeze blow through my hair again! I'm still wearing the wig at work and around town and probably will for months to come. My ooph is scheduled for March 11, but I'm also thinking about staying on Tamoxifen. I, too, tolerate it pretty well, and the current research seems to indicate that the difference between it and the AIs is smaller than thought.",
      "MessageIndex": 7,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/729789",
      "Title": "First follow up appt today everyminute everyminute"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Apr 25, 2014 12:41PM - edited Apr 25, 2014 03:13PM by Celtic_Spirit Ugh! That \"tough\" quote makes my blood boil! John Wayne was pretty tough, and he died of cancer. When I was going through TAC chemo six years ago (following a bmx), Christina Applegate had just been diagnosed. I remember watching her cry on Oprah or Ellen's shoulder, talking about how difficult her journey had been (she had a bmx and I think that's it), on the chemo room TV. I had a needle poked in my chest port, thrush covering my tongue, no sense of taste, constipated, and no hair. I remember thinking, \"Sister, I would trade journeys with you any day!\" I agree, so many of these celebrity breast cancer folks make having bc sound like no big deal, it's on par with having the flu, and if you fart enough rainbows you're cured and a richer person for the experience. Aaarrrrggghhh!",
      "MessageIndex": 10,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820513",
      "Title": "ARRGGH, Amy Robach kebab tangandchris"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Nov 3, 2008 11:33AM Celtic_Spirit wrote: I'm an exceptionally fast healer and physically very strong, but I would have found it very difficult to return to work after one week, and I'm basically a desk jockey! I took two weeks off after my bilateral, and that was plenty for me. I think that one week is pushing it, but I certainly understand \"having to do what you have to do.\"",
      "MessageIndex": 9,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723810",
      "Title": "Mastectomy last week - expected to return to work! LiveLoveBelieve Rovergirl"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 6, 2013 10:34AM Celtic_Spirit wrote: Similar to you, I was diagnosed in February 2008 at age 48. I had bmx, chemo, and radiation as well. My onc prescribed four rounds of zometa...every six months for two years. My bone density study was done in spring 2009 after zometa infusion #1, and my onc said my bones were in \"great shape.\" I haven't had a bone density (or any other scan) done since. I, too, started off on tamoxifen (2 years) and then switched to Arimidex in December 2010. I'm rather curious about how much Arimidex has affected my bones. My onc use to check blood work every six months during my first year after chemo. Now I have neither scans nor blood work. I'm glad I don't have scans...I can do without an added dose of anxiety every six months. I don't know why some oncologists scan/do blood work and others don't. Maybe it's the hospital's/medical group's protocol or maybe personal preference. When I asked my onc about anniversary dates, she said that there's no firm consensus on it, but perhaps I should consider it to be some time around the beginning of my treatment. I chose the date of my mastectomy (March 25), since that's the day cancer left the building!",
      "MessageIndex": 2,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/800057",
      "Title": "Zometa and follow up testing questions. udpt82 Nancy10102006"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 9, 2009 05:02PM Celtic_Spirit wrote: KerryMac, are you from New Zealand? My mother was from there, and I still have extensive family living there. I had surgery first, too. The anesthesiologist for one of my surgeries told me not to read the Internet too much...most of the information is old, statistics outdated, studies done years ago. He serves on my hospital's tumor board, and he said the treatments have progressed light years from much of what's published on the Web.",
      "MessageIndex": 11,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/727075",
      "Title": "First post.... KerryMac Rainenz"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 7, 2012 04:39PM - edited Sep 7, 2012 04:39PM by Celtic_Spirit I had a bmx, so no yearly mammograms for me. I have follow up visits with my oncologist twice a year. During the first 1-2 years, I had CBCs and liver function tests done before each visit, and because I was receiving zometa, I also had renal function tests. She tested my cholesterol before taking Arimidex and six months after to see if it had risen. I turned 50 at the tail end of active treatment, and my gynelogical oncologist ordered a bone density test as part of the \"turning 50\" thing my HMO does. Now, during my follow up appointments, my oncologist asks about symptoms and if I'm still exercising, and then she manually pokes around my chest, underarms, and abdomen. Mostly we chew the fat about vacations, iPads, and cross-stitch. There's really not much for her to do during these visits...my blood work reverted to normal pretty quickly, I'm not experiencing any problems, and other than Arimidex, I'm not receiving any treatment.",
      "MessageIndex": 4,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/793128",
      "Title": "Follow up's ali68 ali68"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Dec 10, 2010 01:44PM Celtic_Spirit wrote: As my onc always tells me, don't put a lot of weight on one study.",
      "MessageIndex": 3,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761792",
      "Title": "Zometa - Latest News out of San Antonio Meeting voraciousreader Gitane"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Sep 13, 2011 12:27PM Celtic_Spirit wrote: I read that first thing this morning. Pretty awesome!",
      "MessageIndex": 1,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/774767",
      "Title": "The future of cancer treatment is here!!! bejuce sweetbean"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 5, 2009 02:18PM Celtic_Spirit wrote: Congrats, congrats! I knew you'd get there! It may sound corny, but I had a theme song that kept me going during this long course of treatment and recovery: \"St. Elmo's Fire\" by John Parr. It's amazingly appropriate for anyone fighting this fight, but esp. for a hiker and bicyclist like me: I can see a new horizon Underneath the blazin' sky I'll be where the eagle's Flyin' higher and higher Gonna be your man in motion All I need is a pair of wheels Take me where my future's lyin' St. Elmo's Fire I sang that song in my head or belted it out in the car almost constantly. I esp. liked the lines \"I can make it, I know I can...\" It kept me focused on the future, not the misery I was currently (then) experiencing. And, again, this weekend, I'm going to be up where the eagle's flyin', higher and higher (Iron Mountain in Poway). LOL! Again, congrats, everyminute! You go, girl!",
      "MessageIndex": 12,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/728547",
      "Title": "End of active treatment everyminute everyminute"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Jan 12, 2009 11:08PM Celtic_Spirit wrote: I breezed through bi-lat mastectomy and chemo, then felt like I hit a brick wall with radiation. I never truly knew what tired was before because I'm such a high-energy person. However, I managed to work full-time, run errands, socialize, etc. I just hit the sack at night around 8:30-9:00 instead of my usual 10:30. However, the tiredness, for me, didn't come on until about week 4 of 6. My radiation onc kept asking, \"Aren't you tired yet?\" I finally said, \"No, you'll just have to try harder!\" LOL! That's what I get for being sassy! But a month later, I felt worlds better, and I'm back to my usual monkey business. Rads may not be as hard for you...I had other things going on at the same time that probably worsened my fatigue (starting Tamoxifen, a staph infection, Zometa infusion, sinus crud). I've known women who experienced no fatigue.",
      "MessageIndex": 21,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/726961",
      "Title": "side effects of radiation therapy Maria217 Imasurvivor"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 11, 2010 09:06AM Celtic_Spirit wrote: I started tamoxifen the week before rads. I saw my rad onc weekly, and it was nice having her to bounce questions off or check symptoms with. She's the one who suggested I split up the dosage to minimize side effects, i.e., take one pill in the am and the other pm, as I was getting bad bone aches and hot flashes.",
      "MessageIndex": 22,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748162",
      "Title": "What to Expect at Rads Office Pure carol1949"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "May 14, 2009 10:48PM Celtic_Spirit wrote: So very sorry to hear about your friend and her husband. I pray that she finds some peace during this heartbreak. She is lucky to have a caring friend like you.",
      "MessageIndex": 6,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734215",
      "Title": "Her Husband Passed Away Tonight lovemyfriend PattyP"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Feb 10, 2010 01:28PM Celtic_Spirit wrote: I'm sure there's a lot of variance between clinics and rad oncs, but here's what happened at my first appt. I met with the radiation onc, she went over the plan she created for me and why she was recommending what she did; we talked about my general health, skin care, diet, and what to expect from treatment (i.e., possible side effects); she examined my surgical sites and told me everything looked good. She told me I would meet with her weekly, and she answered the questions I had at that time. Scans - yes, they do some sort of low-level CT scan so they can get your positioning tattoos correct (probably for other reasons too; doesn't involve drinking anything nasty or getting an injection). During the first five or so treatments, they did xrays (I guess to see if they were hitting their marks). For me, it wasn't a bad experience. My rad onc was very nice and professional, and I don't remember her saying anything discouraging. The techs were great and fun to joke with.",
      "MessageIndex": 1,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748162",
      "Title": "What to Expect at Rads Office Pure carol1949"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 23, 2014 02:11AM Celtic_Spirit wrote: I thought I'd add that my treatment for shingles was 12 years ago, and there's been developments in treatments for shingles since then. More effective drugs and pain killers may lessen the side effects and length of your outbreak. I certainly hope so!",
      "MessageIndex": 4,
      "PostDate": "23/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819425",
      "Title": "Questions re: Shingles justjudie justjudie"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "Mar 23, 2014 01:59AM Celtic_Spirit wrote: I hope you don't mind me commenting, but I saw the topic and have some experience (unfortunately) with this subject. I had shingles about 12 years ago (pre-cancer). Mine started like yours, on my back, and then under my breast, almost forming half a band around my torso. It was a pain that hurt clear through my body, from my back through to my front. As it progressed and I broke out in small blisters (like chicken pox), it hurt, ached, and itched at the same time. Ugh. There's about a 72-hour window during which you should get meds. After that, they aren't as effective. My symptoms started on a Saturday, and I managed to scoot into the doctor's office just in time. For pain, my doctor gave me a drug that in higher doses is used as an anti-psychotic. It may have been nortriptyline, but I'm not sure. She also gave me something to combat the virus. The pain and blisters lasted 8-14 days. I still had some nerve pain in the arm nearest to the rash, but that resolved over a few months. I don't have any permanent damage from shingles. Ask your doctor if cold compresses might help the pain and itching. Also ask about getting a pain killer in the class that treats referred pain (tricyclics, I believe), such as nortriptyline. These drugs and others are used to treat sciatica and fibromyalgia and may work better than morphine or Dilaudid. I hope this helped. Take care of yourself.",
      "MessageIndex": 3,
      "PostDate": "23/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819425",
      "Title": "Questions re: Shingles justjudie justjudie"
    },
    {
      "AuthorID": "Celtic_Spir…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73034/profile",
      "Content": "May 14, 2009 09:33AM Celtic_Spirit wrote: Yes, I have pain in both legs, and my onc says it's probably the taxotere with a little tamoxifen achiness thrown in. The pain moves around...one day, it'll be in my knees. The next, my ankles. Then my shins, etc. It hurts worse at night. But I don't let it get between me and the things I love to do, such as hiking.",
      "MessageIndex": 2,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/734157",
      "Title": "severe leg pain rferraris rferraris"
    }
  ]
}