{
  "AuthorID": "celtic61",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129701/profile",
  "Posts": [
    {
      "AuthorID": "celtic61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129701/profile",
      "Content": "Jun 21, 2011 07:34PM - edited Jun 21, 2011 07:35PM by celtic61 Thanks for the reply, but I avoid tucking my hands under when I sleep, because I know that is a cause for CTS. Since I last wrote, I have noticed my hands are considerably less numb and tingly. Although my shoulder pain seems to be getting better, I now have a clicking in my left thumb-like the tendon is tight and causes my thumb to \"snap\" when flexing. I am considering going to have Ionic Detox foot cleanse done-can't hurt and my MT swears by it. I have an appt in a few days with my Ortho doc for my left shoulder. I want to get back to weight lifting, but it still bothers me-he wanted to inject it right off the bat, and I told him no way-I'm willing to try iontophoresis ultrasound first. It would be nice to hear from other people who suffer from post Taxol myositis and what can be done about it. This is so frustrating!",
      "MessageIndex": 3,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767466",
      "Title": "Hand numbness one year after mastectomy momofcuig Shrek4"
    },
    {
      "AuthorID": "celtic61",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129701/profile",
      "Content": "May 25, 2011 07:35AM - edited May 25, 2011 07:35AM by celtic61 HI, I have had the same problem with the numbness and tingling in both hands, left is worse than right. I too had chemo from Sept. 2010 to end of Dec. 2010, A/C/T. I basically have the same diagnosis as you. I had a right mastectomy with tissue expander. I just had stage 2 reconstrutive surgery a week ago. Around the end of February, I began to notice numbness and tingling in the left hand, all but the fifith finger which correlates with a medial nerve injury/inflammation. Also, it seems that whatever area of my body that was achy before chemo has really become painful, I was a runner and did weight lifting. To me, it seems that the Taxol damaged these areas. My onc.doesn't think my neuropathy and generalized pain is from the Taxol, but I beg to differ. I want to find out more about the effects of this drug and does it really do what it's supposed to do;other than decrease the quality of your life. It will be interesting to hear from other folks who have been through Taxol. I am a student Nurse Practitioner(yes, I stayed in school during this whole ordeal and  maintained a 4.0),and want to find out if there's anything we should be doing to prevent the aftermath of Taxol-I feel this is my job as a nurse and future NP to find this out.",
      "MessageIndex": 1,
      "PostDate": "25/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767466",
      "Title": "Hand numbness one year after mastectomy momofcuig Shrek4"
    }
  ]
}