{
  "AuthorID": "CENOK2017",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265288/profile",
  "Posts": [
    {
      "AuthorID": "CENOK2017",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265288/profile",
      "Content": "Jul 16, 2018 06:41PM CENOK2017 wrote: Hi All, I had a very large tumor. 4X7x11 cm. I had originally been told I would need radiation so was prepared. Had complete response to chemo...no lymph node involvement..clean margins. Mastectomony June 12 with no evidence of cancer in removed tissue. Tumor board said I would probably only need monitoring to see if need radiation later. Needless to say, I was happy about that. Today, however, RO suggests 30 radiation treatments..,the last two being boost treatments. Can any of you give your opinion of the boost treatments? I was blind sided today because didn't expect to have to have radiation. I have heard horror stories of severe burns and ongoing side effects. I would love to hear pros and cons of radiation from those who have gone through it.  Thanks, Carol",
      "MessageIndex": 25,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "CENOK2017",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265288/profile",
      "Content": "Jul 20, 2018 10:11AM CENOK2017 wrote: Jersey Mom, I am hoping to start radiation either 30th or Aug 6. I have an appt the 26th with RO and hope to do simulation that day. We will need to keep in touch through this next step. The steps seem never ending, huh. I, too, am not afraid of the radiation, but only of the side effects. I also think, through NO research or crystal ball, that radiation will be shortened some day in the near future. I almost joined a clinical trial with a shortened rad time but then decided not to gamble. Did they explain why X's on back? That sounds scary. Hope they don't go that deep! From what I understand, I will receive 30 treatments, of which the last two will be boost. Ironically, I read where the boost is actually a lower dose of radiation but directed at scar. Keep posting. I will post when I know more. I am especially concerned about the redness and peeling which I understand does not happen right away. I also have a two hour drive each way but Cancer Center has provided discounted hotel rooms I can check out Prayers for us both and all pink sisters. Carol",
      "MessageIndex": 33,
      "PostDate": "20/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "CENOK2017",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265288/profile",
      "Content": "Aug 11, 2018 08:24PM CENOK2017 wrote: I definitely find radiation more emotionally challenging than chemo. I hate it and pray everytime I am on the table that God guides the techs' hands and the machine to seek out any microscopic cancer cells and be kind to the healthy cells, my heart and lungs. I have only had 8 out of 30 and am pinker than I was hoping I would be so early on. I put lotion on 4 times a day. Good luck to all of you. Carol",
      "MessageIndex": 68,
      "PostDate": "11/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "CENOK2017",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265288/profile",
      "Content": "Oct 16, 2018 08:35PM CENOK2017 wrote: Have any of you had radiation, waited several months, and then had tissue expanders put in? Just wondering because that is my plan at this time",
      "MessageIndex": 3,
      "PostDate": "16/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/866898",
      "Title": "Trouble with reconstruction after radiation bhansen66 kellymoye"
    },
    {
      "AuthorID": "CENOK2017",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265288/profile",
      "Content": "Jan 3, 2018 01:13PM CENOK2017 wrote: Dear All, How do you determine cm size to list on profile? My BS, after MRI Gave me 3 numbers and they are huge compared to anyone's anywhere in this sight I can find. I am a wreck and didn't think to ask him today why he gave me 3 numbers. He said size of baseball. Please, if any of you can private message me, i would appreciate it. Waiting for today's biopsy to see if invasive, which he highlysuspects after talking to RO. Mastectomy (how do u abbreviate? ) for sure after chemo, Terrified.",
      "MessageIndex": 4372,
      "PostDate": "03/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "CENOK2017",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265288/profile",
      "Content": "Dec 30, 2017 10:07PM - edited Dec 30, 2017 10:09PM by CENOK2017 Stereotactic biopsy December 12. This Is Dec 30. I think I might have hemotoma? No brusing but hard lump and stinging. New Year's Eve weekend....sigh. Any suggestions",
      "MessageIndex": 3,
      "PostDate": "30/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857256",
      "Title": "Lump after stereotactic core biopsy AmandaJeanette Silbar"
    },
    {
      "AuthorID": "CENOK2017",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265288/profile",
      "Content": "Feb 23, 2018 08:30AM CENOK2017 wrote: woke up this morning with blood coming from rectum. I did not have a bowel movement yesterday. Could this be normal? I had my second round of chemo Monday",
      "MessageIndex": 588,
      "PostDate": "23/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "CENOK2017",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265288/profile",
      "Content": "Feb 24, 2018 02:27PM CENOK2017 wrote: Thank you all for your concern! MO has me on Senna and now no blood! Think it was from hemmroids. I'm opposite of most of you and get constipated!  Take care of yourselves and again thanks for comments! ",
      "MessageIndex": 602,
      "PostDate": "24/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    }
  ]
}