{
  "AuthorID": "CessaLyn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194574/profile",
  "Posts": [{
    "AuthorID": "CessaLyn",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194574/profile",
    "Content": "Jan 10, 2014 09:28PM CessaLyn wrote: I was diagnosed w/ right side, stage 1 ductal in situ 3 cm, estrogen positive, breast cancer, with no lymph nodes involved, on Dec 27, 2004, had lumpectomy 17 days later on Jan 13, 2005, followed by 12 weeks of radiation - I'm here over 7yrs later, w/ no reoccurrence, yet still suffer greatly from underarm & chest wall/muscle/rib pain, with swelling! Hurts to raise my arm above my head, or to wash the back of my hair, or to stretch in any fashion? I'm told it is probably costochrondritis (but all my info on this says it should lesson over time, yet mine never has) began almost immediately with the start of the rad treatments. I also have RA & feel like this might contribute to the inflammation. But what you are describing sounds a lot like costochrondritis, you might bring this up with your caretaker & see what they think. I feel like I wasn't fully made aware of the complications from the damage radiation would do, I had very good insurance so I could make choices in treatment but wasn't even made aware of things like the seed radiation treatment that would have been one week long in the hospital, & from what I understand does a lot less damage than weeks of radiation. Please, Please, Please, - anyone who is newly diagnosed, in early stage, take the time to do the research, read personal experiences and not just what the radiologist/oncologist is telling or not telling you, I sometimes wonder if it was a $ issue not to bring up other types of rad treatment since the final bill to my insurance co. For just the rad treatments was close to $79,000 - YOU have to live with the side effects, they don't! Happy to be here, but would like a little less pain.",
    "MessageIndex": 3,
    "PostDate": "10/01/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/70/topics/816658",
    "Title": "Long Term Radiation Side Effects 10+ years After? Barbarella60 Raebrewster1971"
  }]
}