{
  "AuthorID": "cgesq",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155448/profile",
  "Posts": [
    {
      "AuthorID": "cgesq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155448/profile",
      "Content": "cgesq wrote: Hi.  I was told I would prob need 8 cycles of chemo after my bmx surgery over 4 months and then herceptin for a year.  I was hoping the ps or bs could insert the port during the bmx surgery.  I figure since I would need one anyway, I might as well have it put in then, and save myself from (a) getting \"stuck\" for blood draws lots of times during my hospital stay, and (b) another procedure to insert the port at a later date. Is this a good idea?  The ps said he had never done that, and to speak to the onc or bs, which I will do this week.  Is there a reason this shouldn't be done?  It seems obvious to me to do it.  What am I missing???  Thanks,  Dx 6/14/2012, IDC, 1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR+, HER2+ Surgery 7/24/2012 Mastectomy: Left, Right; Reconstruction (left): Latissimus dorsi flap, Tissue expander placement; Reconstruction (right): Latissimus dorsi flap, Tissue expander placement Targeted Therapy 9/11/2012 Herceptin (trastuzumab) Chemotherapy 9/11/2012 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 2/3/2013 Reconstruction (left); Reconstruction (right) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/790593",
      "Title": "Port insertion during bmx and LD recon surgery. Yes or No? cgesq kayakgirl"
    },
    {
      "AuthorID": "cgesq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155448/profile",
      "Content": "Jul 18, 2012 10:27AM cgesq wrote: My bs said no to putting the port in now because I am doing the lat dorsi (back flap) reconstruction and they would have to rotate me 3 times during the procedure, she said it would be too complicated.  Also, she said a thorasic surgeon would be needed to do the port (although that seems like overkill to me!). Oh well...I thought it was a good idea! ",
      "MessageIndex": 8,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/790593",
      "Title": "Port insertion during bmx and LD recon surgery. Yes or No? cgesq kayakgirl"
    },
    {
      "AuthorID": "cgesq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155448/profile",
      "Content": "Jul 15, 2012 09:29AM cgesq wrote: Thanks for your thoughts.  I will discuss it with the bs when I see her this week. Cheryl ",
      "MessageIndex": 5,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/790593",
      "Title": "Port insertion during bmx and LD recon surgery. Yes or No? cgesq kayakgirl"
    },
    {
      "AuthorID": "cgesq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155448/profile",
      "Content": "Mar 9, 2013 05:03PM cgesq wrote: Denise, I didn't lose my eyebrows or lashes either.  I too am not a makeup person and never bothered to use a pencil.  My eyebrows and lashes looked slightly thinner, but fine throughout chemo. Crazyride,  You have great hair!!",
      "MessageIndex": 18990,
      "PostDate": "09/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "cgesq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155448/profile",
      "Content": "Feb 25, 2013 12:42AM cgesq wrote: Love the halo hair and caps.  I have used a halo/cap combo throughout chemo.  I thought it looked more like me than a conventional wig.  It is also much cooler than regular wigs. On the shampoo question, I didn't use shampoo during chemo.  I sort of felt that there wasn't hair to clean, so why use shampoo.  I use dove soap on my body, and used it on my scalp during chemo.  I found my scalp was less itchy---maybe the moisturizers in dove lessened the dry skin.   Lastly, for those who take or took biotin after chemo, what is the best dosage?  Is there a recommended brand? Thanks,",
      "MessageIndex": 18861,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "cgesq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155448/profile",
      "Content": "Aug 1, 2012 12:09PM cgesq wrote: Hi Amy, I am one week behind you.  Had a bmx with back flap reconstruction with TEs on Wed, 7/25.  My ps prescribed 10 mg of valium before bedtime (along with percoset for all around pain and antibiotics) and explained that the valium was mandatory, even if I wasn't feeling anxious.  He said it was to alleviate the muscles from spasming around the TEs. That really has eliminated the situation you speak of.  I haven't had too much pain at all with the TEs.  Yes, I feel some mild discomfort, but nothing close to what you are describing. Ask your dr. for a precription of valium and see if that helps. Good luck, Cheryl ",
      "MessageIndex": 28,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/790164",
      "Title": "Chest/Muscle pains after bmx Amy_AZ froggy12"
    },
    {
      "AuthorID": "cgesq",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155448/profile",
      "Content": "Apr 17, 2018 05:47AM cgesq wrote: Buttercup1, I had a port and I'm thrilled I got it. I too was her2+ so I wound up getting 36 infusions over the course of a year. The port was invaluable and saved my veins! Mine was placed under my bra strap area on the left side of my chest and was not visible. It bothered me for the first few days and then I didn't even realize it was there. I kept mine for about a year after I finished chemo, just in case! Ask for a power port..this way you can get blood drawn from the port as well. Lastly, ask for a prescription for the emla (lidocaine) creme and put it on about an hour before your port needs to be accessed. As somebody above mentioned, put saran wrap over the lidocaine after you apply it so it doesn't stain your clothing. If you are still anxious about the port, or for your upcoming treatments, ask for a prescription for xanax. It helps take the edge off and will make the next few months much more tolerable. Best of luck!!",
      "MessageIndex": 19,
      "PostDate": "17/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863991",
      "Title": "Chemo Port-O-Caths: Did you get one? What was is like? buttercup1 exbrnxgrl"
    }
  ]
}