{
  "AuthorID": "CGG",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255256/profile",
  "Posts": [
    {
      "AuthorID": "CGG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255256/profile",
      "Content": "Jul 21, 2017 09:19AM CGG wrote: I can see that would be nerve-wracking. Have you tried to change your view of all the testing? I've always regarded my yearly mammograms as a treat and a positive thing because I greatly appreciate knowing what is going on inside my breasts. So regardless of the good or bad news coming from the tests, I like knowing. So it's a really positive experience for me, regardless of results and stress. As for the testing, it seems that perhaps your mother is scared that that is why she has not filled out the paperwork or done the testing. I encourage you to tell her how important it is to you that she get tested because you are worried about her and because of how the test results impact your life, your breast surveillance, and your desire to get tested yourself. Put in those clear terms, it is almost like a geometry proof that clearly shows that she needs to get tested because of how it impacts you. Perhaps that would help. Good luck!",
      "MessageIndex": 1,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/857205",
      "Title": "A year and a half in.. Yllier419 sm627"
    },
    {
      "AuthorID": "CGG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255256/profile",
      "Content": "Dec 31, 2017 08:26AM CGG wrote: Thank you for the information! I hadn't thought about LE or measurements, that's helpful. But since I'm having the surgery prophylactically, and I'm not doing SNB because it isn't warranted (at this point), it might not be relevant to me. One the other hand, a frozen section during surgery might reveal CA, so doing the measurement ahead of time is a good idea just in case. But my guess is that anytime the tissue is disturbed to that degree, LE is possible, right?",
      "MessageIndex": 6,
      "PostDate": "31/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860997",
      "Title": "Exercises before surgery CGG Shadie"
    },
    {
      "AuthorID": "CGG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255256/profile",
      "Content": "CGG wrote: What are your thoughts about being in shape and how much to exercise before surgery? What is the impact of having toned & in-shape pectorals vs. not before going in for MX and reconstruction? I'm going to have PBMX with reconstruction this coming spring and I wanted to know if our collective knowledge points to a benefit from being in good shape vs. just being regularly out of shape (beyond the obvious of being healing better & tolerating surgery better). How will the shape and condition of my pectoral muscles impact the TEs and later permanent implants? Is the stretching of the pectorals for the TEs easier or worse with well developed pecs? Any advice you can share would help. Thanks! Dx 4/2017, LCIS, Both breasts Surgery Lumpectomy: Left Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860997",
      "Title": "Exercises before surgery CGG Shadie"
    },
    {
      "AuthorID": "CGG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255256/profile",
      "Content": "CGG wrote: I've read lots of post from members with one abnormal cell type or another, but haven't yet found a post regarding having all three cell types diagnosed. I've got all three types and they are all over my pathology slides ('full field defect'), so these are quite prolific in my tissue. Who has experience with this and what were the recommendations of your doctors? What did you decide to do? I've got consultations coming up in August and have read about possible options. I'd love to hear what were advised and how they decided to proceed. Thank you. Dx 4/2017, LCIS, Both breasts Surgery Lumpectomy: Left Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/856628",
      "Title": "Anyone with LCIS and ALH and ADH? CGG CGG"
    },
    {
      "AuthorID": "CGG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255256/profile",
      "Content": "Jul 8, 2017 12:56PM CGG wrote: Thanks for the responses and for sharing how you have treated it.",
      "MessageIndex": 5,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/856628",
      "Title": "Anyone with LCIS and ALH and ADH? CGG CGG"
    },
    {
      "AuthorID": "CGG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255256/profile",
      "Content": "Feb 4, 2018 10:21PM CGG wrote: I had a similar experience with bruising post lumpectomy, that's normal and to be expected. I developed a large lump/hematoma in the surgery area which bothered me more but I felt better once my doctor told me that it was totally normal for that to develop. The bruise and the lump all went away in good time. If you get a lump/hematoma, massage it everyday and it will go away in a few weeks. Good luck!",
      "MessageIndex": 4,
      "PostDate": "04/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/862098",
      "Title": "Bruising after Lumpectomy Veeder14 Veeder14"
    },
    {
      "AuthorID": "CGG",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255256/profile",
      "Content": "Jul 8, 2017 12:51PM CGG wrote: Personal references from friends or other tangentially connected people or from previous patients are helpful. Reading reviews online is not, you'll likely see negative & biased opinions. I'd steer clear of those.",
      "MessageIndex": 18,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856669",
      "Title": "How to assess a surgeon's expertise/quality MLScott CGG"
    }
  ]
}