{
  "AuthorID": "Cgirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96078/profile",
  "Posts": [
    {
      "AuthorID": "Cgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96078/profile",
      "Content": "Mar 8, 2010 07:15PM - edited Mar 8, 2010 07:16PM by Cgirl I assure you I never skipped a daily shower. something does not sound right =the markers are either permanent- (I was marked with medical markings at least three places about a week before starting treatment) or sharpies. however at no time was i told to protect the area from water. when they did the sims or boost with temporary markings they tried at first to cover the sharpie markings with waterproof tape.  Unitl i got a reaction-   Please note that I worked out or tried to work out daily at the gym. if i did not go to the gym, i showered at home. i even  skied several times during treatment too and always showered after skiing. i was remarked then with markers/sharpies for the  7 boosts at the end. they did use sharpies /markers in the smaller areas for th e boost. likely because the area was too raw to permanently mark my breast.",
      "MessageIndex": 4,
      "PostDate": "08/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/749485",
      "Title": "Exercise MariannaLaFrance 3monstmama"
    },
    {
      "AuthorID": "Cgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96078/profile",
      "Content": "Mar 8, 2010 10:59PM Cgirl wrote:",
      "MessageIndex": 8,
      "PostDate": "08/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/748822",
      "Title": "what does the stylish rad patient wear under her shirt? 3monstmama InMontreal"
    },
    {
      "AuthorID": "Cgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96078/profile",
      "Content": "Mar 9, 2010 02:08PM - edited Mar 9, 2010 02:11PM by Cgirl Leah S  is correct , and you'll want the weekends off.  My rad onc developed with the staff an individualized plan based on where the tumor was, my breast size and the dose was different. the number of treatments may be \"standard of care\" but the plans are different.  who has her arms above your head, who lays on your back, or stomach, etc. for me  I had 23 full breast treatments and 7 boosts to the tumor area with the maxi um dosage available for all 30 treatments. Due to holidays I was treated on the weekends and at the end  the boost area was treated, that area was defined by the tumor markers left in my breast during surgery).  I asked for and got New Years Eve off .",
      "MessageIndex": 17,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/749143",
      "Title": "Can you/did you ever miss a day? Raili Raili"
    },
    {
      "AuthorID": "Cgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96078/profile",
      "Content": "Jan 26, 2010 08:28PM Cgirl wrote: Somanywomen, OMG, I can so relate we too had  major and minor unexpected house repairs You must feel broad sided with the copay bills shame on them for NOT mentioning even the possiblity of a co-pay.",
      "MessageIndex": 478,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "Cgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96078/profile",
      "Content": "Jan 26, 2010 01:48AM Cgirl wrote: Gel Sheets worked wonders for me. It was about week 4 weeks into treatment when it seems like overnight I developed a painful wound about 3-4 inches long under the breast. It looked like a cut not really a burn, but it was a burn that was more painful than surgery.  (the line was where the breast and chest meet) My Rad doc immediately discontinued my full breast treatment I skipped one day to heal and then we started boosts a few days early. Additionally I too had a reaction to tape. RADIADRES gel sheets are a GOD send.  The sheets are self sticking- I had no reaction (I developed a rash to the tape too and had to be marked every day for the boosts).",
      "MessageIndex": 42,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736027",
      "Title": "Severe radiation burns to the breast RCindy"
    },
    {
      "AuthorID": "Cgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96078/profile",
      "Content": "Mar 8, 2010 10:24PM Cgirl wrote: A bright light has done out with Steeny's death.  My  condolences to her friends and family.",
      "MessageIndex": 640,
      "PostDate": "08/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "Cgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96078/profile",
      "Content": "Jan 26, 2010 06:03PM Cgirl wrote: Somanywomen, a little late to joining the group, but I finish my 30th treatment this Thursday. I experienced all the physical discomforts and pain that many members described. For what it is worth, my insurance company told me before treatment began and even before I made my first appointment with the rad.doc. (Who was \"\"net work\") that under my plan each treatment was considered an individual service. E.g. 25.00 x 30 or $875.00. Of course that was on top of all the other deductibles and co pays. Trust me; I tried all powers of persuasion and reason including the fact that I am physically being treated at a hospital or at the \"cancer center\" at the hospital. The insurance company said it did not matter.  They did not care how the facility billed it was seen as outpatient treatment and done individually for each session. They referred me to the plan my company enrolled us in (of course the plan changed only a few months before my diagnosis). They also charged me two co=pays for the MRI -preformed pre-surgery of the two breast.  All in all, like you Radiation co- pays are about $1000.00.",
      "MessageIndex": 475,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "Cgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96078/profile",
      "Content": "Mar 2, 2010 09:10PM - edited Mar 2, 2010 09:11PM by Cgirl Adrienne, I was suppose to start on 20mg per day, however my blood pressure has been off the charts high since I started radiation treatment last December. Or  least I like to blame the increase in my blood pressure on the radiation tx as my BP has aways been perfect 120/80.  I have no other reason to explain the spike but on the treatment. I also think it could be related to the three co-pays I am being charged  a day for some of the treatments when i saw the rad. doc, had treatment and someone behind the curtain was working on some scans or formulas. The  last insult lobbed, post diagnosis was yesterday and it came from an admission's  clerk for a post treatment excerise program at the hospital who called me obese! thank youm  admittedly i am 10-20 lbs over weight however, I gained the last 10 in the last year and was referred to the program to address my  increase in BP and finally maybe it's because i wrecked my partner's car by hitting our other car.....  just when i thought it was getting easier.",
      "MessageIndex": 622,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "Cgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96078/profile",
      "Content": "Jan 28, 2010 10:48PM - edited Jan 28, 2010 10:50PM by Cgirl Chinablue Personally I found the afternoon appointments to be perfect. I finished my 30th treatment tonight. (Celebrated by going to dinner at Morton's with my partner we have not been out this later in 7 weeks) Anyway originally I selected morning appointments thinking I would get in and out and have the rest of the day to work. Quickly learned that it did not work for me.  For some reason I was always running late. In fact the traffic at that time sucked, all those school buses I never saw before and when I got there it was way too stressful.  I never got in and out like I thought I was going to be able.   For example, x-rays, blood work or weekly appointments with the rad doc sometimes did not get to the office until 10 or 11. Luckily the second week I switched to the last appointment they had and it worked out great.  In fact, the last appointment allowed me to get treatment and go home to rest.  It forced me to take time for myself. One woman's opinion, good luck, and time does fly by. BEST to all, Diagnosis: 8/19/2009, 1cm, Stage I, Grade 2, 0/1 nodes, ER+/PR+, HER2-",
      "MessageIndex": 495,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    }
  ]
}