{
  "AuthorID": "chapuzan",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/42455/profile",
  "Posts": [
    {
      "AuthorID": "chapuzan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/42455/profile",
      "Content": "May 24, 2007 05:05PM chapuzan wrote: I guess I said it wrong because I was freakin out. I was dx in Nov 06. I had a lumpectomy and 4 lympnodes remove from under my left arm and only 2 were cancerous so she thought the rest was clean. I started my chemo Jan 07 and finished 20 Apr 07. My doc was removing the remaining lympnodes so that I would not have to have radiation under my arm and that is when she found the cancer. I just thought the chemo had killed any cancer that was left.",
      "MessageIndex": 5,
      "PostDate": "24/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/616526",
      "Title": "cancer after chemo chapuzan Annaanne"
    },
    {
      "AuthorID": "chapuzan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/42455/profile",
      "Content": "Jan 8, 2007 06:18PM chapuzan wrote: It has finally hit me today may be because I'm having my port put in tomorrow. I just said to myself \"self you have bc and you will start chemo this week 1/11/07. I want to scream and cry but I'm scared if I do I won't be able to stop and we don't want that. I'm military far away from home and family I'm by myself except for you guys and a few work associates. I'm so blessed to have found this site. I want to scream \"what the hell do I do now\"? It's so hard to stay focus today and sleep does not come easy. I'm praying for all of us.",
      "MessageIndex": 176,
      "PostDate": "08/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/477565",
      "Title": "Starting Chemo in JAN 2007 Robbin65 Robbin65"
    },
    {
      "AuthorID": "chapuzan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/42455/profile",
      "Content": "Jan 21, 2007 09:27AM chapuzan wrote: I'm getting ready for my second round of chemo on 25 Jan 07. I had my first on 11 Jan 07 my head is so sore and it itches so bad I don't know which one is worse the itch or soreness. I had a buzz cut last Tuesday and it looks pretty damn good...smile. Im trying to prepare for complete baldness and , girls,...as you know that ain't easy. I was a little tired on day 2&3 but not too much nausea but the mood swings were there. This time they say it will not take as long as it took last time. I'll be praying for us all.",
      "MessageIndex": 275,
      "PostDate": "21/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/477565",
      "Title": "Starting Chemo in JAN 2007 Robbin65 Robbin65"
    },
    {
      "AuthorID": "chapuzan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/42455/profile",
      "Content": "Jan 11, 2007 03:46PM chapuzan wrote: I started chemo today. I'm not feeling too bad right now I have a bad headache right now but it is one of the side effects. I'm getting a tired but it's another side effect....right. I was almost terrified when I went in to start. I wanted to get up and run but I new I couldn't. I met some very nice people today that reached out to me they said I was so young and scared (scared I was but not that young). I'll be okay this wasn't so bad.",
      "MessageIndex": 195,
      "PostDate": "11/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/477565",
      "Title": "Starting Chemo in JAN 2007 Robbin65 Robbin65"
    },
    {
      "AuthorID": "chapuzan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/42455/profile",
      "Content": "Jan 4, 2007 02:17PM chapuzan wrote: I start chemo 11 Jan 07. I am having the port put in 9 Jan I'm getting so worried now. I think what is about to happen to me is just settling in. I'm having trouble sleeping now and the hair falling out stays on my mind. I know that it just a part of surving this thing but I'm still freaking out over it. Even though my friends remind me that at least I'll have my life and I am thankful for my life. I know it should be the last thing I should be worrying about but I can't help it.",
      "MessageIndex": 137,
      "PostDate": "04/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/477565",
      "Title": "Starting Chemo in JAN 2007 Robbin65 Robbin65"
    },
    {
      "AuthorID": "chapuzan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/42455/profile",
      "Content": "Jan 30, 2007 08:37PM - edited Feb 14, 2009 12:46PM by chapuzan I had second round chemo on Thursday I had my hair cut down very low before.  On Monday my beautician came to my house and buzzed it off at no charge. I'm having a lot of itching now almost unbearable. Everything taste so bad I don't really have a desire to eat anything. This round had me in bed for 3 days it was worse than the first round. Only 12 more to go.",
      "MessageIndex": 442,
      "PostDate": "30/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/477565",
      "Title": "Starting Chemo in JAN 2007 Robbin65 Robbin65"
    },
    {
      "AuthorID": "chapuzan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/42455/profile",
      "Content": "chapuzan wrote: After going through surgery and chemo and thinking I was heading down hill I find out I'm still going uphill. I had all the lympnodes removed from under my arm because the doctor said if I did that I wouldn't have to get radiation under the arm but after they were removed they found more cancer. Cancer was found in 3 out of 17 with the largest mass 7mm. I guess that means the chemo didn't work . I am frighten it's so hard to think about my next step. This thing called Cancer is always popping up where you least expect it. What do I do now????????? My son graduates 2 June and I should be celebrating him not worrying about me. Thanks for listening. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/616526",
      "Title": "cancer after chemo chapuzan Annaanne"
    },
    {
      "AuthorID": "chapuzan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/42455/profile",
      "Content": "Jun 13, 2007 04:14PM chapuzan wrote: I had my firt dose of Rads today at 11:00 I was lying on the table crying to myself I was so frighten. It was not that bad I got sick afterwards I don't know why and I was rather tired and I went straight to sleep. It was almost like I could taste it. I thank you ladies for all your words of wisdom. I know it does get better ladies.",
      "MessageIndex": 64,
      "PostDate": "13/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/615877",
      "Title": "June 07 Rads leebrigs Lynn12"
    },
    {
      "AuthorID": "chapuzan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/42455/profile",
      "Content": "chapuzan wrote: I was diagnosed with IDC Nov 2006. I had a lumpectomy and had the lymph nodes remove from my left arm. I had chemo and radiation. In Dec 2008 my doctor found another lump in the same breast I had another lumpectomy it wasn't cancerous (thank God). That was 2 months ago  and the pain is so bad. It hurts when I drive when I'm just sitting still. I don't understand why. The area is constantly in pain. I hate to say it but I don't think Breast cancer has as much research in the U S Army as with civilian doctors. I have a lot of pain on my left side, the leg and over the rib cage. Does anyone else experience this? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729086",
      "Title": "Bad pain 2 months after lumpectomy. chapuzan Roberta77"
    },
    {
      "AuthorID": "chapuzan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/42455/profile",
      "Content": "Feb 15, 2009 06:43PM chapuzan wrote: Grace,  Thank you and everyone for the responses. I do having swelling in the breast most of the time. I am going to get another opinion.",
      "MessageIndex": 7,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729086",
      "Title": "Bad pain 2 months after lumpectomy. chapuzan Roberta77"
    }
  ]
}