{
  "AuthorID": "charmd",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
  "Posts": [
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Oct 4, 2009 01:33PM - edited Oct 4, 2009 01:34PM by charmd I had my last chemo in May, just finished rads and started on Tamox, but I still have pain in my legs, hips and back.  It's not constant, just flares up now and then.  One thing I did notice was that Levaquin during the chemo regime was brutal for foot and leg pain.  Finally, I couldn't take it any more and before my last round of chemo said something to my onc.  He changed me from Levaquin to a different antibiotic.  It was a 180 degree change.  Even thought I was worn out from all the chemo, I was able to walk.  I felt like kicking myself for not saying something sooner to the onc. ",
      "MessageIndex": 23,
      "PostDate": "04/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740936",
      "Title": "Still pain, when will it go away... Mamita49 lexislove"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Sep 27, 2009 05:30AM charmd wrote:",
      "MessageIndex": 4,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/740978",
      "Title": "David Vs. Goliath SpunkyGirl apple"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Jul 27, 2009 11:27AM charmd wrote: I had my last chemo on May 21st, and started getting the fuzz last week.  My kids went out of town on Thursday for a long weekend.  When they saw me last night, they were amazed at how much my hair had grown and how dark it looked.  I  still can't tell much difference, but they seemed to think it was a big change if just 4 days.  I was starting to freak out because I had heard that about a month after chemo the hair would start to grow back, but it wasn't.  Now, just out of no where its growing.  I have not worn wigs during this time, just scarves and hats.  I live in Jacksonville, Florida and by the time I cut my hair off last February, it was already in the 80's.  I couldn't justify spending the money on a wig I knew I wouldn't wear.  This past weekend, I made my first foray into going without cover.  I took a baby step and went to my church prayer group.  Everyone acted like it was no big deal, which made me feel more comfortable.  I'm not ready to go out in the general public yet, but hopefully it won't be too much longer. Blessings to all of you -- we are all beautiful! Charmaine ",
      "MessageIndex": 2932,
      "PostDate": "27/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Jul 6, 2009 06:04PM - edited Jul 6, 2009 06:06PM by charmd Hey Jen,  It sounds like we've been on the same journey.  After completing my last Chemo around the end of May, I went in for a bi-lateral mastectomy on June 19th.  I went back to the surgeon a week later and he discovered a problem and I had to go back for a second surgery on my left breast - or what was left of it.  Luckily, it was an out-patient procedure.  The reason I'm telling you this is because on that first post-op visit with the surgeon, I end up looking at the scar site so I could see the problem that had to be fixed. The short of it was that the blood vessels were too damaged and the incision wasn't healing properly.  I thought I would be really freaked out looking at the scars for the first time.  I too had been a warrior through Chemo, but the surgery really freaked me out.  Honestly, I didn't like what I saw when I first saw the scar, and today, I still have times when looking at them unnerves me.  However, each time I look at them, it's easier. I decided to postpone reconstruction, and I might not do it at all.  I decided to give myself time to see what I could and couldn't live with or without as the case may be.  I wish you all the best.  Take your time as others have suggested.  However, don't be afraid.  No matter what it looks like you are still you.  Before my surgery, my hubby told me that he didn't care if I had breasts, but he did care if we had another 40 years together.  I'm sure your family feels the same way about you.    May God bless you and keep you. Charmaine ",
      "MessageIndex": 14,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/736958",
      "Title": "Scared To Look At My Surgical Site ibjennifer125 pshelton"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Aug 3, 2009 07:50AM charmd wrote: Sue,  Good luck at your apt. today and Godspeed in your recovery. Charmaine ",
      "MessageIndex": 53,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Aug 5, 2009 05:47PM charmd wrote: Hi Kristen, Thanks for the concern for my son.  Buck is fine.  He has a very slight curve to his spine, but nothing to be concerned about today.  We will get another xray in 6 mos to check it again.  I actaully felt sorry for his step mom when the ped doc was talking to her like she was overreacting.  Since I am in the middle of a nasty legal dispute with my ex regarding cutody and child support, I am choosing to beleive that Dr. Barbie is showing genuine concern for my son, and this was not some granstanding on their part to try to look like good parents. I might actually start believing this if the little devil on my shoulder would just stop whispering in my ear. All the Ladies: Hope all of you are doing well today.  I'm feeling pretty yucky, I think it's just fatigue coupled with a bad lunch eating out today.  The kids and I are all feeling a little off and I think it was something we ate. Hugs to all. Charmaine",
      "MessageIndex": 83,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Aug 6, 2009 07:15AM charmd wrote: Dayla:  Thanks.  Hope you have good day. I swear by Aquaphor.  I've used it since my kids were little.  When my son was born, the docs suggested it for his circumcision wound and diaper rash.  Since then, I've used it for just about everything.   Charmaine ",
      "MessageIndex": 86,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Aug 11, 2009 05:09PM charmd wrote: Hi Everyone, I had #9 of 35 today.  Just feel yucky.  Is that a medical term??  Kinda of queasy, fatigue, and a weird pressure like pain in the base of my skull.  Of course, none of these are suppose to be side effects -- only fatigue later down the road.  I don't know.  Maybe these symptoms have nothing to do with the rads.  I don't know.  The only thing I do know is that I'm so tired of feeling tired, and I'm so sick of feeling sick.   Well enough of my rant for today.  Hope all you amazing ladies are having a good day. Charmaien ",
      "MessageIndex": 102,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Sep 27, 2009 02:21PM - edited Sep 27, 2009 02:21PM by charmd Pure:  I feel your pain and anger.  In the past year, I gone through those same emotions. I am 41 with a 10 and 12 year old.  Last Friday, I finished my last radiation, my hair is starting to come back.  The reason I tell you this is that you can and will get through this - just take it a day at a time. I had a lot of mommy guilt at the beginning of my treatment.  My daughter was a competitive gymnast. She would be in the gym 4-5 days a week- 3-5 hours at a time.  It was just too much for me to keep up with, even with trying to arrange rides, etc.  We decided for her to take a break, at least until I got past the surgery.  I felt so bad making her give up something she had dedicated so much time and energy towards.  The ironic thing is she was happy to quit.  When I said she could go back she didn't want to return to gym.  She likes the free time, her grades have improved, she is enjoying middle school activities, and has started a dance class (once a week).  All in all she is a happier girl now than before I was dx.  As for my son, I made every practice and game, even though I thought I might not make it some days.  Looking back, I am really glad I did.  It showed him and others that this disease is not a death sentence, and that we can go on living our lives regardless of it.   Today my relationship with my children is even stronger than before I was dx.  I may not be able to be room mom, or drive the mom taxi everywhere, but my kids and I spend more time together, and the residual effect is that they are happier than before when we were on a crazy schedule.  My suggestion is loose the mommy guilt. When ever it creeps in on me, I stop and think \"I have poisoned, mutilated, and burned my body just so I can watch my children grow up.\"  What more could any mom do for her kids than fight for her own life in order to share it with them?   As for people who say things,  Don't worry about hurting someone's feelings.  Whenever someone wanted to hug me, etc. I told them the truth - my onc does not want me having any close contact with others because of the chance of infection.  Straight up. Tell them like it is.  No one has a right to endanger your health, just to make themselves feel better.  The people who truly care about your well being will understand this and support you. The others you don't need to be around at all.  One idiot asked me \"how are you doing - surviving?\"  My response was \"What is the alternative? duh!!\" Through this last year, I've learned that people want to be helpful and supportive, but most just don't know what to say or do, and their attempts usually run the gamut from annoying to insulting.  I try to look at their intentions (they mean well and care about me) and not the actual actions. I will keep you and your family in my prayers.  Hang in there.  Remember the only way to eat an elephant is one bite at a time.  You will get to the other side of this thing. HUGS Charmaine ",
      "MessageIndex": 15,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/741026",
      "Title": "Today was a hard day...... Pure charmd"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Sep 27, 2009 11:44PM charmd wrote: Apple: Thank you for the compliment. I think bookgirl has the knack too.   \" It made me realize she thought of herself as the man with no shoes and I had become the man with no feet! CRAP!\" -- I have friends in a prayer group, and if one more of them starts to talk about anything by saying \"but then I think of Charmaine....\"  I refuse to accept this disease as a death sentence, and I do not need anyone's pity etc.  I think people are just so self absorbed that they don't even think about what they are saying and how it makes others feel.   Keep your heads up and shoulders back -- look the world in the eye ---- and see if it blinks. ",
      "MessageIndex": 19,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/741026",
      "Title": "Today was a hard day...... Pure charmd"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Aug 25, 2009 07:41PM charmd wrote: Hi Sherry, I had #17 of 35 today.  For the past week, I've been feeling naseau after my tx, and coming home for a 2-3 hour nap.  The fatigue has really kicked in the last couple of tx.  My techs say the naseau is not a SE of the rads, but I think it is.   Hang in there. Charmaine ",
      "MessageIndex": 226,
      "PostDate": "25/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Jul 31, 2009 07:34AM - edited Jul 31, 2009 07:35AM by charmd Hi Everyone: I'd like to join this thread even though I'm a couple of treatments into my series.  I was diagnosed in Jan.  Completed 6 rounds of chemo in May, bilat mx in June.  I have decided to not have reconstruction.  I had a second opinion with a PS, and it just seems to not be the right option for me.  My cancer included skin involvement and I had a problem with necrosis after my bilat, so the docs do not think that tissue expanders are possible on the cancer side. My simulation was a couple of weeks ago, and I started rads this past Tuesday.  I have 35 sessions.  So far, so good.  Each session has been quick - 10 -15 mins.  My techs are really sweet and very efficient.  The simulation took about an hour, and they made a mold that I lie in each time I go in now.  I got the tattoos,  and honestly they are so tiny that unless I told someone what they were, you would think they were a freckle.  My techs said to use a good lotion like Lubiderm day and night to keep the skin moist.  I wish you each the best and look forward to getting to know each other as we take this journey together. God bless you. Charmaine ",
      "MessageIndex": 42,
      "PostDate": "31/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Aug 3, 2009 06:24PM charmd wrote: Welcome to the new ladies.   Anna sorry to hear about your bad day at the doc office.  Hope next time is better, and I concur about talking with the office manager or head doc.  As for dealing with that woman, just kill her with kindness.  If she has a sliver of heart and compassion, it will only make her feel worse.  She may have felt like total crap about what happened and if you are kind to her it may give her a chance to make amends.  Or, she may just be a mean person, and mean people suck! and the head doc needs to know about it. Hugs to all. Charmaine ",
      "MessageIndex": 60,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Aug 5, 2009 07:18AM charmd wrote: Good morning all and welcome to the new ladies. Haven't posted in the last few days.  My treatments Monday and Tuesday were cancelled because the machine had to be repaired.  Late last night I got a call that the doc wants me to go to a different facility today and not miss another treatment.  The good news is that it's only across the street from the doc's office I am taking my son to this am. The bad news is that I'm taking my son to a pediatric orthopedist because it appear one of his legs is significantly shorter than the other according to his step-mom, Dr. Barbie.  In all the 10 years of well check ups, his ped doc has never said there was a problem, but we will go this am and get an expert opinion. Hope you all have a good day. Charmaine ",
      "MessageIndex": 80,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    },
    {
      "AuthorID": "charmd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80285/profile",
      "Content": "Aug 14, 2009 07:15AM charmd wrote: Welcome to the new ladies. Yesterday the machine was down again.  They called me while I was in the car on my way to the appt.  Actually, I was sort of relived.  I had been feeling pretty nauseous all day, and was glad to just turn the car around and go back home. Kristen:  I am right there with you on the breakdown.  Last week, I ran into my daughter's 4th grade teacher from 3 years ago.  I bumped into her at the grocery store.  She asked how I was doing, and  I did the same thing.  I started to say fine, and then before I knew it the tears started. Right in the middle of the store, and with someone I hadn't seen or talked with in years.  Keeping you in my thoughts & prayers. Hugs to everyone. Charmaine ",
      "MessageIndex": 127,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/737903",
      "Title": "AUGUST 2009 RADS Alyad ChrisC433"
    }
  ]
}