{
  "AuthorID": "Char105",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
  "Posts": [
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Apr 30, 2018 10:09AM Char105 wrote: ClareCo Start taking the meds as soon as you anything. Are you getting the Neulasta shot? With TC and the shot and Zofran I got the worse headache and they had to change the Zofran because that can happen. Tylenol wouldn't work so I ended up taking a pain pill that was left over from my surgery. That helped with the headache big time. Just be aware in case.",
      "MessageIndex": 167,
      "PostDate": "30/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 19, 2018 07:00PM Char105 wrote: kayakmom, I have the same treatment plan as you and I am also triple negative. They never even mentioned any other plans. All my MO said was I would have to do 4 cycles and 20 radiation treatments. Have they mentioned radiation to you?",
      "MessageIndex": 273,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860443",
      "Title": "Chemo starting December 2017 Swewing Hariry"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 19, 2018 12:47PM Char105 wrote: I was told to start the nausea and Claritin pills the day of chemo. Take nausea for 3 days after and Claritin 5 days after chemo day then stop. Is it better to just continue taking the Claritin everyday? Right now my MO said not to go anywhere outside and to wash hands a lot. I thought the counts would be low the week following the chemo and I would have to be careful, not a week after. So can I ask when is the best time to get out of the house without stressing over germs?",
      "MessageIndex": 149,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 21, 2018 12:03PM Char105 wrote: PrincessBut - Hello, I have a few scarves, a couple of caps and I do have a wig. My understanding is the wig is hard to use at the beginning because the head is kind of sore. Not sure but I bought it in case. I will probably wear the wig outdoors and the scarves inside. It's really cold here so the wig will be warmer at times.",
      "MessageIndex": 192,
      "PostDate": "21/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 23, 2018 09:39AM Char105 wrote: Hi smikeym - Yes day 3 will sometimes hit like a bag of rocks. Are you taking Clairitin? That will help with the bone and joint pain. I start taking it the day of and continue 5 days after. It seems to hold it down to an ache. I to am having a hard time with the hair loss. Mine is now starting to shed a lot, so I figure it's just a matter of time now. Hang in there.",
      "MessageIndex": 213,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Mar 15, 2018 08:38AM Char105 wrote: Well I had my final treatment yesterday and he informed me this is going to be the worst one on SE's but at least it's the last one. I just kind of looked at him. On the 3rd one about 9 days out I broke out in hives and a rash which was horrible. I was told to take claritin, benadryl at night and coritzone cream. I asked him if these are going to come back and be worse, but he said they shouldn't come back. They did blood tests and x-ray when this happened and for the exception of high WBC and platelet numbers the rest were not that bad. Some counts will show low and some high due to the chemo drugs. My insurance has a oncology nurse that calls after every infusion to ask how things are going. I explained it to him and he said with the high counts it at least shows I am fighting whatever it was. I think they are convinced I used something different to cause this. Nothing was changed at home and believe me I kind of eat the same foods over and over. On the ones that had their final chemo. He said I would come next week for blood work which is normal then I have a 6 week post chemo visit. Then every 3 months for a year, then every 6 months for a few years, then yearly forever. Is that standard? Hang in there everyone this part is done or almost done. We are strong and have made it through a difficult time. I have 2 down (surgery, chemo) and on to radiation.",
      "MessageIndex": 717,
      "PostDate": "15/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Mar 31, 2018 08:21PM Char105 wrote: I am so confused. My MO said he would not release me for radiation until my post chemo followup 6 weeks after chemo was done. I really wanted to start that right away to get it out of the way. It seems on the boards others are going to radiation not long after chemo is done. Makes me a little concern the time frame between everything. Surgery was in November, chemo started in January and now it looks like earliest would be May for radiation. ",
      "MessageIndex": 784,
      "PostDate": "31/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 20, 2018 01:36PM Char105 wrote: Kayakmom - Sometimes getting away and spending time with family is the best medicine anyone can get.",
      "MessageIndex": 276,
      "PostDate": "20/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860443",
      "Title": "Chemo starting December 2017 Swewing Hariry"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 20, 2018 07:32AM Char105 wrote: WorriedMe77 - That is really scary and I would imagine that is everyone's fear to. Keep us informed on the results and I agree feel whatever you feel. Lynnzrose - Yes my infusions are every three weeks. He actually said at the beginning, first week is hard, second one you will be really tired. He said since mine is on Wednesdays the Sat-Tue right before the next cycle are my feel good days to do what I want or need to do during those 4 days. He did tell me not to go anywhere with crowds right now. Might be because of the flu outbreak, because my counts are low but not extremely low.   ",
      "MessageIndex": 168,
      "PostDate": "20/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 21, 2018 09:24AM Char105 wrote: WorriedMe77 I so understand the rollercoaster you've been on in fact I was on the same one. Mammo showed something really small so right to unltrasound. Said it's small don't think cancer but it was up to me to do a biopsy. I said yes that I would rather be safe than sorry. So biopsy done and again don't think it's cancer, it was so small couldn't hardly get any fluid. Call comes in it is cancer. See surgeon and pretty sure with size I can have a lumpectomy, one time radiation and then hormone therapy and no chemo. Radiation doctor said no wasn't enough on biopsy report to convince her one time radiation was a good thing, so at this point it's surgery and regular radiation most likely. After surgery pathology report comes in and it stayed small but it's triple negative so I have to have chemo and full radiation. So I do understand your rollercoaster ride.",
      "MessageIndex": 189,
      "PostDate": "21/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Mar 13, 2018 07:24AM Char105 wrote: I haven't really posted a lot but I have kept up on reading all the threads. Tomorrow is my final chemo treatment and I can't wait to get that part over. He said last time he will be turning me over to radiation but that also worries me. I just wonder what the added percentage is? With it being on the left it worries me with the heart and lung. Amelia, I totally understand the depression mood. I haven't really left the house except when I have to. I have been off work since my surgery in November so it's been a long while for me to be inside. Over the Christmas holidays it wasn't too bad since I love to watch Christmas shows but since the first of the year it is getting really boring. I did schedule the feel good look better class for the end of the month and I am hoping that will help me want to leave the house. It seems to be very hard for me to do and I'm not sure why. I've also had vision problems. Everything is blurry most of the time and lights seem to make it worse. I know I need to get glasses but I am trying to wait until this is over so they will be the correct strength. Dry eyes seem to also be a problem I am having. Hope everyone has a great day.  ",
      "MessageIndex": 702,
      "PostDate": "13/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Mar 19, 2018 08:05AM Char105 wrote: Good Morning, Well today is the first day since my 4th cycle last Wednesday that I feel somewhat normal. He said this was going to be the hardest and boy was he right. The bone and joint aches seem to be worse this time around. Hoping for a great number read on Wednesday. Seems like my normal WBC is always high. Nails seem to be growing during all this. I keep having to clip them short. He checked them last week and said they look good and he doesn't see me losing any. That's a plus. Hair is really short fuzzy white still. I think that is the most concerning thing to me. I did splurge and bought a real hair wig. They are expensive but they feel so much better to touch. Eyebrows and lashes are hanging in there. I am hoping since I didn't wear any eye makeup since this started that helps. Time will tell I guess.",
      "MessageIndex": 735,
      "PostDate": "19/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 25, 2018 03:25PM Char105 wrote: Okkate75. i didn't know about the cold capping before either. I might have went in that direction to be honest. But I can't dwell on the what ifs. We love to travel and have done it for years. We normally take at least 2 vacations a year, but this year isn't looking as good. I hoping this isn't going to be my new normal that everyone keeps talking about. I am hoping by fall everything is in place to go somewhere. My MO just said after chemo he would turn me over to radiation. I should be done with chemo end of March and hoping to start the radiation soon afterwards just to get this all done. LKinKC - Are you taking the claritin?",
      "MessageIndex": 252,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 18, 2018 06:31PM Char105 wrote: Hello, I have been kind of lurking on this page trying to, I guess come to grips with all this. I find all your comments and suggestions very helpful and encouraging. I had my first chemo on 1/10 and it was not good. The headache was so bad it seemed like my head was going to just pop with pressure. I tried Tylenol and it was just not working. I actually grabbed one of my pain pills that were left from my port surgery and just took it. It either helped me or when it knocked me out I slept the major pain off. I ended up taking a pain pill the next day but it wasn't as bad. It's still here but it's more of a dull ache now. Yesterday I went for my blood work and he is changing the meds next cycle and said that should help a lot. He felt that it was self inflicted due to the meds. To be honest I am really just terrified of doing cycle 2. They told me yesterday I am doing really good but I just don't feel it. The joint and bone pain got better each day and I never did get sick since I took the nausea pills. He did change those this next cycle since he said they contributed to the headache. I need to not read the side effects on these meds but it's hard since I was someone who barely took any OTC drugs. The hair loss seems to be a big thing for me. I keep waking up and checking my pillow to see if it has started to come out yet. I've had longer hair my entire life and haven't been able to cut it short yet. I had a lumpectomy before chemo and have had problems with that surgery which I think has put a major drain on my moral. Anyway I just wanted to say thanks for all the postings on this board. It has helped me more than anyone would imagine.",
      "MessageIndex": 139,
      "PostDate": "18/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 20, 2018 10:12AM Char105 wrote: Karheim- I was just like you, told a lumpectomy and radiation. When I had the surgery it came back triple negative which meant chemo and I'm also stage 1A grade 3, 0/3 nodes. I have always been the type of person who rarely took any OTC meds. The chemo terrified me knowing what it was and it still does but not doing chemo terrified me more. I'm just at the point where the hair is starting to shed. I've always had longer hair so I totally understand your fear. I've been wanting to get it cut short but haven't been able to do that yet. I think this weekend I'm going to have to get some cut off. Right now I am just trying to take it a day at a time. The port makes it so much easier, but mine still bothers me and I'm hoping over time it will get better. They say you can leave it in for years but unless mine starts feeling better I'm going to have it removed after this is over. I'm also doing the taxotere and asked my MO about the hair. He said he has never had anyone it happened to and he uses it a lot. Just have to hope for the best. Sorry you have to work through this but not all days are bad. Just make sure you relax and take a nap during the day if possible. That seems to help me. ",
      "MessageIndex": 171,
      "PostDate": "20/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 21, 2018 08:14AM Char105 wrote: Okkate75- I too am dreading the shaving part. Getting up every morning looking to see if anything is on the pillow is starting to stress me out. Sounds like you have a wonderful partner standing by you. Beckyt23 - that sounds like a good idea having a few drinks while doing this. Sorry to hear you don't have support. Hang in there. Coach1216 - I do understand what you are saying about the wig shop. Been there done that. Roxy13- I agree the hair loss is major for me to. I keep thinking once it happens it might get better. Looking in the mirror everyday still seeing it I feel is really hard knowing it's just a matter of days. My MO said on my last visit well you are 25% done now and smiled. I just kind of looked at him and said I know. He was trying to make it more comforting I'm sure. I have to take blood pressure readings everyday now. It's fine at home but as soon as I walk into that office it goes through the roof. I told him it's this office but he just wants to make sure. These days seem to pass quickly now for the next cycle to arrive.I just have to have faith with the changes he is making it will be a better one. ",
      "MessageIndex": 185,
      "PostDate": "21/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 24, 2018 02:52AM Char105 wrote: smickeym - I would talk to your MO about pain pills then. Mine did say if the Claritin didn't work that was an option. Hope you feel better really soon. It's hard enough getting through the other SE.",
      "MessageIndex": 219,
      "PostDate": "24/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 25, 2018 01:00PM Char105 wrote: That's terrific news.",
      "MessageIndex": 247,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 26, 2018 11:42AM Char105 wrote: Paisley - I'm with you! I still have moments where I can't believe this is happening. Mine was 17mm and couldn't be felt at all. During my yearly mamo they seen it and took me right for the untrasound. Talk about freaking out. At that point they really didn't think it was cancer since it was so small but it turned out it was. In fact it came back TN which is not good at all. My hair right now is falling out big time. I plan on buzzing it tomorrow which I'm sure is going to be really hard. It started on the 2 week mark and each day it falls out more. I'm not sure on your length of your hair but mine was longer and thick and now to be honest I regret at least not cutting it short early on.",
      "MessageIndex": 265,
      "PostDate": "26/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 27, 2018 05:48PM Char105 wrote: Well I guess most of us are having the runny nose problem. I wasn't sure if I was coming down with something or not. My port has bothered me since day 1 to. Plus it's located in a bad spot right where the bra strap goes which doesn't help. I'm starting to get use to having the one strap down my arm so which took a few days. I kept wanting to pull it back up. My surgery also isn't the best in healing. I have to take gabapentin now 2x a day for the nerve shooting pain. So I totally understand Amelia. For some reason chocolate works for me. Shakes, pudding, ice cream doesn't seem to matter. I might have to try the smoothies since I'm sure are better for you. I do drink a boost everyday to try to help and I avoid spicy foods. Funny how the last few days before the next cycle food isn't as bad then we start over.",
      "MessageIndex": 282,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 28, 2018 11:08AM Char105 wrote: Amelia - I wouldn't say I am ashamed, but I really don't leave the house right now. I think once the hair is all the way gone it might be a lot easier to throw the wig on or a scarf. Right now it's really short which was a shock but it is falling out everywhere so I'm not comfortable leaving with this happening. Besides those little hairs itch. lol Olesya - I still can't figure out the timeline of when its bad to be around people. I was told to stay away from crowds after a week for a few days. What is a few days? Just hoping this Wednesday is a better cycle. My MO is changing the drugs so he thinks it will be.",
      "MessageIndex": 292,
      "PostDate": "28/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Feb 1, 2018 11:26AM Char105 wrote: I went for my 2nd cycle yesterday. They changed the nausea meds due to severe headaches the last time. I think by doing this I had to take one of those pills earlier and these are drowsy pills. Yay Waiting for that Neulasta shot to go off tonight. That seems to be the worse part. Waiting for the SE to hit. I finally asked a lot of questions yesterday by writing them down so I would remember and got my answers. He is doing the BRCA1 & 2 testing since I am triple negative. He is doing this afterward all of this is over. I am guessing just in case it would be positive I have enough on my plate without adding. Hair is really falling out now. The top seems to be shedding more than the sides and back. I had it cut into a pixie style last weekend because having the long hair falling out seemed to be worse. Guess the next step is to shave it.  ",
      "MessageIndex": 358,
      "PostDate": "01/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 19, 2018 08:43AM Char105 wrote: Hello, Imurphy - My Rx is Cytoxan, Taxotere , and the Neulasta shot the next day. The Neulasta is taped to me and goes off automatically. My pathology report came back triple negative so after chemo I have to do radiation. No therapy pills right now.",
      "MessageIndex": 146,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 25, 2018 06:37AM Char105 wrote: Good morning everyone, I can't believe i am up so early every morning. Sleeping just doesn't work for me anymore. I use to take a small dosage of metatonin and sleep like a baby. I went and bought a larger mg and still can't seem to sleep more than 5-6 hours and I wake up a time or two during that. Is anyone else having sleeping problems? What is the trick? Getting my mind in a place for next week to to round #2. He is changing some of the meds so hoping for a better outcome. okkate - you look beautiful. My hair is now starting to fall out in clumps. I am hoping it can wait until the weekend so I can get it buzzed. I am pulling it back into a pony tail so I don't see it as much. Olyesa - I hope it stays that way for you. That would be great. ",
      "MessageIndex": 233,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "Char105",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266042/profile",
      "Content": "Jan 29, 2018 01:40PM Char105 wrote: WorriedMe77. I actually didn't start chemo until 2 months after the lumpectomy surgery. I ended up having the port surgery on December 16th and my MO said he wanted to make sure I was healed from that surgery first. He said the cancer was removed with the lumpectomy so everything will be fine.. This is what I am holding on to and I hope it helps you not to worry.",
      "MessageIndex": 314,
      "PostDate": "29/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    }
  ]
}