{
  "AuthorID": "Charley99",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251977/profile",
  "Posts": [
    {
      "AuthorID": "Charley99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251977/profile",
      "Content": "Jun 4, 2017 07:39AM Charley99 wrote: I had a touch of queasy for two days. Thankful for the Zofran. Also had bone or joint pain in my knees and hips until day 5. I am taking Claritin every day. The worst so far though was my mouth. Oral thrush! I had severe throat pain and white patches all over. I got a prescription for Diflucan and it is much better now. I could barely swallow water. No hair loss yet. Today is day 11. Treatment 2 is Thursday! One more down....",
      "MessageIndex": 418,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "Charley99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251977/profile",
      "Content": "May 20, 2017 05:40PM Charley99 wrote: I also have been lurking around for a bit. Had a lumpectomy and some lymph nodes removed. 2 nodes had cancer so I begin chemo this Thursday AC + T. Every other week for 8 weeks each followed by radiation. I have gotten some things ready but I feel so unprepared somehow. I guess it's the not knowing. I also have cut my long hair short and felt mad about the loss of hair part. My friends are having a cookout soon and some will be shaving their heads with me that day (they're more supportive than I would be) lol. I got my port 3 days ago and it's still pretty sore. Glad I have found other people on this similar journey. Off to pick up my prescriptions.    ",
      "MessageIndex": 285,
      "PostDate": "20/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    }
  ]
}