{
  "AuthorID": "Chase2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141355/profile",
  "Posts": [
    {
      "AuthorID": "Chase2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141355/profile",
      "Content": "Jan 5, 2012 04:19PM Chase2 wrote: Thank You, for the reply.  Per the MRI and CT Scan no spread, I was Diagnosised 11/27/11  I have start Chemo on 12/30/11 I am scheduled for 4 treatments. I will have surgery either 30 days after 4th treatment or sooner depending how Chemo treats the tumor. I just don't know what to do. BC runs in my mothers side of the family. I am done with having children and not fond of my breast and don't want to keep looking over my shoulder every 6 months waiting for the next find. I am considering a MX with reconstruction after only and only if Rads are not needed. I know I will not know if lymph nodes are affected until surgery. I hope all is well for you. Please let me know how your Chemo experience is. The 1st round was not to bad, except for the tiredness for the first 5 days. Not looking forward to the hair lose, which has not happen yet, but I am ready with a wig and hats. Please let me know how you are thoughts and prayers for all.",
      "MessageIndex": 7,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/779675",
      "Title": "Any diagnosed with IDC Grade 1, Stage IIa, Chase2 Chase2"
    },
    {
      "AuthorID": "Chase2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141355/profile",
      "Content": "Chase2 wrote: Just wanting to know if anyone had or has this type of diagnosis? Doctor says that if you had to choose this was the best type to have. No feeling warm and fuzzy about that or any type or kind. I just would like to know someone else's experience and treatments and if your prognosis was good if you had a mastectomy with reconstruction.  This would help me understand what to look forward too. IDC 4.2cm Stage IIa, Grade 1, ER+, PR+, HER2-. No spread, or axillery spread, or vasicular invasion. Chemotherapy 12/30/2011 AC + T (Taxol) Surgery 6/26/2012 Mastectomy: Left, Right; Reconstruction (left); Reconstruction (right) Hormonal Therapy 8/26/2012 Dx 12/27/2018, IDC, Right, <1cm, Stage IA, Grade 1, 0/1 nodes, ER+/PR+, HER2- (IHC) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/779675",
      "Title": "Any diagnosed with IDC Grade 1, Stage IIa, Chase2 Chase2"
    },
    {
      "AuthorID": "Chase2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141355/profile",
      "Content": "Feb 1, 2012 03:29AM - edited Feb 1, 2012 03:31AM by Chase2 Hello Kelloggs, I was diagnosed 11/29/11 I live in Canton. I am originally from Texas I have lived here twice once in 2002-2004 and moved back in 2008. I am going on my 3rd treatment of AC on 2/10 and will be done on 3/2/12 last treatment and surgery in April with immediate reconstruction. Chemo has gone pretty well so far down for 5 days before going back to work. I live in the Jackson area. I don't have family around they are all in Texas, NM,  just a couple of friends, my kids, husband and they keep me busy that I can't dwell on what I have BC. My neighbor was also diagnosed the same time I was so we have talk, but she went a different route. I am not a triple +, but it was nice to see that you are from Canton. IDC 4.2cm, Stage IIa, Grade 1 ER+ PR+ HER2-",
      "MessageIndex": 38,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    }
  ]
}