{
  "AuthorID": "ChattyKat",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
  "Posts": [
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 1, 2016 03:37PM ChattyKat wrote: Numbalina from what I've read about he shorter protocol, it has less side effects but has produced very similar results as the longer protocols. I've decided that after I get the evaluation from the RO, I will get a second opinion. I am also going to go armed with articles about the shorter protocol. I suspect my RO is not one who likes to be challenged but if that is the case, then I don't want him. It's my body and I have a right to have input into my treatment plan. From what I'm told he doesn't want anyone to get a second opinion which goes against all my other doctors. They all suggested I get a second opinion if I wanted one and said they would not be offended if I did. That kind of tells you something about this RO. Well I'm going to set up an appt to get my evaluation done. ",
      "MessageIndex": 21,
      "PostDate": "01/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 3, 2016 10:47AM ChattyKat wrote: Lz999 good luck. 6 weeks a a couple weeks longer than what my RO is going to give me but I don't know other than TN your other dx. I've read to help prevent skin problems, to start using creams and lotions before you even start rads. Also Aloe is suppose to be very good. I've already bought aloe plants so I can use all natural aloe. The only other side effect seems to be fatigue. If you walk or do some type of exercise on a regular basis keep doing it because everyone says it really does help with the fatigue. If you don't do it, you might want to start. It doesn't have to be anything more than walking around the block. I wish you luck and please let me know how you do.",
      "MessageIndex": 35,
      "PostDate": "03/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 17, 2016 05:54PM ChattyKat wrote: Janniree57 Sounds like you are in one of the trials testing the 3 week treatment. I saw my RO a few weeks ago and he said I will have 4 weeks and 1 day (21) of radiation. Apparently that is the standard now although I told him I was going to ask for the 3 weeks. He said it will never get there in the US but I don't believe that. If it's just as effective with less side effects it will get there. In fact there are some already doing it as the standard. I will do the 4 weeks because that is better than 7 or 8 weeks and unfortunately there aren't any other RO's in the area so I would have to travel even further than 1/2 hour to get it daily. Good luck to you and please update us when you are done. Let us know how you faired with side effects, etc. ",
      "MessageIndex": 41,
      "PostDate": "17/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 20, 2016 02:27PM ChattyKat wrote: Numbalina so sorry you are going through all this. 33 treatments does seem like a lot especially for Stage IIa I wish there was somewhere where you could find the standard practices for radiation. When I first went to my medical oncologist for chemo she pointed me to NCCN.org online and showed me how to naviagate it. It was great, by the time I went through it I knew exactly how many chemo treatments I would have and what I would have. When I went back to her sure enough she told me exactly what I read. I've tried to find something like that for radiation but haven't had much luck. I think doctors just go by what they've done in the past but that's not the way to operate. Things change all the time. I wasn't too keen on my RO because everyone I met had 6 to 8 weeks of radiation but when I talked to him a few weeks ago he said 4 weeks and 1 day. He said that is the standard now. A higher dosage over a shorter period has proven to be more effective wiith less side affects. Maybe it is because chemo didn't do anything to the tumor. Why didn't you have a lumpectomy? That was the first thing I did. 2cm is not very big. Mine was 1-1/2 cm. I thought they do chemo when tumor is bigger. Well let me know how you make out. Hang in there, I'm sure it's not easy. Just shows you that you can read one thing but they do something else. You should complain about the techs if they are not helping you to make it easier.",
      "MessageIndex": 44,
      "PostDate": "20/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 26, 2016 09:28AM ChattyKat wrote: Lillymama how great that you were even given the choice. I am going to have 21 rads in January. I've done a lot of research on the 15 rads (Europe and Canada protocol) because I was hoping that my RO would offer it but sadly he won't do it. From everything I read the side effects are much less when you do the 15 rads. I know it sounds counter intuitive but for some reason it is much better. Personally I can't attest yet to the 21 rads but even some that have posted here on my line have said that they had no effects. Others that did not have the choice and had 33 are having or had a much harder time. Even my RO has said they have found at a slightly higher dosage but at a shorter period of time has proven to be just as effective with less side effects so the standard for RO''s that won't do the 15 day protocol 21 rads is much better. Obviously it is your choice but remember that 5 days a week for 6 plus weeks is a lot. I've read that using aloe after each treatment reallly helps so regardless of which you choose, get yourselt an aloe plant and look on u-tube o see how to get the aloe out I wouldn't add anything to it just plain aloe. It can't hurt tthat's for sure. Good luck and please let me know what you decide and how it goes.",
      "MessageIndex": 46,
      "PostDate": "26/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Oct 19, 2016 12:13PM ChattyKat wrote: Reflect looks like you were Stage IIIA and had lymph node involvement. How many weeks did you have radiation? I've read on some sites where people my stage or stage IIa had 3 or 4 weeks (without higher dose). I'm asking because where I live there is only one RO in the tri-city area. I have not heard very good things about him and with no competition he can tell me I need more than I do just to make money (which I've heard he does). I'm more concerned with the side effects and they have shown the side effects are less with shorter therapy. Also in the trials they did have women who had chemotherapy but the numbers were too small to evaluate. I think they have done more trials on it though. Even so some doctors do go with the shorter therapy for women who had chemo. I will let you know. I've decided if I'm not happy with his response, I will go get a second opinion and travel and stay in another town if they recommend a shorter period. Thank you for responding.",
      "MessageIndex": 4,
      "PostDate": "19/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Oct 20, 2016 10:32AM ChattyKat wrote: Reflect, I'm not sure where the nearest NCI center is but I will try to find out. I'm a couple of hours north of Phoenix and I'm sure there is probably one there. I will definitely let you know what happens. ",
      "MessageIndex": 14,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Oct 20, 2016 12:23PM ChattyKat wrote: Thank you Octogirl for your response. I see my MO in 2 weeks and I am going to talk to her about it. I know that she is connected to several offices all over AZ so I'm sure that she can recommend who I might want to see. Since I haven't even had sim or know what the referred RO will have to say, I guess I'll have to wait until he does the workup before I can get a second opinion. At any rate, I am going to ask that he provide me with the guidelines based on my situation. I've read that if the RO does not or says cannot provide the guidelines to run and find another RO. I'm also going to request the Canadian protocol, armed with many clinical trial articles that I've found. Fortunately we do not get bad winters here but I do have to travel 30 minutes to get to the RO's offices. I will travel even further if I have to for treatment. I'd rather feel comfortable with my RO than worry about whether or not a local RO knows what he's doing or if he's looking to make money. So far I have not met anyone who did not have to stop treatment for a few weeks because she was burned. I know that can happen but I'd like to believe it shouldn't happen to everyone. I still have 8 more weeks of chemo and then I am taking a 3-4 week break before radiation per my MO's recommendation. So I won't even see the RO until mid January to start the process. I will let you know how it goes.",
      "MessageIndex": 16,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 1, 2016 03:44PM ChattyKat wrote: etnastrl. Glad to hear everything went so well for you. From everything I've read the side effects are much less with the shorter protocol even though the strength of each treatment is greater. I'm hoping I can do the same. My problem is I am triple negative and I have been receiving chemo. Clinical trials have not had enough of people like me in the trials to determine the results. I suspect my RO isn't going to like me even bringing it up as a possibility but I think I owe it to myself to question his treatment plan. I have an appt tomorrow 11/2 and I'm hoping I'll get some insight into his plan. I'll post as I go through this process. Thanks for your input.",
      "MessageIndex": 22,
      "PostDate": "01/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 2, 2016 04:11PM ChattyKat wrote: Numbalina the title of the article is Hypofractionated radiation therapy versus conventionally fractionated radiation therapy for early-stage breast cancer: how do we choose? the authors are Suzanne B Evans & James B Yu and author correspondence is james.b.yu@yale.edu. If you do a engine search on most of the title you should find it. Just got back from RO. I feel a little bit better. He said 4 weeks and 1 day. I told him I brought all this information but he said he does not do it. I told him if he said 6 - 8 weeks I would fight for the hypo fractionated. He said 4 weeks is the standard now, he said it gets better results. Interesting that yours is 33. You are stage II and I am stage I, yours is grade 2 but mine is grade 3 which is the worst, and I also am triple negative which is the most invasive and aggressive form. Maybe you should ask why 33 and not 21 if your RO is opposed to the Hypofractionated. Let me know how you make out.",
      "MessageIndex": 28,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 3, 2016 10:30AM ChattyKat wrote: beebs2704 from what I've read 3 weeks seems to be the standard in Canada and Europe too. I would not be surprised if the US gets to that standard too over time. I'm just glad they have finally gotten down to a 4 week standard. Can't tell you how many people I know that had 7 to 8 weeks of rads and were burned and had to stop for 3 weeks in between. Our health care system is in so much trouble and it's about time doctors have come to the conclusion that they too have to stop being so money hungry and do what they were trained to do and do what's right for the patient. I can breathe a little easier now knowing after chemo and radiation I should be done by mid February. At least I have a light at the end of the tunnel. I will be celebrating.",
      "MessageIndex": 33,
      "PostDate": "03/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 3, 2016 11:00AM ChattyKat wrote: I know, don't know why anybody would do that. My last chemo, I'm making sure my MO puts order in to take mine out. I have to have a mammogram after chemo, can't imagine having one with this thing in. Besides it annoys the heck out of me.",
      "MessageIndex": 37,
      "PostDate": "03/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 17, 2016 06:27PM ChattyKat wrote: Numbalina How many are you suppose to have? Seems for Stage IIa with 2 cm, you are getting a lot of treatments. I am triple negative which means there are no other treatments for me except chemotherapy and radiation. All of the trials had triple negatives in them but not to the point where they will say the 3 week treatments are safe for TNs. Although I haven't seen anything that said the ones with TN had more side effects or worse results than the others. Please try to hang in there. Did you get a second opinion? Maybe you need to get a second opinion. ",
      "MessageIndex": 42,
      "PostDate": "17/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 30, 2016 12:12PM ChattyKat wrote: Pammac47 I suppose when you are at a higher stage they have more treatments. Good luck with your treatments and I hope they go by quickly. Please keep us updated on how you are feeling as you go through this. Everyone here takes something from what others are going through and sometimes can help when things are difficult. Check back often so see if you can get some hints. ",
      "MessageIndex": 58,
      "PostDate": "30/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Oct 19, 2016 11:32PM ChattyKat wrote: I didn't have a recurrence. This is the first time. I just don't trust the radiation oncologist and feel he's in it for the most money he can make. He tells women they have to leave their ports in for 5 years and they have to come in every couple of months to get them flushed. Why because he makes money on it. I'm expecting that radiation will be easier than the chemo I had but that doesn't mean I want to be radiated more than is absolutely necessary. If I don't like his answer to how many treatments I will travel to get a second opinion. Thank you for your response. ",
      "MessageIndex": 9,
      "PostDate": "19/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Oct 19, 2016 11:53PM ChattyKat wrote: Reflect thanks for your responses. I live in central Arizona. My town is rural but is next to 2 decent size cities. There is a radiation center in each city but he owns them. After I see him and find out his plan, if I feel he is over radiating, I will get a second opinion and travel to do it. It amazes me the differences between the stages, stage 1A had 33 rounds while someone with 3A with 30 rounds. Seems to me doctors do not have clear guidelines on radiation. When I had chemo I went on NCCN.org and it clearly stated the exact protocol for my stage, grade of tumor, no lymph node involvement, clear margins, triple negative. All based on the best outcomes of clinical trials. I cannot find anything like that for radiation therapy and that makes me nervous. Don't get me wrong if I found that based on my stage I should have 6 weeks of radiation, I would do it but I want to see how that amount was determined. Seems to me that's not asking for too much.",
      "MessageIndex": 10,
      "PostDate": "19/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 27, 2016 08:50PM ChattyKat wrote: joyandpiece how do you feel having to go 5 days a week for the rads? I would imagine it's a pain to have to go every day. I'm not looking forward to it because I have to travel 1/2 an hour each way just to get to the clinic and back home. Let us know how you do.",
      "MessageIndex": 56,
      "PostDate": "27/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "ChattyKat wrote: I was diagnosed on 6/16/16 with TNBC, 1.5 cm, grade 3 tumor in my right breast. Considering I had a mammogram 8 months before and there was nothing there, it came as a big surprise. I had a lumpectomy and lymph node biopsy on 6/29. My margins were good and no cancer in my lymph nodes. Stage 1a. I've had 4 treatments of AC every 2 weeks. That was horrible but I think it was the Neulasta they gave me to keep my white blood counts up that caused all the pain. I was sick most of the time. I am now on Paclitaxol on a weekly basis for 12 weeks. I just had my 3rd treatment this week and then had to have a shot a day for 3 days to build up my white blood counts. So far this treatment has been much better. I finish this chemo a week before Christmas and then will have 3 or 4 weeks off before I start radiation. Just wondering how many weeks of radiation others have had to endure. In Europe and Canada the standard is 3 weeks of a higher dose of radiation. The US has done clinical trials and found a shorter duration has less side effects and the results are the same 5 and 10 years out as having radiation 6 to 8 weeks which is what doctors in US do. Would like to hear from anyone that has/had stage 1a and how long they had radiation. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Oct 20, 2016 03:07PM ChattyKat wrote: Kicks. Just goes to show how different everyone is when it comes to chemo. A/C was horrible for me but now on Paclitaxol and i am 99% better. Sounds like you went thru a lot when you finished rads. My concern is burning because I am very sensitive to the sun so I would imagine the radiation will not be easy. Not only that the being exhausted. Luckily I am retired so I don't need to work. I'm surprised that you don't mind having the port in. I can't wait to get it out. It just does not feel normal to me and it irritates me. I guess whatever works for you is best. Hopefully your battle is over. I've read if you get past 5 years without recurrence you are probably in the clear. Wish you the best. I'll let you know what happens. Thanks for responding.",
      "MessageIndex": 18,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 1, 2016 08:44PM ChattyKat wrote: Reflect, just found an article that states \"Although there was initial caution expressed but the American Society of Therapeutic Radilogy and Oncology (ASTRO) practice guidelines, there is now data to support the safety of the use of HF-WBI in patients having receiving chemotherapy.\" Conclusion \"Hypofractionated radiotherapy should be routinely offered to women who desire breast conserving therapy with invasive, node-negative breast cancer (that's me), regardless of the grade of the invasive disease.\" At any rate, I don't know what my RO will say but suspect he will not want to do it. Sounds like you have 30 or 6 weeks. I am only stage 1a with no lymph node involvement and clear margins, so I'd like to hear how many weeks he says without using HF-WBI. I just don't feel I should need 6 - 8 weeks. I'm thinking 4 with maybe some boosts. Hopefully I'll find out tomorrow. I'll post when I know.",
      "MessageIndex": 25,
      "PostDate": "01/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "ChattyKat wrote: I was diagnosed on 6/16/16 with TNBC, 1.5 cm, grade 3 tumor in my right breast. Considering I had a mammogram 8 months before and there was nothing there, it came as a big surprise. I had a lumpectomy and lymph node biopsy on 6/29. My margins were good and no cancer in my lymph nodes. Stage 1a. I've had 4 treatments of AC every 2 weeks. That was horrible but I think it was the Neulasta they gave me to keep my white blood counts up that caused all the pain. I was sick most of the time. I am now on Paclitaxol on a weekly basis for 12 weeks. I just had my 3rd treatment this week and then had to have a shot a day for 3 days to build up my white blood counts. So far this treatment has been much better. I finish this chemo a week before Christmas and then will have 3 or 4 weeks off before I start radiation. Just wondering how many weeks of radiation others have had to endure. In Europe and Canada the standard is 3 weeks of a higher dose of radiation. The US has done clinical trials and found a shorter duration has less side effects and the results are the same 5 and 10 years out as having radiation 6 to 8 weeks which is what doctors in US do. Would like to hear from anyone that has/had stage 1a and how long they had radiation. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "14/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 26, 2016 10:38AM ChattyKat wrote: Lillymama good decision. Since I won't be starting until after you are done, please let me know how it goes. I'm sure you will be much more comfortable with 21. Since you put the aloe on after the treatment, not so sure why the RO would care if it's sticky. I really think you're right, unfortunately what they want you to buy is usually expensive. I'll stick to natural myself. Best of luck. ",
      "MessageIndex": 48,
      "PostDate": "26/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 27, 2016 08:41PM ChattyKat wrote: Charlene1 sounds like you've been and are going through a lot. I hope everything turns out ok for you. Keep in touch and let us know how it goes. Hopefully this time around you will be done with it. ",
      "MessageIndex": 55,
      "PostDate": "27/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Oct 20, 2016 01:24AM ChattyKat wrote: ChiSandy thanks for your response. I was grade 3 no nodes involved but triple negative otherwise similar Dx and surgery. Besides the side effects being less, I just don't want to be over radiated and don't have confidence in the RO. Good to hear from someone that actually had the Canadian protocol. ",
      "MessageIndex": 12,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 3, 2016 10:24AM ChattyKat wrote: Numb you have exactly the same dx as me. I too had 4 Acs and still have 6 more out of 12 Taxols to go. So glad to hear your rads are what my RO just told me I will have. One of my biggest concerns was the side effects when they do 6 to 8 weeks but sounds like you didn't have any which is good. I am very pleased with 4 weeks of rads. I have to drive 30 minutes each way for treatment so doing it 5 days a week for a 10-15 minute treatment was not something I was looking forward to but to do it for 4 weeks is doable. So glad you responded, it gives me even more confidence in my RO who I was not too comfortable with. He did tell me 4 weeks was now the standard because the results are better and side effects less. Glad that US doctors are finally realizing longer isn't always better. ",
      "MessageIndex": 32,
      "PostDate": "03/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    },
    {
      "AuthorID": "ChattyKat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240941/profile",
      "Content": "Nov 26, 2016 08:09PM ChattyKat wrote: Regan thanks for the information. I was prepared to put up a fight and try to get the Canadian protocol but my RO said he would not do it. Since he is the only RO in the tri-city area I live in, not much I could do unless I wanted to travel an hour or more and even then I don't know if they would do it either. I am going to have 21 treatments, which my RO says is standard now. So they do give a higher dosage but for a shorter period of time and the side effects are suppose to be less. My RO says the US will never go to the Canadian and Europe protocol but I have my doubts. You just proved that some are already adapting to the Canadian protocol and I've read that others have also decided to use the Canadian protocol. No reason for them not to when the results have proven to be just as effective. I think it comes down to money. I'm ok with 21 at least it's not 33 or more. Some women here are really having a hard time or had a hard time because of the length of time they had treatment. So I'm not so sure it's a matter of the equipment in my case but the guy has a monopoly and if he gets paid for each treatment why not 21 versus 16? Glad to hear you have a great RO that is willing to do it and that so far you have no side effects. Please let me know how it goes when you are done.",
      "MessageIndex": 51,
      "PostDate": "26/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/848982",
      "Title": "How many weeks of radiation? ChattyKat Pammac47"
    }
  ]
}