{
  "AuthorID": "chatsworthg…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
  "Posts": [
    {
      "AuthorID": "chatsworthg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
      "Content": "Mar 3, 2012 02:10PM chatsworthgirl wrote: My surgeon didn't think I needed any radiation and certainly not chest wall because he said he got it and the margin to the chest wall was clear. He also stated that chemotherapy kills the cancer cells in the nodes as well as everywhere else in the body.  My med onc didn't think I needed chest wall. and he certainly knew the pathology.  All margins were good - can't remember exact numbers -  and the deep margin which is to the chest wall was 2mm.  I know this is small but apparently when they go to the chest wall there is a fascia and then muscle so it if there is nothing left in that much margin then it is considered good. The bozo rad onc wanted to radiate chest wall and underarm.  The second opinion rad onc said due to the fact that I didn't have axillary nodes taken that the radiation to the under arm would probably get whatever remained of the cancer cells in those nodes, hence the reason for rads.  However, she said that due to my stats I was in the gray area and it would ultimately be my decision.  Yes I could go back to have more surgery but I would have to do the radiation anyway.  According to the med onc radiation is routinely given even with axillary dissection in order to kill off whatever remains in the nodes not taken since they never take ALL your nodes just a sampling.  So I would very likely have lymphedema.  Since I only had SND  if I had radiation, according to the UCLA doc, then my chance of getting lymphedema is small.  Personally, I would rather just do the radiation and not go through surgery again. Apparently, according to the med onc, the new thinking is that radiation confers additional benefit even in women with no nodal involvement.  Crazy to me but I have looked at a lot of the women on these forums who had no nodal and got radiation so I guess it's true. If the new rad onc is as good as I have been told, and if he answers me honestly when I ask him questions, I will be able to make a final decision.  I printed out the studies that were posted on one of the threads about the dangers of radiation to the heart and lungs.  I will be bringing those with me as well as some other data.  Like so many of us here it's necessary to become very informed and ask questions so that we know what we're getting ourselves into.  The bozo rad onc never mentioned that even with modern technology there is the danger of heart involvement.  I am 70 so I already have a lot of mileage on this heart.  I have already been through chemo and Cytoxan is also linked to heart damge.  I read that the combaination of Cytoxan and radiation can be very damaging.  So if I have already sustained some damage, however slight, to my old heart, I really want to avoid anything further. The percentage risk of chest wall failure is 10% to 15% and that is general population. It's a small enough percentage that I would be willing to risk that rather than damage my heart. It would be great for breast cancer statistics if I didn't die of it but died of a heart attack instead!! Not interested. At this point I am willing to do the underarm becasue there is no way to know if more nodes were involved.  I get that.  So we'll see if the new guy is on board with the med onc and the surgeon. I just wish all these doctors would get together, surgeons, med oncs, rad oncs or whatever speciality so our treatments could be considered by all rather than just by one segment of the medical specialty.  There are so many factors that make up the treatment we should receive and all voices in the process should be heard. I found it ridiculous that I have to run around to each one to discuss this. ALL ABOARD!! Kathy.",
      "MessageIndex": 43,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "chatsworthg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
      "Content": "Apr 17, 2012 10:09AM chatsworthgirl wrote: In regard to the UCLA study that radiation causes cancer cells to become stem cancer cells:  I had my independent consult with a female rad onc at UCLA and handed her that study.  She said that although this is proven in a lab setting, once again, it is difficult to know what actually happens in a human body, so unless there are actual clinical trials with humans it is still unknown.   I also gave this to my new rad onc during our initial discussion.  I posited that our cells are made to resist radiation which comes from the sun and space so it is logical that they would be resistant to radiation therapy.  He agreed but said that our cells are also made to resist all damages from outside sources including chemotherapy.  However, he said that it remains a fact that radiation kills off about 75% of cancer cells and chemo also.  Then there are the anti hormonals to add to this.  So the bottom line is that at this time these are the only and best tools we have to kill off the cancer cells. After my mapping I met with the rad onc and he went over the details of the mapping.  He showed me the \"pictures\" that are taken with the CT scan and where the organs lie and also the area that gets radiation.  The pictures - fron view, side view, slice view -  are in many colors to indicate the higher levels of radiation and then the lowest level so you can see whether or not any organs will be affected.  My heart was far enough away from my chest wall so that it is out of the field of radiaion altogether and only a tiny top portion of the lung will get a very tiny amount;.  I believe that all of the things I am doing are for one reason only - to save and prolong my life.  I hope to follow those who have gone before me and have beaten the beast. I have now had four rads.  24 more to go.  So far so good. Kathy",
      "MessageIndex": 99,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "chatsworthg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
      "Content": "May 26, 2012 09:36AM chatsworthgirl wrote: I completed the required 28 rads on Thursday.  The biggest area of burn is on my chest.  The superclav and underarm not much.  I was told it would look worse for a few days but would heal quite rapidly. The rad place gave me a Certificate of Completion.  I thought it was pretty funny sort of like a graduation certificate.  Signed by everyone.  I never did get tired throughout the process.  Slept pretty well.  Now on to Armimdex in about four weeks.  I had my blood taken to check white cells halfway through the rads and asked that my med onc also check my hormone levels.  It came back as being under 12.  This is approx. where pre-pubescent children are.  So there is not a whole lot of circulating estrogen.  Wondering how much blockage is needed for so little estrogen.  Kathy",
      "MessageIndex": 111,
      "PostDate": "26/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "chatsworthg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
      "Content": "Mar 20, 2012 01:38AM chatsworthgirl wrote: After going through three rad oncs and researching until my eyes hurt, and reading posts of women whose diagnosis were similar - I have decided to go ahead and get the radiation. My mail lady who had breast cancer twice and radiation twice including to the axillary and chest wall has had no problems and has been cancer free since the second cancer which was seven years ago.  One poster made a good point for me - she realized that if she didn't do rads she would be constantly worried that she had not done enough and by doing it she at least knew that she did everything she could.  Yes there are risks but there were also risks with chemo and we went through with it anyway because we want to live. So bottom line for me is that I will do it and then know that I did everything I could to prevent a recurrence.  I know there are recurrences in spite of rads but the percentage is small. The type of radiation I will get is intensity modulated radiation therapy on a machine called Tomotherapy.  The rad onc I will be going to said this machine enables them to bend the ray and go around organs.  He also assured me that during mapping if my heart is too close to the chest wall then he won't do it.  I have a small frame so my heart doesn't have a lot of room in there.  It will be interesting to see where my heart actually lies.  He also said that face down for some is not good because it causes the heart to fall closer to the chest wall.  So I will be on my back. From what I have learned all of the newer studies and one by Sloan Kettering which was a massive accumulation of data, radiation, even with mastectomy, has shown a significant decrease in recurrence. I have made the decision and in a way I am relieved.  The struggle with this was quite taxing.  Now I can move on and focus on more interesting and enjoyable things. Kathy",
      "MessageIndex": 80,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "chatsworthg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
      "Content": "Mar 3, 2012 10:27AM - edited Mar 3, 2012 10:29AM by chatsworthgirl I have been struggling with the question of whether or not to do rads.  I was referred by my med onc to the rad onc in my medical complex.  He was way too busy to spend any time at all explaining anything.  All he did was try to scare me into doing it by saying well it recurs in the chest wall or nodes within the first two years, and cited some study that said lymph node burden really was the prognostic factor.  Originally my med onc said just the underarm as I had only sentinel node dissection.  This guy wanted to radiate my chest as well. I had a complete mastectomy.  No breasts and no recon.  Then he was going to meet that week with the tumor board and would discuss my case and call me.  I waited two weeks and then called my med onc.  Then this bozo called me and said \"let me know by Friday so I can schedule the mapping\".  Both times he was interrupted constantly and spent about a total of ten minutes talking to me.  Let him know by Friday?  I wasn't buying a used car.  I went for an independent second opinion with a woman rad onc at UCLA who specializes in breast cancer.  She actually sat with me for at least an hour and had reviewed my pathology in detail.  She was patient and explained why she thought rads would benefit me even though I was in the \"gray area\".  I felt a lot more positive about doing it. I asked my med on for a different rad onc.  I will be meeting with him within the next week or so.  I have been told he's a really kind man.  So maybe I will get a doctor who actually cares to explain things.  My med onc said that he thought underarm was sufficient.  I will see what this new doc has to say. I have been following the conversations on various threads regarding radiation or no radiation - many of you have been struggling with the same decision.  I'm grateful to know that I'm not alone. Kathy",
      "MessageIndex": 36,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "chatsworthg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
      "Content": "Mar 20, 2012 11:13PM chatsworthgirl wrote: Judy  I don't have breasts.  I had a double mastectomy.  I know that if you have a breast or breasts and do whole breast radiation it's better face down. I think, and the operative word here is think, that he said I would be on my back. Or could it have been on my side? Not sure. But he did say that they found that putting people face down made the heart fall closer to the chest wall. So I know I won't be face down.  He also said they put a sort of rubberized fabric and sometimes towl material on the chest so that the machine recognizes this fabric as part of the body and the radiation penetrates that plus a little underneath. That way the penetration to the chest wall is reduced to just what they want radiated - the skin and whatever bit of tissue lies beneath. This makes me think I would be on my back??  And he said it does come ACROSS the chest and can bend to avoid the heart and lungs.  It used to come straight at you in the old days and that's why people had heart issues.  I will be going in for mapping at the end of this week and I will post what exactly my position will be. Elizabeth  Thank you for the luck.  I cherish every bit I can get.  I told my rad onc that I will trade the 28 rads treatments for at least 20 more years.  That's the deal and it's not subject to negotiation!! Kathy",
      "MessageIndex": 84,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "chatsworthg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
      "Content": "Mar 27, 2012 03:40AM chatsworthgirl wrote: I had my CT scan and mold made for the rads.  I will be lying on my back with my arms over my heas and my head turned away from the left side (wherethe cancer was) in order to keep my thyroid out of any scatter. It is on my back with a slight raise on the left side o fmy body because I am having axillary, chest wall and superclavicular radiation.  And, as I mentioned above, I have no breasts. My rad onc spoke with three other specialists.  One said no to rads two said yes.  Now that means I have had two absolute nos and six yesses.  I am still considered somewhat of a guess due to the lack of axillary node dissection and the unknown factor there. But, I have chosen to go ahead with it.  The doctor has promised me that if my heart is too close to the chest wall he will not radiate that.  I hope that all of my vital organs can be kept out of the field.  He said in about a week and a half they will have the mapping and scheduling done and I will begin.  28 rads.  So I have a reprieve of that time to not do anthing at all except have as much enjoyment of my present normality as possible. No one told me what the number of \"fields\" are for me.  I guess three?  I did not have recon after my mast.  The rad onc said there is likely some damage to the skin that could make recon difficult but I plan to wait at least a year before I consider anything.  My choise is micro fat grafting as that seems the least invasive and easiest of all recons. I haven't really missed my breasts until recently when I have been looking at women in movies who have lovely breasts inlow cut clothes and getting a bit of longing to have some myself so I hope that I can do the fat grafting and have at least some small breasts to put in a pretty push up bra again. Kathy",
      "MessageIndex": 87,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "chatsworthg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
      "Content": "Apr 20, 2013 01:21PM chatsworthgirl wrote: Thanks Kelli. I do try to just push the negative thoughts away.  Best toi keep busy.  It does aggravate me however that the loss of estrogen is wreaking havoc on my skin.  Vanity makes me want to quit Arimidex.   Silly but true.  I plow on however. Weesa is my hero. Jenni love your 8.5 years!  Kathy",
      "MessageIndex": 54,
      "PostDate": "20/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/794824",
      "Title": "Postcard from the edge of ten years out.... weesa lifelover"
    },
    {
      "AuthorID": "chatsworthg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
      "Content": "Apr 19, 2013 02:27PM chatsworthgirl wrote: Finished chemo just before Christmas 2011, rads finished May 2012 and been on Arimidex since then.  Just had my first follow-up - yeah nobody ever called me to schedule one - I called them. Anyway, for some reason I have been having some anxiety and a bit of depression - not like me - and I was wondering if it's the Arimidex or if it's just the follow up and thinking about this crap. I have skipped a day or two here and there with the drug and some days I think what the hell wny do this to myself. But then I think I have to otherwise I will get crap from my husband and from the onc. Anybody else get the c-blues from time to time? Kathy",
      "MessageIndex": 50,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/794824",
      "Title": "Postcard from the edge of ten years out.... weesa lifelover"
    },
    {
      "AuthorID": "chatsworthg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
      "Content": "Jan 1, 2012 02:05PM chatsworthgirl wrote: Just an FYI re Glutamine.  Per clinical studies it does not interfere with Chemo.  ncbi.nlm.nik.gov/pubmed/17168431 is one study or you can look it up on the web and there are various studies that say it's OK with chemo.  I asked my onc at the start of my chemo about it and he said B6, B12 and Glutamine were OK so I did all of it and had no neuropathy. Kathy",
      "MessageIndex": 447,
      "PostDate": "01/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "chatsworthg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134605/profile",
      "Content": "Aug 22, 2011 05:31PM chatsworthgirl wrote: Hello all, I'm about to have a bilateral mast.  After reading posts by many women on ths site and others regarding the problems and pain with implants and flap procedures I opted for nothing.  However, after I finish chemo and the rad under my arm for nodes, I am going to have the full redonstruction using BRAVA and fat grafting.  The plastic surgeon who pioneereed it is Dr. Roger Khouri at the Miami Breast Center.  But he has been teaching others how to do it and I spoke to Dr. Lauren Greenberg in Palo Alto this morning who took his classes and is setting up to do the procedure the way Dr. Khouri does it.    No surgery, no complicatoins.  Natural breasts using your own fat.  I have read on other posts that there are some other doctors who do this also, one in New Orleans Dr. Khoobehi.  If you go to the micro fat grafting forums there's a lot of info and results from women who have gone to Dr. Khouri.  So anyone who is interested in having breasts again but don't want implants or flap procedures there is a new technique that is a miracle. Kathy",
      "MessageIndex": 456,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    }
  ]
}