{
  "AuthorID": "chconnol",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134197/profile",
  "Posts": [
    {
      "AuthorID": "chconnol",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134197/profile",
      "Content": "Aug 29, 2011 01:21PM chconnol wrote: Biopsy over. Not a big deal. People were extremely nice and helpful. The doctor told me that the calcium deposits are extremely small but in a cluster. So small that they had to put in some kind of \"marker\" so they know where the samples were taken from. The doctor also mentioned that 80% of the time, these turn out to be benign. I am hoping that the doctor said that because his experience tells him that microcalcifications like mine are benign but somehow I feel like I might be fooling myself. All I can do now is wait. Thanks for the support...",
      "MessageIndex": 4,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773869",
      "Title": "Biopsy Today... chconnol momoftwo526"
    },
    {
      "AuthorID": "chconnol",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134197/profile",
      "Content": "chconnol wrote: Age 50, no family history of breast cancer. Went for mammogram three weeks ago and got called back to examine calcifications. Second mammogram stated that the calcifications looked suspicious and warranted a biopsy which I am having today. They did not give me a Birad number (or whatever it is called). I'm scared. The radiologists could not (or would not) give me more information. One of them did say that whatever it is (meaning the cluster) was tiny so it gives me some relief.  I know that I can only wait until the biopsy is done and I get the results but I'm hoping I can get some relief.  If it does come back positive for cancer, just how bad could it be? What is the worst case sceanrio? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773869",
      "Title": "Biopsy Today... chconnol momoftwo526"
    }
  ]
}