{
  "AuthorID": "Cheesequake",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
  "Posts": [
    {
      "AuthorID": "Cheesequake",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Cheesequake wrote: I just had a lumpectomy and SNB on Monday. The surgeon warned me that after my SNB there was a chance that I'd experience numbness/tingling under my arm, and now I sort of am - the top half of the back of my left arm is definitely affected. I still have feeling, it isn't exactly tingling, but it's clearly \"not quite right.\" There are definitely some affected nerves there. What the surgeon didn't tell me is, how likely is this to be permanent? I'm age 42, married, no kids. I have Li-Fraumeni Syndrome, a genetic disorder that gives women a nearly 100% lifetime risk of several types of cancer and makes radiation-induced cancers more likely. Dx 3/4/2015, IDC, Left, 3cm, Stage IIA, Grade 2, ER+/PR+, HER2+ (FISH) Surgery 4/26/2015 Lumpectomy: Left; Lymph node removal: Sentinel Targeted Therapy 7/16/2015 Herceptin (trastuzumab) Chemotherapy 7/16/2015 Carboplatin (Paraplatin), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830925",
      "Title": "Sentinel Node Biopsy numbness Cheesequake doxie"
    },
    {
      "AuthorID": "Cheesequake",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Cheesequake wrote: Hopefully I'm just catastrophizing. Around my port has been aching for the past few days and occasionally I'll get a mild ache in my neck (where the catheter is) or the back of the neck, today even into the back of my shoulder. I'm fairly certain I just overworked it or moved wrong, though I don't know when, but of course I'm concerned it's something more. For those of you who have dealt with infected/clogged ports, what were the warning signs? Thank you! I'm age 42, married, no kids. I have Li-Fraumeni Syndrome, a genetic disorder that gives women a nearly 100% lifetime risk of several types of cancer and makes radiation-induced cancers more likely. Dx 3/4/2015, IDC, Left, 3cm, Stage IIA, Grade 2, ER+/PR+, HER2+ (FISH) Surgery 4/26/2015 Lumpectomy: Left; Lymph node removal: Sentinel Targeted Therapy 7/16/2015 Herceptin (trastuzumab) Chemotherapy 7/16/2015 Carboplatin (Paraplatin), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835810",
      "Title": "port ache - infection? Cheesequake"
    },
    {
      "AuthorID": "Cheesequake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Oct 8, 2015 03:11PM Cheesequake wrote: My MO told me yesterday that severity of SEs has nothing to do with effectiveness of treatment, and that if the SEs are mild it just means you're blessed. I take everything she says with a grain of salt, however.",
      "MessageIndex": 3,
      "PostDate": "08/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/835585",
      "Title": "main effects vs side effects Cheesequake molliefish"
    },
    {
      "AuthorID": "Cheesequake",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Cheesequake wrote: \"If the side effects are bad that means the chemo is working!\" I've heard versions of this before and never really gave it serious consideration, but it does make me curious: does anyone know if any studies have been done comparing the severity (or specific types) of side effects with the effectiveness of the treatment? I'm age 42, married, no kids. I have Li-Fraumeni Syndrome, a genetic disorder that gives women a nearly 100% lifetime risk of several types of cancer and makes radiation-induced cancers more likely. Dx 3/4/2015, IDC, Left, 3cm, Stage IIA, Grade 2, ER+/PR+, HER2+ (FISH) Surgery 4/26/2015 Lumpectomy: Left; Lymph node removal: Sentinel Targeted Therapy 7/16/2015 Herceptin (trastuzumab) Chemotherapy 7/16/2015 Carboplatin (Paraplatin), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/835585",
      "Title": "main effects vs side effects Cheesequake molliefish"
    },
    {
      "AuthorID": "Cheesequake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Jun 4, 2015 04:14PM Cheesequake wrote: I was offered neoadjuvant chemo and declined because I am so terrified of chemo side effects - I wanted to have a full path report from surgery and know exactly what we were dealing with before moving forward with other treatment options. I did a lumpectomy, and am now preparing to start chemo (though I might decide to reject it at any moment, it's an incredibly difficult decision to make and as I said, I'm terrified of it.) Here's something to consider - if you have neoadjuvant chemo and the tumor shrinks, you'll know it has some effect. If you have the tumor removed and then do chemo, you have no way of knowing if your cancer is responding to chemo - as I understand it, they don't have a way to test for effectiveness after the tumor is gone, you're just going on statistics and hope. I find myself in this situation now and I hate it.",
      "MessageIndex": 11,
      "PostDate": "04/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832248",
      "Title": "Neoadjuvent vs adjuvent - help!! mira845 Stephmoen"
    },
    {
      "AuthorID": "Cheesequake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Jun 17, 2015 01:50AM Cheesequake wrote: Yep, it was exactly like an ultrasound, cuz it was one. It was easy - and actually quite interesting! I'd never had my heart scanned for anything before, so this was to set baselines. I was fascinated talking to the tech, she explained everything she was doing, all the things she was looking at and recording in my heart (both moving pictures and sound), and we talked about how it's similar to echolocation used by bats - sound waves creating images. She was also listening to the Black Keys, which helped, for me :D Thanks all for the guidance, as usual!",
      "MessageIndex": 5,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/832637",
      "Title": "Echocardiogram vs MUGA scan Cheesequake"
    },
    {
      "AuthorID": "Cheesequake",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Cheesequake wrote: So I finally decided to do chemo (based on lots of professional opinions), but now I have to WAIT for a CT scan and an echocardiogram! The CT isn't until June 4 and the echo is June 16! It's frustrating to finally make a decision then have to wait to go through with it. I'm hoping someone will cancel and I can reschedule both scans to happen sooner. My lumpectomy was Apr 27 and I've read that chemo isn't effective if initiated more than 12 weeks after surgery - I feel like the clock is ticking! (I'll try to find those studies...) I also have to get a port, and my MO isn't concerned about whether it's put in before chemo starts or after my first infusion - but I am!! I do NOT want to fight with my thin, deep veins on the first one!! The soonest I can consult with my surgeon (not even have the surgery itself) is July 1! Argh!!! End vent! Thanks for listening! I'm age 42, married, no kids. I have Li-Fraumeni Syndrome, a genetic disorder that gives women a nearly 100% lifetime risk of several types of cancer and makes radiation-induced cancers more likely. Dx 3/4/2015, IDC, Left, 3cm, Stage IIA, Grade 2, ER+/PR+, HER2+ (FISH) Surgery 4/26/2015 Lumpectomy: Left; Lymph node removal: Sentinel Targeted Therapy 7/16/2015 Herceptin (trastuzumab) Chemotherapy 7/16/2015 Carboplatin (Paraplatin), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832123",
      "Title": "waiting for stupid scans!! Cheesequake SlowDeepBreaths"
    },
    {
      "AuthorID": "Cheesequake",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Cheesequake wrote: So tomorrow I'm having an echocardiogram instead of a MUGA, because echo supposedly has less radiation - I have a genetic disorder that makes me even more susceptible to new cancers from radiation. Is it essentially like an ultrasound? I assume it won't take long? How is it different from a MUGA? Thanks in advance :) I'm age 42, married, no kids. I have Li-Fraumeni Syndrome, a genetic disorder that gives women a nearly 100% lifetime risk of several types of cancer and makes radiation-induced cancers more likely. Dx 3/4/2015, IDC, Left, 3cm, Stage IIA, Grade 2, ER+/PR+, HER2+ (FISH) Surgery 4/26/2015 Lumpectomy: Left; Lymph node removal: Sentinel Targeted Therapy 7/16/2015 Herceptin (trastuzumab) Chemotherapy 7/16/2015 Carboplatin (Paraplatin), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/832637",
      "Title": "Echocardiogram vs MUGA scan Cheesequake"
    },
    {
      "AuthorID": "Cheesequake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Jun 17, 2015 08:19PM Cheesequake wrote: And now I know that my ejection fraction, before treatment begins, is 66% - which seems to be as normal as it gets.",
      "MessageIndex": 6,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/832637",
      "Title": "Echocardiogram vs MUGA scan Cheesequake"
    },
    {
      "AuthorID": "Cheesequake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Aug 9, 2015 05:31PM Cheesequake wrote: Wow, GREAT info Nat! That'll help a lot of people coming to this thread. Thank you!!",
      "MessageIndex": 13,
      "PostDate": "09/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/832637",
      "Title": "Echocardiogram vs MUGA scan Cheesequake"
    },
    {
      "AuthorID": "Cheesequake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Jun 25, 2015 04:25PM Cheesequake wrote: Wow. Yesterday I had my port put in. I think I have more soreness than I did with the lumpectomy and SNB! It's manageable with a bit of cannabis oil for the pain and I think I'll try to go to work tomorrow, but... wow. They did internal stitches and DermaBond on the outside - both incisions look pretty angry, but so far I think it's going as well as can be expected. If I move really slowly I have essentially full range of motion. I don't think it's pressing on any nerves (something I saw mentioned by folks elsewhere here). It's kind of achy all the way from the chest incision up to the neck incision, across the port and the catheter up to the jugular. How long until the pain goes away? Chemo starts next Tuesday. My husband REALLY does not want me to do it. Earlier this week he texted me a picture of someone's chemo-burned hand, as well as a link to a specific embalmer's fluid that is used for deceased people who have had extensive chemotherapy, because they're more likely to have clotted or congealed blood. He's really hoping he can get me to turn down chemo. I don't have any answers as to why I'm doing it that will satisfy him.",
      "MessageIndex": 175,
      "PostDate": "25/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Cheesequake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Jun 14, 2015 01:26PM Cheesequake wrote: I'll be having a port placed on June 24 and chemo starts on June 30, so I guess I just squeak into this group.",
      "MessageIndex": 68,
      "PostDate": "14/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Cheesequake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Jul 2, 2015 11:32AM Cheesequake wrote: I was supposed to start chemo on June 30 but I had complications with my port that made it a no-go. Waiting to reschedule, so I guess I'll be on the July board! Daily, I am ever more sorry for all of us having to deal with this. Good luck everyone.",
      "MessageIndex": 247,
      "PostDate": "02/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Cheesequake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213025/profile",
      "Content": "Jun 15, 2015 12:02PM Cheesequake wrote: I see SO many people mentioning Neulasta, but my MO hasn't said anything about it. Is it only given IF you develop a white blood cell problem?",
      "MessageIndex": 72,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    }
  ]
}