{
  "AuthorID": "ChefHolli",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169882/profile",
  "Posts": [
    {
      "AuthorID": "ChefHolli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169882/profile",
      "Content": "Feb 9, 2013 09:37AM ChefHolli wrote: I too am having an Excisional Biopsy. Mine is scheduled for this Monday 2/11. My Gyn found a suspicious lump back in October, sent for a diagnostic mammogram. That was early November...they did mammogram and ultrasound that day. Said everything looked pretty good. Then I get a letter saying I need an MRI, had that done in early December. Got another letter saying everything looked ok. Then got a call from Dr. office saying I need a follow up in January. Dr. decided a biopsy was needed then. I saw my surgeon on Wednesday 2/6...he recommended the excisional biopsy. My \"little lump\", as I like to call it, is on the left breast, very close to the chest wall. Surgeon feels like it is probably fibroadenoma, but with where it is and they can't see it in any of the images he feels it is best to remove it. I am nervous mostly because I don't know what to expect after the surgery. Unfortunately I have a lot of risk factors...including family history of BC and Ovarian Cancer. I have never been able to get pregnant, and a few others. I am 39 years old, I actually had my first mammogram and ultrasound at 34, then another at 35. This is the first time I have needed a biopsy...",
      "MessageIndex": 7,
      "PostDate": "09/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800132",
      "Title": "Excisional biopsy. SueInMN fresitabr787"
    },
    {
      "AuthorID": "ChefHolli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169882/profile",
      "Content": "Feb 14, 2013 10:30AM ChefHolli wrote: Today is day 2 since my excisional biopsy. Went back to work today...had no problems. I am continuing to take the prescribed pain meds and use an ice pack. I have actually had very little bruising, but it is sore. Tomorrow is my follow up, hope to find out more then. I feel like I am dealing with the stress of all this ok...waiting the 5 days for the biopsy was the hardest so far. My shoulders were so tense I was using a heating pad every night. I am not focusing on the outcome of the biopsy really at all. Though I do feel that I am glad it is me going through this rather than one of my sisters...they both have kids, I don't...",
      "MessageIndex": 11,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800132",
      "Title": "Excisional biopsy. SueInMN fresitabr787"
    },
    {
      "AuthorID": "ChefHolli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169882/profile",
      "Content": "Feb 27, 2013 06:31PM - edited Feb 28, 2013 05:21PM by ChefHolli",
      "MessageIndex": 8,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801097",
      "Title": "End of my tether don't know which way to turn fenella fenella"
    },
    {
      "AuthorID": "ChefHolli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169882/profile",
      "Content": "Feb 11, 2013 03:51PM ChefHolli wrote: I just had a excisional biopsy today on a lump that all of us could feel:me, Gyno, and surgeon. It however did not show up on mammo, ultrasound or mri. Mine too was about 1.5 cm, very close to the breast bone at about 11 o'clock. I am 39 and also have very dense breasts. As others will tell you , 80% of biopsy come back B9. That is what I am focusing on. :)",
      "MessageIndex": 2,
      "PostDate": "11/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800321",
      "Title": "New...lump unseen on ultrasound. LYCM85 bdavis"
    },
    {
      "AuthorID": "ChefHolli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169882/profile",
      "Content": "Feb 14, 2013 12:18PM ChefHolli wrote: My unseen lump turned out to be a benign fatty necrosis with calcifications. Just saw GS today...said it was probably caused by an injury that killed the fat cells, then scar tissue developed. It was larger than we thought, about the diameter of a quarter and about 1/3 of an inch thick. Glad it is out! Now to recover from the excisional biopsy. Still have a follow up with GYNO and a follow up mammogram scheduled as well. They did find fibrocyctic breast disease in the same breast.",
      "MessageIndex": 13,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800321",
      "Title": "New...lump unseen on ultrasound. LYCM85 bdavis"
    },
    {
      "AuthorID": "ChefHolli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169882/profile",
      "Content": "Feb 27, 2013 09:45PM ChefHolli wrote: Hi fenella, I too have fibrocystic breasts. Had a regular checkup in Oct 2012, sent for diagnostic mammogram and ultrasound in Nov 2012, breast MRI in Dec 2012, follow up in January, then excisional biopsy in Feb. My biopsy turned out to be a benign fatty necrosis, thay they could not really see on all the images. When I had my follow up in January my Gynocologist, who has been directing all these tests, told me to cut out caffeine and start taking a vitamin E supplement. Caffeine can cause fibrocystic lumps to swell, and the Vitamin E is supposed to soften the breast tissue. Went back for another follow up on Monday with the GYN, she was very pleased with the reduction in size of another lump we were concerned about and feels the decreased caffeine is helping. So thankfully I don't have to go back until my regular check up closer to the end of the year. I am 39, have never been pregnant, and have a family history of breast and ovarian cancer, as well as some other risk factors.",
      "MessageIndex": 1,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801102",
      "Title": "Fibrocystic Breasts Support Thread fenella springmac"
    },
    {
      "AuthorID": "ChefHolli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169882/profile",
      "Content": "Feb 13, 2013 06:58AM ChefHolli wrote: I had an excisional biopsy yesterday for a 1.5cm lump in my left breast that could not been seen in a mammogram, ultrasound or MRI. I am 39 and have small, very dense breast, and have never had children. Also a family history of BC and Ovarian Cancer. My surgeon does not think it is cancer, but I am glad my doctors are being proactive because of my risk factors.",
      "MessageIndex": 15,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799958",
      "Title": "Had my ultrasound today... EmD ChefHolli"
    },
    {
      "AuthorID": "ChefHolli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169882/profile",
      "Content": "Feb 13, 2013 07:09AM ChefHolli wrote: Praying you get some answers today!",
      "MessageIndex": 1,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800361",
      "Title": "surgeon consult today Ilovemyboobs fenella"
    },
    {
      "AuthorID": "ChefHolli",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169882/profile",
      "Content": "Feb 12, 2013 05:48PM ChefHolli wrote: My Gyno has told me to cut out all caffeine, so have been weaning myself off for about 2 weeks now...going pretty good, but I do like my tea. :)",
      "MessageIndex": 3,
      "PostDate": "12/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/799528",
      "Title": "Need to cut caffeine because of cysts... SarahsMom ChefHolli"
    }
  ]
}