{
  "AuthorID": "chelle21",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164051/profile",
  "Posts": [
    {
      "AuthorID": "chelle21",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164051/profile",
      "Content": "Feb 7, 2013 06:00PM chelle21 wrote: I got my pathology report and nodes are all clear. Will go over in detail the rest of the report on Tuesday w/ my breast surgeon. Had a really rough time all of yesterday and today with pain. Long story short I went 16 hours w/out pain pills ;( just tylenol. It was a huge misunderstanding and I suffered big time. Just now starting to feel like I'm back in control of the pain. Went to see the ps today - got 1 of 2 drains out and since I was in so much pain he didn't do a fill which was ok by me. He said maybe by next week I'll get the other one removed. I cannot wait to take a shower. Laurie - sorry you are still the hospital. Stay strong. Hugs to you all.",
      "MessageIndex": 1011,
      "PostDate": "07/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "chelle21",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164051/profile",
      "Content": "Jan 10, 2013 09:14PM chelle21 wrote: Hello ladies. I'm 37 and the mom of 2 amazing boys 4 & 7. I was dx w/ DCIS on 11/7 and had a lumpectomy on 11/30. I recovered well from the lumpectomy. It was pathology report I got the next week that I was not prepared for at all. It showed no clear margins, an excessive amount of DCIS and invasive cancer. I knew this was a possible outcome but was shocked. I was sent for a MRI which showed another area of concern. Had an ultrasound and another biopsy - luckily the other area of concern turned out to fibroadenoma. Given my age and the amount of disease my surgeon recommends a mx w/ recon. I've met with one ps already and meet with one more tomorrow. My bs already has me scheduled for surgery on 1/31 - which I thought was odd since I haven't yet decided on which ps I was going with. She assured me it was fine. As much as I wish we weren't all here under these circumstances - I'm glad to have found this board. Just reading some of the previous posts has been very helpful and reassuring.",
      "MessageIndex": 371,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "chelle21",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164051/profile",
      "Content": "Jan 29, 2013 08:10PM chelle21 wrote: Can hardly believe my day is almost here. I'm so ready to get this over and done with. But at the same time I'm so very scared and nervous. It's been an inspiration reading about all the surgeries that have already taken place this month - I've learned so much. Thank you to all of you for your honesty and willingness to share your post surgery stories. They have helped me so much. I think I have everything in order around here. I wish I had an idea of how long I'll need help and to what capacity. I'm not one to ask for help so this is going to be a challenge when I can't do things for myself or my family.",
      "MessageIndex": 872,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    }
  ]
}