{
  "AuthorID": "chelle44",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234276/profile",
  "Posts": [
    {
      "AuthorID": "chelle44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234276/profile",
      "Content": "Jul 10, 2016 11:02PM chelle44 wrote: mine was bruised and itchy for at least a month. It stopped just after that. I normally heal very fast but the core biopsy too forever to heal.",
      "MessageIndex": 1,
      "PostDate": "10/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/845850",
      "Title": "pain and itching a month after biopsy Daisymay22 chelle44"
    },
    {
      "AuthorID": "chelle44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234276/profile",
      "Content": "chelle44 wrote: I found a small lump and let my doctor know. She sent me for further testing. I am 44. May 30th Mammogram showed nothing but dense tissue. Ultrasound immediately after showed a lump and they determined it was solid. The radiologist attended and I could tell that he was concerned. He did a core needle biopsy and five days later the diagnosis came in. Invasive Lobular Cancer. That was Friday June 3rd. I am now very anxious while I wait for the staging MRI. I have felt under the weather for the past six months. Unable to describe what was wrong. But exhaustion and deep bone pain in my hips. Could hardly lay on either side at night from the ache. I am fit, healthy and very active and now I am wondering if the past six months of issues are related. My family is a mess. More so than I am. My kids and husband are emotional and I just feel like we are in limbo waiting for the next appointment. I have read through many threads in this community and already feel very much supported by such a great online community. I will update once I have my MRI. June 3rd 2016; ILC diagnosed. Lumpectomy 0/5 nodes. Grade 2. Onco score 15 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844960",
      "Title": "Just diagnosed and impatiently waiting for staging MRI chelle44 Trvler"
    },
    {
      "AuthorID": "chelle44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234276/profile",
      "Content": "Jun 15, 2016 01:52PM chelle44 wrote: the MRI showed nothing we didn't already know. Which is fantastic! Doesn't appear to be in my lymph nodes or anywhere else. Phew. I meet with the surgeon tomorrow. Such a relief. I feel so grateful which sounds funny but I really do.",
      "MessageIndex": 7,
      "PostDate": "15/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844960",
      "Title": "Just diagnosed and impatiently waiting for staging MRI chelle44 Trvler"
    },
    {
      "AuthorID": "chelle44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234276/profile",
      "Content": "Jun 8, 2016 12:25AM chelle44 wrote: Thanks for your reply. I got my MRI date for this Friday. I will update when I know more. It helps having the next step booked. I need to take the guessing out to help me process this better. I hope you have your surgery soon blueorange.",
      "MessageIndex": 3,
      "PostDate": "08/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844960",
      "Title": "Just diagnosed and impatiently waiting for staging MRI chelle44 Trvler"
    },
    {
      "AuthorID": "chelle44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234276/profile",
      "Content": "Jun 8, 2016 11:47AM chelle44 wrote: Wow you guys are so awesome. It's wonderful to feel so supported by people who have all walked a similar path. Thanks for the advice regarding the MRI. I'm hoping the ILC diagnosis is just the small area they have already found on the ultrasound and biopsied. It will make this easier to face. I am worried of course due to how I have felt for the past six months. Basically going from a very fit and energetic mom to lethargic and barely able to function. I'm hoping its unrelated. But like I said,having the full picture and a treatment plan will help me. My family is still having trouble and that seems like the saddest part of all this. Thanks again everyone",
      "MessageIndex": 6,
      "PostDate": "08/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844960",
      "Title": "Just diagnosed and impatiently waiting for staging MRI chelle44 Trvler"
    }
  ]
}