{
  "AuthorID": "chemobrainf…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33515/profile",
  "Posts": [{
    "AuthorID": "chemobrainf…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/33515/profile",
    "Content": "Jul 31, 2011 08:23PM chemobrainfog wrote: I knew there was an issue with anesthesia and I didn't do my usual internet detour.  My last surgery was in October and that was a DaVinci robotic surgery... and if I can remember (Ha!), I was out for about four hours.  Thank you for filling in that blank!!   I just finished a \"clinical study\" which is actually a precursor to a clinical trial.  If this software program I used seems to be effective, I suppose Sloan will attempt to launch a clinical trial and I'm certain it will extend to all of the country.  I laugh about my diminished capacity.....Now.  Prior to being validated, it was very depressing. Initially, I was turned down for the clinical study.  Too high functioning on the phone assessment. Was so upset but I was on a CancerCare conference call in April with over 3000 people from all over the world.  Some of the things they talked about just made me realize that I can't control it, but I can learn how to cope. It so damn weird, but I can tell the difference from tip of my tongue to actually dropping a word.  And, it's very funny because I started this blog project...and knowing my brain may be \"off\" I try to have at least three things all set to go.  I think one of the ones I am posting this week is exactly about the tip of the tongue.... I'm scattered right now... but, my point is, I did go for a neurocog evaluation when I \"failed\" the test to get into the study.  They gave me an appt with the doctor who is running the study.  She supervised the test and she identified \"issues\"... \"oh there are definitely issues\" .... \"primarily with numbers... not a big deal except it is for you because you do this for a living\" .... JUST hearing that, made it better.  I will find out in October when they do my final evaluation if I had the real software or a simple version.....  and they will go over a detailed analysis of the results with me.   Now, I do just laugh.  Although, one of the things they specifically asked about on one questionnaire was about turning off the stove.  I never had an issue with that, although, I will admit, I rarely cook.  Kids grown, I live alone so I do lots of microwaving... Today, I had company and THANK GOD there was nothing near the stove or I suppose I might have burned the house down.  There was a low flame on a burner and I never turned it off.  We were all outside so I'm pretty sure the kitchen would have been a charred mess before I would have heard the smoke detector or seen the flames.  Lesson learned.. CHECK THE STOVE!! thanks for the well wishes..... five years is huge..... chemobrain ..... the fact that it's an issue being studied... that's good for all of us.. because we ARE SURVIVING... long term... and it doesn't get any better than that.... ",
    "MessageIndex": 3,
    "PostDate": "31/07/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/772236",
    "Title": "CHEMOBRAIN chemobrainfog vlnrph"
  }]
}