{
  "AuthorID": "Cher-Bear",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94534/profile",
  "Posts": [
    {
      "AuthorID": "Cher-Bear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94534/profile",
      "Content": "Cher-Bear wrote: Just wanted to see if anyone is out there that feels like I do. I finished my chemo a week ago and now I am doing the Herceptin every three weeks until the end of this year. I have also seen a Radiation Oncologist and I will begin Radiation in May. I am a Stage II and had 2 lymph nodes out of 14 test positive for cancer and also HER2+. I had a right modified radical mastectomy in October of 09. I just had two weeks ago an MRI which came out clean and the blood test markers which they too came out good. I am just really nervous of recurrence. My new Radiation Oncologist has informed me that I should have the Radiation as another precaution due to the fact that I had two lumps and the two positive nodes as well as the HER2+. He has stated to me that it is his job to keep me cancer free and alive for another 30+ years. I have to admit I am really scared. Cherri Kaetterhenry Dx 9/5/2009, IDC, 3cm, Stage II, Grade 2, 2/14 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/751735",
      "Title": "Stage II Cher-Bear Cher-Bear"
    },
    {
      "AuthorID": "Cher-Bear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94534/profile",
      "Content": "Apr 26, 2010 10:34AM Cher-Bear wrote: Good luck to you as well. I am with you as not ever wanting a recurrance or even a new cancer. I will let you know how the first round goes.",
      "MessageIndex": 6,
      "PostDate": "26/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/751735",
      "Title": "Stage II Cher-Bear Cher-Bear"
    },
    {
      "AuthorID": "Cher-Bear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94534/profile",
      "Content": "May 16, 2010 04:56PM Cher-Bear wrote: Pumpkinsoup - Just wanted to update you that I finished my first week of RAD and it was not bad at all. My doctor feels that I am going to be one of his cured patients and that makes me feel pretty good. The only thing I will tell you is make sure you get 99% Alovera jell to put on the RAD area. This weill help with itching, etc. I went to a health food store to get mine as when I went to Walgreens, they tried to sell me Alovera juice to drank. Not.",
      "MessageIndex": 7,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/751735",
      "Title": "Stage II Cher-Bear Cher-Bear"
    },
    {
      "AuthorID": "Cher-Bear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94534/profile",
      "Content": "Apr 24, 2010 09:03AM Cher-Bear wrote: Thanks for the reply. I am indeed going through with the radiation. I really have no choice as my two tumors added together added up to a 5cm and they say anything a 5 or more even if there are two or more lumps that add up to the 5cm they really suggest the radiation as a precaution treatment as well.",
      "MessageIndex": 3,
      "PostDate": "24/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/751735",
      "Title": "Stage II Cher-Bear Cher-Bear"
    },
    {
      "AuthorID": "Cher-Bear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94534/profile",
      "Content": "Apr 24, 2010 09:05AM Cher-Bear wrote: Thanks. I am going to go through with the radiation. As you say it is more of an inconvenience than anything else and I would rather say that I did everything I was instructed to do to try and prevent a recurrence. Take care",
      "MessageIndex": 4,
      "PostDate": "24/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/751735",
      "Title": "Stage II Cher-Bear Cher-Bear"
    },
    {
      "AuthorID": "Cher-Bear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94534/profile",
      "Content": "Dec 16, 2009 02:42AM Cher-Bear wrote: Hello - I am new at this as well and please bear with me. I started my first treatment two weeks ago tomorrow (December 16th) and I too am doing them every two weeks for 4 times. Then my next treatment will be with Paclitaxel weekly x 12 weeks and also the Herceptin 1 x a month for a year. So far with my first treatment I have only had nausea, but again I have only had one treatment. I am scared and of course nervous at times, but I know this is what needs to be done.",
      "MessageIndex": 5,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/744335",
      "Title": "Encouraging information!!! pickles26 Luah"
    }
  ]
}