{
  "AuthorID": "Cher64",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261402/profile",
  "Posts": [
    {
      "AuthorID": "Cher64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261402/profile",
      "Content": "Oct 20, 2017 09:10AM Cher64 wrote: Hi Robinms. I have given this a lot of thought for over a week. I researched it as well as talked to someone at the Cancer centre almost on a daily basis this week about it. The women here who had it done a year ago, show little to no side effects. As for fibrosis they weren't showing any more than someone who had the 16 treatments. I think I have decided to go ahead with the 5 treatments in one week. My main concern was that I was getting enough radiation to be effective and I was told I was by 99%. Being that my cancer was on my left side, I was concerned about my heart with the radiation, with the 5 treatments it doesn't go near the heart. I so want to get treatment over with so that I can start to heal physically and emotionally. As for the tamoxifen, my oncologist said I can start it before radiation, so I am 3 days in with that. Of course its too early to know how I adapt to that. Radiation will start in early November. Thanks for responding. Let me know what you decide.",
      "MessageIndex": 3,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859408",
      "Title": "ACCEL Trial vs normal full breast radiation Cher64 Cher64"
    },
    {
      "AuthorID": "Cher64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261402/profile",
      "Content": "Cher64 wrote: I am currently going through breast cancer, I was diagnosed first of August, had a lumpectomy and two lymph nodes removed in September. Just met my oncologist last week, diagnosis was good, I am Grade 1, Stage 1A, ER & PR +, HER2- He said chemo was not necessary. Radiation and hormonal therapy would increase my chances by a few percentage. So I have decided to do radiation and Tamoxifen (5 years). The Tamoxifen is only improving me by 1-2% but it seems like everyone I read about goes on it after breast cancer. As for the radiation, I fit the criteria to participate in a clinical trail where they only radiate the area where the cancer was as oppose to the whole breast for 5 treatments, Mon-Friday. ACCEL - Accelerated Partial Breast Irradiation. It achieves the benefits of radiation therapy (3 1/2 weeks) but reduces side-effects and the inconvenience of going 16 times for treatment. However, knowing that they are still waiting for long term results from this new clinical trial makes me nervous. But my oncologist talked highly of it. Trying to make a decision and don't know what I should do. Just want to get it over with so I can move forward, its been such a stressful and tough few months already. Was suppose to start the Tamoxifen 2 days ago but holding off until tomorrow as I am nervous to start taking it as well. Scared about what side effects I will have to deal with. I am 52 and still haven't started menopause. This whole experience has been mentally exhausting. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859408",
      "Title": "ACCEL Trial vs normal full breast radiation Cher64 Cher64"
    },
    {
      "AuthorID": "Cher64",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261402/profile",
      "Content": "Oct 15, 2017 02:58PM Cher64 wrote: I had a lumpectomy on Sept 6th and hoping to start radiation by the end of Oct or beginning of November. Everything has healed up pretty good. Eager to get it started, so I can get it over with. It will be either 16 treatments or if I do this new clinical trial, ACCEL, it will be 5 treatments for 5 days. Suppose to start Tomoxifen this weekend, but haven't started, nervous to begin it.",
      "MessageIndex": 97,
      "PostDate": "15/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    }
  ]
}