{
  "AuthorID": "Cheri40",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62061/profile",
  "Posts": [
    {
      "AuthorID": "Cheri40",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62061/profile",
      "Content": "Jan 24, 2008 03:01PM Cheri40 wrote: Barbara, I'm really sorry to hear your news. I have to say that you will get great support from the ladies on this site. They are very supportive, understanding and caring.All the things you need, so it is good to hear that your friends and family are there to support you too. I am sure the ladies on this site will support you with good advice or point you in the right dircection if they cannot help. Wishing you well Cheri40 ",
      "MessageIndex": 3,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/699093",
      "Title": "Dx is In BarbaraS AnnNYC"
    },
    {
      "AuthorID": "Cheri40",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62061/profile",
      "Content": "Jan 25, 2008 07:18AM Cheri40 wrote: hi Wanttoknowmore, I too had a mammogram last year that showed a 1cm mass in the left breast. However, the first course of action was to offer an ultrasound to try and determine what the mass was made of. From the ultrasound the radiologist said she believed it to be a mass of fat? Have they not suggested an ultrasound first or is the mass quite large in diameter? Rumoret & Fitchik are right, you have to decide what is best for you and none of us are qualfied to even attempt addressing the rights and wrongs of the claim. Good luck with whatever you choose to do. Cheri40 ",
      "MessageIndex": 4,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/699108",
      "Title": "core needle biopsies wanttoknowmore Texgirl"
    },
    {
      "AuthorID": "Cheri40",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62061/profile",
      "Content": "Jan 26, 2008 05:08AM - edited Jan 26, 2008 05:10AM by Cheri40 I got my referral letter and set up the consultation with the Breast Specialist clinic for next Thursday. Saw my GP this evening and asked him to confirm exactly what was said by the consultant at the hospital whne I went to ER concerning the pain. GP advised me that consultant said there was a lump and pain upon exammination of the left breast. So - I have 2 conflicting points of view so that's why I thank you ladies for encouraging me to get it double checked and put myself at ease. As I said before, the mammogram showed a 1 cm mass last year but US radiologist advised it was a mound of breast tissue/fat - as my GP said, it's my body and if 2 doctors give conflicting information, then I have a right to be sure. Thanks again everyone, will let you know the outcome of Thursday as you get the results before you leave on the same evening! God bless you all.",
      "MessageIndex": 5,
      "PostDate": "26/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/699071",
      "Title": "I'm back again Cheri40 purplequeen"
    },
    {
      "AuthorID": "Cheri40",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62061/profile",
      "Content": "Jan 24, 2008 10:46AM Cheri40 wrote: Hi Deborye, I will do, as soon as I get up I will call my GP tomorrow. Thanks for your advice and quick response. I must say, for all the wrong reasons but this site has some wonderful ladies who are supportive and really help to reduce your anxiety. Shuks, it feels like I know you all personally! Thanks Shirlann and Purplequeen.",
      "MessageIndex": 2,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/699071",
      "Title": "I'm back again Cheri40 purplequeen"
    },
    {
      "AuthorID": "Cheri40",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62061/profile",
      "Content": "Cheri40 wrote: Hi Shirlann, I came online yesterday and said my GP was not concerned with the sharp breast pain I had n Sunday night and said I should monitor it for 7 days. Today I can feel a small lump that is uncomfortable to the touch or when my arm is by my side. When I walked into the surgery to see my GP, he said your notes from the hosiptal say you can feel a lump? I said, what lump? There was no mention of a lump to the consultant at the hospital, just pain in the chest. I don't remember my GP feeling my armpits. I really don't want to seem like a woman suffering from paranoia but I don't know what to do? The lump could be totally unrelated to the pain in the breast even if it is in the same side. I have private health care through my job, do you think I should get myself rechecked with them? I must sound so so silly. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/699071",
      "Title": "I'm back again Cheri40 purplequeen"
    },
    {
      "AuthorID": "Cheri40",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62061/profile",
      "Content": "Jan 21, 2008 06:05PM Cheri40 wrote: Thanks Shirlann, your advice is comforting, I'll close my laptop now and see the gp tomorrow, I will come back to say how the visit went. Thanks again",
      "MessageIndex": 14,
      "PostDate": "21/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/698142",
      "Title": "very very scared! purplequeen purplequeen"
    },
    {
      "AuthorID": "Cheri40",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62061/profile",
      "Content": "Jan 21, 2008 05:09PM - edited Jan 21, 2008 05:13PM by Cheri40 Hi everyone, I'm new here and very scared too! Purplequeen, it is terrible that you were made to change the date. Personally, I would have refused as it was inhumane of them to do that (if they know what the appointment is for). Well, here is my plight, I turned 40 last year, had a mammogram courtesy of our private health cover at work (UK) and they found a 1cm mass deep on the chest wall. I was terrified and managed to have an ultrasound within a day of seeing my gp. The ultrasound revealed nothing, the radiographer said the mass appeared to be dense fatty tissue. I was relieved and got on with my life. Last night I had a terrible pain inside the top, left side of the chest, so bad that I had to take painkillers and was considering visiting A & E. The pain subsided during the night but in the morning, the pain was not so sharp but it had moved to underneath and around my left breast. I went to A & E and the consultant did and ECG and the usual to check it wasn't my heart and lungs. Then he examined my breasts, starting on the left - WOW..I nearly hit the ceiling, the left breast presented pain on exammination. The right breast was fine, the consultant asked me my full medical history and said I needed to see my gp - he went off for 20 minutes and then came back. He was on the phone to my gp and made an appointment for me tomorrow?? That has made me scared. I was too terrified to ask questions but I think I know what he was thinking.  I have looked at some sites for information, there is a cancer called Inflammatory breast cancer that presents with breast pain. Am I going over the top with worry, why did he decide not to leave it to me to make my own appointment?  I know I should have asked but I froze and thanked him and went home???Any advice is welcome.",
      "MessageIndex": 12,
      "PostDate": "21/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/698142",
      "Title": "very very scared! purplequeen purplequeen"
    },
    {
      "AuthorID": "Cheri40",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62061/profile",
      "Content": "Jan 22, 2008 05:25AM Cheri40 wrote: Hi Shirlann, good news from my gp. He cannot feel any lumps and is happy that the pain may be coming from the chest wall. He advised me to take painkillers and if the pain persists or it gets worse, I should see him again. The pain was there again when he exammined me and is still uncomfortable afterwards, there is no fever, drainage, rash - just the pain. I am happy with the outcome but I felt as if , 'what if they get it wrong' as no mammogram or ultrasound has been done to make comparisons against last years results...I should be grateful and just get on with my life but that awful nagging feeling is still there. Thanks for your support Shirlann.",
      "MessageIndex": 16,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/698142",
      "Title": "very very scared! purplequeen purplequeen"
    },
    {
      "AuthorID": "Cheri40",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62061/profile",
      "Content": "Jan 23, 2008 07:07PM Cheri40 wrote: Hi Purple, your employers sound like creeps! Don't let them take up too much of your precious time. Call centres are notorious for behaviours you have experienced. I posted a new message 'I'm back again' - Cheri doesn't know how to deal with this for the best",
      "MessageIndex": 23,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/698142",
      "Title": "very very scared! purplequeen purplequeen"
    },
    {
      "AuthorID": "Cheri40",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62061/profile",
      "Content": "Jan 25, 2008 07:11AM Cheri40 wrote: Hi Purple, thank you so much for your support. I've made an appointment for tomorrow with my gp to get a private referral to a specialist Breast Clinic that performs mammograms, ultrasound,blood tests, biopsies and routine operations for draining cysts etc all on one site on the same day! The hospital & consultant came highly recommended by our on site nurse at work. Hopefully they will have appointments for next week so I can finally be assured.  Thanks again Purple, I am staying very positive! How are you?????  ",
      "MessageIndex": 4,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/699071",
      "Title": "I'm back again Cheri40 purplequeen"
    }
  ]
}