{
  "AuthorID": "chessiegirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58385/profile",
  "Posts": [
    {
      "AuthorID": "chessiegirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58385/profile",
      "Content": "Apr 11, 2008 06:43PM chessiegirl wrote: The infection has cleared.  The oncologist thinks it may have been folliculitis, an infection of the hair follicles......",
      "MessageIndex": 6,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/703260",
      "Title": "weird side effect from rads.... help! chessiegirl Binney4"
    },
    {
      "AuthorID": "chessiegirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58385/profile",
      "Content": "chessiegirl wrote: I completed my radiation treatments two weeks ago.  I now seem to have an infection that my oncologist has never seen before!!  It started as a large (size of a 50-cent piece) red, hard spot under my left arm.  Then, smaller spots (filled with blood and pus) started forming under that arm, spread across my stomach, and under the other arm (which was not treated).  The oncologist thinks it may be a secondary effect of the rads, or it might be an infection of the lymphatic system.  For now, I am on antibiotics; if they don't help, I'll see a dermatologist and maybe my surgeon. Have any of you ever experienced such a side effect?  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/703260",
      "Title": "weird side effect from rads.... help! chessiegirl Binney4"
    },
    {
      "AuthorID": "chessiegirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58385/profile",
      "Content": "Jan 28, 2008 04:14PM chessiegirl wrote: I just started my radiation treatments today, so could I be part of this group??       When they put me on the table this morning, I got completely freaked out, because I felt like I was in the middle of a science fiction movie with all of the machines.  Everyone there was very kind, but I am having a hard time with it... going for 7 weeks makes it real that I have cancer.      My oncologist didn't say anything about going braless.  She also said that I didn't need to worry about any cream or anything yet.  She will check my skin every Monday and check for side effects.     ",
      "MessageIndex": 13,
      "PostDate": "28/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "chessiegirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58385/profile",
      "Content": "Feb 5, 2008 08:50AM - edited Feb 5, 2008 08:51AM by chessiegirl I am in week 2 of the radiation treatments.  When the oncologist saw me yesterday, she said, \"You look terrible!\"  I was running a fever and was exhausted.  I think the fever came from an inconsiderate co-worker.  I'm not sure about the exhaustion.  I am still trying to work full-time in a very stressful job, but am wondering now if I am compromising my health.  My breast is already starting to turn pink, so the oncologist gave me cream to use. This is very scary to me, as I don't know what symptoms are side effects and which ones are not.",
      "MessageIndex": 52,
      "PostDate": "05/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    }
  ]
}