{
  "AuthorID": "Chibi418",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182108/profile",
  "Posts": [
    {
      "AuthorID": "Chibi418",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182108/profile",
      "Content": "Chibi418 wrote: Hi all, So I am 23 and for a year or so my nipple has gone on random days of itchiness. After a few days it'd go away. I have excezma so I attributed to that, mostuirize and let it go (after a few days its gone). Except on around roughly May 28 when it started the itchiness didnt go away. In fact it got worse, my nipple started hurting, the skin got super dry (I was still mostuirizing even putting my excezma prescription cream) and started flaking. I also noticed things on my bra, not sure if that is just dead skin or discharge. I looked online and saw that those were symptoms for paget's disease. Concerned I scheduled an appt with my gen physcian for June 12th. She looked, literally just poked. Said it was hormonal and told me to be off. She would not listen to me when I said it was going on for 3 weeks, so it couldnt be hormonal, esp since the pain (The pain kicked in June 2nd) was in just my right breast. A few days ago I noticed that my right breast is extremely swollen (my roommate laughed at the disproportion between the two when I showed her), and I've been feeling around. I may have found a tiny pea sized lump (on the right side, the side where it hurts, the side that is extremely swollen), but then again it might just be me looking for something. I tried to schedule an appt at 2 hospitals but given my young age both wanted a referral from my doctor.  I have no idea what to do, and I am extremely worried. And this pain is terrible!!!!! Note I have no family history (my mom did have a brief scare, they found a lump. But considering she hasnt said anything (our rlnshp unfortunately is a bit strained) I am assuming it was benign) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806374",
      "Title": "23 and Worried Chibi418 Momcat1962"
    },
    {
      "AuthorID": "Chibi418",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182108/profile",
      "Content": "Jun 19, 2013 05:29PM Chibi418 wrote: Yes ultrasound would prob be a good idea.  Before this I thought mamogram was the only way.  I am just waiting for my period to start (should be by friday/saturday) so I have definitive proof that this is not hormonol, then hopefully my doctor will give me a referal. Any particular place/doctor to contact? I just called the women's centers in hospitals is that the right approach? And will do! Thanks!",
      "MessageIndex": 3,
      "PostDate": "19/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806374",
      "Title": "23 and Worried Chibi418 Momcat1962"
    }
  ]
}