{
  "AuthorID": "Chiclet92",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192646/profile",
  "Posts": [
    {
      "AuthorID": "Chiclet92",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192646/profile",
      "Content": "Dec 12, 2013 04:31PM Chiclet92 wrote: Hi - this is my first post. Came onto the board specifically looking for Perjeta effects. I'm doing neo adjuvant chemo TCH and Perjeta. I had 2 rounds of all. Today I had my third round just TCH. My doc stopped the Perjeta. I had terrible diarrhea, nausea and cramping. Doc thought this would give me some relief. I'll still have side effects but hopefully not as bad. I also have a shot of Neulasta. I think I might have a tiny bit of neuropathy but it is only occasionally noticeable. I think it is important to note: my tumor was/is close to the skin and easily palpable. It has shrunk to the point that we cannot feel it! So this response is part of the decision to drop it. I hope this is helpful to you. Good luck!!",
      "MessageIndex": 1,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815412",
      "Title": "Perjeta Side Effects: Neuropathy? Taste change? Others? kirklandgal kirklandgal"
    },
    {
      "AuthorID": "Chiclet92",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192646/profile",
      "Content": "Mar 26, 2014 11:26AM Chiclet92 wrote: I felt perfectly fine too.  I just found a hard lump one morning in the shower.  I did chemo (TCH) prior to my upcoming surgery and I could not wrap my mind around the fact that I felt great and that I had to take chemo and feel crummy.   I know my perspective is changing as time goes by and I've finished chemo.  I think yours will too.  It is overwhelming. ",
      "MessageIndex": 6,
      "PostDate": "26/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819541",
      "Title": "Did you have any symptoms prior to being diagnosed? Footballnut Footballnut"
    }
  ]
}