{
  "AuthorID": "chico1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92522/profile",
  "Posts": [
    {
      "AuthorID": "chico1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92522/profile",
      "Content": "chico1 wrote: Has been a week and a half since my second round of AC chemo.  My side effects are so horrible, fibromyalgia out of control, bowels and body still aching, it's as if my body is saying \"STOP KILLING ME\"!!!  I honestly don't know how my body will handle - always had somewhat of a fragile constitution.  Tumor 1 cent., no lymph involvement but her2neu+.  Once you've gone through all the chemo, radiation etc., what are all these treatments doing to your body?  Have taken all the meds. for SE's  but still feel like crap. Can't even imagine having another round! Going back to oncologist on Dec. 14th to see if they can lessen the dose or make some kind of changes, because if not, I'll take my chances and quit the chemo and look at alternatives!  Anyone felt or done something other than putting this toxic poison in their bodies? Help me!  Chico1  Dx 7/15/2009, DCIS, 1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/744959",
      "Title": "Stopping chemo chico1 vstadey2"
    },
    {
      "AuthorID": "chico1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92522/profile",
      "Content": "Dec 5, 2009 10:48AM chico1 wrote: I have gone every 3 weeks for 2 rounds of AC chemo.  I know I can't get the Herceptin without the chemo, and that is one of the reasons this is so challenging.  Also got the steroid decadrone but only take for a couple of days.........with definitely be checking with oncologist.",
      "MessageIndex": 3,
      "PostDate": "05/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/744959",
      "Title": "Stopping chemo chico1 vstadey2"
    },
    {
      "AuthorID": "chico1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92522/profile",
      "Content": "Jun 9, 2010 08:17PM chico1 wrote: Thanks for your response Kira, will definitely look into a therapist. Chico ",
      "MessageIndex": 2,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/753844",
      "Title": "Sore underarm chico1 chico1"
    },
    {
      "AuthorID": "chico1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92522/profile",
      "Content": "chico1 wrote: I just finished my radiation the middle of March.  Lumpectomy on the left breast, no node involvement but Her2neu+.  Going for herceptin every 3 weeks till Dec. About a month after the rads, my underarm on the same side of treatment has been very sore, also behind on back side and in the front of underarm is very sore and puffy.  Sometimes it radiates down the arm, especially the underside.  Somedays it is especially painful.  Went to GP and she didn't make much of it.  Claimed the radiation and surgery can cause.  Seeing the oncologist in a couple of weeks.....just wondering if any of you gals have experienced this.  Very afraid of lymphedema, man this just goes on and on.  Would appreciated any feedback. Dx 7/15/2009, DCIS, 1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/753844",
      "Title": "Sore underarm chico1 chico1"
    },
    {
      "AuthorID": "chico1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92522/profile",
      "Content": "chico1 wrote: Finished my radiation middle of March and the last few weeks have been troubled with a sore breast, and general achiness to the underarm area and arm on that side, hurts to sleep on that side.  Did notice some swelling after a exercise class a couple of weeks past.  Have been for about 3 manual lymph massage's ($90.00 an hr.!) - can't afford to be going for this as often as they think you should!  Swelling is only minimal, but the discomfort is really a bummer.  Mentioned to my oncologist, he thinks it is from the surgery but I had healed up quite nicely and didn't have any discomfort before rads, only after.  Anyone else been through this?  Had my lumpectomy back in July/09.  Would appreciate any feed back. Dx 7/15/2009, DCIS, 1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754682",
      "Title": "Breast and arm pain chico1 Sarnie123"
    }
  ]
}