{
  "AuthorID": "china48",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220172/profile",
  "Posts": [
    {
      "AuthorID": "china48",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220172/profile",
      "Content": "Aug 22, 2015 12:01AM china48 wrote: Hello, is anybody out there,.i need a little help here. I have no one to talk to bout this. My mother has passed,,my family lives 4 or more hrs away. My only daughter Google about it and now i am trying to find out a little info on wat is going on..",
      "MessageIndex": 8,
      "PostDate": "22/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789392",
      "Title": "Indentation or crease on breast with what feels like a hard vein GratiaPlena belleeast"
    },
    {
      "AuthorID": "china48",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220172/profile",
      "Content": "Aug 21, 2015 08:11AM china48 wrote: I am 48 yrs old,bout three wks ago i had a bad swelling my feet and legs were unable to swell anymore, so i went to ER. My blood pressure was crazy high. They got it down five me meds. When i got home i was putting my gown on and rubbed across my left breast to wipe sweat off. I have fairly lg breast. I felt a line fr the left side of breast going down through my nipple. I thought maybe my bra left the mark cause i was so swelled. Three days ago i was outside working ang wiped sweat fr around my breast and i found the same line,,,this freaks me out i go n and looked n mirror, the line is bout 6inchs long and just before it gets to the begining of brown part which is very lg also it branches off with another deep line. Its not as wide as pencil. But its deep. I dont feel any lumps. But my breast is lumpy feeling anyway. I breast fed four babies. I had a very lg mole removed when i was 12 fr the rt side of my left breast and it came back had it surgically removed two yr later.there is no history of breast cancer on mothers side of family .i have no history of my fathers side except he died of lung cancer. My daughter is freaking out about it. She Google it.now she has me worrying.",
      "MessageIndex": 7,
      "PostDate": "21/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789392",
      "Title": "Indentation or crease on breast with what feels like a hard vein GratiaPlena belleeast"
    }
  ]
}