{
  "AuthorID": "chj127",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
  "Posts": [
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Nov 26, 2008 04:41AM chj127 wrote: Agree with Sue and Jule.  I did pretty much the same thing. I had 6 cycles of TC 3 weeks apart; I had treatment on Wednesdays, and was OK to work on Thursdays.  By Friday I wasn't feeling quite as good, and Sat-Sun were blackout days.  :)  By Monday I was starting to feel better.  I'm 53 and only work 3 days per week (T-W-Th) so it might not be fair to compare, but for the most part, I was able to function pretty normally except for the 3 or so days over the weekend.  The way you describe yourself, you'll likely be fine!  Attitude has sooooo much to do with it.  But give yourself a break; toward the end especially, you might not be quite 100%.  It's great that your workplace is supportive, because that makes a big difference!  I wish you well! CHJ",
      "MessageIndex": 3,
      "PostDate": "26/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724991",
      "Title": "Working During Chemo zuffa kjbell"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Aug 5, 2008 07:46AM chj127 wrote: tomatojuice - The doctors told me to wait a month after chemo to start rads, but I wanted to keep things moving.  I met with the radiation oncologist right before my last chemo, assuming it would take a little while to get things set up.  I had my simulation 2 weeks after my last chemo and started treatments a week later.  Thai - you and I think the same way.  Let's just get this over and done with!!  I wanted to get my port out after chemo, but the rads doc said then he would wait a few weeks until I healed up, and I said, no, I'd wait until after rads to get the port out.  I finished rads 3 weeks ago (can it be??) and the port comes out tomorrow. Congrats on finishing chemo. I wish you the best! CHJ",
      "MessageIndex": 4,
      "PostDate": "05/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719011",
      "Title": "When To Start Radiation tomatojuice tomatojuice"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Nov 26, 2008 08:16AM chj127 wrote: Zuffa - go get 'em!  It has been said many times on these boards that the anticipation of chemo can be a lot worse than the chemo itself.  I have a feeling you will do great!  I've been through it twice (in 1995 and then again this year) and it's not the most fun you can have, but the time will pass and you'll come out even stronger than ever. So enjoy that turkey, and be thankful for the blessings in your life and the people who are surrounding you at this crazy time.  Hugs to you! CHJ",
      "MessageIndex": 5,
      "PostDate": "26/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724991",
      "Title": "Working During Chemo zuffa kjbell"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Aug 4, 2008 06:48AM chj127 wrote: It was no problem for me to skip an extra day when July 4th (holiday) fell on a Friday!  A friend of mine missed a day due to an ice storm.  And yes, the total number of treatments is what \"counts\" so if you would skip a day it would be tacked onto the end. CHJ",
      "MessageIndex": 4,
      "PostDate": "04/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/718981",
      "Title": "Radiation question Nanda Nanda"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 13, 2008 08:29AM chj127 wrote: Hi Nancy, Since no one else has replied, I'll take a shot at it.  I don't think anyone will ever specifically say \"don't use mass transit\", but because chemo can compromise your immune system, you are susceptible to any kind of germs out there.  I'd say mass transit is probably not the best place to hang out!  But with that said, we also have to go on with our lives and do the best we can...  Will you get shots (Neulasta, Neupegen, whatevet) to boost your counts?  That could help.  In any case, whenever you are out in public, I'd say take all the \"normal\" precautions - use antibacterial stuff, wash yor hands frequently, don't touch things in public then touch your face, etc. etc.  I am also doing chemo and I also take mass transit, but I only work part time and only use the subway 2 days per week, and if I don't feel so hot, I drive in.  But it's not as expensive here as it is in NYC!!! You might want to get an opinion from your oncologist.  You also might use this as a chance to work on your boss to get a bit more flexibility in your work arrangements, at least for the duration of your treatments, particularly on the days when your counts are expected to be at the lowest.  Remember, if you get sick because your immune system is compromised, you'll be more likely to miss work altogether, and it could potentially delay your treatments. I wish you the best, CHJ ",
      "MessageIndex": 1,
      "PostDate": "13/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702093",
      "Title": "Chemo and mass transportation NancyD QueenSansaStark"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jun 18, 2008 01:22PM chj127 wrote: Nice to know that I'm not the only one obsessed with my hair (or lack thereof).  But I'm in a \"who gives a rat's tail\" mood about how I look, so I'm sporting a very, very short and sparse 'do.  And I just don't care - well, maybe a little, but at least it feels better than the wig & hats. About the eyelashes - I found during my first bout with chemo that it wasn't the mascara that caused them to fall out, but trying to remove the mascara pulled them out.  My eyelashes were \"loose\" (they would come out easily, same as my eyebrows) but if I didn't disturb them, they were a lot more likely to stay put.  My eyebrows are starting to fill in, and I'm 6 weeks past my last chemo. I did lose more of my hair with AC (like, 100%) last time vs. TC this time, when I think I really only lost about 90%.  I also think that the majority of the sprouts I'm sporting now are the 10% that I never really lost.  And, what's up with all the gray???  I didn't sign up for that... CHJ",
      "MessageIndex": 47,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 3, 2008 08:15AM chj127 wrote: I had bc back in 1994 and they used my veins for 4 cycles of AC.  I had good veins at the time, but they really took a beating.  After that bout with bc, my right side became off limits because 21 of my nodes were taken out, and my left arm veins really weren't much good anymore because of the chemo.  Even simple blood draws are no longer simple because it's hard to find a good vein.  I have to also say that I used to be a frequent blood donor, and that didn't help, because I have a fair amount of scar tissue in both arms. With the current bout of bc (other side) the doc pretty much told me I'd get a port because of the condition of things, but it seems he recommends ports most of the time.  Keep in mind that the needles won't be restricted to the 4 cycles of chemo - you will also have blood drawn other times as well.  I really appreciate my port, and looking back, I wish I had had one the first time around.  But, lots of women have already reported in that they didn't have any problems with the IV, so it's not the same for everyone.  I just wanted to let you know the other side. Good luck whatever you decide! CHJ",
      "MessageIndex": 8,
      "PostDate": "03/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/701477",
      "Title": "Using your veins instead of a port for chemo infusions otter joteach"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Aug 12, 2008 01:17AM chj127 wrote: Hi Barra, I just got my port out last week.  I was SO happy to have it for chemo.  They told me I had a \"twilight\" anesthesia (light knock-out) and I don't remember a thing.  I have a neighbor who just had one put in last week, and she said they told her twilight also, and she remembers hearing them talking, and feeling them pushing on her.  She found it unnerving.  You might ask your doctor's office what they do. After I had mine put in, the pain from the incision was not that bad, and I just took Tylenol or Advil or something.  But my chest muscle was sore the whole way across my chest for about 2 weeks.  I remember worrying about it at the time.  It wasn't unbearable, just uncomfortable.  It was worth every little ache & pain to have it though.  It made chemo and blood draws so much easier! Hope it goes well for you.  CHJ ",
      "MessageIndex": 1,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719379",
      "Title": "Getting port in a week sarmcl bomber410"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 28, 2008 06:46PM chj127 wrote: This is my 2nd time through BC.  The first time they used my veins for 4 cycles of AC and fried my veins.  This time I have a port and I wouldn't trade it for anything!!  Good luck with your decision and treatment, I hope it goes well. CHJ ",
      "MessageIndex": 7,
      "PostDate": "28/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702994",
      "Title": "Is a port better for chemo or IV in hand??? Lano Texgirl"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Apr 19, 2008 12:36PM chj127 wrote: Hi LJ - Yes, I'm here... there is one of the docs in the practice I go to who is suddenly AWOL, but I hadn't heard what happened to him.  Not my doc... it could be the one you're talking about though.  Yes, that would be horrible. The rest of the practice (3 other docs) is crazy busy now, harder to get an appointment.  At least I only have 1 more tx! I've been hanging out in the Taxotere/Cytoxin thread mostly.  After tx #5 this past Wednesday, I'm pretty much down for the count.  I do lurk here, though, and it's nice to keep up with everyone. CHJ ",
      "MessageIndex": 2473,
      "PostDate": "19/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jul 13, 2008 11:54AM chj127 wrote: Hi everyone,  Forgive me for not keeping up all the time, so this topic might have come up before.  I finish up radiation this Wednesday (and not a day too soon.  Jeez, I hate radiation!)  So now I want to get my port taken out.  The onco said I could do it anytime.  Who has had their port out?  How did it go?  How long should I wait after rads to get it  out?  The area of the port does not touch the radiated area, though it is on the same side.  I am tender and a bit sore where I have been radiated, so I might as well be sore from the port removal at the same time and get it all over with, eh?? Have a good week, everyone!  CHJ ",
      "MessageIndex": 3383,
      "PostDate": "13/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Oct 17, 2008 08:28AM chj127 wrote: Carol - I have been on Arimidex since May.  I can't say I have aches and pains, except for my plantar fascitis (heel spur) that is acting up for the first time in 15 years.  I've been poking around the internet (the source of all true information) and I have found some sites that link plantar fascitis with Arimidex.  Something about the lack of estrogen making the tendons less elastic or something.  I'm seeing a podiatrist, and will get a night splint and new orthodics today.  Hope it helps.  I also have some stretching exercises to do.  In addition to the foot problems, I do have hot flashes, and I wake up drenched in the night sometimes.  I don't have them all that much during the day.  My oncologist, on my 3-month visit, asked me if I had hot flashes, and I told him about getting soaked in the night, and he basically said, well, that's nice and moved on to the next topic.  (I am changing oncologists for sure, I really am!!) Anyway, I'm hoping I get away with nothing worse than that with the Arimidex.  Hope yours gets better also! Forgive me if I missed or forgot about this discussion  - I know SisKimberly had the genetic testing, but did anyone else?  I had the \"counseling\" session (advantages, disadvantages, that discussion) and I'm still not convinced I need to do it.  They can't seem to tell me if insurance fully covers it or not. I'm not sure I want to know, but if I did have the gene, I'd have my ovaries out immediately.  What the heck, I've already been through menopause and the Arimidex is knocking out any remaining estrogen anyway.  So I still have that decision to make. Next on my agenda - finish up a root canal (next week) and my routine colonoscopy.  Does the fun never end?? Race for the Cure on Sunday!  It's supposed to be pretty chilly (especially early in the morning) but I'll be there.  And I might even wear pink! Happy Friday everyone! CHJ",
      "MessageIndex": 3839,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Dec 15, 2008 07:57AM - edited Dec 15, 2008 07:58AM by chj127 Hi all! Jeez, it's so hard to keep up here, and I hardly know where to start!!  It is amazing that I've been hanging out with you all for such a long time.  My lump surgery 1-year anniversary was on Saturday (12/13). DH and I toasted to it, but it passed without much fanfare.  The ironic thing is that my first mast surgery was also December 13, in 1994.  Not as hard to remember anniversaries when they are the same friggin' day!! Norma - I just had to comment on the switching oncologists thing. When I was referred to the onc last December, it was this amazing woman who had just come to the cancer center where I go and her reputation was sooooo positive.  I was looking forward to working with her but the day before my first appt. she was in a bad car accident.  I then was moved to another (male) onc at the last minute, who did all my chemo, etc. He's really a very nice guy, and I have no doubts about his skills or his treatment decisions, but I just never connected personally with him, and I just don't think he really hears me when I talk about what's going on with me.  Like I said, he's nice, but very clinical.  I tried once in the middle of my chemo to switch back to the woman onc, but she was still not ready to take on new patients.  When I saw the surgeon (and breast center coordinator) a few weeks ago, I asked him if there was any reason why I couldn't switch even now for my ongoing onc followup.  He said of course not, and had the breast coordinator set it all up.  So I see her January 5th.  As I was getting all the records transferred, etc., the old onc actually called me on the phone to find out why I was switching.  Oh, what an uncomfortable conversation!!!  But I told him (part of) the truth, that he didn't do anything \"wrong\", I just would feel more comfortable with a woman onc.  So we parted friends.  Anyway - bottom line is that if you want to switch, just do it!! For those of you considering the ooph - me too... I'll be anxious to hear what the new onc has to say, but I'm pretty sure I'm going to do it - in the spring, when I don't have to worry about a snowstorm that day! LJ - bummer about your cat. I hope you're healing up OK.  I actually had a cat once turn and try to rip my nose off.  It was (as you said) one of the sweetest cats I know, but she was freaked out by another cat.  They can be unpredictable.  I used to volunteer at the Balto. County Humane Society, and there was a cat in there that was particularly snarly when she was put back into her cage.  She had done some damage to a couple of people.  She had a bad time of it at the shelter, and it's a very long story, but she's lived at my house for going on 10 years now, and hasn't hurt a flea since.  >^..^< Did I hear someone say, \"reunion\"?  Sounds like fun!  No promises here, but I don't have many scheduling issues.  It would be nice if where ever we go is close to an airport - a major one with direct flights from lots of places... I went on a 3-day trip to Williamsburg VA last week.  So much fun, the decorations this time of year are awesome.  It was a bus trip from our community, and on the way back I found out that one of the other women who was on the trip is also a 2-time survivor.  We're planning lunch after the holidays to compare notes. That's all I have time for right now.  I will try to do better at keeping up!! CHJ",
      "MessageIndex": 4060,
      "PostDate": "15/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Dec 22, 2008 08:27AM chj127 wrote:",
      "MessageIndex": 4088,
      "PostDate": "22/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 7, 2009 09:02AM chj127 wrote: Carol - we'll take you on the Raven's side anytime!  I'm wondering where LJ has been, she should be a Raven too... Paula, that dream is hysterical!!  I can sometimes remember dreams right after I wake up, but you really had the living-color version.  :) I'm pretty much over my indignation over all the pink stuff.  It still sometimes annoys me - I went to a friend's house the other day and she got the pink-ribbon version of a Dyson vacuum.  Who the heck wants a pink vacuum cleaner?  Whatever!  But some things are kinda fun, and one of these days, I'm going to order me one of these: http://www.tiedyedshop.com/tie-dyed-222ls.html Tinalee - good luck with the Arimidex.  I started it in May, and can't say I have too many problems (heel spur flare-up, a few sore joints, nothing I can't deal with).  But then I also took Tamoxifin in 1995-2000 (5 years) and didn't really have issues with it either.  Or maybe I had issues and didn't make the connection.  I can't remember...  I see my new onc next week, and will be interested in her opinion about having the ooph.  I'm pretty sure I'm going to do that, in the spring when I don't have to worry about the chance of ice or snow. Julie, I hear you about the ice, though.  We really dodged the bullet yesterday and today.  They were calling for it to really get icy here, but the temps stayed just above freezing, so we're OK. I'm at work, should be working, so bye for now! CHJ",
      "MessageIndex": 4180,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 15, 2009 07:14AM chj127 wrote: OK, this will be short - Carol, Sun-Wed, July 12-15 is fine with me. GO RAVENS! CHJ",
      "MessageIndex": 4259,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 5, 2009 08:09PM chj127 wrote: Maz - I add my prayers and hugs to you.  Having to go through it again really is crappy.  We're with you, girlfriend.  Let us know how things go.  CHJ",
      "MessageIndex": 4471,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 30, 2008 03:33AM chj127 wrote: Good morning, Jewels, I wanted to check in - vettegal, where are you?  Haven't heard from you in a few days, and wanted to make sure you are doing OK. I thought I might try to go to work today.  I got up & showered, but am still feeling a bit weak & shaky.  Not bad, but not good enough to make the hour+ trek to the office.  Looks like it will be another lonely day working from home.  Maybe tomorrow.  But I know, I know - I shouldn't rush it!! Take care today, everyone. CHJ ",
      "MessageIndex": 945,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 31, 2008 12:58PM chj127 wrote: LJ - you need fat???  I'm right up the road!!  Gimme a call, I'll give you enough to be a D cup on both sides!!!  CHJ ",
      "MessageIndex": 991,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 6, 2008 04:54AM chj127 wrote: D1, Kathy, Carol - if I'm not too late, kick some BC butt today!!  Hope it goes well.  I'll be going with CarolC tomorrow. Vettegal - I had to weigh in on your vent.  I am sure we all feel like that at some point or another.  I try to keep positive, but every so often, I just can't do it.  What Kathy said her therapist said... last time I went through all this, I can remember about 6 months after I was done with treatment breaking down crying, saying \"I just want my energy back!!\"  I look at other people even now and am envious of what seems \"normal\" (you know, like having hair, enjoying food, etc.)  So what you are feeling is so normal.  As Kathy said, you need to get it out, so vent away!  That's why this group is priceless. Well, I am working from home today & have to get to it.  Have a great day, everyone!! CHJ ",
      "MessageIndex": 1105,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 7, 2008 06:45AM chj127 wrote: Well, just like that, things change.  I came down with a stomach virus or something yesterday, and was throwing up & going to the bathroom most of the night. I have a slight fever as well, so I will not be getting chemo today. It has been moved to Monday.  I am so bummed to get off-schedule.  I wanted it to be late in the week so I'd have time to recuperate over the weekend, but not now.  I feel like crap (again!), and I have to get re-hydrated, because heaven knows how much fluid I threw up last night!  All that drinking yesterday in prep for the chemo... All of you new baldettes - you look awesome! Resting today, CHJ ",
      "MessageIndex": 1128,
      "PostDate": "07/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 11, 2008 05:52AM chj127 wrote: Cathy-CA - I'm with you today!  Let's get 'r done! CarolC - thanks for the encouragement re: few se's.  I think I deserve it this time for all I've been through in the past 3 weeks!! golfer Carol - Yes, I have my \"Friends United by Breast Cancer t-shirt under my layers.  It's about 6 degrees ouside my door, so I am bundled up.  A friend is coming in a little bit to give me a ride.  I know she will get a kick out of the t-shirt, and will totally take it the way you all dreamed it up!!! SIS Kim - love, love, love your superhero pictures!  You know, I have a new respect for bald!  So many of you look great that way!  I may work up the nerve to go out topless at some point, but only after it gets warmer around here!  I do have to lose the last of the stubble, though.  Maybe after this tx. Well, away I go.  I sure hope my blood counts are up to the challenge! CHJ ",
      "MessageIndex": 1229,
      "PostDate": "11/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 13, 2008 11:26AM chj127 wrote: Good morning, all, Well, I'm on day 3 from tx 2, and so far I still feel reasonable human.  I wonder when the truck will hit??  It's been more than 24 hours since I got the Neulasta... I also laughed about the comment about the similarities between having chemo & being pregnant.  One of my coworkers is pregnant, and we are constantly comparing symptoms.  I think we're having a Gatorade contest - who can drink the most? Paula - it's so awesome that you have so much support at work.  My coworkers are fabulous as well.  It sure does make it easier.  Sorry also for you all having pooper problems, I'm with you.  With my stomach bug last week I was pumping Imodium, and now I'm doing the laxatives and so far not much luck.  You just can't win sometimes!! Golfer Carol - if I'm not too late, hope it goes well for you today! CHJ ",
      "MessageIndex": 1284,
      "PostDate": "13/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 5, 2008 08:05AM chj127 wrote: Hi all, Well, I'll be off to chemo shortly.  Thanks, all for the well wishes!  I've been feeling really good for a week, and hate to see that come to an end.  But the cold is practically gone.  I'm hoping for one tx with no other illnesses this time! Dana - I'm with you.  I took the steroids yesterday, and got very little sleep last night.  I was going over and over and over everything that's on my mind, and then we had some heavy rain overnight, and that didn't help things much.  Tonight I'm going to do the drug smorgasbord - steroid pill, Tylenol PM, Senokot, and whatever else I need!!! Have a great day, everyone, especially Carol & anyone else joining me at the chemo bar today! Love you all, CHJ ",
      "MessageIndex": 1689,
      "PostDate": "05/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 11, 2008 06:54AM - edited Mar 11, 2008 06:58AM by chj127 Good morning, everyone!  I'm on tx Day 6 and back in the office.  I'm happy to be among people and feeling pretty good, except that I didn't sleep well last night, and I'm treating that with a diet Coke... Carol - you are so cute!!  And so are your kids.  Jenn51 - we'll pray for the best for you!!  Hopefully you are worrying for nothing.  And you are still a spring chicken.  I'm not that far behind, at 53. I also have had some sore ear problems.  Funny, it's the little things.  This is a sort of big deal for me, though, because I don't normally wear funky earrings (I'm a conservative type) but with the no-hair going on and wearing hats, I'm breaking out my chunkier earrings, some of which I saved from my first bout with BC.  But some of them have thicker wires or stems, and they are sore.  So it's not just me, huh? Joan - I'm sorry about your dog and the timing.  That must have been so hard.  The critters are just amazing when they sense how we feel.  And Joan - wow, our dates are so similar: My first bout with BC in 1994 was found as a lump and we went from there.  This time, it was found on my routine mammogram October 19 (other side).  Moved from the suspicious spot on the mammogram to the ultrasound, to the biopsy and the rest is history.  Lumpectomy was on December 13. Have a great day everyone!! CHJ",
      "MessageIndex": 1804,
      "PostDate": "11/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 28, 2008 11:06AM - edited Mar 28, 2008 11:07AM by chj127 Wow, this is a busy group!  It's hard to keep up.  This is day 3 for me, following tx#4 - feeling a little shakey and a little achy, but not too bad.  The weekend will be worse, I know, but hopefully it will get quickly better after that.   Paula - I know what you mean about the steroid buzz - I hate not being able to sleep.  It seems that I can GO to sleep, but I can't STAY asleep.  I woke up at 12:30 this a.m., and popped a Tylenol PM, and got back to sleep within an hour and slept all the way to 6:30, so I'm considering that a success. OK, am I the only one leaking brain cells?  Twice now I've made the wrong payments on my on-line banking.  One caused a payment to be missed, and this month I overpaid the phone company by $179!!  Jeez.  I never did stuff like that before. To all of you getting treatment today, I wish you the best. Spring is just around the corner.  We're supposed to have 60 degrees today, though a little rain later.  It feels spring-y outside.  I need that!! CHJ ",
      "MessageIndex": 2148,
      "PostDate": "28/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "May 13, 2008 08:27AM - edited May 13, 2008 08:29AM by chj127 Hi everyone - thanks to SISKimberly for the nudge last week.  Sorry I've been absent.  I have been spending time over at the Taxotere & Cytoxin thread.  I was having a really hard time keeping up with all of you (you are all so chatty!) and got a bit down when many of you finished and my treatments just seemed to go on and on and on. I have been lurking some, because I still do feel a connection to all of you.   So yes, I finally had my last tx on May 7th.  It was relatively uneventful. I went through the usual lousy weekend and am back to work today.  I had a hard time regaining my energy from tx #5 also, and was a bit depressed about that for a while.  I assume it will take me a good bit of time to recover from my 6th and final tx, but at least it is the final one.  All together now: wahoo!! In the meantime, I think I mentioned in here a while ago about how we had been trying to sell our house.  Well, a buyer came out of nowhere very suddenly, and so we are finally going to move (just 20 miles away) next Monday.  I am so happy that this is finally happening, even though it's been really hard dealing with chemo and packing simultaneously.  Thank God for friends who bring food and who otherwise help.  I think we are in good shape, but this will be a marathon week for sure.  I work a little, rest a little (and repeat as necessary). So next week looks like this: Mon - movers take the furniture (we've moved the vast majority of everything else).  Move the 4 cats (this will probably be the hardest thing we do!!) Tues - clean up the old house, get the remaining stuff out Wed - go to closing on the old house Thurs - see the radiation oncologist for simulation (no vacation from bc) Fri and the whole Memorial Day weekend - rest, celebrate, rest, celebrate (and repeat as necessary!) Then begin radiation the following week. Yes, life is nuts sometimes, but it will be good to own only one house, be done with chemo, and get on with a new and different life.  The change of scenery will be a positive for both dh & I, I am sure. Thanks again for not forgetting about me! CHJ P.S. almost forgot - I went back for my 6 month followup mammogram and check with the surgeon yesterday.  Everything is OK, come back in 6 months.  Whew!",
      "MessageIndex": 2793,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jul 9, 2008 10:07AM chj127 wrote: Re: genetic testing - my doctor's office called me also to make an appointment to \"discuss\" whether or not I would want genetic testing. They suggested it, supposedly since this is my second time with bc, and my mother's sister had it also.  I have put it off because I can't handle anything else until all the other stuff (radiation, getting the port out) is over.  Even then, I'm not sure I want to know. But can I ask a really dumb question?  I've heard that lots of women get their ovaries removed, presumably (I assumed) because of the estrogen production.  So, if I went through menopause 4 years ago, is there any point in having my ovaries out? D1, what were your \"flags\" that made them want to do the test? Have a good day, all! CHJ",
      "MessageIndex": 3351,
      "PostDate": "09/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Oct 19, 2008 02:56PM chj127 wrote: Race pics!  It was cold, it was crowded, but it was a blast.  That's me in the hat, and my buddy who helped get me through chemo.  The survivor pic is not great, and there were so many women, I'm not even in it (was waaaaay off to the right).  Anyway, at least the sun was out!  ",
      "MessageIndex": 3855,
      "PostDate": "19/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Nov 6, 2008 02:21PM - edited Nov 6, 2008 02:36PM by chj127 Hey - Yes, LJ, thanks for the info about weights.  I printed it out.  I have a few free-weight things that I do sometimes, but it's good to know other exercises. D1 - about the election (and I will not turn this into a political forum!!) - I wanted McCain to win, because Obama's politics are way too liberal for me.  But it is what it is, and I'm sure our country will be fine.  The real \"aha\" moment for me happened yesterday when I went into work.  The young woman whose office is next to mine was so emotional about it.  She is someone who I like a lot and whose work I respect and who also happens to be black.  She has a son who is under 4, and she said that he will never really remember a time when it was not OK for a black man to be president.  She said her son will now have a role model who is not a basketball player or some other sports figure.  And that's when the real impact was made clear to me, and I understood the significance of this election a whole lot better.  I still wish McCain had won :) but I think the ultimate outcome will have a long-term positive effect on this country.  <politics over> Kathy - my dh is originally from NE Penna, and I guess it's a big deal up there too, since Biden's from Scranton originally. Oh, and D1 - I also had my hair cut yesterday!  It really needed shaping again.  The woman who cut it blew it dry and it was all poufy (which I hate) but once I got home and did it my way, it's fine!  I'm still having a hard time deciding how short or long I want it.  It sure is easy to deal with short! That's all for now, I'm supposed to be working... CHJ P.S., tomorrow's my colonoscopy, so I'm on clear liquids today.  I'm sooooooo hungry.  What I wouldn't do for a ham sandwich right about now...",
      "MessageIndex": 3917,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Nov 19, 2008 07:22AM - edited Nov 19, 2008 09:28AM by chj127 Oh, Kris, that just sucks!  Deep breath...  I do know what you mean, though - just get rid of it all!!  I wonder sometimes if I should have had a mast instead of a lumpectomy.  If I end up taking it off in the end, it will really tick me off, because I just hated radiation.  Anyway, I'll say a prayer for you that there's nothing going on.  And Kimberly - prayers too for your sis. I'm like many of the rest of you - next Monday is my mamm/MRI/followup with the surgeon.  I'm definitely getting anxious about the while thing. Have a good day, everyone! CHJ",
      "MessageIndex": 3963,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Nov 19, 2008 09:26PM chj127 wrote: Carol - have a great vacation!  I'm about ready for one of those myself...  D1 - YES, too cold, much too cold this early in the season.  The \"normal\" is 55, and I'd settle for that, really I would.  I hope you can hook up with a good therapist.  I worked with a woman in Rockville (or was it Bethesda?) my first time around.  She was a LCSW, and was the woman who facilitated the support group I was a part of for about a year. (The group was for \"young women\" and at 39 (back in 1994) I was the oldest one in the group of 18.)  She was just awesome, and met with me one-on-one for a couple of sessions. It was so helpful, so I hope you can get someone you click with. Dana - good to hear from you again.  You have been through so much, I don't know how you do it!  I hope your exam goes well and you are able to get on with a new career when all of this schooling stuff is over with.  Take care of yourself, girl! Nighty-night! CHJ",
      "MessageIndex": 3967,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Nov 25, 2008 03:03PM chj127 wrote: SisKimberly - hooray for Thanksgiving break!  All of us in the working world should get that.  :)  It's funny - I saw that same magnet on the back of a car when I went in for my tests yesterday (save the TaTa's).  My mammo came back fine (hooray!) and the MRI won't get read for another couple of days, so I'm supposed to check in with them on Monday.  The MRI was just of my breast, so no info about other organs or bones...  But I do have to say, that was the most painful mammo I ever had.  I never totally minded it before, but this one was awful.  I think it's partly from the radiation (I've never stopped being sore since then) and partly that she really pulled on me to do it.  Anyway, it's still sore today if I stretch certain ways.  At least it's 6 months until the next one! I asked my surgeon what he thought about genetic testing.  He looked at the geneticist's report that said the probability of my being BRCA + is in the range of 6-17% - not high.  He said with my ER/PR+ that if I was his wife, he'd recommend having my ovaries out (that would have been the one reason I'd want to do the test - I have no sisters or children).  He said that would reduce my chances of another BC by 50% and almost eliminate the chance for ovarian cancer.  I'm thinking that's a pretty good idea.  Maybe in the early spring. Cathy - that's awesome about your walk!  Sounds like a great experience! That's all - back to work! CHJ",
      "MessageIndex": 3984,
      "PostDate": "25/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Dec 26, 2008 03:51PM chj127 wrote: Carol - love the snow-woman!!  Sounds like lots of you all got what you wanted for Christmas (nips, drain out, cars, new hairdos, etc...)  We had a quiet, relaxing day at home, so it was a great Christmas as far as I'm concerned!  Sooooo much better than this time last year, eh?  I went back and read some of our posts from this time last year, when we were all recovering from surgery and getting anxious about chemo.  I feel blessed beyond belief that I've had the support of everyone here, and that we're doing so well a year later. May 2009 be better than ever for all of us!  CHJ",
      "MessageIndex": 4113,
      "PostDate": "26/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 11, 2009 02:38PM chj127 wrote: Kathy/vettegal - I have to say, it's unnerving anytime the Ravens play the Steelers or the Eagles!  We are so close to both, and there is a lot of rivalry here.  I hope we get the chance to beat both!  About Vegas - someone where I live is planning a group trip, and she swears that getting into Vegas on Sunday is a good time to go.  So (re: what Kathy said), maybe we could do Sun-Tues?  I can do whatever. CHJ",
      "MessageIndex": 4224,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 28, 2009 03:32PM chj127 wrote: I requested FB Jan Jewels also...  CHJ (Carol)",
      "MessageIndex": 4372,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 23, 2008 04:14AM - edited Jan 23, 2008 04:18AM by chj127 Julie - you are too funny - a mohawk first?  What the heck! I love it when we keep our sense of humor!! And PALady, you said, \"The anticpation was definitely worse than the actual shaving\" - I think that's going to be my problem.  I think I am mentally ready to lose my hair, but not sure about emotionally ready.  I have the hats (and ordered 2 more from the tlcdirect site) and my wig should be in this week.  But am I really ready???  The one good part of it, though (I remember from before) is that having no hair cuts the get-ready-to-go-out time in HALF!  No washing, blow-drying, and I can get ready for work in NO TIME!! Julie - I have no idea how you could work up the energy to teach high school.  But good for you!  I am extremely blessed that I only work 3 days per week doing computer stuff and I can work from home if I need to (which I'm doing this week).  But I am getting antsy to get out among people.  I'll definitely be back in the office next week. I'm crazy about all you girls already!  T minus about 10 days for my hair... CHJ",
      "MessageIndex": 726,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 24, 2008 05:28AM chj127 wrote: Hey everyone! I really need to check this place often to keep up.  Lots of activity since last evening, I love it! Dana - I tell myself that as long as I stay positive about 95% of the time, I'm entitled to throw myself a pity party every now and then, where I am the guest of honor.  Sometimes you just go there, and you can't help it.  It doesn't mean your faith is less, it just means you are human!  You have gone through a lot and you are now and will go through a lot more until it's over.  Hang in there and lean on your buddies!  Julie - you will laugh at this - when I read your post really quickly (where you said \"after my second day back at work, I'm pooped\") at first I read it as \"I pooped\" - and I thought, great!  Someone else has overcome their constipation problem, hooray!  But then I read it the way you wrote it.  But I had a good laugh with that one. Jenny - I'll repeat what the other women say: DRINK FLUIDS.  Maybe someone told me that ahead of time, but I don't remember anyone really stressing that.  I wish I had done that.  You can believe I will the next time!!  For all of you getting tx today - kick some bc butt!!   And at the end of the day, it will be one more behind you. Gotta get back to work.  Take care everyone!! CHJ ",
      "MessageIndex": 773,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 26, 2008 04:50PM chj127 wrote: The problem with the formatting on the previous page (I had it too) is because of the size of the pictures - they have to fit, and so it makes everything on that page bigger.  But the pictures are AWESOME, so who cares???  Thanks to the gorgeous girls who shared.  And I noticed the smiles, too.  Keep smiling, everyone!! CHJ ",
      "MessageIndex": 871,
      "PostDate": "26/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 28, 2008 05:47AM chj127 wrote: Good morning Jewels, I have a question - I am 10 days past my first tx, and today I feel like crap!  I'm constipated again, queasy, have prickly skin, and chills.  Honestly, I feel kind of like I did on day 4 or 5.  Has anyone else has a \"relapse\" when you were feeling good?  The past few days I have felt pretty darn good, but today I had a hard time dragging myself out of bed!  I guess it's possible I'm getting some other kind of illness (but I sure hope not). I was planning to go back to the office tomorrow (I only work 3 days per week, and worked from home all last week) but if I feel like this, there's no way I'm making the trip.  Thanks for your help, as always. CHJ ",
      "MessageIndex": 904,
      "PostDate": "28/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 29, 2008 06:56AM chj127 wrote: Hi all, I thought I'd check in.  Went to the onco yesterday for my 10-day check and bloodwork.  My white and red cell counts are in the toilet, and yes, I did have a bit of a fever.  They gave me a shot of Aranesp and an antibiotic.  And I'm signed up for Neulasta for the rest of my treatments.  Yesterday I truly felt like I had been hit by a truck!  I'm definitely better today - not 100% by a long shot, and weak from not eating.  I sucked down Gatorade all night, and am forcing myself to eat today. Thanks to everyone for the encouragement and words of advice.  It really helps that I have all of you to keep me company. Are we having fun yet? CHJ ",
      "MessageIndex": 932,
      "PostDate": "29/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 29, 2008 08:52AM chj127 wrote: You go get 'em, Kimberly!!",
      "MessageIndex": 936,
      "PostDate": "29/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 30, 2008 11:44AM chj127 wrote: vettegal - good to hear from you, and hope you rebound soon.  Bob Evans banana bread...mmmmmmm... it's THE reason I go to Bob Evans!  Hang in there!! CHJ ",
      "MessageIndex": 959,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 1, 2008 10:45AM chj127 wrote: Yes, PALady - you look good any way!  Thanks for sharing.  I personally think you look good bald, and wouldn't be shy if I were you, but you live in Erie and it is February, after all...  CHJ ",
      "MessageIndex": 1009,
      "PostDate": "01/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 3, 2008 01:31PM chj127 wrote: And so now to catch up - it's been busy in here today!! Paula - hang in there!  The few days after are the worst.   Sometimes I think we should just sleep through them... golfer/Carol - no, not wearing FUBC to church.  :)   Kathy - will wait for your pictures next! D1 - enjoy your daughter while she's there.  I understand, though, about not wanting company during the yucky time.  I just want to crawl into a hole!!  Maybe it will be a pick-me-up, though. Lots of us up-to-the-plate this week.  I am not necessarily looking forward to #2, but the sooner we get on with it, the sooner it will be over... Enjoy the Super Bowl, ladies!  Personally, I'm just in it for the commercials, and probably only until halftime, since it's back to work for me tomorrow. Later! CHJ ",
      "MessageIndex": 1048,
      "PostDate": "03/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 5, 2008 01:03PM chj127 wrote: Kathy - Go get 'em tomorrow!!  I'm like you - feeling really good today & the past few days.  Went to Chipotle for lunch & had the spicy stuff, while my taste buds are perked up.  I really have missed eating & enjoying things like that.  I too am ready to go for it again & get another tx under my belt. CHJ",
      "MessageIndex": 1087,
      "PostDate": "05/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 9, 2008 04:38AM chj127 wrote: Hi everyone, I feel like I've missed a lot in 2 days - I've been lurking, but no energy to post.  I have been sick as a dog - mostly diarrhea, but also stomach cramps, and having a hard time eating (note that this is from a stomach bug, unrelated to the chemo, except maybe by virtue of my wbc's being unable to deal with it effectively).  At least I haven't thrown up since Wednesday night. I have made it a priority to drink, though.  This is by far worse than my worst day from chemo!  I've been popping Imodium every 2 hours (per the doctor) and I think it's finally easing up.  It's crazy that my goal is to feel well enough to get chemo on Monday!!  I'll go from Imodium to Senokot, just like that.    I did manage to have a scrambled egg, a small glass of skim milk, and a small glass of juice this morning.  I'm hoping I can continue to take in small meals throughout the day & get stronger.  I'm still pretty weak. For the rest of you - stay away from sick people!!!  I'm hoping to join the living by the end of the weekend. CHJ ",
      "MessageIndex": 1181,
      "PostDate": "09/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 13, 2008 07:02PM chj127 wrote: D1 - funny about the grocery store incident.  I do worry about freaking people out with my new \"look\" sometimes.  I need to get over that.  Vettegal - I get all the chemo bags you mentioned, with the exception of the Pepcid.  I hadn't heard you could get that in a drip.  I have had some indigestion/heartburn problems yesterday & today (from chemo Monday) and the Pepcid tablet seem to relieve that. End of day #3, and still not feeling terrible.  Still waiting for the truck... CHJ ",
      "MessageIndex": 1294,
      "PostDate": "13/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 3, 2008 07:34PM chj127 wrote: Vettegal - I HAVE THAT HAT, TOO!!!  It's my favorite.  Love to wear it with the wild side out sometimes.  :)  Great picture!! CHJ ",
      "MessageIndex": 1667,
      "PostDate": "03/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 9, 2008 10:48AM chj127 wrote: Paula - that is SO very cool to have a wonderful event right in the middle of this \"bad time\" - what a pick-me-up!!  Thanks for sharing, it gives me goose bumps (not to mention making me teary!) CHJ ",
      "MessageIndex": 1768,
      "PostDate": "09/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 13, 2008 11:16AM chj127 wrote: Hi all, I'm 8 days past tx #3 and feeling pretty good!  Two weeks ahead of me before I get more chemo, the sun is shining, I don't have much to complain about.  It's a good day!! D1 - what an awesome picture!!  Paula, I love your pic also - I think you look great! Gee, it's a good looking bunch of women I hang out with here.  Dana - I am sorry you have to get so much grief with all you have going on, but I loved your \"WELL HELLO ITS DANA TIME\".  Sometimes you just have to stand up for YOU.  You are brave, and I admire that. Vettegal, I am so sorry to hear about your sister, but maybe, just maybe, hers will turn up benign.  My prayers are with you both.  Have a great day, everyone! CHJ ",
      "MessageIndex": 1858,
      "PostDate": "13/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 18, 2008 06:57PM chj127 wrote: Hi all, Like CarolC, I've also been guilty of being AWOL - lurking but not posting.  I'm 2 weeks past my 3rd tx, and frankly, it's been the easiest for me so far, se-wise.  But I've also been in the dumps, emotionally. I guess it's that I feel like I've been doing this for what seems like forever (dx'd in October, surgery in December) and knowing that I'm still only halfway through chemo which will go on through the first week of May, then radiation....  I've had my first real sobbing sessions.  We've had other stresses (trying to sell our house, if you can believe that - we put it on the market & bought another place right at the time fo my dx) and my dh has been totally stressed out.  I have been really low, and I feel like when people say, \"how are you?\" they don't really want to hear that I feel physically OK, but mentally I'm wrung out.  Some days I just feel like I'm barely hanging on.  I know I'll bounce back, but it's just one of those times, and we all get them.  And if all of that wasn't bad enough, I took my wig (which I've never been crazy about) to the wig shop to see if she could take some of the \"pouff-iness\" out of it.  She whacked away at it, and now I think it looks even worse than before.  I may go shopping later in the week for a new one, and I'm not crazy about dropping another $100-200 on a new one when I'm still doing the insurance gyrations trying to get the first one covered.  I only wear it to work 2 days a week, but I am really self-conscious wearing it.  I feel like I look like a dork!! On a good note, last night dh and I went out for pizza and we downed a pitcher of sangria.  It was the first time I'd had alcohol since I started chemo, and it tasted pretty darned good!!!  OK, so I'll stop whining now.  I appreciate everyone's stories and knowing what's going on with all of you.  This is a wonderful place to come and not feel alone, so thanks everyone for propping me up, even if you don't know you were doing it.  CHJ ",
      "MessageIndex": 1955,
      "PostDate": "18/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 19, 2008 07:27PM chj127 wrote: Sis Kimberly, I hope you get your energy back soon!  And thanks so much for your kind words.  You really do have a way of putting things in perspective!!  I'm doing a lot better today.  I guess we all need a little time occasionally to be guest of honor at our own little pity party.  I've been dealing with it all pretty well, generally, but everything sort of converged at once, and it just all seemed too much.  Thanks to everyone for \"listening\".  It helps a lot. Maz, I also add my prayers for your friend.  That's a tough thing to go through under normal circumstances, let alone when you are fighting your own battle. It seems that lots of us are having to deal with other crises during this time.  But somehow we do find the strength.  We are strong women, and I'm proud to be a Jewel.   I love that spring starts tomorrow.  I love that my daffodils and other flowers are starting to pop up.  Spring really is a time of hope!! CHJ ",
      "MessageIndex": 1976,
      "PostDate": "19/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 26, 2008 06:53AM chj127 wrote: Hi, all, Up early, my chemo is at 11:00.  Sheshe, I'll buy this round!!  I have a good friend from work taking a vacation day (this is her second trip) to take me to chemo.  She probably drives over 100 miles from her house to my house to the onc office and back again.  She's such a sweetheart.  I have so much to be thankful for. Carol, your pictures are great!!  Looks like a wonderful vacation, and it was a great time for you to be able to take a break like that.  Wow, how nice to be in sunny \"shorts\" weather.  Someday we'll get that here. Today it's supposed to be 60 and sunny - the nicest day all week.  And where will I be???  Hooked up to chemo bags in a small room with no windows.   This too shall pass, though, and when it starts to get really nice, I'll be done! I'm glad to hear that some of you are getting to enjoy food...  For the past 2 weeks, I have had an appetite that just won't quit.  Unfortunately what it wants is chocolate and junk food!!  I've gained about 6 pounds since the last chemo.  I guess that will ease up for the next week. Vettegal - I too am so sorry to hear about your sister, and I know that you will be a big help to her.   Maz, ditto for your friend.  It seems that it is harder to see others that we love go through this than to have to deal with it ourselves. I'll never catch up on everyone individually, but congrats to those who are done with chemo!  And for those starting rads, thanks for the info.  I won't start rads until around the first of June, so it's nice to know what I am in for.  I am going to start the process fairly early, because I want to make sure I can get on the schedule for a late-in-the-day appointment so it won't interfere with work so much (the radiation place is an hour from my office). Oh, well, let's not worry about that now, let's just get through the stinkin' chemo!!! Thanks to all of you once again for your posts.  Even though I don't post often, I'm in here a lot, and you all help me so much.  What a blessing this group is. Keep the faith, everyone! CHJ ",
      "MessageIndex": 2104,
      "PostDate": "26/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 22, 2008 10:50AM - edited Jan 22, 2008 10:54AM by chj127 Hi all you Jewels - is it too late to jump in?  I've been hanging out in the \"just Taxotare & Cytoxin\" thread, but realized that I have a lot in common with you all too.  I think (looking at dx) that vettegal & I are practically twins...  I started 6 rounds of TC on Jan. 18.  I still haven't figured out why I'm getting 6 rounds when it seems like everyone else gets 4, but oh, well.  Maybe because this is my second bout with bc (had it on the other side 13 years ago). I so appreciate all of your comments, because it makes me feel like I'm less crazy and less alone.  The constipation has been the worst part for me, I think.  I have the Senokot now, though, so things are starting to \"loosen up\" a bit. CHJ ",
      "MessageIndex": 700,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 22, 2008 12:00PM chj127 wrote: One thing I've learned after just one treatment - make sure you drink lots of fluids...  I've had problems with constipation (as some of the others have said) and I also got dehydrated.  You might not feel like ingesting a lot of fluids, but stock up and do it anyway! CHJ ",
      "MessageIndex": 703,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 23, 2008 03:48PM chj127 wrote: D1 - you have all my info right!  Way to go!!!  Periods?  I don't need no stinkin' periods (I'm 52 - for 4 more days - been in menopause for 3 years).   Sorry for those who do. D1 - way to milk the bc thing & get yourself a wheelchair.  My friend at work told me to milk it & get away with as much as I can.  I say, why not??  If we gotta suffer, we might as well take any bennies we can! CHJ ",
      "MessageIndex": 751,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 25, 2008 11:56AM - edited Jan 25, 2008 11:57AM by chj127 Kathy - you poor girl!!  If that's not adding insult to injury, I don't know what is.  I'll put you at the top of my prayer list for today.  Don't be afraid to demand what you need (seems like you are ok with that).  Get better quick!  The hospital is not as much fun as being at home in front of the computer spending time with us. I got my wig today, it's cute.  I ended up not tipping - it didn't seem necessary, plus the woman is the owner...  and she spent only about 3 minutes cutting off a little bit to make it the way I wanted it.  I think it will be OK, though it was weird still having my hair in there taking up space.  After just 15-20 minutes of having it on, playing with it myself, then getting it trimmed, my head already felt squeezed.  I can tell you right now, I'm not going to spend a lot of time in this thing!! For those doing the tx today, I hope by the time you read this you're doing AOK.  One more down!!  CHJ ",
      "MessageIndex": 820,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 25, 2008 04:16PM chj127 wrote: vettegal - is there a reason you want to cut your hair so soon?  It's probably good for almost 2 weeks... or are you just  taking charge & showing it who's boss?  My hair probably has another week.  I really need a haircut (normally, I would have had it done 2 weeks ago) but I'm too cheap to spend the money when it's coming out next week anyway!  I just figured I'd have plenty of time to be bald, no use rushing things. And for me, I'm on my 8th day and haven't had the metallic tast too much.  But as Cathy said, things don't necessarily taste the same.  That started after just a couple of days for me.  OK, I have another question: where do you get the Biotene? Is that an over-the-counter thing? Is it easy to find?  (Guess I should just go look!) Thanks again everyone for all your help, tips, and support.  I think there is more than one person who is tired of me saying, \"My online buddies tell me <fill in the blank>\".  CHJ ",
      "MessageIndex": 826,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 30, 2008 08:28AM chj127 wrote: D1 - I also appreciate your tx1 vs. tx2 info.  By the time we have the drill down pat, we'll be done.  My favorite bald story from the last time was when, in April, I was driving the Washington D.C. beltway home from work.  I still had my wig on, but it was a beautiful, sunny day, and I thought, this is nuts! and ripped it off right then and there, and then glanced to the left and saw the driver LOOKING at me.  It was a really funny moment, one of my favorite memories. CHJ ",
      "MessageIndex": 954,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 1, 2008 04:47PM chj127 wrote: Paula - do you get Benedryl in your drip?  Maybe that's just with the Taxotere - but I know there's no way I'd be driving myself home after chemo!!!  Good for you! CHJ ",
      "MessageIndex": 1019,
      "PostDate": "01/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 4, 2008 06:29AM chj127 wrote: Maz & KathyL - welcome to the club!!  A lot of hair has been falling in the last 2 days.  Maz, I know exactly what you mean about the stubble being sensitive, but mostly I like the way it feels when I'm home with a soft cap.  I got what they call a \"Lovie\" on the tlcdirect site, and it is wonderful to wear around the house.  I'm at work today with the wig, and people tell me it looks good, but I think they are just being nice. :)  Whatever, it's not terrible.  I thought that in an hour I'd be ready to rip it off, but I've had it on for 3 hours already and it's doing OK.  I did bring a hat with me, and I'm going to stop in the ladies room on my way out the door & make the switch.  With an hour+ commute, I'm not about to travel home with it on... Have a good day, everyone! CHJ",
      "MessageIndex": 1060,
      "PostDate": "04/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 4, 2008 07:32AM chj127 wrote: CarolC - sorry to hear about your lousy day!  I hope you feel better soon.  And welcome to the no-hair club... I'm getting TC, and there is no way I could have driven myself home after the first tx, but that was mostly from the Benedryl drip.  Did you not get that with the Taxotere the first time?  Or did you not get drowsy from it? I'll be doing the tx with you on the 7th.   Hope you have a few better days between now & then.  CHJ",
      "MessageIndex": 1062,
      "PostDate": "04/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 7, 2008 09:12AM chj127 wrote: Just a quick update - I talked to some of my work buddies, and 2 of the 3 women I had lunch with on Tuesday have the same stomach bug!  So at least I know where it came from.  I wonder if it was something in the food...  Whatever, it doesn't matter.  I still feel like crap! D1, you can change my next date from 2/7 to 2/11.  After that, I'm not sure.  3 weeks apart, but I may try to slide each one a bit more toward the end of the week. CHJ ",
      "MessageIndex": 1131,
      "PostDate": "07/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 12, 2008 08:29AM chj127 wrote: Wow, this is a chatty group these days! I went down this morning and joined the Neulasta club.  We'll see how I feel in a day or so.  Right now I feel OK and am supposed to be working from home, once I get it in gear.  I'm drinking like a fish, hope to ward off the dehydration problem I had after the last tx. I'm sorry to hear about those of you having skin problems. When I had chemo in 1995 & this time also, my skin is so clear & smooth. I thought it was the steroids (of course, I have the \"glow\" today from yesterday's tx).   KathyL - I hear you about the weather.  We had an inch or so of snow overnight, and we're supposed to get the wintry mix this afternoon & evening & possibly tomorrow (which is why I went for my shot early...).  I hate that stuff.  But I'll just be vegging at home.  It's a good time to stay warm in the house. Hope everyone has a good day today! CHJ ",
      "MessageIndex": 1258,
      "PostDate": "12/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 7, 2008 09:30AM chj127 wrote: Hi all, I'm 2 days past tx and starting to fog over...zzzzzzz.  Was OK yesterday, got the Neulasta, and even had Chinese food out last night, but I'll probably be under for the rest of the weekend.  I'm still hoping to get through one treatment cycle without any additional illnesses!!  It's going to be another dreary couple of days in the northeast, which always makes me sad, but I'll be pretty much homebound anyway, so I guess I'll just sleep through it!! The good news for me this time is that I think I have figured out the right dose of Senokot for me - the pooper is working a lot better this time!  The constipation in the first 2 rounds was unbearable.  Hi to Peg - you & I are on the same page, I just got #3, and have 3 more to go.  Nice to have someone on the longer jounrey with me (sorry you have to do it, though - bummer when you had other expectations!)  In the meantime, Peg, I just have to ask you if you ever go to the Meadows frozen custard place in Hagerstown.  It's a franchise from my original hometown (Hollidaysburg, PA).  Good stuff - especially the chocolate frozen custard!!  I recommend it highly.  We've been to the place in Hagerstown a couple of times but there are other outlets near here also. KathyL, I know what you mean about the support in this thread.  Everyone is so wonderful about sharing and not holding back.  It helps so much to know I'm not alone!!  Also, Kathy - I didn't bother about my b-day because it's past, but it's January 27.  Thanks for keeping up with everyone! Good luck to all of you going for treatment today.  Kick some butt! Later, CHJ ",
      "MessageIndex": 1731,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Apr 13, 2008 07:02PM chj127 wrote: Kathy - I'm not sure how I missed it, but my tx is on Wednesday, the 16th.  Thanks! CHJ ",
      "MessageIndex": 2383,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Oct 9, 2008 07:20AM chj127 wrote: Hey - I'm still mostly AWOL, but had to check in to tell Carol THANKS for the pictures!  What a great montage and a good looking bunch of women.  I'm honored to be part of it, even if I'm not so regular here anymore.  Life here is pretty good, and getting back to normal.  The hair is getting longer (maybe 1.5\"?) and I'm feeling a lot better.  Of course it's friggin' breast cancer awareness month, which always makes me crazy - especially since both of my dx's were in October.  I'm surrounded by pink reminders of it all.  But it also means I'm approaching the 1 year anniversary of my latest dx, and the 14 year anniversary of the first one.  We're all survivors, first and foremost!!  So hooray for us! CHJ",
      "MessageIndex": 3803,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Nov 1, 2008 02:59PM chj127 wrote: SisKimberly - love your story about the kids!  Yes - make them accountable... What grade do you teach again?  In answer to your question, the first time I had 4 rounds of AC, but no rads because I had a mastectomy with TRAM reconstruction.  Then I had 5 years of Tamoxifin.  I turned 40 the week after I lost all of my hair doing chemo.  I also lost my periods for about 6 months, then got them back and stayed regular for almost 10 years untilI went into menopause in 2004. And thanks for asking, the new house is great! We love it here, and we have great neighbors.  All 4 of our cats have settled in.  We have a lot more sun coming through the windows than we had in or previous house, and they love it. It's beautiful here today in the sunny northeast - upper 60's which is fabulous for November 1.  We're headed out for a walk.  Have a great weekend, everyone! CHJ",
      "MessageIndex": 3895,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 5, 2009 03:16PM chj127 wrote: Carol - you can always root for the BALTIMORE RAVENS!!   CHJ",
      "MessageIndex": 4165,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 5, 2009 07:15PM chj127 wrote: Yeah, Patty, if the Steelers and Ravens both win this weekend, we'll have a bit of a competition on our hands...  I have to admit that when I lived in PA (Altoona) I was a Steeler fan, but that was back in the Terry Bradshaw/Franco Harris era (a loooooong time ago!) Tina, I have to say that Joey is adorable!! Is he purebred?  I never saw one with the coloring he has. I always think I'll keep up with you all, and then it never happens (sorry!)  But I do peek in here fairly often.  Anyway, I wish you all a happy and healthy New Year! CHJ",
      "MessageIndex": 4169,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 8, 2009 08:13AM - edited Jan 8, 2009 08:48AM by chj127 Hi again! I guess I go in spurts here... Carol/Tina - I did get a bone density scan going in for a baseline, and assume I'll get them regularly for the Arimidex.  I also have a lot of osteoporosis on my Mom's side of the family. The onc has me on Oscal+D.  I'm wondering what my new onc will say - I see her next Friday and I'm hoping I like her as much as I think, based on what people have told me.  I mentioned a while back that my old onc called me to find out why I was switching (a VERY uncomfortable conversation!!!).  So there would be no going back, not that I'd want to.  Well, yesterday I got a letter from my insurance company saying that my he is no longer in my health plan, and that I'd need to get a new doctor!  I don't know what's with that, but I'm sooooo happy I already had a plan. D1 - I think I need to apologize to you, I didn't mean my \"I had no issues with Tamox\" to be so flippant.  As with all BC issues, everyone is different, and I remember my onc back in the 1990's saying that I tolerated it well (and the insinuation seemed to be that a lot of women didn't).  I hope that you find a balance soon!! That's all for now, lots to do today! CHJ",
      "MessageIndex": 4188,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "May 24, 2008 07:27AM chj127 wrote: Hi everyone, Long time no see!  So, since I posted last, we sold our house (finally!) and moved into our new place.  I am exhausted (17 days past my last chemo), but it's all good.  We are going to try hard not to do too much work for the rest of the long weekend. The weather finally went from mostly cool and rainy to warmer and sunny.  Wow, it's beautiful now!  Our new house has lots of windows and is so bright and cheerful. So in the midst of getting moved in and unpacked, I went for my rads simulation and I start rads next Wednesday.  I'm all marked up, and have to keep it from getting washed off.  Which means I can't go into the hot tub or pool at our new digs until after mid-July.    Whatever, at least we're moving forward.  I also took my first Arimidex pill yesterday. I can't even hope to catch up with all of the posts since I was here last, but 2 quick things: Paula, we'll keep you and your hubby in prayer.  Sorry to hear about his last bout. SISKimberly, it's awesome you are going to Sedona.  When I was past all my treatments with my first bc back in 1995, dh and I went to Santa Fe. There's just something about the southwest that is so therapeutic! I'll try not to be a stranger.  CHJ ",
      "MessageIndex": 2895,
      "PostDate": "24/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jul 11, 2008 10:00AM chj127 wrote: D1, I'd like to comment also (love Kathy's name, \"Dr. Loser\"!)  This is my second trip through bc, and I've seen it handled different ways.  My first time, I saw the surgeon once or twice after the surgery and never again.  He was a good surgeon, but no bedside manner, and I really didn't like him much.  I was followed by my onc, who I LOVED, for about 8 years. She ordered everything and made sure I was OK (mammograms, bloodwork, all of it). This time, my surgeon seems to want to be the \"director\", and it's OK with me, because I trust him a lot.  This is the guy who returned an email on Christmas Day because I sent him one when I was starting to get anxious after my surgery. The surgeon is ordering the followup mammograms and MRI's.  (D1, they found my tumor on a mammogram, and even when they showed it to me, I couldn't feel it, so I'll never poo-poo the mammogram!)  My oncologist is also following me, and will do bloodwork, etc.  The onc & surgeon work closely together, and share all the info, which helps.   So D1, if your onc. will do the followup, I don't see why you'd even have to bother with the surgeon now. Something new and exciting happened to me today - I woke up with \"bed hair\".  I slept a long time last night, and when I looked in the mirror this morning, I realized I now have enough hair for it to stick up funny on the top/side.  A little water and that's fixed, but at least I have enough hair to do it. Only 4 more rads to go... CHJ ",
      "MessageIndex": 3365,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 23, 2008 11:16AM chj127 wrote: Hi again ladies, I'm sitting here working (at least I'm trying to work!) and listening to music, and this song came on.  The artist is Sara Groves, and even though I've heard it many times before, the words really hit me today. It's called, \"It Might Be Hope\".  (the \"it's hard to recall\" part is not applicable, but work with me here. ) \"You do your work the best that you can you put one foot in front of the other life comes in waves and makes its demands you hold on as well as you're able You've been here for a long long time Hope has a way of turning its face to you just when you least expect it you walk in a room you look out a window and something there leaves you breathless you say to yourself it's been a while since I felt this but it feels like it might be hope It's hard to recall what blew out the flame it's been dark since you can remember you talk it all through to find it a name as days go on by without number You've been here for a long long time Hope has a way of turning its face to you...\" I love thinking about hope at the end!! CHJ  ",
      "MessageIndex": 740,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 24, 2008 11:13AM chj127 wrote: What's the deal with the t-shirts again?  I think someone mentioned it a couple of days ago, but I let it go by me. Thanks! CHJ",
      "MessageIndex": 780,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 25, 2008 05:01AM chj127 wrote: Go get 'em, vettegal, PALady, wvgirl, jkiss, deb, and anyone else kicking cancer butt today!  I wish you well.  You'll do great! OK, I have 2 questions: 1.  When you got your wig, did you tip the person who fit it for you?  So this is not a big important question, but I was just wondering.  I probably will because I know she will be cutting it at least a bit. 2.  I don't have Pepcid - are you using this in addition to meds (Compazine, Zofran, whatever) or instead of?  With the Compazine, I felt OK except for the constipation.  After a week, my intestinal tract is still not where it should be... 3.  My port has been in for 8 days, and my chest muscles still bother me.  Has anyone else had this problem?  If not for the port, I would be feeling pretty darn good right now. I'm having lunch out with a friend for the first time in a week, and really looking forward to it!  golfer Carol - I pm'd you - since Joan needs the XL, the large t-shirt will be fine!  I'll wear it proudly!! Later! CHJ ",
      "MessageIndex": 809,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 3, 2008 08:26AM chj127 wrote: PALady - glad to hear you are feeling better!  Pirate?  Get yourself a boat & head out on Lake Erie.  vettegal - I'm on TC (Taxotere/Cytoxin) and on day 14-15 my hair started to get loose (I'm counting chemo day as day 1, right?)  Day 16 it was everywhere, and today (day 17) we shaved it!!  Well, we took a beard trimmer to it.  I have more stubble than I thought I would have.  I had pulled out so much, and my hair felt so thin!  But my hair never really \"hurt\" - it did feel a bit tingly, but not hurt-y.  A friend told me hers hurt so much she couldn't sleep on one side, but I didn't have that experience. I'll take pictures & post later.  Gonna put on my hat & go to Wal-Mart! CHJ ",
      "MessageIndex": 1038,
      "PostDate": "03/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Oct 12, 2008 06:38PM chj127 wrote: Hi all, again, Thought I'd show off my new non-curls, from a recent get-away.  My local chemo-buddy has the most awesome curls, but I got nuthin' except more gray.  Oh, well, it's only hair!  I'll be doing the local Race for the Cure next Sunday, which just happens to be the 1-year anniversary of the mammogram.    ",
      "MessageIndex": 3817,
      "PostDate": "12/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 3, 2008 01:23PM - edited Feb 3, 2008 01:39PM by chj127 Hi again everyone, OK, here are my pictures.  Now how do I get Photobucket to stop sending me text messages???  Before shaving:   After the shave (still have stubble!)  The wig (will take some getting used to!)  Murphy is always asking for attention, so we let her be in the pictures! CHJ ",
      "MessageIndex": 1047,
      "PostDate": "03/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Oct 17, 2008 02:51PM chj127 wrote: LOL, LJ!!  I know what you mean about the early hour and the traffic. It's 45 minutes to get there from where I live, too.   I didn't go last year, but heard it was a nightmare.  Supposedly they worked out some of the \"kinks\" as far as the logistics.  Guess we'll see.  I heard 33,000 were expected. Yes, look for me - I'll have the pink shirt and the short hair.  Shouldn't be hard to find!!  CHJ",
      "MessageIndex": 3842,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Nov 2, 2008 09:31AM chj127 wrote: SisKimberly - just a quick check-in - no, once you have a TRAM, you can't do it again.  I was pretty freaked out at my first dx, and considered having both breasts removed & TRAM-ming them both at once, but didn't (ah, hindsight!)  Last year, you would have thought that I'd just go ahead and have the other breast lopped off and not have to ever have a mammogram again, but I went the light route with the lumpectomy. I didn't want to think about reconstruction again. Time will tell about whether that was a good decision or not. In the meantime, my TRAM from 1994 was awesome.  I had it done at the same time as my mastectomy.  It was a really tough surgery (7 hours) with a lot of recuperation  time, but I have never regretted it for a second.  Now, everyone who sees it (and lots of doctors and nurses have seen it!) marvels at what a good job it was.  Those comments make me wonder at how many not-so-good ones there are out there. I guess it just depends on the skill of the plastic surgeon.  Through circumstances at the time, I had a guy who was not the best known ps in the area, but the \"good\" ps didn't take my insurance.  But my ps just did a superb job.  The nice thing about the TRAM is that it's all connected, and when I gain or lose those pesky 20 pounds (and I have done that multiple times over the years), my reconstructed boob alsogains and loses along with the rest of me.  I talked to a guy this time about SGAP, and he said that wasn't the case with SGAP.  Whatever, I don't know so much about the newer techniques.  Anyway, SisKimberly, if your sis decides to go that route, make sure she sees pictures of the ps's work, and if possible, have her talk to other patients who have been through it with the same doc.  I've done show-and-tell with other women lots of times.  :)  Julie - wherever do you get the cool graphics?  You find the best ones!! Later! CHJ",
      "MessageIndex": 3899,
      "PostDate": "02/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Nov 10, 2008 07:02PM chj127 wrote: I agree with Deb - B WON is cool.  LJ - I like yours too!!",
      "MessageIndex": 3934,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 10, 2008 04:52PM chj127 wrote: Hi everyone! Wow, lots of activity on here today.  I've been lurking in & out, but mostly vegging out today.  My dh & I watched a couple of movies and didn't do a whole lot else.  I've been eating as much as I can & drinking like a fish.  I am SO hoping my blood counts are up when I go for chemo tomorrow.  I think I look a bit pale, but mostly I'm feeling OK, just a bit tired & weak from the stomach thing last week.  Wish me luck.  I really want to get tx 2 done tomorrow!! Vettegal - sorry your shaving party was so traumatic.  I'll look forward to the pictures. D1 - HAPPY BIRTHDAY!!  I'll have a TC cocktail in your honor tomorrow, Lord willin'!! KathyL - I'm kinda with you on the cruise thing.  My dh & I have been promising ourselves a nice vacation \"some day\" for a couple of years, and we never seem to get around to it (for a variety of reasons I won't get into here).  If I went off on a cruise without him, he'd be crushed.  Maybe a weekend getaway or something I could \"get away\" with, but never a cruise...  We'll see.  I'll be in chemo until at least May, and in rads for the better part of the rest of the summer.  It seems like such a long haul right now. Everyone else - it sounds like we all have our ups and downs and challenges.  So many different issues, so many different situations, but if I have to go through this whole thing, I'm glad to have you all on the ride with me.  Hang tough, have courage!   Be well everyone! CHJ ",
      "MessageIndex": 1218,
      "PostDate": "10/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 11, 2008 01:27PM chj127 wrote: Well, yes, I made it through chemo uneventfully.  My counts were just fine, and I did wear my shirt.  Excuse the refuge/lumberjack getup - it was COLD here today, so I overdressed (long johns, flannels).  I feel fine NOW.  I'll go back for my first experience with Neulasta tomorrow.  Thanks all for the well wishes!  CHJ ",
      "MessageIndex": 1238,
      "PostDate": "11/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Nov 27, 2008 08:50AM chj127 wrote:  Paula - prayers for you and DH, that your travels will be safe and that treatment for your hubby will bring healing. SisKimberly - hope your port came out OK.  It was such a relief when I got mine out - kind of like the end of a chapter! Carol - enjoy your time away!  And I hope all of you have a blessed Thanksgiving.  We have so much to be thankful for!  When I think about where I was last year at this time (like most of you) and where I am now, I am beyond thankful.  And I'm grateful that I have had all of you to lean on for the past year! CHJ",
      "MessageIndex": 3989,
      "PostDate": "27/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Dec 21, 2008 11:18AM chj127 wrote: Quick reply D1 - that's the advantage to living in a little one-horse town.  I went to the P.O. on Friday to mail one last package, and there was no one else in there!!    Sorry to rub it in... And you are right - dh and I keep reminding ourselves what it was like at this time last year.  We were totally stressed out, I was recovering from surgery and dreading chemo, we were trying (unsuccessfully at that point) to sell our house.  We didn't put up our tree, and did very little decorating.  It was a very low time for us.  It's just so much nicer this year!   CHJ",
      "MessageIndex": 4083,
      "PostDate": "21/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 9, 2009 08:36AM chj127 wrote: D1 - when you are watching the inaugural parade, watch for the University of Tennesee band - my nephew is in it (playing the tuba)!!  Frankly I don't think I'd want to go near D.C. that day, for all the crowds.  It should be an amazing day, though. Sounds like you have a pretty good plan of action! Maz - prayers to you.  We all want it to be \"over\", and yet it's not because of additional fears and tests, etc.  We'll hope for the best possible outcome for you. My neighbor had chemo for lung cancer that ended in mid-November and now she's losing her hair, having weight-gain problems, and getting tingling and numbness in her hands and feet.  The docs didn't tell her that could happen and she's pretty freaked out about it.  I can't even imagine. TGIF - have a great day and weekend, everyone!!  CHJ",
      "MessageIndex": 4199,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 13, 2009 07:58PM chj127 wrote: Hi all!  Yes, this is a busy bunch.  I swear I'll keep up, but it's so hard... :) Julie - according to the TV, you should be pretty darned cold where you are.  It's coming this way also.  For everyone's sake here (esp. D1) I hope it warms up for innauguration day!! D1 - is that good news about the sonogram?  Good that there are \"no growths\" but not knowing what the heck is going on is frustrating. Yay for Cathy & last herceptin.  LJ, you're almost at the finish line!  Sometimes I forget it's not \"over\" for everyone & chemo. And yay for Joan & good checkup! Paula - I hope everything goes well for you and dh tomorrow.  We'll be with you in spirit.  Funny you should mention the lorazepam - I've been having a hard time sleeping lately, my brain is going on overtime about silly stuff, so I popped one the other night.  I was in ZZZZZZZZZ-land! Vettegal - funny about Steelers vs. Eagles.  Someone here said something about wouldn't it be funny if it were an \"all-Pennsylvania\" Super Bowl.  I said, when you're talking about the Steelers and the Eagles, those are 2 different states!!  HAHA.   I hope the Steelers don't make it that far. Have a good rest of the week, everyone! CHJ ",
      "MessageIndex": 4251,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 21, 2008 04:15PM chj127 wrote: Hi Paula (and everyone), Thanks for asking. I've been fighting the chest cold all week.  Between that and the cold, yucky weather, I've been down in the dumps.  I think if I didn't have the cold, I wouldn't be experiencing any se's at all, but can't enjoy that.  Went to the onco for my 10-day check and all of my counts were good.  But I had to wait an hour and 15 minutes to see the onco for about 3 minutes!!  I am thinking seriously about changing onco's, I just don't gel with this guy, I feel like he's patronizing, the office is always full and claustrophobic, and it's so depressing.  The nurses are awesome, so that's what is keeping me there for now.  But I can't imagine keeping with this doc through treatment and beyond. <<<whine>>>  Sorry!  I'm just depressed these days!  But I have been keeping up with posts.  Thanks to everyone who is being positive lately, it helps me, really it does! CHJ ",
      "MessageIndex": 1474,
      "PostDate": "21/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 16, 2009 07:54AM chj127 wrote: Good morning all! Yes it's cold here (6 degrees outside my window).  And Carol - OMG, the story about that airplane in the Hudson, what a miracle!  It muct have been terrifying.  They are doing a lot of the stories on the Today show this morning.  I can't imagine being in that water even for a split second. Cathy/Kathy, ditto with you on the doctors.  Enough already!!  I honestly don't get why I need to go back to the rads doctor at all.  The onc will monitor the bloodwork and the effects of the Arimidex, etc. and my surgeon is the one who directs followup mammograms & MRIs.  So what do I need with the rads doctor anyway?  I saw him a month after rads were over, and he had me make a 6-month appt which is in Feb. I'm thinking of cancelling it, because I don't see the point. In the meantime, I'm going to see my new onc today.  I have high hopes for a better connection with her than the other guy.  We'll see! Vegas?  I don't need to be busy at every minute.  I just want lots of \"chat\" time, maybe 15 minutes at a winning slot machine (who's in charge of that?? ) and a chance to see the sights around town.  Maybe one show or something.  The last time I was in Vegas it was 1987, and I KNOW it'stotally different since then. How many of you are bringing partners?  I usually like to travel with dh, but I think he would be bored, so I'm just wondering what everyone else is thinking. Stay warm, everyone! CHJ",
      "MessageIndex": 4270,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 19, 2009 08:58AM chj127 wrote: Yeah, it's a very sad day in Baltimore today.  There was a glimmer of hope there for a while, but it didn't last long.  We have the satisfaction of getting farther in the playoffs than anyone expected, but them's the breaks!  Congrats, Patty!  I don't know if I'll even watch the super bowl, but I imagine I'll have to root for Pittsburgh.    The Eagles/Cardinals game was really exciting to watch, too. OK, I hear you all about bringing/not bringing the dh.  I know what you mean, trying to make sure he's being paid attention to, all the while getting done what we're there to do (join with the Jewels!)  I'm thinking that it will be better to some solo also. He would absolutely hate the heat anyway, and isn't one to go off and entertain himself. D1 - I hope your inaugural plans go well.  It's really wild, watching the plans on TV.  The main thing is that you have a plan in case you need to \"go\". (HAHA!)  We're laughing about the reports of them having 1 potty for every 6000 people.  That alone would keep me from going downtown that day! I hope you have a great time.  We'll be looking forward to the reports. So, I met with my new onc on Friday.  Yes!  I like her!  Since she considered me a \"new patient\" even though I had all my records there.  She spent more than an hour with me going over every little thing.  Awesome, compared to my first onc.  Actually, she reminded me of the onc that I had back in 1994-1995 who was the best ever.  I asked her about having the ooph, which is what my surgeon suggested instead of bothering with genetic testing.  New onc. says if I come up negative for the genes, then my chance of ovarian cancer (my biggest fear) are really not much different than the general population.  If I come up positive, then I'd want to consider not only the ooph but also having a prophylactic mast.  Geez, so much to think about.  She was very thoughtful though, just discussing options, not pressing.  I feel very comfortable with her. Lots to get done today, so I'll say bye.  Have a great week, y'all.  If you have a holiday today, enjoy!!  CHJ",
      "MessageIndex": 4292,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 29, 2009 07:31PM chj127 wrote: What D1 said.  I love the bracelet, that was so thoughtful Carol & Norma!!  Paula, my heart goes out to you as well.  That's a lot to endure for you.  {{{hugs}}}  Life is so precious and we just don't realize it sometimes until we are faced with pain - physical or emotional.  We are here for you. CHJ",
      "MessageIndex": 4386,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 2, 2008 10:59AM chj127 wrote: Hi all, Just a note about the FSA's - I have been using this for many years.  I am pretty sure I didn't put enough in for this year, though (drat!)  Don't forget, if you have an FSA, you can submit mileage for medical purposes also. I forget how many cents per mile, but for those of us going to the doctor  practically every week, and especially for those daily rads, the mileage can add up in a hurry!! Wednesday is my tx day, and I am feeling really good lately.  I'm enjoying it while it lasts!!  I've been eating like there's no tomorrow, so hopefully the 3 pounds I've put on in the past week will come off next week.  That's how it seems to be working for me. And the sun is shining, and it's supposed to be 60 degrees in Maryland tomorrow!  Come on, spring!! Have a good week, everyone, and if it's your tx week, go kick some BC butt!! CHJ ",
      "MessageIndex": 1639,
      "PostDate": "02/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 29, 2008 10:03AM chj127 wrote: Tinalee - YES - absolutely call Visa and tell them about the late fee.  I made an honest mistake once - mailed the payment without the address showing through, and so it was late.  I called them and they took off the late charge without any question at all.  It was pretty easy.  If you have a long term, good record, I'll bet they will waive it. Fitful sleep last night - I'm deep in the fog, so that's all I have for now.  Hope the rest of you have a good weekend. CHJ ",
      "MessageIndex": 2168,
      "PostDate": "29/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 28, 2009 10:20AM chj127 wrote: Hey!  We've got the ice here, too.  I'm supposed to be working from home, so I'll keep this short!  I'm on FB also, but don't think it's necessarily a good thing to get details of the trip mixed up in there!  And I'm with D1 - maybe we should get an email chain going so that we don't broadcast our details to the world, if you know what I mean!!  I'm not much of a trip planner, and I don't know anything about LV so I'm letting the \"experts\" do it - it sounds like some you know a lot about this sort of thing, and I'm grateful!  I love to walk, and normally that would be no obstacle, but won't it be like 110 in the shade in July?  Yes, it's a \"dry heat\", but it might make us not want to walk quite as much.  Just a thought.  I also understand that there are shuttle busses up and down the strip pretty much all the time, so I'm thinking it won't matter anyway. I can't keep up with everyone's activity, but just want to send hugs and prayers out to Paula.  We're with you, girlfriend! Gotta go - CHJ",
      "MessageIndex": 4365,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 23, 2008 04:18AM chj127 wrote: And for RN2teach - Yes, my faith helps a bunch.  I love your Philippians 4:4-7 reference, that needs to be our daily reminder.  At our church they are doing a sermon series on Philippians, and the first one (5 days prior to me starting chemo) was about being joyful in our circumstances!!  I need work there sometimes. CHJ ",
      "MessageIndex": 727,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 23, 2008 05:53AM chj127 wrote: Note to KathyL - I was rereading some of the posts (it's hard to keep up!  This is an active group!) and saw your questions.  My treatments will be 3 weeks apart.  First one was 1/18 (Friday) but in the future they are bumping me back to Thursdays just in case I need Neulasta shots which I could get on Fridays if I needed them (hope I don't...) So my next treatment is scheduled for 2/7, then if I stay on schedule, 2/28, 3/20, 4/10, and 5/1.  I will get rads afterwards (33 so I've been told). I do have a port which I'm already in love with after the first time.    I shot a PM to LJ13 (LJ?  are you there?) because my treatment is in Towson right outside of Baltimore.  I'm in Carroll County which is northwest of there.   Thanks! CHJ ",
      "MessageIndex": 731,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 26, 2008 04:10AM chj127 wrote: Hi vettegal - glad you made it through OK!! I have heard your poem (which I love) like this:     Yesterday is history     Tomorrow is a mystery     Today is a gift -     That's why they call it the present! Thanks for the tip on headcovers.com - I hadn't seen that one before. Take care of yourself for the next few days especially.  Watch out for those se's, especially the dizziness (the one that caught me off guard).  I'm sure you'll come through with flying colors!! CHJ ",
      "MessageIndex": 841,
      "PostDate": "26/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 27, 2008 05:31AM chj127 wrote: Good morning, all!  I just wanted to make a quick comment about what vettegal said about periods.  The first time I had bc (dx in 1994) I was 39.  I had 4 rounds of AC, then 5 years of tamoxifin.  In the late part of chemo, I lost my period for about 6 months, but then it came back, pretty regular until I went into menopause in late 2004.  Everyone's experience is different, of course, but I just wanted you to know it isn't a lost cause!!  Actually I was kinda hoping that my period would just stop altogether (we didn't want kids anyway) but it didn't, and in reality, it's better that way for my overall health. Dana - that's so ridiculous about your health insurance!  They are all about getting the money and paying out as little as possible.  Will keep you in prayer about that.  Hang in there, girl.  Hope everyone who had tx this week is feeling decent. CHJ ",
      "MessageIndex": 879,
      "PostDate": "27/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 29, 2008 07:56AM - edited Jan 29, 2008 09:54AM by chj127 LJ - thanks for THAT!!  Maybe it will be the \"Baltimore factor\" - no Neulasta SE's for those if us getting treated in the Balto area.  OK??  Maybe you need to get Ensure or one of those high-calorie things.  My weight has bounced around a bit - I lost 10 pounds right after my dx from the stress, and I've been up & down a few pounds since then.  Hang in there! CHJ ",
      "MessageIndex": 934,
      "PostDate": "29/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 31, 2008 08:27AM chj127 wrote: Hi all, I made it back to work today, finally!  I'm feeling so much better than I did on Monday - guess my counts are coming back.  It's weird to say I'm happy to be back to work, but I definitely am.  And we're going out to lunch, not that I care about food.  I'm like you, Kris - it all sits like a rock in my stomach.  I've never in my life had to think about forcing myself to eat. LJ - you'll likely be able to do desk work within just a few days.  If you are having a bunch of nodes removed, that will be sore for a while, but you should be OK.  After surgery, you'll definitely feel tired for at least a few days while your body repairs itself.  Surgery is not terrible - the anesthesia makes it all a blur, and the drugs after keep the pain at bay. Kris - welcome to the madness!  If you have to go through bc, you've found the right place to hang out. It will be 2 weeks tomorrow since my first tx and my hair is starting to get loose!  A run of my fingers through it definitely pulls a bunch out.  I'll see how it goes, but I imagine we'll have a coming-out party & shave by Saturday (or Friday if it gets too bad).  Such is life.  The wig and hats are on standby!! Have a good day, everyone! CHJ",
      "MessageIndex": 983,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 1, 2008 11:52AM - edited Feb 1, 2008 11:52AM by chj127 Hey golfer Carol!  I saw Kathy's post, and even though it's pouring rain, I ran out to the mailbox & got mine too!!  How cute!  I wasn't in on it when you were first talking about them, and assumed they were regular t-shirt-type t-shirts, and wondered when someone said they would wear it to tx.  How would they get to my port?  But with the scoop neck, it will be perfect, so you obviously thought of that. OK, so here's my dilemma.  I have a reputation as a nice Christian girl, so how am I going to explain the FUBC?  (LOL)  Can we come up with a \"clean translation\"?  (LOL some more!)  Help me out, ladies!?!  The back is great.  I'm proud to be a Jewel!! 2 weeks after treatment, and 4 days past my really bad low-count day, I'm feeling pretty chipper today.  It's supposed to be a great weekend here (great Maryland - 50's and sunny) so I'll really be able to enjoy it.  I'm hoping to postpone my shaving party until Sunday... Be well, everyone! CHJ ",
      "MessageIndex": 1013,
      "PostDate": "01/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 17, 2008 11:08AM chj127 wrote: Hey all, LJ - I feel like I'm down your same path.  I started getting the chest cold thing on Thursday, and still can't shake it.  I was up half the night last night practicing my cough.  Yesterday I felt like crap.  My chest hurts, my gut hurts (between the coughing and the constipation) and I just have no energy.  A friend called to see how I was doing and I broke down on the phone.  I just want to have more than 2 good days in a row!!  But yes, my temp was going up and down as well.  It seems like after I've been snug under the covers for a while it goes up, and then if I get up & walk around it goes down.  It's been bouncing between the mid-99's and 101 for the past 2 days, and I finally called the doc yesterday & he called in an antibiotic today.  The temp seems to be easing now, and the coughing has subsided a bit.  I don't know if that will change overnight, but I sure hope not.  There is just so much stuff going around these days, and it's like my immune system has issued an open invitation to any and all illnesses that are out there!!!   And I have totally lost my appetite.  Never in my life have I had to force myself to eat.  One thing I have found fascinating is that I'm a salt-oholic - I salt everything, not good for me, I know, but I've never had blood pressure problems - and I have lost my taste for salt I can't stand the thought of putting it on anything.  Maybe this is a good, long term change. Well, at least I have 2 more weeks until the next tx - hopefully I can squeeze out a few good days in all that time.  Thanks for letting me rant.  I know everyone is going through some kind of stuff!  Hang in there.  It helps me to hear about what everyone is dealing with, and those of you having good days give me hope... CHJ ",
      "MessageIndex": 1382,
      "PostDate": "17/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 23, 2008 01:54PM chj127 wrote: Hi everyone, Paula, I SO feel for you with the coughing.  I've been fighting the cold for more than a week, and am finally starting to feel human.  My dh has the cold too, and he's miserable as well.  Add in the crappy weather, and we're just so down!!  I cannot wait for the sun to come out (maybe tomorrrow??)  We are going to church tonight for the first time in 3 weeks. I really miss being there.  But I did go to the grocery store this afternoon, it felt so good just to be out anywhere!!  I'm hoping to be back in the office on a normal schedule this week (just 3 days, don't feel too sorry for me!) Thanks also for everyone's support about the onco.  The thing is, he's a nice enough guy, but I'm just not getting the answers and support I need from him.  I talked to the breast coordinator at the center where I am going, and they are going to try to get me in with the woman onco I was supposed to be with in the first place.  I had an appointment with her the first of January, and she was in an auto accident, which is how I ended up with the other guy.  Well, the woman onco is supposed to be healed up & coming back in March.  So I'm hoping it's sooner than later.  I'll do my March 5th chemo where I've been going then hopefully switch after that. For those of you feeling good this weekend, enjoy it!!  For those not having such a great weekend, fluff up your pillows and rest.  I really appreciate all of you! CHJ ",
      "MessageIndex": 1505,
      "PostDate": "23/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 27, 2008 09:58AM chj127 wrote: Hi all, Carol, I think I might have been tempted to play the cancer card on that ticket.   That would have been the perfect time to rip off the hat and/or wig and give the sad face...  I say that, but don't know if I'd have the nerve. That said, I was at a visitation the other night at our church.  There was a tragic death (car accident) of a 39-year old father of 6.  He was a prominent figure in our church & the community, and everyone loved him.  The line stretched forever - the wait was probably close to 2 hours.  Because dh & I both didn't feel good (both fighting colds), after we waited for about 30 minutes & realized how long it would be, we decided not to stay and went home.  But when we first got there, someone I knew saw me in my hat, and said she would take us out of the line & bump us to the front.  I couldn't do it.  I didn't feel good because of my cold, not because I was weak from chemo... Best of luck to everyone getting treatment this week!  CHJ",
      "MessageIndex": 1563,
      "PostDate": "27/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 7, 2008 01:10PM chj127 wrote: Hi all, One quick thing - I think it was on this thread someone was talking about bandanas and such.  The regular sized ones are too small for full coverage, and the 35\" ones (ala headcovers.com) are too big.  I found www.bandanaworld.com that has 27\" bandanas (\"oversized\").  I ordered a few, the standard paisley ones and they have solids also.  They came in less than a week, and were only $3.00 + $5.75 for shipping.  They seem like a really good size and will be cool for spring. Thought I'd pass that on!  Back to the sofa, it's one of those foggy days... CHJ ",
      "MessageIndex": 1733,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Mar 7, 2008 06:31PM - edited Mar 7, 2008 06:43PM by chj127 Carol - when I pasted a picture into the little box where I type, I have been able to just grab the corner of the picture and resize it.  It's weird because you have to move around a bit when it's a big picture, but it has worked for me.  I have even gone in and edited after I posted to adjust the size. CHJ ",
      "MessageIndex": 1740,
      "PostDate": "07/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jul 6, 2008 04:25PM chj127 wrote: Hi all, So here I am, back from who-knows-where... (sorry!)  I got a nice postcard from SISKimberly so I thought I better check back in with all you guys! I've been hanging out in the rads thread some, but mostly I'm just trying to enjoy the summer and not think about bc so much.  I have 8 more rads to go (out of 35) and 7 of those are boosts.  I think I have hated rads more than chemo in some ways.  I just have a mental block about it - the going every day and getting naked, the the hanging out in the waiting room with mostly old men with my little robe on, the itching and chafing, having to dress so it won't interfere with my boob or treatments, etc.  I am marked up for the boosts, and have to re-trace the Sharpie marks about 4-5 times a day because I keep sweating them off.  I have used the trick someone else mentioned in the boards of lining my sports bra with pantiliners to keep the marks off of my clothes.  I just hate rads altogether and can't be done with it soon enough.  I got held up the other day when they were having equipment problems.  My appt was at 3:45 and they didn't take me in until 5:15.  I was supposed to meet someone at 4:15 and that got all screwed up and I just got madder and madder (totally out of proportion to the situation) and kept saying to myself, I'm just so sick of cancer screwing up my life!!  But yes, it's almost over. And so is my rant for right now. We moved into our new house about 6 weeks ago and we are enjoying it immensely!  We've met lots of the neighbors, and partied with a bunch of them on the 4th. We have a great community pool, but of course I can't go in because it will mess up my boost marks (whoops, my rant was supposed to be over...) My hair is coming in slowly, and I ditched the wig a couple of weeks ago (I only wore it at work anyway).  My new neighbors don't know me any other way except bald or with just a bit of hair, so that's fun. My eyelashes keep falling out, and I don't have any long ones left.  I lost the last few just this week.  Not sure what's up with that, since I finished chemo almost 2 months ago.  Whatever.  All I want is to get my energy back! Hope you all are doing well. CHJ ",
      "MessageIndex": 3329,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jul 16, 2008 04:31AM chj127 wrote: Carol - thanks for the shout out!  Yes, today is the last day for rads, and then I have 3 whole weeks until I set foot into a medical facility again - to get my port out.  It's been a wild ride.  I know I'll still hate going into the rads place, even though it's my last day.  Thanks also for the card (I sent you a PM, hope you got it!) Now I have to work on getting back into the swing of exercising (need more energy, though) and I need to work on losing a few pounds that have crept on since chemo.  I need to define the new \"normal\", whatever that is.  But most of all, I will relax and be glad the worst of it is over. I know I've been hit-or-miss on this thread, but I lurk regularly, and you all have been such a great support & comfort to me, and I will be forever grateful!! CHJ",
      "MessageIndex": 3404,
      "PostDate": "16/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Oct 13, 2008 07:24PM chj127 wrote: D1 and someone else who asked about my pic - it's at Shenandoah National Park.  DH & I went up there for an over-niter.  It was our first night away together since before-cancer.  We were there mid-week, and it was not at all crowded.  It was awesome.  We hiked about 1.5 miles to get to the overlook. SisKimberly, I am sorry about your sister.  She is so fortunate to have you there, though.  That's the one thing about women with bc - we are always there for each other.  It's the best club-you-never-wanted-to-join.  KathyL -meeting Robin R. must have been so cool!  And congrats on your hair cut.  :)  I've had mine lightly trimmed twide, around the ears and at the nape, which is just all over the place.  Still trying to decide how long I want my hair to get.  It's so easy short like this. Carol - you can wear your pink bracelet!  I am all for awareness and I think it's important.  I just don't know that I need pink spatulas and vacuum cleaners.  Over on the  \"moving beyond breast cance\" section, there is a thread that's \"pink:not just for Pepto Bismol\" thread that's just hilarious.  I just think the whole pink thing is so over done.  First, pink is not really my color.  :)  And as one person said, breast cancer is a disease, not a marketing opportunity!  <minor rant over> I realize how much I've missed hanging out here - but it is hard to keep up!  Too much going on!  But thanks for letting me drop inevery now and then, and makingme feel welcome.  I'm crazy about all of you!! CHJ",
      "MessageIndex": 3825,
      "PostDate": "13/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Oct 30, 2008 01:34PM chj127 wrote: LJ - great article, thanks!!  So these hot flashes aren't wasted, eh??  (I'm on Arimidex.) Carol, Kimberly, KathyL, Therese,  and everyone else feeling down about it all - I'm sorry to hear it.  If you remember, this is my second time through the whole bc experience.  When I finished treatement in 1995, I remember having a really low time a few months later.  I have a very clear memory of lying on the sofa, fetal position, crying and saying, I just want to be normal; I just want my energy back; I hate this.  I had a super-low time, worrying about every little ache and pain.  I remember insisting on a chest xray when I had a bad cough, and for every ache or pain, I wondered, is this the\"bone pain\" the oncologist is always asking about?  I was a basket case some of the time.  And DH, bless his heart, just wanted it to be \"over\" and didn't get it at all. But it gradually got better, until after a year or so, I occasionally started having a day here and there when I actually didn't think about my cancer. I don't know if it's because I have been through it before or what, but this time I just don't have those feelings.  I feel good, and any aches or pains (or those wonderful hot flashes - thanks LJ!) just don't bug me as much.  Life just seems sweet to me now, most days.  So maybe what I'm saying is that it's OK to have those low days, and that they will lessen over time.  Hang in there.  This forum is awesome to be able to share feelings with other women who understand exactly what you are going through.  I appreciate reading about all of your experiences.  I know I'm not exactly a regular, but I do keep up with most of the activity.  You are all strong, amazing women. CHJ",
      "MessageIndex": 3887,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Dec 20, 2008 08:49AM chj127 wrote: Kathy - I agree with the others.  Of course you should get it checked out.  However, I get those pseudo-migraines once or twice a month also.  I get the \"swimmy eyes\", followed by some queasiness but without the headache part.  I used to get the screaming headaches also, but don't get them anymore, for which I'm thankful.  But I did freak out when I first started to get them, until I read something that described it to a T. Joan - sorry to hear about your mom.  It sounds like it's been a difficult time, but glad you have the good memories. I do agree with Joan about Vegas - that's the one place I might be able to get dh to come to!  Of course it's hot hot hot in the summer, but there are plenty of places to cool off. I'm ready for Christmas.  Most of my preparations consist of mailing packages to somewhere else, and that's all done.  So we're in for a nice, quiet week that I'm looking forward to. Lots going on in here!  I still have a hard time keeping up...  Hope you all have a wonderful holiday season! CHJ",
      "MessageIndex": 4078,
      "PostDate": "20/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 11, 2009 01:33PM - edited Jan 11, 2009 01:46PM by chj127 Well, can I just say, wahoo for the Ravens!!  SisKimberly, I'm hoping you were kidding about not knowing who they are.    By all counts, they should have lost yesterday, but they didn't, and we'll take it!!  Kathy - are you saying you went to collage with our guy Joe Flacco??  Of course we know he came from DE. Vegas in July?  Yes, it'll be hot as blazes, but I don't care.  DH might not want to come with that kind of heat, but if it's just for 2 nights, I can go without him this one time...  My schedule is totally flexible, so whenever it is, I'll try my darndest to be there!  It's hard to imagine heat when it's so cold here right now, and later in the week it's supposed to be a high in the mid-20's.  Yikes! Tinalee - that's awesome that you are getting traffic on your house.  We were trying to sell ours this time last year (in the middle of my chemo) and there were almost no potential buyers.  And the market is supposedly a lot worse now.  But all real estate is local, and I hope you get 'er done quickly!! That's all for now -  CHJ",
      "MessageIndex": 4219,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Jan 12, 2009 09:07AM chj127 wrote: Patty, lucky for you, you can save your money & go to Vegas.  You won't need it to go to Tampa because the Ravens are going to win next week!  (I hope, I hope, I hope...)  Julie - great pictures!  Wow, I could use a little bit of sunshine and palm trees about now. {{{{Paula}}}} We're with you, girlfriend.  It's so tough to see the ones we love go through difficult times.  Our prayers are with you. CHJ",
      "MessageIndex": 4232,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "chj127",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60943/profile",
      "Content": "Feb 6, 2009 04:53PM chj127 wrote: D1 - Jewel Jewce?  LOL!  Yes, Maz, with all of us behind you, it's going to be OK.  You will beat this thing!!!   {{{{{hugs again}}}}}",
      "MessageIndex": 4482,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    }
  ]
}