{
  "AuthorID": "Chloe3278",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
  "Posts": [
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Chloe3278 wrote: Hi everyone, I am 19 years old and last tuesday i had a breast augmentation done. During surgery, my Plastic surgeon found lumps and decided to get tissues sent for a biopsy (This is not his job, yet he saved my life). I got the results back yesterday and got told i have noninvasive low grade DCIS. I dont know what to think, feel and i cry every time i think about it. Everytime i take a nap, i wake up and hope that it was all a dream. I have an appointment with a breast surgeon today, and am afraid of my diagnosis. My plastic surgeon has somewhat scared me, he told me there has never been a case so young in the state and that i am the only one who's been diagnosed. I am afraid that no one will know how to help me, and am scared i might die because i feel like everyone around me is going so slow. My PS has reassured me that i will not 'die' if i wait another week, but i am so scared as i have heard cancer grows faster in those whom are young. Sorry if i am babbling, i am so afraid and need help. I want someone to talk to, similar experiences or any experiences. Its upsetting that i have to even be on this forum, yet i am blessed that there is a community that is going through something similar. Dx DCIS, Right, 1cm, Stage 0, Grade 1, 0/2 nodes, ER+/PR+ Surgery Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856299",
      "Title": "19 years old and just diagnosed. Chloe3278 msphil"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Jun 22, 2017 03:16AM Chloe3278 wrote: Hey, I'm done with my appointment. The breast surgeon told me I need a mastectomy. She says that the tumour I have is spread in my right breast, and that the left wasn't even tested (so my left might also have some tumours). I don't know how to feel, I feel broken but relieved that a mastectomy will 'cure' me.",
      "MessageIndex": 5,
      "PostDate": "22/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856299",
      "Title": "19 years old and just diagnosed. Chloe3278 msphil"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Jun 22, 2017 05:39PM Chloe3278 wrote: Thank you everyone for your words of encouragement. The support has been encouraging and i feel like crying because i feel like i already love you guys",
      "MessageIndex": 8,
      "PostDate": "22/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856299",
      "Title": "19 years old and just diagnosed. Chloe3278 msphil"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Jul 21, 2017 01:07PM Chloe3278 wrote: Thanks guys. My surgeon told me they have ordered another meeting which I don't know what that means. is there some sort of legal liability?",
      "MessageIndex": 4,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857132",
      "Title": "Has anyone been misdiagnosed? Chloe3278 BarredOwl"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Jul 21, 2017 11:15PM Chloe3278 wrote: @BarredOwl that was extremely informative. I have shown this to my parents and we will follow up on this.",
      "MessageIndex": 8,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857132",
      "Title": "Has anyone been misdiagnosed? Chloe3278 BarredOwl"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Aug 8, 2017 11:27AM Chloe3278 wrote: Hey guys, had another appointment last thursday. The original pathologist does not have the tissue with the dcis and claims he only took stains of it or something along those lines. The breast cancer pathologists confirmed that the 'stain' did have DCIS but not to the exact measurements originally diagnosed. They are also investigating the other 9 tissues taken that were all 'clear.' Turns out i did have DCIS but it was in one location and was only 4mm. Therefore, it was confirmed that my plastic surgeon did remove the entire lump without knowing. I did not even need the mastectomy. I am meeting up again with the team this thursday to discuss everything. I have been told that this has never happened and to get a hold of a lawyer but honestly i just want all of this to be over. Im trying to look at the bright side; at least now i dont have to worry about breast cancer ever again now that i have basically no breasts lol.",
      "MessageIndex": 11,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857132",
      "Title": "Has anyone been misdiagnosed? Chloe3278 BarredOwl"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Chloe3278 wrote: Hey guys, I am almost a full day post bilateral nipple-sparing mastectomy with tissue expanders. I also got a sentenial lymph node biopsy on my right hand. The worst is over and I feel so relieved. I was on a pain pump the first few hours and am now on oral Tylenol. The pain on my right hand where the nodes came out is really bad and I cannot lift my arms. Taking it day by day. The nurses are really sweet. Drains are annoying but thankfully not painful. Any tips???? Wordsof encouragement? Would really appreciate it ❤️❤️ Dx DCIS, Right, 1cm, Stage 0, Grade 1, 0/2 nodes, ER+/PR+ Surgery Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856958",
      "Title": "My mastectomy journey at 19 Chloe3278"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Jul 17, 2017 06:11AM Chloe3278 wrote: Had extreme vomitting yesterday but am now finally healing well. Haven't even taken pain meds!!! Already worried about my implant exchange surgery lo",
      "MessageIndex": 2,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856958",
      "Title": "My mastectomy journey at 19 Chloe3278"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Dec 3, 2017 05:40PM Chloe3278 wrote: Just an update. i have NOT worked out at all post mastectomy. I did a workout routine 4 weeks post my mastectomy and my tissue expander rotated and my surgeon claimed it was from exercising. All i do is job, no lifting and no body workouts. I have my recon surgery in two weeks and im hoping to be back at the gym then.",
      "MessageIndex": 7,
      "PostDate": "03/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858382",
      "Title": "Working out post mastectomy Chloe3278 EastcoastTS"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Feb 28, 2018 06:26AM Chloe3278 wrote: @KBeee How many months post op were you able to do a pushup? I bet it feels weird feeling the implant there!",
      "MessageIndex": 23,
      "PostDate": "28/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858382",
      "Title": "Working out post mastectomy Chloe3278 EastcoastTS"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Chloe3278 wrote: Hey guys. Im sorry for making new threads all the time, im just confused and overwhelmed with everything and need advice! If you look through my previous posts, you would know i just did my mastectomy, lymph node biopsy + tissue expanders. I had an appointment yesterday with 5 surgeons, and a team of pathologists. No signs of ANY cancer, abnormal cells, DCIS was found. Nothing. My main surgeon has requested the first pathologist that did the biopsy to come meet up with the team again, and they are going to 'have another look.' My surgeon told me that this has NEVER happened and that pathology reports are very accurate. She did however say she had doubts when she first got the pathology report due to my young age, but 3 other pathologists also confirmed the presence of DCIS so she was certain i had it. She told me there are two possibilities: The pathologist made a mistake (whether its to do with experience, or mixing things up) OR it just happened out of luck that the 7mm tumour came out perfectly in one piece and my plastic surgeon just happened to take that piece of tissue out. If this is the case i am wondering if i am the luckiest person alive if it all came out in one piece. Has anyone experienced this, or know any knowledge of this? Is it even possible to be misdiagnosed? Dx DCIS, Right, 1cm, Stage 0, Grade 1, 0/2 nodes, ER+/PR+ Surgery Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857132",
      "Title": "Has anyone been misdiagnosed? Chloe3278 BarredOwl"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Aug 10, 2017 12:14AM Chloe3278 wrote: Had another appointment today with my surgeon!! Everything has been confirmed and I was not misdiagnosed. I did have DCIS. It was just incorrect measurements. She told me I would have had to have a mastectomy anyways. In other news, I got my genetic test results & I am negative for both BRCA 1 & 2!!! I wonder if me taking birth control for the past 2 years had anything to do with developing dcis since I don't have the genes?",
      "MessageIndex": 13,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857132",
      "Title": "Has anyone been misdiagnosed? Chloe3278 BarredOwl"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Dec 24, 2017 06:38PM Chloe3278 wrote: Hey Ghionik, Its 4 months post reconstruction. If you read my previous topics you'll see that i had my mastectomy 6 months ago and now i have tissue expanders. I went back to the gym 3 months post op and my tissue expander rotated and leaked out because of working out. I am only allowed to walk and swim.",
      "MessageIndex": 12,
      "PostDate": "24/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858382",
      "Title": "Working out post mastectomy Chloe3278 EastcoastTS"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Dec 22, 2017 05:15PM Chloe3278 wrote: Booked my reconstruction date in a months time. Im getting teardrop implants and because of the chance of rotation i cant workout for 4 months omg :( way longer than i thought. Anyone experience this???",
      "MessageIndex": 9,
      "PostDate": "22/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858382",
      "Title": "Working out post mastectomy Chloe3278 EastcoastTS"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Chloe3278 wrote: Hey family!! I'm 6 weeks post bmx+tissue expanders, and am feeling 100% now! I had my first expansion (150cc) and am feeling great! I am back to working full time at my retail job and have been trying to get back to working out. I can do everything cardio (from a jog to intense workouts). I can also do most body weight exercises (ie. plank, sit ups). The only thing I cannot do is a push up. I have tried but every time i have intense pain & need to stop. I miss doing arm exercises and am wondering if I am able to go back to lifting weights? I want to go back to my body pump class, however the lowest weights they have are 2.5kg plates. Pre-surgery I was able to lift 55 pounds, and am capable of lifting heavy. From what I read online it says you shouldn't lift above 10 pounds?I believe I am able to do most of the workouts excluding chest with 5kg in total (11 pounds). I will not see my surgeon and the team in another month so I cannot ask them, and I want to go back to the gym ASAP. I tried googling but I could only find info on people lifting after just a bmx or getting implants, not bmx+tissue expanders. Can anyone tell me what their surgeons have advised them or their experiences with lifting above 10 pounds? Is it too early or am I able to go back to lifting weights again. Dx DCIS, Right, 1cm, Stage 0, Grade 1, 0/2 nodes, ER+/PR+ Surgery Lymph node removal: Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858382",
      "Title": "Working out post mastectomy Chloe3278 EastcoastTS"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Sep 2, 2017 12:48AM Chloe3278 wrote: Jennie93 thanks for your response! What things couldn't you perform ever again? Would you think the 10pound guideline would be accurate. I don't want to lift heavier than that anyways. I just want to actually participate in the gym class!",
      "MessageIndex": 2,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858382",
      "Title": "Working out post mastectomy Chloe3278 EastcoastTS"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Feb 4, 2018 11:59PM Chloe3278 wrote: im a week post my breast implants! Recovery was so easy im already jogging. Its gonna be hard not exercising cause i have no discomfort with the implants!",
      "MessageIndex": 15,
      "PostDate": "04/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858382",
      "Title": "Working out post mastectomy Chloe3278 EastcoastTS"
    },
    {
      "AuthorID": "Chloe3278",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254556/profile",
      "Content": "Oct 22, 2017 08:32PM Chloe3278 wrote: BUMP. i have my reconstruction surgery coming up, and my gym membership is going to start up again. :/",
      "MessageIndex": 4,
      "PostDate": "22/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858382",
      "Title": "Working out post mastectomy Chloe3278 EastcoastTS"
    }
  ]
}