{
  "AuthorID": "choochoo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278729/profile",
  "Posts": [
    {
      "AuthorID": "choochoo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278729/profile",
      "Content": "Aug 21, 2018 07:41AM choochoo wrote: Thanks MelissaDallas! You made me feel much better! I don’t know why but I still had a sleepless night—I feel my whole body so tense that I cannot relax. I’m not even tired—weird but frightening.",
      "MessageIndex": 1022,
      "PostDate": "21/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "choochoo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278729/profile",
      "Content": "Aug 19, 2018 06:03PM choochoo wrote: HI Everyone, I'm so glad to find a supportive community here! I learned so much by reading your postings. I had a core biopsy on Aug 10th on my right breast due to a suspicious spot on the Ultrasound although 3D Mammos were clear. I got the result a week later on Aug 17th: Atypical Ductal Hyperplasia. My family doctor wanted to refer me to a general surgeon from the same medical institution he is in (a clinic) to have an excisional biopsy. Here are my questions: 1. Shall I go with my family doctor's referral or shall I find a breast surgeon from our local breast care center? What if my family doctor cannot or will not refer anyone outside his institution? I may be able to find a breast surgeon by myself but that might be a long wait while I want to have the excisional biopsy as soon as possible. 2. Shall I insist on having a MRI done before the excisional biopsy (I haven't done it at all) to root out any other hidden suspicious spot? I was told I had extremely dense breast texture so mammos don't really help. Any input is greatly appreciated! Thank you very much!",
      "MessageIndex": 1019,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "choochoo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278729/profile",
      "Content": "Aug 20, 2018 10:01PM choochoo wrote: Hi everyone, I'm new here. Could someone help me understand some of the terms in my breast core biopsy report? The diagnosis is Atypical Ductal Hyperplasia, but I'm puzzled by the following microscopic description: 1. the myoepithelial margins, p63 and SMMHC are performed and are positive 2. E-Cadherin is positive. 3. A Cytokeratin 5/6 stain reveals positive staining within nearly all of the ducts exhibiting hyperplasia. However, there is one duct showing a lack of staining. Don't those positives point towards cancer rather than ADH? I'm so nervous and stressed out. I hope someone could come and help. Thanks.",
      "MessageIndex": 1020,
      "PostDate": "20/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    }
  ]
}