{
  "AuthorID": "ChrissyCA",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77228/profile",
  "Posts": [
    {
      "AuthorID": "ChrissyCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77228/profile",
      "Content": "Apr 30, 2009 11:44AM ChrissyCA wrote: I agree with the others... get the genetic test, use all of the resources that are available to you for annual screening and be observant. I have a strong family history as well, but \"my girls\" were okay until I was 50. I know it's hard to relax when you feel like you have a time bomb in your body (been there). Maybe these feelings are a discovery for you that in the event you are to be diagnosed with breast cancer, you would then choose to have a bilateral and reconstruction (or whatever). I remember a family reunion we had and during a car ride with 4 other females we shared what we would do if we were diagnosed. When my diagnosis came, I knew in my heart what I wanted and I chose to  have a bilateral and implants. I hope you can find a balance between making peace with your body and taking the precautions that are necessary.",
      "MessageIndex": 4,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733177",
      "Title": "preventitive bilateral mastectomy staceyroberts2007 BrandyWK"
    },
    {
      "AuthorID": "ChrissyCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77228/profile",
      "Content": "Feb 2, 2009 06:08PM - edited Feb 2, 2009 06:40PM by ChrissyCA Hi Pamela (et al) I had a bilateral mastectomy January 21st. I was told the Nuclear Medicine shot was a dye that had to have time to travel through the lymphatic system so the surgeon could see the lymph node. My injection took place 3 hours before surgery too. Apparently the lymph nodes are the same color as the surrounding tissue and the surgeons can't see the nodes. I was awake for the injection ~ I found the solution that they injected stung like the dickens (wish I had a stick to bite on) but it passed in about 10 seconds. My biggest piece of advice that I haven't seen so far... regarding the nausea after surgery... I kept trying to get rid of the awful dry mouth and sore throat, so I kept sipping water. I saw that I was hooked up to an IV and realized I wasn't going to become dehydrated so I quit drinking fluids and \"toughed out\" the sore throat. All of the symptoms - incredible thirst, nausea passed within a 2 hours. Regarding the amount of time for the surgery ~ My surgeon said after 2 hours of surgery your chances of developing blood clots increase. My surgery took 7 hours, I had a double mastectomy plus they attempted to put in full size permanent implants - didn't work so they are temporaries that will be exchanged later. I'm 51 years old and 60 pounds overweight (was a DD cup). I was told my weight was more of an issue than my age. I was scared I'd have a stroke!! But everything is good - I have full mobility less than 2 weeks post surgery! Both drains are still in and can't sleep well. FYI my surgeon said she had one patient who had them in for 3 or 4 months but that is extremely rare, most have them out within 3 weeks.",
      "MessageIndex": 152,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726161",
      "Title": "January Mastectomy crusader1 bettelou68"
    },
    {
      "AuthorID": "ChrissyCA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77228/profile",
      "Content": "Mar 20, 2009 06:38PM ChrissyCA wrote: Hi Michelle, I noticed I felt pretty good at 6 weeks. The energy level was good, no pain and sleeping better. Around week 5, I woke up in the morning and found myself almost laying flat (only 2 pillows). It's okay to rely on others — this is a long road we have, a doctor told me it takes 6 full weeks to recover, if you rush it you'll only delay the process.",
      "MessageIndex": 10,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730777",
      "Title": "bil/mas with t/e, when will I feel comfortable again? jpixstix JanMarch"
    }
  ]
}