{
  "AuthorID": "christineK",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14699/profile",
  "Posts": [
    {
      "AuthorID": "christineK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14699/profile",
      "Content": "Jan 7, 2009 10:52PM - edited Jan 7, 2009 10:53PM by christineK Just looking for some updates on my good friend, Alaska DebCcasinowinner (she'll get it if you mention Pinkstock 07) Love to you girl- looking forward to reading more of  your wonderfully written posts and stories,",
      "MessageIndex": 441,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "christineK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14699/profile",
      "Content": "Sep 3, 2006 12:22PM christineK wrote:",
      "MessageIndex": 16,
      "PostDate": "03/09/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/398051",
      "Title": "should choose today if mastectomy or radiation linapril gwenn"
    },
    {
      "AuthorID": "christineK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14699/profile",
      "Content": "christineK wrote: I haven't had reason to visit this thread in a long time, but the wierdest thing is happening. Last week I had thryoid surgery and made sure I had no BP or sticks on my left side, they put a red bracelet on me etc.. all went well, no problems and NO cancer. Today I went to my endocronologist, as I am diabetic also. She took a finger stick for blood from my pointer, which I never use, although, I do use the middle finger thru pinkie on that hand (the affected side) often. When she stuck me, I noticed that it really hurt, it just bleed a normal amount, but now, the whole tip of my pointer is red, really swollen and hard. Is this a lymphedema thing and if so any recommendations, so I don't wake up with a swollen hand/arm. I do see my ENT surgeon in the am and will be sure to show him. Suggestions? I never have really been dx w/ LE, just some suggestions that I \"may have a little\" arm. breast and truncal, I think, but I am always so careful. Love when you can, Cry when you have to, be who you must, that's the part of the plan.- Dan Fogelberg Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/518037",
      "Title": "finger tip LE? christineK christineK"
    },
    {
      "AuthorID": "christineK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14699/profile",
      "Content": "Jan 29, 2007 06:43PM christineK wrote: OK, nevermind. The swollen has already gone down in the past hour. I still don't know why it was so huge. I did do the dishes, now it's better, weird!",
      "MessageIndex": 1,
      "PostDate": "29/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/518037",
      "Title": "finger tip LE? christineK christineK"
    },
    {
      "AuthorID": "christineK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14699/profile",
      "Content": "Jan 31, 2007 06:48PM christineK wrote: Thanks Binney, I have often referred to knowledge of this. Unfortunately, I am sure, you know way too much about LE.",
      "MessageIndex": 3,
      "PostDate": "31/01/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/518037",
      "Title": "finger tip LE? christineK christineK"
    },
    {
      "AuthorID": "christineK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/14699/profile",
      "Content": "Jan 26, 2009 11:46PM christineK wrote: I haven't been able to send my thoughts just yet, as I have going thru the Pinkstock 07 pics, reminiscing and crying my eyes out. It goes to show, if you are able to make it to the get-togethers- do so. We never know... I know that if Deb had the good health, she would have been at '08. I've got some great pics of her and the gang. I'll post them as soon as I can. My heart is broken for her family. Deb was a gifted writer and I am sure she left some awesome words behind. Godspeed Deb, give a big hug to Cy with love from one of the Circle Girls...",
      "MessageIndex": 98,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    }
  ]
}