{
  "AuthorID": "chrissera",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
  "Posts": [
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Oct 3, 2012 04:18AM chrissera wrote: Chickenlady, glad you are doing ok. I am having same surgery on Friday. Which injection are you talking about? I have to go thursday afternoonfor a radioactive injection. Is that the one? It all scares me more than chemo did, maybe because this decision for which surgery to choose is so life changing and disfiguring. having chemo somehow in my mind was, to be overly simple, like taking a pill for a bug I caught, but surgery for me makes it all too real. I'm sure that sounds stupid... chemo was very real and seriously sucked and I lost my hair and suffered side effects for 18 weeks and still am... I don't know... maybe I need to stop thinking about it, but I cant shut my brain off lately. Sorry for rambling... this cancer stuf sucks... I wish it was as easy as just a pill!!! HUGS to all ...",
      "MessageIndex": 37,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Oct 15, 2012 05:05PM chrissera wrote: Path results are in... 0/6 nodes negative and clear margins!!! its great when the news starts turning positive! meet with Rad onc next week to start the next step.. Not sure what to do to celebrate but I'm sure Ill findsomething! HUGS to All",
      "MessageIndex": 146,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Sep 29, 2012 12:31PM chrissera wrote: Hello to all.. sorry we have to meet here but glad to share this with all of you. Leigh even though the change in diagnosis sucks you sound confident in your drs and treatment plan and that is what counts. I am getting really nervous for Friday and trying to keep myself busy... doing some fall cleaning this weekend and cooking up a storm to stock the fridge. And tonight my husbands sisters and their husbands are taking us out for a dinner celebration to make up for the stuff I missed celebrating during the summer... everyone but me had a birthday, and we all have anniversaries around the same time, and my husband completed his Associates Degree and got a well-deserved promotion. This will be the first time in a fancy restaurant for me since April. Looking forward to it. Mayrah - boy you have a lot going on in your family! I will add your daughter and grandson to my prayers... Sue my port surgery wiped me out too. I think that is why this surgery is making me so nervous! HUGS TO ALL",
      "MessageIndex": 20,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Oct 15, 2012 07:36AM chrissera wrote: Good Luck to those having surgery this week. going for my path results today. (((HUGS)))) to all. :-)",
      "MessageIndex": 140,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Sep 26, 2012 04:26PM chrissera wrote: Hi Everyone!  Sorry that we have to meet like this, but happy to have you all with me! GA Chickenlady, I had my chemo before surgery, called neoadjuvant , becuase I had a positive Lymph Node aspiration and the size of the tumor on the MRI wsa 1.9 cm with unclear margins to 3.3 cm.  Now I am scheduled for the lumpectomy and then will have 6 weeks of radiation as well.   When it came time to make the decision of lumpectomy vs mastectomy, it was a hard decision.  The Chemo appears to have been successful as the tumor is almost invisible on the MRI and the surgeron can no longer feel it.  Both my MO and BS recommended lumpectomy but would support my decision if I chose to go MX.  I decided I went through the chemo first to try and kiil the cancer and it looks like we did that, so why would I take the whole thing if I don't have to?  But there is a little voice in my head that says \"take it all off\" and get rid of it.  My Surgeon is wonderful -- it was his comments/opinions that helped make my decision-- he said if I can't decide to do lumpectomy now, and if there are unclear margins after surgery or I don't like the way it looks after surgery, we can do a mx later.  But once you do Mxand take it off, there is no going back , only recon and I am not ready for that.  He is a wonderful man!  It's funny that he reminds me of my dad, maybe that's why I trust his opinion so much.  Leigh22, as for the Herceptin, I can't say much about the side effects from just that drug, becasue I always had it in combination with something else during chemo.  I have already had 19 treatments of it, the first one I had was just Herceptin as I am part of a clinical trial investigating the effectiveness of Herceptin being given before chemo and before surgery.  That first treatment made me tired, and my eyes watered quite a bit for the first few days.  After that first treatment, it was given every week, but in combination with Abraxane (a taxane chemo drug).  Even with that combination every week, the side effects seemed to be the same - fatigue for a day or too, like you are recovering from a flu, and the watery eyes and drippy nose. I haven't had any treatments for 4 weeks to allow my body to clense itself of the poisons before Surgery, but after surgery, I will start the Herceptin again once every three weeks for an additional year.  that is the standard I think. For those who are heading to chemo after surgery, I suggest you read the posts on the Chemotherapy thread, they helped me a lot when I was having my treatments.  I don't have anything to compare it to, but if you manage the side effects and listen to your doctors and take your meds on time, you may be able to stay ahead of any SEs.  Thats what I did, and was pretty successful.  I am no expert at this by any means, but I have been through some of it already.  Trust me, we can get through this!  Here are some suggestions that helped me...  take someone with you to all appointments and ASK QUESTIONS and TAKE NOTES every time you go .  I kept a notebook with me, and every time I would think about something I would write it down to ask the doctor or the nurse.  No question is to stupid to ask.  I took my husband with me to every appointment and I was fortunate that he could stay with me during every chemo treatment.  Now that we are at the surgery road and had some deep discussions about what to do, I found out he heard different things in the appointments than I did. This cancer-thing is such a shock and everything keeps changing that sometimes I think I tuned out what I was hearing!   I have a chemo-buddy who even went so far as to record the appointments and play them back later to be sure she understood everything.  It is so important to understand what is going on! I also made sure to get a copy of every test result including the biopsy report, MRI report and every blood count that was run.  Then if there was confusion in an appointment, I was totally aware of what the reports said.  These reports are your records and you have a right to them.  Sorry this post is soooo long!!  I went into the clinical trial because I wanted my experiences to help others, and I want to do that here as well...   but sometimes I need some advise too...   I just went to a pre-surgery session with a Lymphedema therapist, as I am at risk after surgery because I am having a lymph node dissection and radiation.  Has anyone else gone for one of these yet?  It sounds pretty scary.  I guess just one more thing I have to worry about!  Sending HUGS to everyone as we await the next step (and I HATE waiting!!! :( )",
      "MessageIndex": 9,
      "PostDate": "26/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Oct 4, 2012 05:44PM chrissera wrote: Had the sentinel node radioactive injection this afternoon. it wasn't too bad. butI had a crying fit in the room with the radiologist. It all just hit me at once. Surgery tomorrow... feeling sad and angry and anxious. Having a snack with hubby before bed, not that I will be sleeping much tonight...",
      "MessageIndex": 45,
      "PostDate": "04/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Oct 4, 2012 05:49PM chrissera wrote: Mainegirl, good luck tomorrow... Sending HUGS your way!",
      "MessageIndex": 46,
      "PostDate": "04/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Oct 11, 2012 11:44AM chrissera wrote: Qanndyland, I am 6 days post lumpectomy and most of my pain is in my arm. The breast aches a little and really hurts if I bump it or turn too quickly. Hoping it gets better soon. I have read that people go back to work days after surgery and I can't imagine that! I must really be a wimp...",
      "MessageIndex": 101,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Sep 26, 2012 08:13AM chrissera wrote: Hi Leigh. This is my third time trying to post. So I'll keep it short.. I am having a lumpectomy with SNB and lymph node dissection on October 5. Glad you started this thread! I can definitely use some support for this part of the journey!!",
      "MessageIndex": 1,
      "PostDate": "26/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Oct 3, 2012 04:12PM chrissera wrote: I have an appt tomorrow for a radioactive injection. Can anyone tell me if that is painful too? do they do the blue die at the same time ? my surgery isn't until 9AM friday. the doc explained it when I met with him hut that was three weeks ago. thanks",
      "MessageIndex": 40,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Oct 6, 2012 04:38AM chrissera wrote: Surgery went well yesterday. Was home by dinner. BS was pleased with the mass he removed, thinks he got it all. Now I wait for the path report.. Hooefully I can find a comfortable way to sleep cuzlast night was not good. HUGS to all today!!",
      "MessageIndex": 57,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Apr 14, 2012 09:31PM chrissera wrote: Hello ladies...  so I have all of the info now...  Stage II IDC with positive lymph nodes, grade 3 ER+ / PR + HER2+...  still waiting on the BRCA tests...  lots of info to digest, but we are going to do chemo and Herceptin first and then surgey and then radiation... scheduled for port on 5/2... worried about the side effects -- but at least now there is a plan.  Still trying to digest it all...  feels like I am watching a movie but can't find the remote to change the channel...  any suggestions to help manage this physically and emotionally would be appreciated!  also, any advice on if I can still work during this aggressive treatment?  I am a systems analyst and work at a computer in a cubicle all day... not sure what to do...  this site is a blessing... lots of research to do now... thanks for all of the good wishes..  HUGS to everyone...",
      "MessageIndex": 9,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785455",
      "Title": "Just Diagnosed and Confused chrissera Butterflylady2012"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "chrissera wrote: Hi all - jumping here from the \"not diagnosed but worried\" forum because ....   I received my diagnosis of IDC on 3/30.  Since then (~one week ago)  I have had to tell the family and had blood work, chest xray, US biopsy of lymph nodes and BRCA genetic counseling and testing.  This week has been an emotional roller coster. All I was told at the meeting with the surgeon on the 30th was the IDC diagnosis which came from the biopsy results, no other information.  I have a breast MRI this week , hopefully the last of the testing, with another consutation with the surgeon on the day after that.  Is that when I find out all of the other information or do they already know from the first biopsy and i just didn't ask the right questions?  The surgeon talked about lumpectomy and radiation, but also said that may change after the additional tests.  i am really confused!!   I was given a surgery date of 5/2 but was told that is subject to change.  they also said it's outpatient surgery?   I have a list of questions to ask when I see the dr, but am dying inside without the additional informaiton! I finally had to take a sleeping pill last night due to the mental exhaustion from this week.  I don't know if I can make it amlost another month before the surgery and not lose my mind..  I am always the strong one in the family when someone is ill or there is a family crisis, I don't know how I should be acting, I feel like I need to put up the strong front like I always do.    I konw there are other sisters out there that are worse off than me, but I can't help thinking about all of the unknowns every time I have a spare minute to think...   when does it get easier to handle? Always look on the bright side of life. Dx 3/30/2012, IDC, 3cm, Stage IIB, Grade 3, 0/6 nodes, ER+/PR+, HER2+ Targeted Therapy 5/3/2012 Herceptin (trastuzumab) Chemotherapy 5/3/2012 Abraxane (albumin-bound or nab-paclitaxel), Carboplatin (Paraplatin) Surgery 10/4/2012 Lumpectomy: Left; Lymph node removal: Left, Sentinel Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785455",
      "Title": "Just Diagnosed and Confused chrissera Butterflylady2012"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Mar 30, 2012 10:01PM chrissera wrote: Saw Breast surgeon today for biopsy results and not good new...  still can't believe it.  Left IDC Stage 1 more testing on the way - untrasound and lymph biopsy, genetic counseling, MRI of both breasts, chest xray and blood work before we come up with a final plan, but recommended lumopectomy.  the surgeon is wonderful and I feel like I am in good hands.  Now I have to digest it all and tell my family, no one other than my husband knows.  I haven't been able to say the words out loud yet... tomorrow I will tell my sister who will help me tell my mother..  I have two brothers who have died, one from cancer, so that will be a hard convesation, but I have to tell her cuz she will hear it in my voice when I talk to her.. even from Florida she can tell when something isn't right.   The BS actually recommended I visit this website before I even mentinoed it to him, so KUDOS to Breastcancer.org!!!  The information I found here both during the waiting and researching diagnosis today have been invaluable...  thank you to everyoen for sharing their stories and experiences for those of us who are lost in the maze of internet research overload!   Now I just have to come back to reality... it feels like a bad dream today...  just want to wake up!!  not looking forward to the next few weeks, but it is better to know than to not know I guess.  I will update as I have more info on things...  Thank you to everyone for your support!  ",
      "MessageIndex": 17,
      "PostDate": "30/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784683",
      "Title": "Scared and feeling unlucky chrissera marjie"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Apr 1, 2012 03:30PM chrissera wrote: Thanks for all your thoughts.  Having a place to vent this is wonderful.  t's been a tough day for me today.  I was crying in the grocery store for no reason!  I just don't know what to do with myself.  I told my family the news and everyone was supportive, my mom took it well, thankfully she is already planning on coming to visit from Florida around the time I think the surgery will be.  The funny thing is before all of this began, I had no pain or discomfort that I can think of.  But now the left side is achy and I have pain in my shoulder,  and it feels heavy when I take my bra off... Is this in my head?  And I can't focus on anything.. . tomorrow should be fun at work!  I know I won't get anything productive done!!  Thansk again everyone...  ",
      "MessageIndex": 23,
      "PostDate": "01/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784683",
      "Title": "Scared and feeling unlucky chrissera marjie"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Apr 1, 2012 05:45PM chrissera wrote: Debbie6122, I have an US for anxially lymph nodes on Thursday and am waiting for the MRI to be scheduled, but have to wait until I have my \"monthly friend\" before that so as not toskew the results with the other raging hormones!!   I also have the paper work for the chest xray and bloodwork that I will get this week.   I know that additional ifnormaiton is needed to make the right decisions, but more waiting!  i guess that is just the way it is.  I am better now.  I decided to take up knitting, which is something I love to do but haven't done in a while cuz I never have the time..  It will keep my mind busy while I am sitting with nothing to do but think!!!  thanks again for the hugs..  I am sending them back to you and everyone here !!! ",
      "MessageIndex": 25,
      "PostDate": "01/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784683",
      "Title": "Scared and feeling unlucky chrissera marjie"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Mar 28, 2012 08:14PM chrissera wrote: Thank you Everyone for your good wishes and prayers.  Had the biopsy on Monday and it went ok.  Very caring and gentle staff made it that way! The ultrasound technician said it was solid, and when I asked what that meant, she said it just meant they could not aspriate it, whatever it was would have to be physically removed.  Not sure what that means, I guess I have to wait until  the scheduled results review on Friday afternoon.  I am having a hard time concentrating on anything, but I am trying to keep my mind busy on other things.  I have a sinking feeling that something is wrong, and I can't seem to shake it. I found myself crying in the restroom at work today, I just all of the sudden felt overwhelmed by the thoughts of what COULD be...  So I went to the gym after work and walked it all away.  I feel a little better now, that always seems to help calm me down, as if I can just keep walking and it will all be behind me.   Can anyone help with what information I will get at the results appointment with the surgeon?  Obviously whether B9 or not, but if it is C will they discuss everything right then?  Do you have to make decisions immediately after finding out it is bad, or do you at least get time to digest it first?  Thanks again to everyone! I will let everyone know how it turns out on Friday.  Sjoy - good luck with the biopsy ! sending thoughts your way. Kellogs, thanks for sharing...  my daughters are 16 and 19, and they have no idea anything is going on... ",
      "MessageIndex": 13,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784683",
      "Title": "Scared and feeling unlucky chrissera marjie"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "Mar 25, 2012 05:13PM chrissera wrote: Thanks everyone!  The BIRADS score was 4/5.  So with the research I did, definately causing worry.  And I am a control freak so anything out of my control makes me uneasy!  Hoping the biopsy isn't too bad.  I have never had any health issues before, so it's all a little frightening.  And I keep thinking about how to tell my two teenage daughters if it is cancer. This site helps a lot!  I have been lurking all week and finally got the nerve to post today, beacuse if i didn't put it in words, I was going to go insane... I actually started my own journal, which if anyone reads makes so sense and sounds like a crazy person (lol)  but it has been helping today.  thanks to everyone, and you are all in my prayers. I will be sure to post when I get the results. ",
      "MessageIndex": 5,
      "PostDate": "25/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784683",
      "Title": "Scared and feeling unlucky chrissera marjie"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "chrissera wrote: Hi everyone.  I am 43 and am freaking out !  had my annual mammogram and was called back for  a compression study of the left side.  Went back for that and while there the radiologist suggested u/s immediately.  So I had the ultrasound and then waited for the radiologist to read the results...  They found 1.9 cm suspicious hypoechoic lesion with irregular margins...  met with breast surgeon who was wonderful in trying to calm my fears, but tomorrow I am going for a 3-D mamogram and then vacuum biopsy.  Very nervious about all of this.  I didn't have any lump or anything wrong until the screening mammogram. Although i have read that exhaustion and forgetfulness can be symptoms?   I have found that I am always tired lately and for a few months can't seem to remember anything wtihout writing it down, but I just figured it was due to the weather and being overly busy!  I also have not been sleeping well since new years.    There is history of cancers in my family, lost two brothers to it (lymphoma and non-hodkins lymphona) and my mothers sister  had breast cancer later in life, and I think my grandmother too, but no one is sure about her..  My husband says it will be fine, but I have a feeling deep down that it is not fine...  I am the one who never gets lucky with anything.  There has been a lot of tradegy in my family and I can't stop thinking that it's my turn...  I have a f/u appt with the surgeon on Friday to reveiw the results of Monday's biopsy...  I don't know how I will make it through the week!   I think the worst thing I did was research on the internet - that makes more questions in my mind...    I really don't have anyone to talk to about this ..  don't want anyone to worry until I know it is something or nothing..  Thanks for listening.. Always look on the bright side of life. Dx 3/30/2012, IDC, 3cm, Stage IIB, Grade 3, 0/6 nodes, ER+/PR+, HER2+ Targeted Therapy 5/3/2012 Herceptin (trastuzumab) Chemotherapy 5/3/2012 Abraxane (albumin-bound or nab-paclitaxel), Carboplatin (Paraplatin) Surgery 10/4/2012 Lumpectomy: Left; Lymph node removal: Left, Sentinel Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "25/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784683",
      "Title": "Scared and feeling unlucky chrissera marjie"
    },
    {
      "AuthorID": "chrissera",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147052/profile",
      "Content": "chrissera wrote: Hi everyone.  I am 43 and am freaking out !  had my annual mammogram and was called back for  a compression study of the left side.  Went back for that and while there the radiologist suggested u/s immediately.  So I had the ultrasound and then waited for the radiologist to read the results...  They found 1.9 cm suspicious hypoechoic lesion with irregular margins...  met with breast surgeon who was wonderful in trying to calm my fears, but tomorrow I am going for a 3-D mamogram and then vacuum biopsy.  Very nervious about all of this.  I didn't have any lump or anything wrong until the screening mammogram. Although i have read that exhaustion and forgetfulness can be symptoms?   I have found that I am always tired lately and for a few months can't seem to remember anything wtihout writing it down, but I just figured it was due to the weather and being overly busy!  I also have not been sleeping well since new years.    There is history of cancers in my family, lost two brothers to it (lymphoma and non-hodkins lymphona) and my mothers sister  had breast cancer later in life, and I think my grandmother too, but no one is sure about her..  My husband says it will be fine, but I have a feeling deep down that it is not fine...  I am the one who never gets lucky with anything.  There has been a lot of tradegy in my family and I can't stop thinking that it's my turn...  I have a f/u appt with the surgeon on Friday to reveiw the results of Monday's biopsy...  I don't know how I will make it through the week!   I think the worst thing I did was research on the internet - that makes more questions in my mind...    I really don't have anyone to talk to about this ..  don't want anyone to worry until I know it is something or nothing..  Thanks for listening.. Always look on the bright side of life. Dx 3/30/2012, IDC, 3cm, Stage IIB, Grade 3, 0/6 nodes, ER+/PR+, HER2+ Targeted Therapy 5/3/2012 Herceptin (trastuzumab) Chemotherapy 5/3/2012 Abraxane (albumin-bound or nab-paclitaxel), Carboplatin (Paraplatin) Surgery 10/4/2012 Lumpectomy: Left; Lymph node removal: Left, Sentinel Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/784683",
      "Title": "Scared and feeling unlucky chrissera marjie"
    }
  ]
}