{
  "AuthorID": "chrisanddon…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131877/profile",
  "Posts": [
    {
      "AuthorID": "chrisanddon…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131877/profile",
      "Content": "Jul 6, 2011 04:29PM chrisanddon wrote: Hi, they give you a elastic colored wrap that you are supposed to wear. I bought several soft and wirefree bras online that fasten in the front and I am still wearing them as they are so comfortable.. I bought mine out of the Carol Wright catalogue.  I actually wore the leisure bra on top of the  wrap they give you and then took it off before treatment. You keep the wrap on at all times except when they unwrap you for the treatment. You are laying down so the wrap is right under you and after they velcro it  back. I have large breasts and was not comfortable with just the wrap. Good luck",
      "MessageIndex": 13,
      "PostDate": "06/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769860",
      "Title": "SAVI breast brachytherapy - 5 day ktab96 DebConway"
    },
    {
      "AuthorID": "chrisanddon…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131877/profile",
      "Content": "Jul 6, 2011 04:20PM chrisanddon wrote: Hi, I had  my surgery in December 2010 and less than 10 days later had the mammosite inserted. My surgeon said it should be put in sooner not later because the hole seals up. I had the lumpectomy first and then I went to the surgeons office and the area was numbed up and it was inserted. I was in there about a hour. No pain during or after. The worse part is you can't  shower because it can't get wet. I went to the hospital two times a day and first they took a xray and then I got connected to the machine and everyone left the room and it took about five minutes after it was started. There was also no pain during the radiation therapy. I highly recommend it as it only takes five days and its over. My last treatment the radiation Dr. took it out and put a bandaid on and I was good to go. My cancer was stage 1 and I just had my first  mammogram and ultrasound for my six month checkup. The surgeon said everything was ok and to come back in six months. I wish you all the luck and its not nearly as scary as what you think. You will do great.",
      "MessageIndex": 12,
      "PostDate": "06/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769860",
      "Title": "SAVI breast brachytherapy - 5 day ktab96 DebConway"
    }
  ]
}