{
  "AuthorID": "CHRISCPA",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105990/profile",
  "Posts": [
    {
      "AuthorID": "CHRISCPA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105990/profile",
      "Content": "Oct 15, 2010 04:07PM CHRISCPA wrote: To all those struggling with the hair issue I would like to share advice I got before I lost mine.  I have a friend who lost her hair years ago to alopecia who was able to share about hair loss.  Her advice was to buy a wig before you loose your hair.  It is easier for a stylist to match color and style.  Once you start loosing it just cut if off.  She shared that not only will it be traumatic for us it will be traumatic for those around us.  The hair ends up everywhere.  In the bed, bathroom, kitchen etc.  She told me it would be hard for my DH to watch me go thru this and she was right.  Fortunately my hairdresser is a long time friend and when I called and said it was falling out (15 days post tx1), we met at her shop during off hours.  She buzzed it and we talked constantly to keep both of us from crying, I think it was as hard on her as me as she has done my hair for more than 20 years. Even with buzzing early I still had hair everywhere and what a pain to clean up.   I do wear my wig as I work in a professional capacity and don't want the conversation to be about why the scarves and hats and the whole BC with everyone who comes through the door.  Most people I am in contact with have no idea I am even wearing a wig.  One of my associates told me she thought my hair (wig) was growing. My biggest fear of chemo was the loss of my hair.  I have 2 daughters getting married this month and the first words out of my mouth when the onco said chemo was \"but I have 2 daughters getting married\"  Her response is don't worry we will give you a RX for a wig.  Obviously she is not the mother of marriage age daughters.  I am now looking forward to the weddings in the next 2 weeks and don't have to worry about my hair.  I can shampoo and style it the night before and be ready to go. Just remember we are strong women and we can get thru this.",
      "MessageIndex": 6303,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "CHRISCPA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105990/profile",
      "Content": "Sep 11, 2010 08:57AM CHRISCPA wrote: Lisaattheshore-don't you have any tax clients on extension?  I have a few still to do.  So far I have been able to work on them.  Hope I still have my wits about me after #2 next week.",
      "MessageIndex": 1498,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "CHRISCPA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105990/profile",
      "Content": "Sep 10, 2010 04:23AM - edited Sep 10, 2010 06:12AM by CHRISCPA Hi, everyone.  I have been following posts for more than a month without posting. Beginning to feel like a stalker.  I can't begin to tell you how encouraged I have been by all your sharing. Everyone time I have a SE I check the postings.  My heart goes out to all of you who have young children to care for.  I had my 1st TC on Aug 26 with 3 more to follow.  I had already completed internal rad when med onc wanted to add chemo.  Complete shock to my system. Did want to respond to all the port postings.  Not all surgeons use the local or twilight sleep.  My surgeon said that the port was too close to heart and lungs to mess with and only uses regular anesthia.  She said that she wasn't willing to take the chance that a patient would move with other options.",
      "MessageIndex": 1445,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "CHRISCPA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105990/profile",
      "Content": "Sep 11, 2010 08:54AM CHRISCPA wrote: Still lurking.  I asked about Claritin vs Zyrtec at my onc ofc.  Nurse said Zyrtec is the same as Claritin with more ingredients so they can charge you more.She said either one would do the same thing.",
      "MessageIndex": 1496,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "CHRISCPA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105990/profile",
      "Content": "Oct 18, 2010 12:15PM CHRISCPA wrote: Wherria,  I am on TCx4 and more than 4 was never discussed.  I am stage 1 grade 1 although based on oncotype (21) onco said more likel grade 2.  THere is a thread of \"anyone just on Taxotere and Cytoxan\".  You might post there and see what that group has. Second opinions are always good.  Taking someone with you to your own onco is also a good idea.  My DH definitely hears and interprets things differently than I do.  As for your insurance doctors get approval for based on their own medical procedures all the time.  My insurance declined a PET scan and the onco had it approved within 48 hours its was approved. ",
      "MessageIndex": 2466,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "CHRISCPA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105990/profile",
      "Content": "Sep 16, 2010 06:46AM CHRISCPA wrote: Still lurking, maybe I will lose that status one of these day.  I too am on TCx4 and very mild SEs after tx 1.    I did ice my hands during the Taxotere but not my toes.  Both are just fine so far. My biggest SEs were the shoulder pain from the Neulasta and the sleeplessness during the decadron.  I have worked every day but went home early the first 3 or 4 days to take a nap ( no wonder I couldn't sleep at night) I started losing my hair last Thurs, 2 wks after tx 1.  I have short thin hair and by Sun. it was awful.  My hairdresser (also went with me to buy wig) met me at her shop Sun pm and buzzed it off.  I am wearing a wig because I go to my office each day and I don't want to deal with the clients knowing that much of my personal business.  I am very glad to get home and take it off.  It is above 100 degrees here this week and it is warm.  It still feels funny but I am getting a little more comfortable each day. I have 2 daughters getting married in Oct.  6 days apart and my sister said she wanted me to look nice for the weddings so she paid for a good wig.  My best church friend didn't know I had on a wig until I told her.  I also attended the LGFB class this week and it was great.  Learned alot, maybe I will be able to look good for the weddings. My 2tx is tomorrow I hope it is as uneventful as the 1st. Question for those with a port.  The nurses told me they are going to spray numbing solution on port before  accessing.  Does anyone else have this instead of the emla cream in advance?  Just curious if this works well.  My port is low on chest andin breast tissue and the nurse from last time told me to be sure to tell them to use 1 inch needle for access.  The surgeon left it accessed at surgery so this will be first access for chemo. Calamtykel:  My port was really uncomfortable for the first couple of weeks but it is finally getting better.  I had the port put in and then chemo the next day.  It probably would have helped to have some healing time in between.  Lizzyattheshore: I just finished all my Corp tax returns.  Need 2 more signatures then I am out of here.",
      "MessageIndex": 1659,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    }
  ]
}