{
  "AuthorID": "christinaro…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
  "Posts": [
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Jul 14, 2017 07:02PM christinarose wrote: mqara, thx for the recommendation. I'm going to order it. My RO hasn't specifically told me no deodorant so I've been using Secret invisible deodorant, in hopes they won't notice and say something about not wearing deodorant. My rebellious nature follows me everywhere, even through cancer treatment! Haha",
      "MessageIndex": 33,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 8, 2017 06:12PM christinarose wrote: I finished a week ago. I wanted to post updates to this thread but pain and exhaustion kept me limited to doing nothing extracurricular. I was reading all of your posts though and have been praying for you all as we go through this together. By my last treatment I was peeled, red and even my blisters had blisters. Also swollen. I had been using aquaphor regularly, and Aloe Vera. The pain has continued after treatments but now at one week out I feel like I'm actually healing. The fatigue has lifted too, for the most part. At the beginning of week 3 my RO gave me a lidocaine/aquaphor cream which helped a lot. The day after my last treatment I saw my MO and she prescribed me a big bottle of hydrocodone which was a lifesaver. I was off work the last week of treatments. I went back to work three days after my last treatment and it was awful, even with all the meds and cream.If I could change anything I would've taken the last two weeks of rads plus a full week after off. But it's just so hard to plan time off when you don't know how you'll react.",
      "MessageIndex": 112,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 12, 2017 03:28PM christinarose wrote: I think it's odd that while all of our radiation oncs have different advice about lotions and whatnot, they all seem to be in agreement about denying certain side effects which obviously are pretty common from all the reading I've been doing on this and a few other boards. I was reading through some of my medical papers this morning and after my last treatment the RO wrote that my side effects from treatment were fatigue and \"some skin irritation\". Call me a drama queen but my breast was at least two cup sizes bigger from the swelling and I was blistered, peeling, bright red. Some skin irritation just doesn't seem accurate to me but what do I know? ML- I need to update my settings. I was supposed to start the tamoxifen right after rads but when my MO saw me she decided I needed a month to heal and then I'll start. She gave me a big bottle of hydrocodone instead of tamoxifen- not gonna lie that was a nice surprise :) I am really nervous about starting it but of course the thought of not being here for my kids and grandson (and hopefully future grandkids) makes me believe that it will be worth the side effects. ",
      "MessageIndex": 131,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 19, 2017 09:33AM christinarose wrote: congrats to you also, prue!!! Glad to hear your skin held up so well",
      "MessageIndex": 157,
      "PostDate": "19/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Jul 14, 2017 11:04PM christinarose wrote: Hi all! Hope you don't mind if I join you. I started a four week treatment course on July 5th. Had my 8th treatment today. I've been pink and getting pinker since day three. My boob, which was big to begin with is swollen and tender to the touch. I drive 100 miles each way to the treatment center and then go straight to work in a hot kitchen most days. This is exhausting!! 12 more to go, can't wait to be done!! Hang in there everyone!!",
      "MessageIndex": 28,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Jul 18, 2017 02:53PM christinarose wrote: snowflake, I hope you got good test results. That's been the worst part of all of this for me. I hate waiting for answers and wondering about all the possibilities. Mqara, I'm sorry! I have sensitive skin too and am afraid I'll end up with blisters. Snowflake, I was kind of told the same thing. That lotions don't prevent the burn, but keeping the skin hydrated supposedly makes it heal better. Not sure what to believe, I read and hear so much contradicting stuff. I hit the half-way mark today with treatment 10. Getting darker pink, swollen, hot to the touch. Also every day in a little more tired. My RO said I have fluid build up causing the swelling and told me I need to wear a bra 24/7 to help force it out. The rads tech told me to not wear a bra as much as possible to help with the skin burns. If I have to pick one or the other to alleviate I'm going with the skin burn.",
      "MessageIndex": 41,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 11, 2017 08:55AM christinarose wrote: oldenough- I had 20 treatments. It's a shorter time period but doses are higher so from what I understand you still get the benefit of the longer treatments, but don't need as many appointments. It's a 200 mile round trip for me so it worked out good for me this way. I had 0 lymph nodes and clear margins. Tumor was 1.8cm, I didn't have to do chemo but radiation was never really in question. Everyone on my team recommended it. Are you not having chemo? I was told that if I had lymph nose involvement, or if my tumor would have been 2 or more cm, or if my oncotype score would've been 18 or higher that I would've had to do chemo as well. I felt very lucky to come under on all of those. Maybe age plays into it? I'm 41, which they consider young, even though I'm a grandma! Lo Dizzy- my skin broke down really bad. The last week was pure agony, no sleeping, fever, blisters, rawness, etc. after my last treatment the pain continued at that rate for 4-5 days then plateaued. After a week it was improving and now at ten days out I feel so much better. Still have healing to do but nowhere near the pain I was in before. Hang in there! You're almost there!! Congrats on being done, Joanie!!",
      "MessageIndex": 125,
      "PostDate": "11/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 12, 2017 03:31PM christinarose wrote: it looked different every day but this is part of my breast on day 18 of 20. ",
      "MessageIndex": 132,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 13, 2017 09:42AM christinarose wrote: No bolus for me. 16 whole beast sessions and the 4 boosts to the cancer bed, which was right above the nipple. Hap, I did take whole breast pictures almost every day for the last couple weeks. Not sure if I'll confront my RO. He's young and arrogant and I'd just as soon not be talked down to by someone like that. I could be wrong, but I think he is somewhat ignorant. I am very fair skinned, which you could obviously see just by looking at me. At my consult before starting I told him I was worried because I have really sensitive skin and I burn quickly in the sun even when using sunscreen. He brushed my comments off as not concerning, and then he told me that he actually sees more radiation skin reactions on black and Mexican women than fair skinned women. Everything I've read online contradicts that. I would have switched to another RO but we are rural so I would've had to drive 3 more hours each way to the next closest cancer center. I started putting aquaphor healing ointment on twice a day one week prior to starting radiation. I continued that but added Vaseline intensive therapy with Aloe at least twice a day when I started treatments. These were both recommended by my RO. I showered every morning before treatments and never applied the lotions until after treatment. A week before I was done I was given a lidocaine/aquaphor mixture to help numb the burned areas.",
      "MessageIndex": 136,
      "PostDate": "13/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 13, 2017 09:52AM christinarose wrote: mamaOz- I didn't mean to scare you. From what I understand my reaction is not common. I honestly don't know anyone with skin as sensitive and easy to burn as mine. I have to wear a hoodie with the hood up in 90 degree weather just to keep my skin from burning while I'm watching my son play baseball. I buy really strong sunscreen and apply it every twenty minutes and still burn. I never go out in the sun anymoreunless I have a good reason.",
      "MessageIndex": 138,
      "PostDate": "13/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 13, 2017 09:56AM christinarose wrote: I asked my MO for silvadene and she said it's not good to put it on open wounds so she didn't give me an. One more issue that seems to be really inconsistent among our providers...",
      "MessageIndex": 139,
      "PostDate": "13/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Jul 15, 2017 09:18AM christinarose wrote: so true! Thx for the recommendations :)",
      "MessageIndex": 35,
      "PostDate": "15/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Jul 24, 2017 04:27PM christinarose wrote: mquara, I'm really sorry! :(",
      "MessageIndex": 63,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 13, 2017 09:45AM christinarose wrote: Almost forgot, I also started using bacitracin and neosporin on any part of the breast where my skin was raw. I was very scared of infection so I took extra care to keep the area clean and covered with antibiotics mqara- I'm glad you're starting to heal. I have been really happy with how fast the healing process has gone for me.",
      "MessageIndex": 137,
      "PostDate": "13/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Jul 24, 2017 07:17AM christinarose wrote: I'm with you all on the emotional stuff!! I am fatigued and not always winded but I noticed I was winded yesterday morning after walking upstairs. And lucky me, I now have blisters. It hurts and itches like crazy. My 14th treatment is today and I'm going to ask for a prescription. I'm also going to ask for a note to stop working til I'm done. It's getting to be too much and I started making some stupid mistakes last week that I know are because I'm so tired. I don't want to risk doing something that'll get me fired. Welcome to those who are just starting. I wish all of us didn't have to be here.",
      "MessageIndex": 59,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Jul 15, 2017 01:59AM christinarose wrote: Thanks ML. I did get some cornstarch but haven't tried it yet. Do you feel like it keeps you dry and helps with body odor?I wouldn't be so concerned about that but I work in a hot kitchen and one of my assistants is almost always beside me. I don't want to pick up any new nicknames associated with body odor if I can help it!!",
      "MessageIndex": 30,
      "PostDate": "15/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Jul 16, 2017 07:09AM christinarose wrote: Thx for the info, llamalady, and HUGE congrats to you on being done!!! :",
      "MessageIndex": 37,
      "PostDate": "16/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 9, 2017 04:04PM christinarose wrote: oldenough, that sounds awful! I agree with hapb. My rad nurse mixed lidocaine with aquaphor for me and that has been really helpful for pain and itching relief. I also got hydrocodone from my MO which helped with the pain from swelling and with that I was finally able to get some sleep. Im really sorry. I feel so bad for you. :(",
      "MessageIndex": 116,
      "PostDate": "09/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 12, 2017 09:09AM - edited Aug 12, 2017 09:12AM by christinarose ML- Congrats on being done!!! Such a good feeling. Hap- my RO encouraged me to use aquaphor and Vaseline intensive care with Aloein it. He said to use it at least three times a day, but not before the treatments. Obviously we are all different so there's no way of knowing for sure if that intensified the burn but it didn't seem to help! I never had tinnitus but after almostevery treatment I had a strange lightheaded/foggy sensation that would set in about thirty minutes after treatment and last a few minutes. I never mentioned it to anyone cuz I figured they'd say it was in my head, andyes, it was! Haha",
      "MessageIndex": 128,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 13, 2017 01:23PM - edited Aug 13, 2017 01:25PM by christinarose mqara, that's what I thought too. My onc nurse told me I should ask my MO for it and when I did that's what she said. Thankfully I'm healing fine without it but I'm definitely confused by all the different medical advice from our doctors. It's not like breast cancer and radiation are new to the medical community. Hap, hopefully I won't go through this again but if I do I will definitely make the trip to a different RO. On the bright side the healing process has been fast for m. The redness has faded to a light pink and all but about two inches of the open wounds are completely healed. There is still some swelling but that's down quite a bit too. ",
      "MessageIndex": 142,
      "PostDate": "13/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Aug 19, 2017 09:31AM - edited Aug 19, 2017 09:32AM by christinarose Hap- I used the lidocaine/aquaphor cream whe I got itchy. It was great!! You are almost done, yay!!! ML- I am so sorry you had to go through that with your young son. My MIL lost her son at 8 after years of fighting brain cancer. The stories she told (before she passed away six years ago) were heart wrenching. I hope and pray your son is well today. As far as work, I had to go back three days after my last treatment. I was not at all ready but we are short handed and I'm an essential position so if I didn't go back one of my already overworked coworkers would have been screwed. So I sucked it up and I survived but in a perfect world I would've taken ten days after because that's when I finally felt almost human again. Dizzy- congrats on finishing!!! Hopefully the healing will go quickly for you.",
      "MessageIndex": 156,
      "PostDate": "19/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Jul 14, 2017 07:51PM christinarose wrote: 41",
      "MessageIndex": 758,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "christinaro…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253018/profile",
      "Content": "Jul 14, 2017 05:31PM christinarose wrote: One of the info sheets I have from my radiologist says that cancer treatments like chemo, radiation and a few others can cause anemia, which of course leads to fatigue.",
      "MessageIndex": 3,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856885",
      "Title": "Anemia During/After Radiation Peetie1 Peetie1"
    }
  ]
}