{
  "AuthorID": "christina00…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
  "Posts": [
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 19, 2012 08:51AM christina0001 wrote: Just wanted to pop in and wish all you ladies (maybe guys too!) well. I finished chemo in late May. The road is long but you will get there. Sending prayers and good vibes that you have few side effects and that the good days outnumber the hard ones.",
      "MessageIndex": 738,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 28, 2012 02:00AM christina0001 wrote: Abby, just wanted to welcome you although I am sorry you have to be here. I am 33, HER2+ as well. For me, I think herceptin is a wonder drug. I have been taking it for 6 months now and have had zero side effects from it. DH and I were planning on starting a family towards the end of this year, and this aspect of things has been harder than anything chemo or surgery has been, without question. We are tentatively discussing adoption after we get through this, but dealing with cancer right now makes it difficult to discuss too much. Gotta get through this part first. Treatment seems impossible but you WILL get through it. We all are or have! The first part, dealing with the diagnosis AND getting through endless tests, waiting for results, etc. is the worst. We are here for you, keep us posted on how you are doing.",
      "MessageIndex": 39,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/791017",
      "Title": "I am so scared Abby20 kathleen1966"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Mar 4, 2012 05:23PM christina0001 wrote: So sorry you are going through this. But glad to hear you are surrounded by supportive family and friends. Take a deep breath - it's a wicked emotional roller coaster ride at times.",
      "MessageIndex": 17,
      "PostDate": "04/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/783538",
      "Title": "The now official diagnosis IndigoMont11 Iz_and_Lys_Mum"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 12, 2018 09:16AM christina0001 wrote: That first week or so after diagnosis was the worst for me. I have never had anxiety like that before and I hope I never do again. My oncologist at some point gave me a prescription for Ativan for anxiety and it really did help in those early days. You are wise to keep as busy as possible but I know it's impossible to be busy all the time and the nights can be so hard! It WILL get better. Good luck!",
      "MessageIndex": 9,
      "PostDate": "12/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868282",
      "Title": "Just diagnosed and scared Maggie0626 Maggie0626"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 10, 2013 04:54PM christina0001 wrote: Yes I was cold during chemo too! My cancer center kept heated blankets on hand for this very reason and they were wonderful! I would also recommend dressing in comfy warm layers and perhaps drinking a hot beverage during treatment. If it's really bad a warm hat/gloves/scarf would help too.",
      "MessageIndex": 2,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/811858",
      "Title": "What to do: Cold during Chemo? del3 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Dec 15, 2012 06:21AM christina0001 wrote: I had swelling after my 5th and 6th treatments, so not entirely abnormal. It sounds like your onc is on the ball and keeping an eye on things. In the meantime, watch your salt intake, and try to prop your feet up regularly. I slept with a pillow under my feet and that seemed to help.",
      "MessageIndex": 1,
      "PostDate": "15/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/797639",
      "Title": "Swelling in hands and feet Richa Richa"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 27, 2012 01:38PM christina0001 wrote: Welcome Susan although I am sorry you have to be here. I ordered my wigs and halo hairpieces, as well as headscarves and hats, from here: http://www.tlcdirect.org/. The wigs get old real fast...I hate them. I wear a halo hairpiece and scarves or hats at work, and just scarves the rest of the time. Click on \"My Profile\" at the top rightside of this page, and then check out options \"My Diagnosis\" and \"My Treatments\" to add information to your profile that will appear at the end of your post. You will be given the option to have this information shown publically or kept private; choose public if you want it to appear at the end of your posts. Lorazepam is a godsend. Marijuana would probably be just as good but it's not legal here in Missouri. Congrats on the new job, and losing the bum of a husband. My first husband was a jerk. Life is too short for that... You sound like you have a great attitude about all this, which is awesome! Feel free to lean us on for emotional support. We all have good and bad days. This is not an easy road to travel - but you can do it.",
      "MessageIndex": 24,
      "PostDate": "27/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790928",
      "Title": "New and Terrified SusanHG123 lauta"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Feb 2, 2014 03:22PM christina0001 wrote: I was in chemopause for 22 months. Not five years like you though. My ob/gyn tested my hormones six months before my cycle restarted and told me that I was not menopausal and that I would almost definitely get my period again at some point. I was skeptical until it actually happened! I am glad to have it again... no I did not miss aunt Flo, but chemo did a number on my female parts and it is such a relief that they are basically back to normal at this point.",
      "MessageIndex": 1,
      "PostDate": "02/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/817528",
      "Title": "Recovering from Chemopause - 5 years later??!! Suzy480 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 25, 2012 06:43AM christina0001 wrote: Four weeks out and I was still far from feeling \"normal.\" It took about that long to start to feel like I was moving towards normal. My last chemo was around Memorial Day and I still have some minor aches and joint pain, but it is not a big deal, doesn't slow me down one bit. That's great that you are four weeks out - it is all downhill from here! Congrats!",
      "MessageIndex": 4,
      "PostDate": "25/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796803",
      "Title": "4 weeks post Chemo... what is normal? Camillia ruthbru"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 18, 2013 11:08AM christina0001 wrote: Mammos are definitely not 100%. I think breast self-exams and exams by your healthcare provider are the most valuable tool. I would never dissuade anyone from getting mammos. Having said that, my mother hates them, her breast cancer was not seen on her mammo either (her breasts are quite dense), and her doctornow has her ultrasounded instead annually. I can't imagine your frustration at this, especially having been through this once before.",
      "MessageIndex": 4,
      "PostDate": "18/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/809508",
      "Title": "Mammogram/Radiologist did not see cancer - anyone else? Del5 Calameda"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Apr 16, 2012 05:50PM christina0001 wrote: Welcome, although I'm sorry you have to be here. Denise and momandtwokids have some great advice. It sounds like you are eager to get started on treatment, which is great! I would encourage you to not make any rush decisions, and consider consulting with an oncologist too before deciding on a course of treatment. You WILL get through this.",
      "MessageIndex": 4,
      "PostDate": "16/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785915",
      "Title": "Questions for 1st Dr Visit jcgibson christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 7, 2013 06:01AM christina0001 wrote: Lots of great suggestions here! It was a very difficult choice for me, but after 3 doctors all recommended mastectomy, I knew it was the right thing to do. ",
      "MessageIndex": 15,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808846",
      "Title": "How did you decide on lumpectomy or mastectomy/ livingwithit IrishDancingMom"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 6, 2012 11:34AM christina0001 wrote: I'm getting herceptin. I have had zero SEs from it. My onc has me do an echo every three months and that is pretty easy. I don't know what a MUGA involves but you might want to ask about having an echo instead if you aren't crazy about a MUGA.",
      "MessageIndex": 7,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/794433",
      "Title": "I'm just diagnosed Pbrain craftybiatchy"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jan 14, 2013 05:34PM christina0001 wrote: Wow, you go girl!",
      "MessageIndex": 1,
      "PostDate": "14/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/798853",
      "Title": "scuba diving after chemotherapy? charlotte14 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 28, 2012 07:10PM christina0001 wrote: Totally normal. When I finished chemo I thought I would feel happy but instead I felt so depressed. The fight was over. Did it work? Who knows. I am still getting herceptin and it is my emotional lifeline. I have a lot of faith that it is saving my life. I have no doubt I will be devastated when it ends. Sometimes I still wish I were getting chemo, as crazy as that sounds.",
      "MessageIndex": 9,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792658",
      "Title": "End of treatment blues?? karebear76 Moonflwr912"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Apr 1, 2012 12:02PM christina0001 wrote: Welcome! Sorry you have to be here, but I hope you find this site as helpful as I have through all this. Take it day by day, hour by hour...give yourself permission to change your mind multiple times over the next week! I was given that choice too, although I don't have to decide for sure until I am done with chemo, which won't be until late May. What is right for me, may not be right for you, but I am going with the lumpectomy + radiation. I don't want to deal with the afteraffects of a mastectomy, it sounds more difficult to me and I'm a big baby with stuff like this. Definitely check out the link Moderators posted...lots of good info.",
      "MessageIndex": 4,
      "PostDate": "01/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/784953",
      "Title": "Surgery Options Moonwillow1010 dobie"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 8, 2012 06:22PM christina0001 wrote:",
      "MessageIndex": 12,
      "PostDate": "08/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 18, 2012 06:44PM christina0001 wrote: Welcome Jilly. No advice from me about reconstruction options; I am trying to figure that out myself. But don't be too scared of chemo. Chemo is not easy but it was definitely not as bad as I was afraid it would be. I hope you will check out the chemo subforum if you have not already. It was a huge help to me, to get through it. Trinity I have that same problem. I can't sleep. I'm either wide awake or absolutely exhausted. Tomorrow I see my onc or his PA or NP during herceptin and I am going to ask about a sleep aid. I have not had a full night's sleep in months. It is DEFINITELY stress. marilyn - if you figure out how to not worry, please let us all know!",
      "MessageIndex": 94,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 19, 2012 05:48PM christina0001 wrote: Welcome howhm02l and Staceynan. It's definitely not too late to join.  Stacey I was open to have a prophelactic (sp) mx of my \"good\" breast but my onc said, for me, there was no medical benefit to it. So I am going to \"keep\" my good breast...I know my reconstructed breast may not match it exactly but I enjoy having sensation in my breast and I like the idea of at least one of my breasts having feeling and sensation.",
      "MessageIndex": 113,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 23, 2012 08:05PM christina0001 wrote: jap62 - if you are not 100% comfortable with your decision, please consider going for a second opinion. This is too important to have doubts or regrets. Trailgirl - anxious over here too. My date is the 10th. We are less than 3 weeks away.",
      "MessageIndex": 167,
      "PostDate": "23/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 1, 2012 06:33PM christina0001 wrote: I have not been on in a few days, but I have been thinking of you all.  Marilyn - so glad you have gotten through surgery okay. I hope your recovery is fast and smooth. Beckers - I hope your scan comes out okay. mlo69 - can totally relate to being tired of being moody...I am so sick of myself at times. Found out I'm going to need rads after surgery after all. So sad and disappointed. Nervous about surgery...tazzy you keep your positive posts coming girl, they do help!",
      "MessageIndex": 291,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 13, 2012 06:30PM christina0001 wrote: damiana - I'm sorry your visit to the chemo room was such a bummer. I felt the same way the first time or two I went. Hopefullly eventually you will find people there who don't look like the face of death. It was depressing. It's funny to hear some of you worry about chemo. I'm all done with chemo...you ladies will get through it too. I promise, while it's not easy, you will get through it.",
      "MessageIndex": 674,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 14, 2012 08:11AM - edited Aug 14, 2012 08:13AM by christina0001 summer - The beginning is the hardest part. For several weeks after being diagnosed, I could not understand how the women here could seem to have it all so together. The first several weeks were dark and scary...I still have moments like that now, and it's not easy, but it DEFINITELY gets easier, I promise you. Please know that we are here for you anytime. Chemo is not fun...but it is not the horror they portray on TV, in the movies, etc. I continued to work full time and go to school part time through it all. It is definitely doable. And now I am recovering myself from a rightside mastectomy, that I had this past Friday. No reconstruction for me until next year. Oh I'm having my pity party moments too...there's no shame in them. I don't think it's good to hold these feelings in, just let them out! So glad to hear you are blessed with a loving daughter. Don't fear that men will be scared or turned off by what you are going through now. A good man with a good heart will love you no matter what. I have been scared and sad that my DH has had to see me with no hair, swollen from steroids, and eventually missing a breast (I have not shown him yet). But I know he loves me, and he's not the only good one out there. You will find one too. Hang in there...come here to chat anytime. I think I would have gone insane if it were not for the chemo thread support group I was (and still am) in during chemo. It's so nice to talk with people who understand. shabby - thinking about you, praying for you! I hope you bounce right back after surgery. markat - heck yes, I always went to chemo with makeup and jewelry on, and dressed nicely. I went out and bought nice new comfy workout-type outfits just for chemo treatment days; they were nice for other medical appointments too. After I didn't have hair I would wear a nice scarf. And my experience was similar to Carrie's, I had plenty of good days in between treatments. Felt depressed all day yesterday and had a couple of long cries last night. Today I am feeling significantly better. *phew* Just relaxing this morning, and mom and I will run out to do errands this afternoon. I ordered another camisole from tcldirect. Figured I'll need more than one and my insurance only covered one, and to buy another was $65. TLC was about $35 with shipping.",
      "MessageIndex": 685,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 18, 2012 11:32AM christina0001 wrote: 301724, HMP23lnd, dc126 - hope you are taking it easy and recovering well. damiana - Long chemo days...where I had mine done they had free WiFi so I played online most of the time. If they don't have WiFi or if that's not your thing, definitely bring a book or something to do. omeggo - so sorry to hear about your nipple, but VERY happy that your nodes were clean. That is wonderful news! mumtothree - I hope you feel better. howhm - I did not really have much numbness at all after my SNB, and felt normal within a week or two. I had 7 nodes removed, if that makes a difference. shabby - OMG! That's crazy (about the car accident)! Thank goodness you weren't hurt. Crossing my fingers that your path results come out good. The waiting is torture... Trinity - why are you not able to use deodorant? I'm able to get mine on without getting near my surgical site...maybe your incision is higher into your underarm than mine. Elise - sorry to hear about your nipple.  You have such a great attitude. Got my drain out yesterday. It did hurt some but not as bad as I thought. But 20-30 minutes later, WOW did it hurt! Pulled out my hydrocodone from port surgery and used that for the rest of the day to keep it under control. I'm back to just tylenol today. The surgeon said he doesn't have my final pathology report in yet, but he spoke with the pathologist and they had found nothing so far, which was great news. The only downside of the visit was I brought up reconstruction to the surgeon. He is an older fellow, and a great surgeon, but apparently he is pro-implants. I am interested in having a DIEP and while he was respectful of that, he basically said he thinks to go through that big of a surgery for a new breast is risky. It kind of scared my DH and mom, who went with me to the visit. I appreciate that he was respectful but I was (and am) really annoyed. I guess he has every right to give his professional opinion (that's why I'm talking to him about it, after all) but it frustrated me that he alarmed them. I think implants are great, but just not the right choice for me.",
      "MessageIndex": 811,
      "PostDate": "18/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 9, 2012 05:55PM christina0001 wrote: Thanks for all the well-wishes for tomorrow. Sorry I have not been on more. This is a busy board! :)",
      "MessageIndex": 540,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 13, 2012 12:21PM christina0001 wrote: cottontail - I had a lumpectomy + sentinal lymph node biopsy and for me the pain was not bad at all. I think I only took rx pain pills for a few days at most. I hope your recovery is as fast. I can't imagine needing to stay overnight at the hospital for it, unless you are having more lymph nodes out than I did. Tazzy - wow, that sounds scary. Definitely go back tomorrow! Elocin - welcome, and good luck to you on the 17th. Let us know how it goes. I picked up my camisole today from the fitter, which is lovely. So nice to not have to pin my drain, and I like that I have a normal shape again thanks to the foob. Still just taking tylenol as needed. I don't take any special vitamins or anything and I am really not sure why I am not having any pain hardly from the UMX. I wonder if the nerves are numb, but I don't feel numb. I made my appointment with the PS for a DIEP consult for November 26th, which was the first available, which is fine by me, I don't want to have reconstructive surgery until next spring/summer anyway. Can't wait to get this drain out on Friday. I was getting about 20mL out every 12 hours but this morning it was only 10 mL. Does anyone know what is normal, are these okay amounts? Just curious.",
      "MessageIndex": 663,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 25, 2012 02:01PM christina0001 wrote: cottontail, you get whatever bra you think will work best. You're the one that is going to have to wear it after all. I am so much more comfortable not wearing a camisole with my pillow boob. But then of course I am (in my mind) noticeably uneven. I have a few shirts where it's not too noticeable, but not many. I hate looking this way. Is anyone else struggling emotionally with how they look, post-mastectomy?",
      "MessageIndex": 1024,
      "PostDate": "25/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 11, 2012 05:55AM christina0001 wrote: My simple UMX went very well yesterday. My pain is really minimal; I asked to switch from morphine to tylenol last night and the tylenol has been very effective. The drain does gross me out a bit but it's not as bad as I thought it would be. I did not plan on looking at my surgery for a long time but they showed me where the drain is in my bandage, and the bandage is not nearly as large as I thought it would be and it does not leave much to the imagination. But it was not really upsetting to me like I thought it would be, at least not at this point. Now I am waiting to be seen by the occupational therapist, and I should be going home at some point today. The hospital staff have been great, the room is very nice and I could not have asked for a better stay. Thanks for all the kind words of support. I hope everyone who has had their surgery is recovering well, and those who are waiting, are not too worried or anxious. I know I was much more worried than necessary.",
      "MessageIndex": 603,
      "PostDate": "11/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 11, 2012 02:01PM christina0001 wrote: Wow, go damiana! That's great! Britishlass - glad you got to keep the mole. Sometimes the little things make all the difference.",
      "MessageIndex": 612,
      "PostDate": "11/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 16, 2012 02:44PM christina0001 wrote: justegan - glad you are recovering well but sorry to hear that having the drains removed hurt so much! I did chemo through school (grad school, part time) and working full time...it is not easy but it is doable. blessings - I did take a hot (albeit shallow) bath. I'll take a cooler one tonight and see if that helps. I got dizzy again last night after bathing so I bet you are right. Thanks! Marian - welcome! The waiting is the worst part. mooleen - enjoy the mani/pedi! That sounds so nice. I am so nervous to get my drain out tomorrow, it sounds like it really hurt for a lot of you! But I hate the darn thing, I don't care how bad it hurts, I want it OUT!",
      "MessageIndex": 747,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 6, 2012 05:33PM christina0001 wrote: Count me in too. I am scheduled for a UMX on August 10th. I am a bundle of nerves over it. I'm not getting immediate reconstruction. Whether or not I get rads will be based on whether or not my margins are clear. My surgeon and my onc are worried that they will not be clear, but I met with the rad onc and he was much more confident that they would be clear. So who knows. I tried to schedule a consult with a PS to learn about reconstruction, but I just can't handle it right now. I would think I would be excited about that part, but I'm not. And I already have so many appointments going on. I think I am going to wait until the UMX, and then consult with a couple different PSs. I'm overwhelmed about what to buy to prepare for the UMX. There are lists here on the website and there's just too much. No one needs all that stuff. It was the same way with chemo. There were tons of lists of what to buy to prepare for chemo; I bought about 50% of what was on the list and used about 1/3 of it. If anyone has any reasonable advice, I am all ears!",
      "MessageIndex": 10,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 13, 2012 07:48PM christina0001 wrote: Trinity - oh, wow, so much to cope with at once! It must be so frustrating to not be able to drive. Thanks loriio for popping in and giving support. It's hard to even imagine being on \"the other side\" right now.  omeggo - glad you found us over here. damiana - you mentioned a woman's image...could this do any more to our self-image? I have scars from the SNL and lumpectomy, I'm getting a UMX, I have as much hair on my head as a kiwi, my eyebrows and lashes are thin, and I gained 12 lbs while doing chemo. I have a port under my skin and there's a scar there too. I won't even go into the sexual side effects from chemo... Oh and my feet have gone up 1/2 size. I like to joke that they're going to invent a new breast cancer treatment and it will be great, except that it will turn our teeth brown and make our ears pointy... ugh! But all things come to pass, right? I splurged and bought the entire Sex & The City series on DVD and I'm going to watch every episode while I recover from the UMX.",
      "MessageIndex": 53,
      "PostDate": "13/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 19, 2012 05:51PM christina0001 wrote: Oh someone mentioned sleep. I haven't slept well in weeks, maybe months. I finally spoke to the NP today about it when I went in for my herceptin. She recommended trying melotonin so I am going to start that tonight.",
      "MessageIndex": 114,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 23, 2012 06:32PM christina0001 wrote: Tazzy - awesome news, congrats! gmafoley - LOVE the kitty pic! blessings - happy for you, enjoy those squishies (when you are up to it) HMP12 - so glad your nodes were clear. I did TC (+H) x 6. It is doable. Just take care of yourself and you will get through it. omeggo - I hope you are recovering well from surgery. Sorry that the cancer was so spread out, but grateful that they got it all. That is what is important. I got my final path report yesterday and NED. I know it's terrible to feel this way but it just made me regret getting the UMX. I know the doctors recommended the UMX vs. re-excision due to risk of reoccurance but it still makes me angry that I had a \"good\" breast removed. This is really hard to deal with. Getting diagnosed was hard too but that slowly got better over time. I hope this does too.",
      "MessageIndex": 996,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 24, 2012 09:25PM christina0001 wrote: OM12 - so happy for you! that's great! nbnotes - sorry you are hurting.  Take it easy and keep taking those pain pills. shabby - I had MAJOR fatigue after surgery. Almost as bad as chemo sometimes. I started to take a flintstone's chewable multivitamin, and started feeling better 2 days later. Could be a coincidence? but if you aren't taking a multivitamin, you might try one. I normally don't because vitamins tend to upset my stomach. But I tried a children's one and that has worked fine for me. Truly I have felt a big difference. omeggo - ditto tazzy, if they haven't been through it then they aren't going to get it. Maybe they will understand better if you explain that unfortunately the cancer was found to have progressed some, but is still in a relatively early stage? When do you get your drain out? I can't imagine having one for 9 days. I had mine for a week and that about drove me nuts. (\"Short trip\" my husband would say to that.)",
      "MessageIndex": 1014,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 7, 2012 06:54PM christina0001 wrote: Sorry I have not been on much. I am so glad to hear that so many of you have gone through surgery with relative ease. I hope everyone is healing well. I'm a nervous wreck for my UMX on Friday. Tearful, cranky, moody, oversensitive...just trying to keep my mouth shut. No need to start a fight with everyone.",
      "MessageIndex": 467,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 12, 2012 08:31AM christina0001 wrote: lol @ ottawamom12! trailgirl - that sounds so scary. Glad you are doing better now. melmcbee - I have heard of people starting chemo within a couple of days after having their port put in. I started chemo about 5 days later. Having said that, my port incision never healed well and eventually I had to have it replaced. cspreng73 - good luck tomorrow! I bet you will blow right through your lx and SLB. Sending prayers and good vibes your way for strength and healing. shabby - what timing.  Hopefully the sore throat is nothing and it passes quickly. damiana - no advice, I don't have a TE, but I do hope the pain subsides quickly. I am doing great. Yesterday (the day after my UMX) I only took tylenol. At bedtime I took the diludid, because I was worried about pain during the night. That was a mistake. I'd never taken it before and it made me mildly nauseous. Today I have very minimal soreness. I'm going to take a couple of tylenol now but I can't believe it's 10:30am and haven't needed anything before now. Trying to remember to stretch my arm frequently; it does feel a little stiff. The drain is annoying and the hospital forget to order me my camisole, so I pinned the drain to my shirt yesterday and today I have it going into my sweatshort's pocket. I've had 20 mL every 12 hours come out. I don't know if that is good or not but it doesn't seem like much. DH and mom cannot believe I am feeling so good. I feel very blessed. If it weren't for my mom visiting, I would seriously be tempted to just go into work tomorrow, at least for a half of a day. I hope everyone has such a smooth recovery.",
      "MessageIndex": 637,
      "PostDate": "12/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 15, 2012 06:53PM christina0001 wrote: 301724 - you are right, and I feel bad for complaining about the meds, chemo and surgery I have had to deal with, because not having them at all would be far worse. Good luck tomorrow! tazzy - I'm only 5 days post-UMX but I am sleeping 9-10 hours a night when normally it's closer to 8-9 at most. I guess our bodies just need the extra rest right now. shabby and cassie - so glad your surgeries went well! littleredoregon - my surgeon initially did not want to send me to an oncologist. \"Eventually\" he said. Well screw that, I made myself an appointment with an oncologist who specialized in breast cancer and it was undoubtably the best thing I could have ever done. Every other professional I have dealth with on this journey has been EAGER to refer me to other specialists to make sure nothing is missed and that I am getting all that I need. Eventually I switched surgeons... anyway do not hesitate to find yourself a good oncologist and go for a consult. mumtothree - so glad you are recovering well from your surgery. Pretty incredible really! :) So today was day #5 since UMX and I am still feeling well. Taking tylenol about 3x day. Last night after bathing I felt really dizzy, lightheaded, and nauseaous. This continued off and on until well into the night. It wasn't super bad but definitely alarming. Not sure where that came from. My mother worried that maybe I did too much during the day. Anyway I did not have any of that today. My biggest annoyance is the bandage over the drainage site. It is itchy. I pried the bandage open a bit to get some air in there, and I'm trying to not get too hot. I can't wait to get this darn drain out on Friday. I hope everyone who has had surgery, is recovering well, and I hope those who are waiting for their surgeries are blessed with calmness, confidence and peace.",
      "MessageIndex": 720,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 19, 2012 09:13AM christina0001 wrote: Leah - that SUCKS, I can't believe they put you off until September!!! What is wrong with people!?!?! justegan - the tattoos are awesome, they brought tears to my eyes. What an amazing family you have. Cancer sucks but it has shown me many times, just how wonderful people can be. omeggo - got a chuckle reading about your DH. Men! Cherrie - wow, I'm so sorry to read that. I can't imagine how you must be feeling. Please let us know how your scans turn out. I hope they get scheduled quickly. cottontail - this is just my experience but looking up what to expect after these surgeries has been so overwhelming and every time, the reality was not half as bad. My lx was not a big deal at all (I was able to wear about half of my regular bras afterwards) but I had a SNB not a ALND. If your surgeon thinks it is appropriate, a camisole like I got after my UMX might be good. It is SO comfortable and has just the right amount of support for my \"good\" side that hasn't had any surgery, too. I just ordered another one from tlcdirect and I hope it's as good as what I got from the hospital. I hate bra shopping, it is such a PITA!",
      "MessageIndex": 839,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 11, 2012 07:51PM christina0001 wrote: damiana - I may try the unisom. I am really sleep deprived at this point. I am worried about a sleeping pill making me groggy but at this point it can't be worse than being as overtired as I feel. The wig party and the boobie cake sound great! How on earth do you focus if your doctor looks like Dr. McSteamy... tazzy - so happy to hear that the chemo is working! and I really appreciate all the information you posted. I am too overwhelmed to have questions, at least for right now, but please do continue to share your information. I'm glad you posted about getting button down pj's and tops because I forgot about that, and I have none. What do you mean by frontloaders for a bra? Welcome houndmommy and beckers! CJRT I wish I could take advantage of your offer but I'm probably a medium. That's nice of you to offer them to others here though, I am sure they will quickly find a happy home.",
      "MessageIndex": 26,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 12, 2012 02:59PM christina0001 wrote: tazzy thanks for putting the list together!",
      "MessageIndex": 35,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 22, 2012 04:53PM christina0001 wrote: daimiana - congrats on the good BRAC results! That's great news! I am struggling between implants and DIEP/SIEA and I think I am going to go with the DIEP/SIEA... definitely more intense up front but I am worried about having to replace implants multiple times over the course of my life. Heather, so sorry for your loss. There's never a good time to lose a pet but during this time is awful. Shabby - no clue what kind of tests you will need. Let us know please!",
      "MessageIndex": 160,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 28, 2012 09:39AM christina0001 wrote: Michelle - the ER is an awful place to go for pain management. You need a good doctor with an expertise in migraines. Boy you are really having a tough time - migraines, kidney stones, stroke symptoms! Ugh! I'm sorry but I had to chuckle about your mom's meeting with your daughters. That is SO something my mother would do. The women in my family are major butt-in-skis. You know in a sense she is right, all of us (even people without cancer) need to have arrangements made. No one wants to do it, but it does need to be done. I need to do it too. I had in my head that I would get a healthcare directive written out before my surgery but I haven't done it yet. Maybe you can surprise them and do one on your own (your hospital social work staff can help) and then you can tell them, at least that's done and you did it your way! Leah - I am also lucky to have a great DH who helps. We are blessed! I am so sorry you are having to go through MX #2. Tazzy - How did your appointment Friday go? Your husband sounds like a sweetheart! I hope you are having fun camping. Beckers - you bet I worry about all those tests finding something else, cancer somewhere else. My chest x-ray came out with a bunch of weird comments I did not understand. I asked onc what it all meant - he said it's not cancer so don't worry about it. !! Well okay I guess! marilyn - you have a great attitude. You are right, a year from now the recovery time won't matter, and we will have gotten through this. shabby - I am irritable too...when I'm not weepy...when I'm not distracted...omg I am moody! lol I would want to slap anyone that thinks the surgery we have to have is something to be excited about! I'm thinking about getting a DIEP for reconstruction surgery, and no, it's not for the sheer \"pleasure\" of having a tummy tuck! Seriously I would much rather have my own breast! lisag - wow, august will be one serious month for you. That stinks about your insurance; is there anything that can be done? So nervous about the 10th but trying to do lots of fun things in between. Had dinner with a friend Thursday night. Last night went to dinner and the new Spiderman movie with DH and his brother. Flying out to see my pregnant sister for 2 nights next Saturday through Monday. Mom is coming out the following Thursday, the day before UMX surgery! Looking forward to seeing her, have not seen her (except on Skype) in a year (we live 1500 miles apart!). Still need to get some button down tops. I worry about something different every day. Was worried about whether I would have a private room or not but I spoke with the manager of med/surg at the hospital and got promised a private room (most of the room are private rooms anyway). She is a breast cancer survivor (going through recon right now!) and gave me lots of helpful info and tips. Very reassuring! I hope everyone has a great weekend!",
      "MessageIndex": 216,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 9, 2012 05:31PM christina0001 wrote: Tazzy that would be great if you could share what your nurse navigator says. I feel like I don't know what to expect post-surgery or what to do to prepare. I'm losing my righty too! Anyone else dealing with anxiety? I just can't sleep. I sleep somewhat better if I take an Ativan at night but I hate to take pills...I try to not take it more than one or two nights a week. I feel okay until I lay down and it's quiet, and then all these overwhelming thoughts come into my head...",
      "MessageIndex": 15,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 15, 2012 07:28AM christina0001 wrote: keepmovingforward - my UMX is not until 2.5 months after I finished chemo. I wanted to wait until I finished my summer class, and my onc and my surgeon gave me the okay. If you are nervous, check with your surgeon and make sure it's okay, but I'm sure they would not have scheduled it that way if it were not safe for you.",
      "MessageIndex": 71,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 21, 2012 07:47AM christina0001 wrote: Trinity, I think we are going to get a recliner. Just in case. Will probably just buy a used one, and resell it afterwards. I hope you enjoy your massage! June, thanks for sharing your experience with us. Welcome, mooleen! I think the melatonin is helping. I'm only taking 3mg so far. I feel like I am sleeping a little deeper, and waking up less often. I've only taken it 2 nights though.",
      "MessageIndex": 139,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 10, 2013 04:37PM christina0001 wrote: I hope your first treatment went well! I hope you will consider joining the July 2013 chemo thread for support. :)",
      "MessageIndex": 2,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/807373",
      "Title": "Two days before chemo Viccha Maureen1"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 5, 2012 08:37AM christina0001 wrote: Thanks ladies! Good luck to you are well lifeonitsside!!! clearmarginsclearmarginsclearmarginsclearmargins!!! Please!!!",
      "MessageIndex": 6,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788549",
      "Title": "getting clear margins from re-excision christina0001 jazlaumir"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 4, 2012 08:23AM christina0001 wrote: Thanks for replying ladies. I am really stressing over this!",
      "MessageIndex": 3,
      "PostDate": "04/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788549",
      "Title": "getting clear margins from re-excision christina0001 jazlaumir"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 28, 2012 08:37AM christina0001 wrote: Why are you asking this? I would encourage you to perhaps instead focus on providing emotional support for your sister-in-law during this time, rather than question her choice and her medical team's choice of treatment. It is so frustrating to have to cope with breast cancer AND have laypeople question treatment choices. If your sister is having concerns or questions about her treatment, she might benefit from a second opinion. I saw two oncologists prior to starting treatment, and it gave me great peace of mind.",
      "MessageIndex": 2,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/791230",
      "Title": "Treatment option details? Springer christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 23, 2012 08:09PM christina0001 wrote: I drank a lot of pink lemonade one week during chemo. It was the only fluid I could stand. After a week it changed from being good to being disgusting. I am turned off at the thought of it but I think if I drank it, it would be okay.",
      "MessageIndex": 4,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792452",
      "Title": "What did you eat during Chemo that you cannot stand after Chemo? Denise-G Cottontail"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 2, 2012 08:46PM christina0001 wrote: I think my swelling was nearly gone at that point. Have you talked to your onc about this? I did have to wear TED hose for a while, and I slept with my feet propped up on a pillow, and that really helped bring the swelling down. If your swelling is bad they might need to give you a pill to bring it down.",
      "MessageIndex": 1,
      "PostDate": "02/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/794361",
      "Title": "Swelling from Chemo: How Long del3 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 9, 2012 05:25PM christina0001 wrote: Wow, that sounds terrible and traumatic. I'm sorry you went through that. To answer your question, thankfully no I have never had problems.",
      "MessageIndex": 14,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/791537",
      "Title": "General Anesthetic: horrible pain in arm when being put under gumshoe christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 28, 2012 11:04AM christina0001 wrote: OMG bless your heart for waiting 3 weeks for the pathology report! PLEASE stop googling things, that is a sure ticket to crazy land! I hope your appointment went well.",
      "MessageIndex": 9,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/791141",
      "Title": "What should I ask the surgeon today? Sandyflats christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 12, 2013 06:03PM christina0001 wrote: I had my first cut 15 months PFC. It felt great! I have haircut number 2 scheduled for December 3rd and I am so looking forward to it.",
      "MessageIndex": 5,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/814447",
      "Title": "First haircut after chemo??? When did you do it? Youngwithbc Youngwithbc"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "May 30, 2012 06:34PM christina0001 wrote: floridatwored, I am sorry you are going through this. The first few weeks ARE the worst. I think I cried almost non-stop at home for the first three days or so. This site has been a Godsend to me. We are here for you. Right now, just take care of yourself. Eat well, do things that relax you, that you enjoy. This will come to pass, I promise.",
      "MessageIndex": 13,
      "PostDate": "30/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/788278",
      "Title": "Recently Diagnosed floridatworeds rita65"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 30, 2018 10:21AM christina0001 wrote: I realized something might be off when I found a dent in my breast. I was never able to feel a lump, but when I went in to see my gynecologist's nurse practitioner, she was able to find the lump, which was deep inside and causing the dent. I would definitely encourage anyone with a change in their breast to go see their doctor for a thorough exam and follow-up! Good luck to your cousin.",
      "MessageIndex": 5,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868351",
      "Title": "Indentation on areolas in both breasts RyansMomma Megadoo"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Feb 28, 2012 08:13PM christina0001 wrote: I shaved my head on day #12. I did not want to experience my hair falling out in great big long clumps.",
      "MessageIndex": 3,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/783362",
      "Title": "Pre-Chemo Haircut renaedarlene Momine"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 13, 2013 04:22PM christina0001 wrote: I'm a little over a year PFC and still have joint stiffness/pain. It's tolerable, but annoying.",
      "MessageIndex": 5,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/809273",
      "Title": "How long until chemo affects wear off? nepenthes gailani"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jan 24, 2013 05:49PM christina0001 wrote: Just my experience but I would blame the chemo. I had a runny nose through chemo + herceptin but now that I am just getting the herceptin, I don't have it anymore. I would suggest Kleenex with Aloe!",
      "MessageIndex": 4,
      "PostDate": "24/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/799359",
      "Title": "Runny, drippy nose Albertan Aine1981"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Apr 8, 2012 06:08PM christina0001 wrote: It's awful to go through, the chaos and panic of testing testing testing. You can't know what is going on for sure until you get through that part. I will tell you what I did, after all the testing, I heard what my surgeon had to say... and then I went to an oncologist that specialized in breast cancer to see what she had to say. I'm very glad I did. I would encourage you to consider getting a second opinion no matter what, and then taking some time to THINK before deciding on treatment options.",
      "MessageIndex": 7,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785455",
      "Title": "Just Diagnosed and Confused chrissera Butterflylady2012"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 29, 2012 07:00PM christina0001 wrote: I don't know that it would make a HUGE difference unless you have a type of cancer that is considered very aggressive. But your post made me wonder... is it really that important to be seen by one of the \"top\" oncologists at your center? Are there other oncologists who are well-experienced working with breast cancer patients, that might have less of a wait?",
      "MessageIndex": 5,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/797010",
      "Title": "When to Start Chemo following BMX?? shlee Sassa"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 12, 2018 08:28AM christina0001 wrote: Good luck with the mammogram!",
      "MessageIndex": 1,
      "PostDate": "12/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868296",
      "Title": "The good news is I’m not crazy, the bad news...I’m not crazy K_Lee K_Lee"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jan 4, 2013 06:16PM christina0001 wrote: Yeah it does suck! This is the worst part. Treatment is not easy but it is way easier than all these tests, confusion, trying to figure things out... Yes you can beat this! Those nodes were doing their job to catch this crap and keep it out of your system. If you have not already, they'll probably have you do some CT scans and a bone scan to look for mets, just to be safe. Hopefully your type will have lots of treatment options, i.e. chemo and meds... no they are not fun but the chemo and meds are totally doable and it will KILL this crap!!!",
      "MessageIndex": 15,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798377",
      "Title": "...and finding out sucks more smethot Maureen1"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 30, 2012 07:40PM christina0001 wrote: I had 6 rounds of chemo and #4 for me was the worst too I think. #5 was wonderful, really the best, because after #5 I knew I only had one left. Hang in there friend, I promise you, it does get better.",
      "MessageIndex": 12,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792753",
      "Title": "Lost and lonely Pinkgirl01 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 18, 2012 08:05AM christina0001 wrote: Another thing to consider is that you will have an ongoing relationship with the doctors that treat you.  Once you move back to CA you will have to find all new doctors.  This is a pain. Very good point! I also think relocating for treatment is possibly not the best idea. If you can get good treatment locally, that is a good option as you will need follow up for a long time. Many of us did work through chemo, although not everyone does. Everyone reacts to it a little differently. I received intermittent FMLA leave at work and I needed to take off 3 days out of each chemo treatment cycle (I had six treatments). What I would suggest, if you have family/friends who are willing and able to have long visits with you, to see if they would be willing to visit for the first couple of weeks of treatment, to see how you feel and how it goes. But if your heart is not set in staying in CA, moving in with family is a good idea too. Having the security of that ongoing support is priceless. Physically and emotionally, going through cancer and treatment is hard! I would not stay with a newly married friend - your friend might be welcoming to the idea, but I would worry about the stress that could put on a new marriage. Relocating to HA, where you have no one, and expecting people to fly out to care for you, sounds rather risky to me.",
      "MessageIndex": 2,
      "PostDate": "18/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796494",
      "Title": "Relocation for treatment??? Krissy5 wenweb"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 4, 2012 05:29PM christina0001 wrote: It's your head. I can't imagine you would do any damage to your hair by shaving your head.",
      "MessageIndex": 2,
      "PostDate": "04/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792967",
      "Title": "Hair Craziness? ohiobecky ohiobecky"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 28, 2012 05:45PM christina0001 wrote: I am lucky that both oncs I saw both recommended the same treatment. Frankly I could do all the internet research in the world and there is no way I would feel qualified to choose between chemotherapy treatments. If I were in your shoes, I would decide which onc I felt most comfortable with, and go to him or her. I would ask the onc these very questions, and then go from there.",
      "MessageIndex": 2,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/789683",
      "Title": "Torn between which chemo to choose? lilypad christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 21, 2012 10:41AM - edited Oct 21, 2012 10:42AM by christina0001 Hold up, before rushing to your local, highly expensive, germ-filled ER, consider: 1. Calling her surgeon's office - most will have a weekend recording with a phone number you can call 24/7. Call that number and describe what is happening. 2. Call your onc - I'm sure he or she has an on-call number as well. 3. See if you have an urgent care clinic open in your area. The doctor there can get in touch with her surgeon or oncologist if necessary. Any of these options, you will be referred to the ER if it is truly necessary. No need to go there directly though if you can help it. My port incision got infected during chemo; I had to have antibiotics 2x. Certainly important to treat but IMO not worth an ER trip at all. If you are going to start out by calling her surgeon or the oncologist, be sure to take her temperature first. Knowing if she has a fever will be very helpful in determining the severity of what sounds like an infection.",
      "MessageIndex": 3,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795251",
      "Title": "incision is red and swollen and i'm having chemo? queeny209 Marple"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 15, 2012 07:24AM christina0001 wrote: I agree that it is a great time to do it, but if the PS isn't comfortable doing it than I would not. Can your BS or someone else put it in during the BMX surgery? You'll still need IVs for your BMX surgery because they'll have to get the IVs going before you ever get to the operating room. But you definitely want a port for chemo and herceptin, IMO. I hate IVs; the port is much easier.",
      "MessageIndex": 2,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/790593",
      "Title": "Port insertion during bmx and LD recon surgery. Yes or No? cgesq kayakgirl"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 13, 2012 08:49AM christina0001 wrote: ditto mdg. The beginning is so overwhelming. Please, if at all possible, bring someone with you. The shock of the news really does affect your ability to take in information. Unless your physician tells you otherwise, do not feel pressured into making big decisions too quickly and rushing into treatment. In many cases, we have time to take days or even weeks to contemplate all this information and choose our paths. So sorry you  have to be here...but this is a wonderful place for information and emotional support. Good luck with your appointment today.",
      "MessageIndex": 5,
      "PostDate": "13/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790487",
      "Title": "Just got the news-what shall I ask? Aruba christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 13, 2012 10:36PM christina0001 wrote: Aruba, so glad that your appointment today went well, and that you have a plan in place you feel confident in. I've also had a lumpectomy and SLN...it wasn't too bad at all. I hope you have a speedy recovery, and get all good results back.",
      "MessageIndex": 8,
      "PostDate": "13/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790487",
      "Title": "Just got the news-what shall I ask? Aruba christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 18, 2012 10:09PM christina0001 wrote: Welcome matilov, dfernandez, scmcgill, and pamom, although I am sorry you are both here. The beginning is the hardest part. I think I cried for about a week straight the week I was diagnosed. Just do what you have to do to get through the next few weeks, while you get things sorted out. Take someone with you on all appointments because it is so much to take in. And I encourage everyone to consider getting a second opinion before having any treatment or surgery, just to ensure you are on the right path. This is a great place for information and emotional support. We are here for you!",
      "MessageIndex": 10,
      "PostDate": "18/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795107",
      "Title": "I was just diagnosed this past week, matilov47 Everyday-a-Hollyday"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 1, 2012 02:42PM christina0001 wrote: pinkpearl, good luck on Tuesday. Waiting is the worst!",
      "MessageIndex": 9,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789853",
      "Title": "Any other newbies? cpp christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 6, 2012 05:24PM christina0001 wrote: LPR - so sorry for all you and your family have gone through this year. That's just too much... ridergirl - I hope your oncology appointment went well.",
      "MessageIndex": 44,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789853",
      "Title": "Any other newbies? cpp christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 18, 2012 06:26PM christina0001 wrote: Welcome new members! Tpolychron, I can totally relate...I was diagnosed a few months before my 33rd birthday. I am the healthiest person I know! Except that I have cancer. A couple of weeks ago I mentioned to someone that I had breast cancer and I'm not sure she even believed me. Guess I could have ripped my hat and fake hair off and proved it... lol Welcome to melanie and terrikoala too. We are here for all of you.",
      "MessageIndex": 76,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789853",
      "Title": "Any other newbies? cpp christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Mar 29, 2012 01:57PM christina0001 wrote: :) Thanks for sharing this, made me smile.",
      "MessageIndex": 20,
      "PostDate": "29/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/784873",
      "Title": "had to share momand2kids paradiju"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 19, 2012 02:25PM christina0001 wrote: Thanks for all the responses. I'll definitely be trying the silicone foob once I am healed up from surgery.",
      "MessageIndex": 7,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/792198",
      "Title": "Why a prosthetic? christina0001 crystalphm"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 27, 2012 08:18AM christina0001 wrote: I didn't have any fun with it either, that is for sure. Ativan was my buddy through it. I think I had mine shaved off close to 3 weeks after my first treatment. Andrea, if you cry, then cry...just let those feelings out. I expected to cry but I did not. I did not look in a mirror the whole time, and the gentleman that did it (who was not only a hairdresser, but also a Look Good Feel Better volunteer) did my wigs at the same time, so I left with a wig on my head. I did not look at myself hairless until I was in the privacy of my bathroom. I have never felt confident without my hair through this whole thing. My last chemo was 4 months ago and I now have enough hair to go without a wig or scarf on, but I still feel very naked and not like myself at all. It's a struggle. But what can you do? Every morning I take a deep breath, tell myself to deal with it, that it is just temporary, and then I go on with my day. I can't wait to have long hair again; I even dream of it.",
      "MessageIndex": 8,
      "PostDate": "27/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/794089",
      "Title": "Hair Loss- when did you just cut it all off? alcb70 SelenaWolf"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Dec 14, 2013 01:50AM christina0001 wrote: Franny, so sorry you are coping with this shocking news, especially while your husband is away.",
      "MessageIndex": 7,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815593",
      "Title": "Thought I'd be one of the 80% FrannyM424 sweetjam"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 19, 2012 08:39PM christina0001 wrote: It was definitely not easy. First I told my husband and then my mother. They were really the only two people that I was confortable being upset in front of. They both cried, I cried. It was okay, we cried together. I waited a few days until I felt like I had more of a handle on things to tell other family and friends. The worst for me was telling my grandparents. They cried; it broke my heart and still breaks my heart to think of it. Grandparents should not have to worry about the health of their grandchildren. The best advice I can give you is to take your time, and tell people when you feel ready. Talk to the ones who you believe can be most supportive for you, earliest. My dad can also not handle this well so I can only call him if I am feeling upbeat and strong. That gives him hope. If I called him when I was down, or scared, he'd be upset. In an ideal world, everyone would be able to be emotionally supportive of us, 100% of the time, but it seems like some days we have to give others support for being upset over what we are going through. I'm not criticizing them for being upset...it's just how it is.",
      "MessageIndex": 3,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790809",
      "Title": "Telling people you have BC MarS676 gardengumby"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 30, 2018 09:56AM christina0001 wrote: MLAnne I've had ports placed twice and truly it was a breeze. In the grand scheme of things, it was cake really. I don't recall being unable to do things afterwards. Maybe mild soreness for a bit. Having said that, I hated having the port. It didn't hurt but I was always aware of it being there. But, it served an important purpose during treatment. Good luck!",
      "MessageIndex": 15,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868573",
      "Title": "Port placement Love83 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 9, 2012 07:47PM christina0001 wrote: I think that is really sweet of you. I know when I got chemo I would be freezing cold. I always wanted to be covered by a large blanket from neck to toe! :)",
      "MessageIndex": 11,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/790226",
      "Title": "Need Your Advice On Comfort Quilts For Chemo Patients! Blessings2011 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 30, 2012 08:36AM christina0001 wrote: Welcome charliegirl. I am not new, but you and I have the same surgery date! I will be having a unilateral mastectomy on August 10. I am waiting that long because I am taking a summer class and wanted to wait until it was done. I finished chemo at the end of May, and my oncologist and surgeon felt it was safe to wait until that point. We may have to start an August 2012 Surgery thread before too long, so we can give each other support while we wait. Congratulations on quitting smoking!",
      "MessageIndex": 2,
      "PostDate": "30/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789853",
      "Title": "Any other newbies? cpp christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 1, 2012 02:44PM christina0001 wrote: cpp - it does take time to get to know folks here. I didn't feel like I had real ties with folks here until I was a month or two into my chemo treatments, and had really bonded with my monthly chemo group. I hope in the meantime you will continue to at least come here for information, as you get to know people. The amount of good information here is staggering.",
      "MessageIndex": 10,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789853",
      "Title": "Any other newbies? cpp christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 4, 2012 05:36PM christina0001 wrote: Sunflowergirl - I felt so similar to what you are describing in the days and weeks after I was diagnosed. I also cried daily for about a week, that first week. It was awful. I am hopeful for you that your oncologist appointment tomorrow will bring you greater understanding and peace of mind. I am also dx'ed with IDC; I am stage IIa. My prognosis is great; if you are stage I then please know that your prognosis is likely to be excellent. There are great treatments out there...and you can get through all of them. We are here for you! Let us know how your appointment tomorrow goes. sugarland - welcome, and good luck with your oncology consult as well. Amy - welcome, and I hope you have a speedy recovery from lumpectomy #2 on the 9th. Let us know how you get through it. Brooklynmom - no advice from me, but welcome, and I'm sorry you are having to wade through these hard choices. Do research but have confidence that your oncologist is guiding you in the right direction. And if you are not sure, there is never any harm in going for a second opinion. 99.9% of physicians are completely fine with that, and your oncologist could even recommend someone to you if you are not sure who to see. I went for a 2nd oncology opinion and it gave me huge peace of mind. omeggo - welcome, and sorry you are going through this. It sounds like you are wasting no time fighting this! Don't worry about how you are feeling may affect others here. We can all relate. Go ahead and let it all out.",
      "MessageIndex": 33,
      "PostDate": "04/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789853",
      "Title": "Any other newbies? cpp christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 13, 2012 05:57AM christina0001 wrote: ridergirl - sorry about the bad news, but don't lose hope. My mom also had breast cancer and took tamoxifen for a long time (I think 10 years) and she says she never really had bad side effects. Everyone is different. As for not sure of \"where to be\" here, coming to this thread is fine; I know I did not feel like I \"belonged\" in any particular place until I had my chemo start date and joined the thead for people starting chemo at that time. You might see if there is a thread for women starting tamoxifen in the near future. I found it comforting to share my worries with women who were in the same place as I was; perhaps you might too. There are some good support threads in the Stages section as well, depending on the stage you are at. Virginia - welcome! Sounds like you are really doing your homework! So glad you found an onc you are comfortable with, that is so important. omeggo - for me as well, telling the family was one of the hardest parts. Maybe the hardest in a way. I told my mother immediately, but everyone else I waited a few days until I could put on a brave face. My grandparents cried and it about broke my heart, I still get upset thinking about it. I hope you will participate in the August 2012 surgery thread. I am in there; my UMX is scheduled for 8/10.",
      "MessageIndex": 54,
      "PostDate": "13/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789853",
      "Title": "Any other newbies? cpp christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 24, 2013 06:10PM christina0001 wrote: Great responses here already! My two cents: if you are not 100% comfortable with the plan your surgeon is proposing, then STOP EVERYTHING and absolutely get a second opinion. I have done that a couple of times along the way and it was a huge help, and gave me great peace of mind. I will also say that lumpectomy vs. mastectomy is a very personal choice. You have to do what is right for you. Right now I am very sore and recovering from breast reconstruction surgery, so a lumpectomy sounds like a really good choice to me! But it has to be whatever feels right to you.",
      "MessageIndex": 4,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/809835",
      "Title": "Just diagnosed and Lumpectomy early next week Shira CTMOM1234"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 2, 2012 07:17PM christina0001 wrote: I think that is a good way to make yourself sick. I did not have much nausea but when I did, eating helped settle my stomach. Whereas, I have a friend who got sick after her first chemo, and eventually she realized it was because she hadn't eaten anything of substance that day. Nutrition is also huge during chemo. It is so easy to become depleted of vital nutriants. I myself continue to battle low potassium 3 months after finishing chemo. Eating well can help protect you against becoming more sick this way than you have to be. Beware of Dr. Google. Dr. Google does not have an M.D. and for every one good piece of information, there are 10 pieces of junk.",
      "MessageIndex": 5,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792911",
      "Title": "Fasting and Chemotherapy borjo dlb823"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 24, 2012 09:29AM christina0001 wrote: I'm so sorry you are having to deal with this. The beginning is the worst. Telling people is awful, especially the ones you love. For me, the worst was telling my grandparents and hearing them cry. But as painful as it is, please do share what you are going through with your family. My mom has gone through it and I never wished she had not shared with us. My siblings and I wanted to be there for her when she went though breast cancer - now they are here for me. Yes it hurts, but that's part of life, and part of being a family. You will get through it together. I understand not wanting to know too much. Sometimes the information is too much, too soon. When you are ready for more information, just ask. There are a lot of women here who get really into the information, do a lot of research, etc. You don't have to be one of those. Find good doctors you can have trust in, and go with it. Good luck on lumpectomy #2!",
      "MessageIndex": 22,
      "PostDate": "24/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789328",
      "Title": "choosing how much you want to know about your condition ro-berta msphil"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "May 4, 2012 10:59PM christina0001 wrote: So sorry - it's shocking news to receive! Good luck Tuesday.",
      "MessageIndex": 1,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786785",
      "Title": "Just diagnosed today Roxie1 lightandwind"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 3, 2013 05:21PM christina0001 wrote: Welcome, although I am sorry you have need to be here. The beginning is the worst part, waiting for test results and then waiting for treatmet to start. The first couple of weeks after I was diagnosed - it was horrible. As best as you can, try to keep busy doing things that you enjoy, pamper yourself a little bit - you are a soldier getting ready to go to war!",
      "MessageIndex": 4,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808706",
      "Title": "Just diagnosed - tired of crying, ready to get on with it! lighthouselady bcisnofun"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Apr 16, 2012 09:18AM christina0001 wrote: Take deep breaths...you can and will get through this. There are so many women out there, and on this website, that have led the way. The week that I was diagnosed was the worst of my life. But I promise, very slowly, it will get better. Hang in there, a moment at a time.",
      "MessageIndex": 7,
      "PostDate": "16/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785877",
      "Title": "I don't think I've ever been this sad teeballmom adenacb"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 12, 2012 08:26AM christina0001 wrote: My bad days were days 4-8. The others were reasonably normal. So yes, you should have lots of days to enjoy with the kiddos.",
      "MessageIndex": 3,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796215",
      "Title": "Are there ever \"normal\" days? Thankful4mylife rachelvk"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 27, 2012 01:11AM christina0001 wrote: Gina, everyone is differently but I hardly had any nausea at all. I had very mild nausea maybe once every treatment and would immediately take my medication for it, as the doctor told me to. It was very effective. My team was very firm with me to catch it early and not let it get out of control. Fatigue was rough about 4 days every treatment cycle for me. Fortunately each cycle was the same for me and so after a couple of treatments I could predict my \"bad\" days. I had about 4 bad days each cycle. Chemo isn't fun, but it is doable. Just stay in tune with your body, rest when you need to, and stay hydrated (easier said than done some days).",
      "MessageIndex": 11,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792324",
      "Title": "Hi, new here gina_momof3 Hope999"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 27, 2013 11:07AM christina0001 wrote: LAstar's post is perfect! Can't really add too it! I am sorry that you are here though. The beginning is the hardest part. ",
      "MessageIndex": 12,
      "PostDate": "27/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808100",
      "Title": "Really? Breast Cancer? Tracy516 Peachygirl"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Dec 29, 2013 11:46AM christina0001 wrote: Hi Gubbyann, sorry you are not feeling well. I remember that five weeks out, I was still feeling pretty rough. I had a lot of the same side effects - black nails (my onc thought I would lose a bunch of them, but they stayed on and grew out over time), my taste buds were still messed up, had bone aches... not fun.That's the result of the cumulative side effects of multiple doses of chemo. Fortunately, I think you will start to see improvement soon. The bone achiness hung around for a LONG TIME... I finished chemo a year and a half ago and I think the bone achiness turned into more like stiffness over time, and only really went away in the last few months! The best advice I can give (for what my opinion is worth) is to make sure your oncologist and maybe a dietician have looked at your labs, and counseled you on what you can do to help yourself feel better, and see if there is anything going on that could be contributing to the dizziness (you may even want to see your primary care physician about this, just for a second opinion and a fresh set of eyes on the problem). If you need protein then the protein drinks are great! For me, I tended to run low on potassium so I needed to take a potassium supplement. Absolutely make sure you are staying hydrated. Towards the end of chemo I absolutely could not stand the taste of water; fortunately tangy drinks were more agreeable so I stayed relatively hydrated with them. Keep moving... try to keep active, that is good for your health and will help your system do what it needs to do to clean itself out, so to speak. The watery eyes are a common side effect too. There is light at the end of the tunnel... just based on my experience and what I have read here, I think you will start to see improvement over the next few weeks. Just do your best to take care of yourself right now. Oh and how are you sleeping? Chemo kind of goofed with my sleep cycle and it's hard to feel well if you are tired. So if you are not sleeping well, you might need to think about what will help with that as well. Best of luck to you!",
      "MessageIndex": 1,
      "PostDate": "29/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816248",
      "Title": "5 weeks post chemo and still feeling bad Gubbyann GraceB1"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 1, 2012 07:50PM christina0001 wrote: I would leave out the shampoo; someone who is emotionally sensitive (which is all of us) might be missing their hair and get upset at seeing it. Something labeled for scalp might be nice though. Definitely moisturizer would be welcome. So sweet of you!",
      "MessageIndex": 6,
      "PostDate": "01/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/794304",
      "Title": "Opinions on Chemo needs (Chemo care package) Cynbest Cynbest"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 12, 2012 11:35AM christina0001 wrote: ditto blainejennifer. That's not fun! I only had them once during treatment and they went away after about 48 hours. I hope yours pass just as fast.",
      "MessageIndex": 2,
      "PostDate": "12/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/791904",
      "Title": "New to chemo cutiegirl cutiegirl"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 7, 2012 02:34PM christina0001 wrote: Thank you for sharing your story. It is helping me to at least be a little more open minded to the option of mastectomy. I'm waiting to meet with my onc now to ask him some questions about this.",
      "MessageIndex": 8,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788697",
      "Title": "Is choosing a lumpectomy a mistake? christina0001 lane4"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 2, 2013 12:38PM christina0001 wrote: I had taxotere and carboplatin (with Herceptin) so I can't speak to what your onc is recommending. I would also suggest getting a second opinion, at whatever hospital/cancer center you have the most confidence in. I fell into a grey area as far as radiation goes, and I got a second opinion, and it was extremely helpful. And I do agree with your husband about trying to stay close to home, as long as you are comfortable with where you are going. You are going to have lots of appointments and treatments, and it helps a lot to not have to travel far, as you will probably not feel very well some days, and also the cost of gas and wear and tear on your vehicle adds up quick. Best of luck to you.",
      "MessageIndex": 10,
      "PostDate": "02/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/813867",
      "Title": "Befuttled...???? Paulette23 Paulette23"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 28, 2012 05:02PM christina0001 wrote: I just wore my regular bras. Only had about 3 that were comfortable. They needed to fit snug but not tight. Good luck finding a comfortable one and I hope everyone heals up fast.",
      "MessageIndex": 22,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729862",
      "Title": "what type of a bra did you wear after your lumpectomy? aris Hopeful82014"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 6, 2012 08:10PM christina0001 wrote: Not normal. And how dumb to see the PS before you understand your test results and plan of treatment. Getting through the tests is a necessary evil, in order for the doctors to figure out what is going on. I know the wait time between having the tests and then getting an explaination of the results from your doctors can be so frustrating. But I think it is better to have a sit-down consult with them where you can ask all your questions, rather than become stressed with the expectation that you can have so many questions asked every day. Keep a log of your questions, so you don't forget them, and then ask the doctor about your concerns in person during your consults. That would be my advice. I really hope you get to have a long, thorough consult with your onc today, followed by a long, thorough consult with your surgeon. If after you have met with both of them and you are still feeling confused or unsure, I would look for someplace to go for a second opinion.",
      "MessageIndex": 4,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790173",
      "Title": "Finally, my follow-up with MO is today, angry going into it _Ann_ christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "May 11, 2012 12:23PM christina0001 wrote: Yes, a medical oncologist would be a great next step, particularly one that specializes in breast cancer. As overwhelming as this is, try to take a deep breath, and focus on gathering information before deciding on a course of treatment. Best of luck to you.",
      "MessageIndex": 4,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/787289",
      "Title": "Which doctors do I need to see now that I've been diagnosed? 25weeks lago"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 8, 2013 10:39AM christina0001 wrote: Jenny I was in a similar situation with radiation. As far as radiation went I fell into a \"gray area.\" It happens. My radiation oncologist is a total sweetheart but I felt like I just wasn't getting the information I needed to make a decision. So I got a second opinion and the radiation oncologist I saw was able to break things down in a very specific way, gave me numbers to compare and think about, and it was a huge help to me in making a decision. So I would definitely encourage you to go ahead and get that second opinion. ",
      "MessageIndex": 3,
      "PostDate": "08/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/808036",
      "Title": "Young & trying to figure out if I need chemo jennyschu crazyride43"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 15, 2012 10:30AM christina0001 wrote:",
      "MessageIndex": 7,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789410",
      "Title": "Unclear margins after mastectomy mamaoftwins christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 24, 2012 08:06AM christina0001 wrote: I did not wear a sports bra after my lumpectomy. I just wore my regular bras. Some were more comfortable than others. I was uncomfortable without a bra on and even slept with one on. I'm not an expert but I don't see what harm it would be to go braless if that is what is comfortable for you, at least for a little bit. Don't scratch though! Sorry you are going through this. I hope your test results come back with clear margins, and I hope you recover from surgery quickly.",
      "MessageIndex": 33,
      "PostDate": "24/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789227",
      "Title": "Overwhelmed Lettiegonz LittleMelons"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 22, 2012 09:40AM christina0001 wrote: I can't wait to have mine OUT. I have not decided yet if I want to have it out after herceptin treatment ends, or if I want to hang onto it a little longer for recon. But I think I'll just get it out after recon and I can get regular old IVs after that as needed, which will be infrequent. I just want my body to go back to normal as much as possible.",
      "MessageIndex": 4,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/793876",
      "Title": "keeoing port after chemo asha44 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 25, 2012 12:07AM christina0001 wrote: YES DO THE CHEMO. I have a similar dx. Screwed up (bad surgeon) and did a lumpectomy first. Did not get clear margins. THEN I saw an oncologist who was very upset that I'd had the lx. She said if I'd had chemo first, I would have gotten clear margins for sure. Since I did not get clear margins I had to have more taken out, and eventually ended up getting a UMX. I believe in my heart that everything happens for a reason, but I sure wish I'd seen the oncologist before having surgery, done the chemo first, and then I'd only had a tiny tumor to remove instead of a 2.6 cm one. I will say the chemo worked for me. The UMX was completely cancer free. :)",
      "MessageIndex": 1,
      "PostDate": "25/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792519",
      "Title": "TPBC and Neoadjuvant chemo Amy4978 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Mar 8, 2013 10:02PM - edited Mar 8, 2013 10:03PM by christina0001 In the beginning I could not understand how others seemed so strong and brave. I did not feel that way at all. But I think courage is not about being confident or bold all the time...courage is facing what you have to get through, even if the fear is killing you inside. Yes, you can do this. Right now, take comfort in whatever you can - family, friends, pets, whatever comforts you. We are here for you too!",
      "MessageIndex": 4,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/801587",
      "Title": "DCIS diagnosis bella42771 sjd2012"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 19, 2013 03:41AM christina0001 wrote: Wow. I am triple positive as well but that is amazing that there is no tumor. Cancer is so sneaky. Good luck with the chemo and I encourage you to join the August 2013 chemo support thread. The thread for the month I started was invaluable to me, a huge help in getting through treatment. Are you doing TCH then? I did six rounds of it; it is not easy but it was very doable for me, and it was not nearly as bad as I feared. I did herceptin for a year and that was cake. You can do this! Good luck to you.",
      "MessageIndex": 3,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/809502",
      "Title": "Rare form of breast cancer. Cheriden bluepearl"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 16, 2012 05:50PM christina0001 wrote: I basically have an emotional meltdown before anything new - new consultation, procedure, doctor, whatever! Totally normal! I also hated going to the surgeon's office for a while because I associated it with being diagnosed. It filled me with anxiety and dread. Fortunately, the more I go, the easier it gets. Don't be afraid to call your insurance company and ask which surgeons are in-network for you, and then scheduling a couple of consultations.",
      "MessageIndex": 7,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/791988",
      "Title": "So conflicted 5kidsMom 5kidsMom"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 6, 2012 09:11AM christina0001 wrote:",
      "MessageIndex": 14,
      "PostDate": "06/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/792748",
      "Title": "\"Dumped\" by my oncologist after 3 years Lindissima LRM216"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Apr 6, 2013 09:37PM christina0001 wrote: Yes you need to be strong for her, but that does not mean you can't cry together, or be scared together sometimes. I can't imagine how you must be feeling inside. The relationship between sisters is something special, and I can't imagine what it must be like for a twin. Just try to not pull away from her through this, be there for her however she needs. But take time to de-stress for yourself, too.",
      "MessageIndex": 2,
      "PostDate": "06/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/802809",
      "Title": "Identical twin sister... geminisonia politicomama"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 12, 2013 09:20AM christina0001 wrote: Welcome Cristen. I was diagnosed with IDC stage 2a at age 32 so I can relate a bit to your situation. Definitely a shocker. I think I spent the first three weeks crying or just in shock. My co-workers knew something was wrong because they said my face was basically white the week after I was diagnosed. Now is definitely a time to take care of yourself, pamper yourself as much as possible. As terrifying as it is, for many of us the beginning is the hardest part. The shock of the diagnosis, the multitude of tests and then waiting for test results, and the not knowing what is going on, can be much worse than actually treatment and recovery. I'm sensing that you are really worried about chemo. That's completely understandable! Chemo is not fun but I want to assure you that for most of us, chemo is very doable. It's not like in the movies for most of us. The chemo most of us get is not the super-duper rough stuff that some other types of cancer patients get, plus there are so many medications our oncologists give us to manage side effects. It's not easy but it is doable. Many of us managed to care for children and/or continue to work full time or even close to it during chemo! Obviously everyone is different but I want to give you hope that you can do this, you will get through it if you do end up needing chemo. Waiting until your BRCA test results come back is reasonable before deciding what surgery to do. Some women have the option of doing chemo first, then surgery, as this can shrink the tumor down and make a lumpectomy more doable. I would encourage any woman to carefully weight her options, and consider getting a second opinion, before deciding on what surgery to do. If you end up going the mastectomy route, that may mean researching reconstruction options. If you are thinking about mastectomy, I would also recommend getting a copy of The Breast Reconstruction Guidebook by Kathy Steligo. It was really helpful to me in understanding my options. Finally, regarding insurance... I would expect that you will definitely meet your deductible this year if you have to have chemo. So this may not be a barrier in choosing surgery options. It's late enough in the year that you may end up needing treatments/surgeries next year as well and meeting it next year too. I would encourage you to be cautious in letting this be a major determining factor in choosing your options. Many hospitals will be flexible in allowing you to make payments to them. It may be worthwhile to talk with either the hospital or cancer center social worker about assistance as well; he or she can see if you qualify for assistance, and their may be local groups like your local chapter of the American Cancer Assocation, Breast Cancer Association, etc. that can provide help as well. It's definitely worth asking about! I was surprised to learn that I qualified to have all my co-pays for the Herceptin I needed paid for, which was a huge help. Best of luck to you. Let us know how you are doing.",
      "MessageIndex": 1,
      "PostDate": "12/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/812723",
      "Title": "IDC, stage II, grade 3 Cristen002 nbrown77"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 16, 2012 04:45PM christina0001 wrote: Deanna I responded to your thread and I hope you will read my response there.  I'm sorry you are going through this Janet. The waiting, the fear...it is the worst. Not that being diagnosed feels good, but the unknown is so much more scary. I hope things go well with your next biopsy on Wednesday and that everything is benign. If not, know that we are here for you, and no matter what the news, you can get through this.",
      "MessageIndex": 4,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789171",
      "Title": "More waiting Janet456 Janet456"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 28, 2012 08:00PM christina0001 wrote: Never used it here either, and mine has never given me problems (I've been wearing one since late February). I do wear a cap from TLC (American Cancer Society store) just to protect my scalp.",
      "MessageIndex": 10,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788512",
      "Title": "Do you use Wig Tape or Adhesive? del3 del3"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 6, 2012 02:36PM christina0001 wrote: So sorry you are going through this. Hopefully they will give you some good options, maybe no radiation will be needed.",
      "MessageIndex": 3,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/794429",
      "Title": "Are you kidding me?? keetmom christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 31, 2012 11:11PM christina0001 wrote: Could it be neuropathy?",
      "MessageIndex": 1,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/791392",
      "Title": "Physical issues after chemo Huskydogs_5 Moderators"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 8, 2012 09:28AM christina0001 wrote: Don't feel bad. We've all been there too. Very glad to hear things worked out well at your appointment.",
      "MessageIndex": 8,
      "PostDate": "08/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790173",
      "Title": "Finally, my follow-up with MO is today, angry going into it _Ann_ christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Dec 27, 2012 12:49PM christina0001 wrote: We had sex throughout much of chemo. I didn't have this problem as my DH has had a vasectomy. My onc did not think having sex during chemo was of any risk for my husband, and nothing terrible happened. You definitely don't want to get pregnant during this though. Whatever you choose, best of luck!",
      "MessageIndex": 9,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/798025",
      "Title": "Chemo, birth control and sex Skigirl72 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 25, 2012 04:52PM christina0001 wrote: Unilateral mastectomy...I had one breast removed. I hope your consult with the oncologist goes well. Mine is awesome. I can't think of any special questions to ask but keeping a list of what's on your mind is a great idea.",
      "MessageIndex": 3,
      "PostDate": "25/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792519",
      "Title": "TPBC and Neoadjuvant chemo Amy4978 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 28, 2013 06:00PM christina0001 wrote: Hi carissa. So sorry you have a need to be here. I was diagnosed at age 32 as well. It's been a rough year and a half but I am standing in the light at the end of the tunnel, at this point. Dealing with the shock of being diagnosed is the worst part. You will get through this and we will be here for you! Kiko I am so sorry for all you are going through. It is so frustrating when signs are ignored or dismissed just because of our age. Scary really! Good luck to you as you start chemo. I remember being terrified but it was really not as bad as I thought it would be. I hope you'll check out the chemo thread here for the month you are starting treatment. It was so helpful to be to be able to chat with ladies (and one gentleman!) who were starting chemo the same time as I did.",
      "MessageIndex": 29,
      "PostDate": "28/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/811564",
      "Title": "In Total Shock!!!!!!! carissabforlife Kiko"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 27, 2012 12:59AM christina0001 wrote: It's stress, plain and simple. As you come to grips with the diagnosis and everything that is happening, it will get easier. I've screwed up paying our mortgage twice this year from stress from all this. So know that you are not alone.",
      "MessageIndex": 2,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792569",
      "Title": "Brain Fog laura_g laura_g"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Mar 8, 2013 10:12PM christina0001 wrote: Either it feels like it is moving too fast, or too slow. I encourage everyone to get a second opinion. I have, at several points, and it has always been helpful. Often the doctors agreed (not always though!) but it was always helpful to hear things explained a second time, in a different way. Reconstruction options (for me, anyway) were complex and something I needed time to sort through. You may want to wait for the BRCA testing to come back before committing to any surgery date. If it comes back positive, are you going to want a double mastectomy? Is that what you want now, anyway? I would encourage you to get a copy of Dr. Susan Love's The Breast Book. I wish I'd read it early on. It does a great job of explaining cancer, cancer treatments, reconstruction, and coping with all of this in an easy-to-understand way.",
      "MessageIndex": 3,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/801593",
      "Title": "Treatment plan moving fast Chrisesta67 gemini4"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 23, 2013 03:39PM christina0001 wrote: I agree, as long as you feel up to it, go and enjoy! Might want to have someone else drive in case you feel surprisingly tired by the end of the night. And I would personally be using a lot of hand sanitizer while I was there. LOL",
      "MessageIndex": 2,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/809763",
      "Title": "Concert during chemo? Cougarlicious sundermom"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 4, 2014 11:50PM christina0001 wrote: Welcome, justneedinfo. I'm sure you are still reeling from being diagnosed. I was diagnosed at 32. I didn't have a child and I am sure that makes a huge difference, but I continued to work full time and go to grad school during treatments and surgeries. So don't automatically assume that you have to put your plans on hold. It's a very personal choice. I personally benefitted from having the work and school as a distraction. And while treatments are no walk in the park, I think it's much easier for us than for ladies who are significantly older, maybe not as active or in as good of shape, and may have other health issues too. I will give one bit of advice: now is the time to allow yourself to accept help from family and friends. If someone offers help with childcare, housework, driving you to medical appointments, accept it! Do what you have to do to get through this. Remember that it will not last forever. When I was first diagnosed, I was so overwhelmed with all that had to be done. But as with all things in life, it all comes to pass. Life is very sweet on the other side.",
      "MessageIndex": 4,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/821968",
      "Title": "new club mbr Justneedinfo Terri1975"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 18, 2012 08:14PM christina0001 wrote: needhope, if your mother is not comfortable with her doctor, then by all means she should see another one. I think it's very important to have a doctor she is comfortable with.",
      "MessageIndex": 28,
      "PostDate": "18/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/794714",
      "Title": "Absolutely Terrified needhope Racy"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 4, 2012 08:45PM christina0001 wrote: Wow blessings, that was a really helpful post.",
      "MessageIndex": 4,
      "PostDate": "04/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/790086",
      "Title": "Recoop time after Mastectomy mom22ja christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Feb 15, 2012 12:11PM christina0001 wrote: I'm looking forward to not having to shave, especially in the summer. And looking forward to not having to Nair my face every week or two. And frankly I hope I do lose some weight. I would love to lose 20 lbs. I've been trying to lose weight for months.",
      "MessageIndex": 6,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/782658",
      "Title": "So, you won the chemo lottery? TRY to find the humor! PlantLover fredntan"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 21, 2012 06:45PM christina0001 wrote: Yes you should be good to go but show your oncologist and see what he or she says. The incision will not heal as fast once you start chemo.",
      "MessageIndex": 2,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792347",
      "Title": "Can I do chemo w/ lumpectomy incision open just a little bit? tracy77 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jan 19, 2013 07:28PM christina0001 wrote: OMG you can tell your friend that if she ever gets cancer, she can treat it however she likes. But she needs to respect your treatment choices without question. Cancer puts you in the position of making some very difficult choices and no one has the right to question the choices you make. I will tell you that I was NOT going through menopause when I was diagnosed - I'm sure it does not help matters to be going through that but I assure you, even if you weren't, it would still suck. I went to work and was a zombie. I went home and cried and cried and cried. Like you, in between crying I did tons of research. The first several weeks after diagnosis, and while I was getting a million tests and waiting for results, and to work out a plan, were the WORST. I would not, for anything, go back to that period of time. I can tell you that it will get better. This is the hardest part. You are strong, you can get through treatment. We are here for you. And how wonderful to have a sister who is an NP who is knowledgeable about oncology! Keep us posted on how things go. And just take care of YOU right now. Do whatever you need to do to take care of yourself emotionally, to get through this time.",
      "MessageIndex": 8,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799084",
      "Title": "Just Diagnosed shadytrake beacon800"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 5, 2012 11:28PM christina0001 wrote: Good luck to you!",
      "MessageIndex": 1,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/793055",
      "Title": "Rads clinical trial here I come! Aruba christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Mar 22, 2012 08:29PM christina0001 wrote: Welcome Rachel. I'm sorry you are going through this. I too fluctuate between wanting lots of information, and wanting none at all. Just do what you have to do to stay sane through all of this.",
      "MessageIndex": 5,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/784450",
      "Title": "Preliminary results are in RachelM11 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 5, 2012 03:32AM christina0001 wrote: Tough decision. I was a 36D and elected a UMX. I just wanted to keep as much of my natural \"me\" as I could. Plus I figured recovery from surgery would be that much easier. I do have mixed feelings about my remaining breast. Sometimes I wonder if I would have been better off just having both removed. But I don't regret just having one removed, either. There's no good answer to this problem. Either option sucks, really. You just have to figure out whether UMX or BMX is right for you. It's such a personal choice.",
      "MessageIndex": 15,
      "PostDate": "05/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/794435",
      "Title": "To be flat or uniboob, please help Frapp Lily55"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 12, 2013 09:16PM christina0001 wrote: Aloha shammi! There is always room for one more. I'm so sorry you are going through this. The beginning is the worst part. I think I cried for a week straight. It doesn't happen fast, but it does get better and easier as time passes, as you have time to process the news, as you learn more about your situation and what you need to do to fight it. In the meantime we are here for you! And there is so much good information on this website. What kind of parrot do you have? I have a moluccan cockatoo and I'm a bit of a bird brain. Loving on my bird definitely helped me through some rough times... :)",
      "MessageIndex": 6,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814430",
      "Title": "Is there room for one more? shammi shammi"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jan 23, 2014 07:28PM christina0001 wrote: It takes time. I finished chemo in May 2012 (six rounds of TCH; the H went on for several more months but that was cake for me). Probably 6-8 weeks after finishing TCH I felt my energy coming back. By the time I had my UMX, three months later, I was feeling pretty good. I started rads 6-8 weeks after that, and other than occasional mild joint stiffness/pain, I was feeling great. The joint stiffness/pain was mild and infrequent and probably lasted about a year or so. I will also add that I think there is an emotion component to it. As my hair grew back, as I have lost the weight I gained during chemo, as I have gone through recon, as life is less about treatments and surgeries and meds, and instead more about living ... as I feel more like ME, that helps me feel better, too. Ruth gives great advice; exercise, eat well, stay hydrated... do all the things that we would normally do to take care of yourself. It does get better!",
      "MessageIndex": 2,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/817257",
      "Title": "? for those further along in treatment mcgis GrammyR"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Apr 16, 2012 09:03PM christina0001 wrote: I would not be scheduling any surgery until all of your test results are in, and you have personally met with the BS and an oncologist as well. You want to make an informed decision, whatever you decide to do. Best of luck to you. This is the worst part of it - waiting for test results, not knowing what is going on, not yet having a plan. But it will all come together, and you will get through this.",
      "MessageIndex": 11,
      "PostDate": "16/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785723",
      "Title": "Diagnosis-IDC. MRI shows enlarged lymph node.HELP luvBngGma christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "May 26, 2012 10:36PM christina0001 wrote: Glad you are here but sorry you are going through this. I am also IIa IDC, HER+, but I am ER+ too. Anyway I have no idea what insurance might approve! You might want to post in the Insurance/Finance forum here and see if anyone there knows better. That's great that your onc is fighting for you on this. Here is a link for information on hormone status: http://www.breastcancer.org/symptoms/diagnosis/hormone_status/ Here is a link for information on HER2 status: http://www.breastcancer.org/symptoms/diagnosis/her2.jsp Just keep breathing and keep pushing forward and you will get through this! There is so much good information here. If you have any questions about getting through treatment, just ask.",
      "MessageIndex": 1,
      "PostDate": "26/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/788061",
      "Title": "Newly diagnosed maa764 maa764"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 16, 2012 04:37PM christina0001 wrote: I am so sorry you are having to wait for Medicaid to be approved before you can get more testing and treatment! That is terrible! Do NOT try to guess what stage you are at. And no matter what stage you are at, there is treatment. I have a friend who was an advanced stage, the cancer had spread into her lymph nodes and she had a big tumor in her neck from it. She had all kinds of treatment several years ago and she is doing GREAT. Huge inspiration to me. Take deep breaths, try not to panic...coping with that initial diagnosis was the worst part for me. You will get through this and we are here for you.",
      "MessageIndex": 3,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789169",
      "Title": "Advanced breast cancer Deannalynn Denise-G"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Apr 11, 2013 07:49PM christina0001 wrote: Welcome, looks like several new ladies joining us! I am sorry you have a need to be here, but you are in the right place. I was diagnosed 15 months ago, am done with all treatment (except for taking tamoxifen) and I will have reconstructive surgery this summer. I know how dark and terrifying the beginning is...eventually it will get easier though, and you will be surprised at just how strong you are inside. Keanna that doctor sounds awful. Don't fret about having to wait a few weeks until you are back home and can get the care you need. The vast majority of breast cancers are very slow-moving. A few weeks' wait to get you in the right hands is well worth it. You may want to go ahead and set an appointment for the doctor of your choice at home so hopefully you can be seen within a few days of returning home.",
      "MessageIndex": 7,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/803108",
      "Title": "Diagnosed last week AryaS dwill"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 7, 2012 02:28AM christina0001 wrote: Thanks for all the posts and support. It is really helping me see the bigger picture.",
      "MessageIndex": 5,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788697",
      "Title": "Is choosing a lumpectomy a mistake? christina0001 lane4"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 13, 2012 08:32PM christina0001 wrote: It is NOT frivolous and I completely understand your feelings. I had to have a 2nd port put in after chemo was done (I am still getting herceptin and my 1st port had problems) and I wore a knit cap thingy into surgery. I was worried someone would tell me that I couldn't, but no one said a word.",
      "MessageIndex": 8,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/791964",
      "Title": "Hair question and hospital pamelahope pamelahope"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "May 24, 2012 09:57PM christina0001 wrote: Hello ellebee! We have a fair amount in common. I am 33 years old, dx with IDC. My chemo regime has been TCH (taxotere, carboplatin, and herceptin), every three weeks, with just the H each week in between. I have had five treatments, and only ONE left, which will be on Tuesday. It has been a long, hard road...but since just before the fifth treatment, my spirits have really been lifted, knowing I am close to the end. Hair: I was told my hair would start coming out around the third week, and that was spot on. I shaved my head about three weeks in. I still have a fair amount of stubble left; I wonder if I could have gotten away with keeping my hair and just wearing a hat, honestly. But I do not regret shaving my head, I think for me it would have been painful watching it fall out. It's a very personal choice, on how to handle your hair. Different women do it different, it's all about what feels right to you. I thought for sure I would wear wigs 24/7 but I actually wear a halo hairpiece + hat at work, a scarf when I go out otherwise, and nothing at home. I still have about 2/3 of my eyebrows and 1/2 - 2/3 of my eyelashes. Side effects: I can honestly say it was not as horrible as I thought it would be. My onc, and the PA and FNP that work with him, have been very active in helping me control all my side effects. I have never vomited. I have had very minimal nausea. The nausea medications I have, are outstanding. I did have bad stomach pain and it took us a few treatments before we found the right cocktail of meds to control that. I get very severe fatigue for 4 days each cycle. I stay home those days. I have been able to work full time otherwise, although I might have a day or two additionally that I need to make a short day. (Keep in mind I do not have kids. I'm not so sure I could have had energy to work if I had children to care for!) My fingernails have been sore, and at this point, six of them have some discoloration. I only had mouth sores one time, and they lasted for 48 hours. I do get a TERRIBLE taste in my mouth several days each cycle, and this has been progressively worse each treatment. Most food tastes fine, but fluids do not, plus there's just this terrible taste all the time. I have to work at getting enough fluids, and I still end up dehydrated and have to get IV fluids when I go in for my weekly treatment. I also get diarrhea each time. Unfortunately my first treatment it was worse than it needed to be. I read online that so many people get constipated, so I took stool softeners after my first treatment. DUMB DUMB DUMB! Lesson learned - don't be taking meds for side effects until you find out that you're going to have that side effect! lol I have a port, and I am grateful for it, although it hurt like the dickens for what seemed like forever. They put it on my left side since my cancer was on the right side (just so IVs would be out of the way during surgeries), and I have really regretted that, because I drive a lot and I hate when my seatbelt touches the port. It really hurt for the first several weeks especially; at this point it is just annoying. If I had it to do over I would have insisted on getting it on my right side and they can deal with the IVs. The biggest surprise to me was the menopausal symptoms. Did not really expect that, even though I think at some point it may have been mentioned to me. I get hot flashes, big time, especially at night. And my lady parts are dry like nothing I've known. Intimacy between my husband and I became impossible. This was very upsetting to me, we had only been married for a few months. Fortunately through research online, talking with my onc, and OTC products, we have been able to resume intimacy, in different but satisfying ways. I hope that is not TMI for people but I wish we had known before hand. It was very upsetting for me, I felt like a terrible wife. Fortunately my DH was 100% understanding, supportive and loving.  Best of luck to you! :)",
      "MessageIndex": 5,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/787983",
      "Title": "Chemo advice from veterans? Please post!!!! ElleBee pamelahope"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 3, 2013 04:15PM christina0001 wrote: I'm sorry you are here and that you are going through this. It sounds like you have a great team of doctors who are looking at everything closely. As scary as it is, at least you know what you are dealing with now. The waiting for testing to be done is pure torture, isn't it? The treatments, whatever they may be in your case, are doable. There are so many women here who have been through it and are still going through it, and at least for me, hearing their stories is so reassuring and inspiring. Take care of yourself emotionally right now, as best as you can, and keep us posted on how things go. :)",
      "MessageIndex": 12,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/808630",
      "Title": "Please help!! I don't know what to do! larst bcisnofun"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 16, 2012 05:14PM christina0001 wrote: I'm fairly similiar to that and I had TCH for my treatment (taxol, carboplatin, and herceptin). There's a website that you can go to and if you register as a \"provider\" (which is free and easy) it gives you recommended treatments. It's a little complex but not impossible to understand. I know there are links to it here on this website, I think in the TCH thread. Does anyone know it?",
      "MessageIndex": 2,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792069",
      "Title": "Urgent Request - What Chemo Treatment You Received hlya hlya"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 16, 2012 05:17PM christina0001 wrote: Here it is. Check out this website: http://www.nccn.org/professionals/physician_gls/f_guidelines.asp",
      "MessageIndex": 3,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792069",
      "Title": "Urgent Request - What Chemo Treatment You Received hlya hlya"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Mar 22, 2012 01:35PM christina0001 wrote: Sounds like you have a great plan and a great team of professionals! You will get through this!",
      "MessageIndex": 24,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/784165",
      "Title": "worried about everything anndh christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jan 19, 2013 09:33PM christina0001 wrote: ditto the suggestion for Dr. Love's Breast Book. I wish I had read it right from the get-go. I borrowed it from the cancer center's library right around the time I was finishing chemo, which was late May, and I still have not returned it. I reference it regularly. It is invaluable. If you end up needing reconstruction, I also recommend The Breast Reconstruction Guidebook, by Kathy Steligo. A new edition came out in November 2012. It is very good, very informative.",
      "MessageIndex": 6,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798949",
      "Title": "recommended reading for newly diagnosed? zennurse christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 12, 2018 12:28PM christina0001 wrote: Sending hugs and positive vibes! Good luck with your appointment tomorrow!",
      "MessageIndex": 8,
      "PostDate": "12/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868275",
      "Title": "Scared, Pregnant, and newly diagnosed bbfromkentucky1 Salamandra"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Apr 17, 2012 10:17PM christina0001 wrote: Last round of treatment, all I could stand to drink was bottled water with lots of ice and a slice of lemon. And even that wasn't great. My P.A. suggested I try Sobe flavored water so I have some in the fridge, waiting.",
      "MessageIndex": 13,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/785341",
      "Title": "What to drink to quench thirst? JoanQuilts Hortense"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jan 10, 2013 08:27PM christina0001 wrote: ditto - congrats on graduating - and staying cancer free!",
      "MessageIndex": 2,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/798654",
      "Title": "Donation made on behalf of 15 wonderful women capburke christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 24, 2012 07:23AM christina0001 wrote: Hello Becky, and welcome, although I am sorry you have to be here. But this is a great place for support and information. I was diagnosed in January at age 32. I think I cried for a solid week. The absolute, best advice I can give you is to not panic, and not rush into any decisions. I am a rush-type of person, let's do it now! But I made some decisions early on that I regret now; decisions I made because I did not fully understand all this. In most cases, there is no risk in taking a few weeks to think things through and gather information. I also encourage you to get second opinions before starting any course of treatment or deciding on surgery. I have really benefitted from hearing things explained twice. Different doctors just have different styles of explaining things. Also about halfway through this I read Dr. Susan Love's Breast Book. What a fabulous source of information! I would recommend it to anyone going through breast cancer. My cancer center has let me borrow it for free from their lending library, which many cancer centers have.",
      "MessageIndex": 9,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795242",
      "Title": "31 years old, just diagnosed IDC beckstar18 msphil"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 16, 2012 11:27AM christina0001 wrote: My surgeon said he should have the results within a few business days, but I told him I preferred to hear about the results at the one week follow up appointment.",
      "MessageIndex": 3,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/792062",
      "Title": "How long did it take to get final pathology results after bmx Pointvalue dogsandjogs"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jan 7, 2014 05:44PM christina0001 wrote: I have no advice, but I went through the same thing without the bleeding. My onc was sure I would lose all my nails, but I did not lose a single one. Eventually they all grew out and now (a year and a half post final chemo) they are completely normal, and have been for quite some time. Hang in there, this too shall pass.",
      "MessageIndex": 7,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/816510",
      "Title": "Question about nails, both hands and feet..Please help... Gubbyann christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 9, 2012 02:32AM christina0001 wrote: Thanks for sharing your stories and all the good advice, ladies. I spoke with my onc again today and he is sending me to his favorite breast surgeon on the 22nd for a 2nd opinion. I am terrified of a mastectomy, but I am at least feeling a little more open-minded about researching it (in between tears). Ugh, this sucks...I would not wish this on anyone.",
      "MessageIndex": 22,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788697",
      "Title": "Is choosing a lumpectomy a mistake? christina0001 lane4"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Dec 14, 2013 12:44AM christina0001 wrote: Dawn, did you get your MRI results back yet? Yes, one of the \"gifts\" of breast cancer is that people, in an attempt to be helpful, will email/mail/call you with every possibly myth of things that might \"cure\" cancer. This can be frustrating... you may want to assure your sister that you and your doctor are working out a plan for treatment, and that the advice is really not necessary.",
      "MessageIndex": 16,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815599",
      "Title": "Just diagnosed this morning... dawnettejh christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 21, 2013 04:54PM christina0001 wrote: Patsy, you might want to call your oncologist's office and see if there is a gastroenterologist they refer to regularly, and then go see him or her.",
      "MessageIndex": 2,
      "PostDate": "21/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/811352",
      "Title": "Long-Term Chemo Effect? peverson peverson"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 6, 2012 08:21PM christina0001 wrote: So many communication issues is NOT normal. Getting through the tests is a necessary evil, in order for the doctors to figure out what is going on. I know the wait time between having the tests and then getting an explaination of the results from your doctors can be so frustrating. But I think it is better to have a sit-down consult with them where you can ask all your questions, rather than become stressed with the expectation that you can have so many questions asked every day. Keep a log of your questions, so you don't forget them, and then ask the doctor about your concerns in person during your consults. That would be my advice. I really hope you get to have a long, thorough consult with your onc today, followed by a long, thorough consult with your surgeon. If after you have met with both of them and you are still feeling confused or unsure, I would look for someplace to go for a second opinion and possibly change where you receive your care.",
      "MessageIndex": 5,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790173",
      "Title": "Finally, my follow-up with MO is today, angry going into it _Ann_ christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 26, 2013 09:00PM christina0001 wrote: I would encourage anyone thinking about this to clear it with their MO. I'm no doctor or researcher, but this sounds like a fabulous way to get sick. A healthy, and perhaps light diet before and after sounds more reasonable than a fast.",
      "MessageIndex": 14,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/804844",
      "Title": "Fasting before Chemo? TV1156 carla53"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "May 30, 2012 05:03AM christina0001 wrote: http://www.breastcancer.org/symptoms/diagnosis/dr_questions.jsp",
      "MessageIndex": 1,
      "PostDate": "30/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788050",
      "Title": "Questions to ask DR. lbrewer christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "May 28, 2012 09:23PM christina0001 wrote: ellebee I work full time and my treatment was every 3 weeks; each treatment cycle I had four days where I really could not work or do anything at all. The other days were decent; I just had a few where I had to call it a day early, after 4-6 hours. I think it would be reasonable to expect to need some time off, but it is hard to say until you go through it and see how you react to it. Also, on one hand, some symptoms are \"cumulative\" and may get worse with each treatment, but on the other hand, as you learn to successfully manage symptoms, they may get better with each treatment or become a non-issue. It's so hard to say. Chemo seems to affect people so differently.",
      "MessageIndex": 17,
      "PostDate": "28/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/787983",
      "Title": "Chemo advice from veterans? Please post!!!! ElleBee pamelahope"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jan 20, 2013 12:21PM christina0001 wrote: Good for you! Keep busy and keep doing the things you love. We must refuse to let cancer steal all the good things in our lives!",
      "MessageIndex": 10,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799084",
      "Title": "Just Diagnosed shadytrake beacon800"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 6, 2012 07:30PM christina0001 wrote: When in doubt, get a second opinion. The peace of mind is well worth it.",
      "MessageIndex": 13,
      "PostDate": "06/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792986",
      "Title": "Oncology consult and chemotherapy Waitingforthenextstep maa764"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 16, 2012 10:07PM christina0001 wrote: My mom \"only\" had 4 chemo treatments, did not have a port, and is now 10+ years post-chemo and very pleased that she never had a port. Her veins are still pretty good. My aunt had 6 chemo treatments, did not get a port, and unfortunately her veins are absolutely ruined, it is a nightmare for her to get any blood drawn. I'm doing TCH with the H (herceptin) every three weeks for a year so you had better believe I got a port! I don't like it but it is WAY easier (less painful) than getting an IV each time. That's a tough choice you have to make and I think you just have to do whatever feels right to you. I will also mention, this is my second port - the surgical site from the first one never healed well, and it had to be removed and I had to get another one. Having the first one removed was quick and painless for me. I'm sorry your friend had a bad experience but it was really no big deal at all for me.",
      "MessageIndex": 18,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792072",
      "Title": "Port or no port??? Camillia lago"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jan 4, 2013 09:07PM christina0001 wrote: From my personal experience: go on and see the surgeon, but have a consult with an oncologist before making any decisions.",
      "MessageIndex": 10,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798393",
      "Title": "seeing a surgeon, not an oncologist ihearthedgie Speedy4"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 15, 2012 10:21AM christina0001 wrote: The fear and the pain are totally normal. It's funny how our minds play tricks on us. My breast never hurt until I found out there might be cancer in it, and then it started hurting all the time. The waiting in between appointments is the worst part. It's enough to make anyone crazy. ditto the above - keep exercising, it's so good for you physically and mentally.",
      "MessageIndex": 12,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790564",
      "Title": "So scared mlo69 camillegal"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Feb 2, 2014 06:15PM christina0001 wrote: I would be very skeptical of anything that claims to help you keep your brows and lashes during chemo.",
      "MessageIndex": 39,
      "PostDate": "02/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781368",
      "Title": "Eyelash and Eyebrow Regrowth Rockym eulainemc"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 14, 2012 10:46AM christina0001 wrote: The waiting for information and appointments is the WORST. Seriously! This will come to pass though, so don't panic. It is okay, it is unusual for a period of days and weeks to make a significant difference in treatment or outcome. The doctors would know if this were an issue in your mother's case. Use this time to your advantage. This is a time to learn more about breast cancer, so you know what you are facing. My mother was diagnosed and treated over 10 years ago, and she is doing GREAT, ZERO reoccurance. Most of us do get through this just fine. It is a battle, and it is scary, but the odds are in your mother's favor. There is NO POINT in despairing over why this happened to her. Why does anything bad happen to anyone? You can drive yourself crazy thinking those thoughts. All you can do is accept it, make a plan of action, and move forward.",
      "MessageIndex": 14,
      "PostDate": "14/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/794714",
      "Title": "Absolutely Terrified needhope Racy"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 22, 2012 09:47AM christina0001 wrote: I hope today is better for you. This stuff sure sucks, some days more than others.",
      "MessageIndex": 3,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793889",
      "Title": "Not a good day today - feeling overwhelmed..... nextnln mamabee"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 7, 2013 02:31PM christina0001 wrote: Okay girl, quit trying to be a hero! I get your reluctance to take pain meds, I am the same way. BUT it is much harder to get pain under control once it gets bad. And sitting in a hospital waiting room all day is uncomfortable for anyone, much less someone who just had surgery! Take it easy on yourself! Glad you are feeling better... you may want to at least routinely take over the counter pain medication for a day or two as you continue to heal. Getting good rest is so important for healing; don't feel shy about using the Vicodin at bedtime if it will help you sleep comfortably through the night. No you are not being a wimp. I get grossed out by surgical stuff too, especially my own. But I will say, it's usually not as bad as I make it out to be in my head. You may want to ask someone to help you if you are very nervous although I have been too shy most of the time to ask for help (unfortunately I have had several surgeries by this point in my journey!). Yes you want to wear a bra, it will help support things and allow things to heal. I would suggest wearing something very soft and comfortable, that you won't mind getting stained as you may have some drainage get on it. If the bra feels like it is rubbing, a piece of gauze placed between the incision and the bra can help. Emotional stuff - totally normal. You are coping with a recent diagnosis, and now also recovering from surgery. It's completely normal to have mood swings, feel sad, feel angry, feel any variety of emotions really! Now is the time for emotional self-care. Do things that help you relax and feel good, whatever they may be. Now is a time to try to pamper yourself. And you can always come here to vent or to chat! :)",
      "MessageIndex": 1,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808981",
      "Title": "Questions after lumpectomy SophiaMarie christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 6, 2012 02:20PM christina0001 wrote: The waiting is the worst part. But if her surgeon says it's okay to wait, then it is. It is almost always okay to wait and it does not sound like your wife has any special circumstances that would hasten this. Best of luck to you, your wife and your family.",
      "MessageIndex": 10,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/794543",
      "Title": "need one answer! Cadillac Cadillac"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 2, 2013 11:43AM christina0001 wrote: My taste buds changed big time during chemo, and yes, they went back to normal after I was done. Just try to eat as best as you can while you are going through this!",
      "MessageIndex": 5,
      "PostDate": "02/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/813351",
      "Title": "unable to eat meat and other questions about chemo lovewins encyclias"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 17, 2012 09:49PM christina0001 wrote: I think that is a little extreme. I would see your doctor and have them give you a thorough check up. I hope you feel better.",
      "MessageIndex": 1,
      "PostDate": "17/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/793626",
      "Title": "Tired, tired, tired ketch christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Feb 29, 2012 02:27AM christina0001 wrote: I'm sorry you are going through this. I am 32 and my husband and I were planning on starting a family at the end of this year, so I can relate. My onc told me that there was a chance the chemo would affect my fertility, but it wasn't a huge chance and she was more concerned about how hormone therapy would affect things. Regardless, the most important thing she did was to ask me if I wanted a referral to a fertility specialist who also had an expertise in oncology issues. This may be what you need. I would ask whichever onc you feel most comfortable with, if they have a fertility specialist on their team you can speak with. At a certain point, after gathering enough information, you just have to decide how much risk you can live with, and make a choice. It's not easy but there are no guarantees in life, whatever you choose. Best of luck.",
      "MessageIndex": 2,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/783344",
      "Title": "CHEMO OR HORMONE THERAPY HELP! sj29 Ericashoe"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 3, 2013 06:19PM christina0001 wrote: This is a very serious thing to make a decision on. I would encourage you and your wife to get a second opinion. Fresh eyes reviewing her situation can be so helpful.",
      "MessageIndex": 2,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/808762",
      "Title": "Cancer free after surgery, is chemo still required? dltvlt ruthbru"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jul 13, 2012 09:04AM christina0001 wrote: mlo - it's impossible but mentally try to be prepared that diagnosis information may change as you undergo more tests. When is your follow up appointment? Do you know what the next step is? I would definitely get a copy of the pathology report. I have referred to mine many, many times over the past six months. Have they determined what stage you are at? Stage and grade are not the same...you can look at information at breastcancer.org for information on what these things mean.  This is the hardest part. Right now, draw on whatever supports you have in your life. You'll need it! Spouse, children, parents, friends...this is when it all counts the most. Also, treat yourself well right now. This is not the time to overextend yourself. Do whatever it is in life that helps you relax. You will get through this but the next few weeks are going to be rough. We are here for you!",
      "MessageIndex": 8,
      "PostDate": "13/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790437",
      "Title": "Not a club I want to be in... mlo69 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 2, 2012 06:18AM christina0001 wrote: This year sure has been rough. Hoping for a happy, healthy 2013!",
      "MessageIndex": 4,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795718",
      "Title": "This year has been the worst!!! vanice62 vanice62"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 30, 2013 09:07PM christina0001 wrote: I am going to be honest and I am speaking as someone who works in healthcare and with many dementia patients over the years. Dementia is a horrible disease. It sounds like right now your aunt has a reasonable quality of life. That could very well change a couple of years down the road, maybe more, maybe less. I would personally much rather pass away from cancer than suffer through end-stage dementia. Before seeking treatment, you may want to ask her oncologist for an estimated prognosis with no treatment, and then meet with her neurologist (or whoever is managing her dementia) and get that doctor's thoughts about treatment and her prognosis regarding her dementia. I will also say that many (but not all) dementia patients do not do well with anesthesia and for some it seems to cause a significant decline in their cognition. A dementia patient may pick at bandages and incisions, not understanding why they are there. A dementia patient will become more likely to fall and more confused when taking pain medication, which will be needed after surgery. I know this sounds pessimistic and I do not mean to be cruel, but this is what I have seen and they are things you might want to think about, and prepare for if she has surgery. Sometimes the best thing we can do for a loved one, is to just give them the best quality of life possible and keep them as comfortable as possible. I'm so sorry you are having to deal with this, it is so hard to make these decisions for a loved one.",
      "MessageIndex": 7,
      "PostDate": "30/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/810087",
      "Title": "90 yo just diagnosed with IPC--what to do? bronxville Beesie"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Dec 14, 2013 01:48AM christina0001 wrote: TB90, as others have said, it's such a personal decision. I chose a UMX because A. all my doctors agreed that in my case, there was really no advantage to having the healthy breast removed (although they would have supported me if I wanted a BMX), B. I wanted the least amount of surgery while being safe, and C. I found the idea of keeping at least one natural breast very appealing as a reconstructed breast does not have much sensation. While annual mammograms on my healthy breast are always stressful, I do not regret my decision at all.",
      "MessageIndex": 20,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815319",
      "Title": "How to decide to have the \"other\" breast removed. TB90 Stenokim"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 16, 2012 05:10PM christina0001 wrote: Camilla, I was so nervous about getting neulasta after reading the boards here. It seemed like everyone had a lot of bone pain. I had it six times (one for each chemo treatment) and it was no big deal at all. A few days after the first time I had it, I did have some sharp, shooting pains off and on for a day - annoying but not terrible, and it was just for a day. After that, I never had any bone pains after any of the rest. For me at least, it was no big deal at all.",
      "MessageIndex": 11,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792070",
      "Title": "Neulasta??? Camillia Maggs09"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 4, 2012 07:41PM christina0001 wrote: There's nothing wrong with taking an antidepressant. Cancer is so emotionally challenging. I've needed anti-anxiety medication from time to time during all this. Chemo is terrifying to think of, but I will tell you that it was not nearly as bad as I thought it would be. My consult went okay but the first time I went to chemo, I cried the whole way there and tried to convince my DH to turn the car around. I cried for off and on for about the first 30 minutes, too. Having said that, a person can adapt to just about anything. I won't say I enjoyed chemo, but I enjoyed the quiet time sitting in the chair. I enjoyed getting to know the staff and other patients. I enjoyed reading, which I never have time to do. I had about four days each cycle where I was very fatigued, and couldn't really get off the couch. I didn't enjoy feeling that way, but there was something peaceful about it, about taking time to relax against my will. Since going through this, I have learned that I need to make more time to do that. Anyway, the media portrays chemo as a horrific experience where you lie retching in a toilet all day and night, and wish you were dead. For most of us, chemo is not anything like that. I never threw up. I had mild nausea 2-3x that was well-controlled by medications my oncologist made sure I had. I had mouth sores for all of 48 hours. My biggest problems were fatigue, and stomach pain. I know it's hard, but look forward to meeting with the oncologist. Your oncologist is the leader of a team of skilled professionals who are going to help you literally fight for your life. They deeply care about your well-being, and want you to get through this. Do not hesitate to tell them every concern and ask every question you have through this process.",
      "MessageIndex": 2,
      "PostDate": "04/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792986",
      "Title": "Oncology consult and chemotherapy Waitingforthenextstep maa764"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Apr 20, 2012 10:40AM christina0001 wrote: :) Thanks for posting this.",
      "MessageIndex": 1,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786151",
      "Title": "3 years!!!! Lovegolf SelenaWolf"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Dec 7, 2018 09:36PM christina0001 wrote: It is nerve wracking!!! Jen is right, do NOT Google! This weekend take care of YOU, do whatever helps you to de-stress. I hope you get very boring, benign results! We are here for you.",
      "MessageIndex": 11,
      "PostDate": "07/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868735",
      "Title": "So anxious about these results - any input is so welcomed! wonkafloyd wonkafloyd"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Mar 2, 2012 09:05PM christina0001 wrote: I have had that happen, but more mild than what you describe. It has happened a handful of times, and it passes after what seems like 5 - 15 minutes. Always in the middle of the night, wakes me up. It reminds me of an anxiety attack and the first time or two, I wasn't sure if it was anxiety or from the treatment. Yes if you are worried about it, talk to your doctor about it.",
      "MessageIndex": 5,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/783529",
      "Title": "HERCEPTIN Terry71 Terry71"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Sep 17, 2013 09:30PM christina0001 wrote: Everybody reacts differently. I have a desk job and usually work 40-45 hours/week. I took intermittent FMLA and used a little. I had to take a day off for every chemo treatment (it takes hours) and then every treatment cycle I would have 4 days where I had ZERO energy. Two of those days fell over the weekend so I only needed to take off two days every three weeks. So it was very doable for me. The best advice I can give anyone is: 1. Take care of yourself during all this: eat well, make a point to get good sleep, stay hydrated 2. Listen to your body - enjoy the good days, take it easy on the rough ones - don't overdo it 3. Communicate with your oncology team. For example, I had a lot of stomach troubles (not nausea, it was pain) and it took a few changes in medication before my doctor found the right combo of drugs that gave me relief. This is not the time to \"suck it up;\" be honest and let your doctor know what is going on. There are so many things they can give you to control side effects. Good luck to you!",
      "MessageIndex": 7,
      "PostDate": "17/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/811093",
      "Title": "Working while going thru treatment Yogagal segunda"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Oct 18, 2012 09:50PM christina0001 wrote: I can totally relate! I was terrified in the beginning and couldn't wrap my mind around it at all. I cried a lot over it. My head kept screaming, \"But I don't feel sick!\" So why take something that will make me feel sick!?! It made no sense. I struggled with this off and on through chemo treatment too. But now that it is all done, I am so glad I did it. I feel like the chemo went through my body and killed off all those bad cancer cells. I think it was not until about 2 treatments in that I felt like I was starting to emotionally accept that the chemo was good for me. Sometimes I wonder if I only was able to accept it because at the cancer center, I saw people who clearly WERE sick from cancer, and I realized that the chemo was going to keep me from getting sick like they were, bless them.",
      "MessageIndex": 5,
      "PostDate": "18/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795102",
      "Title": "Starting chemo in 2 weeks from today. Help! Noranelly Noranelly"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jan 25, 2014 07:09PM christina0001 wrote: Welcome sweetjam, although I am sorry you have a need to be here. Getting diagnosed is such a blow, and I think the fear and uncertainty while waiting for test results, and waiting for a definitive treatment plan, is worse than any treatment itself. Sounds like you have a lot going for you - small tumor, and otherwise good health. Definitely don't hold back when asking your doctors to not only explain what treatment they recommend, but why they recommend it. And don't hesitate to get a couple of different opinions, if you are still uncertain. I got two opinions before I decided to have radiation, and while I ended up going with the first radiation oncologist, I was very grateful for my consult with the second radiation oncologist, because she explained things a little differently, and it helped me understand. Even if you are wary of chemo, I'm glad you are going to meet with the oncologist and learn a bit more about it. If it is any reassurance, I finished chemo a year and a half ago... I have had no lasting effects from it. But of course, long term side effects do happen for some.  You are correct in your concerns about healing during and after chemo, and this is why your doctors will probably have you wait a bit in between chemo and surgery, to make sure you do heal well. I also agree that if you are planning on a mastectomy, then shrinking your tumor is not as big of a concern as it would be if you were having a lumpectomy. But the chemo may be helpful if cancer cells have passed outside of the breast. I imagine your doctor may possibly want to test your lymph nodes for evidence of this, but even if that comes back negative, it is not a 100% guarantee that the cancer cells have not spread. You feel like you have no choices... cancer is sort of a series of one crappy choice after another IMO. Chemo or no chemo? Radiation or no radiation? Lumpectomy or mastectomy? Unilateral or bilateral mastectomy? What kind of reconstruction? Hormone therapy? Survival rates versus side effects... it's a bit of a maze. There is so much good information on this website, and hopeful the information here, plus good information from your physicians, will help you navigate it all. Best of luck to you!",
      "MessageIndex": 3,
      "PostDate": "25/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/817294",
      "Title": "This Sucks! sweetjam vbishop"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 22, 2013 08:19PM christina0001 wrote: My husband came with me during each of my chemo treatments. The company was nice, as it is a long day.",
      "MessageIndex": 16,
      "PostDate": "22/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806223",
      "Title": "Who came to your chemo treatment? NisaVilla christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Jun 24, 2012 09:36AM christina0001 wrote: So sorry for the horrible news. Your mom is lucky to have you with her for support.",
      "MessageIndex": 4,
      "PostDate": "24/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789384",
      "Title": "Please Help Kimmie32 christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Nov 9, 2013 09:22AM christina0001 wrote: Welcome Misty, although I am sorry you have a need to be here. I think the waiting for test results was emotionally the hardest part. BRCA testing does take long to come back, which is frustrating. I think mine took close to a month. This is the worst part of the journey, in my opinion. I was diagnosed stage IIa at age 32 so I can related to some of what you are going through, although I did not have children. I know this is terrifying but we are so fortunate that there are good treatments they can use to get us through this. You will get through this too. Count on having a rough year or two - you're going to find out exactly how strong you can be, and it's going to blow your mind. You can do this! There will be light at the end of the tunnel.",
      "MessageIndex": 3,
      "PostDate": "09/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814259",
      "Title": "Just diagnosed and devastated princessblu christina0001"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Apr 17, 2012 07:21PM christina0001 wrote: Totally understand, I love this site too but sometimes I do have to take breaks from it. Some days I just don't want to think about cancer anymore. Best of luck to you.",
      "MessageIndex": 2,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785994",
      "Title": "41 and just diagnosed w/ IDC sweetpea23 sweetpea23"
    },
    {
      "AuthorID": "christina00…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143803/profile",
      "Content": "Aug 12, 2012 11:45AM christina0001 wrote: I wish I had done chemo first; I'd have only needed a lumpectomy instead of the mastectomy, I bet. The best advice I can give you is to try to relax (HA!), try to rest and do what makes you feel your physical best. There are lots of posts here about things you might want to have on hand to be prepared; you will probably only need a fraction of what is suggested but it's nice to have things on hand just in case. Let us know how your appointment goes!",
      "MessageIndex": 4,
      "PostDate": "12/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/791890",
      "Title": "Chemo before surgery for stage IIb grade 3 jojo2373 jojo2373"
    }
  ]
}