{
  "AuthorID": "Chrys23",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
  "Posts": [
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 31, 2011 08:47PM Chrys23 wrote: Hi Mybails: I am actually taking the week AFTER chemo each time to recouperate. Everyone is different and I had horrible muscle & body pain/leg weakness/leg giving out during my first chemo session 3 weeks ago. There is no way I could have worked. I'm glad other ladies can work; I just can't. My temp even elevated close to 100.0, so it is a no-brainer for me to take the week after chemo off. My transfusion days are Wednesdays, and I work from home Wed/Thurs/Fri, then take the following week off as disability as those seem to be my worse days (days 4-9). I then go back to work for a week and a 1/2 and then start over again. Just had my 2nd chemo today (8/31) and will be out next week and back by Sept. 12th. Take Care and enjoy the holiday weekend!",
      "MessageIndex": 49,
      "PostDate": "31/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771494",
      "Title": "Poll: How many ladies worked through Chemo? Chrys23 Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 11, 2011 07:13PM Chrys23 wrote: Hey Snoopy~ I see we are 'twins'! Did you have a lumpectomy or BMX? I may have to go in for another re-excision; I'll know more tomorrow. I'm glad to hear you are working. My job is pretty flexible (has been in the past) and I've worked from home before -- I'm hoping they will continue to be flexible. I'm the only person that can do my specialized job and they would really be hurting if I was out 4 months.  I guess I'll have to see how I feel.",
      "MessageIndex": 3,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771494",
      "Title": "Poll: How many ladies worked through Chemo? Chrys23 Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 12, 2011 06:03PM Chrys23 wrote: So interesting to see most ladies have worked through Chemo, which is encouraging. And yes, it all depends on what SE's I may happen to experience; I think that is my major worry at this time due to me being sensitive to any type of medicine.  I had my tongue swell by just eating one tempura shrimp once; I can't imagine what Chemo will do to me! I 'pray' my employer is flexible -- I've worked from home when I just didn't feel like going in and they allowed that. They better make it work for me!",
      "MessageIndex": 20,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771494",
      "Title": "Poll: How many ladies worked through Chemo? Chrys23 Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Chrys23 wrote: Hi! I will probably start Chemo early to mid-August. I'm checking to see how many of you worked while going through treatment and if it is indeed possible to do so. Also, how many took time off? I work for a large Ivy League University and have 6months 100% paid short-term disability, but don't want to be out of work for 4 months (my treatment will be 4 rounds every three weeks of TC). Is it possible to either work from home or just take 2-3 days off a month when the chemo side effects kick in? Any comments/suggestion would be welcome! Best Wishes, Chrys Lumpectomy & SNB 6/9/11; Re-excision 7/21/11; Chemo started 8/10/11 (TC 4x - every 3 weeks); Radiation sometime in November Dx 5/17/2011, IDC, 2cm, Stage IIA, Grade 2, 1/6 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771494",
      "Title": "Poll: How many ladies worked through Chemo? Chrys23 Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 22, 2011 06:48PM Chrys23 wrote: Thanks ladies -- I am tentatively scheduled to start Chemo on Wednesday, August 10th. My center doesn't do infusions on Thursdays. Hopefully my margins will be clear (just had a re-excision yesterday) to be able to proceed with treatment. I will probably be out of work on Wednesdays (infusion) and Thursday (for Neulasta Shot) and Fridays too. Perhaps I can work from home those days and have the weekend to rest. I guess we shall see how it goes.  I am still sore and in some  slight pain that comes and goes (the dr had to cut thru some scar tissue and I had a hematoma last month), so they said I would be a bit more sore than normal. I'm icing up 20mins on then 20mins off religiously this time. I just don't want another hematoma to form. I hope everyone is doing well and will be enjoying the weekend. Best, Chrys",
      "MessageIndex": 27,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771494",
      "Title": "Poll: How many ladies worked through Chemo? Chrys23 Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Chrys23 wrote: Hi! I will probably start Chemo early to mid-August. I'm checking to see how many of you worked while going through treatment and if it is indeed possible to do so. Also, how many took time off? I work for a large Ivy League University and have 6months 100% paid short-term disability, but don't want to be out of work for 4 months (my treatment will be 4 rounds every three weeks of TC). Is it possible to either work from home or just take 2-3 days off a month when the chemo side effects kick in? Any comments/suggestion would be welcome! Best Wishes, Chrys Lumpectomy & SNB 6/9/11; Re-excision 7/21/11; Chemo started 8/10/11 (TC 4x - every 3 weeks); Radiation sometime in November Dx 5/17/2011, IDC, 2cm, Stage IIA, Grade 2, 1/6 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771494",
      "Title": "Poll: How many ladies worked through Chemo? Chrys23 Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 26, 2011 07:19PM Chrys23 wrote: My 1st Neulasta shot has to be done at the center ( some new NJ law in the event of side effects) But after that I can do them at home or have a home nurse administer. I live in NJ and my facility is in PA - so an hour drive on a good day!",
      "MessageIndex": 44,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771494",
      "Title": "Poll: How many ladies worked through Chemo? Chrys23 Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 26, 2011 06:05PM Chrys23 wrote:",
      "MessageIndex": 38,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771494",
      "Title": "Poll: How many ladies worked through Chemo? Chrys23 Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Chrys23 wrote: MRI last Friday showed \"enhanced masses\". Follow-up ultrasound today showed a lymph node in the same breast that could be \"abnormal\". Also there may be little cells right next to the tumor. Waiting to hear if lumpectomy and SNB will still happen Thursday. To me it would make no sense to cancel it just to biopsy the lymph node when they were planning on be in that area anyway during surgery. I'm so scared. This is a nightmare... And to think, the NJ doctor DID NOT want to order an MRI. The thought makes me ticked off and sick! Please pray for me Lumpectomy & SNB 6/9/11; Re-excision 7/21/11; Chemo started 8/10/11 (TC 4x - every 3 weeks); Radiation sometime in November Dx 5/17/2011, IDC, 2cm, Stage IIA, Grade 2, 1/6 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770017",
      "Title": "Ultrasound shows suspicious lymph node. So scared Chrys23 Beeb75"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jun 7, 2011 07:04PM Chrys23 wrote: The surgery will proceed as planned on Thursday (That's good news to me!)-- heard from the doctor's office. His nurse said he wasn't too 'overly concerned with the mildly abnormal lymph node' but they will be checking it none the less. I pray it's nothing, but only time will tell. Chrys",
      "MessageIndex": 3,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770017",
      "Title": "Ultrasound shows suspicious lymph node. So scared Chrys23 Beeb75"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 29, 2011 11:01AM Chrys23 wrote: Morning! I hope someone will respond...I just had a re-excision last Thursday and called for the path results today.  I spoke to my BS's nurse as he is in surgery today.  They got very, very wide margins of DCIS cells that were near the tumor cavity, which is great. However, there is a .3mm focus of invasive cancer near my original biopsy site, which he went in that way to clean up tissue and skin as well. While I know everyone is different -- does anyone know what they do in that case. Will they have to do another re-excision? or can they wait for radiation (over 3months away). I'm \"tentatively\" scheduled to start Chemo on August 10th and now I'm not sure if that will happen. Plus, I'm dealing with some weird throat issue after the surgery -- swelling and mucous problem which my ENT thinks is related to some type of reflux from the surgery.  The nurse said she would review this with the surgeon on Monday and while I'll be seeing him anyway next Wednesday for my 10-day follow-up, I want to hear on Monday what he thinks. Why can't it ever be easy?! I just want to start treatment *sigh* Thanks for listening!",
      "MessageIndex": 11,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/770568",
      "Title": "MUTIPLE RE-EXCSIONS ( after lumpectormy) Allenan Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 22, 2011 10:01AM Chrys23 wrote: ProudMom -- Many thanks! Just called the Onc's office and my Echo was good, so I will definately start the Adriamyacin tomorrow. I go to Philly at 9.  Fingers crossed! I hear it's strong stuff, so I pray I have no reactions. Best, Crystal",
      "MessageIndex": 1415,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 24, 2011 09:56AM Chrys23 wrote: MUTT1963: I'm glad you found my post about the allergic reaction to Taxotere. Seems, though -- I had a reaction after my first round of Adriamycin yesterday   As soon as I got the push of it in my IV I tasted the meds and then we left to eat lunch at the hospital cafe. My legs immediately started tingling and my right leg started to mildy itch. So, back upstairs to the breast center.  We waited almost an hour or so to see the doc and he was even baffled. He told me to watch it and take Benadryl or the Hydrozyzine they had prescribed for the break-out of the Taxotere rash. I arrived home and I get a little hive on my right leg and my mouth is tingling. This is just awful. I slept all night and took my anti-itch meds, but todayI feel off, a bit queasie and I'm scared that I'll break out again -- especially since my Neulasta shot is this afternoon. It seems my body just doesn't tolerate this stuff all too well and I only have one more to go. Prayers please.....",
      "MessageIndex": 1430,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 29, 2011 10:17PM Chrys23 wrote: I appreciate all of the kind words of support -- thank you for allowing me to come and share my experience; even if it hasn't been the most pleasant. It means a lot. BDavis: To be honest, I had to call the emergency on-call dr again today; hard to swallow, severe throat spams, burning and itching skin and welts -- and it happened to be my Onc on call. He even mentioned today on the phone that he may not want to do the last treatment; that the risks for me are just too dangerous. If that ends up being the case; at least I did all I could. I really don't want to take the 4th and final treatment next week  and then I end up in the ER or dead because my sensitivity to the chemo (not exaggerating). If I'm having this bad of a reaction now and it's cumulative -- the final one next week may do me in - in all seriousness. It's not worth the risk to me. I have a husband and my son just turned 21 yesterday. It's been like hell at home with everyone seeing me suffer.  My next question would be -- if I do have to stop and God forbid I have a recurrance, how would I ever be able to take chemo again? I guess my body has already answered that fact for me. Seems to me my Onc has  never seen a case like mine either.  He said on the phone he has never had anyone have an allergic reaction to A/C.  But that can't be true....I guess there is a first time for everything. Again, thank you everyone....",
      "MessageIndex": 1477,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jun 23, 2011 12:01AM Chrys23 wrote: Hi everyone! I just met with my BS today to go over my pathology report (I posted this info in the \"Newly Diagnosed\" section as well, so sorry if you are reading this in duplicate): I just had a lumpectomy on June 9th (have a stupid old, sore hematoma and seroma from it!!! ) My tumor was originally listed as 1.5cm during the biopsy, but on the path report it is listed as 2cm from end to end. Also, while they got the all of the tumor out and the margins were pretty 'clean' for that - on the median border of the tumor cavity were DCIS cells!!! (listed as <0.1 cm from the inked resection margin). I also have lymphovascular involvment along with 1/6 lymph nodes positive. (booo!). My case has to go up to the tumor board because there may be a concencous to take more nodes (I hope not) to see how the med oncologist is going to treat me. The tumor board meeting is July 11th and I will hear the results on July 12th.  I do have a medical onc meeting (first consult) on July 5th.  Hopefully, the 2nd lumpectomy will be sometime during the last 2 weeks in July. I guess Chemo is in my future, but I will discuss that with the med onc on 7/5 as well as him sending out my sample for the Oncotype testing too.   Has anyone else had lymphovascular invasion? That kinda freaks me out....If I have to have chemo, so be it, I just hope they can get everything. Also, is it better to have a BMX since I have some semblence of DCIS in my right breast? Many thanks! Chrys",
      "MessageIndex": 1046,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 3, 2011 12:47PM - edited Jul 3, 2011 12:48PM by Chrys23 Good afternoon! Back from vacation yesterday and reality has unfortunately set in. I was fine when I was away, hardly ever thought about BC. However, my boob started oozing and bleeding dark red blood (lightly) last Saturday, when I had just rolled up to my vacation shore home for the week. Wow....I called the dr and they said the hematoma from my surgery (6/9) was probably liquifying, so to keep gauze pads in my bra. It's been oozing on and off for the past week -- nothing heavy. Today, my boob is weird; hardness under the nipple area and still swollen. No pain. I see the oncologist this coming Tuesday and I may have re-excision surgery next Thursday. My only dilema is that if my boob is still not totally healed in 3 weeks (I'm about 3.5weeks now -- it will be 4 weeks on 7/9), if they cut in to it again, what the hell is it going to do -- swell up even more with more pain?! I got a hematoma quickly and it's not resolved yet. I'm just afraid I'll get another  hematoma, etc. I already had to go to the ER on June 18th, because of swelling, pain and tenderness (hematoma diagnosed then and was put on Keflex antibiotics as a precaution, though I never developed fever or bright redness in the breast). I see the onc on Tuesday 7/5, and the BS again on 7/12 after the tumor board meeting on 7/11.  I don't know if I should just do a BMX to get this all over with... so much to think about. Sorry to write this here, I just am sick emotionally to be thrown in to this 'stuff' right after vacation, when I was relaxed and happy.....Back to reality I guess. Thanx for listening! Chrys",
      "MessageIndex": 1138,
      "PostDate": "03/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 6, 2011 07:00PM - edited Jul 6, 2011 08:52PM by Chrys23 Afternoon! Had my meeting with the Onc yesterday which was a long meeting, but interesting. Since my case is going to the Tumor board on Monday, he made sure I understood what the 'debate' was over my case: 1) Do I need more surgery to clean out the remaining DCIS that is in the margin and 2) Do I need another lymph surgery.  He told me he would definately vote on Monday, that to NOT have another lymph surgery to test more nodes. He specifically stated he felt to \"go in there and start digging around, will cause more harm than it's worth\" . That's fine by me! I go back to see the BS on Tuesday, the day after the conference to hear the verdict on another lumpectomy. When I asked the Onc if he thought a BMX would be beneficial, he did not think so. Most of the meeting centered around treatment, which would definately include Chemo since I had one positive node, which I am fine with. Then -- radiation.  He would to TC chemo on me -- a short cycle of 4x every 3 weeks.  I will not be doing a port -- the Onc and the new fellow were very adamant that they are concerned about infection and since I'm only doing 4 treatments, they think they can manage. They actually had a Chemo nurse come in to look at my left arm and she thought it was doable.  They will try it and in the event I need fluids or something else, we'll change course if need be. I'm fine with that. I actually had to sign a waiver for the Oncotype test as they just can't 'order' it without your signature.  He actually didn't think I needed to order it, because it's a given I was going to do chemo (at least for me it is), but he said he is curious to see what the score is, and so am I.   He's right -- even if I didn't ask for it, having the Oncotype isn't going to change my opinion or my diagnosis on whether I was to do chemo or not. I have a positive node, I have vascular involvement present -- so for me, it's a no brainer --- I want the chemo to help my chances of getting rid of whatever may be in my body.  (I pray this will be the case).  I guess for me, the main question that's nagging me is if I can live with another lumpectomy and not 'stress' over the cancer recurring in the affected breast (right side) or on the left, which is now fine.  I heal VERY slowly and to go thru such a surgery is scary and I don't know if I'm ready for that now, so maybe I've answered my own question.  Even with a BMX, the cancer could have traveled anywhere so would taking off my breasts really make a difference? Ugh, I hate these decisions.   But to be honest, another long surgery, with a month of recovery time is not appetizing. I want to get on with my treatment -- pronto. So, if I can do a re-excision in the next week or so, I can start chemo in 3 weeks.",
      "MessageIndex": 1148,
      "PostDate": "06/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 13, 2011 11:01PM - edited Jul 13, 2011 11:08PM by Chrys23 Hi B! I meant, 4months for Chemo -- which in essence is having radiation about 5months from now. That's what I meant about 'waiting 4 months'; I meant after Chemo is over with  Just seems like a looong time since the nodes 'could' have cancer in them and while you're getting chemo, you are not radiating the lymphs at that point. **Madismommy: I hope the soreness gets better for you in both your arm and in the port. I won't be having a port put in -- the Onc didn't want me to get an infection and they had a Chemo nurse come look at my veins during my consult; they are going to try to go the IV route, which is fine by me.",
      "MessageIndex": 1256,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 3, 2011 09:42AM Chrys23 wrote: TonLee:  Thanks for the information on the Rads -- it's helpful! So hard to always know the right decisions with all of this, isn't it? Elizabeth1889: Thank you! I hope the chemo has limited SE's for me. I'm a bit nervous as I am VERY sensitive to medicinces (as evidenced by my throat issue after surgery/anethesia).",
      "MessageIndex": 1295,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 5, 2011 08:36AM Chrys23 wrote: I second toomuch:  My Onc doesn't do any scans (I'm stage 2)  as he says there are tons of false positives and he doesn't like that much for his patients, so he doesn't order them.",
      "MessageIndex": 1306,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 21, 2011 10:26PM Chrys23 wrote: Bikenyc: Many thanks for sharing your experience and for the info on the ovaries. I had a Hysterectomy in 09' but they kept my ovaries! Little did I know that I would end up w/a tumor that was ER/PR+ because it feeds off of Estrogen! If the chemo destroys them, c'est la vie! LOL  I'm 46 and my only son will be 21 next week. No more kids on the horizon for me (thank God!) My only concern is that I am VERY sensitive to meds and have a laundry-list of allergies. I am curious if I'll have another reaction on the Adriamyacin. I guess I'll be finding out very soon. Best, Crystal",
      "MessageIndex": 1413,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 11, 2011 12:21PM Chrys23 wrote: Hi Rosemarie -- I hope you find this site, the wealth of information and the ladies welcoming! I welcome you as well. I am 4 weeks out post surgery and I sometimes have the same sensations in my breast. I had a hematoma and though I had horrible swelling a few weeks back, it is decreasing now but 'hard' under the incision site, which is right behind my nipple. It's hard and scabby -- blech. Since I may have another surgery to get the DCIS cells, I hope they can cut thru the scar tissue.  My tumor board review conference meeting is today and I'll be hearing the results of that meeting tomorrow in Philadelphia. Hopefully they will not go in to do the AND. Radiation was going to be in my treatment anyway as well and since I had cancer in the node, chemo too. Keep posting and keep us posted! Crystal",
      "MessageIndex": 1202,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 13, 2011 09:27PM Chrys23 wrote: Thanks Toni & Cora -- Cora: Are you doing RADS to the axilla? I couldn't tell by your post. I will definately talk to the RO closer to when I start Chemo (probably mid-August); I've gotta get thru this 2nd surgery next Thursday. Praying and Hoping for clear margins!!!   I think I worry that since they are NOT doing the AND; that there could possibly be cancer in the nodes and I don't even know it... I would be open to radiating the axilla, but at 4mos down the line after chemo; is that too late?! So many decisions.....and never knowing which is the right thing to do.",
      "MessageIndex": 1251,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 13, 2011 10:16PM - edited Jul 13, 2011 10:17PM by Chrys23 Madismommy -- I like that: \"Life Insurance\"!  We can only hope that's true, right?! What other choice do we have Your AND was today?! How are you feeling hon? Are you doing alright?",
      "MessageIndex": 1253,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 15, 2011 05:15PM - edited Jul 15, 2011 05:15PM by Chrys23",
      "MessageIndex": 1267,
      "PostDate": "15/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 24, 2011 02:41PM Chrys23 wrote: Bdavis: I was on Taxotere first if you recall and I ALWAYS had Benedryl in my IV first. However, they don't do it always with Adriamycin because it supposedly doesn't give you the same potential for allergic reactions as the Taxane family of drugs. So - I had NO Benadryl with the Red Devil, only steroids, Zofran, and Emend and then the red devil and last cytoxan. Seems I got a reaction anyway - they are baffled: even the on-call Onc told me today that my reaction is very strange indeed. Who knows; they may cancel my last treatment in 2weeks due to this ongoing issue.",
      "MessageIndex": 1435,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jan 4, 2012 12:48PM Chrys23 wrote: Hey B: How are you doing hon? Are you doing better from your surgery at this point? The surgican onc who did my hysterectomy 2yrs ago said there is blood and tissue in my left ovary (something is hanging off of it). He said a cyst would be fluid-filled. He did say it \"didn't look cancerous\", but that's why I'm having the BRCA and having a follow-up ultrasound next month. I pray it's not cancer, I really do. Yes, my treatment road has been horrific; no wonder I had a nervous breakdown.   I pray better days are head, but with my luck -- it doesn't seem like that will be the case. Not being a debbie-downer, just being truthful.  I really hope you are doing good!",
      "MessageIndex": 1678,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 15, 2011 11:27AM Chrys23 wrote: ToniLee -- you are so right about making distinctions between micro/macro nets. If I'm remembering correctly, the cancer in my SN was in milimeters, but both my BS and Onc said \"doesn't really matter the size, the cancer was there\". I'm in agreement that spread is spread.....regardless of the size. Best, Chrys",
      "MessageIndex": 1265,
      "PostDate": "15/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 2, 2011 10:09PM Chrys23 wrote: Hi All --- Found out today my margins ARE indeed clear from my re-excision!!!..WHEW!! Thank you God! I will start Chemo on August 10th and radiation afterwards. I'm thinking of doing rads to the axilla, superclavicular and mammosite as well. The BS doesn't like that plan as he feels it can cause lymphadema and he said he may as well have done the axillary dissection if I go for that type of rad treatment, but either way, I just want to do what I can to keep the cancer at bay, in the event there is cancer down the node chain.",
      "MessageIndex": 1289,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 9, 2011 12:45PM - edited Aug 9, 2011 12:46PM by Chrys23 Glenna - I hope everything is ok!",
      "MessageIndex": 1315,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 7, 2011 05:20PM Chrys23 wrote:",
      "MessageIndex": 1372,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 21, 2011 05:51PM - edited Sep 21, 2011 05:52PM by Chrys23",
      "MessageIndex": 1410,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 24, 2011 05:35PM - edited Sep 24, 2011 06:06PM by Chrys23 Special K -- I don't know if that's it; but you never know...... During TX#1 (for Taxotere & Cytoxan): I had Benadryl, Zantac, Zofran and oral steriods. NO REACTION TX#2 (21 days later with Taxotere & Cytoxan): I had the same as above, but HAD A REACTION on day 16, which started last week and lasted for 5days! TX#3 (This Friday-- Change to Adriamycin & Cytoxan): I had NO Benadryl, but just oral steroids, Emend, and Zofran ---- Reaction happened just almost 30-40mins after the infusion.",
      "MessageIndex": 1438,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 24, 2011 06:57PM Chrys23 wrote: Coraleitz -- Not to try and correct you, but, I only am having 4 treatments and I DO have lymph node involvment. Sorry etherize that you have to do chemo, but if so -- think of it as an extra investment to help rid your body of any cancer! ",
      "MessageIndex": 1442,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jun 23, 2011 10:26AM - edited Jun 23, 2011 10:28AM by Chrys23 I just had my post-surgery follow-up and heard my path results yesterday. While my lumpectomy was on June 9th (I'm only 12 days out), it looks like they got the tumor, but there was DCIS close to margins near the cavity of where the tumor was. So, it seems my case is going up to the tumor board on July 11th to discuss if they think I should have more nodes taken out, along with re-excision of the DCIS.  I'm wondering if I should just do a mastectomy, but I really want to hear what the board of doctors thinks. I will see the oncologist BEFORE the tumor board conference on July 5th, and will go back the next week on July 12th to hear the conference findings. I guess I'm concerned that if they don't get clear margins again, I just don't want to have to go back in for a 3rd surgery. I want this surgery stuff done so I can move on to treatment and if that includes chemo; then, that's what I will want to do. Chrys",
      "MessageIndex": 8,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/770568",
      "Title": "MUTIPLE RE-EXCSIONS ( after lumpectormy) Allenan Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 29, 2011 11:15AM Chrys23 wrote: bump :)",
      "MessageIndex": 12,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/770568",
      "Title": "MUTIPLE RE-EXCSIONS ( after lumpectormy) Allenan Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 10, 2011 06:10PM Chrys23 wrote: Ugh -- just reading all of this makes me nervous like Bdavis.  My ONC said he would vote tomorrow at conference  to \"No AND\" surgery.  But, my mind goes crazy not knowing if any other nodes are positive and just 'sitting there'.  I guess I'll know on Tuesday what they decide when I go see the BS. Does the chemo get those cells if there are any other nodes positive, or is it just the radiation, if they do the underarm? Ahhh! :(",
      "MessageIndex": 1176,
      "PostDate": "10/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 10, 2011 09:02PM - edited Jul 10, 2011 09:09PM by Chrys23 @Madismommy719: I hear ya....I \"hope\" the chemo will get anything left in the nodes that may be there. I think we all just want to do what we can to make sure the cancer cells are OUT of our system -- whether that be with total lymph node removal or chemo and rads.  It's hard to say what the best practice is, since everyone has a different scenario.  I will ask and double ask my Onc and surgeon. I'm really itching to hear what the outcome of the tumor board meeting will be tomorrow! Stay tuned.....",
      "MessageIndex": 1184,
      "PostDate": "10/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 11, 2011 06:08PM Chrys23 wrote:",
      "MessageIndex": 1206,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 12, 2011 09:14PM Chrys23 wrote: Everning everyone: I want to chime in -- just saw the BS regarding the results of my Tumor Board Conference -- 1)  I will NOT have additional nodes removed 2) I will have a re-excision next Thursday to get the DCIS in the lateral and medial area of my breast 3) My BS said that during the conference one of the RO's wanted to \"radiate the hell out of my breast\" -- meaning he wanted to do upper shoulder, collar bone and under the arm. They argued that it's almost better if they take out extra nodes, because either way -- I would be at risk for LE. Also, the BS said that when they radiate that high up, you could hit arteries and have other problems, so he was against that. Anyone want to offer up knowledge on this?? 4) If they don't get clear margins this time, I've been recommended to have a mastectomy. I am fine with that. The BS recommended that I see a RO that will do the breast; but when I eventually have a meeting with the RO; I will ask what the risks are of radiation so high up. I want to hear it myself and see what my options are. Wish me luck on the 2nd surgery next week; it's supposed to be relatively easy and short (under an hour), so I hope they get clear margins!  Thanks for listening.",
      "MessageIndex": 1236,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jul 15, 2011 05:39PM Chrys23 wrote: SpecialK -- I hear ya; thanks for explaining. So, I guess the questions still remains -- are you comfortable with not doing RADS? Do you think they are covering all the bases? Seems so (but I'm no doctor)   :)",
      "MessageIndex": 1269,
      "PostDate": "15/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 2, 2011 10:23PM Chrys23 wrote: Bdavis -- are you back at home? I hope your flight was uneventful and you are glad to be back at your own comfy home. I hope you are feeling better too.  I say my Onc today and he thinks I do have that reflux from the surgery that swelled my tongue and throat and also lymphadenitis (mild lymph infection) in my face and neck. He said it should resolve on its own and I can start Chemo next Wednesday.  I saw the Onc, a Rad dr and the Surgeon all in one shot today UNANNOUNCED! They took time to see me as I was concerned about my throat. It was amazing to have such a caring team. I also got my Oncotype score which was 16. I believe that's low -- but I'm node-positive, so I'd resort to chemo anyway. Hugs, Chrys",
      "MessageIndex": 1291,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 22, 2011 01:45PM Chrys23 wrote: Glenna -- congrats on the good news!",
      "MessageIndex": 1330,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 21, 2011 05:37PM Chrys23 wrote: Hey all -- haven't been here in awhile while doing treatment, but I thought I'd give an update on my situation (which is also posted in the 8/11 chemo topics forum). I was to have chemo #3 today and was at the treatment center in Philly.  Saw my  Onc and my nurse practioner. I am NOT receiving anymore Taxotere. I've been having severe itching/burning/rashisng all over my body since day #16 of my 2nd treatment (started last week) and today is Day 21. The Onc feels it s an allergic reaction and having another treatment could be \"problematic\". I guess he's saying it won't be good to have another Taxotere treatment! LOL He also felt I possibly could be having a reaction to Neulasta but doesn't think that's it. So here is the skinny - I could either stop chemo altogether or try another regimine which would be Adrimycin. I opted to try the \"Red Devil\". I'd rather try another chemo than none at all since I'm node positive - call me crazy. I have to have an Echocardiogram first, he's not doing a MUGA. I had a heart stress test in May and Radioactive MRI test back in April for another issue.  I did stay in Philly ALL DAY today and they were so good to squeeze me in for the Echo.  I tentatively scheduled chemo for the new drug this Friday, barring any issues with the Echo. I'll call tomorrow to check that everything is a go.Good thing is once start, I can do my final chemo in two weeks, not 3. Yay! Ok -- anyone on Adryimycin and can you tell me what to expect?? The Onc said the biggest issue is nausea, but I can deal with that over the itching/burning. I hope I don't develop worse see effects!!  I'm HIGHLY ALLERGIC to lots of med and my allergy list is like a laundry list. I pray all will be well with this new regimine. Thanks for listening!!   Crystal",
      "MessageIndex": 1408,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 29, 2011 10:40AM - edited Sep 29, 2011 10:43AM by Chrys23 Still having issues -- spent Wednesday all day in Philadelphia getting IV fluids, vitals, etc. Swollen tongue, chest tightness, etc. All my vitals were ok -- they are baffled. I come home and started breaking out AGAIN with the itching, red hands, red feet, burning legs -- etc, etc. I could go on and on.  For those that say \"Oh, chemo is doable\" -- I'm glad for you. I'm glad for those that can go out and hike and run and eat and be with their families and have some semblence of a normal life.  That has NOT been my experience. I've been suffering since August 31st when I broke out after my 2nd Taxotere treatment SIXTEEN days later and again suffering since switching to AC last Friday. It's been a nightmare. They have no clue what is causing these side effects and *think* it could be Neulasta, but after AC on Friday, I broke out 30mins afterwards!  I couldn't swallow and it's f*cking scary. It's obvious my body is just not tolerating this well and I'm afraid to take my last chemo next Friday. I don't think I am going to do it. I'll be doing a lot of praying before then because what if the last dose puts me in the hospital and I die? Is it worth it? There are no guarantees anyway and at least I tried 3 treatments.  I just don't want to put my life in any more jeopardy. Tomorrow it will be a week and I'm still not well. I itch and *burn* all over and Benadryl is not helping me. Sorry for the rant -- I just wish this was easier on me and I'm actually envious (I'm being honest) of those that have kinda sailed through this.  I won't speak of this again or bring my issues here and I truly do hope everyone is doing well.",
      "MessageIndex": 1467,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Oct 6, 2011 05:46PM Chrys23 wrote: Hello everyone -- I've posted the below on the August 2011 chemo board as well, so my apologies if any of you have seen this already. Thanks so much for your support and comments; it is much appreciated.  I've been resting, getting my strength back and staying off the boards for awhile -- I feel a little better than last week (thank God), but still have some throat issues at times (feels like a golf ball in the back of my throat) and I still have itching issues. --------- My oncologist called me today; he will NOT administer the final chemo tomorrow (Friday 10/7). He actually said that it would be detrimental and dangerous to my health to continue. He stated that since they don't know what \"agent\" is causing the severe reactions, to proceed would not be in my best interest.  I think he also feels comfortable in the sense that my OncoType score was 16 and I did at least have 3 out of 4 treatments.  I asked him if they could prolong the steroids or give mor benedryl, but he said NO -- too dangerous.  So, I wasn't the one to say to stop, but it was him. He just won't do it. He said the only other option was the CMF protocal of drugs, but he said it may be a waste of time to give me that. He had actually told me the same thing after my 2nd Taxotere became problematic. I am still traveling to Philadelphia tomorrow to the cancer center to talk to him in person. He told me if I am coming to \"convince someone to give me a final dose of chemo; it;'s not going to happen\". Yikes! He told me I should move right in to Rads and to move my consult appointment up from November 1st.  I was able to do that and I now have a Rads appt next Wednesday. It's weird to not sit in the chair tomorrow, but at least I'm going in to talk to the dr in person.  It feels scary too -- I pray the 3 treatments have some benefit in the long term.",
      "MessageIndex": 1482,
      "PostDate": "06/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jan 4, 2012 10:09AM Chrys23 wrote: Hi ladies! I haven't been here in awhile -- I hope everyone is doing well! Waving Hello to BDavis, Special K and others!!! I finished rads on Dec. 14th and had horrible, horrible 2nd degree burns on my neck, under my arm and under my breast. They were huge, open pink flesh wounds and all the skin had come off. As of now, the dark skin is starting to cover the pink fleshy areas. I'm african-american and really shocked that I burned so badly -- but it was only towards the end (last 5 days). I'm worried about my neck because the skin loss there was huge and I have a huge scar that's the size of an orange. :o(  I'm using Vitamin E and Cocoa Butter and I pray it becomes less noticable over time. Scarves are my friend right now. It's weird to be done with treatment; I didn't start the Arimidex right away; I wanted a break as I had such bad burns from RADS, but I will start it on Monday. I just can't deal with more side effects at this point.  I'm also doing genetic BRCA testing on Monday. My left ovary has \"something\" on it (has blood and tissue in it) and I have a 2nd ultrasound on Feb. 7th to see if there are any changes. I've been having twinges of pain too. I pray it isn't cancer. :O( My cancer journey was a nightmare -- so many side effects, complications, issues and now I have the physical scars of rads. I don't know if I will ever feel normal. I just started work full-time yesterday since JUNE!!!!  It's weird to be back like the last 7 months didn't even happen. Everyone else seems 'fine' and I just had such a hard time. It's hard to deal with that emotionally -- I broke down and had to go on medication after thanksgiving, as it hit me hard so many months later. In any case, I pray everyone is well and for those just starting this journey, hang in there. xoxo, Crystal",
      "MessageIndex": 1676,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 3, 2011 03:49PM Chrys23 wrote: Moving up for the August 2011 ladies going thru Chemo (including me!)",
      "MessageIndex": 645,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Chrys23 wrote: Evening! I just had a lumpectomy on June 9th (have a stupid old, sore hematoma and seroma from it!!! ) My tumor was originally listed as 1.5cm during the biopsy, but on the path report it is listed as 2cm from end to end. Also, while they got the all of the tumor out and the margins were pretty 'clean' for that - on the median border of the tumor cavity were DCIS cell (listed as <0.1 cm from the inked resection margin). I also have lymphovascular involvment along with 1/6 lymph nodes positive. (booo!). My case has to go up to the tumor board because there may be a concencus to take more nodes (I hope not) to see how the med oncologist is going to treat me. The tumor board meeting is July 11th and I will hear the results on July 12th.  I do have a medical onc meeting (first consult) on July 5th.  Hopefully, the 2nd lumpectomy will be sometime during the last 2 weeks in July. I guess Chemo is in my future, but I will discuss that with the med onc on 7/5 as well as him sending out my sample for the Oncotype testing too.   Has anyone else had lymphovascular invasion? That kinda freaks me out....If I have to have chemo, so be it, I just hope they can get everything. Also, is it better to have a BMX since I have some semblence of DCIS in my right breast? Many thanks! Chrys Lumpectomy & SNB 6/9/11; Re-excision 7/21/11; Chemo started 8/10/11 (TC 4x - every 3 weeks); Radiation sometime in November Dx 5/17/2011, IDC, 2cm, Stage IIA, Grade 2, 1/6 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770684",
      "Title": "Just Rec'vd Pathology Report Today Chrys23 mdg"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 5, 2011 02:48PM - edited Aug 5, 2011 02:48PM by Chrys23 Re: Zofran -- I already have all my pre-meds filled for chemo next week. However, on Wednesday, I woke up with bad case of food poisioning. The room was spinning, waves of nausea and stomach cramping. I HAD to pop a Zofran, just so I could get out of bed and VOILA -- after 45mins or so, no more issues.    I've had Zofran before -- that stuff is a miracle!",
      "MessageIndex": 266,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 10, 2011 08:36AM Chrys23 wrote: I'm waiting to get started here in Philly at the cancer center! My lovely sister drove me today! Just got my needlestick for blood counts, and am waiting to be taken back to my private Infusion room. Good luck to everyone today!",
      "MessageIndex": 402,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 13, 2011 04:53PM - edited Aug 13, 2011 05:08PM by Chrys23 Kasi -- you rock! Ladies, I actually went to a nearby casino today. Even ate a burger, however -- my legs feel like 50lb weights and I'm lightly achy on and off in my shoulders.  I'm still taking the Claritan -- I think it helps. I missed my 1pm dose and I could tell the difference. Its weird; my legs feel like I can't move them hardly, really heavy.  I guess it's the chemo doing somethin'. (?!?) . Anyone else feel like that?  Also, I fell asleep last night at 9:30 and woke up this morning at 8. Yowsa! I just keep forcing myself to walk around -- even though it's tuff moving around. My body feels tired.",
      "MessageIndex": 594,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 14, 2011 08:35PM Chrys23 wrote: I wanted to add my feelings in regards to the hair issue;  either I'm in denial or I've just accepted that I'm going to lose my hair. I wear lots of wigs and braided extensions (have full-head extensions in now), so I'm used to changing my look frequently.",
      "MessageIndex": 622,
      "PostDate": "14/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 15, 2011 06:27PM - edited Aug 15, 2011 06:36PM by Chrys23 Evening - I went wig shopping with my sister, good friend and God-Niece; picked up 3 cute wigs! So excited. Also, my free scarf from www.goodwishesscarves.org/ came in the mail today. It is absolutely beautiful!! As a cancer patient, you can pick out one of their Good Wishes scarves.  My sister shaved her head down today really, really short in support of me and I took out all my extensions and cut my hair really short, about 1-2 inches long.    I feel achy and fluish today (Day 5 for me)-- tongue still feels weird and numb sometimes too. For those that aren't feeling well; rest -- I hope you feel better soon. Re: the Oncotype Test -- My Onc wasn't going to order it because I had positive lymph nodes, and chemo was a given -- but I wanted him to anyway as I was curious what my score would be. I ended up being a 16 (which is low from what my Onc has said).  I've read where women have high scores of 30 to 50 range.  Also, the test is VERY expensive; I am very thankful I have really good healthcare, as the test was almost $5K and my insurance paid it in full. Whew.... The Oncotype is usually used in women who are NOT node-positive to see if chemo would benefit them or not.  For example, if there was NO lymph involvement, but the test was run on the tissue sample and the score was 30 or higher; they really would possibly benefit from chemo.  For me, I was node-positive and for node-positive, if your Oncotype score is 18 or above, of course you could benefit from chemo. I was only 2 points below at 16 -- but again, I wanted to do chemo as a preventative measure, since it had already traveled. ",
      "MessageIndex": 660,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 16, 2011 04:14PM Chrys23 wrote: Aimska -- I'm happy that someone else totally understands LOL I don't think I can help 'educate' her -- she's just too nervous and anxious and she says the whackiest things.  I let her help in other ways sometimes -- she loves my little Chihuahua, and she likes visiting and taking him for walks. She likes to straighten up and clean too, so that's where she can help me. Poor soul.....",
      "MessageIndex": 712,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 17, 2011 09:35AM - edited Aug 17, 2011 09:40AM by Chrys23 Morning all! Well, I feel 1/2 human today and I'm thankful for it. No more legs twinging/pain/aching and giving out and the aches are considerably less -- mainly gone today. My legs do tingle a little. I don't want to jinx myself - I pray it stays away. I took Tylenol yesterday and then before bed last night, so I hope that helped.  My taste buds now seem dead -- water tastes like nothing. So strange... Aimska is correct -- I hear the 1st is the easiest for some folks, but then the subsequent infusions are harder to bounce back from. Well, maybe for me, since the 1st was bad -- I'll go the other way and the others will be easier?!?   Oh Jesus; I cannot imagine being WORSE than I have been the last few days. *ugh*.   I hope everyone is doing ok! Thanks for listening to me rant and complain. We are still here and taking one step at a time through this, so I should be thankful! ",
      "MessageIndex": 740,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 17, 2011 01:01PM Chrys23 wrote: VTEllen -- girl, maybe you are doing too much! I'm sorry your blood counts, etc aren't up.  Also, watch those litter boxes -- I was told by my chemo nurse NOT to partake.  I can pick up dog poop if I walk little Nacho, but I use a paper towel and dog-baggie/gloves and then religiously wash my hands afterwards. If he goes in the backyard, it's even better (poops are small, thank god!) I'm sure you are being careful though.....(((HUGS)).   I can't believe I feel better today -- it must be a dream ",
      "MessageIndex": 748,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 17, 2011 07:33PM - edited Aug 17, 2011 07:36PM by Chrys23 VTEllen - I wish I was lounging by the pool. Just never asked my Onc and was curious. I miss my wine and Cosmos though!    I want a drink! LOL TLDRose: Glad you are doing ok!  Summergirl: That is too funny -- and what a strange side effect, but laughter is good for the soul !!  Best wishes to you tomorrow!",
      "MessageIndex": 763,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 18, 2011 09:36AM - edited Aug 18, 2011 09:40AM by Chrys23 Grimbol -- we are on the same schedule! My next tx is 8/31 as well. I want to quit! I'm also getting tingling in my legs, hands and fingers too.  Looks like you and I have the same s/e's as well. I hate to say this, but I'm glad, because I feel alone in that everyone else seems to feel 'ok'. Robyn: Yes! We should meet and drink until the sun comes up LOL My Onc did say I could have an occassional glass of wine, but I don't think I'll do it. I'm already having s/e's from chemo and don't want to add alcohol in the mix. It's going to be a loooong couple of weeks without my nice glass of wine  or my Cosmo I had a one-on-one chemo call with my Oncology Nurse, which was pretty thorough. She also sent all my scripts for meds and literature via mail.  I'm glad it was one one one -- I was armed with a ton of questions and I was able to ask her in the privacy of my home and not feel rushed. She also gave me a brief once-over at my 1st chemo session. Question -- do you ladies have an open infusion room or do you have private rooms? One aspect I like of my center is that all the rooms are private, so you are not seeing others. I have my own room with TV, open window, magazines, etc. It's very comforting. Last night I felt tired and flushed. My temp went up to 99.8, and I just rested in bed. I did wake up at 1am all sweaty, so I took a Tylenol. Thankfully, as of now, I have no sleep issues as I treasure my sleep.  My temp is back to normal today and I'm having residual, very minor, aches and twinges. I hope I continue to feel a little better.  Oh, and my Neulasta shots came via UPS this morning. Popped those suckers in the fridge until I have to use them on Sept. 1st.  Welcome to all the new ladies -- this is a great group! Best wishes to everyone today!",
      "MessageIndex": 790,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 22, 2011 12:26PM - edited Aug 22, 2011 12:45PM by Chrys23 Hey Grimbol - Happy Monday! Would you believe I still have my hair and NO shedding. Weird...I wonder if it's going to start next week and be like..BAM; with fistfull's coming out. Thankfully I cut it really short; so I hope it's not too traumatic.  I see, like you -- I'll be taking those tx weeks off...Like you said, if those last SE's are anything to go by, I'll need to be off!! Yow~!",
      "MessageIndex": 919,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 22, 2011 01:46PM Chrys23 wrote:",
      "MessageIndex": 922,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 22, 2011 04:56PM - edited Aug 22, 2011 05:04PM by Chrys23",
      "MessageIndex": 936,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 26, 2011 08:18PM Chrys23 wrote: Ellen! - Will do!!  Tonight we just moved all of our patio furniture, solar lights, etc in to our shed. All set with provisions too.  Please be safe - my best friend is in Epping, NH and we were just talking tonight abou tthe path up your way, after it hit's NJ/NYC. Koalakid: How sweet of your daughter to want to shave her head for you. My sister cut all of her hair off and we took photos. I still have less than an inch and you can see my scalp on the sides.  It's hard to see it go, but again -- it's only temporary.",
      "MessageIndex": 1087,
      "PostDate": "26/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 29, 2011 09:53PM - edited Aug 29, 2011 09:56PM by Chrys23 I'll be back in the chair on Wednesday for my 2nd T/C infusion. I hope it's not as bad as the first one in terms of the side-effects I experienced day 4-7 *shudder* My hair is almost done; all bald on the sides and in the back. Still have some tufts on top. I don't want to shave it down at all; I want it to just fall out naturally. ",
      "MessageIndex": 1177,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 30, 2011 02:21PM Chrys23 wrote:",
      "MessageIndex": 1204,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 3, 2011 09:52AM Chrys23 wrote: Morning Everyone -- Hope everyone is doing well and welcome to any new ladies that have found their way here. Day #4 for me (I count my TX day as day 1), and I'm hanging in there. No nausea, no trouble sleeping (didn't before), and I'm taking Advil every 8hrs. I don't want any bone or muscle issues this time.  I still feel slight 'pangs' of aches under the surface, but I think the Advil is helping keep it at bay. This time at my last tx, was when I started having a horrible time.  Feel a little off and sluggish/slow though. I still have hair -- very thin, but there is some there! And I'm always ravenous with food! No issues eating. I'm craving White Castle Fish and Cheese and I will have one! LOL Taylor: I hope your son has a wonderful 9th birthday today! I am glad you are hanging in there. vtEllen: Hope you are good hon -- my hot flashes are kicking my behind! I had to purchase a small fan yesterday to keep on my nightstand. I hope the \"C\" issue loosens up soon (pun intended). I'm going to ply myself with some Sennekot this morning because I know I'm going to have issues. Grimbol: How are you holding up? Robyn: Sorry to hear about the infection - I hope you feel better! Summergirl: You'll be fine hon once you take the reigns!  I'm so glad I cut mine really, really short, so it wasn't as traumatic when it started to come out. Dianamaps: Hugs to you! If I missed anyone -- please forgive me. Try to enjoy the holiday weekend -- can't believe August is over with already! ",
      "MessageIndex": 1317,
      "PostDate": "03/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 7, 2011 10:46AM - edited Sep 7, 2011 10:49AM by Chrys23 Morning everyone -- I think this is day #8 for me. Yesterday I woke up with really bad dizziness and nausea then it subsided. I felt achy too. This is the first \"nausea\" related s/e I've ever had. I have been eating like it's my job -- like A LOT and eating late too. Maybe that is the cause? However, today, I woke up, felt ok then a HUGE wave of rolling nausea hit with dizziness. Then gone. Really weird.  I went out to get a bagel and I took some Zofran, but I feel ok.  Anyone have any ideas? It's just weird to get this type of s/e this late in the week.  My legs have been on and off achy, but I've been managing because of the round-the-clock Advil since last Thursday.  During days 7 & 8 during my first treatment were my worst days when I look in my notes. I actually had horrifying flu-like symptoms. And to top it off...my Chihuahua Nacho bit me this morning. He was eating out of the cat bowl and I went to move it and he nipped my hand......on my lymph node side *sigh*    I put alchohol and Neosporin on it and now he's all over me knowing he was bad. Considering this could be my low blood count days, I hope I don't have any issues. Ellen! I didn't know you were a bride-to-be -- that is awesome! Take that leap and relish in it, even if you are going through this.  I'm very happy for you!",
      "MessageIndex": 1383,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 7, 2011 01:47PM Chrys23 wrote:",
      "MessageIndex": 1389,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 15, 2011 03:31PM Chrys23 wrote:",
      "MessageIndex": 1588,
      "PostDate": "15/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 18, 2011 10:06PM Chrys23 wrote: Evening -- Not going to post much; I'm REALLY having bad itching/burning all over; it comes and goes (even heiny and lady parts)...Whatever....I don't want to complain. At least I went out for my wedding anniversary tonight and had some champagne.  I hope everyone is doing well -- take care of yourselves. C.",
      "MessageIndex": 1660,
      "PostDate": "18/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 24, 2011 09:04AM Chrys23 wrote: Hey everyone -- Seems, though -- I had a reaction after my first round of Adriamycin yesterday I arrived home late yesterday (see my \"Ut Oh\" post above) and I got a little hive on my right leg and my mouth/lips were tingling. This is just awful. I slept all night and took my anti-itch meds, but today I feel off, a bit queasie and I'm scared that I'll break out again -- especially since my Neulasta shot is this afternoon. It seems my body just doesn't tolerate this stuff all too well and I only have one more chemo treatment to go. I guess I'll have to see what the next few days bring and pray I can finish on Oct. 7th. I am so, so sorry to never have any positive news and I'm sure some may think I'm a complainer or cry-baby. Believe me; I'm not. I can say it's frustrating that my body doesn't tolerate medicine well, especially something to help fight cancer.   Thanks for listening.... Prayers please.....",
      "MessageIndex": 1776,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Nov 15, 2011 12:08PM Chrys23 wrote: Capinva, I'm so sorry that you have to go through the treatment again.  May I ask why the surgery was after chemo? Did you not have surgery after being diagnosed and before your first treatment of chemo? A/C is absolutely HORRID. I only had one treatment of it, and that was enough for me. I'm still having issues with it messing up my body. :(  I had two treatments of Taxotere and I wish I had stayed on that, even though I had some bad reactions from it.  I think you'll probably find Taxol easier, at least I would hope so.  My thoughts are with you. xoxo",
      "MessageIndex": 2433,
      "PostDate": "15/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "May 25, 2011 03:56PM Chrys23 wrote: Anyone?",
      "MessageIndex": 2,
      "PostDate": "25/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/769383",
      "Title": "ER/PR + and HER2- (what does it all mean?) Chrys23 Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 14, 2011 06:38PM Chrys23 wrote: bump :o)",
      "MessageIndex": 654,
      "PostDate": "14/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 5, 2011 12:06AM Chrys23 wrote: Kasi -- I hope you feel better! You are NOT a freak.  From what I've heard; everyone's experience is different and everyone's body reacts differently.  To be honest, considering what the stuff is made of, I guess we should be thankful that we're not getting the chemo of \"old\". -- I hear back in the day, chemo treatments really made people so very, very ill that they could barely get out of bed and that vomiting was standard issue. Rest and take it easy.... Hugs, Chrys",
      "MessageIndex": 257,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 9, 2011 05:44PM - edited Aug 9, 2011 05:44PM by Chrys23 Sandy -- (((HUGS)))....You are not ranting at alll; let those feelings out girl! I hope you feel better soon hon. xoxo",
      "MessageIndex": 380,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 11, 2011 11:30AM Chrys23 wrote:",
      "MessageIndex": 480,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 12, 2011 09:51AM - edited Aug 12, 2011 09:52AM by Chrys23 Best wishes Robyn - let us know how it goes! Woke up with no real pain from Neulasta. Hope it will stay that way! Had some organic green tea, applesauce, and ginger cookies from Trader Joe's. Brushed and gargled with salt water and just rode my bike for 20 mins and will walk my little Chihuahua and load up on water with Lemon. Hope everyone is doing well! Xoxo",
      "MessageIndex": 535,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 15, 2011 09:15AM Chrys23 wrote: I had posted about the heel pain - it's weird and random. My heel is sore and my teeth still hurt today. Legs are achy too.",
      "MessageIndex": 636,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 16, 2011 01:01PM - edited Aug 16, 2011 01:02PM by Chrys23 YaYa:  I did take the Claritan before the Neulasta and a few days afterwards. I actually still had bone pain on Saturday, but it was fine on Sunday.  The bone pain from Neulasta was definately recognizable as true bone pain (at least to me it was.) This muscle problem, from what I've been reading is a side-effect from the Taxotere. I've got a call in to my oncologist's office just to let them know what I've been dealing with -- but I do believe it's some type of Neuropathy effect  (check out the \"Taxotere is a Nightmare\" thread started Dec. 2010 and last post July 2011) that a small percentage of patients exhibit.   Why me....    :( I have tingling in my hands too -- I just pray this doesn't get worse with subsequent treatment, because I won't be able to hardly get around.",
      "MessageIndex": 695,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 17, 2011 12:18PM Chrys23 wrote: I think I'm also in the minority again in that I do not have a port. While easier, my Onc was against it as he said if I happened to get an infection, etc, it would be a pain in the a&&. He said since I'm only having 4 treatments and that my veins are pretty good, we'll go the IV route. That was fine with me. I had complications from my 2 lumpectomies, that I'd rather not go thru another \"procedure\". I'm not knocking the port at all -- I'm sure it works out well for you gals that have them.",
      "MessageIndex": 746,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 23, 2011 02:30PM - edited Aug 23, 2011 02:47PM by Chrys23 Hi Madismommy: I love my scarf from \"Goodwishes\" -- I ordered the \"Majorca\" and it's gorgeous! Here is another free scarf link:  ",
      "MessageIndex": 968,
      "PostDate": "23/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 23, 2011 02:36PM - edited Aug 23, 2011 02:37PM by Chrys23 Also, here is the link to those who may need help with a wig -- this organization will pay for the purchase of a new synthetic wig from www.wigs.com after filling out a short 2-page application. I've ordered one and it's a wonderful thing that they do to help! Crickett's Answer For Cancer",
      "MessageIndex": 969,
      "PostDate": "23/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 30, 2011 10:38AM Chrys23 wrote: Ellen -- they didn't go back in for clean margins? That's very \"different\".  I know that my BS said if we didn't get clear margins on the 2nd try, I would possibly be looking at a mastectomy. Thankfully, the 2nd time was a charm. I got some weird type of pharyngeal reflux as a side effect from the surgery (swollen throat, couldn't swallow, pain in neck), but it was worth it that they got everything. Your friend should question that....is she having chemo? I wouldn't be comfortable having the dirty margins in there until rads -- unless she is getting rads right away to burn it up. Kasi -- I was told emphatically not to have a pedicure or manicure because of the high risk of infection from the unclean tools, especially because of low-blood count days. If you personally HAVE to have them, bring your own sterilized tools. No dental work either. Grimbol -- I guess you and I will see what little bag of S/E's we will experience (if any) for our 2nd go-around tomorrow.  Let's keep each other posted..... :o)",
      "MessageIndex": 1199,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 30, 2011 07:18PM Chrys23 wrote:",
      "MessageIndex": 1214,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 31, 2011 12:20AM - edited Aug 31, 2011 12:20AM by Chrys23 Dear Taylor: I'm so very glad it well today and that you connected with your nurse, who was a high school acquaintance...see, God brings comfort in many ways! That's awesome! I'm so glad you got thru this first round -- and so glad you found this forum. The women here are amazing; I am thankful as well to be here!  Thanks for the well-wishes for my 2nd treatment tomorrow.   It's 1am, I must be on a steroid 'high' as I just cleaned the kitchen! I better get to bed; leaving at 9 in the am! Hugs and take care! Crystal",
      "MessageIndex": 1219,
      "PostDate": "31/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 1, 2011 02:07PM Chrys23 wrote: Hello! Just did my Neulasta shot with the Nurse at 2pm -- wasn't bad at all. I iced my tummy, she showed me how to do the injection, which I did myself, and it didn't even hurt! vt Ellen: I am a little tired it seems with this 2nd treatment, but it's only day 2.  I am such a dolt, I forgot to inquire about extending the steroids to help with the SE's. Oh well....I hope it won't be bad again.    I don't have any nausea and I'm eating regularly so far....may be too early to tell though! LOL Is anyone else experiening really bad hot flashes?  I started having them a week ago -- they come and go at odd times. Sometimes I'm ok, then I get hit where I feel like I'm a 100 degrees and have to cool down. I can barely sleep with anything on -- just bra and panties.  I also sweat more around my face area.  It's a pain, but what can you do. My nurse said it may be the chemo shutting down my ovaries, which can happen. I had a hysterectomy in 09', but they kept my ovaries for hormonal purposes. Funny that my cancer was  hormone driven. Yikes!",
      "MessageIndex": 1254,
      "PostDate": "01/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 1, 2011 02:32PM Chrys23 wrote: Hi Flautalee - On the T/C regimine; and for me,  my hair started falling out on Day 15 after my first transfusion, which was August 9th.  Currently, I still have hair on the top and back, but my sides and temples and crown are really bald.  Everyone is different though. I hope you have a lovely trip starting tomorrow!",
      "MessageIndex": 1256,
      "PostDate": "01/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 4, 2011 10:30AM - edited Sep 4, 2011 10:32AM by Chrys23 Morning -- Hope everyone is ok.. Day #5 for me...I'm still popping Advil every 8hrs and when it starts to wear off, I can feel the muscle/aches/pains in the background. I woke up this morning in discomfort. Why am I the only one with this weird S/E?? It really makes me upset -- 'everyone else' seems to be fine and I feel like I get hit with a MAC truck all the time.  If I wasn't taking the Advil, I don't think I could hardly function and I'm hardly functioning now. My back hurts over my left hip and I could hardly walk around yesterday -- my body feels heavy and bloated.  Jbagley: Positive thoughts aside, I try and this is how my body reacts to chemo; seems like it just cannot be helped.  I wish my experience was different, but c'est la vie. Sorry to sound like a baby -- I just don't get why I have these issues......Last time, Day 6 and 7 I was really sick with horrible body flu pains; I hope that won't be the case in the days to come.",
      "MessageIndex": 1332,
      "PostDate": "04/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 7, 2011 05:36PM Chrys23 wrote: Grimbol! -- Oh my!  I'm so very, very  sorry you are so sick to your stomach!! Did the dr say why this could happen so late?  I want to know too for me!  My sickness is coming in waves, mildly, but in waves no less here and there. I'll be fine and then I feel unsteady in the stomach. What the heck is going on with us?!?  Please rest and I hope this will pass really soon! (((HUGS)))",
      "MessageIndex": 1398,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 8, 2011 05:49AM Chrys23 wrote: Morning. A little freaked - had slight burning yesterday when urinating and it's continuing. There is also soreness/pressure when I pee in my vaginal area. I'll be calling the doctor in a few but I'm nervous as you can imagine. :(",
      "MessageIndex": 1405,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 8, 2011 06:47AM Chrys23 wrote: My chemo nurse called me back. She said the symptoms very much sound like a UTI and has prescribed some oral antibiotics and something to help with the pressure (anti-spasmodic pill). Normally, they would have me come in but my onc is an hour away in Philly. She said the antibiotic is very strong and I should get some relief within 24hrs. My hubbie is working from home today so that he can get my meds and keep an eye on me. I truly hope it's nothing else thats serious. I get so nervous.",
      "MessageIndex": 1407,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 14, 2011 07:12PM - edited Sep 14, 2011 07:28PM by Chrys23 All -- I *think* I may have figured out what may be causing my stomach/gas pain issues. I'm on Dexilant, which is a GERD (gastroesophageal reflux disease) medicine. I developed Laryngeal Reflux after my 2nd lumpectomy in July and had my throat close up, swelling, tongue swollen for a week -- the works. It was awful; I couldn't swallow or breathe. It was from acid creeping back up in to the laryngx/pharnynx during the surgery. So I went to an ENT specialist who put me on Dexilant and my ONC had given me a once-over after this and said the ENT guy was probably right. Well, I just read that the Dexilant can cause Flatulence, diarhea, and severe stomach pain! I had stopped taking it for a while and started up right after my 2nd chemo, so that's the only thing new I've introduced. I am hoping that is it -- makes sense. I'll call the ENT person and see if they can switch me to something else. I notice if I don't use it, I get laryngeal spasms sometimes from the GERD. I don't know if I'm being tested or what... How can one person have so many issues? I could write a book! Ellen -- I'll call the ONC regarding the itchy/burning thing. It comes and goes and can seem to happen anywhere on my body. I want them to know before my next TX next Wed.. Maybe they can lower the dosage. Thanks!   You are SO SWEET!! I don't want to rain on anyone's parade. We ALL are going through so much between surgeries and chemo and radiation treatments. Who wants to hear someone complain?   I appreciate the kind words ",
      "MessageIndex": 1558,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 22, 2011 09:11AM - edited Sep 22, 2011 09:16AM by Chrys23 Morning All -- I just called the Onc's office and my Echo was good, so I definately start Adriamyacin tomorrow morning. My chemo appointment is in Philly is at 9am. I am so terrified. It's bad enough to start chemo, but to start on a new drug with a potential for new S/E's...ugh. I'm a nervous wreck Believe it or not -- I still have hair~ I have like 1/4 inch of hair all around, very soft -- like baby hair. I wonder now if the hair will start to totally go again on the A/C? It seemed to really stop and slow down on the Taxotere -- really haven't lost much more. Sides/temples are bald and so is right above my forehead. I hope everyone is good -- Grimbol, Ellen, Robyn, Madismommy how are you all feeling? Hugs to all! Crystal ",
      "MessageIndex": 1751,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 26, 2011 04:52PM - edited Sep 26, 2011 04:55PM by Chrys23 Kasi -- Happy Birthday! I hope you are well. Missy: I had two rounds of Taxotere and my nails are darkening even though I iced them. Waving hello to everyone (Ellen, Grimbol, Dianamaps, Madismommy, Robyn, Michello -- all others too!!) I'm not doing too good on this Adriamycin -- had to call the on-call dr, saturday and sunday. My tongue swelled up yesterday -- looks all inflamed on the sides; have had horrid nausea, and sick stomach feeling.  Had trouble swallowing too. Today, I called the dr once again -- tongue is swollen and inflamed; face feels \"tight\" throat feels tight and I now have a sore throat.  I think this IS worse than Taxotere! I don't know if I can hold out much longer or do the last one on Oct. 7th. I just can't anymore. My body obviously doesn't deal with this stuff well and it's just too scary to keep having my throat and tongue feel tight on this stuff. I'm popping Benadryl like M&M's to keep a worsening allergic reaction at bay.  Was supposed to go to a \"Look Good Feel Better\" class tonight, but there is no way I can make it. I'm also supposed to be in a big fashion show for our town's breast cancer center in late October and tomorrow is a rehearsal night. Can't go to that either. I may have to drop out. I'm just too ill. Take care everyone.....xoxo",
      "MessageIndex": 1820,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 29, 2011 09:18AM - edited Sep 29, 2011 09:24AM by Chrys23 Hello everyone -- Hope all is well with you all. Grimbol; I just saw that your MRI is good; that's wonderful news. Ellen -- any word on your testing? I spent yesterday at the hospital all day getting IV fluids and getting vitals checked. My heart rate was good, pulse-ox was good, lungs sounded ok and blood pressure too. I'm still having issues and the doctor and chemo nurse are baffeled. They just don't know what is causing my symptoms.  They *think* I could have had a reaction to Neulasta, but I keep saying that I broke out in hives right AFTER the infusion on Friday, and had Neulasta Saturday afternoon. I had been shaky, not been able to eat much because of swollen tongue and had tight chest and throat on Tuesday.  I still felt shaky AFTER two bags of fluid yesterday...It was so weird. I did eat yesterday -- but when I got back from the hospital, I broke out in hives and itching AGAIN. It's just never-ending. My hands were turning red again and my feet were burning and numb sometimes. I have no clue what will happen to me -- I'm tired of suffering. Today, I'm having horrible heart-burn for no reason (haven't even eaten yet and I just took a Prilosec -- feels like I have a huge lump in my throat., and my nose is stuffy.) My husband is in denial -- just because the nurse said yesterday \"well, everything seems fine with your vitals\", he's taking that and running with it and just thinks I'm ok. I think he's cracked open and just can't take anymore. Well, neither can I. I doubt I will continue treatment next Friday -- I will go in there and just tell them I can't do this anymore.  I am not risking my life and the way my body reacts to chemo and suffer -- and the reactions/outcome could be 10x worse with another treatment. Take Care everyone.",
      "MessageIndex": 1885,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 29, 2011 02:45PM Chrys23 wrote: Ellen - I can hardly swallow - I'm broken out in welts and I itch and burn all over my body. I don't care if it's \"one more\". You are not having severe reactions like me. If I can't breathe nor swallow and steroids aren't helping nor Benedryl and even the Drs don't know how to help why would I put my life in danger for \"one more\". I dont mean to sound terse but this is serious. I thought I would be admitted yesterday.",
      "MessageIndex": 1892,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Oct 11, 2011 07:40AM Chrys23 wrote: Congrats Ellen (and I believe Robyn) that is awesome to have finished! Even though my last chemo was 9/23 -- I'm STILL having s/e's -- itching, hives and my throat issue is still somewhat pronounced. My fingernails are dark too...I wonder how long it takes to get out of your body!! My radiation appt is tomorrow -- and I just found out that my body is NOT producing any estrogen, so I won't be on Tamoxifen, but Arimidex instead. I had a hysterectomy in 09' but I kept my ovaries, and even then the gynecological-oncologist said my ovaries weren't working.  Anyone else having their estrogen levels checked before going on hormonal meds for cancer? Hope everyone is well!",
      "MessageIndex": 2072,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Oct 12, 2011 12:41PM - edited Oct 12, 2011 12:44PM by Chrys23 Morning everyone -- Ellen is correct: There are specific studies that say there is no benefit to go in and do Axillary Node Dissection. The study can be found here:  www.breastcancer.org/treatment... I I had 1 out of 6 nodes and pray there isn't anymore cancer, but that is what radiation will help cover. Flautalee: I'm with you -- I just asked the RO this morning and he said my mammograms would only be once per year....Are you f*ng kidding me?!  I'll ask for every 6 months and if they won't approve it, my employer does free Mammos every October (this is how I was diagnosed as part of my yearly exam).  So, I see the BS in May and I'll go in October as part of my employer program, which puts me at 5months or so. I thought EVERYONE was monitored every 6 months... I'm ticked at this, but I think I can get around it if it truly is the case.  I'm feeling a little better; however I'm still having residual s/e's. My throat spasms still when I eat and the A/C really messed up my stomach and hiatal hernia. I feel a bit of burning on the left side of my tummy and I burp constantly. I NEVER had issues with the burping/gas before the A/C and not on the Taxotere either. My stomach didn't hurt this way before A/C. That A/C is some nasty sh*t.  I saw the RO in Philly today; my mapping is next Monday. It then takes a week or two to set up the \"dry run\" and then once I have the date for that, I start radiation the next day. I will also have permanent tatoos, but they will be really tiny.  The RO will radiate the breast (30 treatments) and I will have 5 boosts where the tumor site was. I will also have the lymph area and the clavical area too.",
      "MessageIndex": 2105,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Oct 17, 2011 03:26PM - edited Oct 17, 2011 03:27PM by Chrys23 Hi everyone - I hope everyone is good! For those who have finished -- congrats and for those still recieving treament; hang in there and I wish you good days from s/e's. I had my mapping appointment for radiation today and it wasn't bad at all. Had some tattoos placed, and I'll go back on Oct. 31st for my simulation/dry run. My treatments officially start on November 1st. My appointments are all over the place right now: some are 1 or 2pm, others at 8:55pm and as of November 14th -- I'll be driving an hour for 6:55am treatments until December 14th (my tentative last radiation treatment) Yikes!   I don't know how I'll do it, but I guess I will! LOL I'm also seeing a gastroenterologist tomorrow because the A/C really messed up my digestive tract -- I belch, have flatulence, and my stomach or hiatal hernia may be causing discomfort on my left side and I want to check it out. Sometimes If I eat heavy or fatty foods, I get discomfort and pain. I'm still having throat/tongue spasms at times too and STILL break out in hives whenever my body feels like it. I'm 3 weeks out for the last A/C and this stuff really is not out of my system yet. Take care everyone!!!  Hugs, Crystal",
      "MessageIndex": 2155,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Oct 17, 2011 05:27PM - edited Oct 17, 2011 05:32PM by Chrys23 Well, the schedule is crazy cause they had to find a permanent 'slot' for me...At least my center is open very, very late (until after 9pm); with the hour drive, for it's easier to go in either very early before work or late in the evening when the traffic in to Philly isn't a nightmare! I'll be driving myself.  I have to go back to work at least by this coming Monday and I'll leave work early on the afernoon apointments or go in after the 7am appointments a little later. The traffic for the late evening appts at 9pm should be a breeze getting home and back (at least I hope so). Ellen -- the mapping in the CT scanner was not bad at all -- just holding in the same position with arms up was tiring after awhile. Lots of markings and stickers by the dr and techincian and the permanent tatoos came after the scanning was done. I'll get more tats during the 2nd simulation on Oct. 31st, then treatment starting the next day on Nov. 1st.  25 treatments with 5 boosts to the actual tumor site.  I'll also be doing lymph area and clavical.",
      "MessageIndex": 2167,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Oct 19, 2011 01:54PM Chrys23 wrote: Yay Robyn! Ellen -- The tats are so teeny, weeny tiny for Rads...Like really small, you can barely see mine. They put a tiny drop of ink on your skin and then take a needle-like thingy and just barely scratch your skin. Saw the Gastro doc yesterday --I'll be having an endoscopy on Oct. 31st to check my throat and tummy out. It's going to be a crazy day that day -- the procedure is at 8am and I have my 2nd radiation mapping at 1pm in the same bldg. Ugh... I just pray that my throat and tummy issues are from the A/C...I really do.  They want to see if the Adriamyacin caused like a burn in my GI and throat.   My right ankle has been mildly swelling/puffy, so I don't know if that is something to worry about. I just left a msg for the nurse at the Onc's office.   Seems like I can't catch a break. My fingernails are still dark and I still have the occassional rash and hive. I broke out in front of my mom yesterday, so at least I don't feel like I'm crazy for saying this is all still happening 3 weeks later! LOL I'm going back to counseling -- I had been doing around the time before my surgeries had been to sick to continue  during chemo, but I'm going back soon. Everything with this BC is just too much at times. Does anyone else feel the same way?  I near had a breakdown yesterday. My body just does NOT feel normal yet.",
      "MessageIndex": 2197,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Oct 27, 2011 01:57PM - edited Oct 27, 2011 01:58PM by Chrys23 Waving hello to everyone!  Yvette (Ybrooker1): Happy Belated Birthday! I haven't been around here, but saw that your birthday just passed. I hope it was wonderful! Robyn: Congrats on the Puppy! I hope everyone is doing well!  It's been 4 weeks since my last Adriamyacin and I am STILL having the throat and stomach issues.  I have an Endoscopy procedure on Monday and then in the same building go for my 2nd mapping at 1pm. What a day Halloween will be. I start radiation next Tuesday, 11/1.  Also, my breast is having 'pangs' and seems a tiny bit swollen -- so I'm getting that checked before my 1st radiation treatment at 1:30.  It seems to be never ending with me. Although the NP said that your breast could have pangs and twinges up to a year. I also got bit by the neighbors dog yesterday -- on the BC side arm. I called my Onc and he prescribed Keflex antibiotics for 10 days. It seems to be ok though. Had to file a complaint with the police today as this is the 3rd or 4th time the dog gets out. I started back to work yesterday after being out several months, but I can work part-time (per my RO) if I get fatigued due to the radiation up until January 1, 2012.  So, I'm taking it day by day. It's weird to be back after so many months. Also, I'm selling jewelry part time with Stella & Dot to take my mind off of this BC -stuff  (lots of celebs are wearing this stuff and they have little girls and tween pieces too. They were just featured on Good Morning America yesterday) -- so if anyone needs to shop for the holidays, please PM me for my website address.  Take care everyone -- Hugs and Kisses to all!! xoxox, Crystal",
      "MessageIndex": 2302,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Nov 9, 2011 05:14PM Chrys23 wrote: IslandGirl -- I am so sorry to hear of your illness. I pray you will be on the mend and in better health soon. How scary that must of been for you. Waving hello to everyone! Rad treatment #7 tomorrow...I can't wait to get it over with.",
      "MessageIndex": 2376,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Nov 12, 2011 05:52AM Chrys23 wrote: Hi Ellen -- Yes, some women who have had mastectomies can also recieve radiatio, due to certain variables: (http://www.breastcancer.org/treatment/surgery/mastectomy/plus_radiation.jsp)",
      "MessageIndex": 2397,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Nov 23, 2011 12:22PM - edited Nov 23, 2011 12:24PM by Chrys23 Congrats to all who have finished -- you too Grimbol! You go girl!! I hope everyone is well; Aimska -- how the heck are  you doing girl??! I had my 16th rad treatment today; 14 more to go! Have been having a hard time emotionally and finally went to see a Psychiatrist today. I'll be going on Celexa for depression and will try Ambien to help me sleep. I've been breaking down almost everyday, but from what my therapist says, it often happens as one reaches the finality of treatment and all the emotions just finally crest to the surfrace.  Also the stress of horrible side effects I am still dealing with and the daily travel 45-50mins for Rads is taking its toll. I needed to seek help, for which I am NOT ashamed. My hair is coming in with peach fuzz, so I'm happy for that! In any case, I wish you all a wonderful and blessed Thanksgiving. We're still here so that is something to be thankful for!!  Love, Crystal ",
      "MessageIndex": 2497,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 4, 2011 12:29PM Chrys23 wrote: Sure!",
      "MessageIndex": 648,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jun 1, 2011 07:34PM - edited Jun 1, 2011 07:43PM by Chrys23 Dear Shannon -- Thank you for your reply! Whew - I feel a 'little' better LOL How long does the wire localization take? My tumor is 1.5cm and ER/PR+ and Her2(negative). They say it seems 'low grade' at this point, but they are not totally sure until it's out and biopsied. That's about all I know for now. :) Chrys",
      "MessageIndex": 2,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769759",
      "Title": "Wire insertion before Lumpectomy? Chrys23 AMP614"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jun 1, 2011 07:46PM Chrys23 wrote:",
      "MessageIndex": 7,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769759",
      "Title": "Wire insertion before Lumpectomy? Chrys23 AMP614"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jun 10, 2011 09:04AM Chrys23 wrote: I had the two wires yesterday before my surgery with mammogram. I have to be honest that it wasn't too bad at all. I would say I was a mess emotionally but the two doctors and techician were great in helping me through each step. I would say that the numbing injection was the worst part. Not overly painful for me, but uncomfortable. I did feel a tiny bit of the needle going in, but never felt the wires at all. I'm just glad it is all over!",
      "MessageIndex": 14,
      "PostDate": "10/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769759",
      "Title": "Wire insertion before Lumpectomy? Chrys23 AMP614"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Chrys23 wrote: Hello! I tentatively have a Lumpectomy & SNB scheduled for next Thursday (barring any other issues found with my MRI).  For the SNB: the nuclear tracer and dye will be done while I am under (THANK GOD),  -- however, since my tumor is small (1.5cm) and the doctor wants to make sure he gets it all, I will be having wire insertion before the Lumpectomy. Can anyone tell me what this is like and what I should expect? I HATE needles and pain (I'm sure all of us are like this), and I thought I would be spared from any procedures before the surgery since he does the SNB dye and tracer under anethesia. I'm not looking forward to this at all. Also, I could use good vibes that nothing else shows on the MRI. Thank you! Chrys Lumpectomy & SNB 6/9/11; Re-excision 7/21/11; Chemo started 8/10/11 (TC 4x - every 3 weeks); Radiation sometime in November Dx 5/17/2011, IDC, 2cm, Stage IIA, Grade 2, 1/6 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769759",
      "Title": "Wire insertion before Lumpectomy? Chrys23 AMP614"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Chrys23 wrote: Afternoon! Newly diagnosed -- waiting to see surgeon next week. Just got back the addendum to my pathology a few minutes ago and am ER/PR+, along with HER2- I've just started to read up but want to know from others with the same results. Many thanks! Chrys Lumpectomy & SNB 6/9/11; Re-excision 7/21/11; Chemo started 8/10/11 (TC 4x - every 3 weeks); Radiation sometime in November Dx 5/17/2011, IDC, 2cm, Stage IIA, Grade 2, 1/6 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/769383",
      "Title": "ER/PR + and HER2- (what does it all mean?) Chrys23 Chrys23"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 2, 2011 09:13PM Chrys23 wrote: @Madismommy -- Hi hon -- how are you doing! My sister is wonderful to do that. I asked my mom (jokingly) if she wanted to shave her head and her facial expression was pricessless. She is from the south and said \"Oh honey...I gotta go to work everyday....\" and then rolled her eyes. It was all very funny if you saw it in person!  Did you start yet??",
      "MessageIndex": 176,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 3, 2011 08:43AM Chrys23 wrote: Good luck to those starting today and this week -- I wish you all the best!",
      "MessageIndex": 191,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 4, 2011 11:34AM Chrys23 wrote: Chrys23 (Crystal) August 10th TC, 4x - every 3 weeks",
      "MessageIndex": 238,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 4, 2011 02:05PM Chrys23 wrote:",
      "MessageIndex": 245,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 9, 2011 03:27PM Chrys23 wrote: Wow -- tomorrow is really \"Chemo Day\"....I wish everyone who is starting peace and minimal SE's. I've just had my good friends who were here since Saturday leave to travel back to NH. I miss them already. It's been a busy few days with a big party on Saturday and NYC yesterday. I guess I now have to settle in to reality that I start chemo at 9am tomorrow. Already took my first course of steroids this morning and the second tonight.... I had therapy early this morning and my therapist thought I was \"numb\". I told her I've been busy since last week preparing for my party and my houseguests that I didn't even think about it. She thought maybe I was stuffing away the inevitable start of chemo emotionally. I really don't feel that way - I really was BUSY! LOL In any case, it's hitting me now and it's surreal. I hope I will be ok (and all of you too). ",
      "MessageIndex": 375,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 10, 2011 09:59AM Chrys23 wrote: Thanks ladies! It's busy today - still waiting for a chair! YBooker: I'm at the Rena Rowan Breast Center/Abramson Cancer Center at HUP! When are your days? Wow - small world!",
      "MessageIndex": 409,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 10, 2011 04:05PM - edited Aug 10, 2011 04:05PM by Chrys23 Ybrooker:  I do go in for my 1st Neulasta tomorrow at 2pm!  My Onc is Dr. Kevin Fox. I don't know how long your infusions are, we (my sister and I) are leaving NJ at 12:45 tomorrow, so I may be there by 1:45.  You may be gone by then though. So cool!  Is this your 2nd or 3rd tx?? How have you been feeling?",
      "MessageIndex": 418,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 10, 2011 11:06PM - edited Aug 10, 2011 11:08PM by Chrys23 Hi Madismommy -- trying NOT to think about the whole WBC/fever thingy. Man -- I hope that doesn't happen to any of us. That's been drilled in my head too. My chemo nurse said today that days 6 through 9 is really when people's levels start to drop off.. Yikes... I've been resting/sleeping on and off since 9pm and it's now 12:30am and I'm awake and a little nauseous. I had soup during the transfusion at lunch, then a small chicken wing and biscuit at Popeye's chicken (why did I do that??!) on the way home with my sister. Came home and made an all natual pot pie from a natural farm  (only had a few bites), then 2 brownies and 2-3 Doritos and loads of water with lemon. What was I thinking?! No wonder I'm a little queasy. I'm going to take some Ativan/Lorazepam and see if that helps. Plus, my head feels a little wonky. Nothing major though. I brushed my teeth earlier with Sensodyne toothpaste and mouthwash -- not too bad.  Nighty-nite until 2moro...",
      "MessageIndex": 436,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 11, 2011 07:16AM - edited Aug 11, 2011 07:24AM by Chrys23 Good Luck Roxx and Dianamaps -- I wish you the best today! (and anyone else who is starting) I slept pretty good (except for waking at midnite -- cause I had slept a few hours before that). I did feel a little quesy then and a teenie, teenie bit this morning. I'm just sipping lemon water and may have some yogurt to take my sterioids with.  I have to travel in to Philly at 1pm today to get the Neulasta shot, which I am dreading. Took some Claritan yesterday at 3pm and will take another round at 2pm before the shot. (maybe will pop a tylenol as well).  I hope I don't experience any severe bone pain.  I will be self-administering the shot myself after my 2nd transfusion on September 1st. It doesn't make sense for me to keep traveling back to Philadelphia for a 5second shot. I hope I can do it.",
      "MessageIndex": 446,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 11, 2011 11:05AM - edited Aug 11, 2011 11:05AM by Chrys23 Kasi: Unfortunately, I DO have to pay a co-pay for each chemo visit at $25 a pop. Yikes! However, for radiation -- there is no co-pay and covered at 100%. My center has free parking for radiation treatments (since it's every day) and they will be starting free parking for chemo on August 15th. Drats - I had to pay parking yesterday, but at least it will be free for my 2nd treatment and going forward when I go back on August 31st.  I'll be paying $6 in parking (patient rate)  today for a quick Neulastat shot. YBrooker -- Good luck today! I will call when I get to the center to see if you are still there hon!!",
      "MessageIndex": 478,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 11, 2011 08:12PM Chrys23 wrote: Dear Yvette: OMG, I'm so sorry you had such bad nausea hon. To be honest, I'm having a bit of diarrhea myself tonight. I still feel a littel \"off\" -- queasy and head feels funny on and off. You are not whining at all! You don't feel well and you have every right to vent sweetie. You are a sweetheart too! I'm so glad we got to meet and I pray you feel better soon hon! xoxox (((HUGS))) to you! I just came back from Walmart -- wanted to get a toothbrush sanitizer, some Extra-Strength Tylenol to take tonight in case the Neulasta pain rears it's ugly head (already taking claritan as well). We went to Trader Joes as well, got some fresh fruit, fruit/veggie juice and lots of protein foods : Baked Tilapia, Turkey Meatloaf Muffins, Fat Free Beef Chili, Organic Turkey Breast and some Ginger crackers to help stave off this queasy feeling. I'm also REALLY fatigued. Moving around helps, but the tiredness comes in waves. Anyone else feeling like that? Welcome to Jillejo! Try not to be scared tomorrow (easier said than done). I tried to be calm and my sister and I prayed over ourselves and I took blessed rosary beads and blessed me AND the chemo. I tried to make it a positive experience, although scary one. I did good -- didn't even cry. I pray that you will go in peace tomorrow and try to think of the chemo as a good thing, killing any stray cells that may be floating around. 46MD:  Glad you got the first one down! Rest :)",
      "MessageIndex": 516,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 11, 2011 09:07PM Chrys23 wrote:",
      "MessageIndex": 519,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 16, 2011 11:13AM Chrys23 wrote: Afternoon! Hope everyone is well! I keep having severe muscle pains/aches - sometimes it feels like I can hardly walk. I can't tell if this is a s/e from the chemotherapy itself (Taxotere/Cytoxan) or Neulasta. I feel like I'm in the minority with this. :(. As I said yesterday, it feels like a severe flu but with muscle weakness/pain and this is day 6. My chemo nurse said that days 6-9 are sometimes hard as the white blood cells go down and then dip back up after that timeframe. Other than that; I sleep fine and am eating normally. I actually like the Biotene Mouthwash! I'm using the Sensodyne Toothpaste as well. Baking soda and or warm salt-water helps with the prevention of sores and bacteria. I just wish my body didn't hurt like this. :(",
      "MessageIndex": 690,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 16, 2011 09:02PM - edited Aug 16, 2011 09:04PM by Chrys23 Sweeney -- thank you for checking in on us! Glad you are doing ok. One year from now seems like soooooo far away; but I pray that all of us will be talking one year from now say \"do you remember when......\".  Amelie: Thank you -- I will check to see what I can take to help prevent Neuropathy. I took Tylenol and that seems to help, but I hope tomorrow is a better day and that these s/e's finally lift so I can feel \"norma\" (whatever that means! LOL)",
      "MessageIndex": 725,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 17, 2011 05:44PM Chrys23 wrote: Ladies -- does anyone know if you can go swimming in a pool during chemo? Just curious. I know we are supposed to stay out of the sun and try to wear sunscreen and seek shade, but I don't know about swimming (pool only -- no ocean).",
      "MessageIndex": 757,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 19, 2011 09:44AM - edited Aug 19, 2011 09:45AM by Chrys23 IslandGirl: Here is the thread for tips when starting Chemo; it was very helpful to me: community.breastcancer.org/for... Hope this is helpful!",
      "MessageIndex": 824,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 22, 2011 03:38PM Chrys23 wrote: vtEllen -- Yes, the steroids help control the SE's, but the body does \"come down and crash\" afterwards, which what I was told. I do take the sterioids (4mg/2x a day) the day before, the morning of -- then I have a good dose (20mg) of steroids in my IV and I was told I didn't need to take another dose that evening. Then, I take my final dosages the next day after chemo and that is it.  I still got the horrible, wracking body aches/pains from the Taxotere though. And for me, the steroids did not keep me awake at night -- I've been sleeping really well since my 1st infusion. I hope and pray that doesn't change.  I never needed the nausea meds really (I think I took only one), but that was it.",
      "MessageIndex": 932,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 23, 2011 09:59AM - edited Aug 23, 2011 10:01AM by Chrys23 Hi Justina -- Oooh, I hope you find some relief hon. I think you're doing everything you can. I wonder if the onc can prescribe something to help from the pharmacy to assist in relieving your discomfort? I would ask -- can't hurt! I'm not experiencing that; actually my #2's are really soft and I don't know if that is an effect of the chemo. First I was constipated and then it turned to really easy coming out, and this is still happening and I'm at day #14. (sorry if this is TMI). ",
      "MessageIndex": 963,
      "PostDate": "23/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 23, 2011 06:12PM Chrys23 wrote:",
      "MessageIndex": 974,
      "PostDate": "23/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 26, 2011 12:43PM - edited Aug 26, 2011 12:44PM by Chrys23 Madismommy -- thanks!  Yes, the storm is supposedly going to be pretty bad; I also hope it won't be as bad as they say.  Lots of gas stations are running out of fuel in some spots and the stores are madhouses!  However, I guess it's better to be safe than sorry in any event.  I have so many trees surrounding my home; that worries me the most and with 2 infirmed animals, I hope they are wrong about this one! Ps...I talked to the manager of the Vet's office; an hour-long conversation this morning of what transpired yesterday.  Even he was appalled and I got the $400 balance taken off! I'm a good negotiator",
      "MessageIndex": 1072,
      "PostDate": "26/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 28, 2011 01:45PM - edited Aug 28, 2011 01:48PM by Chrys23 Afternoon!  What a crazy night with this hurricane! Lost power last night and it just came on! Parts of Central NJ here are under water -- especially right down the street from me, the water is waist deep! It's insane; most of the roads are closed and major roads are look like lakes. Very crazy!  Taylor: You will do ok! You don't feel anything, and to be honest, the infusion does not hurt (meaning the meds don't hurt going in) and is almost non-eventful. It's just like getting fluids in the hospital, if you've ever had that.  We'll be thinking of you! I look HORRIBLE in scarves -- just don't look right. I'd rather wear my wigs and I have so many now, that I'm happy with that. I've been wearing trendy hats too; which look cute with big hoop earrings! I like to be fashionable, even while on chemo AHAHA! I noticed that my right thumb-nail looks \"dark\" close to the cuticle. I hope my nails aren't starting to turn. I purchased tea-tree oil and clear protectant, but maybe I'm too late.. :(",
      "MessageIndex": 1137,
      "PostDate": "28/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 31, 2011 07:46PM Chrys23 wrote: Evening -- #2 Chemo down! Long day and I'm really tired....I got home from Philly at 5pm and am SO SLEEPY from the Benadryl. Just woke up from a short nap and feel exahusted still. Grimbol, I hope you are ok too....Sorry that you had a reaction to the Taxol hon. Had a problem getting the IV in my wrist -- it was hurting for awhile while she tried to get the vein..The nurse finally got the needle in further down my arm in the crease. Whew! Thought I'd have to come back tomorrow if they couldn't get it.  My Onc Nurse told me to take Advil along with the Claritan for the Neulasta bone pain, she said that may help better than the Extra-Strength Tylenol. I have a Home Care Nurse coming to the house tomorrow to administer the shot later in the afternoon.! Have a good nite all; our cleaning lady is coming at 7am tomorrow and my house is a wreck! I don't have the strength to put things away right now. ",
      "MessageIndex": 1239,
      "PostDate": "31/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 1, 2011 08:25AM Chrys23 wrote: Dear Taylor -- How are you feeling so far?  I know some of the ladies here (includiing myself)  keep a light journal of any side-effects they may expereince (if any) down the line on the days following their treatments. It's helpful for me to know how my body reacts as I have a handy list that  I can relay it to my Oncologist and Nurse Practioner when they see me before each treatment. I hope you are doing ok so far!",
      "MessageIndex": 1246,
      "PostDate": "01/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 7, 2011 03:31PM - edited Sep 7, 2011 04:21PM by Chrys23 Hey Ellen -- I use the Sennekot-S (to really have an effect, use 2tabs/2x day), but the thing that really works for me is Milk of Magnesia. You take a couple of tablespoons and it will make you go in about 2-6hrs. I really don't take any meds after my treatment except for the steriods. I take the steroids twice a day the day before, the morning of (then I get 20mg of steroids during chemo) and then skip the night, and then the day after I take my final two steroid dosages.  I don't take any ativan or zofran after treatment (never needed it) because I get a huge bag of it in my IV during treatment.  I actually sleep fine and I can eat fine. I start taking Advil and Claritan the day before my Neulasta and I've continued the Advil for the past 7 days. I haven't taken any today.  But as I type this, I feel \"off\" -- stomach is lurching again like I'm going to be nauseated.  I don't understand why this is happening 8 days in. I had a bagel and some popcorn and that's it today. Weird...",
      "MessageIndex": 1392,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 12, 2011 12:48PM Chrys23 wrote: Hi All -- Been out of pocket since the UTI last week.. Yow -- I'm feeling better, but I had the weirdest symptoms (sorry if this is TMI) --- burning pain when urinating (which is normal), but  at the same time, I had pressure and 'soreness' in my lady parts and heiny. It was awful trying to use the restroom -- so uncomfortable..  Does that sound weird??! Could it be the bladder and everything else is close together and was inflamed??  The Cipro antibiotic was very strong and by the 2nd day, it had eased considerably, but it took a good 3 days for all those symptoms to go away. *sigh*.   I go back to work on Wednesday and my 3rd T/C treatment is 9/21 -- then I'll be out the week after that once again. I haven't caught up with the posts, but I hope everyone is doing ok! Crystal",
      "MessageIndex": 1493,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 14, 2011 04:56PM - edited Sep 14, 2011 04:58PM by Chrys23 Ellen -- I'm having some really weird s/e's and I'm at day 16. I don't even want to post anymore, because I know it sounds like I am whining and complaining and everyone else seems to be doing ok.  I probably won't come here anymore or will do it infrequently. I don't want to depress anyone. While I don't have neuropathy -- my skin has started to itch and sometimes feels like it is burning and on fire in different spots (perhaps this is a form of neuropathy?). My fingertips were numb for just a few minutes yesterday and then it went away.  I also feel like my pelvis is going to drop out!! My internal organs feel \"sore\" when I walk.  I have gas pains and pressure when I use the restroom too. It's just too much.  I just went to today work for the first time since August 31st. I'll be at work until next Wednesday, then I'm out a week again. I don't know what is wrong and why I am having so many issues. I'm actually scared of tx #3 next week -- cause I don't know if I can take much more. While I can eat fine; I'm scared. Why can't I have it easier.........  Oh and btw -- I LOVE my wigs! I've always worn them, so I'm used to it and love doing new styles and such. Madismommy -- you and your daughter look beautiful! Take Care and best wishes to everyone.",
      "MessageIndex": 1553,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 15, 2011 03:29PM - edited Sep 15, 2011 04:49PM by Chrys23 Hello everyone -- I stopped the Dexilant for GERD and no stomach cramping, bloating gas today. Hmm....I called my ENT to see if he can prescribe something else, but no word yet. I called the ONC to report the itcy/burny issue neuropathy issue -- now on to my hands, feet, even my tongue felt itchy today and rest of body (comes and goes), so I haven't heard yet. It's 4pm here in NJ and I guess I'll call again tomorrow. My cancer center is huge and I'm sure they are wafting thru all the calls.  Take care everyone.  ",
      "MessageIndex": 1587,
      "PostDate": "15/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 21, 2011 10:12AM Chrys23 wrote: Ellen - yup, I'll be doing my last two treatments with Adrimycin instead of Taxotere. I'm still in Philly - they are trying their darndest to get me the heart test while I'm here. I hope if I get the test today and it's ok that I can come back for chemo on Friday or next Monday at the latest. My 3rd Taxotere was to be today and my last treatment on October 12th. I'll probably finish up around the same time if I do Adrimycin in another 2weeks instead of 3.",
      "MessageIndex": 1727,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 23, 2011 03:30PM Chrys23 wrote: Hi All -- Just got home from a loooong day....I was done with my 3rd treatment at 12:30, in which I started Adriamycin as my new chemo, but when I went downstairs to have lunch in the cafe, my right leg started to itch a teeny bit and my lips were a little tingly. So, my husband said we should go back up and let them know before we drive an hour home to NJ. Hate to wait a bit for my Onc, but he came to see me in between being SUPER busy with other patients and quickly examined me. He thinks I'll be ok, but to take Benadryl or the other itching med they gave me if I start to show signs of a rash again. I popped a Bendadryl right there and then!  So far, my tongue tastes funny (started right when they did the Red Devil push in to my IV).  Today --  I had sterioids (orally) first, then Zofran via IV, then Emend in my IV, then Red Devil thru my vein, then Cytoxan via IV.  This is SO different than the long taxotere treatment. I have to take steroids tomorrow and sunday, but that's it. Still get Neulasta tomorrow, which I'll do at home. DianaMaps: Congrats on finishing your A/C!  Ybooker1: I hope you are well; thanks for the prayers! I'm going to lay down -- I pray I won't have any more allergic reations. Take care everyone and I'm sorry if I missed anyone; not my intention. So tired, I need to sleep as we left at 7:30am and just arrived home.  xoxoxo",
      "MessageIndex": 1770,
      "PostDate": "23/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 23, 2011 04:16PM Chrys23 wrote: Ut oh -- just got a tiny hive down by my ankle. My right leg is starting to itch a teensie bit and tingle. WTF!!!!! I'm taking the itching pill and see what happens. I can't believe this sh*t!!",
      "MessageIndex": 1772,
      "PostDate": "23/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Nov 15, 2011 03:44PM Chrys23 wrote:",
      "MessageIndex": 2437,
      "PostDate": "15/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Nov 29, 2011 03:37PM Chrys23 wrote: Hi Deb! What is useful for me is Aquafor and Keri Sensitive Skin Lotion.  I'm at treatment #19 and have NO skin issues at this time. Hopefully, this will remain the case until the end. My center even mixed Lidocaine and Aquafor for any minor pain issues, which I was having over the weekend. Sometimes I put regular Aquafor on and THEN add the Keri lotion on top of it. I do the chest (my clavical is being radiation), breast, nipple and under my arm near my sentinal node scar.  All in all, I only have skin darkening; so I am thankful. I hope this helps!",
      "MessageIndex": 2509,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 2, 2011 09:02PM Chrys23 wrote: Good Evening! May I join the group as well? I've confirmed I'll be starting chemo next Wednesday, August 10th! I found out my re-excision was good and my margins are clear!!!  I will be doing TC for 4 treatments every three weeks. I've already been sent my scripts for Ativan, Zofran, and Decradon (sp?) as well as a script for a wig prothesis for my insurance compay, who will cover up to $500 for wigs and supplies.  My sister is going to shave her head with me in support (yikes!) I hope everyone is doing well!",
      "MessageIndex": 174,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 4, 2011 08:53AM Chrys23 wrote: VtEllen - thanks for sharing your experience.  I am SO SENSITIVE to meds; I'm allergic to latex, IV Contrast Dye, Adhesive Tape -- you name it! I was pre-medicated once for IV Contrast for a CT Scan and my tongue STILL swelled. The nurses were in shock. I was like \"told you so....doesn't matter, I'm sensitive!\". I hope you are feeling ok today and no SE's come creeping at your door. Kasi: Best wishes for you today! Vieve: Welcome!",
      "MessageIndex": 230,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 5, 2011 12:07AM Chrys23 wrote: vtEllen - I hope you are feeling better as well!",
      "MessageIndex": 258,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 7, 2011 09:33PM Chrys23 wrote: Hi Dogmom -- I start August 10th as well. Welcome! I had a big BBQ party with family and friends yesterday to kinda see everyone before I start treatment. As a surprise, my best friend from NH was supposed to arrive today, but arrived YESTERDAY at the party as a surprise with her husband and son in tow. I was so touched! My son and my sister were in on the surprise.  I have a whirlwind of activity with them (NYC tomorrow and Philly on Tuesday), so I guess I'll be going in to chemo blind on Wednesday. I better remember to take my steroids on Tuesday. It will be here soon enuf - I guess I should enjoy things while I can.",
      "MessageIndex": 330,
      "PostDate": "07/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 10, 2011 01:15PM Chrys23 wrote: Yay -- I'm done! About to go home!!!",
      "MessageIndex": 412,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 11, 2011 08:15AM Chrys23 wrote: Ativan is techically Lorazepam -- same drug for anxeity. I was prescribed Lorazepam at the beginning of my diagnosis from my GP because I couldn't sleep and was just in a horrid state waiting for over 2weeks to get my first consult for BC. It supposedly is also a good nausea-aid for those on Chemo, so I was prescribed more from my Onc.  I also have Zofran, which is a wonder for nausea.",
      "MessageIndex": 451,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 11, 2011 04:18PM Chrys23 wrote:",
      "MessageIndex": 498,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 12, 2011 02:35PM Chrys23 wrote: Madismommy - I'll be self-administering my next shot on September 1st. My center is supposed to be calling a Home Health nurse to come on that day to my home to show me how to inject it! My husband can't - he is way too squeamish! My chemo nurse told me Wednedsday that the best place to inject it is in the belly - taking a pinch of fat (I have enough!) and just quickly stick it in the skin. That should be fun! Ahaha!! I've got enuf jelly/belly roll to go around. :p",
      "MessageIndex": 553,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 13, 2011 08:49PM Chrys23 wrote: Well - I'm in a lot of leg pain tonite....strong achiness :( Have a good nite everyone; I hope I'm better in the morning. Hopefully extra-strength Tylenol will help.",
      "MessageIndex": 599,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 14, 2011 07:27PM - edited Aug 14, 2011 07:30PM by Chrys23 Evening -- No more bone pain today! YAY! Last night was a doozie - yowsa! I'm feeling better, just a little 'backed up'. I purchased \"Smooth Move Tea\" and am popping Sennekot and drinking Milk of Magnesia. Ugh  Sorry if this is TMI everyone  I'm eating way too heavy - had 1/2 a chicken parm sandwich and some fries, but I was craving it. Had ice cream too. No wonder I'm having potty issues. LOL My teeth, mouth and tongue feel \"off\" (no sores) and for some reason my left foot is sore under neath the heel. Weird.... Oh, I'm bloated too.....Wow, I guess I'm not doing so good! LOL",
      "MessageIndex": 618,
      "PostDate": "14/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 15, 2011 06:56PM - edited Aug 15, 2011 06:58PM by Chrys23 Ps...Doodlebug: I hope you feel better hon! Try to rest. I'm so flu-y right now that every spot in my whole  being hurts. Popped two Extra-Strength Tylenol to see if that helps. Just picking my head up is a chore! Feels like I have a whopping flu-bug. ",
      "MessageIndex": 662,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 17, 2011 01:15PM Chrys23 wrote: VTEllen -- when was your first infusion? And when will your 2nd be? Robyn: Glad you are up and around. Aren't those muscle aches horrible? I felt like someone was holding me down, while punching me with 80lb weights. My legs felt heavy, like I was wading through sand or mud and then the whole body-aches were just agonizing. But I've had no nausea either. I don't know which is worse! LOL",
      "MessageIndex": 751,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 19, 2011 09:34PM - edited Aug 19, 2011 09:36PM by Chrys23 Hi Grimbol! Congratulations on the arrival of your new grandbaby! :o) I did not take my nausea meds past day 3. I wasn't nauseated at all, just a teeny bit queasie at times, but nothing major.  If you still need them; take them. Everyone is so different in how their body reacts.  If you feel it's unusual to still need them, check with your Onc if you are worried. Now..if you want to talk about those muscle pains again, we can go there!   LOL   ",
      "MessageIndex": 841,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 23, 2011 05:57PM Chrys23 wrote: Welcome Flautalee and AshVegas to the forum!  Flautalee: I am very sorry to hear of your recurrance. If I may ask, if you had a mastectomy, where did the new grow? I apologize if this sounds like a stupid question. I'm thinking of you as you go thru your 2nd treatment. AshVegas: Sorry to hear about the severe pain; I am also on T/C (started 8/10) and had horrible aches/pains that were just mind-numbing. For me, my transfusions are on Wed and I had bone pain from the Neulasta shot on Saturday and it was very specific in the fact that I could tell it was bone pain.  The severe aches/body pain was from the Taxotere (per my Chemo Nurse).  Last Wednesday, my temperature rose to 99.8 and .9, but didn't get above that. I totally understand how painful it was, so I can truly empathize with you. I hope you've turned the corner and feeling remotely better. I also hope the UTI will be under control as well. Our bodies can go through so much during treatment. ",
      "MessageIndex": 972,
      "PostDate": "23/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 25, 2011 04:38PM - edited Aug 25, 2011 04:44PM by Chrys23 vtEllen: Yeah -- I've read those forums and then freak the heck out. I have NOT had any scans either....... I do know that my Onc said that PET scans often give out false positives and he hates using them; he was very adamant about it.  His nurse reiterated this to me as well.  I didn't have a MUGA because I would get it only if I was on Adriamycin, since it can be hard on the heart. If you look in the forum \"Stage II with Lymph Node Involvement\" there is some talk there that many Oncs don't give a lot of scans for Stage 1 and 2 cancers, but some do. I'm having a crappy day; my temp is 99.3 (Low, I know), but I feel achy and my neck and shoulder hurts. I freak out that something is wrong or that it's mets.  My cat has been at the vet since 6am this morning, I've had no sleep and they don't know what's wrong with him, took his blood and NEVER called me all day.  The cat is still there... I'm so ticked off. He's older and has been in a cage for 12 freaking hours.  Then, my little Chihuahua went to the vet at 4pm. Found out he has an abcess in his anal glands as he has had diarhea since yesterday.  He has a fever and I had to leave the exam room as he was screaming in pain as they tried to express his glands. He's on pain meds and antibiotics.  It's been one craptastic day.",
      "MessageIndex": 1044,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 25, 2011 08:21PM Chrys23 wrote:",
      "MessageIndex": 1057,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 26, 2011 09:02AM - edited Aug 26, 2011 09:05AM by Chrys23 Morning everyone -- I hope everyone is doing well and hanging in there... My hair is just falling out all over and the sides are almost bald at the temples. Oh well....such is part of this process.  My pets are both home -- Thanks for the kind wishes about my dear pets.  My little Chi has an abcess in anal glands and is in a lot of pain    It finally popped last night, but he's so uncomfortable. I hope the meds really help soon (antibiotic and pain meds). My cat has some type of inner ear infection thing -- his balance is off, his head is cocked to the side and he keeps falling over; but they also see a nodule on his lung.  I picked him up at 11pm last night and was hit with a $600 bill which I am contesting. I paid $200 as a courtesy, but with the sh*tty customer service I recieved yesterday, with no phone call for 10hrs is just unacceptable and I didn't authorize the chest xrays which were almost $400 in total. Oh and my husband is so worried/anxious about the impending Hurricane, I made him take two Lorazepam last night and go to bed -- I've got too much on my plate to have him freaking out over something he can't control! Ahhh! ",
      "MessageIndex": 1068,
      "PostDate": "26/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 27, 2011 10:50AM Chrys23 wrote: Morning -- Hope everyone is ok today; especially those of us on the Eastern side of the country! Taylor: Ooh, sorry that your little one is upset; poor little guy. My son will be 21 next month (I'm 46), and I even hate to be around him with my hair all balding and messy   I think he's worried, but as a young man, he doesn't talk about it much.  I try to act as \"normal\" as possible (whatever that is). I hope your little guy will be ok.  I know that Tuesday is looming for you; so I pray you have some peace as you start treatment. Oh and your profile pic is gorgeous!! Hello to Mommyx2!!",
      "MessageIndex": 1106,
      "PostDate": "27/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 1, 2011 09:42AM - edited Sep 1, 2011 09:43AM by Chrys23 Kasi -- Good luck on #3 today -- how many more do you have to go?  Sorry that you don't like your wig; I hope the new one is better for you. As my Onc told me yesterday \"you are almost 1/2 way done, Crystal!\"  I guess he's right -- gotta think positive!  I go again on Sept. 21st and my last one is Oct. 12th.  Good luck to Capinva & Karebear today!",
      "MessageIndex": 1249,
      "PostDate": "01/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 13, 2011 01:29PM - edited Sep 13, 2011 01:29PM by Chrys23 Kasi -- thanks for the info on the D-Mannose. I saw some positive and negative reviews of it. In any case; I'm having all kinds of new and weird s/e's this late -- overall body itching, (no rash), my head is now itchy like a mother-father!!  Also, a lot of gas pains and heartburn after eating. So strange. My onc's office called today to check on me and I told them this new batch of stuff. UGH, and I have to go for number 3 next Wed!! Jeez........ Anyone experiencing this??",
      "MessageIndex": 1509,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 20, 2011 05:26PM Chrys23 wrote: Hi Ladies -- The coming and going rashing and itching is just horrid.  I actually called the Onc again today because my hands will flare up (or any other part of my body), get real red-hot and itch and then subside. Even my tongue itches/burns.   I've been taking photos of these rashing episodes on my iPhone so I can show the Onc tomorrow for tx #3. Today they prescribed something called \"Hydroxyzine\" for the itching, but it's also an anxiety med, but used to control allergic reactions to medicines. I'm scared to take it. All these meds!! Ahhh! I'm going to be adamant tomorrow that I am scared to take the Taxotere and suffer through this again for this treatment and my last one on Oct. 12th. Also, hot flashes are kicking my big fat ass! They come and go on a whim and in a freezing cold room, I'm sweating and feel like my insides are going to combust.  Can't wait for this sh*t to be over with!",
      "MessageIndex": 1710,
      "PostDate": "20/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 21, 2011 09:20PM - edited Sep 21, 2011 09:23PM by Chrys23 Hi Flautalee -- Yes, I've already had 2 Taxotere treatmetns. My 3rd treatment will be this friday to start on the \"Red Devil' and two weeks later (fingers crossed, barring any side-effects) I'll finish my 4th and final dose of chemo!  My current steroids weren't even helping the itching. They prescribed something called \"Hydroxyzine\" yesterday and I took one pill before bed last night (supposed to take it 3xs a day), and I had NO ITCHING/BURNING TODAY! I hope it helped. And I hope that I won't have a reaction to the Red Devil either.... Yes -- I DID indeed show the doc my photos! I pat myself on the back for that idea! LOL I keep a journal everyday of side-effects and things I notice after chemo treatments. I gave them a whole run-down this morning; my nurse practioner couldn't keep up with the stuff I was dictating!  My doctor is wonderful -- he's been rated one of the top docs in Philly for the past few years, and the breast center is wonderful. I feel very lucky on that front. :o)",
      "MessageIndex": 1748,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Oct 11, 2011 08:02AM Chrys23 wrote: Ellen -- It's funny -- when I had my hysterectomy, they kept my ovaries so that I would have hormones in my body.  How could I forsee that those said hormones were feeding my tumor! Aaaargh! As for radiation, when I had my initial consult in August, I think they said I would have 32 treatments. I can't recall either -- guess I'll find out more tomorrow. I requested the paperwork for the BRACA way back when I had my first oncology consult, but never filled it out because I don't have much family history that I know about. Not sure if it would be worth it. But I could always fill it out and see. I won't see my Onc until February 2, 2012 -- which is approx. two months after RADS is done and about 4 months from this point now.  Is that normal??  Also, my mammogram  and breast surgeon appointment is beginning of May 2012. I was diagnosed May 12, 2011.  I'm not sure if that is too far out as well (?!?)",
      "MessageIndex": 2074,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Oct 11, 2011 10:41AM - edited Oct 11, 2011 10:41AM by Chrys23 Hmm....thanks Robyn -- I think my Breast Surgeon said every year for mammograms..I need to check on that. I thought it was 6 months too. I had an MRI and ultrasound right before my first lumpectomy back in early June, so 6 months from then would be December, but I won't see him until May....that's so wrong .  My original diagnostic ultrasound and mammo were in May when I was diagnosed. As for hair -- I'm still bald -- I see no growth right now in my future! LOL  It's onlly been about 17 days since my last Chemo. Robo: Yeah, I'm still confused too -- I may see my old gynelocial-oncologist to just get an ultrasound ordered of my ovaries. I want to make sure they don't need to be removed. I can't imagine another surgery either.. Blech",
      "MessageIndex": 2079,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Nov 1, 2011 08:14AM Chrys23 wrote: Hi - I'm over at the FB group too...I hope everyone is doing alright. I start RADS today....Not looking forward to the drive to Philly, but I guess I better get used to it! for the next 6 weeks LOL Ellen -- Congrats on your store opening!! That's awesome; a lot of work, but I'm sure it's worth it!",
      "MessageIndex": 2326,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Nov 8, 2011 09:10AM Chrys23 wrote:",
      "MessageIndex": 2366,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Nov 11, 2011 09:48AM - edited Nov 11, 2011 09:53AM by Chrys23 Hi Everyone! I've had 8 RADS treatments already -- only 22 more to go!! I only started last Tuesday and last Friday, they had to cancel all appointments as they were doing a machine overhall. I think Ellen asked about the head turning -- I know for me, it's to make sure the airway is clear and out of the way. For one of my zaps, the radiation machine is very close to the left side of my face as it comes in on an angle to zap the breast. One of my tattoos is near the midline chest area and the airway has to be clear. Everyday, after I get in on that freaking hard-ass table, I have to clasp my hands over my head and hold two stationary rods and I lift my chin all the way up and turn drastically to the left.   I have zaps on the left, right and middle of the breast -- I'm being radiated also in the lymph area and clavical area.  Doesn't take long at all, but too hold that positon during the simulations and films was unbearable (about an hour!).   My drive is 50mins (without traffic) and I can say it's already exhausting. I also have pangs, twinges and electric-like pain in my breast at times that lasts a few short seconds. I'm using Keri Sensitive Skin Lotion (the center gave me this) and Aquafor.  Was told to wash with Dove Senistive Skin body wash and use Deodorant without any aluminum (ie: Toms of Maine or Trader Joe's brand or something natural from Whole Foods). I will meet with my RO every Monday after treatment, and did see him for the first time this week. I get a full BP, and Temperature Check as well as a physical to look over the breast.  I hope everyone is doing good! Can't wait for this to be all over with! ",
      "MessageIndex": 2389,
      "PostDate": "11/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Nov 12, 2011 05:30AM Chrys23 wrote: Hey Deb -- The radiaiton definately can focus on the spot where the tumor was in the event there are any 'rogue' cells in that area.  While right now they are radiating my whole breast and certain fields (like lymphs), towards the end, they will do \"boosts\" to the  actual tumor site as well as added insurance. Here is information on Radiation from this site: www.breastcancer.org/treatment... I hope ths is helpful",
      "MessageIndex": 2394,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Jan 4, 2012 08:05AM Chrys23 wrote: Hi ladies! I haven't been here in awhile -- I hope everyone is doing well! I finished rads on Dec. 14th and had horrible, horrible 2nd degree burns on my neck, under my arm and under my breast. They were huge, open pink flesh wounds and all the skin had come off. As of now, the dark skin is starting to cover the pink fleshy areas. I'm african-american and really shocked that I burned so badly -- but it was only towards the end (last 5 days). I'm worried about my neck because the skin loss there was huge and I have a huge scar that's the size of an orange. :o(  I'm using Vitamin E and Cocoa Butter and I pray it becomes less noticable over time. Scarves are my friend right now. It's weird to be done with treatment; I didn't start the Arimidex right away; I wanted a break as I had such bad burns from RADS, but I will start it on Monday. I just can't deal with more side effects at this point.  I'm also doing genetic BRCA testing on Monday. My left ovary has \"something\" on it and I have a 2nd ultrasound on Feb. 7th. I pray it isn't cancer. :O( Take care everyone! I miss you ladies!!!! You've all been wonderful  xoxoxo",
      "MessageIndex": 2578,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 9, 2011 07:12PM - edited Aug 9, 2011 07:15PM by Chrys23 For those who started treatment already -- did you pack anything to take with you? I've read some take a long a small \"chemo bag\" with their medicine, thermometer, etc.  Did any of you do this and what did you pack?  I'll definately bring my laptop. Also, did any of you drink water during chemo or that should really start after? I'm getting nervous (I think!)  Oh, if anyone is looking for a free wig; you can go to: http://crickettsanswerforcancer.com/ They will purchase a new wig for you (up to $ 100 from wigs.com) in honor of a loved one they lost from cancer. You have to fill out a short 2 page application and you pick a first and 2nd choice wig. If they approve you, they order the wig free of charge! I was just approved and ordered a nice cury/funky wig (I'm african american).  So, I wanted to pass along this option if anyone is interested or has never heard of the website. ",
      "MessageIndex": 384,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 10, 2011 12:32PM Chrys23 wrote: H all, Sitting in the  chemo chair -- got all my pre-meds at 11:30am, then started Taxotere at 12:27pm.  Thank God that i did not have a reaction!! My nurse had been wonderful -- very thorough!! Already had some soup too.  The Taxotere is almost done; then the Cytoxan for 30mins -- that will be it, Hope everyone else who started today will be ok!  ",
      "MessageIndex": 411,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 10, 2011 01:59PM - edited Aug 10, 2011 03:28PM by Chrys23 I feel \"ok\". I had some mild nose burning from the Cytoxan but they said that is normal - feels like a chlorine burn when you are at the pool swimming. I feel normal! But as the days press on, that's when the tides all turn!! lol",
      "MessageIndex": 414,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 11, 2011 09:30AM Chrys23 wrote: Madismommy -- I dunno about the Avistan....As you said yourself it's being pulled for BC treatment due to it's ineffectiveness for advanced or metastic breast cancer. I remember reading about it when I was on vacation in June:  http://www.cnn.com/2011/HEALTH/06/28/fda.avastin.appeal/index.html Ultimately it's your decision -- Say a quick prayer that you make the right decision and then go with your gut! Hugs,  Crystal",
      "MessageIndex": 470,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 11, 2011 02:24PM Chrys23 wrote: Just leaving Philly now - got my Neulasta shot, which DID NOT hurt! Yay! Had the added benefit of meeting Yvette (Ybrooker1) while she was recieving her 2nd treatment It was so nice to meet you, Yvette - along with your husband and friend! Had some lunch too - it's a nice day out! :)",
      "MessageIndex": 484,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 11, 2011 03:51PM - edited Aug 11, 2011 03:54PM by Chrys23 I'm still having quesiness issues. Ugh... Ate an organic grilled chicken sandwich with spinach at the cancer center,  (and snuck a few bites of cake) and a bottle of water, but then I get very mild quesiness and my tummy and head feel out of sorts. Nothing major, but just weird....Seems like I can't eat too heavy.    I was queasy on my way down to Philly too, in the car and had to munch on organic asiago cheese crackers and water and take Ativan for the nausea. If this is the worst of it, then I can't complain at all, can I???  Capinva: I'm glad your first round is over with -- was it what you thought? Glad you got to rest too!",
      "MessageIndex": 495,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 12, 2011 02:05PM Chrys23 wrote: Amelie - From what I've read regarding Neulasta, taking 24hr Claritan the day before your shot, the day of and 3-4 days after can help with the bone pain. I am trying that now. I dont know if it really helps or not or if I'm just lucky, but I don't have any pain thus far and I had my shot 24hrs ago. I guess only time will tell. Sorry you had so much discomfort. A mini-cruise sounds wonderful! I'm always up for travel and meeting new people! :)",
      "MessageIndex": 549,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 16, 2011 01:04PM - edited Aug 16, 2011 01:07PM by Chrys23 VTEllen -- the Leg pain has been the past 2 days on and off. Yesterday was horrible in the evening and today it's starting to subside a bit, but it was so extreme earlier, that I couldn't get out of bed earlier this morning.  I did get up and  walk the dog and that seemed to help, but it's pretty scary as you can imagine.  Everyone else seems to be doing well so far and I feel like I'll be the one to be hit with all the crappy stuff.   koalakid39: Thanks so much for the info!",
      "MessageIndex": 696,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 16, 2011 03:52PM - edited Aug 16, 2011 03:58PM by Chrys23 Grimbol -- thanks...I hope you are feeling ok as well.   I count day #1 as the day I started chemo, so I'm at day 6 or 7. I think that's right lol....Tomorrow is 7 days (one week) from my transufsion last week. Congrats to both you and Yaya on the impending grand-baby. That's awesome :) I did speak with the Oncology Nurse, and it is indeed the Taxotere. *ugh*   She said it should resolve in a day or two, as your body goes in to 'crash' mode after the steroid dosages -- however, if I'm still experiencing issues by the end of the week, I'm to call on Friday. I have to vent: My mother is freaking driving me INSANE. I DO NOT have her come see me or go with me to appointments, etc since I was diagnosed; she just can't handle it emotionally. She is over now, just for a quick visit and to help change my kitty litter pan (my husband has a consult with a waterproofing company and my son just went to work), so she stopped by to help. She keeps staring at me with pitiful eyes and keeps insisting that I \"have the flu\".  She also kept saying on the phone yesterday that my body was aching due to all the rain we had yesterday. I had to keep reiterating that I do not have the flu -- but am experiencing chemo side effects. Then she just stands there and looks distressed. I know it's hard to see your child go thru this, but she's nuts. She then says \"Oh well...when does it leave your system....I thought since you had it last Wednesday, it would be gone by now...they have to give you more -- what if it's not out of your body\"... HUH?!?  I actually asked her (politely) if she could go home. She's just really irritating me. Sorry, I probably sound like a horrid daughter, but I know my boundaries with my mom and she's just not a person I can get support from emotionally with this stuff.",
      "MessageIndex": 709,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 19, 2011 09:13AM - edited Aug 19, 2011 09:19AM by Chrys23 Morning everyone -- Hope everyone is doing well; Happy Friday!  Grimbol: I have to say (knock on wood), that I actually have felt better the last two days. Minor twinges here and there, but no body aches.  My left foot under the heel still is sore (weird), and I have tingling in my hands and feet sometimes.  I also feel 'flushed' all the time. I took the dog out yesterday afternoon and sweat was pouring down my face and it wasn't hot. My temp has been waffling between 98.8 and 99.3 -- it got high on Wednesday when I got a little achy and just tired. I'm actually going to try to go to work on Monday after being out a week on disability after the first infusion last Wed. I'm sorry you're battling the big \"D\".  I'd rather have that then being constipated, but I know it's annoying none the less.  I also hope your runny nose subsides hon -- so glad to hear you are feeling better!",
      "MessageIndex": 822,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 22, 2011 11:23AM - edited Aug 22, 2011 11:24AM by Chrys23 Morning everyone -- best wishes to those starting chemo today or this week and Happy Birthday wishes to Dianamaps and my4pumpkins! I went back to work today -- I've been out since June 9th (due to 2 surgeries and my 1st chemo infusion) and I think I've been at work only 3-4 days since then.  I will work this week and next Monday/Tuesday until my next infusion on August 31st. You other gals are brave that are working -- with the side effects I had last week, I'm not taking any chances, so I'll be taking disability for one week at each infusion. It actually stresses me out to be at work. Many people don't know I have cancer, so for me to be in and out so much; I'm sure is causing people to talk and that makes me anxious. Thankfully, I work at an Ivy League College, so most of students and faculty are gone -- but in two weeks, that won't be the case and my workload will be piling up.  A lot of ladies says work takes their mind off of their diagnosis, for me it's the opposite. At times not feeling well and with people don't knowing what I'm going thru; and having a very important academic job, puts a strain on me emotionally. Ok sorry for the debbie-downer routine, perhaps I'm looking too much in to it. Have a great day everyone!",
      "MessageIndex": 917,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 24, 2011 08:57AM - edited Aug 24, 2011 08:59AM by Chrys23 Morning! Robyn: I still have my hair, but this morning, I've been combing out shreds and small balls of it, so it has definitely started. Booo!   It kinda freaked me out -- I cried and called my best friend and my sister and now I'm fine; knew this was going to happen sometime. It's day 15 for me (I think), so I thought it would have started by now, but everyone is different.  I may shave it down a little more to help it along.  Flautalee: Thank you for answering -- your case is very interesting and you are in my thoughts and prayers as you deal with this new recurrance. Everyone is very kind here, so please feel welcome and post often  Kim: Sorry to hear about your husband's fractured ribs -- hope he is ok!  My Neulasta came in the mail last week and my Onc already has contacted a local home health care provider (who called me yesteday) to have a nurse come and show me how to administer my shot next Thursday. She said she would even come for my 3rd treatment if needed. My Onc is on the ball -- the home health provider said my Onc started getting this all ready in July and I wasn't even aware! It feels good not to have to chase individuals around to do what you need them to do. ",
      "MessageIndex": 999,
      "PostDate": "24/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 25, 2011 07:53PM Chrys23 wrote: Ellen -- I don't think my fever is an indication of mets; I just get worried that every pain or headache means something is wrong. I'm just nervous about this cancer in general.  My last infusion was 8/10 -- my next one will be next Wednesday. Thanks all regarding my pets: the abcess for my little Nacho just popped; which is good; I hope he gets some relief soon and that the meds start to kick in. I'm still fighting the vet about my cat; it's 10pm and still nothing (they are open 24hrs). I hope they fed him at least.",
      "MessageIndex": 1053,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 26, 2011 04:16PM - edited Aug 26, 2011 04:16PM by Chrys23 Zanoza -- do you have any anti-nausea meds? Zofran or Ativan (which is Lorazepam)? The ladies have good suggestions above. You can also try Triple Ginger Thins from Trader Joes (if you have one near you), sip Organic Peppermint Tea, 100% fruit ice pops, Gingerale, etc. I didn't have any major nausea issues, but I do hope you feel better.....Take Care!",
      "MessageIndex": 1078,
      "PostDate": "26/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 26, 2011 07:02PM Chrys23 wrote: Grimbol! Hey hon -- Yes, my hair is coming out in droves! My temples are almost bald on the sides. I still have hair, but it sheds at the drop of a hat. I saw \"The Help\" the other day with my mom; I hope you enjoy it! I'm sleeping fine (thank Goodness)!  Wednesday will be here quick -- blech!",
      "MessageIndex": 1082,
      "PostDate": "26/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Aug 30, 2011 08:14AM - edited Aug 30, 2011 10:54AM by Chrys23 Taylor -- Good luck today; hang in there!!!! Keep us posted afterwards Madismommy -- Good luck to you today too! You'll do fine! Sorry that your little one is so sad.     As far as your hair questions, my scalp doesn't feel like anything. It doesn't hurt and it's not sore. I still have some on top and through the back of my head, but my sides, temple and behind my ear are B.A.L.D. LOL   I just don't want to touch it at all. Sometimes I comb it lightly to let it shed, but other than that, it's doing it's own thang!",
      "MessageIndex": 1192,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 4, 2011 04:10PM - edited Sep 4, 2011 04:13PM by Chrys23 vtEllen, Grimbol, Robyn -- Oh man -- feel better ladies! We should start a \"Aches & Pains during Chemo\" group.      It's funny, but it's not!  Grimbol: I do have support; thank you for asking. My hubbie has been great and my sister too....they know that these are my 'bad' days now. I'm going to drag myself and go out to dinner tonight with my hubbie; I've been craving seafood and a baked potatoe, so that's what I'm going to do; even if my whole body hurts. Capinva - I hope you feel better too! Thanks for the support ladies; it's so good we have each other to lean on (literally) LOL",
      "MessageIndex": 1342,
      "PostDate": "04/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 7, 2011 06:19PM Chrys23 wrote:",
      "MessageIndex": 1401,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 19, 2011 06:45PM - edited Sep 19, 2011 06:47PM by Chrys23 Ellen -- I am praying that everything is B9.  Please keep us posted. As far as my severe itching/burning -- they've just told me to watch it. It's bad and I will reiterate it on Wednesday when I go in. I hope they can either take me off Taxotere or reduce the dosage. I just don't want it to get worse. I break out in rashes and it goes away, but  the itching & burning comes back and jumps all over in different areas (back, legs, palms of hands, feet, ankles, wrists -- you name it) I actually found someone on the boards who had the same reaction with this freakin' sh*t.  I guess I'm allergic to it.",
      "MessageIndex": 1682,
      "PostDate": "19/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 21, 2011 08:52AM - edited Sep 21, 2011 08:54AM by Chrys23 Morning ladies- UPDATE: I'm at the treatment center and just saw the Onc and my nurse practioner. I am NOT receiving anymore Taxotere. The Onc feels it s an allergic reaction and having another treatment could be \"problematic\". He also felt I possibly could be having a reaction to Neulasta but doesn't think that's it. So here is the skinny - I can either stop chemo altogether or try another regimine which would be Adrymiyacin (sp?). I opted to try the \"Red Devil\". I'd rather have chemo than none at all since I'm node positive. I have to have an Echocardiogram first, he's not doing a MUGA. I had a heart stress test in May and Radioactive Gamma testing back in April. I'm in Philly and they might not be able to schedule the test today. :(. I cant reschedule chemo until the test is done, so my days are all out of whack! Good thing is once start, I can do my final chemo in two weeks, not 3. Ok -- anyone on Adryimycin and can you tell me what to expect?? The Onc said the biggest issue is nausea, but I can deal with that over the itching/burning. I hope I don't develop worse see effects!! Any insight would be great! Thanks for listening ! Sorry if there are typos, I'm on my iPhone.",
      "MessageIndex": 1722,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 21, 2011 10:17AM Chrys23 wrote: Madismommy: Thanks for the info! I have Ativan and Zofran for nausea, but I've really not had to use it much for he Taxotere. I'm so VERY sensitive to any meds that I pray I don't get any weird side effects with the Adrimycin. I'm very allergic to everything and I knew I may end up with some type of reaction. Just weird that it started well in to day 16 of my 2nd treatment.",
      "MessageIndex": 1728,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 21, 2011 02:10PM Chrys23 wrote: Wow - just leaving Philly now! They fit me in for the heart test (Yay! Only waited 4hrs after having to get a referral from my stupid primary Drs office in jersey) and my first Adrimycin dose is this Friday (if the heart test is ok!). I just called from the car to ask if I need to take my steroids before treatment and they said no. Can Anyone on this regimine confirm what they get and if this is so?? And would getting my last dose in two weeks sound right? Do any of you get it every 3 weeks or two?? I'm so confused with this change up in treatment! lol",
      "MessageIndex": 1732,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 21, 2011 04:42PM - edited Sep 21, 2011 05:11PM by Chrys23 Kasi -- Thank you!  I appreciate the input. It's so weird how you don't have to do steroids before (and me also) but Madismommy has to do it. Each doctor is so different. My apologies for not saying hello and acknowledging everyone's posts. I hope everyone is ok. I believe I saw Mary has Cellulitis -- so sorry hon. That is SO uncomfortable!  I had it under both armpits last Summer. Got the infection from shaving and woke up at 3am -- my armpits were swollen,  looked like roast beef and they hurt like hell. I had a fever too and had to go to the emergency room. Couldn't shave for weeks and was on antibiotics and pain meds..Feel better sweetie!! As you can imagine, I've been really out of sorts with the iching/burning thing since Day 16 last week and it's really ticked me off and made me crazy phsyically.  Couldn't concentrate on anything else. Luckily for me, I had NO ITCHING today. Maybe it's the new med they prescribed yesterday for itching, but I only took it last night. I guess it worked. Didn't take it today, because I want to see if it comes back, then I'll start it up again. Grimbol: I hope your TC #3 went ok today! Keep me posted.  Hugs to everyone!  xoxo, Crystal",
      "MessageIndex": 1738,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Sep 24, 2011 11:25AM Chrys23 wrote: Thanks Ellen, Madismommy and Dianamaps -- your words are much appreciated. I called the on-call dr to just keep them abreast of what is going on. I had a small hive appear on my left cheek and my face feels 'puffy'. The doc said my reaction is totally NOT typical and it is very strange. Even above my ankles 'tingle' as well as my mouth and tongue. They are most worried about shortness of breath, tongue swelling and throat closing. I am to switch back to Benadryl every 8hrs (stop the Hydroxyzine) for now and see if that helps some. But to call back if ANY of the symptoms get worse and/or go straight to my local ER.  It's all very upsetting to say the least....thank you all for listening.",
      "MessageIndex": 1780,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Oct 6, 2011 01:37PM Chrys23 wrote: Hello everyone -- I see some have asked about me thank you. I've been resting and recouping and really didn't want to post more 'negative' stuff -- so I've stayed away. My oncologist called me today; he will NOT administer the final chemo tomorrow (Friday 10/7). He actually said that it would be detrimental and dangerous to my health to continue. He stated that since they don't know what \"agent\" is causing the severe reactions, to proceed would not be in my best interest.  I think he also feels comfortable in the sense that my OncoType score was 16 and I did at least have 3 out of 4 treatments.  I asked him if they could prolong the steroids or give mor benedryl, but he said NO -- too dangerous.  So, I wasn't the one to say to stop, but it was him. He just won't do it. He said the only other option was the CMF protocal of drugs, but he said it may be a waste of time to give me that. He had actually told me the same thing after my 2nd Taxotere became problematic. I am still traveling to Philadelphia tomorrow to the cancer center to talk to him in person. He told me if I am coming to \"convince someone to give me a final dose of chemo; it;'s not going to happen\". Yikes! He told me I should move right in to Rads and to call them to bump up my mapping appointment, which was scheduled for November 1st. He said if they won't bump it -- he will help tomorrow when I come in to get me in sooner than that. So -- I guess I'm done.  I don't know how to feel -- shocked, but relieveda at the same time, but not in a bad way. I hope everyone is good; I've missed everyone.  Hugs, Crystal",
      "MessageIndex": 1994,
      "PostDate": "06/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Oct 6, 2011 04:41PM - edited Oct 6, 2011 04:53PM by Chrys23 Thanks to those who commented. It feels surreal to not go for any more treatment and I pray that the 3 treatments were enought to help fight any cancer in my body. I was able to move my radiation consult up to next week instead of November 1st.  Maybe I can start soon and be done near or right after Thanksgiving. That TRULY would be a blessing! Taylor -- I did have a UTI while on Chemo after my 2nd Taxotere treatment. I had excessive burning while urinating, I felt the need to urinate every 60 seconds and my pelvic area hurt horribly (felt heavey). I was given a strong antibiotic (3day course) and an anti-spasmotic/pain reliever (which turns your pee orange).  It really did work quick! I felt some relief the first day on the medicine.",
      "MessageIndex": 2002,
      "PostDate": "06/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Chrys23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129383/profile",
      "Content": "Nov 3, 2011 08:32AM Chrys23 wrote: JUMLL -- I had itchy hands and feet, but that happened when they switched me over to A/C. With the T/C; I had bone pain, flu-ish symptoms and weak legs. Now that I look back; the T/C was a breeze compared to the A/C. I could eat and somewhat function on T/C. The A/C was horrendous. I'm still dealing with the after-effects. I'm seeing an ENT today.",
      "MessageIndex": 2342,
      "PostDate": "03/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    }
  ]
}