{
  "AuthorID": "Chunkies",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83925/profile",
  "Posts": [
    {
      "AuthorID": "Chunkies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83925/profile",
      "Content": "Jun 4, 2009 09:01PM Chunkies wrote: Gez052, I'm sorry to hope that you're sick.  I hope it passes quickly and you'll be back to new :)  Myagirl,  I started TCx4 on 04/07/09 and I shaved my head about two weeks later on 04/24/09.  I started to shed on day 14.  It was strange since it seemed like my hair was snapping out close to the roots.  After I shaved, I would say I had about 80% of my hair left but it's been dwindling with each treatment.  At first it was really hard for me to look at myself w/o long hair but I've gotten used to it.  I'm using bandanas as well since I know I'm too lazy to take care of a wig!",
      "MessageIndex": 6,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735177",
      "Title": "Does everyone loose their hair during TC chemo myagirl Sharon648"
    },
    {
      "AuthorID": "Chunkies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83925/profile",
      "Content": "Jul 8, 2009 12:36PM Chunkies wrote: Hi Carole,  When I was first diagnosed, I was totally gutted when I realized that I would have to have chemo and lose my hair.  It wasn't any fun and I got through it like all of the ladies here.  I think the worse part was just waiting to lose my hair.  After that, I eventually got used to looking at my shiny  head.  I've been keeping my head covered with bandanas as I'm too lazy to maintain a wig.  Best of luck to you.  Makingway - I thought the caps weren't a guarantee that you would keep your hair.  I thought it worked by chilling the scalp which decreases blood flow to the head so your scalp won't get as much chemo.  I sucked on ice chips to try to keep away the mouth sores and it seems to hvae worked.",
      "MessageIndex": 8,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737048",
      "Title": "scared, start chemo 7/20 Carole01 marlenet"
    }
  ]
}