{
  "AuthorID": "Ciaci",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
  "Posts": [
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "Aug 17, 2017 09:10AM Ciaci wrote: Hello! Diagnosed April 2017, Stage 4 (one met on spine) May 2017",
      "MessageIndex": 398,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "Jun 26, 2017 03:52PM Ciaci wrote: Hi, rebamacfan (I love her, too!) and ML1209 - I, too, will be starting my radiation in July. I have my consult appointment with the radiology oncologist on Wednesday 6/28. Was diagnosed in April, and had a lumpectomy with 4 nodes removed as well (1 positive for cancer cells, 3 negative). Since PET-CT showed activity on my spine, and a biopsy confirmed presence of cancer cells (but no visible tumors), my onc is opting for radiation first, to be followed by chemo. Oh, and he's starting hormone therapy same time as the radiation. I have no clue what to expect, so am reading as much as I can here. Hard to wrap my head around the change in plans (I was scheduled to start chemo in late May, then all the scans started showing the stuff on my spine), and trying to adjust. I guess I'll be checking in here instead of the \"Starting chemo\" topic, LOL",
      "MessageIndex": 2,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "Jun 26, 2017 10:00AM Ciaci wrote: Well, looks like I'm going to have to wait to post in the \"Starting Chemo August 2017\" topic page... My biopsy (after a suspicious PET-CT scan) showed cancer cells in/on my spine (T-11 vertebrae). Not a tumor, at this point, just \"cells\" (I think that was supposed to make me feel better). So my oncologist switched the way we're doing things, and I'm going to have radiation therapy with Femara first, for six weeks, then start chemo mid-August. (Susie, it's to be 4 rounds of AC, three weeks apart, like yours. Onc says the three-week schedule is easier as far as SE go, and since I have no active tumors, there's no need to rush it). Thank you, all, for the very helpful advice and sharing of experiences -- I couldn't have made it this far, with my sanity intact, without you!!! Wishing everyone the most positive of experiences! ",
      "MessageIndex": 311,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "Jun 28, 2017 03:27PM Ciaci wrote: Thanks for the kind thoughts, ladies (any gentlemen here?) - but I just came back from the consultation with the Radiology Oncologist, and am facing another detour -- right back to chemo! He did a complete workup, but decided that since I have no active tumors, he would prefer to treat more aggressively - which means AC chemo first, then a followup with radiation and hormone therapy. He said that would give me a much greater chance of success. If the spot on my back was an actual tumor, or if there was evidence of tumor activity in the breast (nothing shows there since the lumpectomy), he would radiate first, but since there isn't, we're heading to chemo after all. I have an appointment Friday to get set up - info session and scheduling - then chemo will start next week. I am READY!",
      "MessageIndex": 353,
      "PostDate": "28/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "Jun 30, 2017 07:37AM Ciaci wrote: Susie, my onc. told me no going in the water ANYWHERE - including my own pool, that I keep well sanitized. He said you can't control nature - bird droppings in the pool, bugs, worms, etc. No way to control bacteria = no good! Hope you can enjoy the beach, at least!",
      "MessageIndex": 371,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "May 18, 2017 09:05AM Ciaci wrote: I have a purely practical question - I don't have a start date yet (still waiting for a scan or two), but I was wondering what you're supposed to wear to chemo... I have a port, and was wondering if I need something that opens in front, or has a loose neckline? I'm going to the oncology center on Monday, and can ask then, but I wondered what any of you might have preferred. I'm finding that if I focus on mundane stuff like this, I won't worry about all the meds I'll be needing!",
      "MessageIndex": 245,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "May 23, 2017 07:58PM Ciaci wrote: Msrobin, hope your day went well!! I meet with my oncologist tomorrow to discuss all the details - when I'll start, what I'll get, and for how long. I'm hoping he won't want to start before next week; I have so much to do this weekend!! My port that was placed last week itches like crazy, but isn't tender or sore, so DH says it's just \"healing\" (he's a pharmacist, but I don't know that that makes him an expert, LOL, even though he thinks it does). Actually, it's probably the super glue my surgeon used - where it's already peeled off, the skin is fine. I'll show the oncologist tomorrow, so not really worried about it. I can't imagine them using it yet, though - some of you had the port accessed right away? Mine is still covered with glue! Maybe they'll peel it off... I plan to wear scarves when the time comes, and my daughter (the 22-year-old recent college grad) has been bookmarking YouTube videos. She knows I don't expect to be traumatized, because I've always hated my hair... think Pippi Longstocking's, only dirty brown colored, in a pixie cut - all ends poking out all over! Love and luck to everyone, whatever phase you're in!",
      "MessageIndex": 330,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "May 26, 2017 11:21PM Ciaci wrote: Hello, everybody! I'm at the \"waiting\" stage, but expect to start my chemo on or about Tuesday, June 6th. I have to have a PET-CT (originally denied by my insurance company; they made me have 2 CATs and a bone scan, which of course show \"something\", so now they'll authorize the PET-CT, aargh!) before my oncologist will commit to starting. He doesn't expect anything to change (the \"something\" looks like a swollen lymph node and a couple of spots on my lung), and has so far planned for 4 rounds of AC, 3 weeks apart. After that, radiation, then \"hormone treatment\"; I'll get more info on that later. I did find out my cancer is estrogen and progesterone positive, but HER negative. Thanks to my well-meaning gynecologist who did my hysterectomy in 2001 - she left me with one ovary, so I wouldn't go into menopause at age 39 - the estrogen is now an issue. Anyway - I wish I wasn't taking this journey, but I'm so thankful to be taking it here, with such a supportive group of women!",
      "MessageIndex": 14,
      "PostDate": "26/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "Jun 10, 2017 07:53AM Ciaci wrote: KimPossible, I weigh over 200 pounds, and you can clearly see the entire port and tubing on me! My veins are just under the skin, apparently, and that's why. I'm really conscious of it, especially the ending, in my neck, because it sticks out so much. I don't know if it's supposed to go that high, but even when I wear a collared shirt, you can see it. I didn't have any bruising from the placement, but it's really uncomfortable sometimes - when I wear a seatbelt, for instance. Due to delays from test results (they keep finding stuff that has to be \"clarified\"), I haven't even started chemo yet, and I've had the port for a month already. Barring any unforeseen results, my onc says he's planning four rounds of AC, three weeks apart, so I can get this stupid thing removed approx 9 weeks after I start... I know people who've kept their ports, \"just in case\", but I'd rather go through the insertion again than keep it!",
      "MessageIndex": 129,
      "PostDate": "10/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "May 15, 2017 08:40AM Ciaci wrote: Hello, all... I had a lumpectomy with 3 nodes removed, three weeks ago. Today I go to get my port, and I'm REALLY freaking out about it. I breezed through the lumpectomy, probably because I was unconscious! I was totally calm that day, not even nervous walking into the OR, but today I'm shaking. I don't know why this is so much more frightening. I think the lumpectomy was a good thing - getting rid of the tumor - while the port is just the beginning of a very long road. Sorry, just needed to get that out. I'm trying not to let my husband and kids (22 and 24) see how scared I am...",
      "MessageIndex": 202,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "May 16, 2017 10:30AM Ciaci wrote: Sorry I didn't check back in sooner - we have a lot going on around here, LOL. My baby just graduated from college on Sunday, and we've been trying to find a way to fit the entire contents of her apartment in our home! I think we worked it out - you only have to climb over a Christmas tree, two chairs, and an end table to get to the dining room... Anyway - I spent hours agonizing over the port placement, and kept getting teary at the hospital, to the point where I went to the bathroom to compose myself and couldn't come out because I couldn't stop crying. Finally I just walked out, tears flowing, and the nurse asked what on earth was wrong. My husband was shocked, because I hadn't let on that I was freaking out. My surgeon walked up as I was explaining that I was so scared about being awake during the procedure, and he said \"No problem, we'll just increase the sedation. Why didn't you just tell me?\" So I had to promise him, my husband, and the nurses that I would never ever keep something like that a secret again. As my surgeon said, there will be plenty of things on this journey that I won't be able to control, why on earth would I be quiet about something I absolutely CAN control? Lesson learned! Bottom line: the port placement was a breeze. I didn't have general anesthesia, just a sedative. I \"dozed off\" as they were prepping me, the whole thing took less than half an hour, and I woke up when they were wheeling me back to recovery. I got out of the bed ten minutes later, after having had a snack, and went home. No pain, didn't even need an Advil! This morning, I feel a slight pull in my neck when I turn it, but I think that's more from the \"krazy glue\" they used to close the incision than the incision itself! The larger incision, on my chest, where the actual port is, is fine - just a hairline cut, no pain or soreness. More \"glue\", so no stitches. Thanks so much for the support, everyone, and I wish everyone well wherever they are on this journey!!",
      "MessageIndex": 219,
      "PostDate": "16/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "Jun 3, 2017 07:08PM Ciaci wrote: Hi, everyone - checking in again. I was supposed to start AC on Tuesday, June 6, but that's been put off while I have a CAT-guided biopsy of my spine. Apparently there's \"something\" there, as detected on the bone scan, and on the PET-CT scan, they just can't tell what it is. Don't know if it's cancer, don't know if it's the metastasized BC, don't know if it's a new one... I hate not knowing, I hate that the internet is full of so many scary things, I hate that I no longer have control over ANYTHING. My daughter graduated from college, and we planned her party for June 24, which was supposed to be Day 18 of my first round. Everyone said I would be feeling strong and \"good as new\" by then... and of course I have lots of offers of help. But if my start is delayed, I'll be much earlier in my cycle then, and dread the thought of postponing the party, or spending the day in isolation while the party goes on around me. I'm trying to keep everything as normal as possible for my family, but it's HARD. I so appreciate reading about everyone's journeys - we're all so different, but so very similar at the same time. Love and healing thoughts to all.",
      "MessageIndex": 36,
      "PostDate": "03/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "Jun 12, 2017 11:58AM Ciaci wrote: I've had my port for a month, so it's all healed, but still bugs the heck out of me at odd times. I'm still sleeping in a recliner; laying on my right side presses it into my neck, and laying on my left side seems to pull at it. I can't sleep on my back, because I move side to side a lot. Can't sleep on my stomach, because of the port and lumpectomy incision. Whenever I tense for any reason, it bulges out of my neck - I think it's laying over a tendon. Most annoying of all is that I STILL don't have a start date for my chemo (\"something\" on one of my vertebrae may or may not be cancer; too small to tell without a biopsy, and too hard to access for said biopsy - they're still trying to decide what to do), so it all seems so pointless, so far. Once I start to DO something, I hope I'll at least feel pro-active; this waiting around, doing nothing, is for the birds.",
      "MessageIndex": 147,
      "PostDate": "12/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "Jun 16, 2017 09:59AM Ciaci wrote: sana18, my prospective regimen sounds pretty similar to yours, and I'm scheduled to start my AC the week of June 26th (barring no crazy surprises from the biopsy on my back next Tuesday). Thanks for checking in to show us what to expect! Hope everyone's journey is easier than they expect...",
      "MessageIndex": 191,
      "PostDate": "16/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "May 15, 2017 10:24AM Ciaci wrote: lovepugs, I just noticed you start chemo this week - Good luck!!",
      "MessageIndex": 206,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "May 24, 2017 05:35PM Ciaci wrote: Saw my oncologist today, all ready to make a date to start chemo... no go. CAT scans show \"swollen lymph node\" and 2 spots in lungs, one is 2mm and one is 1 mm. So now I have to go for the PET-CT that the insurance company wouldn't authorize in the first place! Onc. says swelling may be residual from the lumpectomy on 4/24, and spots are probably nothing... if nothing turns up, we'll go ahead with his plan, which is 4 rounds of AC, 21 days apart, followed by radiation and then oral meds to suppress hormones. I'm keeping my fingers crossed, because I really feel like I'm getting off easy this way! No Neulasta, no Herceptin, nothing but the Adriamycin and Cytoxan four times. If my stupid insurance company okays the PET-CT (and they should, because they said they would if the CAT showed anything), and I can get it done by Tuesday, the doc will see me on Thursday, and I will start chemo the week of June 5th, which will be perfect because I'm still hoping to have my daughter's college graduation party, which is scheduled for June 24th, and I should be feeling normal by then. Fingers and toes all crossed that that will happen!!!!!",
      "MessageIndex": 347,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "Ciaci",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251601/profile",
      "Content": "May 15, 2017 10:23AM Ciaci wrote: Thanks so much - it's nice to hear from someone recently through this! Leaving for the hospital now... I'm feeling a bit calmer.",
      "MessageIndex": 205,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    }
  ]
}