{
  "AuthorID": "Cici566",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192990/profile",
  "Posts": [{
    "AuthorID": "Cici566",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192990/profile",
    "Content": "Jan 8, 2014 10:19AM Cici566 wrote: Hi Bennymuffins,  This is a terrible place to be right now.  I found my lump on Dec 3 and I am going into surgery next tuesday the 14th.  My mind has gone to all the dark places and then I come back and I know that I can be cancer free.  I have read through all of these stories of these amazing strong women and I know that I and you can do it too.  This is such a hard time because information is slow coming.  Every time I turned around this past month more tests were being ordered.  As scary as that is, I just kept thinking that they were being thorough to better understand what was going on and how to best treat me.  So far what I know, is I have a lump that is 2 cm.  It IDC,  There is a lot of cancer cellls around the tumor that are loose that are making the whole area 8 cm.  When I heard that I really started freaking out but the tumor is not that size.  I have a lymph node that has cancer in it.  I am her2+ which means it is an aggressive cancer.  I have had a bone scan, ct scan for abdomen, and ct scan for chest.  Everything came back clear.  That is great news.  I am having a masectomy and I have decided to have the other breast removed as well.  I will follow up with chemo and then radiation and reconstruction.  I am visualizing the cancer completely leaving my body when I go in for surgery. I have had a couple of horrible days because we finally told my children (12 and 9) what was going on. but today I am making myself think positive until I get to surgery.  I am taking control of what I can until then.  Personally, I have stayed away from the internet except for the discussion board.  Do you have a friend that could look up things for you?  I have done that.  I think it is a little less scary and overwhelming.   This is the hardest place to be right now.  Stay strong and stay in the moment.  I find it helps to find humor. I wish you well.",
    "MessageIndex": 6125,
    "PostDate": "08/01/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
    "Title": "In shock bennymuffins websister"
  }]
}