{
  "AuthorID": "Cindy_B",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91333/profile",
  "Posts": [
    {
      "AuthorID": "Cindy_B",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91333/profile",
      "Content": "Nov 5, 2011 01:03AM Cindy_B wrote: Thanks, Staceylee. I'll keep you in my thoughts on Thursday, too. I'm hoping for the best for both of us. Thanks for posting.",
      "MessageIndex": 2,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777579",
      "Title": "DX Mammo Scheduled, Trying to Stay Calm Cindy_B Cindy_B"
    },
    {
      "AuthorID": "Cindy_B",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91333/profile",
      "Content": "Cindy_B wrote: Hey, everyone! I first registered on this board a few years back when my mom had an abnormal mammogram and I was trying to educate myself to help her out. Well, now it's my turn, it appears. I found a red spot on my left breast last night, and my doctor took a look at it today. She said it needs to be checked out, so she has scheduled me for a diagnostic mammogram on Thursday. After she gets the results, she says she will likely refer me to the breast cancer surgeon at our local hospital for a probable biopsy. The diagnosis she put on the mammogram order was \"neoplasm of undertermined nature of breast.\" I take that to mean \"something's growing there that doesn't belong.\" All of this had me relatively freaked out by the end of the day. Thankfully, I have a close friend who works at this same hospital. She had some of us over for \"knit night\" tonight, and she wanted to take a look at this red spot. She told me she had a growth on her breast before that looked a lot like this, and it ended up being an epidermal inclusion cyst. So, I am feeling a bit calmer tonight and am feeling a lot more hopeful. I remember how supportive and helpful everyone was here when my mom was going through her tests and biopsy, so I wanted to post tonight and share my story. Hopefully soon I'll be able to return with good news to report. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777579",
      "Title": "DX Mammo Scheduled, Trying to Stay Calm Cindy_B Cindy_B"
    },
    {
      "AuthorID": "Cindy_B",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91333/profile",
      "Content": "Nov 5, 2011 03:12PM Cindy_B wrote: Thanks, Amy. I appreciate the support. I'm sorry you're going through such a stressful experience. I hope all goes well for you.",
      "MessageIndex": 4,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/777579",
      "Title": "DX Mammo Scheduled, Trying to Stay Calm Cindy_B Cindy_B"
    }
  ]
}