{
  "AuthorID": "Cindy1960",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71328/profile",
  "Posts": [
    {
      "AuthorID": "Cindy1960",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71328/profile",
      "Content": "Sep 1, 2008 04:17PM Cindy1960 wrote: Hi ladies, I'm in the same boat.  My onco's office finally ordered the oncotype dx test on Friday, after a bit of hounding on my part for 5 days.  And, I'm waiting for a second opinion from a major cancer center about an hour from me.  It's tough waiting for these results, isn't it?  I'm asking myself exactly what oncotype number will make me decide to do chemo.  Have any of you set a number in your head yet for this decision?  Good luck to all. Cindy",
      "MessageIndex": 6,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/720439",
      "Title": "Borderline for Chemo BlueMama Cindy1960"
    },
    {
      "AuthorID": "Cindy1960",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71328/profile",
      "Content": "Sep 14, 2008 04:23AM - edited Sep 15, 2008 12:57PM by Cindy1960 Otter, thanks for this info.  My IDC is left side, and I have a very strong family history of heart disease at a young age.  Naturally, I've been concerned about left side radiation from the get go.  I considered mast to avoid radiation, but during a pre-surgery consult with a rad onc, he told me I didn't have to worry, because it was his job to protect my heart.  Now, I'm not usually so easily lulled into feeling secure, but I think I just so wanted to believe that everything would be ok, and that he would keep me safe, that I didn't ask any more questions or bring up any of the articles I had read about left side rad danger.  At this point, I'm still waiting for oncotype results to find out if I need chemo or not.  Once I know about that, I need to start seriously thinking about rads, and have started doing more research.  My med onc at Fox Chase told me last week that although rads is not her field, all current research is based on old cases, and I shouldn't worry. HUH!!!!!  I feel like no one is taking my concerns seriously about this. I put a call into the rad onc I spoke with in July...left a message telling him I had more questions.  Of course, he has not returned my call. So, I'm looking for a new rad onc.  It would be so much easier to just smile and blindly follow whatever the docs say, but like you and most women on these boards, I just wasn't cut from that cloth. Quick question - with all the research you do (I've read many of your posts on here), do you bookmark your websites on any social bookmarking sites, like del.icio.us?  It would be a great way to share links. Right now, I have my cancer links marked private, so my students don't see them.  I'm going to establish a separate del.icio.us account, just for cancer-related things. Cindy",
      "MessageIndex": 1,
      "PostDate": "14/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/720735",
      "Title": "Radiation treatment in a prone (face-down) position... otter whatsnext17"
    }
  ]
}