{
  "AuthorID": "Cindielm",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212473/profile",
  "Posts": [{
    "AuthorID": "Cindielm",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212473/profile",
    "Content": "Jun 9, 2015 09:33AM Cindielm wrote: Hi CassieCat!! I only had a lumpectomy, not a MX, but my left breast is still sore and my surgery was a year ago-June 30th. I have spoken to my BS in my last visits and he said that \"you had a lot of surgery,\" two surgeries and three pieces of tissue removed. He said the nerves are \"firing\" and trying to reconnect. Also, the radiation added to the continue soreness. Sometimes I even have \"shooting pains\" and the only thing I can do is put my hand where the pain it and push!!! It looks kind of weird doing it in Walmart, but yep had to do it a couple of times!!! I had my first mammo back in April and believe it or not it wasn't that bad---had minor discomfort. I was expecting it to be rather painful. Anyway, the mammo came back clear!!!! My doctor has given me direct instructions that if I am concerned about ANYTHING to give him a call and he'll bring me in----if anything just to relieve my anxiety!! Great doctor!!!! If you are concerned at all please call your doctor just to relieve any stress that you may be having with it. It's so scary and any pain from anywhere often brings the big \"C\" word and the reality of it is ever so close in mind. This cancer thing is such a major part of my thinking process, I wonder if I'll ever \"let it go.\" Many times I have to reroute my thinking to something else as any stress will cause a hotflash to come on---another wonderful side effect of Arimidex!!! Please keep in touch and let us know!! These ladies here are wonderful and so helpful!!! Dx DCIS, Stage 0, Grade 2, ER+/PR Surgery 06/02/2014 Lump Surgery 06/30/2014 Lump Radiation Therapy 08/13/14 External Meds Arimidex 10/14 - 5 yrs ",
    "MessageIndex": 1,
    "PostDate": "09/06/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/832460",
    "Title": "Normal discomfort after MX and rads? CassieCat CassieCat"
  }]
}