{
  "AuthorID": "Cinnabear50…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80837/profile",
  "Posts": [
    {
      "AuthorID": "Cinnabear50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80837/profile",
      "Content": "Jun 29, 2009 04:49AM Cinnabear50 wrote: Hi Mari, I also had IDC with DCIS and underwent unilateral mastectomy (left).  I knew from the beginning that reconstructive surgery was not for me.  I have never doubted that decision or had any regrets.  Like you, I did not want any more surgeries or the possiblity of an end result that I would not like.  My surgeon did a fabulous job of giving me a straight incision with a nice flat result. I've even had others, like my onc and my PT, remark what a great looking incision that I have!!  There are a lot of options out there as far as prosthetics and others forms you can use.  You've probably seen them discussed on the other topics.  Please try not to be anxious about this decision.  It's just like any other part of this journey that requires a decision--once you make it, move on and don't look back.  If it feels right for you then it is right regardless of what others may do or say.  You are going to be okay.  I will keep you in my prayers.  Hugs, Cinnabear",
      "MessageIndex": 3,
      "PostDate": "29/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/736665",
      "Title": "Unilateral Mx tomorrow, help! Mamamari LorenaB"
    },
    {
      "AuthorID": "Cinnabear50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80837/profile",
      "Content": "Nov 27, 2009 01:04PM Cinnabear50 wrote: Amen to all of the above.  Binney, Kira and everyone else were so helpful to me earlier in the year when I developed lymphodema.  I now have been able to pass on my limited knowledge to other women with breast cancer who have come into my life through various ways.  Thank you all and bless everyone who is dealing with this diagnosis on top of a cancer diagnosis.   ",
      "MessageIndex": 6,
      "PostDate": "27/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/744501",
      "Title": "Thankful for Binney, and this thread kira Binney4"
    },
    {
      "AuthorID": "Cinnabear50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80837/profile",
      "Content": "Mar 19, 2009 10:10PM Cinnabear50 wrote: No, not painful but uncomfortable.  He used a local anesthetic to numb the area although that area is already somewhat numb due to the mastectomy.  I used some Advil that evening and the next day but after that, it was fine.",
      "MessageIndex": 5,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/730755",
      "Title": "Cosmetic Surgery-Without Implants-Ins? LauraGTO LauraGTO"
    },
    {
      "AuthorID": "Cinnabear50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80837/profile",
      "Content": "Mar 16, 2009 04:03AM Cinnabear50 wrote: Hi Laura, I had a mastectomy on my left-side in 1/08 and opted not to have reconstruction surgery.  I had fat \"glob\" at the end of my incision very close to my armpit and it was actually uncomfortable when my arm was down at my side.  My surgeon referred me to a plastic surgeon who did a mini-liposuction procedure in his office.  Insurance did pay for it as it was considered scar revision.  It was the weirdest thing to undergo but it worked!  It wouldn't hurt to at least go for a consult with a plastic surgeon to get their opinion.",
      "MessageIndex": 1,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/730755",
      "Title": "Cosmetic Surgery-Without Implants-Ins? LauraGTO LauraGTO"
    },
    {
      "AuthorID": "Cinnabear50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80837/profile",
      "Content": "Mar 22, 2009 11:23PM Cinnabear50 wrote:",
      "MessageIndex": 7,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/730755",
      "Title": "Cosmetic Surgery-Without Implants-Ins? LauraGTO LauraGTO"
    },
    {
      "AuthorID": "Cinnabear50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80837/profile",
      "Content": "Cinnabear50 wrote: Hi Ladies, I scanned through past topics trying to find an answer to my question but did not see this one discussed.  I now have my sleeve and glove and my therapist said I did not need to bandage at night unless I found that I was \"back filling\" at night, which I'm not.  After almost 2 months of bandaging at night and during the day, my index finger has never resumed it's normal size.  My thumb and hand have returned to normal size but as soon as I take off the bandages, what little progress the index finger has made seems to disappear and I have what I call a  \"sausage finger\".  I understand that the compression sleeve and glove does not reduce swelling but rather prevents its' progression.  What if I just wrapped the hand and fingers at night?  Or do I have to do the whole arm?  If the wrapping isn't really bringing the index finger down, maybe the wrapping is just a waste of time and effort.  I have tried to do everything right--using the Lebed DVD, reading books, doing my manual drainage 2xday but this finger just will not cooperate.  I appreciate anyone's similar experience, thoughts or advice.  This weekend's heat and humidity in the NE is not helping matters!   Cinnabear  Dx 1/2/2008, IDC, 2cm, Stage II, Grade 3, 0/12 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/733131",
      "Title": "Is it okay to just wrap my hand and fingers? Cinnabear50 Cinnabear50"
    },
    {
      "AuthorID": "Cinnabear50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80837/profile",
      "Content": "Apr 27, 2009 07:56AM Cinnabear50 wrote: Kira, Thank you for your response.  I am going to talk to my therapist about using some foam for the index finger to see if we can get it down by wrapping again at night.  Hang in there--2 more days of heat and then we should be back to cooler (more comfortable temps). Cinnabear",
      "MessageIndex": 2,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/733131",
      "Title": "Is it okay to just wrap my hand and fingers? Cinnabear50 Cinnabear50"
    },
    {
      "AuthorID": "Cinnabear50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80837/profile",
      "Content": "May 23, 2009 08:34AM - edited May 23, 2009 08:35AM by Cinnabear50 As you can see, I don't post often but I do visit this site often.  I had to add my comments as I too am happy with my decision to not have reconstruction.  I have always been small chested and the thought of having more surgery, discomfort, and something else \"alien\" in my body was just too much for me.  If I wear something very form fitting, I use the prosthesis and this is not very often.  With all the flowy tops, very 70-ish, that are now in style, I have found it easy to shop and look up to date.  It is liberating in a way.  I am also grateful to the breastfree website as I visited it numerous times when making my decision.  As mentioned above, this is such a personal decision and we each have to do what is right for us. ",
      "MessageIndex": 6,
      "PostDate": "23/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/734616",
      "Title": "thank you for giving me a choice seltzer wallycat"
    },
    {
      "AuthorID": "Cinnabear50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80837/profile",
      "Content": "Apr 23, 2009 08:10AM Cinnabear50 wrote: Just wanted to add my prayers and thoughts.  I am hoping that you can feel the love and support coming your way from those of us on this site.  It is such a scary thing to face and I agree with what has already been said--try to look at each step individually as the whole picture is overwhelming.  It is doable when you try and handle it in that manner.  It is normal to have our thoughts go to dark places but try not to dwell there too long.  Look for the simple joys in each day and that should get you through.  Please keep us posted as to your progress and let us know when you need some words of support.  I don't know how I would have gotten through my surgery and treatment without this site where everyone's experiences really helped me. (((hugs))) Cinnabear ",
      "MessageIndex": 5,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732968",
      "Title": "Going for surgery april 30th...terrified aaronali12 aaronali12"
    },
    {
      "AuthorID": "Cinnabear50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80837/profile",
      "Content": "Jun 29, 2009 06:56AM - edited Jun 29, 2009 07:48AM by Cinnabear50",
      "MessageIndex": 1,
      "PostDate": "29/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/736664",
      "Title": "Help, IDC, Surgery Tomorrow Mamamari spar2"
    }
  ]
}