{
  "AuthorID": "Cinnamonsbf…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227784/profile",
  "Posts": [
    {
      "AuthorID": "Cinnamonsbf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227784/profile",
      "Content": "Aug 30, 2016 01:25PM Cinnamonsbff wrote: whatever you're most comfortable with. If it puts your mind at ease to have the hyst, I say go for it. That's why I'm doing the ooferectomy now, instead of later. I'm 38, and don't think I can spend the next few years worrying about it. I'm so very sorry that your doctor was so awful! I can't even imagine! Have you tried an anti anxiety medication? I'm on one since diagnosis day. It helps. Wishing you the best! cbff",
      "MessageIndex": 6,
      "PostDate": "30/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    },
    {
      "AuthorID": "Cinnamonsbf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227784/profile",
      "Content": "Aug 29, 2016 10:47PM Cinnamonsbff wrote: silverpullet, I am BRCA2 as well and also had breast cancer, diagnosed 9/29 of last year. I am wondering why you would do the hysterectomy. All of my doctors and surgeons have said that though I am at a higher risk for ovarian cancer, and that my BC was 90% er+, I should definitely do the ooferectomy, but that BRCA 2 doesn't pose a uterine cancer risk, and that surgery isn't necessary. I had a tumor board meet on my case, and they recommend the oof, but not the hyst. Just curious if you have some information that I haven't heard yet. I'm scheduled for my oof on 10/19, and I asked them all if I would benefit from a hysterectomy, but was told by all that it had no benefit. I'm still up in the air about doing the oof so soon, and am actually toying with the idea of doing a medical ovarian suppression for now, and the prophylactic BMX that I opted out of last fall. Thanks, and best of luck to you! cbff",
      "MessageIndex": 4,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    }
  ]
}