{
  "AuthorID": "cinvee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
  "Posts": [
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Dec 23, 2012 06:47PM cinvee wrote: NYCMs, my friends call it \"hangry\" when I am hungry it makes me angry ;).  I agree, I need more info.  My MRI isn't until January.  I am feeling pretty good after the lumpectomiies though.  Gosh I hope this is the end of the ride for me! Cinvee",
      "MessageIndex": 19,
      "PostDate": "23/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/796015",
      "Title": "Diagnosed with Atypical Lobular Hyperplasia NYCMs MelissaDallas"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Dec 20, 2012 10:53AM cinvee wrote: I posted this on another spot, but now think it is better suited here.  I hope thats ok. I had bilateral lumpectomies with wire localization for ALH yesterday and am very sore, but it's manageable.  Because of the holidays my BS said it could be next Wednesday before we receive the results :( Here is my story so far.  I went for a mamogram on Oct 17th, my first as I am 41 with no family history at all, and received a call back the next day.  Went in for a second look and they ordered ultrasound as it seems I have extremely dense fibrocystic breasts.  Went for ultrasounds, bilateral, and they took over 300 images and said it was a new office record!  (not sure I am proud of that)  They then ordered biopsies for the following week. The biopsies.  wow, not fun for me.  I ended up having a stereotactic biopsy, 3 ultrasound guided core needle biopsies and an aspiration in one visit.  It took over 5 hours and was a very long stressful day.  The radiologist and ultrasound tech were fantastic and so supportive that day.  It really was the only thing that helped me get through so much in one day especially being \"new\" to the whole BC scare thing.  I was mildly sore and extremely bruised for over two weeks.  The results came back with: a)  ***STAT ***  (Left)  Flat Epithelial Atypia and Focal Atypical Lobular Hyperplasia in a background of Fibrocystic changes and Columnar Cell Change.   Numerous foci of microcalcification present b)  Fibroadnoma  (Left)  (this is the good one!) c)  Mild Stromal Fibrosis and Focal Duct Ectasia (right) d)  Focal Atypical Lobular Hyperplasia in a background of fibrosystic change (right) Yesterday I had the lumpectomies on A and D.  My BS was able to get clear margins and I am feeling pretty good this morning.  I have been told I will take Tamoxifen and I am not sure how I feel about that.  I have also been told I will have an MRI in January, and will be on the 6 month alternating MRI/Mam ride.  My quesitons are what do you think?  What has your expierence been with Tamoxifen?  Anyone have a similar experince and find out they have LCIS?  All I can think is going through this every 6 months?  Heck no.  My PCP said he does NOT want me going through this 2 times a year.  If this all comes back fine next week, and they even hint at more biopsies etc next year I will absolutely look at more aggresive options.  I am a single mom with a great, but demanding job.  I am dreading going through the holidays without answers!!!!! Thanks for your time :)",
      "MessageIndex": 15,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/796015",
      "Title": "Diagnosed with Atypical Lobular Hyperplasia NYCMs MelissaDallas"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Dec 24, 2012 05:17AM cinvee wrote: Anne, that is very reassuring.  Thank you so much.  I honestly cant imagine my body tolerating repeated biopsies and lumpectomies.  Melissa, I appreciate both of you talking me off the cliff!  What a roller coaster this is.  I want off. Cinvee",
      "MessageIndex": 22,
      "PostDate": "24/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/796015",
      "Title": "Diagnosed with Atypical Lobular Hyperplasia NYCMs MelissaDallas"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Dec 20, 2012 04:43AM - edited Dec 20, 2012 06:52AM by cinvee Just wanted to say I had 2 wire localizations and lumpectomies yesterday.  The wires were no worse than the numbing for the stereo.  You will do fine :) Best of luck to you!",
      "MessageIndex": 9,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/796015",
      "Title": "Diagnosed with Atypical Lobular Hyperplasia NYCMs MelissaDallas"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Nov 4, 2014 06:06PM cinvee wrote: So I called again today, and have some news.   She said that they are trying to book Dec 19th.   Both surgeons are available, but they are trying to get an OR that day.   They have requests out, but she said 50/50 that they get an OR which I find surprising since I am at The University of Michigan Cancer Center.   We shall see I guess. I am frustrated,   I realize I can wait, and feel lucky to be in that position, but now that I am ready,,,, I am ready!    We were originally looking for a date in October.   Now December.   I have once again hit my max out of pocket this year of $6k,  3 years in a row now, so I obviously will not have it all done this year.   Looks like another $6k next year too.    At least I feel like there may finally be an end in sight.  I hope.  Thank you so much for your replies.",
      "MessageIndex": 8,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826015",
      "Title": "How long did it take to schedule your surgery? cinvee Unbreakable01"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Nov 18, 2014 07:20AM cinvee wrote: Thank you all again for your replies. I have still not received confirmation that surgery will be the 19th of December, but they explained that the rooms aren't \"given up\" by surgeons that have them reserved over a month out. If it's over a month, they all think they can still book something in \"their\" OR. Once it's under a month out, they are no longer allowed to hold the OR so hopefully I will hear something by next week. As far as scheduling so near the holidays, the only reason I have agreed is because my family and friends are all off during the holidays so I can have a lot of help if needed. My husband only has 5 days PTO left, but because of the timing of holidays, it stretches to over 2 weeks where he can be with me. I am sorry if I offended anyone with asking this. I should have been more clear in my original post that it is a preventative BMX. I fully expect to be a lower priority and will gladly wait so women with cancer can have their surgery, and will also keep all women fighting cancer in my prayers. I have friends that are survivors and they all agreed that had they had the opportunity for a preventative action, they would have jumped at it. It took me a year to make the decision, after another full year of biopsies and surgeries, so now that the difficult decision is made, I am ready. Prayers and strength you you women in your fight. I am truly grateful for the support and knowledge on this board. C",
      "MessageIndex": 15,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826015",
      "Title": "How long did it take to schedule your surgery? cinvee Unbreakable01"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "cinvee wrote: Just curious.   How long did you wait to hear for a surgery date after meeting with the Surgeons?     Also,  how far away was the surgery scheduled?    I am approved for a PMBX with immediate reconstruction and have met with my Surgeon and Plastics reconstruction team.   They have both given the all clear to schedule, and I met very briefly with the scheduler for the Plastic surgeon after my last appointment on Oct 23rd.   She said I may not get a surgery date until mid December, which I understand.   However,  I thought I would have heard from her by now.   It's been 10 days.   After 2 years of stress and tests, now that I have decided to move forward I am really wanting to get it over with.     Am I being unreasonable?  Impatient?   I have called 2 times for updates (apologizing each time for being impatient!)  How long did it take for you to hear your surgery date?  And how far away was it? Thank you. ALH/ADH bilateral, FEA left. In the last year: 4 core biopsies, 1 stereotactic biopsy, 2 lumpectomies, hysterectomy and right side oophorectomy. Tried tamoxifen, didn't go well.   Waiting for surgery date for PBMX. ALH/ADH bilateral, FEA left. In the last year: 4 core biopsies, 1 stereotactic biopsy, 2 lumpectomies, hysterectomy and right side oophorectomy. Tried tamoxifen, not a fit for me. PBMX scheduled for 1/14/15 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826015",
      "Title": "How long did it take to schedule your surgery? cinvee Unbreakable01"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Nov 4, 2014 02:14PM cinvee wrote: I am sorry,  I should clarify that I am having a prophylactic BMX, and do NOT have active cancer.   I am also adding my signature above for history.",
      "MessageIndex": 4,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826015",
      "Title": "How long did it take to schedule your surgery? cinvee Unbreakable01"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "cinvee wrote: I have what are considered Extremely Dense breasts.   I realize that dense breast are pretty normal, and I am 42 so I guess that is an age where it is very common.  Part of my concern is what are the chance that something serious can be missed in a mamo?  This was on my last mam report: 1.  Extremely dense, opaque, diffusly nodular fibrogladular tissue continues to significantly limit mammographic sensitivity in this patient. 2.  Multiple nodular densitites embedded within the breast tissue mammoigraphically are accounted for by multiple findings on ultrasound, at least 40 in number on the right, and more than 25 in number on the left.   I am worried that something will sneak by my screening.    Thoughts? thank you. edited to add my sig:  ALH/ADH bilateral, FEA left. In the last year: 4 core biopsies, 1 stereotactic biopsy, 2 lumpectomies, hysterectomy and right side oophorectomy. Tried tamoxifen, didn't go well. Close watch and prayers at this point ALH/ADH bilateral, FEA left. In the last year: 4 core biopsies, 1 stereotactic biopsy, 2 lumpectomies, hysterectomy and right side oophorectomy. Tried tamoxifen, not a fit for me. PBMX scheduled for 1/14/15 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/816019",
      "Title": "Extremely Dense breasts cinvee marie5890"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Jan 18, 2014 04:11PM cinvee wrote: hmmm, thanks for the responses.   I do find it interesting now that I am a little more informed about the 3 screenings, and what they are detecting, I feel very fortunate that they are following me so closely.     When I have my mamm's, they always take at least 4-5 views, each position.   Ultrasounds seem to be a 2+ hour ordeal taking hundreds of images.  The report is always at least 8 pages long.  The schedulers now jokingly make my appointment for 4 hours because that is how long I am usually there.     However, my MRI report simply said \"it was negative\".   huh?  Seemed weird, and dismissive.  What is \"it?\"  The MRI was bilateral.  (everything I get is bilateral.)  Everything I read and hear is that the MRI will light up like a Christmas tree and can suggest biopsies that are not necessarily needed.   Now that I have a better understanding,  I am guessing that my risk and screenings are looking for the problems generally seen on mamm's and ultrasounds, not the ones on MRI's?   Where I am confused still is that I am told that mamm's are almost useless on me.   And ultrasounds show too much, so MRI's are the best option.  I seem to be backwards.    I am so confused.   My PCP has made an appointment for me with U of Michigan breast center in a few weeks to have them give me a second opinion as we both agree that something doesn's seem right.   Do you think I am crazy?  I am feeling crazy lately.  I swear I am not trying to make something out of nothing, I just have a nagging feeling that there is more and I just can't seem to shake it.     ",
      "MessageIndex": 8,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/816019",
      "Title": "Extremely Dense breasts cinvee marie5890"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Mar 13, 2014 02:57PM cinvee wrote: jenpadden and the others,   I did give Tamoxifen a try, twice.  I do not understand why women won't at least give it a try?  The potential is wonderful.  The first round was 4 mounths and the second was 2.5 months, just .5 pill at night.  No luck.  I wish with all of my heart that I could have been one of those with no side effects.   Unfortunately,  I had severe headaches all day, every day and extreme fatigue.   I literlly could not function and I am a single mom who works long hours.   Ballet,  I know. :(    I have really problematic breasts.   What scares me the most is that I also have Extremely Dense Breast (>95% I was told) so if they have seen all of that,  I am terrified what they HAVEN'T seen.   What else is lurking?    I am lucky that I go every 6 months for mam/ultrasound then mri.  We have been very proactive, but the worry is there every day.   I went for a consultation at U of Michigan breast center and they took me into the Breast Cancer Center as a patient even though I am just high risk.   I think she thought its just a matter of time.   My next appt is April 9th for MRI, mam and ultrasound.  They want all 3 this time.  ugh. ",
      "MessageIndex": 339,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Jan 21, 2014 10:07PM cinvee wrote: lucky, I just posted to you in another thread.   I have both ALH and ADH in both breasts.   I also have FEA in my left.   It is frustrating to say the least.   My biggest question to all my doctors has been how much higher is my risk with both ADH and ALH in BOTH BREASTS?   No one has the answers. I wish you peace in your journey.",
      "MessageIndex": 291,
      "PostDate": "21/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Mar 12, 2014 06:38PM cinvee wrote: Hi ladies, I have a question about my path report.  I am looking at it all for my next appointment at University Breast Center.  I can't seem to find a lot of info about Multifocal Atypical Ductal Hyperplasia.   Does that just mean that it is a larger area?    They found ALH in the biopsies and ADH in the excisional biopsies.   Why do you suppose only ALH was found in the biopsies and then ADH was only found in the excisional?  Doesn't that seem strange?   (Also,  I just now noticed that one of the slides arrived shattered.  Seriously?)    just for further info, here are the path reports: biopsies  Left breast, outer, stereotactic core biopsy  part A; 11/14/12): Flat epithelial atypia and focal atypical lobular hyperplasia in a background of fibrocystic changes and columnar cell change with microcalcifications. Left breast, 11 o'clock, ultrasound core biopsy (part B): Fibroadenoma. Left breast, 1-2 o'clock, ultrasound fine needle aspiration 11/14/12): Negative for malignancy. Findings consistent with fibrocystic changes. Right breast, 9 o'clock, ultrasound core biopsy (part C): Benign breast with no significant pathologic abnormality. Right breast, 7 o'clock, ultrasound core biopsy (part D): Focal atypical lobular hyperplasia in a background of fibrocystic changes excisional biopsies. Selected slides from left breast, surgical excision (slides 2F, 2H, 2J, and 2L): Multifocal atypical ductal hyperplasia (ADH) and flat epithelial atypia. Background proliferative fibrocystic changes including usual ductal hyperplasia and apocrine cysts. Microcalcifications present. Biopsy site change. Slide 2H arrived shattered and cannot be evaluated. Selected slides from right breast, surgical excision (B12-0409550, slides 1G and 1L-1N; 12/19/12): Focal flat epithelial atypia. Background proliferative fibrocystic changes including usual ductal hyperplasia, columnar cell hyperplasia, and apocrine cysts . Microcalcifications present. Biopsy site change. Any insight is appreciated.  Thank you.",
      "MessageIndex": 334,
      "PostDate": "12/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Mar 26, 2014 06:18PM cinvee wrote: Leaf, and ladies, Interesting discussion about MRI's.   Do you think that having extremely dense breasts is one of the major deciding factors above and beyond ALH or ADH?  To me, because I have extremely dense breasts,  my team would rather send me for MRI's and as my MO said,  mams are useless for you.  (except of course, they catch calcificaitons, which I also have)  Looking at my mams is like looking for a snowflake in a cottonball.   ",
      "MessageIndex": 346,
      "PostDate": "26/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Dec 21, 2013 09:36PM cinvee wrote: I am Melissa, which I feel very fortunate about.   I know that all three catch different \"issues\", I guess I am not sure if the mamm's will catch it' s area.  Not sure if that even makes sense.    It probably doesn't help when I see all of the stories on here where after surgery, bigger issues are found that had been lurking in breasts and not seen by screening.  (I know these are the exceptions, not the rule).   What I am wondering is since that is a small possibility, when one has extremely dense breast,  is there anything else I can do?  Are those typically the women who later found out they had something that was never seen on screenings?   I am terrified I will be the 1 in a 100 that has something not seen by screening because my boobs are so difficult.  ;)   Because I am a little higher risk with my atypias, I worry probably more than I should.   Thanks for letting a girl rant and ask really stupid questions.   I can't tell you how comforting it is to read the stories of strength and the wisdom from you ladies.  ",
      "MessageIndex": 3,
      "PostDate": "21/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/816019",
      "Title": "Extremely Dense breasts cinvee marie5890"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Jan 24, 2014 03:37PM cinvee wrote: Ballet, maybe we should start a group in the high risk forums called  \"Iron Boobs Unite!\"  A group of extremely dense women.   ",
      "MessageIndex": 15,
      "PostDate": "24/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/816019",
      "Title": "Extremely Dense breasts cinvee marie5890"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Jan 18, 2014 11:58PM cinvee wrote: Thank you so very much for sharing your stories.   I know that every set of boobs, and circumstances, are different, but those two examples are EXACTLY what I worry about.   I do not think it is probable, but I know it is possible.    Having a crap load of high risk factors, although it could be much worse, scares me.   I am not a worrier.  Yet, since Oct 17, 2012, it seems like I am always worried.   24/7.  In fact, I have a new lump.  This one is the first I can very easily feel, and can even see if I am standing just right.   Ballet,  my boobs are always sore.  Always.   I do still have one ovary,  I am not menopausal.. but I did have a total hysterectomy last Feb.   Very interesting about the difference of Extremely Dense breast.   That is me for sure!  My BS said they are crazy, and the radiologist broke a nail when trying to do one of my biopsies.   I am now know as iron boobs.  ;)  Have to find the humor somewhere, right?  ",
      "MessageIndex": 13,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/816019",
      "Title": "Extremely Dense breasts cinvee marie5890"
    },
    {
      "AuthorID": "cinvee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164351/profile",
      "Content": "Feb 2, 2014 08:18PM cinvee wrote: bumping, shamelessly :) I have my appointment at U of Michigan breast cancer center tomorrow.    I am going for a second opinion and also happy to be seen at such a great cancer center.    Feeling really stressed out about it though.   I know I need to have a list of questions,  but suddenly can't think of anything.    Hoping to get reassurance and answers tomorrow.   ",
      "MessageIndex": 16,
      "PostDate": "02/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/816019",
      "Title": "Extremely Dense breasts cinvee marie5890"
    }
  ]
}