{
  "AuthorID": "Circe",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
  "Posts": [
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 18, 2010 02:45AM - edited Jun 18, 2010 02:53AM by Circe Getinpastthis!  I just fully understood your name and how clever as I wrote it out!  I am a newbie to this group, but your news gives me lots of hope and I am SO happy for you!  I just finished up chemo (started in January) and will have surgery next week.  I think the hardest part is \"waiting\" for the pathology news.  I wish I had found this web-site sooner - you are each so inspirational! Ladies!  Thank you to each of you for the warm welcome to the group.  I just got back from a walk, and I shared with my husband how fortunate I feel to have found your group.  I am leaning very heavily towards NOT doing the nipple sparing.  At the end of the day, I am a worrier (something I need to work on) and I feel good about this decision.   Stacey - is your surgery tomorrow?  You are totally in my thoughts and prayers.  I can only imagine what it will feel like the night before. I know I have such mixed emotions, looking foward t getting it behing me, but still apprehensive.  But the power in thinking tomorrow at this time - you have it behind you!!  ",
      "MessageIndex": 259,
      "PostDate": "18/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 22, 2010 03:25AM Circe wrote: JillyG, thank you!  I will be thinking of YOU!  Please drive safe to Calgary, and hope you have a very comfortable hotel room/bed to stay in!  We will be on the other side of this before we know it!  Hugs back to you! ",
      "MessageIndex": 318,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 28, 2010 06:33PM Circe wrote: JoyStars- SO happy to hear you and the BABY are doing well post surgery!  I think we have ALL been waiting to see your post.  It brought HAPPY tears to my eyes.  I think it's a post surgery \"thing\", but I am crying at everything.  It must be a release! Webstermom - CONGRATS to you, too!  how are you feeling today? Laurie - I LOVE your post about laughter - I will try to start LAUGHING more!  Great advice! Sticardstan - I am 5 days post surgery, and still take my pain meds every 4 hours.  I came home with a pain ball, which was emptied as of yesterday.  I will TRY to go more like 5 or 6 hours between pils. Ducki!  I envy your 11 grandkids, we have our ONE an only (and he is precious).  It's a challenging balance with just one.  I want him to see \"Gram\" as doing well and strong, but the reality is I am still tired and can't play with him, like I usually do.   Misty - how is my June 22nd partner doing??  I have a follow-up tomorrow with my surgeon' nurse, and the OC radiologist.  I know it's probably not realistic, but I harbor this small dream/hope that my tubes might come out tomorrow.  My thoughts and prayers are with Jblcsw and speech today!  Can't wait to see their post surgery, posts!",
      "MessageIndex": 455,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jul 7, 2010 07:37AM Circe wrote: Hello June Ladies! Just got caught up on posts, I left my hometown (Portland) on June 2nd, and have not had internet service.   Laurie!  CONGRATS on your clean path report!!  I am also doing a happy dance for you - literally!  My cats are looking at me like I am crazy!  Plus, I am very motivated by your weight loss.  I have gained about 15 pounds since my Jan. diagnosis.  Primarily due to steroids in the chemo, plus I (was) a runner, and now do walks.   Liz - as I caught up on the posts, by the time I got to your updates that you have been weight lifting, I literally almost fell off my chair!  I love the way you push the envelope and I also have no idea how you are doing that?!  I still can't really reach more than a couple inches above my shoulders and can pick up my cat who weighs about 8 pounds...  Do you have your drains out, yet? Melissa - I think we are both 1955 \"babies\"?  We do share a lot in common.  I have no children, also had NEVER spent a night in the hospital.  I ended up spending only one night in hospital, but was SO comforted by the nurses that I would have gladly spent a 2nd night.  After surgery, the time literally zoomed by - I was almost in a little dream like state.  The anticipation of surgery is the hardest part.  As everyone says - it is SO much easier than anticipated.  And once over - you feel SUCH relief!!  I KNOW you will do great from your attitude and \"spunk\". Joystars - Happy Belated birthday to our Norweigian friend!  I think I will have \"chemo\" brain for the next year, as first I thought you meant you were celebrating your 30th wedding anniversary!  Your posts are SO motivating!  Yes - let's all celebrate LIFE with you!!  Misty - how is my fellow 6/22 friend?  Do you have your drains out yet?  I can tell from your posts that you are doing great!  So happy!  I am 15 days post surgery.  I got my two drains out 10 days post surgery.  My doc took them out a little \"early\".  My left met the criteria, but my right was still above.  She weighed the pros/cons of waiting over the week-end, and took them out with the strong advice to NOT exercise for 3 days and to take it easy.  So far, all is great!  I was really worried about possible fluid build-up - but none!  I have been off pain pills for 5 days.  I do have \"pain\" pretty much 24/7 from the expanders.  Not really pain, but a constant almost feeling like a vice-grip around my chest.  I am getting used to the feeling - but hope this is \"normal\".  Wondering if it will be like this for the next 3 months?! I don't think I have seen this question, but now I am off pain pills I figure it's \"ok\" to have a little glass of wine once in awhile with dinner?  I noticed Laurie mentioned \"longing\" for a margarita, and wondered if you are all avoiding alcohol?  ",
      "MessageIndex": 605,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 23, 2010 07:21PM - edited Jun 23, 2010 07:33PM by Circe Ladies!  I just got home from the hospital.  I 100% agree with what Misty said - the waiting is the hardest.  The day of surgery - everything almost went by like a dream.  I did take a valium upon arrival, which helped!  I had a dream team at the hospital.  All I have wanted to eat is broth - but that is good!  I borrowed a cami with little pockets for the drain.  I have two drains, and a pain pump.  They took four lymph nodes, and from surgery - they looked clear.  We will get the full pathology on Friday.  My expanders are what seems to cause most of the pain.  I have a small fill in them already.  I feel such a relief to have surgery behind me.  I was almost giddy this morning!  Misty - I hope you are are feeling well.  JillyG - I was thinking about you all day.  Looking forward to hearing from you!  Webstermom - you are next - my prayers are with you.   Joystars - you are up next too, I LOVED LOVED your last post.  I can totally relate to what you shared. I received SO many emails, texts, love and support the days before my surgery - I just felt that same peace.  I somehow felt uplifted by all of the messages. Most of all my DH.  I am looking forward to hearing from you as soon as you can post.  You will be back in that midnight sun before you know it! Ladies, thanks for the support!  I am a new member of the group, and I already feel such support and love from each of you.  Thank you for so warmly \"accepting\" me into your specail network.  It means the world to me! Well, I am comfy in our borrowed easy chair.  My drains are \"draining\", and my cats are glad I am home!  I think I am going to sleep well tonight! ",
      "MessageIndex": 360,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 25, 2010 04:06PM - edited Jun 25, 2010 04:06PM by Circe MistyJ - I was thinking I would need to be the first to bring up the OTHER C word - constipated.  Yikes!  That was my major challenge during five months of chemo.  Was ALMOST back to somewhat normal, and now again - because of the pain meds.  One of my nurses suggested WARM prune juice followed by ALL the water you could pour down your throat.  I have pretty much just has broth and juice before/post surgery.  But, I need to start eating solids. Lizzy - you are a beacon to me!  WOW!  Love  your drive.  I am just pretty much doing my laps around my condo, and the exercises to ward off bloodclots. J Smiley!  - Thank you for being the keeper of the calendar and updates.  That was one of my visuals, seeing my name with the word DONE! Joystart - how are you doing? I have been pretty much sleeping through the night - thanks to the itchies and then the benadryl (sorry about spelling).  Drains are ok, I am trying to be POSITIVE and think of them as a good thing, but they do give me angst.  I think my pain \"ball\" will come off tonight of tomorrow!  I have an appt with my oncologist today to review the complete pathology.  She has been with me since the date I discovered I had BC.  She shared the news with me just before surgery she is relocating and moving to Denver.  I sat in her office and cried like a baby.  I just get so attached to people, and now more than ever.  I do not have a final solution yet, buy may stay with her associate for consistency.  I went to a OC in Seattle to get a 2nd opinion, and REALLY like her.  So - I may still decide to see her, even though she is 300 miles away.  That just seems silly, when there are GREAT OC's in Portland.  Hummm. Ladies - I am SO thankful to be where I am on the journey.  I woke up this morning, (with some pain, and drains), but felt such gratitude.  Such a relief to have surgery behing me.   THANK you to each of you for your inspiration!  ",
      "MessageIndex": 374,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 23, 2010 09:13PM Circe wrote: Lizzymack!  Welcome home! I did not realize we had surgery on the same day!  WOW!  Riding your bike for 30 minutes!  You are motivating me to do more!  Hey - I have to ask the silliest of questions - I am \"ITCHY\" all over.  Just wondering if it has something to do with post surgery?  I am so glad to be home, I almost stayed in the hospital two nights. ",
      "MessageIndex": 362,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 30, 2010 02:48AM Circe wrote: Laurie - my heart/prayers are with you - I know you will bring the June group home in flying colors.  YOU have been so sweet and supportive to all of us all month, my heart went out to you reading about your son.  I bet they surprise you regarding how strong they will be for you. MistyJ - I had HAPPY tears reading how well you are doing!  Plus, did a happy dance for you - two tubes out!!  YEAH!!  I went to my doc today, and still have all my tubes.  MAYBE Thursday. Webstermom - CONGRATS to you!  More happy tears for you!! Jeanee - Thank you for sharing your venting.  I have those down moments, and often try to hide them.  I LOVE summer, and I was thinking I will not even be able to go swimming in the \"salt water\" until maybe August.  I know it's a SMALL price to pay and I am so lucky - but I totally identify with you you feel. Speech529 - YEAH!  Congrats!  You are on the other side with us!! Sticardsfan - So happy you got two drains out!  Yeah!  think the drains have been my nemesis. My good news - met with the radiology oncologist this am, and no radiation needed!  There was a small chance I might need it, even though my pathology'/nodes were clean, because of the initial size of my tumor.  I do have one last \"hurdle\" of having a 2nd opinion from my Seattle oncologist.  I got a 2nd opinion much earlier in my treatment, because my Herc2Nu testing came back equiivocol.  So, now I keep her in the loop as well. It's hard to believe we are looking at the end of June.  Sometimes time crawls by and then it seems to ZIP by!  Just a little dream, but it would be SO nice if we could all celebrate together!  Guess we will cheer through the internet!",
      "MessageIndex": 489,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 16, 2010 11:44PM Circe wrote: I am a NEWBIE to this wonderful community of sharing.  I have surgery scheduled for Tuesday / June 22nd.  I don't know if I have all the abbreviations figured out yet, but am having a BMX.  I had chemo first (6 sessions) because of the size of my tumor.  The good new, the tumor has shrunk to the point of almost disappearing.  My questions - I am a good candidate for nipple sparing, but have this fear/angst that perhaps leaving the nipple will \"expose\" me to a greater chance of a reoccurance.  I plan to have expanders placed during surgery.  IF I need to have radiation after surgery - just wondering if anyone has experience with expanders and undergoing radiation?  THANK YOU so much for all of your sharing on this site.  It is very comforting, and I feel like I have many \"sisters\" who I am immediately connected to, who I have not met.  Final question - has anyone rented or bought a \"recliner\" chair for the comfort of the first month of sleeping??   Also, I can't figure out how to post my surgery date??  :):)  Hugs to each one of you!",
      "MessageIndex": 241,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 19, 2010 12:42AM Circe wrote: Wifemomx2 - WELCOME home!  I am a \"newbie\" to the group, but already feel the sisterhood!  Were you in the hospital one or two nights?  Joystars - my HEART goes out to you. Please know all of your emotions are SO normal.  I seem to have a fixation on women's beautiful \"normal\" hair.  How exciting to see the ultrasound!!  Do you know yet if you are having a boy or girl?  JillyG!  I love that you went for a hot stone massage!  Was it super relaxing??  I may copy you and try it!  Actually, I would love to have a reflexology session before surgery. JSmiley -WOW, you got your drain out after one week?! I hope we are all so lucky!  I am also doing a happy dance for you!  I can only imagine/visualize how good it will feel to get those drains out!  Sticards - Hope you enjoy the game!  Will be thinking about you and sending you best wishes and prayers over the week-end.    ",
      "MessageIndex": 273,
      "PostDate": "19/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 21, 2010 08:11PM Circe wrote: Hi J Smiley!  Thank you so much for keeping the calendar up.  No doubt challenging with all of us!  I think I got left off from your last update.  I am having surgery tomorrow - 6/22.  Along with Misty.  I am having a DMX.  Wifemom - how are you feeling today?  I could so relate to your comments about the inner strength you (and all of us) have.  I sometimes wonder where mine is coming from.  No doubt a LARGE portion from women like all of you!  Warrior Women (who, yes can be bitchy from time to time, no fault of our's, of course!) Misty - what time is your surgery tomorrow?  Mine is scheduled for 1:00pm. It's my surgeons first day back from vacay, so they have forwarned me it may be later.  I have been telling everyone, I am going to feel like Dorothy in the Wizard of Oz, that last scene when she wakes up back at home, and her family/friends are all standing over her bed, smiling.   SLizzymack - I LOVE hearing about your cat.  My two cats are more calming than my \"anxiety pills\".  They will just lay on my chest and PURRRRRR.  I try to calm my breathing, and just relax to that sweet sound!  I have two bengls, who are 17 and 18 years old.   Thanks, everyone - to all of my new sisters!  I hope to post the day after my surgery with encouragement for all of you going behind me.  My daughter is a scrub nurse.  I'm not sure who commented on their fear of not waking up, but my daughter said that is a common fear - but NO REALITY to it!  All she does is surgeries day after day, and she has NEVER had a patient not wake up - so PLEASE don't worry.  You will also have your \"Dorothy\" moment, of waking up with all of your loved ones surrounding you!",
      "MessageIndex": 309,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 27, 2010 04:15AM Circe wrote: Hello Ladies!  I had surgery on 6/22 - and over-all am doing great!  I had my (last) appt with my oncologist (she is moving) yesterday and got all my pathology back.  Then, I had to stop by the hospital and surgeons.  I was BEYOND exhausted today (mentally and physically).  I am 4 days post surgery, and my pathology came back CLEAN - a complete pathological response.  I still need to meet with my radiologist, since my tumor was so large - I may still need radiation.  I came home with a pain pump and it ran out today, as scheduled.  My DH removed the (very small) tubes, and so now I am FREE of carrying around the pump which was about the size of a croquet ball.  I was so nervouse as he pulled out the tubes, my legs were shaking.  But, it really did NOT hurt!  My pain is still being managed pretty well wiith  oxycodone and tylenol.  I still (of course!) have two drain tubes.  I still feel angst about them, but am getting used to them.  One of my friends made this velcro \"belt\" with  pockets for me!  It works pretty well!  Plus I have a velcro cami (sleeveless) with pockets (I like this the best).  Constipation followed me through months of chemo.  One of the nurses I met in the hospital said the trick is HEAT up the prune juice and follow  it with LOTS of water.  Finally seemed to work today!!!  Misty - I hope this might work for you?  I feel so blessed with my good pathology news.  Yesterday was like a dream, and today I have been so emotional all day.  It's like five months of emotion is escaping in a good way.  Ladies who yet to have surgery - it was remakkably so much easier than I thought.  And such a relief to have it over.  It's the waiting that is the hardest part.  Reneemac - You are a true WARRIOR!  Loved your Las Vegas travel story.  How are you feeling?  Did you have any \"post\" Vegas letdowns?  We have best friends getting married in Las Vegas, and it will be around my two weeks post surgery - so LOVED hearing that you did that! JSmiley - LOVED hearing about your Mom's surprise party  Isn't it wonderful to participate in just the \"normal\" life activities??   LizzyMack - my heart goes out to you with your PS switch.  I am still in the process of finding a new Oncologist.  But, I do believe we will BOTH land in a great place with this change!  And, my anthesiologist suggested I make FREQUENT walks around our house.  He said to avoid bloodclots he recommends more frequent and shorter activities.  If you are watching tv, every commercial take a little walk around the house.  He also said to do 360's with your feet, and back and forth stretches.  Plus TONS of liquids. Karen - I LOVE hearing about the shirt you have from your Dad.  My Dad has passed on as well, and I would give anything to have one of his shirts to wrap around me.  How VERY special. For some reason, today has been like \"Niagra Falls\" for me - but in a good way.  I had chemo first (started late Jan), so the surgery has seemed like a LONG road trip!!  My thoughts and prayers are with our June ladies as you bring us home, finishing up the month! xoxo",
      "MessageIndex": 424,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 27, 2010 06:38PM Circe wrote: Jane, Speech, Ducki - I am thinking about you ladies like crazy today.  I KNOW you will be so relieved Monday night, to have surgery behind you.  I was NOT shy about taking the valium they offered me at check-in.  No doubt, why that day seemed so dreamlike!  My lazy boy chair has been a godsend.  I sleep in it, and \"hang out\" in it all day, except when up taking my \"laps\" around the condo, etc.  We borrowed it from a friend, and were able to transport it in our SUV.  I hope you and all our JUNE ladies/warrriors are enjoying this Sunday summer day and yes - I am looking forward to seeing you on the other side! xoxoxo",
      "MessageIndex": 432,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 19, 2010 12:45AM Circe wrote: Stacey!  - I have been thinking about you all day.  Can't wait to hear from you/ see your post.  I hope you are in your room, sleeping soundly, and well medicated from pain.",
      "MessageIndex": 274,
      "PostDate": "19/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 19, 2010 11:19PM Circe wrote: Oh Melissa, I'm also sorry to hear about your nips.  I know it's a personal and emotional decision for each of us.  I am a good candidate for nipple sparing, but have decided against it.  I just know myself too well, and I am a worrier.  I'm afraid that I would always just worry that perhaps/maybe my \"old\" nips could increase the re-occurance of cancer.  I am actually thinking about NOT having any nipples.  I'm not sure if I will be comfortable with that, but I might start there.  In looking through my PS \"look book\" he showed me several women who had tattoos.  One was a pretty flower.  I laughed and said I was trying to visualize being 80+ years old with flowers on my nipples.  Then I laughed harded,  thinking I will just feel gratitude to be 80+ years old, and probably will not care too much what my nipples look like?!  I am trying so hard to be \"calm\" this week-end, but already feel a bit anxious for Tuesday's surgery.  I am also SO appreciative of the June WARRIORS who are showing us the way!  I plan to take my computer with me to the hospital - any thoughts on this??  PS - my Mom is a BC survivor, and just celebrated her 80th b'day!",
      "MessageIndex": 283,
      "PostDate": "19/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "Circe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103757/profile",
      "Content": "Jun 30, 2010 08:36PM Circe wrote: Lauire - So happy, you are on the  \"other side\"!  I know we are ALL waiting to hear from you! Ducki - I am SO sorry you had that additional stress yesterday.  I know we can all identify once you have your surgery scheduled, it would be so disappointing to have to reschedule.  So happy all is back on schedule for you!  You are in my thoughts and prayers.  Marm - how did you know you had an infection?  I had chemo pre-surgery as well.  It sounds encouraging that your Docs said antibiotics are all you need.  How are you feeling? I am 8 days post surgery and today I feel SO tired.  Have been napping almost all day.  Yesterday was a \"big\" day with 2 doc appts and lots of walking.  I may try to go for a walk later, but it feels so good to just nap with my cats with the sun coming through the window.  We are NOT getting much of a summer yet on the West coast.",
      "MessageIndex": 507,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    }
  ]
}