{
  "AuthorID": "cjh",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
  "Posts": [
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Oct 11, 2008 07:34AM cjh wrote: Hi C, I also lost my mom to cancer when she was 38...I remember how hard the chemo was on her and I could not get that picture out of my mind when I was told I needed chemo.  I think it was Post Traumatic stress disorder-I was sixteen at the time.  My experience has been totally different!  I have been able to have a life ie. work, boating, exercise. I have a dose dense chemo regime and thought I would be in bed, but thanks to the incredible drugs for side effects, I am actually able to get quite a bit done in a day. I do get tired easier, but still think that is from the BLM I had in August.  Everyone is different, but for me chemo is so much easier than managing drain tubes and everything else related to surgery. You don't have to change your attitude until you have had some time to take all this in, give yourself some room to to deal with the many levels this is impacting you",
      "MessageIndex": 9,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722566",
      "Title": "Chemo is scaring me so badly. Please help me. Mocity nanclee"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Sep 21, 2008 07:00AM cjh wrote: So sorry to hear about your liver pain.  Can you get an IV pump for direct line pain administration in your home till they can get some chemo on board to treat the cause? When people have their pain managed they often feel sooooooooo much better.",
      "MessageIndex": 7,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721550",
      "Title": "Morphine all day everyday - Things are getting serious TripleNeg lewisfamily503"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Sep 27, 2008 05:24PM - edited Sep 27, 2008 08:19PM by cjh",
      "MessageIndex": 213,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Sep 20, 2008 10:49AM cjh wrote: OMG! Your case of  medical incompetence and disregard for the patients insight and intuition takes the cake.  These boards are filled with stories of medical errors, but non as consequential as yours right now to all of us that follow your unbelievable journey.  And to think, yesterday I was whining about getting another patients lab/test results in the mail  by mistake instead of my own. Ahhhhhh...",
      "MessageIndex": 16,
      "PostDate": "20/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Sep 27, 2008 05:24PM cjh wrote: You deserve round the clock room service for the next week! So glad to hear the great news!",
      "MessageIndex": 212,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Aug 31, 2008 01:38AM cjh wrote: Deb, Boldly calling upon the forces of heaven to be with you and in your surgeons hands in the OR..",
      "MessageIndex": 75,
      "PostDate": "31/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720346",
      "Title": "Dear Lord, I just scheduled brain surgery AlaskaDeb heymoose"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Oct 15, 2008 11:15AM cjh wrote: Hi Deb,  There is a thread called clinical trial E5103 that has several pages of reports.  I think you will be able to find it by doing a search of E5103. I will look for you on the thread and good luck!",
      "MessageIndex": 1,
      "PostDate": "15/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722815",
      "Title": "Anyone starting Avastin trial with AC & T debk55 sftfemme65"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Aug 28, 2008 08:21AM cjh wrote: I loved my sugi cami that had drain tube and bottle pockets.  It was tight enought to offer compression to my chest and securly hold and hide the tubes.  I had surgery August 13th and got my first tube out the next week on the 20th.  It tickled and just plain felt weird, but not painful.  The other tube came out two days later.  I noticed a significant increase in fluid when I did a lot of activity, so opted for a sedentary pace in order to get those tubes out...I so disliked them.  Gee, you are back to teaching already!  My sister is not ready to return to the classroom  yet and that is just from the strain of taking care of me last week! Actually once the tubes are out and I could sleep and shower in any position, energy came back fast.",
      "MessageIndex": 22,
      "PostDate": "28/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720042",
      "Title": "How long do drains stay in? HeatherBLocklear new2bc"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Aug 23, 2008 06:12AM cjh wrote: I have had several calls back for additional ultra sound as I have dense and fibroid breasts that often hide things...but the first call back had me planning my funeral over the weekend!  My husband intervened and called the radiologist (they work together) He said that there really was nothing to worry about and that most return requests have a rating of 1-5 in terms of urgency concern and follow up \"Nothing \"implies a 1  to this layperson which is basically they need to see an area blocked or unavailable by the mammo or want to confirm a cyst or othe benign nodules.  On the other hand 5 is not good and indicates need for biopsy due to malignant appearance. The one to five rating was used 12 years ago at a major medical facility, not sure if it is still used or universal to all radiologists.  Hope this helps a little, try to enjoy the weekend!",
      "MessageIndex": 3,
      "PostDate": "23/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/719952",
      "Title": "New to all this wiser1 cjh"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "cjh wrote: I meet with my physician on Thursday, but meanwhile am preoccupied with a sore and swollen lymph node in the center of my armpit that just appeared yesterday.  I had a core biopsy with a marker inserted last week and an MRI.  Thus far I know mass is 10 cm containing three tumors with IDC and DCIS grade one and MRI reported NO limp node involvement.  Has any one had an infected or irritated lymph node after a core biopsy?  Thanks! cj Dx 7/22/2008, ILC, 4cm, Stage IIIC, Grade 3, 10/32 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/719105",
      "Title": "Can a Core biopsy cause lymph node to swell cjh therese48"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Aug 17, 2008 11:59PM cjh wrote: Hi I just had a bilateral with SNB last Wednesday the 13th of August.  I did not opt for reconstruction until done with treatments. I could have gone home the next day but chose to stay an extra day to get more comforable with the drain tubes. I ended up having positive nodes so surgeon took all of them on one side.  I did not do too much around the house till today except watch most of the OLympics)  My girlfriend came over today and we washed and braided my hair.  I almost feel normal.I strongly  recommend a camisole or two with pockets for the drain tubes/bottles. I love it and it makes me feel secure enough to venture outside.  Good luck on your surgery",
      "MessageIndex": 7,
      "PostDate": "17/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719640",
      "Title": "AUGUST/SEPT SURGERIES?? harmonysun museumlover"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Sep 23, 2008 11:39AM - edited Sep 23, 2008 11:51AM by cjh",
      "MessageIndex": 4,
      "PostDate": "23/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/721664",
      "Title": "Help read path report- ALH- going for 6 mos mammo! shabby6485 cjh"
    },
    {
      "AuthorID": "cjh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70344/profile",
      "Content": "Sep 23, 2008 11:49AM cjh wrote: I had ADH three years ago, had lumpectomy in left breast with regular mamos to both breasts for follow up. I did not realize that I should watch the other breast as close nor that now some docs consider meds such as tamoxifin for prevention of IC after ADH. (Depends on several factors including menstual status) To make a long story short, (my case is the exception, not the rule) I turned up with advanced lobular cancer in the right breast that hid out till it spread to the lymph nodes three years later. Digital mamos picked it up right away this summer, due to dense breasts, I did not, despite monthly self checks. I do not want to alarm you at all, just so wish I had known the POSSIBLE implications of ADH in the future...I thought it was fairly harmless or an early catch not a possible indicator for future invasive cancer, but then medicine has learned a lot just in the last few years on ADH/ALH.",
      "MessageIndex": 5,
      "PostDate": "23/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/721664",
      "Title": "Help read path report- ALH- going for 6 mos mammo! shabby6485 cjh"
    }
  ]
}