{
  "AuthorID": "CJKLOSE",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187713/profile",
  "Posts": [
    {
      "AuthorID": "CJKLOSE",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187713/profile",
      "Content": "Oct 17, 2013 05:20PM CJKLOSE wrote: Good luck with your Monday appointment. Sounds like you have a good and helpful team behind you. That means a lot. I meet with mine on Oct 30th...pre-Halloween...haha. Seriously though, I like and have much confidence in my PS and his assistants. You mentioned genetic testing...let me know how that comes out. I pray you don't have to undergo the oophorectomy too. Talk to you soon... CJ",
      "MessageIndex": 4,
      "PostDate": "17/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "CJKLOSE",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187713/profile",
      "Content": "Nov 14, 2013 04:55PM CJKLOSE wrote: Hi ladies. I haven't been online for a while so trying to play catch up. I was supposed to have my BMX yesterday, but it has rescheduled to Dec 12th. I was cutting back my rose bushes and got scratched up by one of them...the rose won the fight. I ended up with a nasty fungal infection on that arm so they won't do the surgery til it is healed. I certainly understand why they must wait...but a bit bummed cause I wanted to get over the worst before Christmas...I love Christmas. Oh well, huh? I wish all Nov ladies the very best with surgeries and recuperation.",
      "MessageIndex": 197,
      "PostDate": "14/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "CJKLOSE",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187713/profile",
      "Content": "Nov 8, 2013 12:47PM CJKLOSE wrote: Hi all. My surgery has been postponed from Nov 13th to Dec 12th due to a fungal infection I got from pruning a rose bush (the rose bush won). They have put me on meds and sent me to a wound center for procedures I am to follow for the infection it left on my right arm. After 3 lumpectomies, one of which I got an infection; and now, this fungal thingy causing my surgery to move out for another month...this is getting a bit old and getting bummed out a bit. I have a question and probably a dumb one. Will I have a catheter before, during and after the surgery? I know I didn't for the lumpectomies because they were only a couple hours of surgery...but this surgery for a double MX and the beginnings of reconstruction they say will be 8-9 hours. The lumpectomies were my first surgery ever, so I'm not sure what to expect with such a long surgery. So that is why my question about the catheter...will I have one and will they remove it before I wake up (hope so). Thanks ladies and I am so glad to have friends through all of this. CJ",
      "MessageIndex": 125,
      "PostDate": "08/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "CJKLOSE",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187713/profile",
      "Content": "Oct 16, 2013 07:02PM CJKLOSE wrote: Hi Mimi32. I too just got my date for surgery and I am right behind you, Nov. 13th. I'm having a skin-sparing bilateral mx with TE reconstruction. You are ahead of me. I'm trying to get a handle on the size and style of silicone implants. Like size, profile and all that good stuff. Trying to figure out what will look okay for me. Got any tips and advice for me on that topic? Are you keeping your nipples...I won't be keeping mine. It's great meeting you and having a hospital room mate. CJ",
      "MessageIndex": 1,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/812878",
      "Title": "November 2013 surgeries mimi32 MCbeach"
    },
    {
      "AuthorID": "CJKLOSE",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187713/profile",
      "Content": "Nov 25, 2013 04:22PM CJKLOSE wrote: thanks much for the photo...now I cam look for the FOL bra. Question Aviva5675..you say \"post BMS bra free\". Do you plan to stay in a bra-free state, meaning no protruding nipples under clothing and looking lifted and perky in t-shirt like tops? I've already been thinking about my end result looks. CJKlose",
      "MessageIndex": 116,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "CJKLOSE",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187713/profile",
      "Content": "Nov 20, 2013 04:27PM CJKLOSE wrote: Hi ladies. I am scheduled for my bilateral mx with TE's on Dec 12th. I've had 3 lumpectomies only to end up with a mastectomy. Oh well... I'll be glad to get this done and move on with any treatments I might need depending on my pathology and nodes results. Glad to be among friends on this journey. I've been trying to make a list of things I'll need for my hospital stay and after I get home. I see conversations about sport bras, camis and such...but I have no idea what brand, style or sizing. Anyone got ideas to share on what to get?",
      "MessageIndex": 76,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "CJKLOSE",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187713/profile",
      "Content": "Nov 25, 2013 03:21PM CJKLOSE wrote: hi again...has anyone found any comfortable but affordable camis for after surgery? Every camisole that I have found is way out of my affordability. I got laid off from my job just 2 years before retirement eligibility and while trying to find a new job (at 59 yrs old...haha) I got diagnosed with breast cancer. So I am next to broke and getting ready for a bilateral mx. Not sure where I will end up after all this is over...but I do know that God is with me. CK",
      "MessageIndex": 111,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "CJKLOSE",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187713/profile",
      "Content": "Nov 25, 2013 03:12PM CJKLOSE wrote: hi. Is there an item number and brand that I can look for the bras at walmart? I've been looking for some after surgery wears. My bilateral mx with TE's is scheduled for 12/10. Thx much,CJ",
      "MessageIndex": 110,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    },
    {
      "AuthorID": "CJKLOSE",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187713/profile",
      "Content": "Nov 25, 2013 04:51PM CJKLOSE wrote: I have been looking at some of the 3D tattooes they do...and they look pretty awesome and don't protrude during temp changes..,pretty tempting",
      "MessageIndex": 119,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813698",
      "Title": "December 2013 surgeries bobogirl sandra4611"
    }
  ]
}