{
  "AuthorID": "CJRT",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
  "Posts": [
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 20, 2012 06:56PM CJRT wrote: Nancy- Thank you so much for all that work you did on the list! My TCH is a little different- I'm Taxotere, Carboplatin, and Herceptin....not the standard \"C\" for Cytoxan.  I guess there are 2 regimens called \"TCH.\"  Glad to hear you are feeling good and hope it continues. I really admire that you are taking classes throughout this and your positive outlook in general.  I luckily work only part-time from home doing reports and enjoy trying to keep my mind sharp and distracted throughout all this.  Hope everyone has a good, minimal side effect weekend. I'm going to try to enjoy mine before having to go in for my next treatment Wednesday. I'm also hoping to shake a cold I picked up from my daughter so that my treatment isn't delayed.",
      "MessageIndex": 646,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 1, 2012 03:57PM CJRT wrote: Hi everyone! I did 3/6 of my carbo, taxotere, herceptin cycles and had really bad side effects.  My onc. and the tumor board recommended sandwiching my surgery in the middle of the chemo to give my body a break. Fortunately I had a great clinical response to the chemo (no more invasive cancer!).  I opted to go aggressive with the surgery and had a NSBMX the beginning of December and will now be returning for the remainder of my chemo starting 1/4. I am hoping that the break will help my body be better able to face the chemo, since I had started the initial chemo when my body was still recovering from delivering my baby boy.    I learned a lot thus far along the way but the biggest tip I can offer is to hydrate.  I learned the hard way that I just didn't drink enough for my initial cycle, so I now go for fluid infusions and that has helped tremendously. I wish everyone the best of luck and know what a wonderful support my Sept. start ladies have been to me.",
      "MessageIndex": 137,
      "PostDate": "01/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 12, 2012 02:53PM CJRT wrote: Kite- I learned there are 2 different TCH treatments. I am on one of them- Taxotere, Carbo, and Herceptin. I have had 4 cycles so far, so if you have any questions about this one, I'd be glad to try to answer!",
      "MessageIndex": 398,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 12, 2012 05:41PM CJRT wrote: Kite- Emend is an anti-nausea medication that comes in a 3-day pack (one pill the morning of chemo, and one for the two following days). It's expensive, but I have heard amazing things about it. My treatment center gives it universally, but I think it varies based on your oncologist. Aloxi is the standard one given on chemo day in the IV prior to the treatment. From what the chemo nurses told me, it's supposed to last as long as 3 days.  However, I was told to start taking my prn ones as soon as the night of chemo or following morning.  My oncologist also recommended Florastar priobiotic tablets, which you can get OTC at most pharmacies, to deal with heartburn, constipation, or diarrhea.",
      "MessageIndex": 405,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 18, 2012 03:22PM - edited Jan 18, 2012 03:24PM by CJRT Kite- I'm not doing RADs. I did not have node involvement, opted for a NSBMX, and was told by my tumor board I only needed RADs if I did a lumpectomy.  They didn't act as though I had a choice of RADs with the MX in my situation. Glad to hear your SE's have calmed down and classes started off well!  It'll be a great distraction from all of this! What are you going to school for?",
      "MessageIndex": 577,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 12, 2012 03:31PM - edited Jan 12, 2012 03:32PM by CJRT Kite- I had a bad time with the stomach my first cycle with cramping mostly, but no stomach issues the following 3 cycles.  I took Emend the 1st 3 days, had Aloxi in my IV, and had Rx's for Zofran and Compazine PRN.  I hope yours passes quickly.  My worst fatigue/functioning days were 3 and 4 and by 7 I felt back to normal.  I found I did much better going into cycles VERY hydrated and loading up on protein. How many cycles are you doing?",
      "MessageIndex": 400,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 22, 2012 04:38PM CJRT wrote: Nancy-  I know that your clients will be lucky to have you. Going through this also will give you a unique perspective as a social worker. At least that's what I tell myself because I'm in the mental health field, too! :)  I know how tough it is without full-time pay (I am working only very limited hours from home), but it is great that you have grad school covered plus the stipend.  I know how hard it is to come grad school financial assistance in the mental health field.  I'm also glad everyone in your program is being supportive and that your daughter is close by for support. ",
      "MessageIndex": 693,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Feb 27, 2012 10:37AM CJRT wrote: Hi ladies- It's been a while since I posted but just wanted to let you know that I was thining of all of you and echo what all of you have said about cancer sucking, wanting to feel normal, feeling like a fraud when people say I am an \"inspiration,\" etc.  I finally am through the chemo portion (I had started back in the fall but had to take a break) and though I have more treatment ahead of me (Herceptin, Tamoxifin, TE exchange surgery), I feel that chemo does so much to us physically and emotionally that I feel that this was the biggest hurdle to overcome.  I hate that all of us have to go through this, but feel comforted by knowing that you all \"get\" what even the most well-intentioned friend/spouse/family member cannot.  Nancy- What you were discussing with your husband about PTSD resonated so much with me.  Iwas having a smiliar conversation with my husband over the weekend. I felt a physical response to even driving in the vicinity of the chemo center this weekend on the way to a park with my kids.  I cannot think about eating this kind of chicken that I ate a lot during chemo - not because of the nausea but because it reminds me of chemo. We were planning to sell our house anyway, but I feel like I cannot get rid of my bedroom quickly enough because it reminds me of days spent in bed with chemo. I talked to a survivor that burned the outfit she used to wear all the time to chemo.I wonder how long we will carry this since the \"trauma\" is more ongoing, rather than a discrete episode. ",
      "MessageIndex": 1454,
      "PostDate": "27/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 16, 2012 04:16PM CJRT wrote: FLDreamer- I am on TCH also, and when I told my MO I had the most help with my young kids over the weekends, she told me to schedule my chemo for Wednesdays.  She predicted that Saturday and Sunday would be the worst for me.  I have had 4 of the 6 so far and have to agree with her.  Though I have had a harder time than most with my SE's, thus far Thursdays are okay, Friday late afternoon/evening gets rougher, and by Tuesday/Wednesday I feel more back to normal.  I admire all of the women working through this.  My best friend is a young mom recently diagnosed.  She is on a different regimen but has kept working without adjusting her schedule much.  She gets chemo Tuesday, takes off Friday, and has yet to miss a Monday.  Good luck to you!",
      "MessageIndex": 475,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 17, 2012 07:38PM CJRT wrote: Hi Ladies, Hope everyone is doing well. Yolanda, Sorry you have to join us again but so glad to hear you have your humor and faith supporting you, and know that you have all of us too.  I did have the experience you describe of literally feeling my tumor \"melt away\" on TCH.  It really was unbelievable and a real psychological boost going into subsequent treatments.  I joined this group since I am re-starting chemo after a break.  My hair has started to grow back but on my first TCH round, I had initially lost it right around day 17 as other people on the board had predicted. I know several people who have shaved their heads. I just cut mine short and let it fall out on its own. I buzzed what was left a month or so later. I had been warned not to shave it because of irritation or follicle inflammation/infection. I don't know if this is a real concern or not.  Grateful- good luck tomorrow! Hope the day is uneventful and side effects are minimal.",
      "MessageIndex": 536,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 24, 2012 07:38PM CJRT wrote: Rachelv- Happy birthday! So impressive how you are able to perform during this! Janetanned- Glad you are feeling pretty good! That is great! NCBeachGal- Hope today went smoothing and side effects are minimal! I go tomorrow and am totally dreading it. I guess at least one more checked off the list. I may not post again for a week or so, as my eyes really bother me when I use the computer for several days post-chemo. Hope you ladies have a good rest of the week and a pleasant weekend!",
      "MessageIndex": 729,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 24, 2012 08:47PM CJRT wrote: Rachel- Thank you! Guess I never paid attention when you said where you lived. Went to college in Princeton and played a couple soccer games against Mercer County CC.  Miss the area so much!  So beautiful up there....especially when spring rolls in.  Not sure if you spend much time downtown Princeton or what might've changed since I was last up there a few years ago, but I was just talking about how I miss the ice cream from Thomas Sweets!  Good luck at treatment later this week!",
      "MessageIndex": 733,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 15, 2012 07:39AM CJRT wrote: Kite- Hope you are feeling better. I have had a tough go-around too.  I know that no two experiences are the same but I can tell you that I eventually do get back to more of my normal self and that that depressed feeling seems to only occur for me when I am physically feeling my worst. With treatments every three weeks, there are lots of good days in between, even if you hit a rough patch. Sorry we all have to go through this. Mom of 2- I just learned of Bubble guppies after starting chemo. LOL  My daughter who turns 4 in February watches it, and I can't get that song out of my head!  I know how you all feel with kids.  I have a 7-month-old and nearly 4-year-old.  Kids are resilient, and just because it affects them, doesn't mean that it does so in a negative way.  I try to remind myself of that as I am wallowing in guilt on days I have to let others care for them when my SE's get too bad.",
      "MessageIndex": 449,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 16, 2012 05:30PM CJRT wrote: Char and Kite- I am right there with you. I feel the same way about my kids and have my share of tearful episodes. I'm so sorry you are feeling that way too. Kite- I had 3/6 chemo cycles with a break for surgery and had two rounds of herceptin alone (at 3 week intervals).  I had a headache for half a day after one, that may or may not have been related, and absolutely nothing the other time. I was so relieved to feel so good after it since I will have to be on it the remainder of the year and since chemo had knocked me down so much.  I have heard that weekly infusions are supposed to be even easier in terms of potential side effects. Hope it's a breeze for you like I was assured by my MO it would be!",
      "MessageIndex": 482,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 18, 2012 12:09PM CJRT wrote: CJRT- Taxotere, Carboplatin, and Herception every 3 weeks x 6 ( had 3 prior to surgery and just started the final 3 on 1/4) - Followed by Herceptin every 3 weeks for the remainder of the year - followed by Tamoxifin for 5 years ",
      "MessageIndex": 567,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Feb 28, 2012 05:25AM CJRT wrote: Nancy- I've heard many women on here suggest those tape lint rollers for what you are describing.  I haven't tried it myself, though.",
      "MessageIndex": 1459,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jul 11, 2012 07:20PM - edited Jul 11, 2012 08:23PM by CJRT",
      "MessageIndex": 25,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Aug 22, 2013 04:26PM CJRT wrote: After my mastectomy in the hospital bed, the PA says, \"Oh my gosh, you have no hair!\" as she walks in. Yes, that is usually what happens when you have chemo! Wish I would've thought to say, \"Oh no! They took my boobs AND my hair.\"",
      "MessageIndex": 863,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Nov 16, 2015 09:39PM CJRT wrote: 2nd time- if you run into problems with insurance approval, contact Genentech's patient assistance program. They have programs to help both insured and uninsured patients access the Kadcyla. They might be able to help make sure there aren't any additional delays.",
      "MessageIndex": 370,
      "PostDate": "16/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Mar 31, 2016 11:10AM CJRT wrote: Swiss- my platelets drop but always rebound. The lowest they've gotten was just under 92, but even at that level, my gyn onc was perfectly fine with doing my oopherectomy. Mine always seem to rebound to 120 or so just before the next infusion. I do get some muscle and joint pain but it's typically short-lived and just a day or two after my infusion, sort of like what you get with the flu. Nothing like the pain I used to get from neulesta. Hopefully some of the other ladies will weigh in with what might've helped them. Hope your last four go smoothly and easily",
      "MessageIndex": 485,
      "PostDate": "31/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Apr 12, 2016 03:38PM CJRT wrote: Anyone have liver enzymes increase on Kadcyla? I have had out of range ALT and AST for almost 2 years, but things seem to have been increasing more over the past month. Though they are out of range, they aren't super high (still below 70) and everything else in the hepatic panel is normal, but I am very concerned. My doctor feels it is medication related and will retest in another week. I have to admit that I'm panicking.",
      "MessageIndex": 489,
      "PostDate": "12/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 22, 2016 08:35AM - edited Oct 22, 2016 08:36AM by CJRT Denny- sorry you are experiencing the annoyance but hopefully you're staying ahead of any major bleeds. I'll have to get one of those cool mist humidifiers. I significantly increased the application of the saline gel to about 4 times a day instead of twice and have been on (knock on wood) the longest stretch of no significant nosebleeds that I've had in a year. Don't know if it's a a causarive relationship or just coincidental, but I'm not not rocking the boat. 😉 Hope you're feeling good otherwise. I'm just jealous about colder weather... we just have variations of warm in Florida. We traveled through PA this summer! DL3- I was told I'd be on active treatment indefinitely, regardless of clean scans and would remain on kadcyla until treatment failed or my body stopped tolerating it. Hope Kadcyla is effective and easily manageable for you!",
      "MessageIndex": 613,
      "PostDate": "22/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 26, 2016 10:42PM CJRT wrote: I still stay for the 30 minute observation after the infusion.",
      "MessageIndex": 622,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 20, 2017 09:30PM CJRT wrote: Denny- Thanks so much for your response. I was so caught off guard by the comment that it didn’t seem like a side effect people were mentioning with Kadcyla when I know I have heard so many complain and read the percentage with nosebleeds. Thank you for clarifying about the nasal membranes. I think that’s what my ENT originally mentioned, as did my MO’s PA. I was just caught off guard with my MO responding as if it wasn’t a known side effect in the absence of low platelets. I prefer to just live with the nosebleeds rather than go the flat on my back in a nursing home route. 😉 However, I didn’t start my nosebleeds until six months into treatment and just assumed it had taken a while for it to affect me. However I had a hip replacement two days after my first infusion, so perhaps I had some of that lying around benefit initially too. Hadn’t really considered that component. Hope that you’re healing well at home. Thanks again for your response, and have a great weekend",
      "MessageIndex": 1007,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 30, 2015 08:51AM - edited Jan 30, 2015 08:52AM by CJRT I've been in Kadcyla/TDM1 since March of 2013 for a bone met and one metastatic node. As of May of 2013, the only think picked up on scans was the metastatic node, which lingered for a long time but is now less than 8 mm with a low enough uptake value that it is now considered \"inflammatory.\" My tumor markers have been in the normal range since about 3 months after starting Kadcyla. Though my liver enzymes might dance right around the threshold of the high range at times, they are typically normal, and though my platelets occasionally drop, they have never been a cause of clinical concern. I was never given premeds. I cannot recall the specifics of my first infusion, as I had a surgery two days following it. However, since that time, my SE's are fairly predictable. The first night after my infusion I feel drained and a tiny bit woozy. That night, I get a bit chilled. I do have difficulty sleeping for several nights and feel mild increase in inflammation (areas I had surgery, etc.) and experience some fluid retention. The day after the infusion I feel fatigued and sometimes a bit queasy. If I eat through it (like morning sickness), I feel better. I try not to schedule much, if anything, this day. By that evening, the nausea has passed. The following day I might still feel somewhat fatigued but still can manage my normal routine. I frequently get a migraine-like headache for 1-3 days starting around day 4. I have heard weird headaches are a common complaint with Kadcyla, and I even had a brain MRI at a certain point just to be safe. I get help with my 2 young children the day after the infusion, but generally maintain a very normal routine on this drug and an excellent quality of life. For me, it is a dramatic difference from how I fared on traditional chemo the first time around. Wishing all of you newcomers the best of luck with Kadcyla.",
      "MessageIndex": 235,
      "PostDate": "30/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 17, 2015 12:02PM CJRT wrote: I haven't been on the boards in a long time and haven't had a chance to read through it all. Moni- I've been on Kadcyla for 2.5 years and haven't shifted my schedule much during that time. Nothing has been said about delaying it 4 or 5 days when it's fallen on thanksgiving or another long holiday weekend, but I know my MO would have issues with it being delayed more than a week. After the first infusion though, my administration time is only an hour (30 min infusion and 30 min observation) so I can usually do it at the start or end of the day if scheduling is an issue.Any possibility that they can do what's needed at another location? I once was able to arrange for a zoladex shot out of state. Took some legwork on my end, but perhaps it's an option if your MO doesn't want you waiting 7 weeks. Good luck!",
      "MessageIndex": 333,
      "PostDate": "17/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Dec 10, 2015 05:43PM CJRT wrote: Denny- Yes, antibiotic ointment like Bacitracin. I was prescribed Bactriban (Mupirocin). For me, this has really limited the frequency and duration. Nosebleeds are actually listed as side effects, though they are considered less common (10%-29%) according to what I found. chemocare.com/chemotherapy/dru... I've had them sporadically for the past two years, starting about 6 months after starting Kadcyla. Mine are coming from the front part of the nose and consequently attributed more to dryness and capillaries close to the surface, according to my ENT. I actually went to the ENT because I freaked out with the first nosebleed, since I had never had them in the past. He's not as familiar with Kadcyla but had said many patients report chronic runny nose with Herceptin, so it stands to reason patients might get that with Kadcyla, too. He said the chemo agent in Kadcyla might further dry things out, which is why he suggested the saline gel for prevention and the antibiotic ointment for when it is particularly inflamed.",
      "MessageIndex": 408,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Dec 16, 2015 09:06PM CJRT wrote: wow Denny! What a milestone! Thank you for giving hope to us all. Here's to another decade",
      "MessageIndex": 425,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Apr 22, 2016 03:39PM CJRT wrote: ugh so sorry Denny! The irony of your story is that I came back here to see what others are saying about their nosebleeds because I have had one every day for the last 8 days and couldn't get an ENT appointment until Monday morning. I had one this morning and just wound up with a blood clot in my throat (which I've never had) and am very freaked. My bloodwork this week was fine, so my oncologist feels it's an issue for the ENT and not related to my counts. I never had a nosebleed before Kadcyla. I know this is a minor inconvenience, but it's hard not to get scared or frustrated with one more thing to deal with. Hope you get some sleep and the gum issues heals quickly. Will be sending you positive thoughts for relieving PET resukts",
      "MessageIndex": 495,
      "PostDate": "22/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jun 12, 2016 11:18PM CJRT wrote:",
      "MessageIndex": 545,
      "PostDate": "12/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 11, 2016 11:45PM CJRT wrote: Denny- Great news!! I'm with you on the no nose blowing thing. Your April bleed sounds terrifying. I feel like I am uneasy in certain situations thinking I might get one in a place where it would be difficult to address and never go anywhere without tissues. I have focused on not blowing at all... Like it even exhaling strongly if I filled at all stuffy. I've also been using the saline nasal gel at least 3 times a day and more frequently when I feel like I am stuffier or might have a scab. Fingers crossed but I went the last two cycles without!Try more frequent saline gel... Truly has made a difference for me.",
      "MessageIndex": 606,
      "PostDate": "11/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 28, 2016 08:03AM CJRT wrote: margarita- I haven't experienced significant neuropathy but do get some occasional fleeting numbness in feet and tingling or cool sensations a couple days after each infusion. No one has been concerned, and it's mild and remits quickly.",
      "MessageIndex": 627,
      "PostDate": "28/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 16, 2017 09:57PM CJRT wrote: Margarita- hope your biopsy goes well and that you get relieving news soon. I don’t know exactly the number of infusions but probably in the 80’s. I started Kadcyla in 2013. I don’t remember when the dots showedup",
      "MessageIndex": 1000,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Mar 18, 2018 10:13AM - edited Mar 18, 2018 10:14AM by CJRT Denny- Haven't been on in a while but logged on to see how you were doing. So happy to hear about your wonderful treatment response",
      "MessageIndex": 1179,
      "PostDate": "18/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Mar 29, 2014 02:32PM CJRT wrote: Thanks, Kay. I have a friend who happens to be NP at urgent care, so I checked with her. She said they would only treat it if it was causing me problems, so she suggested just calling my MO Monday. I covered it with a waterproof bandaid so it doesn't get rubbed on clothes or wet. I will keep you posted. Thanks for your response and concern.",
      "MessageIndex": 2,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819652",
      "Title": "Zoladex Injection and Worried! CJRT CJRT"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Mar 29, 2014 05:25PM - edited Mar 29, 2014 11:58PM by CJRT",
      "MessageIndex": 4,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819652",
      "Title": "Zoladex Injection and Worried! CJRT CJRT"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "May 29, 2014 09:36PM CJRT wrote: trish- I'm so sorry for the anxiety you are experiencing. Wish I had anything to contribute but although I was warned about liver function abnormalities, I haven't yet experienced them. Hoping you get good, relieving news fast. ",
      "MessageIndex": 91,
      "PostDate": "29/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Aug 3, 2015 02:21PM CJRT wrote: swissRN- I had SBRT to a node while on kadcyla. Because I didn't have a long duration, I didn't notice any side effects at the time. Best of luck!",
      "MessageIndex": 291,
      "PostDate": "03/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 17, 2015 06:25PM CJRT wrote: wow! I had no idea the infusion could be so long. I guess I now see why it's such a scheduling issue! Hope they find a solution quickly!",
      "MessageIndex": 336,
      "PostDate": "17/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jul 8, 2014 08:47PM CJRT wrote: Thanks so much for sharing your experience Smiley!  I get a weird sensation in the leg that is really hard to describe....feels like tightness or stretching.  The fullness you mention also seems to match how I feel.  Mine is slightly noticeable since I have become leaner and more muscular.  Random providers only notice it once I say something. Then they will respond, \"Oh yes, right here\" and then feel the area.  I pointed it out to my MO who just shrugged it off and said the ultrasound was fine.  Mine starts about 2 inches above the ankle and runs about 4-6 inches up the outside.  Honestly, it wasn't even mentioned to me that it could be a side effect.  I directly asked too!",
      "MessageIndex": 13,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822183",
      "Title": "stage 4 zoladex users smiley2 Redheadfriendship"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Dec 16, 2011 02:54PM CJRT wrote: Yay, Kaara! So happy for you!",
      "MessageIndex": 461,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Nov 29, 2011 10:16AM CJRT wrote: Thanks, Paula. It's always uplifting to hear from someone who has been through this before us to give me hope that hopefully one day the worst of this will be behind us and life will return somewhat back to normal. I go for my pre-op appointment today and am already getting anxious about the surgery. Can't wait for this all to be a memory!",
      "MessageIndex": 57,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/777059",
      "Title": "Mastectomy Dec 2011 hawaiik Blessings2011"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Nov 25, 2011 05:48PM CJRT wrote: Hi ladies, I wanted to join your group. I will be having a BMX with immediate recon on 12/2, assuming the hospital confirms the date on Monday. I had neoadj. chemo and found the women in my discussion board to be such a blessing. Though I am sad to find others having to go through this also, I'm glad to find this group, as I know I can use the \"company.\" I will be returning to complete my chemo after the surgery. I have two little ones at home that I worry about but will luckily have a lot of help at home. Though I am dreading the surgery and getting nervous with its approach, I am looking forward to being one step closer to putting the brunt of this cancer treatment behind me.  I hope everyone is enjoying the holiday weekend.",
      "MessageIndex": 38,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/777059",
      "Title": "Mastectomy Dec 2011 hawaiik Blessings2011"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Dec 5, 2011 10:01PM CJRT wrote: Hi all, Had a BMX with immediate recon on Friday afternoon. Could've gone home Saturday but opted to stay in the hospital an extra night. Felt a lot of pain the first 12 or so hours but then felt dramatically better. It has been much better than I anticipated. I went to the plastic surgeon this morning, and he removed 2/4 drains and said everything looked great. The best advice I have gotten on this board and from others was to have someone stay in the hospital with me because there were little things I could've do that first night that would've been annoying to have to wait on nurses for (getting water, etc.) and figuring out sleeping for when I got home (I got a cheap recliner and it's been great). So far, this has been so much better than I anticipated. Best of luck to you all. Let me know if anyone has any immediate questions I can answer.",
      "MessageIndex": 75,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/777059",
      "Title": "Mastectomy Dec 2011 hawaiik Blessings2011"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 17, 2015 07:03PM CJRT wrote: thanks Denny!",
      "MessageIndex": 339,
      "PostDate": "17/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Nov 6, 2015 04:34PM CJRT wrote: hi Julie, best of luck with kadcyla. I've been on it for over 2.5 years and find the side effects very manageable and way better than my previous chemo. I maintain a very good quality of life on this medication, and hope that you find it easy and effective, too",
      "MessageIndex": 351,
      "PostDate": "06/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Apr 12, 2016 08:29PM CJRT wrote: Thanks so much for your response, Miriam. I was referring only to the ALT and AST being elevated for me. Thanks for sharing the other site, too. I haven't been to that one. On one hand, it's great to educate myself; on the other hand, I hate to scare myself with potential side effects that I've yet to experience. Best of luck with Kadcyla.",
      "MessageIndex": 491,
      "PostDate": "12/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Apr 22, 2016 03:44PM CJRT wrote: Denny- I was reading back through and have a similar experience... 6 of my nosebleeds were right after washing my face! I had even used cold water thinking it was the heat that was the issue",
      "MessageIndex": 497,
      "PostDate": "22/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Sep 27, 2016 08:29AM CJRT wrote: Hey Denny (AKA my BB)- The only thing with the Afrin was that I was warned not to use it too much, as it could then exacerbate the problem by excessive drying. My ENT said to do a squirt or two and then pinch off the nostril for 5-10 minutes. He also said some people prefer to squirt it on a cotton ball and put the cotton ball into the end of the nostril and pinch onto the cotton ball. I've only done it twice and it seemed to work very quickly for me. Last night I had a light trickle, but it stopped without pressure. The watery eye thing is so weird to me! I literally have a weird thing going on with my left eye. It's more that it feels like a gravely sensation and frequently but I have never thought to describe it as watery. It's always the LEFT eye! My eye doctor says that it's chronic dry eye and some corneal abrasion that takes place when the eye gets too irritated from the dryness. My right eye always seems fine. About 6 weeks ago I gave in and finally started Restasis drops, which are very expensive, but I had gone through 2 rounds of steroid drops for the inflammation. I never made any connection to the nosebleeds. So strange!",
      "MessageIndex": 600,
      "PostDate": "27/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 26, 2016 10:16AM CJRT wrote: I started with about every three months and now my MO is stretching it out to about five months",
      "MessageIndex": 619,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Nov 23, 2016 08:22AM CJRT wrote: escorpion- I hope that kadcyla is very effective and manageable for you. Pwilmarth and Denny already provided great information, so I will just add my personal experience. Because I was triple positive and was diagnosed with metastasis while on tamoxifen after having been early stage, I was put on kadcyla and was told I needed to shut down my ovaries. So I had zoladex shots for ovarian suppression until I had my oopherectomy. Because I was relatively young and my cancer was aggressive, we made the decision to target both the estrogen and HER2. I've be been kadcyla for 3 years and 9 months and have found it very manageable thus far. At this point, despite a stretch of NED, I will remain on active treatment indefinitely",
      "MessageIndex": 659,
      "PostDate": "23/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 21, 2017 09:37AM CJRT wrote: Denny - I might have been the one who told that little trick to stop them after learning it from my ENT. I just had the frequency increase and the comment by my MO left me questioning things after. I’m using saline gel all the time but looking for anything else that might help with prevention. Thanks again!",
      "MessageIndex": 1009,
      "PostDate": "21/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 22, 2017 09:53PM CJRT wrote: Flu shots while on Kadcyla? My MO doesn't have a preference. What has been recommended to you ladies?",
      "MessageIndex": 1010,
      "PostDate": "22/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jan 7, 2018 12:58AM CJRT wrote: haven’t checked in in a while, but wishing all of you a happy and healthy new year!  Denny- Sending positive vibes your way, and hoping the clinical trial brings great results with minimal side effects. Will be thinking of you",
      "MessageIndex": 1091,
      "PostDate": "07/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Apr 3, 2018 03:50AM - edited Apr 3, 2018 03:52AM by CJRT I realize this is a ridiculous complaint in the scheme of things, but I went from never having a cavity until cancer treatment to having one (or 4!) every time we take an X-ray. I get cleanings every 6 months and try to maintain better oral hygiene than I ever have in the past, but I still just found out I have a cavity that needs filling on a tooth that has a filling at the gum line from erosion. The dentist mentioned that I might need a crown if I have another issue with the tooth. I have to go back for a regular filling, which hopefully takes care of the issue. It's particularly annoying to me because I have to premedicate with antibiotics prior to dental cleaning/work. Anyone else have this problem and gotten any helpful recommendations to combat tooth issues? My chemo brain is blanking on the types of dentist that I read people on cancer treatment sometimes see- is it a biologic dentist? Chemo/radtioj/surgeries and I am tough but then almost left the dentist in tears.Any advice welcome!!",
      "MessageIndex": 1187,
      "PostDate": "03/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 17, 2015 06:27PM CJRT wrote: Denny- at what point did they drop off the observation period for you? The nurses at my site said it seems like there wasn't a long term recommendation of how long they should continue to make you wait after.",
      "MessageIndex": 337,
      "PostDate": "17/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Nov 5, 2015 10:52AM CJRT wrote: I actually have had ongoing issues with a bloody nose since being on kadcyla and have even gone to an ENT. He attributes it to the medication and the constant runny nose. My blood counts have always been good",
      "MessageIndex": 347,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Dec 10, 2015 05:46PM CJRT wrote: Just realized I spelled the name of the saline gel wrong. It's actually AYR. The ENT just said gel products are more effective than the sprays for dryness. I don't know that there is anything special about brand. He just gave me samples.",
      "MessageIndex": 409,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jun 12, 2016 09:41PM - edited Jun 12, 2016 09:43PM by CJRT Denny- I have a friend that's on Herceptin, Perjeta, and Navelbine with a good results and quality of life. I also read somewhere that Perjeta could be added to Kadcyla. I can't remember where I saw it or if it was a clinical trial. I had it in my notes for \"down the pipeline when this drug fails me",
      "MessageIndex": 541,
      "PostDate": "12/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jun 12, 2016 10:24PM CJRT wrote: Good luck, Denise! Let me know if you come up with any good cocktails for me to add to my list too. 😉 I read some research about Ibrance possibly being an option for Her2+ ladies as well",
      "MessageIndex": 543,
      "PostDate": "12/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Sep 21, 2016 05:06PM CJRT wrote: Denny, you are me both with the stupid nosebleeds! I know it is a minor side effect to complain about, but I can't find any real pattern to mine either. I've gotten them when my platelets were almost normal, and then not gotten them when my platelets fell below 100. It's nerve-racking to wonder when it's just going to start out of the blue. I was at something for my daughter, and all of a sudden my nose just started bleeding so quickly that it was all over my shirt. Luckily I had a change of clothes in the car. I've changed some of my exercise routine, and I'm now very careful to never blow my nose, despite always having a runny nose. There were two weeks straight that I got a nosebleed that wouldn't stop within 10 or 15 minutes. I had it cauterized, only to start getting nosebleeds again later the same day.",
      "MessageIndex": 596,
      "PostDate": "21/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Sep 23, 2016 08:35AM CJRT wrote: Ha! Denny, my booger buddy. So funny!! I'm just like you-- only one nostril!! Always the right side. Together we can have a functioning nose!! My ENT says that I have a deviated septum and that forces more air out of the one side. He said it's a medication issue and not a platelet issue. I live on saline nasal gel and literally never blow my nose. I haven't taken anything with ibuprofen since my original cancer diagnosis over five years ago, so it's not anything related to that for me either. I've been on kadcyla for 3.5 years, and my first nosebleed was 6 months in. Originally I'd get them for 2-3 days every other cycle or so and never was severe enough for the ENT to do anything. About six months ago I started getting them nearly daily, and I then have had two cauterizations. I've had a couple stretches of 2-3 weeks without one, but I literally don't go anywhere without tissues and some Afrin (which ENT said would stop one quickly if I can't get it to stop). What have your doctors said about yours",
      "MessageIndex": 598,
      "PostDate": "23/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Aug 26, 2017 01:31AM CJRT wrote: Denny- glad you can stay the course on Kadcyka but sorry your injuries are taking so long to heal. I know how frustrating physical therapy can feel but hope the end results make it feel worthwhile, like it did when I had to go.Sending you healing vibes!",
      "MessageIndex": 967,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 20, 2017 02:57PM CJRT wrote: Denny - my nosebleeds are rearing their ugly head again. How have yours been? Any tips or patterns you’ve noticed? Since my are only from one side, my MO now seems reluctant to attribute them to the Kadcyla, though two ENTs say they are related (and blame my slight deviated septum with it being one-sided).",
      "MessageIndex": 1005,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 23, 2017 07:13AM CJRT wrote: Thanks, Fran! Good luck Thursday. Have a good week",
      "MessageIndex": 1012,
      "PostDate": "23/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Apr 3, 2018 05:55AM CJRT wrote: Thank you, Denny! For some reason stress and exhaustion have led to this being the proverbial straw that broke the camel’s back. Didn’t help that I got a huge nail in my tire leaving the dentist attempting to drive my car to the dealer to get the AC fixed. I think I need to use the biotene more frequently, as I had used it more for comfort rather than preventative for the dry mouth leading to cavities. Thanks for sharing your experience",
      "MessageIndex": 1191,
      "PostDate": "03/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Mar 28, 2014 09:17PM CJRT wrote: I've been on it for a year. Initially had met on my femur and metastatic node. Node has decreased in size and uptake, hip is clear following radiation and partial hip replacement, and no new areas of disease. Only numbers that have been off have been low potassium. I've had an excellent quality of life on the medication with 2 days of fatigue, one worse than the other, and some increased headaches for a day or two. If I was on my own, I'd just take it easy. However, because I have two young kids, I have help with them for 2-3 days. Best of luck to you!",
      "MessageIndex": 51,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Aug 7, 2014 12:28PM - edited Aug 7, 2014 12:29PM by CJRT fabulous news kite!!!",
      "MessageIndex": 149,
      "PostDate": "07/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jul 8, 2014 07:05PM CJRT wrote: This is so weird! I stumbled on this after searching for Zoladex because I wanted to ask a question about scheduling a vacation while on Zoladex. (I will be getting infusion 10 days late and it makes me very uneasy!) But, I have the lower leg swelling thing!! I have had it intermittently for a very long time. Initially it was attributed to swelling draining down from my hip replacement, but it's been over a year since I had the hip replaced. I have no ankle or foot swelling. Just the outer part of my lower leg/side of calf area.  Two months ago they sent me for an ultrasound to make sure it wasn't a DVT. I have yet to get an answer other than it's not cancer and it shouldn't be related to the medication!",
      "MessageIndex": 10,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822183",
      "Title": "stage 4 zoladex users smiley2 Redheadfriendship"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jul 8, 2014 07:07PM CJRT wrote: Excuse me for hijacking your thread Smiley, but since you've been on it for this long, I was wondering if you have ever delayed your regular 28-day schedule. I don't know if I should drive myself crazy looking to get it somewhere on my trip or just get it 10 days late. I happen to know a doctor where I'll be traveling, but my MO said this was not the type of medication you can just pick up at a regular pharmacy.",
      "MessageIndex": 11,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822183",
      "Title": "stage 4 zoladex users smiley2 Redheadfriendship"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Dec 6, 2011 02:57AM CJRT wrote: Hi Ladies- Just had a BMX with immediate recon with TE's Friday afternoon. Got out of the hospital yesterday. Actually could've opted to get out one day earlier (so only have stayed one night instead of two) but decided one more night in the hospital might give me some extra rest since I have 2 kids  and under the age of 3 at home. Feeling better than I expected and got 2 of my 4 drains out today. The PS said everything looked good today, so I have another follow up in a week. There was bad pain the first 12 hours but things got much better quickly. If you wake up and think, what the heck did I do, don't get discouraged. Things improved so much quicker than I thought possible.  I am so pleased thus far, as my anticipation was so much worse than the reality. Good luck to everyone!",
      "MessageIndex": 212,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Dec 15, 2011 02:58AM CJRT wrote: Kaara- Hope your results come back good! I haven't been on in a while, but noticed your from my neck of the woods. I had my surgery last Friday. Hoping we will get a shot of cool weather down here soon.  I have to start chemo in January and will be trying to avoid germs, so it would be great to have some cooler weather so I can get outside to enjoy some socializing.",
      "MessageIndex": 417,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Nov 29, 2011 03:57PM CJRT wrote: Hi everyone, I've done some neoadj. chemo (though I have to return to chemo post-surgery) and found my other discussion board so helpful. I am having BMX with immediate recon this Friday. I am getting anxious just typing it! I wish everyone the best of luck, and it's great to hear from those who have been through it and remind us that this part will one day be beyind us also.",
      "MessageIndex": 79,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Nov 29, 2011 10:43PM CJRT wrote: kblack- I don't have any advice to give at this point since I haven't had my surgery yet, but I can relate to wanting to be aggressive, especially being young with young children.  I just turned 34 and have a 6 month old and a 3 1/2 year old.  I did some chemo before and have to return to chemo after.  Though it's hard having young kids and going through this, plus the lifting restrictions, I am comforted that they won't remember this into the future.",
      "MessageIndex": 84,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "May 15, 2014 08:41AM CJRT wrote: Sorry it's been a while so I just quickly skimmed through things but wanted to respond to Chiquita. Chiquita- I know the moderators already shared a great link with you. I happen to have been part of a patient advisory board at Genentech (the company that makes Kadcyla) and was part of a presentation in which they shared information about their financial assistance programs for the medication without insurance or when you have high copays. Luckily insurance covers mine (with the exception of my out of pocket responsibility.) If your treatment center can't help you fill out their forms, contact Genentech directly.  Here is the information from their site: http://www.genentech-access.com/kadcyla/hcp/find-patient-assistance tc- I'm sorry you are facing a possible treatment change. I had experienced a decrease in tumor markers to normal range and stable disease for about 9 months on Kadcyla when FINALLY I saw some regression on my last PET in February. I'm anxious to see what my next one holds. I have been on Kadcyla for a little over a year. The side effects are sometimes annoying but so much better than chemo for me. I will say that I've had a significant increase in migraine headaches (despite a recent normal brain MRI) and weird nerve-like things that aren't the standard neuropathy.  Other very minor problems for me include a rash after the infusion (I don't get premeds), some fatigue and feeling weak, some muscle or ligament pain, runny and bloody nose, chronic dry eye, and an enlarged reactive node in the back of my head following every treatment. Overall, I find it extremely tolerable, and it allows me to live as \"normally\" as possible and keep up with my two young children. I am praying that I can remain on this for a long, long time. Wishing everyone the best...",
      "MessageIndex": 79,
      "PostDate": "15/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jun 3, 2014 10:37AM CJRT wrote: Hi Kite- I am Er+ so I started taking Tamoxifen after my initial chemo and then Zoladex with my mets. I had just had a baby about 12 weeks before starting TCH at the time of my initial diagnosis and can tell you I got horrible hot flashes with the chemo and temporary cessation of my cycles.  (Not sure if this was the chemo or postpartum) My cycles returned after the chemo until I started Zoladex.  My hot flashes with Tamoxifen and Zoladex were much less in intensity and frequency that I had had on chemo. You have many more options related to the sexual side effects, as gritgirl mentioned. If the over the counter things don't help, I know a friend's MO prescribed her an estrogen cream and even discussed hormone therapies with her if the menopause symptoms remain and are problematic for her. My MO suggested over the counter Primrose Oil for hot flashes and low dose Effexor if it really bothered me.  Good luck on Kadcyla!  For me, it is a breeze compared to my TCH (Taxotere/Carbo/Herceptin).",
      "MessageIndex": 100,
      "PostDate": "03/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jun 3, 2014 09:37PM CJRT wrote: Denny and Kite- I certainly didn't mean to imply for Kite to try anything without consulting her MO first.  Sorry if it came across that way.  I was just sharing what mine had recommended.  As far as the estrogen-like properties, Kite indicated that she was not estrogen positive so the typical estrogen precautions don't apply to her.  However, in the research that I have done, I have not found anything to suggest that primrose oil has estrogen-like properties like soy and black cohash do.  If you happen to know any research that links primrose oil to estrogen, can you please forward it to me.  Though I don't take it myself, I have several friends with estrogen-positive cancer that do, and they'd be very interested in learning more.",
      "MessageIndex": 102,
      "PostDate": "03/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "CJRT wrote: This Post was deleted by CJRT. Dx 7/15/2011, IDC, 3cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2+ Dx 2/2013, IDC, Stage IV, Grade 2, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819652",
      "Title": "Zoladex Injection and Worried! CJRT CJRT"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Dec 10, 2015 04:38PM CJRT wrote: Wleeky - I've been on Kadcyla for over 2.5 years and have maintained a good quality of life, thus far. WAY easier for me than my Carbo, Taxotere, and Herceptin combo. It's also rather predictable to me when I'll be feeling queasy and fatigued, so I scheduled my days accordingly. I hope that Kadcyla brings you good results and that the side effects are very manageable.  Denny - I've intermittently gotten nosebleeds as well, despite blood counts not being overly concerning (platelets dip at times but have never dropped below 100). I went to an ENT twice, who was not concerned. He blames it on Kadcyla. I also have a runny nose much of the time...like a water-type drip. He recommended Azyr (sp?) saline gel to prevent it and using an antibiotic ointment in my affected nostril (always same side) twice a day for 7 days when the nosebleeds flair up.",
      "MessageIndex": 406,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 23, 2016 10:49PM CJRT wrote: DL3 - I've been on it for 3 and a half years",
      "MessageIndex": 615,
      "PostDate": "23/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jun 27, 2017 06:07PM CJRT wrote: Oh Denny, my nosebleed twin... I haven't been on in several months and stumbled back on today to catch up on the older posts. I'm so very sorry for all that you've been through recently!! I hope that you heal quickly and feel better emotionally now that you have a bit more freedom to get out of the house. I'm hoping you're feeling more comfortable and that your rehab is progressing well. Sending hugs! gramen- I get an itchy rash on my neck and back most infusion cycles. I have seen a dermatologist, my MO, and my RO...and all attributed to the Kadcyla. The dermatologist said I can alternate a topical steroid cream when it gets worse and also gave me an Rx for a topical antibiotic at one point because she said I had developed folliculitis because of the irritation.",
      "MessageIndex": 941,
      "PostDate": "27/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jun 27, 2017 06:17PM - edited Jun 27, 2017 06:18PM by CJRT gramen - I just saw your other post. I have been on Kadcyla without any breaks since March of 2013....so a little over 70 infusions, if my math serves me ;). My PET scans have been clear for nearly the past 2 years. Generally this medication has allowed me a great quality of life. The night of the infusion I am a little light-headed, mildly achy, and chilled. The following day I feel a bit queasy and fatigued. I occasionally get a headache on the 4th or 5th day, and I frequently have a runny nose. I try not to schedule anything the day after the infusion, but otherwise haven't changed any activities. I have experienced some mildly elevated liver enzymes and low platelets. Otherwise, my primary complaint is my nosebleeds. They began about 6 months after starting Kadcyla, and I can get several in one week to then months without. The unpredictability of it is very stressful (and embarrassing), and although I'm very proactive about it (not blowing my nose, using saline gel, etc.), I still have to see the ENT once or twice a year for a cauterization. Hoping Kadcyla serves you well!!",
      "MessageIndex": 942,
      "PostDate": "27/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Aug 26, 2017 01:26AM CJRT wrote:",
      "MessageIndex": 966,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Oct 13, 2017 04:23PM CJRT wrote: Magarita - Funny you mention capilitaritis, as I have tiny bright red dots, mainly across my abdomen. My MO and dermatologist say it's normal and are not the least bit concerned. I also get nosebleeds on Kadcyla and had found some rare bleeding condition that could have broken similar spots, along with nosebleeds, and mentioned it to my ENT (since apparently this rare disorder is usually first diagnosed by ENT's); he said I did not have the disorder and echoed the lack of concern of the other two doctors. My platelets also fall but not too low and don't stay there for too long. I've just added the red dots to the list of weird, innocuous issues I attribute to the Kadcyla. ;)",
      "MessageIndex": 995,
      "PostDate": "13/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Jun 7, 2018 08:12AM CJRT wrote: escorpion- I didn’t see your whole history about the node radiation, but wanted to respond to your question. I had a metastatic node that was either reactive or not responding to treatment. One treatment center wanted to do nothing, another wanted surgery and radiation (difficult surgery with high potential for complications), and my own center suggested radiation alone before newer research suggested that as a viable option. Had one dose of SBRT with curative intent in April of 2015. The node no longer lit up on the 3 PET scans since I had it. Hope yours ls smooth and effective with little collateral damage!",
      "MessageIndex": 1223,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "May 16, 2014 01:17PM - edited May 16, 2014 01:19PM by CJRT Tcallegan- I have a dear friend in her 30s who has been on navelbine since last may for liver mets. she has tolerated treatment very well (still works full time and exercises) and has experienced either slight regression or stability every 60-day scan.  Thanks memaw sue! Glad your headaches are easing. Hope you continue to feel well.",
      "MessageIndex": 83,
      "PostDate": "16/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Aug 21, 2013 05:24PM CJRT wrote: Sending positive thoughts your way.... Hugs",
      "MessageIndex": 20,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809627",
      "Title": "PET scan tomorrow brandall meima-Bev"
    },
    {
      "AuthorID": "CJRT",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134922/profile",
      "Content": "Apr 28, 2012 07:18PM CJRT wrote: I'm from South Florida and finished up chemo a couple of months ago. Hope you are holding up well. I know how rough it was for me and how great it was for me to find a board with others who really understood.  Good luck!",
      "MessageIndex": 1,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/784414",
      "Title": "Floridians + Chemotherapy Didapper CJRT"
    }
  ]
}