{
  "AuthorID": "ckk",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
  "Posts": [
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 6, 2011 03:56AM ckk wrote: I was at Faulkner with Dr. Dominici. Good experience, great surgeon.",
      "MessageIndex": 7,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/778892",
      "Title": "MGH or Faulkner in Massachusetts AugustSun ckk"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 9, 2011 04:22PM ckk wrote: I share this experience! For several months prior to dx, I was incredibly tired, so tired that I went for a checkup and blood work. The tiredness was far more profound and differnt than any I had experienced before. My doctor attributed it to low levels of Vitamin D and put me on D3. Some improvement, but not much. Then in October, I found my lump. When I recently mentioned this period of exhaustion to my oncologist, she told me that she hears this all of the time from her BC patients. That it's not documented in any of the literature, but she's heard it enough from women to see a pattern. Perhaps it's from the tumor seeking blood supply and nourishment as it grows?",
      "MessageIndex": 19,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/778724",
      "Title": "Anyone have problems with fatigue prior to diagnosis? cfdr dlj140"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 10, 2011 07:09PM ckk wrote: cfdr, I guess the voices and experiences of women who have felt this mean nothing until a study is done, right? :-)",
      "MessageIndex": 22,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/778724",
      "Title": "Anyone have problems with fatigue prior to diagnosis? cfdr dlj140"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 6, 2011 03:39AM ckk wrote: Hi all. I will be starting TC on December 22. I'm using the Cold caps, and would be interested to know if anyone else here is using them. I'm trying to stay positive and look at this as a long ter investment in wellness, but it's hard and I'm scared. Is anyone else fighting post-lumpectomy fatigue? I'm three weeks past surgery and still feel like I've been kicked on my a**. This, despite woking out every day for years. I am hoping to keep up at the gym with weights and cardio as I feel able. Thanks to all of you for sharing your experiences. It does really help!",
      "MessageIndex": 100,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 8, 2011 06:40AM ckk wrote: Mercy, I have not yet begun chemo (will start TC x 4 on 12/22), but I have very mixed feelings about it also. The two oncologists that I spoke with both thought that it was warranted as an insurance policy given the grade of my tumor and LVI status - this despite stage 1 and node negative. That being said, my Oncotype score is due back at the end of the week, and if it is mid-range or high, then I will feel settled in the chemo decision. All bets are off if the Onco score is very low. I will have to have a long talk with my oncologist if that is true. Have you had the oncotype test done? Did you get another opinion on the adjuvant therapy plan? Remember, you are the captain of this ship!",
      "MessageIndex": 115,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 9, 2011 12:01AM ckk wrote: WaveWhisperer...welcome. Looks like we are on the same train leaving the station pretty much at the same time, lol. My Onc told me that the first few days after T/C I will feel good, and then bottom out at about day 7. It sounds like you'll be ok for Christmas eve, but if it were me I'd do the WF route. Since it's your first one it's hard to know how you'll react, so letting someone else do the cooking is probably good. I have told my family that it's going to be a simple year holiday-wise, and they're in charge of the decorating etc. They seemed fine with that, and thank goodness that I have older kids. I had always made such a big deal of the holidays before this year but it seems so much better right now to back off and relax. Have you thought about asking another family member to host your Xmas eve dinner? I have a similar tumor profile to you and the two Oncs that I consulted both recommended chemo. My oncotype score is due back tomorrow, but I have decided to go ahead with the chemo regardless of the results. It took awhile to get here. I was so scared of chemo, but I am now looking at it as my personal insurance policy and a way for me to feel more relaxed moving forward that I have dome everything that I can to avoid recurrence. It's only a few weeks of my life, and I will get through it! It's been enormously helpful to read other women's stories here. I also got in touch with the ACS Reach for Recovery people, and was contacted yesterday by a woman diagnosed 8 years ago with almost the exact same profile, age, etc who did chemo. She's doing great, no recurrence. It felt so good to hear her success story and derive hope from it. ",
      "MessageIndex": 123,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 9, 2011 09:44PM ckk wrote: kimdy, GOOD LUCK! I hope that all goes well for you today! Please let us know how it went. LeesaAnn, I hope that you're feeling better today. It sounds like your docs are responsive and on top of things. I got my Oncotype score yesterday...29, so high mid-range. The oncologist was pretty much expecting that kind of score given my grade 3 tumor. On the plus side, it means that I will most probably derive benefit from chemo.It certainly settles in my mind the fact that I need to do this! So, on with the freight train. Did any of you catch this news story about early stage breast cancer patients who took Zometa that saw far less recurrence?  http://www.washingtonpost.com/business/treatment-surprise-bone-drug-boosts-survival-in-younger-breast-cancer-patients-study-finds/2011/12/08/gIQAXxgGgO_story.html",
      "MessageIndex": 139,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 21, 2011 05:38AM ckk wrote: Lisa, I'm glad that the nurses were so responsive to your reaction and got you better so quickly. I can't imagine how scared you must have been. You look great in the cap! That will be me tomorrow.Didyou also try moleskin? Just curious if you thought one worked better than another. Annie, good luck today. Robin, Wave, glad that all went well. Josie, I hope that you did ok. Rachel, I hope that you're feeling better. Tomorrow is round one for me. I'm using the cold caps and nervous about how I'll do with them. My family is coming along to help so hopefully all will go well.",
      "MessageIndex": 265,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 27, 2011 07:54AM ckk wrote:",
      "MessageIndex": 335,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 11, 2012 01:00AM ckk wrote: Hi all..just checking in. I have treatment #2 on Thursday. I am feeling good right now and dreading the yuks to come. I wish this was over. Lisa, Heather, and Annie, good luck to both of you. Robin, good for you - glad it went well! I too hired a cleaning person - she started last week. I really resisted but after what I went through on round 1, it just made sense. I'm so glad that I did - the house is sparkling clean and now I don't have to worry. Courage to all.  ",
      "MessageIndex": 565,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 16, 2012 01:42PM ckk wrote: I guess that I'm officially in the sick and tired of being sick and tired club. I feel like crap today - exhausted, no taste, mouth feels burned, UGH. I get bursts of energy for a few minutes, and then get completely exhausted as soon as I move around. Looks like the chair and knitting are my best option. Momof3boys - glad you're feeling good, and that back labor analogy is scary.  Heatherb8- keeping my fingers crossed that everything is going well for you. This place is a blessing - who else can understand what we go through? I am grateful to all of you for your stories, they make me feel less alone at a time that I feel terrible.",
      "MessageIndex": 629,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 19, 2012 10:29PM ckk wrote: Bailey and Momof3, I'll be thinking of you all day and hope that your infusions go well. Regarding bitchiness: I'm really bitchy in general these days. My patience has left the building with everyone except my kids. I'm interpreting it as overload - too much stress, too much discomfort, too much fear. There's only so much one person can handle at once. I know that the people around me are surprised, because that's just not me. But this is short lived, I guess.They'll live and maybe learn something about compassion. I don't buy into the \"big pharma is blocking a cure\" stuff. There's just too many countries and universities doing research, too many people with their hands on breast cancer research to keep a cure under wraps. I just think that cancer is a very complicated disease (set of diseases, really) that we don't understand yet. If you look on this board, you see a variety of different cancers that are all called breast cancer - IDC, ILC, DCIS, etc, and then different hormone receptor statuses. I know that the approach to BC care keeps changing dramatically because of research. Many of us would have received Adriamycin just a few years ago, but do not now because of studies that show Taxotere is just as effective with fewer long term risks.  This is day 7 for me, so theoretically my lowest count day. I am hoping that it's all better from here. I still have heart pounding and extreme fatigue. I'm going to lay low today, maybe make some bread and work from home. My vein is still red but seems less sore today, which is good. Hugs to all! This is my favorite spot on the Internet, gals. ",
      "MessageIndex": 678,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 20, 2012 12:53AM ckk wrote: Wave, here's an interesting article on emerging cancer therapies: http://www.thedailybeast.com/newsweek/2010/09/07/what-we-can-learn-from-curable-cancers.html It seems to indicate that thinking about how to fight cancer is changing. ",
      "MessageIndex": 681,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 28, 2012 10:28PM ckk wrote: Happy weekend all! I pretty much threw the kitchen sink at my neuropathy symptoms over the last couple of days - went to the chiropractor, who said that misalignment can exacerbate neuropathy symptoms, and also had acupuncture. The AC gave me a Vitamin B12 shot too. The nurse in the MO office also suggested keeping my hands and feet warm (it's cold here) and wearing slippers around the house to cushion my feet. I do feel much better today; the tingling has stopped. I am feeling pretty normal - worked out yesterday, did errands. I guess that I'll spend the next few days before #3 cooking ahead and trying to feel normal before the next tidal wave. Gracie-I have gained a bit of weight also, and my MO also said that it's from the Taxotere and should resolve after treatment ends. Yet another \"gift\" of chemo, ugh. momof3boys- I'm so sorry that you're feeling lousy. I also felt tired more quickly after no. 2. I just roll my eyes when people want to high-five me for being half way there. Really? Sometimes I think that it's worse being here because we KNOW what's ahead - more crud. rachel- I hear you about the chemo brain! I have major short term memory loss, and sometimes I can't find the right word to say. It's very frustrating, and yes, at times embarrassing. Hang in there, because I understand that it resolves pretty quickly after chemo (within a few months). Annie- we're with you, and understand the \"I look okay on the outside but I'm a hot mess on the inside\" stuff. If I hear one more person say how great I'm doing and how \"inspirational\" I am, I'm gonna lose it. You're right, this is the place to vent and swear and cry and bitch. Cancer sucks, dammit, and this ordeal is one that no one can understand unless they've lived it. Lisa- my cold cap buddy - using these things is a double-edged sword. We did it because we want to retain our privacy and some normalcy during cancer treatment, but the down side is that people tend to think of us as not going through much of anything. I think that it's very tough for people to acknowledge other people's pain - it's scary and uncomfortable - and we help them avoid that discomfort by not obviously looking like a cancer patient. But the SEs are just as bad, and we're suffering just as much. I know that you can sail through this last treatment with flying colors! You're a cold cap champ by now,and probably the first CC user at your infusion center, which means that you've given other women a gift of knowledge through showing  the nurses and doctors your success. heatherb8 and Madison - almost done! I can't wait until we're all on the other side and checking in to say hi. I hope that everyone has a good weekend, and thank you all again for the wonderful support here. This place is my haven and my life line.",
      "MessageIndex": 804,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 28, 2012 10:43PM ckk wrote:",
      "MessageIndex": 805,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 29, 2012 12:47AM ckk wrote: Wave, Zofran & Compazine aren't steroids, they're anti nausea meds that work by blocking the body's response (correct me if I'm wrong, ladies). It's interesting seeing the different med approaches taken by MOs to the same chemo regimen (TC). I don't have the Neulasta shot, but I see that others get it as a matter of course. I have TC #3 this week too, and can relate to your cloud analogy. Ugh.",
      "MessageIndex": 812,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 31, 2012 10:56PM ckk wrote: Lisa, good luck today! Wave, hang in there, it's #3 for me too this week - we can do it! Annie, good luck tomorrow! Hope everyone is well!",
      "MessageIndex": 854,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 1, 2012 08:42AM ckk wrote: Facebook group is up and running with three members - it's secret, so no one will see that you belong or any of your posts. PM me with your FB name if you want to join...",
      "MessageIndex": 874,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 1, 2012 08:15PM ckk wrote: Hey all.. Facebook page is up & running, and there's 6 of us there as of now. If you want to join, please PM me your FB name and I'll friend request, then add you when you accept. I'm making all of us admins in case we want to upload things to the page. Again, it's secret, so no one will see your posts or even that you belong except other members. Come on down! Annie- yay, done!! Hoping that you have an easy night and a good day tomorrow. Lisa- Did you mention the discharge to the doctor? Weren't you on antibiotics awhile back? Maybe it's connected to that (you know, killing off the good bacteria, etc.  Gracie - So glad that you're better- hang in there! I've gained more weight than I'm happy with. Maybe we should start a weight loss challenge after all of this, lol. (oh, I might be serious) Wave- I agree, talk to the MO about the neuropathy. Mine wanted to know right away when I started to have symptoms. I went to the acupuncturist, I take a complex B vitamin daily, and the AC gave me a B12 shot last week. That seemed to make the symptoms go away. Are you icing hands and feet during the Taxotere portion? My MO told me that if my symptoms didn't subside, she was going to cut my dose a bit next time. Robin - Hope that your SEs diminish. I discovered a good chemo brain treatment today - caffeine! Seriously, it helped lift the fog today. I usually make half-decaf, but today it was full strength, and my word retrieval skills have returned. Whew.  Ok, ladies, I'm next in the chair..tomorrow is #3. Hope I get some sleep tonight, ugh.",
      "MessageIndex": 882,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 4, 2012 11:16PM ckk wrote: Good morning, everyone! Day 2 post TC3 for me.I did get to the party last night, and it was nice to see everyone. I was surprised at how glad everyone was to see me, and felt a bit uncomfortable with the attention, honestly. I don't feel up to speed mentally (damn chemo brain), so it feels awkward when I'm processing things a bit more slowly. Do any of you feel awkward in crowds right now? My mouth is starting to go south; it's sore and uncomfortable, so back to the salt/baking soda rinses and olive oil swishes. I've been having hot flashes to beat the band, and my MO suggested Vitamin E & C supplements to alleviate symptoms. Has anyone else used those successfully?   Regarding paraben free personal care: I like to consult the EWG web site to look at ingredients, www.ewg.org/skindeep. I use Suki and Sea Chi Organics cleansers and moisturizers on my face (Sea Chi has 30% off on all products online thru today with the word BEAUTIFUL in the promo code line), Mineral makeup (check ingredients before you buy, I use Bare Escentuals). For general body moisturizing, I use Aveeno(most of their products are paraben-free, but check the label), both the moisturizer and bath oil. If you have a good naturopathic pharmacy or a Whole Foods nearby, those are good places to find products. Also, Sephora carries a few natural makeup brands - just ask at your local store. The products are more expensive, but so are cancer treatments, right? Annie, I know exactly how you feel about seeing every pain as cancer. It's one of those things that we'll have to learn how to deal with, and I'm guessing that it will fade somewhat over time and as we feel better physically. I'm so glad that your ultrasound was clear! Gracie, you are right, we women have been informing and empowering each other forever. Our docs are not always up to speed on latest info, or want to rely on multiple studies before passing things along, but there have been many instances of sounding the alarm to each other. Thank goodness for this board - most of the holistic approaches that I rely upon to feel better have come from all of you. Rachel, I hope that you can get some rest this weekend! Lisa, f*%k cancer is my daily mantra. Here's a treat for you: www.zazzle.co/fuck+cancer+gifts    :-)   Go crazy, girl! Wave, how are you? Is the neuropathy completely gone? Good luck with the AC on Monday, it really has helped me. I also get a B12 shot when I'm there. Madison, I hope that your bone pain is better today. A quiet weekend is planned for me, too - No Superbowl parties. I'm smack in the middle of Patriots country here, and would have had a crowd on Sunday, but not this year. Just the thought of chili, wings, and potato skins makes me ill. lol. I appreciate all of you! We're up to 11 on the FB page. PM me your Facebook page if you want to join us!",
      "MessageIndex": 914,
      "PostDate": "04/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 5, 2012 11:29PM ckk wrote: Rachel, I finally found your letter on BCO (sorry, chemo brain), and was so touched by it. It made me teary. I think that you put into words our experience so well, thank you. Annie, how are you today? Erica, I'm so sorry to hear about your infection. How are you feeling today? I hope that your appointment goes well tomorrow and that you can avoid surgery if possible. BTW, I wash my makeup brushes with antibac soap, and then let them air dry thoroughly. Gracie, lemon instead of chemo?? Sign me up! lolol heatherb8, I have to confess that I've been a health nut since the melanoma episode 12 years ago. So, when I found out that my tumor was so strongly ER+, I had a conversation about estrogen mimicking foods with every doc I saw. Here's what I took away from it: the jury is still out because of conflicting study results, so until there's more concrete evidence for us ER+ gals, better to be safe than sorry and avoid high soy containing foods .So that's what I'm doing. For me it's control. I just have to feel like I'm doing something to avoid seeing this cancer monster again. The freight train has hit hard today. I feel like I'm walking through setting concrete, ugh. Mouth is sore, heart is racing, here we go again. Chemo zombie day.  Hope all of you are ok and hanging in there. We're up to 12 on FB!  PM me if you want join.",
      "MessageIndex": 941,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 7, 2012 10:28PM ckk wrote: Good morning..looks like I'm following everyone else's lead. Round 3 has roughed me up lots more than the previous two. I feel like CRAP. Exhausted, achy, mouth is in ruins, stomach a mess, heart is racing. I woke up in the middle of the night with intense hot flashes, thought I was going to pass out, and seriously considered a trip to the ER. It settled back after a half hour and I was able to rest, but man, it was rough.  Erica, good luck today.  Karen, welcome. PM me with your FB name if you want to join our FB group. Hope everyone hangs in there today.",
      "MessageIndex": 982,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 9, 2012 11:30PM ckk wrote: Bailey, thinking of you. Good luck today! Josie, I will be getting both breast MRI and mammograms, alternating every 6 months, after this is done. My MO said that I have to wait 12 weeks after radiation to have any breast imaging, since the tissue doesn't look \"right\" after radiation on films. Rachel, good luck at your derm appt tomorrow, and I hope that everything is ok. Melanoma is 100% curable when caught early, and it sounds like you're really on top of it.Thinking of you! Robin, so glad that you're better. Noises are really bothering me this round, too. I have a really LOUD family, and I keep telling them to shut up. :-) heatherb8, here's my take on men (sorry if this offends anyone)...they have limited nurturing and multitasking skills in general, and after awhile, the well runs dry. So, say what you need, and remind everyone what you're going through. If they aren't being helpful, call 'em on it. They're your family and you need them. My family members seem to have cancer fatigue, too, but I keep reminding them that they can leave it when they walk out the door. I can't. Karen, how are you feeling today? Any less achy and nauseous? Wave, how's the neuropathy? Hopefully acupuncture will help. Are you taking a B vitamin? I'm still exhausted, but the mouth burning has faded. I have terrible indigestion, so my MO had me add Zantac to my prilosec. I'm also developing phlebitis again, dammit. This taxotere stuff is so corrosive. Plus, my other infusion sites still look irritated, and I have bruising on my arm from the blown veins. I'm looking like a junkie right now. So much for those modeling aspirations, lol. Have a good day, everyone!",
      "MessageIndex": 1013,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 12, 2012 11:32AM ckk wrote: Wave, does the growth hurt? My guess is a bartholin cyst. Pretty common, but you should get it checked out.",
      "MessageIndex": 1061,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 16, 2012 09:18PM ckk wrote: Rachel, good luck today! Kathy, so happy for you! Like others have said, this is the last time going through the bad stuff. It's all good from here! I will join you next Thursday, can't wait! Josie, Rachel, my initial MO was Wendy Chen at Dana Farber - she was the author of the alcohol/breast cancer study that came out last Fall. She discouraged me from drinking in general, and during chemo in particular. She thought that it put too much strain on the liver during treatment. If you read the results of that study, it linked even moderate drinking with elevated BC risk, and she emphasized to me that it was a lifetime cumulative thing, that if a woman drank quite a bit when she was young, then it was best to drink only very occasionally at our age. My current MO has talked to me about avoiding raw fish, raw vegetables, raw fruits that are not peeled (peeled ones are ok), unpasteurized items, and - this one she mentions every time that I see her - don't eat off of anyone else's plate. lol   Josie, the FB group is secret. No one, other than those who are members, can see what you post, or even that you belong to the group. Just in case, I was careful to not use \"breast cancer\" in the title. Robin, maybe I'm being overly sensitive, but it seems to me that putting \"the morgue\" on a door used by patients getting treated for cancer is pretty insensitive. I think that would have set me right back. In fact, I find that I'm very intolerant of gory/scary stuff now. There's a silly FB app that puts a tomb stone with your name on it  and cause of death by something stupid (using FB too much), and even seeing that makes me wince. I may get back to joking around about my death, but not right now. Bailey, I can relate to your reaction in the surgeon's office. I think that the time right after dx ws the worst for me - the newness of the dx, the unknown of what I would face. What a nightmare. I recently met a woman who was just dx'd, and the fear and horror were on her face and brought back those awful memories. I think that we were all there. I'm in my \"good\" period right now. I've noticed that this coincides with feeling so dry that I feel like I'm absolutely parched - thirsty, dry skin, dry eyes, DRY. I can't seem to drink enough, use enough eye drops, or moisturizer. Anyone else go through that?",
      "MessageIndex": 1120,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 18, 2012 08:54AM ckk wrote: Wave, I was told that eating salty foods for a day or two before chemo can help, too. I'm nervous about it next week, also. I had two blown veins last time. But it's our last time! Heatherb8, rads have just GOT to be easier than this! I sure hope so.",
      "MessageIndex": 1150,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 18, 2012 10:10AM ckk wrote: Karen, I have also been very concerned about chemo brain, as some things, particularly my word retrieval ability, have suffered since being dx'd. I got a book from Amazon - \"Your Brain After Chemo, a Practical Guide to Lifting the fog and getting back your focus\", by Dan Silverman. It's a really interesting book. The first part goes into detail about the physiological changes in your brain from chemo, and then the second half quotes studies and gives suggestions as to how to get brain function back to normal. Believe it or not, the most helpful thing suggested so far for me has been to ingest more caffeine - it really helps with the word retrieval issues. I am really motivated to come out of this and recover - get back my strength, my mental focus, and my energy. Don't be hard on yourself, though. It will take time to come back, but we can all do it!",
      "MessageIndex": 1152,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 19, 2012 12:39PM ckk wrote: Rachel, we'd be glad to send him hints if you'd like. :-)",
      "MessageIndex": 1168,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 21, 2012 10:58PM ckk wrote: Wave and Josie, good luck today crossing the finish line! SO HAPPY for you! Wave, I can so relate to what you went through, and I'm sorry that you had that meltdown. I'm glad that there was a kind person there who could make you feel better. Big hug to you. Rachel, so sorry about the thrush. Let's hope that getting meds into you quickly will allow it to resolve quickly too.  I was up repeatedly again last night with the hot flashes, and my breasts are killing me too. My hormones must be going bonkers. I did manage to go out with my GF last night, and she gave me a necklace with four pink beads, very similar to yours, Bailey. It made me cry, and I felt so silly, sitting in the restaurant weeping. But it was nice, and I'll wear it on Thursday for the last treatment. My oldest daughter is flying back from NY this morning (went to visit her BF), and she is feeling lousy, so may not be able to come to treatment with me. I'm keeping my fingers crossed. Hope everyone is well today!",
      "MessageIndex": 1192,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 25, 2012 10:26PM ckk wrote: Good morning all...another crappo night's sleep here. The combination of steroids and hot flashes made for a difficult night. My mouth has gone south (there's a BC rhyme for you!), and my legs feel like crap, very achy. Oh well, here we go. I had some tingling in my hands and feet yesterday and went to the acupuncturist for a treatment and a vit B12 shot, now all tingling has stopped. I keep telling myself that it's the last time for all of this stuff. Bailey, we had high winds all night here too. We have lots of trees around the house and I always worry. I hope that your house fares ok. Yes, the first 5 minutes of the caps are pretty painful, and the cold makes for a challenging day, but I'm glad that I did them. It's my personal middle finger to BC, lol. Good luck on the inspection, but we know that you'll do fine! Your dogs live in doggy nirvana! Rachel, enjoy your visit! It was really smart of you to have them stay somewhere else so that you don't have to be on-call hostess 24/7. We all know how exhausting that can be! Gracie, have fun at the game! Those senior nights are so sentimental. Both of my kids were/are active in marching band, and at the last football game performance of their HS, it's always very sentimental, really makes you cry. Lisa, that is fantastic news about the sniffles, the eye running, and the hot flashes! I can hardly wait. Yes, I almost hugged the UPS guy when he arrived to pick up the cold caps. I went downstairs and looked into my empty freezer and smiled a mile wide. I called my local \"green\" salon to get the conversation started about hair coloring (I now have 1.5 ins of grey and black roots), and she's going to do research and get back to me. heatherb8, enjoy your busy weekend! Karen, I hope that your sore throat has eased now that you're on your antibiotic. Strep is awful, take care of yourself! I hope that everyone has a good weekend. Hugs to all.  ",
      "MessageIndex": 1260,
      "PostDate": "25/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 3, 2012 12:43AM ckk wrote: Wave, I've started to use Latisse in hopes that it will save my few remaining lashes and encourage my poor patchy brows to fill in. Do you have a Costco nearby? It's usually not covered by insurance and Costco had it for a good price. I'd call around to compare prices. I also took the suggestion of many on this site and I'm using a different brush than comes with the bottle to make the product last longer. I picked up a fine eyeliner brush from Sephora and wash it after every use. Good luck with your derm appointment! Annie, hope your weather isn't too severe. Good to know that you're starting on the Arimidex. Like Wave said, it's a touchstone that tells us that we're moving into survivorship.",
      "MessageIndex": 1348,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 5, 2012 12:42AM ckk wrote: Bailey, congrats on the new addition! Did you decide on the name? I too am having whole-breast irradiation for 28 doses, then 5 \"boosts\" of the lumpectomy region. They are not doing my node area because the tumor site was very close to the node. Interesting what your RO said about knowing that you'll have skin issues. I was told by my RO that they used to think that they could predict who would have trouble based upon skin color, etc, but they found that really couldn't. Did they tell you to put cream on the breast before and during treatment? I am supposed to start using a cream that contains both aloe & vitamin E 2x/day two weeks before treatment starts, and then all during treatment. They gave me a bunch of samples to try, and I have decided to use \"Jeans Cream\", which was available at my local natural pharmacy. It was apparently created by a BC survivor after she had skin problems during rads. heatherb8, hope your fatigue lets up soon. karmil, are you doing anything to alleviate the hot flashes, or did they ease up on their own? I need help! Wave, I'm so glad to hear that you've started to feel good! I'm sure that your family understood your challenges, and I can relate to your unhappiness about the fatigue. Lisa, so good to hear that you're feeling better re:SEs! Yay on the new hair growth! robin309, I was so touched to read about your time with your daughter. I too have drawn great comfort and solace from my two daughters, and this experience has brought us closer. I was initially very worried about how this would affect them, but they have come through like champs. Good for you for getting through your challenging day. Rachel, your pace is so challenging, and I'm glad to hear that you're resting a bit. You've been through so much, and it's okay to rest and recuperate for a time. Regarding looking old: we have all gone through a tremendous amount of physical & emotional turmoil in a short period of time -  the diagnosis, surgery, chemo, etc. The fact that we're wearing it on our faces right now is no surprise, but it will NOT last forever. We will emerge stronger and more beautiful when this is over, ladies. You are all incredibly resilient and beautiful people, and that will shine through when this is done! I woke up to discover new eyebrow and eyelash hairs growing! I've been using Latisse for a short while, and didn't expect to see anything so soon, but there they were. My arm is better today, not as red or painful. I have a nadir visit with my MO tomorrow, and I plan to ask about the taxotere issue. Have a good Sunday!",
      "MessageIndex": 1373,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 19, 2012 06:28PM ckk wrote: Wave, have you thought about getting a grocery delivery service until you feel stronger?",
      "MessageIndex": 1515,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 23, 2012 10:00PM ckk wrote: Good Morning, all! hale0811, I'm so glad that you may have figured out the source of the swelling, and bless that BCO member for reaching out to you. This is such a wonderful place! I think that there's such a variation in MOs like all docs. The first MO that I consulted at Dana Farber was technically brilliant, authored studies, etc., but had no warmth or caring for me as a patient. My local MO is exactly the opposite. The best thing (ONLY thing) that we can do is to be persistent and advocate for ourselves! heatherb8, thanks for deod rec, I'll check it out. I too have to run everything by my RO before using it. Yay for being halfway done! How is your skin doing? Any pain? Leesa, if you do consult a personal trainer, make sure that they are aware of and know how to train you to minimize lymphedema risk. If they are ACSM certified, there are materials available through ACSM that they can draw upon to make sure that you work out safely. The ACSM web site has a list of certified cancer trainers on their site:  http://members.acsm.org/source/custom/Online_locator/OnlineLocator.cfm Wave, I was a WW leader for 15 years, and did two meetings per week in the evening. The program works, and I still follow the guidelines. It's medically safe and I recommend it highly. I asked my Rad ctr about weight loss during rads, and they said no worries, that thay rescan and recalibrate every 10 sessions, and that people lose their cancer weight all of the time through rad treatment.You may want to ask yours about it too. As for the hair...it's funny, we're both trapped by the hair situation. I feel incredibly self conscious when I'm out and about or with friends. No one has ever seen me with grey hair, and the difference between my silver long roots and the rest of my hair is very dramatic. It frankly looks terrible. I can't color it for 5 more months, and I can't wear a hat or a scarf because of the heat build up on my scalp. Women stare at my head when they talk to me, and strangers give me arrogant, contemptuous looks (as in, why can't she take care of herself?). I know that it will pass and I'm glad that I did the caps, but it's hard right now. Hopefully my rad center will be up and running again today! I am hoping to hop on the bike again, as it's going to be another warm day here. I hope that you all have a great day!",
      "MessageIndex": 1551,
      "PostDate": "23/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Apr 1, 2012 07:33AM ckk wrote: Good morning, all. It looks like many of us are in a funk right now. For me, it's the great unknown before me, that I'll be looking at years of wondering and worrying. I know that there are legions of BC survivors out there doing it, but it's tough. It will probably help when my stamina comes back. Jen, you've been through a lot! I hope that you're taking those pain meds and resting. I'm glad that you feel good about your decision, that's what counts! Leesa, I'm cheering for you on that bike! Wish that we lived closer so that I could go with you. It's good to hear that the muscle burn is gone. Did it just recently resolve? I too have eyebrow regrowth. The bald spots now look like they've got 5 o'clock shadow, which is good because I suck at eyebrow pencil/powder etc. I always end up looking like a Joan Crawford impersonator! Karmil, I had my D run out to buy some dark brown powder eyeshadow with a tapered brush. It seemed to do the trick, but as I mention above, I'm not very good at application. I think that a light touch is probably best.It's strange how some people don't lose brows, some lose a little, some lose a lot, and some don't lose until way after chemo. I lost most of mine right after tx #4, and now they're slowly coming in, same with lashes. Bailey, I can only imagine how anxious military-related things must make you. How long until your brother comes home? Good thoughts going his way. I agree, sometimes I don't know who I am anymore. I try to focus on the good that's come from this. People around me tell me how \"strong\" I am, so apparently I'm putting on a good act. I loved the picture on FB! The growth looks great. Rachel, this is probably your bottoming-out day. I hope that you're doing ok. Wave...where are you? I hope that all is ok. Momof3,I hope that you are feeling less anxious today. With Easter and Passover coming up next week, I think about how this thread started, with many of us discussing how to cope with Thanksgiving/Christmas/Chanukah. It takes my breath away to realize how much we've gone through in such a short time - surgeries, chemotherapy, more surgeries, radiation. I'm in awe of the strength and perseverance of all of you amazing people. We came through it all, and now we are talking about hair growth and nipples! I Love it, and it makes me thankful.  Younger D is performing in a Jazz concert this afternoon, so I'm looking forward to that. I have a question for you ladies going through rads - did your RO tell you not to take any supplements? Mine said nothing, and I take several. I read that some ROs forbid it during treatment.",
      "MessageIndex": 1646,
      "PostDate": "01/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Apr 7, 2012 01:40AM ckk wrote: OMG Wave, that's awful! Are you really perfectly okay? Were you examined by any of the medical staff? I'm sure that someone is going to get in lots of trouble for that, not including the poor new guy!",
      "MessageIndex": 1681,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Apr 25, 2012 06:13AM ckk wrote: Hi all, just checking in. I'm 9 tx's away from done with rads. Yay! My eyebrows are almost all grown in, and the eyelashes are almost all gone. Oh, well. Skin has held up well through rads, thank goodness, with only slight discomfort in the underarm. Melrose, I iced fingers and toes during Taxotere by putting frozen gel packs into old socks and sticking in my hands/feet. I also sucked on ice and used cold caps, so my electric blanket was my best friend! I had a day or two of neuropathy after each tx, but went to acupuncture & also got B12 shots. No neuropathy now at all, thank goodness. Good luck with your tx's!",
      "MessageIndex": 1759,
      "PostDate": "25/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 15, 2011 12:56AM ckk wrote: Hello Josie and Shirley. I will be starting TCx4 on 12/22. It's so comforting to go through this with others, welcome. Rachel, I'm so glad that your first time was uneventful. I'm keeping my fingers crossed that you have minimum SEs. I was up most of the night with anxiety - couldn't fall asleep. The anticipation of all of this is really getting to me. I'm really anxious about using the cold caps - doing them correctly, being too cold to put up with it. It's all feeling very overwhelming right now. Can I get off this train now? I still don't feel even 80% after my surgery 4 weeks ago, and that has me concerned that I will not take chemo well. I know that I'm doing the right thing, but it really sucks. I guess that being tired really sucks the optimism out, huh?",
      "MessageIndex": 199,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 27, 2011 08:35AM ckk wrote: Wave, I am sending you a hug. I had a similar meltdown this morning with my H. I was trying to describe to him what this feels like (flu x 100?), but words just didn't do it. Let me tell you what I've been doing for my crabby stomach, and perhaps it will help you. I don't have any large meals, and as soon as I feel ONE twinge of discomfort or hunger, I eat something small - a few pieces of cantaloupe, a bit of yogurt, some cheese, whatever appeals at the moment. I think that my cramping, nausea and pain issues are from excessive stomach acid. I am on an acid blocker (prilosec) 2 x day, and I'm supplementing with Mylanta. This morning I was pokey about going down to the kitchen to get something to eat, and it started a tidal wave of stomach problems. I forced myself to eat something and that settled things right down. If you're having diarrhea, you need to make sure that you're drinking enough, and maybe try the BRAT diet (bananas, rice, applesauce, toast). Can you try a flavored water, or spritz some lemon juice into your water? Also, ginger green tea might be appealing and soothing. I am determined to get out today and move, because I want to see if that helps. I also was formerly very active - biking, weight training, etc., and it feels lousy to sit on my ass.  Good luck with your appt today!",
      "MessageIndex": 347,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 30, 2011 03:40AM ckk wrote: Hello all.. I am feeling pretty good today, just a bit tired. I went to the gym and worked out this morning, and will go for blood work this afternoon. I meet with the MO tomorrow. Regarding acupuncture: I had it earlier this week in the hope that it would help to ward off neuropathy. I had had some tingling in my hands and feet when I went and it went away after treatment, so I am happy that I did go. My acupuncturist recommends once per week until chemo is over, and the insurance covers it, so I'm going. Kimby and Bailey, I hope that things go smoothly today! Momof3, we're hoping to hear from you soon. Robin, glad that AC is working for you too.  Josie, it's so good to hear that you're feeling better! Annie, hope things improve soon, and pamper yourself today. Rachel, the oral rinses have worked well for me, so hopefully they will help you too. Hope everyone is having a good day. It's cold here, and we're expecting bad weather tomorrow. I'm going to do some grocery shopping in preparation for oldest daughter and BF coming to visit for a few days. Yay! Hugs to all.",
      "MessageIndex": 382,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 4, 2012 09:22AM ckk wrote: Good morning all, things have settled down here. Youngest daughter came down with strep symptoms but went on antibiotic immediately. I am feeling much better, almost \"normal\", and hoping that it will stay that way until next Thursday, my infusion #2. Regarding neuropathy: I had tingling in my fingers and toes in the first few days after treatment #1, and visited my acupuncturist. After getting Ac the tingling cleared up. I will be going again at the end of the week. I also was advised by my MO to take a B-complex during treatments. Regarding lymphedema: I had one node removed and was concerned. My surgeon actually seemed annoyed when I brought it up, saying that it would be no problem with one node. However, every nurse that I've spoken with since (including the PA in the ER on Sunday, a fellow BC survivor) has advised me to take precautions, that they'd seen LE pop up in women with only one node removed. I think that surgeons may not be as educated in this as they should, and that's why forums like these are so valuable, so that we can warn and educate one another. I hope that everyone is hanging in there and feels good today, and thanks for the words of support.",
      "MessageIndex": 484,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 11, 2012 01:04AM ckk wrote: Sorry, forgot to wish Wave good luck. About the vaccination issue - my MO also said no vaccines for anyone in the house during chemo. She also told me to stay away from the pediatrician's office until one month after my last chemo, or to wear a mask if I absolutely had to go. ",
      "MessageIndex": 566,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 11, 2012 10:21PM ckk wrote: Good morning all..I'm getting ready for TC #2 tomorrow. We're expecting a snow storm, but luckily my infusion center is only 10 minutes away. I hope that we can get there safely! I am again using the cold caps, and so far so good, I have all of my hair. Lisa, glad to hear that all went well! Only one more to go! Annie, good luck today. heather, hope you're feeling better. Robin, I had to pee constantly after my first infusion, too, but that's good - you're getting rid of the toxins. Bailey - I have had two acquaintances diagnosed with BC in the past few weeks. It's terrible seeing someone else go through this. I hate this disease, and hope that a cure is found soon. Good day to all!",
      "MessageIndex": 580,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 1, 2012 04:20AM ckk wrote: Are any of you on Facebook? How do you feel about starting a private FB group for us December ladies? It may be useful as we discuss things like getting together, etc. If you're interested, I would be happy to set up a group. Please PM me with your Facebook name and I will \"friend\" you and add you to our group!",
      "MessageIndex": 855,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 2, 2012 08:14PM ckk wrote: Hello ladies... I had TC #3 today. It was a very LONG day. They took me on time, but the MO wanted to have a consult with the pharmacist about the appropriate solution to flush my IV at the end, in order to help me to avoid the phlebitis that I had last time. They ultimately decided on regular saline, pushed fast. In the meantime, the nurse blew two veins while attempting to place my IV, and it HURT (Hi, Wave). I got very teary. She gave up and consulted another nurse, who came over and found one quickly. Anyway, the infusion went well, no problems, and then of course I had 4 hours of additional cold caps after all was done. Thank goodness for my electric blanket! I am anxious to get these next three weeks done and join you ladies that have graduated. I want my chemo diploma! Lol Kathy and heatherb8 , I have switched almost entirely to paraben free personal care and makeup products. I think that the site that Lisa referees to is the EWG database: www.ewg.org/skindeep/ It's useful to see what the ingredients are in the products, so that you can make your own choices. If you'd like a list of stuff that I use, PM me and I'll be glad to share. I use Tom's of Maine 12 hour deodorant, and really like it. I've been having relentless hot flashes this week, and the deodorant seems to work. Heather - congrats on being done! Whooo! I realized that I mistyped the date of todays infusion in my profile - hello chemo brain. Fixed that for ya... I hope that I get some sleep tonight. It's not looking too promising right now! Good thoughts to all of you Ladies. And, we're up to 8 members on the FB page! PM me with your Facebook name, and I'll put you on!",
      "MessageIndex": 898,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 3, 2012 09:17PM ckk wrote: Good VERY EARLY morning, ladies. Steroids are still keeping me awake, but no nausea, thankfully. I am very bruised where the two blown veins are. I iced it pretty frequently last night, and the pain and swelling are gone, but the bruising is bad. Three weeks from today, I will be done! momof3, I have been reluctant to accept other people's food after a girlfriend told me that she pulled a turkey that she was cooking for me out of the oven a little early because she needed the oven, so just reheat it really well, ok? I know that people mean well, and that they want to help, and I guess that they just don't truly understand how vulnerable we really are at nadir. Now I just say things like, wow, I have no more room in my freezer, but thanks so much for thinking of me! Gracie, like heather said, parabens apparently mimic estrogen in our bodies, and in fact have been found in 100% of all ER+ breast tumors, according to a new study. All but one of my doctors has told me to avoid them. Heather8, I use the the Tom's of Maine 12 hour deodorant formula. It smells a little masculine, but it works for me. Kathy, I am similarly endowed. I have also been having twinges and pains in the other breast and it was driving me nuts, and on top of that, have dense breast tissue. My MO has been great about talking to me about my concerns, and suggested a breast MRI after chemo. My RO said that she would prefer after rads,so that rads will not  be delayed. Interesting note: I was having very bad soreness in the other breast, and then last week started having intense hot flashes. Magically, the breast discomfort went away. My MO said yesterday that the breast pain is probably my hormones cycling as my ovaries shut down. As an ER+ gal, shutdown ovaries are good news. Wave, how's the neuropathy? Hope you're better. Lisa and Annie, how are you feeling? Rachel, I hope that you have more energy today. I'm off to the Acupuncturist today, and then if I'm up to it, to a party at my daughter's HS that I plan and usually run every year.  We're up to 9 gals in the FB group. Come join us! PM me your FB name!",
      "MessageIndex": 905,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 15, 2012 06:58AM ckk wrote: robin, my MO told me that it was ok to go back to 8 glasses of water per day after the first few days after chemo. Did you tell the nurse that you were drinking that much, and are you on steroids? Taxotere can cause water retention too. Just wondering if you need to escalate your question to your MO - wrapping your legs sounds kind of odd.",
      "MessageIndex": 1091,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 19, 2012 05:32AM ckk wrote: Good morning all...four days before my LAST round. I'm going to make some meals ahead today to freeze for the days that I can't cook. I'm feeling almost normal, but I have some fatigue hanging on. H arranged for the dry ice, and I'm really glad that this will be my last cold cap day. As happy as I am that they work, it makes for a long, long day. I will be doing a happy dance when the UPS man picks them up on Friday! Bailey, I saw the pic of the dog you're thinking to adopt on FB. He's adorable! I hope that it all works out and that he becomes a part of your family. Gracie, I hope that you're hanging in there. I had two blown veins after tx #3, and my whole forearm was bruised. The bruising does go away completely in a couple of weeks. Rachel, how did the bird watching go? I've been meaning to tell you that I \"met\" a Stage II TN survivor awhile back. I put that in parentheses because I've known her for three years and never knew that she was a BC survivor. She did her treatments at Dana Farber in Boston 11 years ago, and has been NED since that time!  Josie, I have my last tx this week too. At my nadir appt last week, the MO mentioned that some people do get anxious at that time because they are being \"released\" from the chemo, so I think that what you're feeling is normal. My understanding is that the 4 dose regimen is the standard for early stage BC, unless you are HER2 positive or TN.  So, I think that Josie, Wave, and I have our last treatments this week. Am I forgetting someone?",
      "MessageIndex": 1157,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 20, 2012 07:15AM ckk wrote: Good morning all... I had a miserable night's sleep last night. The hot flashes kept waking me up, then I'd start thinking about tx #4 and get anxious, and then fall asleep eventually only to get woken up by another hot flash. Ugh! Seriously, I used to get killer cramps from my period, and now killer hot flashes when the periods are gone? And BC? Can I be born again as a man?? I have a thousand meetings this week. I group them in the week before my tx for obvious reasons, and now all I want to do is stay in my jammies and sleep in front of the TV. heatherb8, my fatigue has been much worse this round. MO said that fatigue is cumulative. Maybe yours can suggest something to help? I hope that your bloodwork is ok and that you're better soon. Gracie, I hope that your joint pain and achiness is not as bad this time, but as you say, you're prepared. It's the last time! Bailey, I ike your FB event idea, it made me laugh. Go for it! I bet you'd have many followers. It's such a great way to mark putting this crap behind you! robin, so good to hear that you felt strong yesterday! What a great feeling. I start rads excatly one week after you.  Wave, I was told to avoid BPs and needles in my BC arm. I have a lymphedema alert bracelet now that reads \"No BPs, No Needles, left arm\" in case I'm in an accident. JMO, if your nurses are not asking, I think that they should be. Good luck tomorrow! yay for you! Rachel, I think that we've all decided that your wedding would be a perfect way to see one another. Please let us know if we can nudge the BF along. :-) Josie, good luck tomorrow! Lisa, how are you doing? Any shedding? I'm going to attempt to drag myself through my day today. I'm supposed to go out for dinner with a GF tonight. Hope I can stay awake that long! Have a great day, everyone!",
      "MessageIndex": 1175,
      "PostDate": "20/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 21, 2012 08:21AM ckk wrote: Mom2jj, I'll ask about the medication on Thursday when I see the MO before my tx. Thanks for the suggestion! She did tell me to tell her if the flashes were waking me at night, so I think that she has something else in her pocket besides the Vitamins C&E that she's having me take twice per day. Fatigue: I think that we've all felt fatigued from the chemo, you're not alone. It's awesome that you've been able to keep up the exercising, and there's studies that tell us that it helps with the fatigue and overall well being. Perhaps you can lower the intensity on the treadmill, or walk for a shorter amount of time? I also try to exercise daily, and I've come to realize that on days that I'm feeling crappy and tired, I should be kind to myself and slow it down. Get the rest you need, and remember that the fatigue may well get worse through your treatments - we all seem to have experienced that. Good luck to you!",
      "MessageIndex": 1184,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 24, 2012 05:46PM ckk wrote: Hi Ladies! As you can see, the steroids are doing their work, because here I am, fresh as a daisy at 1:30 am. I fell asleep early in the evening from all of the ativan, only to wake up.  But, I'M DONE! The infusion was with one exception the easiest yet, I'm glad to say. The IV went in smoothly the first time thank goodness. I had the same nurse that I've had 3 of the 4 infusions, so she was well versed in the cold cap regimen. The caps have caused quite a stir in my chemo center as no one has seen anyone use them before, or keep their hair through this treatment. The infusion center head nurse came over and and asked questions, observed the caps being put on, and I spoke with her regarding the center getting a donated freezer from the Rapunzel project to help patients using the caps (they wouldn't have to use dry ice or coolers). I'll go back when I'm better and talk to her about it. Anyway, my nurse started the day by bringing over a pink boa and pink cowboy hat for me to wear to mark my last time! The infusion went smoothly. We are having a real warm snap here, temp in the high 50s, so H bought extra dry ice just in case since we buy it the night before tx. Because of this, the caps came out of the coolers MUCH COLDER than usual, -50 degrees in some spots, and took a long time to warm up. I know that most of the caps went on my head colder than -32,and that first cap was brutal. I had had ativan in my premeds, and that formerly was enough to get me over the first 5 minutes of pain, but I was seriously hurting enough to ask for more ativan. Nurse said that I'd had the max and started to look into other options, but a few minutes later my scalp froze and I was fine for the rest of the day. After that, no problems at all and finished with a fast saline flush in hopes to avoid plebitis. The infusion center nurses came over at the end of the tx and stood around and clapped and hugged me for finishing! There I was, cold cap on my head, shivering, weepy, exhausted, but I felt great! Too funny. We took lots of pics and I'll post some on FB. Then home, and 4 more hours of caps. I took another ativan and zonked out on the chair, woke up to eat pizza before the taste buds bid farewell, and then zonked out again for a bit. Now, I fear that I'm up and on the roller coaster yet again. Crud days, here I come! I see the MO again on the 6th for a nadir visit and will ask all of the fantastic follow up questions you ladies suggest. My breast MRI is scheduled the week of the 12th. I have my mapping that week, too, and start rads on the 19th.  Gracie, so glad that you're feeling good, and I love your attitude about how we are all getting stronger and will get better on the other side! I have the SAME intentions. I will be fighting to get back to stronger, more energetic, and healthier. I bought a book to use with my trainer called \"The Breast Cancer's Survivor's Fitness Plan\",  by Carolyn Kaelin, an MD, and three ACE certified cancer trainers. It has specific stretching and strength exercises for BC survivors, and a whole chapter on safely working out with lymphedema, or alternatively, how to avoid lymphedema.  heatherb8, sorry to hear about your hand! Be careful and watch it for infection. I read somewhere that we have to careful of that. Bailey, sorry to hear about your tingling. Excuse my chemo brain - did you try AC? Mine also gives me a B12 shot every time that I go. I have one treatment the day after TX, and one 2 weeks later. They work! Lisa, I wonder if you can ask to be transferred to a more sedentary set of responsibilities for half of your day over the next few months? I feel so bad that you are struggling through your day this way. Can you talk to your boss about it, let them know what you're going through? It IS only temporary. Rachel, glad that the thrush is better! Whew, thank goodness that you avoided the Noro virus. I sat with friends at the jazz concert the other night who had just had it the week before, and it sounded horrific, truly. I hope that you continue to improve, and that your leg gets better. Wave, your list of chemo SEs should be put on index cards and given out to every well meaning soul who compares chemo to the flu.Can I add phlebitis? I hope that you take it easy during this down time, and maybe get out a bit each day to stretch and do a few steps.  robin309, good for you for getting on that treadmill!  momof3, my MO also said that bone pain is common on this regimen. She said that eating adequate protein would help it ease over time, and that it would ease up. Karen, I hope that your sore throat is better today. It's your circle-the-wagons week, so hopefully rest and fluids will kick it out. I hear you on the hot flashes. My girl friend has a remote control fan in her bedroom - what a great idea! Where do I get one? Well, I'm off to my chair to ice down my infusion site in hopes to avoid phlebitis on this last one. Oh, and drink a gallon of water to get rid of the chemo. OH, AND send back the damn cold caps tomorrow! WHOOOOOOOOO! Have a great day all! I am so grateful to all of you! I wish that I could give you all hugs and hope that we truly can meet when we're recovered.",
      "MessageIndex": 1251,
      "PostDate": "24/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 26, 2012 12:08AM ckk wrote: Wave, I've had that sensation come and go, along with an occasional high pitched whine in my ears. It seems to peak at about day 10 and then diminish.",
      "MessageIndex": 1263,
      "PostDate": "26/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 1, 2012 12:41AM ckk wrote: NikkiEliz, welcome and I'll echo what Wave said and encourage you to participate in the February thread as well as this one. It's incredibly helpful to read in retrospect what others have gone through, but there's nothing like getting the immediate feedback and support from others who are on this road at the same time as you! Wave, that lunch and movie sound heavenly! Enjoy!  Gracie, sorry to hear about the toe. Is it just the nail, or the whole toe? Have you showed it to the MO? Bailey, good luck with your appt on Friday. My mapping is next week, and my rads start on the 19th. During my first appt, the nurse went over skin care, etc and gave me a bunch of lotion samples to try. They want me to put some sort of aloe containing cream on the breast 2x per day. I decided on Jean's Creme. I'm curious as to what your rad center tells you to do. Rachel, glad that you enjoyed your Philly tour! Your energy is so inspiring, it leaves me in awe, and you are a very good host and friend. Annie, I am also retaining fluid big time, and the MO says that it's the taxotere. My eyelids and face are swollen, and my hands feel puffy.I am going to ask her during my appt on Monday if there's anything that I can take to get rid of it. Ugh! heatherb8, good luck with the MO appt, and let us know how it goes! I feel better this morning, not as tired or out of it. It gives me hope! My taste is still in the toilet, and everything tastes like metal or ash or, disgustingly, beef fat, ew. Lemon is my only true taste right now, so I'm dousing everything in lemon juice, even my morning egg! I am hoping to go to the gym and use the treadmill today, and then do an errand or two if I survive that. D wants to bake cookies today (she's on school break), so we'll probably do that too. We're expecting almost a foot of snow here over the next day or so, our first real snow of this very odd season. I know we've all said before, but I continue to be incredibly grateful to all of you for your support and friendship. I cannot emphasize enough what it has meant to me in this journey, thank you.",
      "MessageIndex": 1321,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 2, 2012 08:07PM ckk wrote: momof3, don't you have treatment #4 today? Excuse the chemo brain if no, but if you do, best of luck! I'll be thinking of you! Lisa, I didn't realize that you were starting Tamox so soon. I'm anxious to hear how it goes. Wave, the first time that I got phlebitis, the nurse wanted to see it to make sure that it wasn't an infection or a clot in the works. She looked for a more general redness in the area (rather than the vein), the skin being hot to the touch and hard, and looked at my upper arm to see if it was tight and hard. If any of those things were present, she would have sent me to ultrasound. Is it worth going in an letting them get a peek to settle your mind?  Rachel, glad that you survived and enjoyed the visit! I hope that this means a relaxing weekend. I've been sniffling like crazy too, it's driving me nuts. karmil, the AC needles aren't painful at all, but I do understand your squeamishness. I don't look when my AC is putting them in. I'm going back today in hopes to relieve my neuropathy. My neuropathy is definitely better today, but I'm going to AC anyway. The tingling has stopped, but I'm still getting those occasional twitches in my thumb. It's scary, and I hope that it resolves. The phlebitis is definitely worse, extending most of the length of my inside forearm, the worst of all of the rounds. I'm very glad that my poor veins don't have to go through this again! Oldest daughter is coming home for the weekend, which makes me very happy. For those of you who don't check the FB page much, you might want to check in on our discussion regarding weekend dates and locations for our get together. Happy Friday!",
      "MessageIndex": 1345,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 3, 2012 07:46AM ckk wrote: Yay momof3!!!!! There's nothing like DONE! Wave, I'm really glad that you were seen today. I was concerned that it was an infection brewing. Do you you need to have it rechecked? I got AC today. He thinks it's more than a nerve issue, that it's also magnesium depletion and dehydration. So, he thought that I should take a magnesium supplement over the next few weeks or so, eat Mg rich foods (nuts, beans, sunflower seeds, oats), drink lots of water and see how it goes. I have been feeling very dry as usual. Let's hope that he's right and it works!",
      "MessageIndex": 1352,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 8, 2012 06:54AM ckk wrote: Rachel, good luck today! I'm thinking about you! heatherb8, are you using any topical creams during rads to help with the irritation? Thank for the deodorant rec. I have tried three brands so far and I'm still stinky. I'm starting to get resigned to the fact that I'm gonna be smelly. momof3, I loved your hair story, and your son is so precious!  Lisa, so sorry to hear about the hot flashes returning with the the Tamox. I have a friend who has a remote control fan in her bedroom, and it really comes in handy during the night. I too have had flashes that wake me up constantly, and it sucks. I love your bike-to-work idea! I was an avid daily biker before I was dx'd, and had just bought a beautiful new racing bike the very same day that I found my lump (on my birthday! happy birthday to me, I have breast cancer! lol), so it's going to be very meaningful for me to get back on that bike and ride the hell out of it. Bye bye BC! I'm still fighting extreme fatigue. I took a four hour nap yesterday, woke up, made dinner, and then went back to sleep. It's going to be in the 60s today, so I'm determined to get out and enjoy it, even if I have to take a nap in the back yard! Have a great day, all.",
      "MessageIndex": 1413,
      "PostDate": "08/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 10, 2012 02:57AM ckk wrote: Ugh, just realized that I meant Rachel instead of Robin in that first paragraph...sorry! Chemo fingers!",
      "MessageIndex": 1428,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 27, 2012 12:21AM ckk wrote: Good morning all..no rads for me today. I had the stomach flu from hell over the weekend - vomiting, diarrhea, chills, aches, fever. The whole family had it. I still have a slight fever today, so the rad center said to stay home. What a pain. Karmil, good luck today! We're anxious to hear how it went. Rachel, your post made me teary, and I so wish that I could give you a hug, and I would really like to kick your BC friend's ass for writing what she did about recovery. Recovery is lots of things: physical, emotional, and psychological. You can tell by just a casual read of this site that we all recover at different rates. It matters what shape you were in going into it, how you've taken care of yourself during tx, and your support system. I firmly believe that the people we surround ourselves with make a big difference to our recovery. A cancer diagnosis is a great sifter and vacuum cleaner. You deserve to limit your interactions to people who lift you up, not bring you down. You have behaved like a survivor through ALL of this, so that's the way you will act moving forward. It's okay to be angry with people who don't get it, and it's okay to keep explaining it to them until they do. When my family was suffering from the stomach flu over the weekend, weak and achy and nauseous, I told them that THAT was somewhat what chemo after-effects felt like, but multiplied by 100 or so. It seemed to light the bulb over their heads. In the end, no one except a fellow survivor is going to know and understand the struggle and eventual triumph that we face. You are not done with treatment...trust us, it will get better! Gracie, good luck with your upcoming surgery. Leesa, I've decided to be zen about the grey hair thing. If people want to know why I suddenly look like a Clairol refugee, they can ask. I want to concentrate on getting my body strong again and feeling like me, so more exercise, good eating, and ignoring the negative forces in my life are in order. I'm tired of being tired!",
      "MessageIndex": 1575,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 28, 2012 09:12PM ckk wrote: Evening, all! Rachel, I will be cheering for you tomorrow - WHOOOO! Last one! I really wish that we could all be there to cheer and celebrate! Wave, that photo story is seriously weird. I thought that I had it bad with the dirty looks at my roots- your story takes the cake!  Merinnell - welcome, and glad that you're here. I hope that you're also participating in a forum with ladies currently undergoing active chemo with you, as it really helps to trade war stories.  Bailey, I LOLd at your car comment! I love it! What did they think that you'd do with it after tx, hang it on the wall like a trophy? My breast is a bit sore from rads, but the skin is still fine. I get little \"zingers\" after treatment, that the nurse said was from the nerves that were cut  in surgery getting irritated. That goes away after about an hour.  Karmil, glad that you're recovering well. Momof3, the only thing I get at my rad center is a hard candy and stale coffee.  Josie, yay for fewer rad treatments! I'm exhausted! I cleaned closets all day. Somehow I don't think that it will mean a good night's sleep, but one can only hope!",
      "MessageIndex": 1618,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 12, 2011 05:01AM ckk wrote: Good morning all...I was supposed to umpack the cold caps this weekend and practice for the 22nd, but I got distracted by my oldest daughter home from college for the weekend - a good distraction! She always gets me moving, and moving is good. Anyway, this week I get serious about the cold cap training. I ordered three books from Amazon re:nutrition - \"The Cancer-Fighting Kitchen: Nourishing, Big-Flavor Recipes for Cancer Treatment and Recovery\" by Rebecca Katz, \"Beating Cancer with Nutrition\" by Patrick Quillin,and \"Anticancer, A New Way of Life, New Edition\" By P Servan-Schreiber, MD. I've been reading lots of studies on what makes cancer grow and how the rates of BC recurrence are so much lower in women who exercise 6+ hours per week and eat lots of fruits and veggies. I figure that the doctors are doing what they can by throwing all of these treatments and meds at me, so I'd better get moving and do my part.The Katz book is of particular interest currently, since the many comments on Amazon seem to indicate that the foods suggested seemed to ease chemo SEs such as nauseau etc.  I'm glad that everyone seems to be doing well at present! Hang in there, hugs to all.",
      "MessageIndex": 169,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 23, 2011 04:22PM ckk wrote: Lisa, I also had LVI at my tumor site with negative nodes, and was also very depressed and concerned. The two oncologists that I spoke to about it said that lymph node involvement and HER2 status are much more indicative of longer term prognosis, and that the jury is still out on the role that LVI plays. Doing chemo is apparently the best defense against cancer cells roaming about looking for a home. In addition, your Oncotype score is supposed to be a good predictor, too, and again, the chemo plus tamoxifen brings that recurrence rate down. I think that all of us will now have to deal with this new reality of looking over our shoulder. I was diagnosed with malignant melanoma 12 years ago, so I can tell you that while that deep fear is intense at the beginning, it does fade in time.Eventually it hardens into an old scab that scratches off and bleeds briefly when you have a follow up scan or test. But it does get better. In any case, I think that talking to someone is good.",
      "MessageIndex": 296,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 24, 2011 08:58AM ckk wrote: Hi everyone, Day #2. The queasiness is mostly gone. I find that I can keep it under control with very light meals/snacks every couple of hours along with ginger tea. I cannot tolerate anything sweet or fatty (now there's a side benefit, lol) I woke up with lower leg achiness that went away when I drank a big glass of water, took a couple of advil, and a nice warm bath. I went to the gym yesterday to use the treadmill and found that I felt much less nauseous and more energized, but boy, it was tough that first few minutes. I'm glad that I went.I also had acupuncture yesterday to head off neuropathy - my acupuncturist recommends once/week during treatment, and since it's covered by insurance, I'm doing it. My oncologist also recommends a B-vitamin complex for the same reason. Betsy - I love your Taxotere thread idea, but I can't seem to find it in the Forum listings. Would love to contribute. Heather - I probably would have had my treatments in Boston, but I clicked with the local onco so well that I decided to switch. She's really been wonderful, even called me twice yesterday to see how I was doing. Michelle and Josie, welcome. Rachel - your energy level is inspiring! I hope that you continue to stay strong. Heather - I envy you your little one this time of year. I have two (almost) grown daughters who are amazing, but I miss the excitement that this season brings with little ones. Guess I'll have to wait for grandkids! Lisa- my dirty hair is driving me crazy! I just want to wash it, but have to wait until Monday.. Ugh. I hope that you're still feeling good. Annie - hope you're doing better. Sometimes I wish that I could have daily body scans to make sure that all is ok, lol. I've decided to arm myself with every weapon to avoid this cancer crap again - exercise, eating healthy organic food, and using all of the meds that are proven to deter recurrence. It makes me feel better to be proactive. I hope that everyone has a wonderful holiday. I think about all of the advances in BC treatments made possible by the tireless efforts of women like us and I'm grateful. Moving forward, we will continue to be able to take advantage of new studies and treatments. Thanks to all of you for being my BC sisters!",
      "MessageIndex": 303,
      "PostDate": "24/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 26, 2011 10:18PM ckk wrote: Good morning all... all in all not a bad day yesterday. My nausea seems to have abated. I talked with the onco yesterday about my swallowing issue, and given that I have had lots of nausea and gastritis, she suggested supplementing the acid blocker with Mylanta. It worked! Swallowing issue resolved. Must have been acid reflux. It's strange, I feel better now (day 4) than I did the first couple of days, more energy etc, which seems to be counter to what I should be going through. I'm not complaining. I also get to wash my hair today (couldn't wash it 3 days post chemo with the cold caps) - yay! Annie, I am craving salty too. I'm living on triscuits and cheese :-). I'm pretty much emotional all of the time these days, so I'm not sure if the steroids are part of it. Welcome, jampus. Josie, I've had my period all of this week, and it seems to have escalated since treatment. I'm really hoping that the chemo will stop this nonsense altogether.  Michelle, yes, you should call the doc and get more nausea meds. What helped me was small frequent meals and keeping the acid reflux under control. Can you get some ginger tea or ginger ale? I made a bunch of my own tea with fresh ginger and cinnamon on the stove - peel about 1/3 cup of ginger, sliced, put it in a pot with 8 cups of water, add a couple of cinnamon sticks, and simmer for 30 minutes. Strain and sweeten with honey if you want. It really helped. Good luck and hugs to all of you facing treatment this week.",
      "MessageIndex": 324,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 27, 2011 06:55AM ckk wrote: Still struggling with fatigue and aches, but I got a full night's sleep for the first time in ages. My taste is haywire, and my mouth tastes like metal. I now cannot tell if something is spoiled or just off because of my screwy taste buds.This sucks, Ladies. Remind me why we're doing this again? Heather and Bailey, I'll be thinking of you today, and I hope that all goes well.  I'm going to try to get moving more today to see if that helps with this feeling of fatigue. Maybe the treadmill Hugs to all. Hope your day is SE free.",
      "MessageIndex": 344,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 27, 2011 09:32AM ckk wrote: I didn't get the shot either. I have blood work on Thursday and will find out on Friday if I need it. My MO wanted to wait and see how I did. Interestingly, my hospital is participating in a clinical study designed to help doctors decide who should be recieving the shot proactively.",
      "MessageIndex": 349,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 3, 2012 05:55AM ckk wrote: Good morning ladies. It's been an interesting few days here. I struggled with fever all weekend, felt terrible, kept talking to the doctor, etc. trying to figure out what was going on. On Sunday, the shoe dropped. My husband discovered that oldest daughter had been sick with a sore throat since Thursday (my lowest WBC point) and hadn't said anything because she didn't want to worry me. She was still feeling lousy, so... simple test for you that you'll all pass with flying colors...kid is sick with a sore throat for 4 days, no other symptoms...guesses? BINGO! My H took her into Urgent Care and she was indeed positive for strep, so I had been immersed in a strep-infested environment at my lowest point for 4 days. Thank goodness that I was put on Augmentin proactively by my MO on Friday. I called the doc again, and she told me to go to the ER and get my blood count done. If it was still low, she wanted me admitted and on IV antibiotics and observed. The blood count was way up, thank goodness, and the fever down, so they sent me home after testing the other family members for strep also. They were all negative. H spent the next 24 hours wiping down all surfaces, knobs, etc with antibac wipes and washing linens, while I stayed in isolation in the bedroom. When the smoke cleared last night, we had a family meeting about what happened, how important it was for me to avoid pathogens during critical days in my treatment, and what to do if they felt ill. Lesson learned, hopefully. I'm feeling much better this morning - no fever, pretty energetic, and daughter seems to be on the mend, albeit a bit upset that BF had to go home :-).  He wasn't symptomatic, but given the way strep is passed along it was just too much risk to have him around possibly incubating a new case, putting me at risk for infection yet again. One of the hardest transitions for me has been to be a patient and thus need care from others, and to learn that I have to put myself first sometimes. Maybe that's not so bad? I'm hoping for at least one good week! Next infusion is on 1/12. Hope everyone is doing well.",
      "MessageIndex": 463,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 5, 2012 03:59PM ckk wrote: Hi everyone. I want to add a comment about the recurrence fears that we all have. I think that I posted before that I'm a melanoma survivor. When I was diagnosed 12 years ago (at age 39), I got the %$^& scared out of me when I read the horror stories and was convinced that I would not see age 50. I did not listen to my doctor, who kept telling me that my prognosis was excellent, and my loved ones, who tried to keep me focused and positive. Well, here I am at age 51, trading melanoma stories with other people newly diagnosed and giving them hope. WE will be that person 10, 15, 20 years from now when our friends, colleagues, sisters, and daughters are diagnosed with this disease, telling them our story and giving them strength. We will be SURVIVORS who will emerge from this battle stronger, wiser, and more compassionate to those around us because we will intimately know suffering and fear. I read about all of your struggles, I think about mine, and I marvel that we all get up and face the next day with such courage. This disease takes so much from us and still we prevail, and indeed we triumph. We are here because we are smart, trying to educate and arm ourselves in the best way possible. How many times have you quoted something that you've learned here, and someone, maybe even a practitioner, has said \"I didn't know that!\".  My day has been much better today, probably equal to a normal day. I realized that even the smallest chores make me smile, because being able to do them is a victory! Who would have thought that cleaning the kitchen would be pleasurable? And, on a much better note, I ordered my spring seeds today! Any other gardeners out there?",
      "MessageIndex": 506,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 11, 2012 05:24AM ckk wrote: Ugh, Heather, I can relate, having just gotten over strep. My new best friends: surgical masks for the down WBC days, antibac wipes, and antibac hand gel. I've also instituted a no guest policy during days 7-10 post chemo. It's scary how easy it is to pick up whatever is around when we're immune suppressed, and many people go out when they're sick. I say, be selfish, take of yourself, and get some rest. Hang in there!",
      "MessageIndex": 569,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 13, 2012 06:57AM ckk wrote: Good morning ladies. Restless night's sleep last night from the steroids, but my nausea is way better this time around, due no doubt to the Emend and Aloxi given yesterday. My MO said that she only prescribes those if a patient \"fails\" on the others, since most insurance companies don't cover off the bat. Shame on them! Rachel - yes, the WBC number difference is a unit thing. Normal WBC is 4.8-10.8, or 4,000-10,000. My last day 7, I was at 1.7 or 1,700, and rebounded to 3.3 a few days later when I ended up in the ER, and then back up to 10 right before this round. My MO felt as though I won't need the neulasta shot moving forward unless things change, but did reiterate being cautious on days 7-10 with hygiene and avoiding big crowds. You may remember, I caught strep from my daughter when she returned home with undiagnosed infection on day 7 last round. Annie and Wave, I hope that you're feeling better today! Lisa, still shedding, but no one would notice any hair loss. The caps went very smoothly yesterday, and the ativan right before the first cap seemed to take the edge off. That 4 hours at the end is tough to take, mostly because I'm tired and want to take a bath, etc. But all in all, a much better experience. The nurses at the onco center were so excited to see my full head of hair! They're eager to tell other patients about it, and I think that I mentioned that the nurse that I had yesterday would like me to talk to her wellness group for newly diagnosed BC patients. heather - I have continued to exercise through this and I do feel better after I go to the gym. My trainer is working to be a certified cancer trainer and he's been great with modifying my routine depending on where I am in the cycles.  Gracie - I can relate to the food commercials! At one point, the only thing that tasted normal was cheese and cantaloupe, and those commercials were so frustrating! I hope that everyone has a good day today. Big hugs to all.",
      "MessageIndex": 598,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 15, 2012 07:00AM ckk wrote: Good morning all. It's day 3 post TC #2, and the fatigue monster has set in earlier this time. I pretty much sat on a chair or slept yesterday. The nausea has been much better this round since the MO changed my meds, which is good. I am getting the burned mouth feeling again, but this time I am being proactive - not brushing hard, not flossing, and rinsing with baking soda/salt after eating. It's been brutally cold here, and I have no desire to venture out this weekend. heather - So excited for you re: your impending greyhound and round #3. Almost done! Lisa- Have you called your MO? Maybe there's something that they can suggest. I hope that things are better today. Gracie & Wave - looks like we're both entertaining the Fatigue Fairy. I also visited my acupuncturist after treatment this time, and the tingling in hands and feet disappeared.  Josie - hope the aches are better today. heatherweather - Great on the Komen walk! My daughters and I want to do one in the fall. I have a question - does every person in the group have to raise the amount, or can you team up and pool? loulabell - welcome, we're glad that you're here. Hope everyone has a restful Sunday!",
      "MessageIndex": 618,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 22, 2012 12:07PM ckk wrote: Good morning all! Happy birthday Rachel!  Welcome, Missy and Kathy! Lisa, I'm with you on the cold caps - I want them OUT of here. They make infusion days so long. I am very glad that I decided to do them, and I am hell-bent on letting other women know that they have a choice. It's ridiculous that most people don't know about the caps, and that we have to google and dig in order to find out about them. heatherb8 - can you post a pic of Nitro? He sounds like a real sweetie. You are an angel for giving him a home. Josie - glad that the pain is gone. Whew! Heatherweather- my brows are hanging in, but my lashes are a lot thinner. My derm said that he would write me a Latisse script, but I'm holding off. I think that I can live with thin lashes, but if the brows really go, I'm pulling the trigger. I have really thick, dark brows and I think I would look very odd without them. I know that other ladies on this site have had very good luck with Latisse. For those of you with rapid heartbeat - my MO said that it was from low blood count. I've had it both rounds during my low week. I think that I'm climbing out of the fatigue hole. However, H came down with bronchitis, and is now on antibiotic, wearing a face mask in the house for the next 24 hours. The joke around here is that if it's my low week, then someone is going to get ill. I'm glad that I've been proactive with the antibacterial wipes all week - I think that I'm going to buy stock in Clorox. My biggest complaint right now is how DRY I am. It feels like I'm dry from the inside out. Dry eyes, dry skin, dry mouth. I drink and nothing seems to touch it. It's VERY cold and dry here, and despite my humidifier I'm parched. Anyone else having success fighting dryness? On  the subject of the\"call\" - I have a prequel. I was having mammos every 6 mos due to microcalcifications. I was given the all-clear to go on yearlies 4 months before finding my lump. Early October, I kept having the feeling that I'd missed my mammo, even though I knew that I wasn't due for months.Itbothered me so much that I actually called the mammo center to make sure that I had not missed my appointment. I was still bothered and kept checking myself, and the next week, on my birthday, I found the lump. I knew immediately that it was cancer, had no doubt whatsoever. Everything just clicked. I got the call only one day after biopsy, on my way out the door with my daughter. Unfortunately, she got the news real-time, no filtering, and I think that was hard for her. I do think that the experience of holding one another and crying has brought us closer, and she has been my cold cap helper on infusion days.  Have a wonderful day, ladies, and stay warm if you're in the chilly northern US!",
      "MessageIndex": 732,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 23, 2012 11:22PM ckk wrote: I'm having trouble keeping track of everyone's schedule. Anyone interested in posting their treatment dates? Maybe Lisa can compile them and add to the top post, or we can at least have them on one/two pages. Mine: TC dates 12/22, 1/12, 2/3, 2/23 followed by 6 weeks rads",
      "MessageIndex": 745,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 24, 2012 11:04PM ckk wrote: Good morning ladies. I went to the MO yesterday for my post chemo check. My count is low, neutrophils at 440. I still feel tired. I'm feeling pretty discouraged right now. It seems like life goes on around me and I'm stuck in this hole of crud - bad place to be - feeling lousy, scared of recurrence, etc.  I've been afraid that my other breast is growing cancer. I keep feeling aches and pains and twinges... spoke with my MO about it, and she suggested having a breast MRI when chemo is done to put my mind at ease and establish a baseline moving forward. I just feel like breast imaging has failed me. Three years of 6 month mammos that didn't pick up my tumor because of dense tissue. Ugh. Next infusion is in 9 days, and I'm hoping to squeak out a few good days. Sorry for the downer post, but I guess that we've all been down in this hole. :-/",
      "MessageIndex": 761,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 26, 2012 07:24AM ckk wrote: Hi everyone..first, I want to thank all of you for your support, kindness and encouraging words after my depressed and depressing post. After I hit \"send\", I went to bed for the rest of the day and tried to regroup, and reading those follow-ons really raised my spirits. You are all treasures, and thank you. I had my initial appointment at the radiation center this morning, and I am due to start rads on march 19. I have mapping the week before that (ct scan, tattooing, etc), and will have 33 radiation treatments. Since it's my left breast, they have to take extra care because of the heart on that side. The nurse really gave me a laugh today. She thought that I had creatively had my wig dyed with grey roots in order for it to look more genuine, and when I told her about the cold caps, she was shocked. lol. Good idea though. I am consistently surprised that no one seems to have tried the caps around this neck of the woods. I talked to the RO about having a breast MRI before starting rads, and she strongly suggested waiting until after rads were completed, since BMRI often gives false positives. If I have to have any additional testing, it would delay rads which I guess is not good. So that's the plan, after rads. Heatherweather - that's amazing that you reached your fundraising goal so quickly, and it's so awesome that you have the final one coming up so soon! My daughters and I keep talking about designing a tattoo to complement my new scar. Love the NED idea. Rachel - congrats on your performance. heatherb8 & Wave - I am not on antidepressants, but I am seriously thinking about starting. These lows are really low. I think that I also might benefit from talking to someone. Thanks for the suggestion. Lisa - I know that you sre getting ready for your final treatment - YAY! My MO suggested getting a BMRI, and then 6 months later, mammogram, alternating every 6 mos. My RO told me that BMRIs are not universally prescribed for dense breasts since they give so many false positives. My MO supports me getting them moving forward because mammogram definitely did NOT pick up this cancer, and she feels as though a combination of the two is a safe approach.  Madison - a \"new normal\" ...I guess that's the future for us. I want to think that we'll be posting upbeat wonderful stories a year from now, and not constantly thinking about the cancer beast. Have a great day, ladies!",
      "MessageIndex": 774,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 28, 2012 11:31PM ckk wrote: Momof3 - I take dexamethasone (2x per day) for several days around my treatments, and have steroids in my IV also. My understanding is that the steroids minimize nausea and and reactions to Taxotere, which can cause nasty reactions during chemo.",
      "MessageIndex": 808,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 30, 2012 02:51AM ckk wrote: When I had my radiation consult last week, the nurse gave me samples of different creams to try. They want me to apply 2x/day, starting 2 weeks before rads. The nurse said that two ingredients were key: aloe and Vitamin E, and to not use anything that contains metals. I am also trying to eliminate parabens from my personal care products. Anyway, I tried and liked \"Jeans Cream\" because it's not greasy and contains only a couple of ingredients (it was created specifically for patients undergoing rad treatments). It was available at my naturopathic pharmacy. It's also available online. There are active Radiation Treatment threads on this site. A lot of people seem to like pure aloe, too. ",
      "MessageIndex": 822,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 6, 2012 08:40PM ckk wrote: heatherb8, best of luck today! Your last one! Yay!! Rachel, so sorry about the key snafu, but how was the Chinese food? lt sounded so good. I've been craving sushi and of course can't have it until this immunity stuff is resolved.  Bailey, only a few more days until you're done, too. So glad for you. Robin, my racing heart thing seems to be during my low WBC days, and resolves as my count goes up. Have you talked to your MO about it? Annie, I hope that you stay well. My strep started with a bang - fever, exhaustion, etc. It took 24 hours to come on, so perhaps you're in the clear. Lisa, I'm jealous of your weather! That 45 minute walk is very impressive. You did great. I have been trying to get to the gym every day to at least use the treadmill, but I'm fearful of germ exposure on my very low days. I was there on Saturday, using the bathroom, and the woman in the next stall was sneezing and coughing up a storm. I felt like running out! Only that flimsy wall separating me from all of those germs, ugh. Mexican food sounds wonderful, too. My spicy tolerance has been wiped out by chemo. I used to be able to handle the hottest stuff, but no more.  Wave, hope you enjoy the \"Look Good\" session today.  I'm up early with a cranky stomach. I can't do \"normal\" meals on my low days (just snacks every couple of hours), so I tend to wake up hungry during the night.I was too tired to come down to eat something and now I'm paying the price :-(. Just took a prilosec and waiting for things to settle. Maybe I should put some bread or crackers next to the bed? I really want to get some light exercise today- it's going to be 50 here, so maybe a walk will be in order. Hope all of you are well.",
      "MessageIndex": 954,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 7, 2012 09:09AM ckk wrote: Heather, so good to hear that you had a relatively easy time today! My eyelashes are half gone. My eyebrows have thinned in the inner corners. My derm wrote me a script for Latisse, and if the eyebrows really go, I'm pulling the trigger. I read conflicting accounts in the other forums about timing of using something to help them grow back in, so who knows. I haven't had to shave since chemo started. I hope that I don't have to pencil in my brows, because I'm hopeless at that stuff!",
      "MessageIndex": 967,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 10, 2012 09:00AM ckk wrote: Rachel, lol. Love it! Whew!",
      "MessageIndex": 1032,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 13, 2012 03:00AM ckk wrote: Happy Sunday all..  winter has returned with a vengeance here- 18 degrees, with a wind chill of 9, Brrrr. I discovered a great way to cope with hot flashes - step outside! You don't even need a jacket! lol Hey, I've been checking out some of the other threads on this site. I must say that we have built a great support system here, and I am grateful to all of you for that. It's not pretty on some of the other forums (not naming names).Really, it doesn't cost anything to be nice. Anyway, oldest daughter is on her way back to college (bad), and I am feeling much better today (good). The two girls and I made fudge and cupcakes last night for her to bring back to school for her hallmate, and it was so much fun. I almost forgot about all of this crap.I haven't regained my sweet tooth, which feels strange. Have any of you also had a drastic alteration in food preferences since dx? Wave, I forgot to mention that I've had those cysts before. They went away on their own, but like Gracie said, it's really a good idea just to run it by the MO. Let us know what happens.That flu analogy must be pretty common, I've heard it from people before, too. My usual response is that flu is to chemo as kiddie pool is to tsunami. When it comes right down to it most people just don't get it. I hope that the quiet here means that everyone is busy and happy. ",
      "MessageIndex": 1064,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 16, 2012 11:29PM ckk wrote: Wave, I was never a big alcohol drinker. I'm petite and it doesn't take much to make me sloppy. I'm sure that I will still have an occasional drink to mark a celebration, but that study gave me pause. That being said, if your MD suggested wine for the heart benefits, I would have a discussion about it given your BC dx - weigh the benefits vs the risks. This is my personal take on all of this stuff: this experience really sucked and I would much rather not have to go through it again. I know that there are some cancers that are destined to return no matter what, but I don't know if my cancer is one of those. If there's anything that I can do to avoid another ordeal like this, I'm gonna do it, but I've decided to be smart (aka not overboard) about it. If there's a reasonable study or credible info about what to do (eg exercise) or what to avoid (eg excessive alcohol, BPA exposure), I'll take that to heart and do it. Maybe it will make a difference, maybe it won't, but it will make me feel like I've done what I can to control the outcome. Oh, and I've decided that I don't give a patootie about wrinkles, grey hair, or bags under my eyes. That's now, anyway. Ask me again in 6 months. :-)",
      "MessageIndex": 1124,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 19, 2012 10:32AM ckk wrote: Karen, since my periods have stopped and I'm flashing like crazy, I asked my MO whether, if I am indeed menopausal, I would take Arimidex or Tamox. She said that you have to be post-meno for at least one year to go on Arimidex. YMMV though. Lymphedema: I had a bit of an argument with my BS about this. I had one node removed, and had read that if you have ANY nodes removed you are at risk for lymphedema so a sleeve is necessary for flying. My BS said no, that there was \"no chance\" of lymphedema in my situation. Yet, you read the lymphedema threads here and they are filled with women who develop LE after just one node removed. So, I plan to get fit for one. My insurance covers it, my MO will write an rx for it. Why worry? Supplements: my acupuncturist is hoping to put me on all sorts of things, both to \"detox\" from the chemo and boost immunity. I figured that I'd make a list and run it by my MO. My MO currently has me taking D3, Vitamins C&E (for hot flashes), iron, and B complex for neuropathy.",
      "MessageIndex": 1161,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 2, 2012 06:49AM ckk wrote: robin, that's interesting about what the new RO said about the timing of radiation, and it makes me wonder if there's no good agreement on it. I very much wanted to wait a bit and recover, but my RO was insistent that I start within 4 weeks of finishing chemo. It's great that you found a closer center - 3 hours is a VERY long round trip for a daily treatment!",
      "MessageIndex": 1330,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 3, 2012 11:56PM ckk wrote: Good morning all.. I had a bit of a freak out last night after reading about odd reactions to taxotere, so I called my MO, since I was having nasty phlebitis symptoms. My MO wasn't on call, but the alternative MO was actually really great. He hadn't heard about the issue but was going to research it over the weekend, and said that the chemo drugs are actually pretty tightly controlled and inspected by the FDA. He even offered to meet me in the ER to look at my arm, but by that point I had calmed down :-). Anyway, if anyone hears anything about this please post it for the rest of us, and I'll do the same. I'm hot flashing to beat the band, and I think that the local power company could hook up and use me as an alternative energy source at this point. The thumb twitching has really quieted down, which is good. Maybe that can be an energy source too? Bailey, how does your RO know that you're going to have blistering in advance? My RO told me that they can't predict who will have issues, which is why they tell everyone to use aloe based creams twice per day. You're right, it sounds like his bedside manner leaves a lot to be desired. You'd think that an RO would get the fact that we've already gone through hell and back and thus be kinder. If it was me, I probably would have said something like\"sorry if my large breasts are getting in the way of doing your job...looks like your attitude is getting in the way of your compassion to patients\", but I have no filter these days, lol. Rachel, that handicap plate sounds like a fine idea. No need to tough it out, you deserve some special attention for now. Have a good weekend, everyone!",
      "MessageIndex": 1362,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 10, 2012 02:25AM ckk wrote: Robin, I loved reading your posts today, so full of energy! I'm wondering why writers don't take steroids, considering how it makes all of us so voluble! lol. Your concert sounds wonderful. H and I used to go to the BSO and Handel&Haydn society regularly, but since life got so complicated, no more. I'm guessing that the Ativan will help you sleep, and you're right, being more fatigued is NO guarantee of  good, or any sleep. I too love blintzes! I don't make them often, and I wish that I lived close enough to attend your blintz event. Robin, my legs get very tired too.Let's hope that it resolves soon. Wave, pass a scone this way. I've been less in love with sweets since being dx'd, but I'm still a sucker for sweet breakfasts. heatherb8, my rad nurse told me to be proactive with the aloe cream, just in case. Annie, I hope that Mom is okay. What did you decide to do about your surgery date? I took advantage of the nice weather yesterday and went for a very long walk. I was exhausted when I got home, and then compounded it by going grocery shopping. It's so disheartening to see that normal activities are beyond my reach. I have acupuncture today, and my BMRI on Monday morning. I am feeling very anxious about it, as I have dense breast tissue, never had one, and I'm worried that \"something\" will show up. My MO told me that she would call me Monday night with the results. Keep your fingers crossed! Happy Friday, and a good weekend to all.",
      "MessageIndex": 1427,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 13, 2012 09:35PM ckk wrote: Good morning all... Annie, is your surgery today? If so, I am thinking about you, and hope that all goes well! Bailey, sorry to hear about your cold. Hopefully the warm weather will make it go away faster, or at least you'll feel more pleasant! Momof3, glad to hear that you're feeling more energetic, and I can relate to taking on more than you can handle. I too am impatient to get back to regular \"me\". I have also been overeating, and recently downloaded a free app called \"Lose it!\" to help keep my calorie intake in check. I have 15 pounds to lose from this ordeal. Gracie, I also took 2 walks yesterday! The weather here in New England was absolutely beautiful. It DID feel good to move, to breath in fresh air, and to feel the sun on my face.  robin, I am going to steal your idea about talking the RO about my mapping and avoiding my heart and lungs. I too am having left breast radiation, and mine starts on the 19th. I had my mapping last week. My rad center recommends Jeans Cream 2x/day during radiation treatment. It contains only Vit E and aloe. Rachel, I hope that you are better today. One more to go! We will be cheering you across that finish line, girl! In case any of you ladies didn't catch it on the FB page, my BMRI was clear! Yay!! The report said that I have lots of areas of very dense tissue,so my MO wants me to have BMRI, followed by mammos 6 months later moving forward. For the first time, I feel like a BC survivor instead of a BC patient. Now all I have to do is get through radiation, lose 15 pounds, get my strength back, regrow my eyebrows and lashes, and survive Tamoxifen...LOL. AHHHH!! I know, it never seems to end, but being here sharing it with all of you makes all the difference. Have a great day, all.",
      "MessageIndex": 1451,
      "PostDate": "13/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 14, 2012 06:59AM ckk wrote: Good morning Ladies! Erica, I am starting rads next week, 4 weeks PFC. You usually have mapping about a week or so before your first treatment. You'll need to schedule an appointment with your RO to know the timing for sure. A vacation sounds great!  Bailey, heatherb8, & Deb, have you thought about gentle yoga for your back/legs? I know that my back has been cranky, mostly from inactivity, and gentle stretching has improved things quite a bit. Also, if you've had extensive surgery, your back might be finding it difficult to adapt to the new \"you\". Annie, so glad to hear that all went well! One more milestone accomplished! momof3, I'm so sorry about your son's friend. That's a lot for your little to guy to handle at once, especially after what your family has gone through. Is there a school counselor that's talking to the class? I'm sure that his friend's Mom would appreciate a kind word from you. Hugs to you and your little guy. Rachel, hope the mouth is ok. You're the pioneer of the oil swishes, hope it works for you this time! I'm still not sleeping well. Is anyone else PFC still having this problem? I wake up constantly and then find it tougher and tougher to get back to sleep. There was a whopper thunderstorm here last night, which happened to wake me up during my only good sleep, darn it. Coffee gets me through the morning hours, but by afternoon I'm a wreck. I'm sure that the hot flashes don't help. Hugs to all!",
      "MessageIndex": 1464,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 14, 2012 10:03AM ckk wrote: Wave, I too start rads on the 19th. My first appt is a simulation, with the first real tx on the 20th. Rachel, the SEs are cumulative, and you've had one more than most of us. Plus, you're in the prime yuk phase. That \"Twilight Zone\" feeling is a really apt description of how it feels when you're in the depths of feeling out of it. I know that it's really hard to see your way out, and to wonder if you'll EVER get out, but you will. It's really hard to hang on when you're in the thick of it, and I wish that we could all be there and give you a hug and talk you up. Please be good to yourself, rest, and play those damn games. They're actually good for your mental acuity! ",
      "MessageIndex": 1468,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 14, 2012 04:53PM ckk wrote: Hi Jen, welcome. Like Annie said, we pretty much run the gamut of every ache, pain, SE, emotion, and challenge here! Annie, glad that you're feeling good enough to take a walk!  I just got back from youngest D Parent/teacher conferences. If I ever needed a reminder as to how tired & weak I am from chemo, I got it today! Her high school is huge, on two floors, and I found myself having to rest in between flights of stairs. Wow, I don't remember the school being that big before! lol  I need some tea and a nap. ",
      "MessageIndex": 1478,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 15, 2012 07:17AM ckk wrote: Good morning! heatherb8, and others going through radiation, there's a good thread in the Radiation section of BCO that has a letter from an RO explaining what happens to you during rads, it's worth a read:  community.breastcancer.org/for...  I've been reading about what things will encourage cell regrowth after radiation, and it looks like protein and sea vegetables get the nod. Idontdosick, I also agonized over the decision to keep my breasts, but the two BSs and two MOs that I spoke to were adamant that, in my situation, either decision statistically would have the same outcome, so I opted to not do the BMX. In the end it's about trusting your health care team and your gut.I notice that we have a very similar disease profile, so I assume that your conversations with your doctors were much like mine. We've thrown everything possible at this, and as my MO reminds me constantly, \"the prognosis is excellent\". What seemed to really get me back on track was my clean BMRI. It allowed me to feel as though I am starting at square one, cancer free, and now armed with a hefty arsenal of weapons (Tamoxifen, radiation) and vigilance (frequent scans and blood tests).  Bailey, I hope that you're feeling better today! How's the new doggie? Gracie, glad to hear that your exchange surgery is scheduled! It's nice that the weather is allowing you to get moving, even if the moving is hard. I can relate! Lisa, that long walk is very impressive. I'm sorry about the delay in surgery. Hopefully the xtra time will allow you to get even stronger and thus recover more quickly afterwards. It would be so nice to tell our bodies to hurry up and heal, but they seem to be on their own schedule. Annie, did you get out for a walk? How are you feeling today? Momof3, how is your son doing?  Wave, I'm taking an iron supplement suggested by my MO for the windedness/anemia. I hope that you're better today. Someone upthread talked about night sweats...that's definitely what I'm having at night. Last night I ended up stripping down to bra and panties, but still ended up soaking the sheets. I pushed myself to stay up a little later, thinking that it would prevent me from getting up for the day at 3am and it seemed to work. I still was up and down all night, but I was able to get back to sleep until about 5:30am. I am officially off prilosec today! Yay! I am going to clean off my dresser this morning, put away all of the meds and other things that I needed close access to during chemo. I am also designating this as \"thankfulness day\" - I picked up a pack of blank cards and I am going to write thank you notes to those who helped me through this ordeal thus far - my MO, my family, a few close friends, and the wonderful chemo nurses.  Hope you all have a great day!",
      "MessageIndex": 1485,
      "PostDate": "15/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 21, 2012 07:22AM ckk wrote: Good morning all! Michelle, I'm so glad that you decided to post, and welcome. I am still \"puffy\" but all over, not in one particular area. You mentioned that you are diabetic - which one of your physicians (is it your endo?) looks after that condition, and can you consult with them?I'm thinking that your primary may be a good choice, as they can help to point you in the right direction even if they don't know why you're having this problem. That comment from your MO would have irritated me too. I know exactly how you feel about wanting to move forward already...it's enough! Let us know how it goes. Rachel, isn't it funny how this dx really brought into focus who friends really are? I'm glad that you're getting a chance to sit down for a couple of days, and good luck on the pledge drive! heatherb8, funny you should mention the stomach/supplements issue. Mine are bothering me too. In fact, my tummy in general is unhappy these days PFC. Glad that you're sleeping better! I have night sweats every night, followed by bone-chilling cold for several hours, ugh. Gracie, hope that your weather improves today. The two weeks without exercise will hopefully pass quickly, and the weather will be better too! Jen78, that's very impressive weight loss! Wow! You're doing great, don't be hard on yourself. It's amazing how much our bodies have been through over the last few months. Wave, hope you're feeling better today, and yay for getting back on the treadmill! How goes the rads? robin, hope that you're less tired today. karmil, my eyelashes are pretty much gone too, and most of one (?) eyebrow. There are tiny hairs starting to grow, but they're not coming in very fast, Argh. I had my first rads yesterday. I met with the physicist to go over the mapping. I was anxious when they showed me that the beams cross over a small section of my heart and lung, until they showed me that they're using \"leaves\" (metal plates) to block the beam in that section. I even had them show me the plates in place before starting. Here's hoping that they're doing their job well! The tx was uneventful, but I have been feeling little shooting pains in my nipple area. Anyone else feeling that? I had a milestone yesterday. I had been biking 30 miles per day when I was dx'd, and coincidentally, bought a beautiful new racing bike on my birthday, the day that I found my lump. After radiation yesterday I was feeling bummed out, like a \"cancer patient\" again, so I loaded my bike on the car, went down to rail trail where it's flat, and rode my bike! I felt tired and achy and had a good cry afterwards, but it felt SO GOOD. Don't ask how I'm feeling this morning :-) Have a great day all!",
      "MessageIndex": 1533,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 31, 2012 07:52AM ckk wrote: Happy Saturday... I went down into the rabbit hole yesterday, ugh. I'm still having breast discomfort, and even though I had a clean BMRI, and the MO said that it's hormonal from being thrown into menopause, I couldn't stop worrying. I made the mistake of reading some of the other topics on this site that made me worry more, this time about bone mets. Topping it off, I started to watch a pretty violent movie with H last night (remake of the Planet of the Apes movie - WTH? The original wasn't violent), and couldn't finish because the violence was getting me so stressed out. I ended up going upstairs and curling into a ball. I tried to talk to my H about it, but he doesn't get it. How can anyone get it if they haven't been through it? I'm hoping for a better day today. It seems like we're all going through something similar right now, and it makes me wonder if this is a timing issue since we all had surgery/tx at about the same time. I think that I read somewhere (maybe Rachel posted this?) that the s*&% hits the fan at month 6, so maybe that's it?  robin, glad you found that wig, it sounds beautiful. I agree, there are too many opinions and ways to do things. momof3, sign me up for that shower scanner.I wish that I had that nifty portable medical scanner that they use in Star Trek. Bailey, I start Tamox after rads too. I never heard of anyone starting them sooner.  Rachel, I hope that you're feeling okay today. Karmil, yay on driving again! I hope that the time goes fast before you start exercising again. It sounds like your doc is pretty serious about it. Leesa, are you better today? I wish that I could give everyone a hug, I think that we all could use one. I don;t know what I'd do without all of you. Thanks so much for being here.",
      "MessageIndex": 1638,
      "PostDate": "31/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Apr 5, 2012 10:27PM ckk wrote: Rachel, interesting link. If you look around on that site, you find out that lung, prostate, and breast are three most common cancer diagnoses : www.cancer.gov/cancertopics/ty...  I think that you've nailed it, that BC gets the funding because women have been clamoring for a cure. Our voices have impact - just look at the fallout from the Komen debacle a few months ago. I think that speaking up is particularly important when you look at recent efforts to deny women health care coverage for birth control based on politics and ideology. I met a 12 year BC survivor last night at D's Jazz concert. I love meeting long term BC survivors!",
      "MessageIndex": 1679,
      "PostDate": "05/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Apr 9, 2012 09:05PM ckk wrote: Bailey, the dietician/RO said nothing over 100% RDA for Vitamins C&E, so I'm assuming that your multivitamin is ok? I do wonder if there's good science to any of this since the recs are so variable from doctor to doctor. I don't wear anything during treatment; I just lie there with my arms up, and they line up my three tattoos with the laser sights. No special breathing, either, but the rads machine blocks my heart and lungs on one corner. Wave, your grandchild story made me so emotional. My biggest fears are that I won't be at my Ds' weddings or see my grandchilden. I can't imagine that you will take any of those moments for granted from here on out.",
      "MessageIndex": 1697,
      "PostDate": "09/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 5, 2011 10:24AM ckk wrote: Hi all. I am starting TC on December 22. I am 3 weeks post lumpectomy with one SN removed.  My oncologist feels as though at my age (51), tumor grade (3), and LVI, that it would be advisable. I am nervous, and not sleeping well. Some questions: is anyone else battling constant fatigue?I am trying not to worry that it's due to possible spread, but from recovery and psychological factors. Also, is anyone else here trying the Penguin Cold Caps to keep their hair? I just ordered mine today.  Good luck and hugs to all of you wonderful women. These boards have been terrific for me post-diagnosis!",
      "MessageIndex": 216,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 7, 2011 12:19AM ckk wrote: Heather, wanted to add that I also have had sky-high blood pessure readings since diagnosis. I guess that it's indeed normal, since no one has raised an eyebrow when the BP is taken. It's good to know that yours has calmed down. I hope that it stays that way!",
      "MessageIndex": 109,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 11, 2011 05:57AM ckk wrote: Kim, that's great. I'm glad that your 1st treatment went well and that you're holding up fine! My 1st is on 12/22. My current project is learning how to use the cold caps, and retinkering my nutrition. I just bought a couple of books on Amazon. I am curious to see if eating certain foods will ease the chemotherapy SEs.",
      "MessageIndex": 163,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 13, 2011 05:02AM ckk wrote: Good morning, everyone. I was busy all day yesterday, came home exhausted. I think that taking melatonin to get to sleep makes me very foggy the next day.I am looking forward to the day when I get my ebergy back, but I'm thinking that won't be until spring. I really hate this! I was always such an energetic person. Lisa- I'm so sorry about Daisy. Pets give us so much comfort in times like these, and I can't imagine your heartache right now. Wish I could send you strength, and I hope that she turns a corner and stays longer. Ann- you are so courageous! This whole damn BCthing is so de-powering, that to hear the empowerment in your words is wonderful. I am sure that you rock it! I hope that your throat is better today. Kimby- so glad that you continue to feel good. Rachel- I'm rooting for you! Please let us know how it went. Heather- glad things have calmed down. Wouldn't it be great if we all lived nearby and could come to the rescue bringing benadryl in times like these? I am going to the gym today and have a fundraiser to attend later. Let's hope that I don't collapse later, lol.",
      "MessageIndex": 185,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 14, 2011 09:48AM ckk wrote: Hi Ladies...got my books today. I was reading \"The Cancer fighting Kitchen\" and came upon these suggestions for off-taste SEs: Metallic taste: Add sweetener such as maple syrup or agave and a squeeze of lemon. Also try adding a bit of fat. Too sweet: Start by adding 6 drops of lemon or lime juice, until sweet taste is muted. Too salty: 1/4 tsp lemon juice. Too bitter:Add a bit of maple syrup. Cardboard taste: Add sea salt until the flavor of the dish moves to the front of the mouth. Lemon juice also helps.  Ann, the book suggests that you add a bit of fat to your food for swallowing issues. It sounds like it's a fairly common SE.  There's so much good info in this book re:what to eat during and after the chemo days. Hope everyone is hanging in there. Nine days til my 1st treatment. Lisa, I'm so sorry about Daisy :-(",
      "MessageIndex": 192,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 22, 2011 06:50AM ckk wrote: Good morning ladies...chemo round #1 for me today. Husband is out picking up the dry ice for the cold caps. Hope everyone is doing well today!",
      "MessageIndex": 283,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 26, 2011 01:31AM ckk wrote: Merry Christmas and Happy Chanukah (Day 5) to all! My nausea has calmed down, and I am now having a bit of trouble swallowing so I have switched to soft foods. No more leg achiness, thank goodness. I hope that you all have a wonderful day, and remember, next year at this time this will all be behind us! Carolyn",
      "MessageIndex": 311,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 28, 2011 07:17AM ckk wrote: Good morning, Ladies. I seem to have rebounded from the extreme fatigue an aches. I felt almost normal by last evening - my teenaged daughter had friends over, we made brownies, and it almost felt like pre-BC days.I'm hoping that things continue to stay stable today, with no new surprises. I have a couple of questions for all of you - were you given any guidance about flossing? I was doing it as usual, and then last night after flossing I had significant gum discomfort that lasted pretty much all evening. I'm wondering if I should back off during chemo treatment, but that seems foolish. Also, does anyone go to a chiropractor? I was going to one occasionally before DX and could use some adjusting with all of this sedentary stuff, but didn't know if it's a bad idea. Any thoughts? April, welcome, and I hope that your Mom can chime in when she's ready. I'm sorry that she had a rough time of it, and glad that things turned out ok. Yes, one lesson here is that every day and every treatment is different. I have that same cookbook and have used it extensively - I love it! I actually used a trick last night recommended for taste changes in the book - I squirted lemon juice on some baked squash that tasted like liver to me (yep, liver), and it worked! It tasted like lemony squash. I was astounded. The ginger tea recipes in the book are terrific. Heather, so glad that treatment went well! I had mine in the forearm, too, and it was very sore for a couple of days afterward. There's a pretty big bruise there now, too. I hope that you are feeling good today, and don't forget to drink that water. Wave, I hope that you're in a better frame of mind today. How are you doing? Annie, I'm with you, I can't imagine doing this every other week with the exhaustion and SEs that it brings. How would people cope? Are they starting to try this because it's more effective, I wonder? BJMRN, hopefully those meds you were given are making you feel better. It sounds like your immune system was overwhelmed and couldn't keep up. Can your doctor give you anti-thrush meds before the next treatment? Josie, I had the burnt tongue feeling, too. I found that if I was very conscientious about rinsing and brushing after every meal, it got better. I also stayed away from hot drinks and foods. Robin, I hope that your fatigue is better today. Mine got better quite suddenly, like turning on a light switch, poof. It was strange. Who else is getting treatments this week? Is it Bailey and Annie? I hope that all of you have a good day. This place is awesome, and I wish that we all lived close by.",
      "MessageIndex": 362,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 28, 2011 01:33PM ckk wrote: Update on the flossing and the chiropractor - my MO said to lay off flossing until my mouth was not as sensitive in a few days, to brush gently with a soft toothbrush, and rinse 4x/day with a salt/baking soda rinse. I'm glad that I asked, because I probably would have tried it again. She ok'd the chiro, so off I went, and my goodness, what a huge difference it made! I was astounded at how much better I felt when I left, and he hardly did anything except adjust me very gently. Bailey, he echoed your chiro and wants to see me the week after each treatment, and said to force fluids all through chemo to hasten the toxins leaving the body. Josie, I hope that you're better soon, and Wave, glad that you're better. April, you keep on being Mom's advocate! You're doing a super job and she's very lucky to have you.",
      "MessageIndex": 371,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 31, 2011 09:27AM ckk wrote: Forgot to weigh in on the whey protein powder discussion. I use Bob's Red Mill Whey powder, because it's ONLY whey protein, doesn't have all of the artificial ingredients and filler crap that other protein powders do. I've been trying to eliminate all unnecessary artificial/harmful ingredients from my diet and personal care given this BC diagnosis. The Bob's powder is not flavored, so you have to add it to a food that already has flavor, or add something with it to mask the taste a bit. But I do think that's it's much better for you (take a look at the average whey powder can ingredients - yikes!) It's available on Amazon for those who don't have stores that stock Bob's Red Mill products: http://www.amazon.com/Bobs-Red-Mill-Concentrate-12-Ounce/dp/B000EDG5CA/ref=sr_1_1?ie=UTF8&qid=1325341302&sr=8-1",
      "MessageIndex": 427,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 12, 2012 06:08PM ckk wrote: Well, #2 down! This infusion was much less stressful than the last. We had the cold cap routine down, and the nurse that worked with me runs the Wellness Seminars for BC patients, and was very interested to learn how the caps work. She wants me to come to a seminar after I've finished my treatment and tell others about my experience. I also received two new anti nausea meds in the IV today - Emend and Aloxi, in hopes that my crabby stomach will behave over the next week. I already feel better now than at this point last time. My WBC shot up to 10,000, so the MO does not want me to get the Neulasta shot. The worst part of the day was the 4 hour cold cap rotation at the end of chemo. It was a drag, I was tired, and I wanted to get it over with. I have had some shedding today and yesterday, but it's comparable to what I would find in my hair brush most weeks. I'm hoping for a good night's sleep, but with the steroids, who knows!  Hugs to all undergoing treatment this week. ",
      "MessageIndex": 594,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 13, 2012 12:10PM ckk wrote: Heather, my understanding re: cold caps & the brain is that it's not so much the brain as the scalp. There are certain systemic cancers such as leukemia that people should not use the caps, as it's important for the chemotherapy to reach as much of the body as possible. The chances of metastasis to the scalp in BC is pretty much nonexistent, far less so than lung, or bone. I spoke at length with both of the MOs that I consulted, and both had no problem with using them from a mets basis, although they were both skeptical that they worked at all. The caps are used pretty extensively in Europe (where they also covered by insurance), and there have been far more studies done there on long term use. I'm guessing that we will eventually see more studies here, especially since there was recently a clinical trial (maybe two) done in the U.S. on the road to getting approval here.",
      "MessageIndex": 601,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 19, 2012 06:40AM ckk wrote: Hi Ladies. I am wiped today, with a fast heartbeat, so I know that my WBC is down down down. I am trying to lay low and ride it out. Stomach is very cranky, and my \"pass through\" time is at an all-time high lol. My mouth is better, but still not up to speed. I have an irritated/red/painful vein above the latest injection site. I called the MO office, and the nurse said to apply heat 20 minutes x 6 times or so today and watch for a temp. I really don't want an infection, dammit. Let's hope that I don't have to drag myself in there tomorrow. I can definitely relate to being impatient with people's reactions to what we go through. Maybe we should start a new thread - s&%$ people say when they know you're battling breast cancer? Here's my personal favorites (with my unsaid replies in parens lol): \"It could always be worse, you know\"  (you mean, if it was YOU?) \"You are an inspiration\"   (just don't say anything if you can't think of something, honey) \"Please call me if you need anything\"  (ok, can you stop pretending I don't exist? sheesh) \"I hope that you know that I've been thinking about you\"  (nope, not psychic) I think that most people mean well, but cancer brings out the TRUE in people. If they're givers, they continue to give, if they're takers, they relate everything back to themselves. It's hard to see these things when we're in a bad place, and I do think that it's fundamentally changed my perception of the world. I know that I will be a different person when this part of my journey ends, and maybe that's not a bad thing. I know that I'm naturally a giving person, and it was a shock to realize that I could not depend on some that I assumed would be there, even for emotional support. But this will make us all stronger, and wiser, I think. On the flip side, it's also produced some incredibly beautiful moments when I saw the kindness in some. Hope everyone's day is a good one. I am thankful for the honesty we have here!",
      "MessageIndex": 662,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 19, 2012 08:48AM ckk wrote: OMG, Wave, I've gotten that too -  \"my so-and-so just died of BC\" , like it's just a normal conversation they're having with you. Argh! Where do you go from there? I'm stumped. By the way, I think that there might be something to the olive oil trick. I've been doing it this round, and my sore mouth only lasted a couple of days and taste is returning - much faster than last time. It's kind of gross to choke it down, though.",
      "MessageIndex": 666,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 19, 2012 09:09AM ckk wrote: Heather, I don't remember who posted it originally, but it was 1 Tbs twice per day. I swish it around in my mouth and usually spit it out, because I just can't abide the fast pass through these days, ugh. It's weird, it seems to coat and heal and magnify \"good\" taste all at once. My taste buds are almost completely normal today, day #6 post chemo, and last time they were trashed for almost two weeks.",
      "MessageIndex": 670,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 24, 2012 12:01AM ckk wrote: Wave, I like the idea of adding the dates to my profile! Done and thanks. Hopefully others will consider doing this - I really want to keep track and can't!",
      "MessageIndex": 747,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 30, 2012 11:23PM ckk wrote: Madison & Robin - Good luck today! Let us know how it goes. Gracie - Hope you're more rested today. We all know that this isn't the \"end\" just because you've had the last treatment. The SEs are cumulative, especially the fatigue, and it will be an uphill climb to chemo recovery for all of us..but we'll get there together! Heatherweather- putting all of our names on your Komen walk shirt made me teary, that is so sweet. We all share a bond that is unbreakable now. I do not get tested for that tumor marker, but now I will surely ask my MO about it. I don't blame you for feeling anxious about it! One thing that they do test every time is my Vit D3 level. Mine has been chronically low, and now there are studies that link low levels to BC and more aggressive tumors. I started on one 2000 IU pill last summer before I was diagnosed, and my level did not increase. I've doubled it over the last few weeks, and if that doesn't work, my MO will prescribe 50k IU, taken once per week. Lisa - I couldn't swallow the olive oil, so I just spit it out. It did seem to help me. I wonder whether any fat will do it, like coconut oil? Heatherb8 - loved the song! Bailey- I will be here all through radiation and beyond!  Erica - hope you're feeling better and the fever is down. I came down with a strep infection after the first treatment, and Augmentin knocked it right out. Clorox antibac wipes are now my best friend. I start and end every day by wiping down all \"touched\" surfaces in the house, including light switches, door knobs, etc. I also use my own pen when I'm out and about instead of signing paperwork with the pens provided, and use hand gel after using ATM machines. Annie - I've gained about 5 pounds since starting treatment. I do think that it's from water retention. Hope I haven't forgotten anyone! I think about all of you each day, and I will also be here for the long haul. I have treatment #3 this Thursday, and I'm not feeling 100%, dammit. I ordered a book from Amazon about chemo brain, and how to bounce back more quickly. I hope that I remember to read it, lol. Have a great day, all of you!",
      "MessageIndex": 834,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 1, 2012 07:46AM ckk wrote: Hi all... wow, lots of activity here over the last few days! I am getting ready for TC #3 tomorrow, and I still don't feel all better from the last one. Like Lisa, I use the cold caps, and it makes for a VERY long day. I have been having hot flashes like mad over the last couple of days, and I know that that will make my MO very happy, as I'm ER+. I won't miss that part of my life, that's for sure! I too have been suffering from brain fog issues, and my most troublesome issue is word retrieval problems. I bought a book entitled \"Your Brain on Chemo\", which explains that it's really a physiological thing, proven by brain scans, and then gives concrete suggestions for getting your brain function back.  About the FB group, I know that other groups on this site have migrated to a more private venue over time, and it seems as though as we get to know one another, it might be useful to have a place to discuss things that aren't available to the whole Internet community. I am not comfortable, for instance, broadcasting travel plans to the world if we decide to get together..it just seems unwise for a group of women.Anyway, if someone has a better venue idea, that's great. The group can be \"secret\", so that your posts are not visible to anyone, and not on your page, and it certainly can be named something not BC related. I too have not broadcast to all of my FB friends about my BC. Anyway, PM me if you want to join, or suggest something else, maybe? Wave, so sorry about your vein. It sounds like the second nurse really knew what she was doing, though. I too was surprised that radiation doesn't start until 4-6 weeks after chemo. I don't start until mid-March. The way that it was explained to me is that they want you to be back up to speed, with fatigue and immunity issues behind you. Bailey, I sent you a friend request! Robin, I agree, it's wonderful to see how our kids can step up during these times! My two daughters have been my champion cold cap helpers. I couldn't do it without them! Annie - good luck today! Last one! Rachel - I've tried to post photos, too, and haven't been successful. I'll sign up for Snapfish and check them out. Heatherb8 - hope that the back is better today. Only one more to go for you! Madison - hope that you get the reduction you're looking for. I'm keeping my fingers crossed! Lisa - yay! Bye bye cold caps! I hope tat you're doing ok today. I'll be rocking the caps tomorrow. I hope that I haven't forgotten anyone. I'll check in after my treatment tomorrow!",
      "MessageIndex": 870,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 5, 2012 04:10AM ckk wrote: Oh no, Annie!! The exact same thing happened to me after TC #1, when oldest daughter was in the house for 4 days with undiagnosed strep. I came down with a 101.5 fever 24  hours after she got home. Here is what I would do: call your MO, tell them what's happening, and maybe they will prescribe some antibiotic now. Can you ask your friend to stay somewhere else? She will be communicable for 24 hours after starting the antibiotic. Do you have any masks in the house that you can wear? Also, if you have antibacterial wipes, start wiping down surfaces that are touched frequently: light switches, door knobs, the refrigerator handles, bathroom and kitchen faucet knobs, etc. I'm so sorry :-( (Btw, Lost in Space was one of my faves growing up, and I have all of the DVDs)",
      "MessageIndex": 922,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 7, 2012 12:26AM ckk wrote: Lisa, I had a bad case of phlebitis after round 2. I found that ibuprofen and heat helped a lot. The ibuprofen really seemed to take down the pain and swelling. I hope that you're better soon. Madison, I'm feeling your pain. I'm exhausted and feel awful today. Ugh.",
      "MessageIndex": 960,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 9, 2012 11:32PM ckk wrote: momof3, good luck today!",
      "MessageIndex": 1014,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 10, 2012 03:36PM ckk wrote: Momof3, my initial bloodwork had all sorts of detail, but all testing after chemo started has been pretty basic. I get copies of my bloodwork, and when I asked my MO about itthe lack of detail , she said that chemo can throw off some of the counts, so she doesn't order a complete panel during chemo unless necessary. It strikes me that since it was normal before you started and has only gone up during treatment, then it's what she says. I can really understand your anxiety, though. Maybe some of the other ladies here can chime in with their bloodwork.",
      "MessageIndex": 1036,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 11, 2012 11:46AM ckk wrote: Hey all...I'm feeling better today, no headache,  just mainly tired and flashing hotly like mad. My mouth is much better, but I have a lingering strong metallic taste, much stronger than in previous cycles. All in all, not too terrible, though. Heather, we must be on the same timeline, because I had a major meltdown last night too.I had a burst of energy late in the afternoon,and went outside for a 45 minute walk, then came home and vacuumed, baked bread, and cleaned the kitchen. Just about the time that oldest daughter walked in, the exhaustion hit like a train. My two daughters are close, so suddenly the house was uber-noisy with shouting and laughing, messy from the dirty laundry and stuff that daughter brought home and left in the foyer, and just completely chaotic. I was trying to get dinner together, no one was helping, and I just snapped. Not pretty. Of course, who's gonna push back when the cancer patient is yelling? I realized that I was really not in a good place, excused myself, and shut myself away - time out for me! Anyway, this morning is better, but I feel bad about it. That kind of out of control stuff is just not me. Also, I need touse these down days for something different than reading cancer stuff on the web. I'm scaring myself to death, and it's really getting to me. Lisa, I'm so glad to read about you feeling better. Gives us all hope, I think. Karen, yay! No more nausea! I'm living in yoga pants, too.Yay for stretchy! Annie, stay warm. We're supposed to get snow here today, yuk. Gracie, enjoy the new clothes! Momof3, are you feeling less anxious about the bloodwork? Wave, how are you? Did you get outside? Hugs to all.",
      "MessageIndex": 1051,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 17, 2012 10:02PM ckk wrote: Good luck Gracie! So happy for you!",
      "MessageIndex": 1138,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 23, 2012 05:05AM ckk wrote: Good morning ladies! Thanks for all of the well wishes! I am getting ready for my last tx today, and will check in when the caps are done - not until this evening!I am READY to get this over with. Hope everyone has a great day.",
      "MessageIndex": 1236,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 26, 2012 06:25AM ckk wrote: Rachel, I can't even imagine...I'm so glad that you were able to catch it quickly! That must have been a scary moment. Maybe wear a cute scarf on your head tied under the chin (oh so chic, actually) when it's windy out? Bailey, my lumpectomy imcision has been uncomfortable lately too. My MO said that it was normal, that the nerves take time to reestablish connections, and sometimes they never do. Sometimes it's a sharp pain, sometimes a burning pain. Maybe ask your MO about it next time?",
      "MessageIndex": 1268,
      "PostDate": "26/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 26, 2012 07:44AM ckk wrote: Good morning...chemo train has arrived at the station. I am totally wiped, and trying to hang on. At least it's the last time, right? Youngest daughter drove me around on errands yesterday, thank goodness. She was such a love- it was uber windy here and she held on to me for dear life as we walked outside. I had an incident in Whole Foods - we were looking at Burts Bees lip gloss(trying to replace all of our paraben-filled cosmetics), and D noticed that our wagon had disappeared with my purse in it! She dashed around the corner and saw a woman walking away with it quickly, and grabbed it back. The woman said that she grabbed my cart by mistake, but then didn't retrieve a cart of her own, so it was pretty obvious that she was trying to steal my purse when she quickly left the store. Sheesh. Annie, I have lots of thoughts like those. I look at other women who seem so carefree and wonder if they have had this crud in their lives. I feel like I've crossed over into a new world that no one wants to live in. I do feel as though I have gained wisdom and compassion from this ordeal, and maybe a degree of grace. But, as one fellow BC survivor said to me \"you're now in the club that no one wants to join.\" Erica, welcome back. It's good to hear from you. What's the story about not knowing if you need 2 more rounds? Have you called your MO about the blood in your stools? If you want to join the FB group, PM me with your FB name and location so that I can friend and add you. I too have always wanted to raise chickens, and bees too. I'm a master gardener, and have met quite a few chicken raisers in my classes.  Josie, I think that the tightness on the SNB side is normal. I just picked up a book, \"The Breast Cancer Survivor's Fitness Plan\", by Carolyn Kaelin, that has SAFE stretching exercises for that issue. I recommend it highly. Happy Sunday and hugs to all of you.",
      "MessageIndex": 1280,
      "PostDate": "26/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 27, 2012 06:14PM ckk wrote: Good evening all...day 4 here, always my worst day. I barely made it out of bed this morning, dragged around only to go back and sleep for 4 hours this afternoon. I'm guessing that means I'll be up all night, darn it. This last round, like for most of you, has hit me hardest. My hot flashes have been relentless, and I keep thinking that I'm running a fever because I'm so warm, but the thermometer says otherwise. I am so very glad that this is my last time going through all of this.Has anyone else noticed that there's constant reminders of BC out there all of the time? Everywhere I look, every news broadcast, something. I just can't escape this. Madison, I hope that you're resting and comfortable. So glad that it's over! Wave, that's great that you're feeling good! You deserve it. robin, I've never been a meditation fan - can't seem to get the hang of it. My mind always wanders, lol. momof3, we can all relate to the anxiety and anticipation of an upcoming tx. Hang in there, and I hope that it is indeed your last. My eyesight has changed too - hope it's temporary. Hope everyone's da has been pleasant..hugs to all.",
      "MessageIndex": 1298,
      "PostDate": "27/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 28, 2012 09:09PM ckk wrote: Erica, good luck today! I hope that all goes well.",
      "MessageIndex": 1305,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 29, 2012 09:28AM ckk wrote: Wave, I feel like an 80 year old woman, too. My daughter drove me to Costco today, and ended up holding my arm the entire time that we were in the store. I was absolutely exhausted by the time I got home. I'm sure that we'll both improve with time - this stuff takes such a cumulative toll. robin, I laughed so hard at your panties-on-the-web story! My D would have assumed the same thing! momof3, hope your son keeps those germs to himself. Time to let the H take over! Erica, if there's a cure for this BC that doesn't involve chemo, then sign me up! I don't know about the juice thing, though. I'm glad that you stood up to the MO. We're expecting a snow storm here tomorrow night into Thursday, which is ok by me, since it's my low point. I'm still very tired, and my mouth tastes of metal, yuk. I had some lemon sorbet this afternoon that tasted wonderful - I think that I will live on sorbet for the time being, lol. My BMRI has been scheduled for March 12th, and I have my radiation mapping on the 6th.  Hope everyone is having a good evening!",
      "MessageIndex": 1310,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 2, 2012 12:16AM ckk wrote: Wave, that was me, sorry. I've had phlebitis after each infusion, and it always starts at about day 6. I'm starting to develop it now. I use heat and advil, and for me, the advil really seems to take away the pain. It subsides after about a week, and like Annie says, usually leaves a mark behind. I now look like a very active junkie with four reddish/brownish tracks on my arm, lol. My MO tells me that the marks will fade in time. Josie, hope that insurance situation gets straightened out. We've had to make weekly phone calls to the insurance company, too. It sucks to have to cope with this while trying to get well. Annie, I'm so glad to hear about the hair! You must be really excited. I'm going to ask my MO on Monday about the meds for water retention. I look like I'm pregnant! Rachel, isn't it great to not worry about cleaning right now? I was so resistant to get a cleaning service, but now I am SO glad that I did. Like you, I do not feel comfortable leaving the house while they're here. I'm feeling better energy-wise today. I've got a nasty case of phlebitis brewing, and some neuropathy symptoms - tingling in my left hand, and my left thumb is twitching every so often. I'm going to try to go to AC tomorrow. It's snowing like crazy here, so I'm home for the day.  Hope everyone is well!",
      "MessageIndex": 1328,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 3, 2012 12:59PM ckk wrote: Holy crap, now I wonder if my 4 reactions weren't phlebitis after all? This is honestly scary - is it possible that we received contaminated taxotere????????",
      "MessageIndex": 1356,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 4, 2012 09:21AM ckk wrote: Erica, good for you for going to an expert source to make your decision, and thank you for linking to that document. It was really interesting, and I wish that oncologists made such a thing available as part of the treatment discussion with all patients. It's disheartening to have this kind of uncertainty from your own physician - what criteria was he going to use to help you make this decision? If it makes the decision easier for you, it appears as though many of the women with a similar profile to yours on this forum has had/is having TC*4. I do think that you might want to ask your physician why he was considering 6 cycles instead of 4 - JMHO.",
      "MessageIndex": 1365,
      "PostDate": "04/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 7, 2012 07:41AM ckk wrote: Good morning everyone... Wave, thanks for the giggle :-) karmil, I have one cast iron pan that I use to make tortillas and nothing else because it's too heavy. I like the enamel on iron stuff, but that's too heavy too. You sound very peppy! Rachel, you're in the home stretch, with only 2 to go! Thinking about you, and happy Purim.  Annie, so sorry to hear about your Mom. Hang in there. Gracie & Josie, glad to hear from you. Josie, I also get very dry post chemo, and nothing seems to help until it resolves on its own. Gracie, I am extremely fatigued too. My MO said that it would take at least a month to feel better. I had my rads mapping yesterday. It had been moved from next week because my RO was on vacation. She was not happy that I was having my BMRI after the mapping (she's concerned that I have to have a biopsy in the L breast it will change the measurements), but SHE changed the mapping appt! I was really irritated and told her that I'd rather not be there during my low period anyway and would just as soon be handed off to another RO for the mapping next week. At that point she backed off and said that she wasn't going to worry about it. I was really ticked. The mapping itself was uneventful (got 3 tattoos), but I was exhausted when I got home. I had a meeting last night that went on forever and made the mistake of not taking my prilosec or eating before I left. By the time I got home, I was nauseous and exhausted. This fatigue really sucks. Hope we all have a good day today...",
      "MessageIndex": 1401,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 13, 2012 03:37AM ckk wrote: Hi Ladies...just got back from the BMRI. So, is there no end to the lack of dignity we have to endure? lol...breasts hanging thru holes, hooked up to an IV, lying face down. Anyway, I get the results later today from my MO. Karmil & Annie, about the hair not growing where the wig-hugger is: I can tell you from my experience using the cold caps that we are told by PCC that cold stimulates hair growth, and I can tell you that the cold hair washes and cold cap use seemingly made my hair grow about twice its normal rate during chemo.I was shocked. So, I wonder whether the additional heat due to your wig hugger may be the culprit. We're told to use cold packs  a few minutes per day on places that lost hair, in order to encourage growth. Maybe it will work? Rachel, take care of yourself and rest. I hope that you're better soon. I downloaded a free app called \"Lose it\" today. It's a good calorie and exercise tracker that's available for Android and Apple. I've gained 15 lbs since starting this mess, and I'm determined to take it off!",
      "MessageIndex": 1445,
      "PostDate": "13/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 19, 2012 07:06AM ckk wrote: Good morning all! I hope that everyone had a nice weekend. Mimi8, I also did cold caps during my infusions, and kept my hair. It makes for a very long, sometimes stressful day, but I am glad that I did it. Feel free to PM me with any questions, and be sure to check out the Cold Caps Forum on BCO (under Help Me Get Through Treatment). Annie, congrats on the new car! With air fares going up, it may be much cheaper to drive anyway! Rachel, I'm glad that you got some fresh air, and saw your nephew. You're only 10 days away from crossing the finish line! momof3, I'm so impressed that you rode your bike! I laughed at your \"can't feel my boobs, etc\" comment.Yes, I am also very tired at the end of the day, can barely move. I didn't have drains, but I can tell you that my incision area is now very sore, and it wasn't sore at all up until now. I wonder if it's the nerves waking up in both of our cases? Karmil, I was also told to not take any supplements before surgery. My D is home for spring break too! It's so nice to spend time with her that's doesn't include my infusion! Bailey, sometimes I think that animals are harder than kids!I am going to ask my RO today at mapping whether it's ok to eat the sea veggies during radiation. I know that they were found to decrease the effects of radiation in Japan, but we are doing this stuff for a beneficial effect, so I want to make sure. Leesa, I also am completely unable to to watch anything, scary, gory, sad, or disturbing. The only shows that I watch these days are wedding shows and cooking shows! Wave, I loved your St. Pats story, priceless. Why did the rad center need to do more tattoos? It was gorgeous here over the weekend, in the 70s both days. I chaperoned D's band competition on Saturday, and it was great to see the parents and the kids, but boy was I tired at the end of the day! I have chaperoned this event for the past 4 years, so I really didn't want to miss it. Yesterday was just as busy...prom dress shopping with same D, then a 5 mile hike with oldest D who is on spring break this week. I really pushed myself both days, and I'm feeling it this morning: achy, tired, just pooped. But I'm glad that I did, because it felt like it was more normal. I have rads simulation this morning, and I'm hoping that I don't have to lie still for a long time - I'm achy!",
      "MessageIndex": 1504,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 19, 2012 03:56PM ckk wrote: Attack of the chemo brain! I worked out first thing this morning, came home and was puttering around getting ready for my 11:00 radiation simulation, and my cell phone rang at 10:30. It was the radiation center, wondering where I was for my 10:00 appointment. Whoops. The simulation time was earlier than my daily appointments will be, which of course they had told me but I forgot. Anyway, they switched my time to 11:30, and all went well. It was completely uneventful, took 20 minutes, and I start my regular treatments tomorrow, provided that I remember to go, lol. Wave, that stinks about your appointment! I hope that you ended up going. Karmil, I also have not joined a support group or consulted a therapist, although I think that it might help. Like you, my tears are never far away. I love the support that we give each other here, and I wish that we could all meet on a regular basis. Which makes me think...had anyone successfully used Google+ to meet a group online? I have an account, and have video chatted with one person at a time, but never with a group.Would tis be a good option for us?",
      "MessageIndex": 1513,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 22, 2012 05:10PM ckk wrote: Leesa, I am still dealing with phlebitis too. My last tx was the worst. The vein is now peeling, itchy, and hurts when it brushes against something. My MO said that it could take a year to resolve. Did you call your MO about it? Mine is brown and flat, not red and tender. I wonder if you've got a lingering infection? I hear you on the lingering fatigue. I seem to have spurts of energy, and then exhaustion. I definitely don't feel like myself yet. My new racing bike is a Specialized Womens Ruby. I'm short, and I find that Specialized makes a great line of bike frames sized for women. My road bike is a Specialized too. Good for you for biking to work! That's awesome. As for stretching, I bought a book called the \"\"The Breast Cancer Survivor's Fitness Plan: A Doctor-Approved Workout Plan For a Strong Body and Lifesaving Results. It's written by a physician BC survivor and and exercise specialist, and has great stretches for different types of BC outcomes..lumpectomy, MX, etc. Jen, I'm with you on not relating to other people very well. I was at a concert last night at D's high school, saw lots of friends, and felt like an alien in the room. My whole life has been BC for 6 months, and I'm boring! lol Krmil, hope those geniuses can help with the computer. Wouldn't it be nice to have a title like \"genius\" at our jobs? hehe Wave, OMG, me too on the stinky underarms! It's been hot here, and I smell terrible. I go to the gym and apologize to my trainer, I apologize to my family...ugh. Hot flashes make it all worse. I didn't go to radiation today. The machine broke down and they canceled my appointment, so my tx's get pushed out one day. I went shopping with oldest D in preparation for her internship this summer, and I was exhausted by the time I got home. We went to an outlet mall one hour away...what a mistake! All that walking, plus driving. I felt really discouraged, thinking who is this overweight, tired, grey haired woman?? I'm telling you, I am determined to lose these 15 pounds, regain my strength, and color my hair soon. Maybe a nap first, though. Ugh.",
      "MessageIndex": 1544,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 27, 2012 12:28AM ckk wrote: Oh, about Latisse..I started using it right after my last tx. My derm also recommended it for my eyebrows. I don't use the applicator brushes that come with the rx. I bought a fine-line eyeliner brush from Sephora, and one drop can treat both lash lines and brows. It is definitely working on the lashes; they're longer and fuller, and no change in pigmentation of my blue eyes (my derm said the same thing as Wave's, that it really only applied to people using it in the eye at the stronger rx). My brows are starting to come in again. I have little dark hairs sprouting.",
      "MessageIndex": 1576,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Apr 14, 2012 10:05PM ckk wrote: Hey everyone..I haven't posted here in a bit...I've been catching up on things as my energy has been returning. I'm happy to say that I feel about 95% these days. I get tired at the very end of the day, but can last straight through without putting up my feet. I have to tell you that it feels very good to be back to myself! Melrose, welcome, and I'm very sorry that you had to join the club that noone wants to be in! At least you're in the company of the best women on the planet.  I seriously would not have been able to get through this without the company of these women. We have sustained each other through every stage of treatment and surgery, and where else can you find a 24-hour support group? As others have said,it would be a good idea for you to find or form a thread with others who are going through chemo at the same time. Your question re day of the week for chemo: I had my txs on Thursday, and in retrospect I wish that I had had them on Wednesday because day 4 was always my worst day. The first two days after chemo you're usually revved up on steroids, and then go downhill from there. Are you getting the neulasta shot? That will affect your progress, too. I did not receive neulasta at all through treatment, and because of that tried to stay close to home days 10-14 because of low counts. Wave, yay that you're almost done! Is hubby still in the Bahamas? Will you join him there soon? Bailey, I can so relate to your emotional moment! I have moments that I feel almost grateful for this bc (I know, crazy, right???) because I have seen and met such incredibly wonderful people in the journey. It's been easy to let go of the negative/unsupportive people in my life, and I am now left with the good ones! I feel like a better person too. I've met and made friends with two women this week who were recently dx'd, one who will be using the cold caps after seeing me with hair.  Don't ask me about this feeling of gratefulness tomorrow, though, when I'll be bitching and swearing again, lol. :-) Your rad center techs are awesome! Rachel, some input on moving when you're recovering from surgery. My melanoma surgery 12 years ago coincided exactly with moving out of one house to another. I couldn't change my closing date, and my derm said \"no way\" when asked if I could postpone the surgery. I was going to be on crutches and not allowed to lift anything or even keep the leg down for too long. I ended up calling a local moving company, explained my situation as a cancer patient, and they gave me a sizable break on moving (I packed by sitting on the floor while people handed me stuff). It pays to ask! Karmil,how's the Tamox going? I haven't been reading as much either. I think that my eyes have gotten worse since chemo, too. I need to have them checked. I have 16 more radiation txs to go, 8 whole breast, and 8 boosts. My skin looks a bit pink, and my nipples are now two different colors - one tan, one not, lol! My D thinks that's really awesome :-). I've held up well so far. The hot flashes and night sweats for some reason have come back with a vengeance this past couple of days...they had calmed down a bit after chemo.  I'm wondering if the ovaries are giving up for good? I hope so! I have a bone density test next week to establish a baseline before tamox, and I'm hoping that it's good. With all of the biking and weight training over the past few years, it had better be!  I hope that you all have a great weekend! I'm still cleaning out closets!",
      "MessageIndex": 1726,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 6, 2011 09:41PM ckk wrote: Thanks for the welcome, ladies! I had a better night's sleep last night since I was on the down side of my no sleep-sleep cycle. You know how it goes, bad sleep one night, walk around like a zombie next day, sleep better the next night. LeesaAnn: I have had the same exact reaction to sugary foods since surgery. I was always a sugar fanatic, but it was like getting the light switched off. I wonder if the growing cancer had something to do with sugar cravings?? I guess that I can't complain, lol. I was also a daily bike rider and avid exerciser, and it's hard to not be so active. Like Rachel, I'm afraid of weight gain during this process. I would like to get your initial impressions and tips for using the caps, if you have time. Robin: Your experience gives me hope that this process is doable, thank you. Rachel: My oncologist told me that exercise during chemo can dramatically reduce the SEs, so to do as much as is possible, including weight training. She also mentioned that women who exercise more than 6 hours per week moving forward have much lower rates of recurrence. Because of neck and back issues, I was working out with a trainer at the gym prior to diagnosis, and as luck would have it he is a 10 yr cancer survivor. So he has come up with a chemo plan for me. I would happy to share it with you if you'd like.",
      "MessageIndex": 108,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 18, 2011 06:46AM ckk wrote: Hello all, checking in to say hi. My 1st treatment is on Thursday. I'm spending the next few days completing holiday shopping and going to my kids' holiday concerts. I know that several of us have treatments 1 & 2 this week - here's hoping that all goes well!",
      "MessageIndex": 229,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 23, 2011 06:41AM ckk wrote: Hi everyone. Treatment #1 down. The infusion went very smoothly, no reactions at all. The IV went in smoothly, on the first try. I used the cold caps, and my nurse was fantastic about supporting me and my helpers. I had a migraine in the morning, which did not help, and it caused me to eat much less than I should have. By the time that I got home, I was very nauseous. I did ice my fingers and toes during the T portion, but didn't have ice in my mouth during that entire part of the infusion. I hope that doesn't get me into trouble. My nurse said that not everyone gets the mouth sores (even without icing), so to try not to worry. What with the cold caps, the icy cold feet and toes, and the cold moth, I was a very cold girl yesterday! The electric blanket that I brought was a lifesaver. I also wore my skiing base layer which was lined with thermal material. I didn't sleep much last night  - steroids, I guess. I'm nauseous again this morning, and took the acid blocker and steroid. I hope that they work. I also made some home made ginger tea that seems to be helping as I sit here and type. I have a question about one of the anti-nauseau meds I was prescribed, reglan. The bottle says that it may cause eye twitching. Has enyone taken this and had that reaction? Rachel - I hope that your tummy is better today, and good for you for getting back to work! Annie - I hope that you're better today and that work went well. Wave - My onc is on the fence about giving the neulasta shot automatically. I actually agreed to participate in a clinical study yesterday (sponsored by the makers of neulasta) that will help to predict which patients may benefit most from automatic shots between treatments. The study is not double-blind, but is using historical patient data. Josie - I hope that you are still feeling good. I was also the youngest person in my infusion suite. I guess that those of us in our 40s and 50s with earlier stage BC are getting chemotherapy pretty much across the board these days. If you look at the Oncotype statistics, you can see why the docs are giving us this recommendation. My Onc calls it my \"cancer vacccine\"! Heathrer - i hear you about finding an onc close by. My original Dr was in boston, about an hour away. After my surgery, I found an oncologist 5 minutes away who I love. It makes a big difference to go down the street for those infusions! Thanks to all of you for sharing your stories and offering encouragement. You are all helping others tremendously. I hope that everyone's holidays are joyful.",
      "MessageIndex": 292,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 31, 2011 09:09AM ckk wrote: Good morning Ladies...Hasn't been such a great 24 hours here. I went to see my MO yesterday feeling pretty good, and didn't need the shot - count was low, but \"normal low\" and she expected it to come right back up in the next few days. I left feeling great and a half hour later came down with aches and fever of 100.9. Phone call, and discussion about whether I should go to the ER for urine and blood work up. The MO opted to put me on Augmentin and do a wait and see, along with giving me instructions of when to head to the ER: chills, vomiting, burning urination, rash, etc. I spent a feverish, achy night and still have a fever this morning...feel like absolute crap. I think that I might have a cold, because I feel sniffly. I'm really discouraged, I was on the upswing, oldest daughter and BF are here visiting, and now I can't go out or enjoy the visit much..makes me very sad. I know that I'm doing this as a long term investment in my health, but as a formerly healthy, super energetic, never-get-sick kind of gal, this constant lousiness and having to take endless meds that need to be charted in order to keep track seems like a nightmare. Ugh. And I'm only 1/4 of the way there. Sorry for the downer report - hoping things will look up here soon, and I sincerely wish everyone a Happy New Year. I'm looking forward to posting next year at this time when we're all on the other side of this crap and feeling hopeful again...",
      "MessageIndex": 426,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 7, 2012 06:51AM ckk wrote: Good morning all.. and happy weekend. I'm trying to catch up on everyone's progress and it seems like we're all doing fairly well. I've got TC #2 on Thursday. H has arranged for the cold cap dry ice and I'm working to do some cooking/freezing for the next round of yuks. I like to make most of the bread that we eat, so this weekend I'll be doing lots of baking/freezing. Sounds like we have fellow gardeners/canners here, which is great! I was thinking that it will be particularly meaningful to grow my veggies and herbs this year from seed - to celebrate life and hope and new beginnings. Baileybump - I also can, although most of my canning is home made jams/preserves/applesauce made from local farm fruits. We usually eat up the veggies before I get a chance to can them. It's so nice to hear about another canner! I've been doing it for 25 years, and I'm the only one that I know! momof3boys - I have had quite a few nightsweats since TC #1. They seem to come in bunches, none one night, a whole lot the next. Leesa- I had heard of that book, never read it. I'll have to check it out! It's so comforting to read everyone's stories here. I hope that you all know how helpful every post is. The feeling of being alone really gets minimized when I read this thread. I had a completely normal day yesterday, and even worked out at my pre-surgery level/duration. I can't tell you how great that felt, it was awesome. Everyone is healthy again, so I'm keeping my fingers crossed that it will be a good few days leading up to #2!",
      "MessageIndex": 528,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 19, 2012 06:50PM ckk wrote: On the topic of where your money goes when you donate to a BC organization, there are many places that you can look. This article has a handy summary:  http://www.health.com/health/condition-article/0,,20235965_1,00.html Komen consistently gets high ratings for their transparency, but I think that it's important to note that they devote a great deal of money to education and awareness, rather than all of it to funding research. What I think that  it comes down to is that we each need to decide how we want our donation dollars spent and then find out which organizations fulfill that charter.  Lisa - did you call your MO? That is scary. I live in New England and am no stranger to numb toes, but if it's never happened to you before, it might be worth a call. Every time I go to my MOs office, she tests my nerve response in my hands and feet - does yours? You may also want to consider acupuncture. Bailey- so glad that things went well! That's such a heart warming story about the author. This may be a terrible journey that we're on, but it does occasionally produce some genuinely beautiful moments. Annie, I'm up for us all meeting anywhere after all of this mess is done. My girls and I talk about going on the \"cure tour\" this summer, which basically means packing a bag and flying places until my credit cards give up, lol. Gracie - I was given the choice of T/C or A/C, with the comment that A can cause heart problems. Chemo was recommended to me despite clear nodes because I had a high grade tumor and LVI, and the thinking is that you need to hit BC hard and fast to deter recurrence. Both MOs that I consulted didn't care what my Onco score would be, and chose the regimens that they did because of clinical success. My understanding is that these chemo drugs are pretty standard for BC, and what differs is no. of treatments and whether you need to add Herceptin (if you're HER2+). But I may be simplifying things - please anyone else chime in if you have more info. loulabell - I can relate to doing too much and regretting it. Just doing laundry is wearing me out today! I ended up at the MOs office today because they wanted to look at my red vein. It's phlebitis, with no sign of clotting. The nurse told me to continue applying heat, elevate, and take advil. Of course every patient in the damn office was hacking and sneezing. For the first time ever, I put one of those surgical masks on my face in the waiting room, and felt like a doofus. The things we put up with! Argh. Have a great evening all!",
      "MessageIndex": 698,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Jan 27, 2012 02:46AM ckk wrote: Good morning. I seem to have developed some mild neuropathy over the last day or so...more fun with chemo. I have tingling in my fingers and bottoms of my feet. I talked with the MO last night and she suggested going to the acupuncturist (I'm going tomorrow) and may cut the taxotere dose a bit next time. As much as I would love to end chemo, I am determined to stay the course. Now that I've made the decision to hit this cancer with guns blazing, I want to make sure that the chemo does the most good possible. I do feel better today in both mind and body, so maybe this is just a bump in this very rocky road. Kathy, glad that your infusion went well! That was a very busy day, I'm impressed. Rachel, good luck, and let us know how it went. I'm sending good thoughts your way. Wave, I'm doing better. A couple of my GFs are dragging me out for dinner tonight, and I'm looking forward to that. There's nothing like GF time. Erica - be sure to post the NED pic that your friend comes up with! Maybe we can put it on a shirt at zazzle.com and all order one - December T/C sisters unite! Heatherb8 - your new pooch will probably do you more good than you realize - he'll get you out and moving, which is great during chemo! I am still trying to drag myself to the gym today, and it may not happen, lol. Warm hugs to all of you. ",
      "MessageIndex": 783,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 5, 2012 05:41AM ckk wrote: Annie, I'm really glad that she's going home. She's still infectious for another 24 hours, and your immunity is on the down shift. This is the ONE time in our lives that we have to be selfish, hon. I swear by the antibacterial wipes, and use them every day around here. The joke is that if it's my down week, someone is sick! After the strep episode, I have not caught anything, despite H coming down with bronchitis after round 2. Keep an eye on that temp! And wash her linens in HOT water.  Rachel, regarding soy: I was advised by my MO to take it off the menu. When I started looking at labels, I was surprised at how many foods have soybean oil, and many generic vegetable oils are soybean, or soybean oil blends. And no edamame, darn it. Josie, I have also replaced all of my teflon pans with stainless steel. Costco sells a fantastic set (Kirkland brand) for less than $200, a fraction of what you'd pay separately for pans of that quality. To be honest, I've become a fanatic too. I'm pretty upset that we need to scrutinize our purchases for ingredients that have been banned in other parts of thr world for years. I think about the millions of young girls who walk into pharmacies and buy makeup that is possibly leading them down this road that we are on and get sad and angry. I guess that it's up to us to support  organizations who are trying to pass the word and force the FDA and EPA to act.",
      "MessageIndex": 933,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 5, 2012 06:25AM ckk wrote: Annie, I am struggling with the balance issue, too. I'm now a two-time cancer survivor (melanoma was no 1), and I wasn't a sun worshiper, either. I've come to the tentative conclusion that there are some of us unlucky ones whose genetic makeup makes us vulnerable to cancer - whether it be through exposure to toxins, or to certain ingredients, or pollution, or whatever. Our cells are told to mutate and then we get cancer. After this episode and the turmoil and suffering it has caused, I have decided that I can't take a laid back attitude anymore. I guess that it makes me feel better to become as informed as possible, to feel as though I have some power to change or avoid future serious health problems. I know that there's no guarantee, but the fact of the matter is that it's my own self-advocacy that saved my life twice - both cancers were found by me by self exam. My MO told me last week after I asked that because of my dense tissue, my 1.6 cm tumor would probably not have been found on mammogram for another 2-3 years. So I feel like there's no choice going forward - be diligent, stay informed, and try to beat the odds. That's my 2 cents, anyway :-)",
      "MessageIndex": 935,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 8, 2012 11:45PM ckk wrote: Morning all... I'm feeling a bit better today, not so much in the dungeon (maybe the sub basement? lol). Yesterday must have been kind gesture day for all of us. H helped me to video conference into a meeting last night and people came to the meeting carrying little gifts for me, holding them up to the camera. I was so touched! It really made me smile. On the topic of periods: I had my last one during tx #1, and have not had one since. With all of these hot flashes, MO thinks that my ovaries might be closing shop, which is good, since I'm ER+. To be honest, I'm in mourning about it. I know that I'm \"too old\" to have more kids, but part of me has wanted to have \"just one more\", and now I know that it's not gonna happen. Just one more thing that BC has taken away, dammit. Rachel, some of my hot flashes have been gradual, just like you describe. Bailey, good luck tomorrow! Last one! Annie, my sleep pattern is just like yours. I wake at 2am and then toss and turn until dawn. Regarding looking pale/chalky, I too look like that, and I've found that Bare Escentuals Clear Radiance does wonders for my skin tone. It seems to warm up and brighten my complexion. Maybe give that a try? Lisa, so sorry that you're feeling down. I can imagine how another reminder of Daisy put you over the edge. I hope that you're feeling better today, and please know that we're all pulling for you. Gracie, yes, my sleep patterns are shot to hell. I've given up, and sleep when I'm tired, period. Heatherb8, hope the fatigue has lessened today. Karen, have you thought about going to a pain clinic? Robin, your back to virginity comment made me laugh so hard! Count me in, lol. Have a great day, all. Hugs to all of you.",
      "MessageIndex": 1002,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 10, 2012 07:18AM ckk wrote: Bailey & Mom - so glad that all went well! Bailey, I loved your new FB pic. I might steal the idea for my last treatment. My girls want to bake cupcakes for the nurses for the last round. The staff at the chemo center have really adopted them and treated them so well. Heatherb8, good luck at your appt. today. Rachel, I love the fact that you use the earrings to feel great about your day. That's such a good idea. Wave, I was so touched by your statement that we have become like family, and indeed I feel the same. My fatigue has also been overwhelming. I went out for a short walk yesterday, and the first few steps were really hard, but it got better. After 15 minutes I felt less tired. Maybe you can try just a few steps outside today? Gracie, I hear you about needing women around you. There's nothing like woman-time, and of course women can also relate to the unique BC beast. Robin, glad you're getting out more! I woke up at 3am with a migraine. I think that it's from my crazy hormones and all of these hot flashes. I took my meds, I'm chugging coffee, and hoping that the pounding subsides. Oldest daughter is coming home for the weekend. She's been such a love since dx, calls me daily, comes to every treatment, tries to get home frequently. I don't know what I'd without her and my younger daughter.My phlebitis has subsided somewhat with ipubrofen and heat.  Hugs to all.",
      "MessageIndex": 1029,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 14, 2012 10:51PM ckk wrote: Happy Valentines Day, fellow December BC gals! This is certainly a most unusual V'Day for all of us, eh? I am a hermit today...I had my nadir visit with the MO yesterday and had a WBC of 1.9, so I'll be avoiding crowds for the next couple of days. My MO isn't concerned, since my counts bounced back so quickly the last two times, so I'm trying to be zen about it all. I'm feeling pretty good, actually. Taste is back, fatigue has lessened. My MO told me that she really wants me to have my base-line breast MRI before rads (despite what the RO thinks), since the MRI can really change the tissue for quite some time. So I told her to duke it out with the RO and let me know when to report to the MRI center.To be honest, I'm scared to death to have one, since I don't want anything to show up! Plus, I found out that you lie face down with your breasts hanging down through a hole in the table for 30 minutes, nothing supporting them - ouch! Have any of you had one? Rachel, your activity level exhausts me! You are an inspiration. Lisa, good luck with your surgeon appt today! heatherb8, I hope that you're feeling better today. Wave, so glad that the lump turned out to be nothing! Whew! Karen, like others, I can SO relate to your anger at the gossip-mommy crowd.I have a close group of friends whom I keep informed about how I'm doing, and they tell each other, which is fine. But I find that when I have been in a larger community of people that I see occasionally, there are a few women who are now inordinately friendly and nosy, and I know that they're just there to get gossip. My stock answer is \"hanging in there!\". Beeeoches. What really pisses me off is that they keep staring at my head trying to assess if I have a wig on - I'm doing cold caps, so my hair is mine. If they'd ask I would tell them, but the staring really gets to me. Madison, I'm so sorry to read about your friend. At this time in particular, it's hard to be betrayed like that. I say, weed that sucker out of the garden so that the remaining friends aren't poisoned by her toxic behavior. I'll chime in and voice my thanks to all of you for your support. I have learned so much from all of you, and I truly could not have gone through this as well as I have with out this board and this group of women. We may \"only\" be connected by computer, but all of you live in my heart each day. I hope that we can one day, when we are beyond all of this, get together for a weekend of good food, good alcohol, and share hugs, tears, and stories.",
      "MessageIndex": 1081,
      "PostDate": "14/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 15, 2012 01:00AM ckk wrote: Thanks, ladies, that makes me feel better. I could use a good nap, lol. My sleep pattern is royally screwed up. The MRI will most likely be in the second week of March. I start rads on the 19th.",
      "MessageIndex": 1086,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 16, 2012 01:57AM ckk wrote: good morning...dreary day here in the great (un)white North - sleeting outside, yuk. I went to the gym this morning armed with Clorox wipes and wiped everything down before using it. With one week to go before my LAST infusion (yipeeeeeee!), I want to spend it healthy before getting my ass kicked. My trainer is in the process of becoming a certified cancer trainer, and was asked to write an article for the gym to be put out as a press release. He asked if he could quote me in it, so I said, why not? Might as well help to spread the word that exercise is healthy during treatment. Wave, my MO set up the initial appt with the RO a couple of weeks ago. The RO wants me to start rads within 4 weeks of finishing chemo. She quoted some statistic, but I don't remember exactly what she said.My last infusion is on the 23rd, so the 19th became my start date. Honestly, I wish that I could wait a bit more. I want to have an extended period of normalcy to get my strength and equilibrium back. Oh well. robin309, I hope that your swelling is down today. How are you feeling? Rachel, I've done the bird count in previous years. I used to have quite a few bird feeders in my back yard (my property butts up against conservation land), and then last year I was looking out and saw a black bear in the yard, destroying my feeders to get to the food! That was a shocker, lol. So, no more feeders. I do love birds, and especially love the orioles that come through every spring. I put out oranges and grape jelly to attract them to the yard.Good luck tomorrow in your treatment! momof3, hope those aches ease up soon. Lisa, bummer about the appt. I've done that too. I now have a electronic planner app on my phone with an alarm, because I can't keep track of all of these damn appointments. Try not to beat yourself up about the weight. You know what to do, and when your energy increases you'll take care of it. Be good to yourself, you've gone through a lot! Kathy, good luck today! My tumor was 90%ER+. I'll be on Tamoxifen for 5 years after rads, because I was premenopausal going into this. Since I'm having hot flashes and my periods have stopped, I asked my MO on Monday whether she was going to consider Arimidex instead (used in post menopausal women). She said no, that Arimidex is used in women that have had no periods for at least a year. Karen, hope you are feeling good today and are able to venture outside. Annie, I've had phlebitis twice. What helped me most was ibuprofen. It really seemed to take down the swelling, redness, and pain. After the episodes were done, I ended up with peeling, darkened skin where the vein was. Like Lisa, I look like a junkie. Dark marks, bruises from blown veins. What a mess. I can't wait for that to heal. Hope everyone is well!  Hugs to all.",
      "MessageIndex": 1107,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 22, 2012 05:55AM ckk wrote: Good morning wonderful ladies...lots to catch up on here! My last tx is tomorrow! Gracie, I hope that your aches aren't too severe today and that you can get some rest.I'm up about 6 pounds since starting, and my MO also says that it's the taxotere. I know that I'm puffy - I can see it in my eyelids and face. momof3, I am SO HAPPY for you! I can well imagine how relieved you are! heatherb8, I'm suffering along with you with the hot flashes, and now I have breast soreness too. I'm going to talk to the MO about it tomorrow. She suggested Vitamins E&C 2x/day, but it doesn't seem to be working. Bailey, I've had great luck with acupuncture too. It has completely eliminated my neuropathy. I go the day after chemo, and then once again two weeks later. I also get a Vitamin B12 shot when I'm there. It really works! Annie, that's so awesome that you have hair growing. My eyebrows are slowly falling out and my eyelashes are half gone. I got a Latisse script and I'll be starting it right after my last chemo. Kathy, loved the card! It's great that your coworkers are so kind, it makes a big difference. robin309, hope you're better soon. Wave, I'm so happy that your tx went well, and that your nurse found a vein on the first try! I loved the FB pic. You're ALL DONE!! Rachel, boo to your MO nurse! If your message wasn't detailed enough, why didn't they call you back to get more detail?? I hope that you're better today. Hang in there, and big hug to you. Lisa, I ordered that brow kit. My eyebrows are sad indeed. Patchy and pathetic. Ugh. Karen, I hope that you're doing well. I am getting ready for my LAST tx tomorrow. I have a busy day today, meetings and then a jazz concert where youngest daughter is playing tonight, which is good. Oldest daughter returned to school from NY yesterday with strep. Thankfully she is recovering at school until she is no longer contagious, so I'll see her tomorrow at my tx. I don't have an impending feeling of dread about this one - I'm just excited that it's almost over! I'm hoping for no blown veins and a smooth cold cap day. Hugs to all of you!",
      "MessageIndex": 1221,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 22, 2012 09:26AM ckk wrote: Rachel, I'm sitting here laughing, imagining us all together talking with chemo brain. SO FUNNY. I'd pay to see that!",
      "MessageIndex": 1225,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 25, 2012 03:20AM ckk wrote: hahahahahaha.....sorry, ladies. I'll be less verbose in about 36 hours!!",
      "MessageIndex": 1254,
      "PostDate": "25/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Feb 27, 2012 08:43AM ckk wrote: Best of luck, Madison! We are all thinking of and cheering for you. It's all good from here!",
      "MessageIndex": 1292,
      "PostDate": "27/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 5, 2012 10:27PM ckk wrote: Deb, I'll echo what Wave said...it's important for us to help each other by spreading the word about whatever we come across. There's such power in the information that we share with one another, and thank you for posting. I have an MO appointment today and will ask about it. Wave, I know what you mean about feeling apart and distant from others. I think that it will always be like that in varying degrees. But here's the thing - there's so many cancer survivors out there that you don't know about. After my first infusion I came down with strep during my low period and landed in the ER. My nurse, and the guy who drew my blood were both recent cancer survivors (nurse had BC) and had undergone lots of chemo. I never would have known this if I hadn't had to tell them my story, and then of course we connected on a much different level, almost like long-lost relatives, people who KNEW.  It was comforting to talk to them, and they spent lots more time with me because of it (in fact at one point, someone came in to look for the guy taking blood and asked if we were having a party in my exam room, lol) . So that made me decide to not keep the knowledge of my cancer from others, because I do think that it makes me feel more alone if people don't know. Like you said, there's comfort in being with others who \"get it\". Rachel & Robin, I've been worried about raw cuticles and cracking hands too. My hands are always dry and they do crack, plus the anti bac gels are very drying. I am always wearing bandaids. heatherb, I laughed at the days left comment too! Too funny. I am in a bit of quandary. I realized last week that I need to start moving away from feeling like a sick person, so I asked my H to not assume that he would go to every appointment with me. Before BC, he never came with me to any dr appointment, and I am very private and independent. He was pretty offended when I tried to gently explain to him that I need to move away from cancer patient status and feel more independent, more like \"me\", so in the future if I needed him there, I would tell him. I realize that he was trying to be supportive, but at this point, it just feels like I'm being treated like a sick child. Now I feel guilty. Anyone else have this going on?",
      "MessageIndex": 1382,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 6, 2012 11:23PM ckk wrote: Good morning all! I had my nadir appt yesterday with the MO. For the first time, I felt like a \"graduate\". What a good feeling, so liberating! I asked her about the taxotere situation, and she had not heard anything, but said that she would research and talk to me about it next week (I see her after my BMRI). She thought that my phlebitis looked like classic phlebitis from T, and that in her observation, almost every patient runs into phlebitis from it. So, we'll see if she finds out anything. I will see her next week after my baseline BMRI, and then not again until after radiation in May. She wants me to get a bone density test before starting Tamox. I will be having bloodwork every 3 months to test for various things over the next three years. She's setting me up with the Lymphedema specialist to do a baseline exam and fit me for a sleeve for travel, and yes, she has seen women with as few as one or two nodes removed develop LE, and believes in being proactive. She said that it would take \"at least a month\" for the fatigue to resolve and a year for the phlebitis marks to fade, and said that exercise is the best weapon against the fatigue.As for the water retention, she thought that it would resolve over the next few weeks. Wave, I'm with you on wanting to get my independence back. It will make a big difference in my moving forward. Can I send my H to the Bahamas with yours? :-) Rachel, my lashes are about 1/2 gone, and I see little tiny new ones coming in. I gave up mascara, but I find that black powder eyeshadow applied like eyeliner to the lash line covers the missing lashes and looks pretty good. Hope everyone is has a great day! I go for my rads mapping in a couple of hours..whoo!",
      "MessageIndex": 1387,
      "PostDate": "06/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 7, 2012 01:21PM ckk wrote: Bailey, I was thinking the same thing re: the Bahamas. LOL!!! I have the Costco/Kirkland Stainless steel set - I think that it was $189 for the whole thing, and the quality is outstanding...just as good as All Clad in my opinion. I went to radiation mapping today, and a loooooonnng meeting tonight. I am totally wiped. Ugh.",
      "MessageIndex": 1392,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 14, 2012 01:54AM ckk wrote: Karmil, again don't know how this impacts a different situation, but I was told no water warmer than body temp on my scalp, and the cooler the better. I have avoided the whole situation by taking baths instead of showers, and washing my hair at the kitchen sink with the hose attachment twice/week with cool water. I know that many women take a shower without putting their heads under, and then turn the water temp down to do the hair at the end. Another tip: in case you haven't already, avoid aluminum containing products such as deodorants because aluminum collects in the hair follicles. Only use sulfate-free shampoos as sulfates are very hard on the follicles too.",
      "MessageIndex": 1455,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 16, 2012 07:52AM ckk wrote: Good morning December BC women! Wave, good luck at your simulation today! I'm interested to hear how it goes. robin309, that is one long ride for you every day. I can imagine that it's wearing on you. You're almost done with this, and we're here for you. Can you listen to funny books on tape in the car for the ride there and back? Or download some funny podcasts and listen to them through your car? My understanding is that kelp, seaweed, and kombu can help to clear the body of radiation effects, but what I don't know is if it's advisable during treatment or after, since we're doing this for the beneficial effects of radiation. I'm going to ask my RO about it on Monday when I go for my simulation and I'll report back. Gracie,I think that most of us are going through similar body aches and pains PFC. I've been going to the gym and weight training throughout chemo, and it's tough. My trainer is in the process of becoming an ACE certified cancer trainer, and he tells me that movement will help to ease this pain, so to stick with it. Ugh. Rachel, another visitor! Oy. I hope that you're better today. Yes, I think that PTSD is a good descriptor of what we're going through right now. You've been so strong throughout this, and you deserve a time/place to honor those feelings. karmil, my trainer says to push myself, but not to the point of exhaustion. I think that if your body is telling you to rest, then you should do it.  Regarding the night sweats: I have them every night, and have to change the sheets each day. I also have them at least once per day during waking hours, although not as severely. You would think that with all of this sweating, I'd lose some weight! I've been tracking my calories and activity very carefully for almost a week, and have lost exactly one half pound. ARGGHHH. Slow and steady may win the race, but it's not winning my happiness. I brought cards and small gifts to my two chemo nurses yesterday. They were so surprised! It was nice.I am chaperoning a band performance tomorrow for D's school - should be a good test of my endurance, lol. Happy Friday to all, and have a great weekend!",
      "MessageIndex": 1492,
      "PostDate": "16/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 16, 2012 06:46PM ckk wrote: Just to give you an idea of how you can't win with the hair thing...I have kept my hair due to using the cold caps, but I am not allowed to color my hair for quite some time. My hair has been coming in silver, tinged with the dark hair that I used to have, so I now have a very noticeable two inches of silver hair followed by dark, dark long hair. Think skunk, and you'll have it. Yesterday while in line at Costco, I noticed a well dressed woman in front of me giving me the hairy eyeball (pun intended), obviously contemptuous about my striped hair. And today, I went to lunch with a friend, who despite knowing what was going on, looked at me at one point and said \"when can you color? It's definitely time.\" Like I said, you just can't win, ladies. :-/",
      "MessageIndex": 1496,
      "PostDate": "16/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 20, 2012 07:27AM ckk wrote: Too funny, Wave! I can't wait to hear about the topless in the gym experience too. Good luck with your last tx today, gayle56! Gracie, hope that leg pain continues to improve. I'm off to first radiation soon, ladies.",
      "MessageIndex": 1523,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 25, 2012 12:30AM ckk wrote: Happy Saturday! robin, my hair coloring restriction is due to my use of the cold caps. I guess that the follicles are still delicate and need to be babied for awhile. I think that I read on the Hair thread that new hair coming in has issues with coloring too, but don't remember. Is it possible for you to ask your hair dresser? And Karmil, you're right, and that was my (obviously inarticulate lol) point - no winning here. I'm gonna have to suck it up and move along. karmil, yay for getting the surgery done! I made chicken soup (best meds ever) in advance of every chemo tx. I am sending good thoughts your way! I finished my first week of rads. The breast is a bit sore, but my skin looks normal. I saw an RO  doc yesterday (mine was on vaca) who was so sick with laryngitis that he couldn't speak to me...ok, thanks for exposing me to illness, what? Anyway, the techs at the rad center are lovely, and I am getting to know my fellow daily rads travelers - all BC patients! I went out to dinner with the family last night and had fresh veggies (salad) for the 1st time since December. It was great, but my tummy is a bit unhappy today. Does anyone else have lingering tummy issues PFC? And, is anyone seeing leg or underarm regrowth yet?? Mine are still in hibernation, and the brows have mostly left the building.",
      "MessageIndex": 1554,
      "PostDate": "25/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 27, 2012 10:59PM ckk wrote: Good morning everyone! Josie, welcome! I hope that you stick around and complete the journey through treatment/surgeries with us. I can't think of a better group of women to hold hands with! Bailey, Momof3, Kathy...I was very upset at my first rads tx too. I didn't realize how nice it was to be without active cancer treatment in my life until I was back at it. When I got home from that first time, I rode my new bike (the one that I bought the day that I discovered my lump) to prove to myself that I was still strong, and then had a good long cry. It's comforting to know that we all are going through these emotions. Wave, I'm sorry that your sleep is still lousy. I had my first good night's sleep since dx last night, and only because I took my migraine meds (had a killer headache) before going to sleep. I'm hoping that we all soon see better sleep, and I suspect that when we are more in \"survivor mode\", that will happen. rachel, I would definitely play the cancer card with that ticket! It's a legitimate circumstance, and hopefully they'll be humane enough to waive the fee.  robin, good luck with the lymphedema specialist! Let us know how it goes. Kathy, I can understand your feelings of thinking that you've \"done something\" to cause your cancer. The truth is that no one knows what causes BC, and there's plenty of women who make poor health choices that NEVER get this disease. I have 2 older sisters who smoke, have tanned all of their lives, are overweight, and rarely exercise, and I'm the one who got melanoma and BC, despite being an exercise fanatic, nonsmoker, health food nut, who never tanned in her life! I think that the best thing that you can do is to pay attention to credible studies regarding lowering cancer risk and get checked frequently.  heatherb8, big hug to you, hon. We've all had those kind of days! I think that we should put all of our H's and SOs in one room and show them a slide show ...How to act with the BC patient...lol Karmil, hope you're recovering well today. My stomach seems to have recovered. On the upside, I lost 5 pounds! My D said the sweetest thing to me regarding the skunk hair - she told me that her fellow college students are paying \"big money\" to get the look that I have right now, so I'm right in style! I wonder if they're also plucking their eyebrows to get big bald spots too??? lol",
      "MessageIndex": 1593,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Mar 30, 2012 08:08AM ckk wrote: Good morning all, Rachel, sincere congrats that you're DONE! What a crappy way to end the ordeal, but at least you don't have to go back. It sounds like everything was conspiring to make the most challenging day possible for you. I had a reaction to Tax on my first tx, and because of that, each tx after that was run more slowly. I'm glad that your reaction was at the end of your treatment cycle. As for the tingling, you may want to consider going to acupuncture to resolve that quickly. My AC also gave me a B12 shot after every tx, and it really helped. My neuropathy symptoms resolved, and now I have none. I hope that you have an easy week ahead, and they're your last ones after chemo! YAY! Leesa, it sounds like you have lots of questions and concerns, and they should be answered. I am going every 3 months (with bloodwork) for the next two years, and getting scans of some sort every 6 months. It's crazy how different MOs can be! If you are not comfortable with the level of follow up, I would consider changing MOs. Your peace of mind is far more important than anything else, and the fear is not pleasant to live with! Momof3, so sorry to hear about your Aunt. It sounds like she slipped through the cracks of the system. It really drives home how we must all be our own advocates and demand the level of care that we are comfortable with. Gracie, I hope that you're feeling good and pain-free today. Karmil, glad the girls are looking good! I did not read that book, but I can tell you that cleaning my closets has been very cathartic! My H is a bit bewildered by the the garage full of trash bags that grows every day, lol. I am feeling pretty good over the last couple of days. I find that if I drink a cup of coffee late afternoon, my energy level picks back up. I have been able to ramp up my weight training to 3x/week, and I am now back to pre-surgery weights. My goal is to get my strength and endurance back to full speed by the end of the summer, and do a bike race in August. As soon as the weather gets warm here again, I will be out on the road training. In the process, I'm hoping to shed the rest of this excess weight.  Have a great day, everyone!",
      "MessageIndex": 1631,
      "PostDate": "30/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Apr 3, 2012 06:58AM ckk wrote: Good morning! Bailey, that's so great that your rad techs make you feel so comfortable! I'm guessing that the time will fly and you'll be done before you know it.  Isn't it funny how a little bit of kindness goes such a long way? Karmil, Yay for regrowing eyebrows! You will be throwing that pencil away soon. Good luck with the college search! Like you, we are doing this again with offspring #2 this year. Here we go again! I also think that \"penguins\" is a perfectly acceptable answer to that joke, hehe. Wave, so glad that your radiation is trouble-free and that things are looking up for you! I agree that BC survivors at this point in their tx need some special TLC. I am so grateful that we have each other here for support right now. As painful as it is to hear others' fears about recurrence, the fact is that it's on all of our minds right now as we step into this new world, and it's so comforting to not feel alone. heatherb8, how are you feeling today after the Bible study crowd has left? I hope that you got good rest. Robin, glad that your LE appt went well. Mine is on Thursday - same thing - base line measurements, and getting fitted for a sleeve. How long will yours take to come in? My D plays the trumpet, and she's in the concert band, marching band, and Jazz band. We go to lots of performances! lol  Oh, and your post about nose hair made me realize that I hadn't been leaking in awhile, so I checked, and mine is back too! Yay! Rachel, how are you feeling today? Jen, hope the recovery is going well and that you're pain-free. I asked the supplements during rads question at my tx appointment yesterday, and one of the nurses said that she thought that I should \"get off all of those things\". Huh? When I questioned her about it, whether that was the \"official\" word about supplements during rads, she said no, that she just thought that I should be getting adequate nutrition from my food. Really? That Vitamin D problem isn't going away with food, honey. So I asked her to pass my question - my REAL question, as in \"are any of these supplements interfering with my rad treatments\" onto the RO, who won't be back until Thursday. Sheesh.",
      "MessageIndex": 1659,
      "PostDate": "03/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Apr 5, 2012 03:31AM ckk wrote: Hi all! Welcome to the Canadian ladies! I got the word about supplements - no extra Vitamins C&E, because they apparently can interfere with the radiation's efficacy. Now that that's settled, why didn't someone tell me that in the beginning? What would have happened if I had not asked? Anyway, I met with a dietitian at the center yesterday - it;s apparently a service offered to everyone in treatment at the rad center. She looked over my food diary (I use the Lose It app), and suggested a few things. Some interesting nuggets: No more than 25% protein in the diet, because the kidneys are still recovering from chemo; Soy as food is okay (tofu, edamame etc), but no soy protein powder; soybean oil based vitamins are ok; I should start taking 1000mg of Omega 3 every day for the anti inflammatory effects. The center is starting a nutrition support/weight loss group for people in treatment, so I signed up. I'm starting to get a little pink from the rads, and I'm a bit tired, but otherwise ok. Jen, I've been using Latisse for 6 weeks, and I definitely can see a difference in my lashes. My brows are starting to fill in now, too. I hope that you're better today. Rachel, glad that you got through the interview okay! Take it easy, and get your rest. Wave, which gel are you using? Momof3, I agree with you - if more men got BC, we'd probably have a vaccine by now, and we certainly wouldn't be making it a political issue. I am SO SICK of women's health becoming a political issue.  Have a great day all!",
      "MessageIndex": 1676,
      "PostDate": "05/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Apr 8, 2012 10:53PM ckk wrote: Good morning all! Happy Easter, and chag sameach to those celebrating Passover! Rachel, we did a very abbreviated seder too. It was nice to be able to relax, and no one seemed to care...Passover is so much work! Karmil, glad that everything was ok at the hotel. I agree, wouldn't it be nice if our MOs (or SOMEBODY) would give us a comprehensive booklet on chemo care - before, during, and after? Thanks goodness for the women on this forum! heatherb8, so sorry about your burn, and I hope that the rad center can give you something to feel better soon. Quiet day here today. My skin is getting pink and my breast is a bit sore after 12 rads. I wish that I could hurry up time and get this done!",
      "MessageIndex": 1692,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778222",
      "Title": "Taxotere/Cytoxan - December 2011 LeesaAnn AnnieLane"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Dec 3, 2012 01:30PM ckk wrote: Hello ladies! I was one of the December 2011 sisters (with heatherb8 who posted previously). I had four rounds of TC, and kept my hair through the use of cold caps - please PM me if you want info. This is a tough journey, but you are stronger than you think, and you will help each other through the hard stuff. I don't know what I would have done without the help and support of the other women in our BCO thread, and our support continues to this day. ((hugs)) to all of you!",
      "MessageIndex": 126,
      "PostDate": "03/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "ckk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140683/profile",
      "Content": "Nov 5, 2012 07:35AM ckk wrote: Hello, Ladies! I wanted to pop in and give you encouragement as you start on your chemo journey. I started almost a year ago, and one year later, life is back to normal and I feel good. This is hard, but you can get through it and be ok! It was enormously helpful to get support from my fellow travelers on BCO, and the ladies in our group have become life long friends. For those of you using cold caps: I was a cold cap user and kept my long hair. They do work, and they're worth it. If any of you need info or help, lease PM me. If you live in northern New England, let me know and I can help you!",
      "MessageIndex": 50,
      "PostDate": "05/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    }
  ]
}