{
  "AuthorID": "clairebear",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95374/profile",
  "Posts": [
    {
      "AuthorID": "clairebear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95374/profile",
      "Content": "Jan 7, 2010 02:50PM clairebear wrote: I too have been working for 24 years for the same company and I agonized over when to go out on short-term disability.  I worked through 7 neoadjuvant chemo treatments, and a surprise hospitalization for a low white blood count. After much deliberation, I went out on STD the day I had my 8th and final chemo. I ended up being very glad I did.  It gave me time to focus on getting through the chemo and getting some strength back to handle the surgery that came about a month later. When I finally made that decision it was a relief to not have to worry about work for a while.  I am still on STD now after 5 months and do enjoy not working.  But I am a few years short of retirement and feel lucky to still have a good job to go back to.  So I am planning on returning in about 5 weeks.  I just finished 9 months of treatment last week. The chemo grind is so draining and you get so sick of being sick.  I planned a few weekend getaways on weeks when I knew I would feel decent. Take it one step at a time and that 11 weeks will be over before you know it. ",
      "MessageIndex": 6,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746411",
      "Title": "So I stopped working. Now what?? AnacortesGirl cagney"
    },
    {
      "AuthorID": "clairebear",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95374/profile",
      "Content": "Jan 27, 2010 06:51PM clairebear wrote: I was diagnosed in April 2009 with Stage 3 and for the first week I could hardly breathe.  I was frozen with worry.  My onc. pulled out a piece of blank paper and drew a timeline that stretched out for 9 months.  I just about fell off the chair.  But I did every portion of the treatment I was asked to do and then some and just finished the 9 months.  Chemo, bi-lateral MX, reconstruction, radiation and just started tamox.  My hair is growing back with some nice silver chemo curls and I am going back to work in 2 weeks.  I learned that there are no shortcuts to getting through treatment, just hunker down and take it one day at a time and you will come out the other side.  Hang tough!  -Claire ",
      "MessageIndex": 12,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747448",
      "Title": "Newly Diagnosed and scared Lemongrove arnie2two"
    }
  ]
}