{
  "AuthorID": "clariz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164099/profile",
  "Posts": [
    {
      "AuthorID": "clariz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164099/profile",
      "Content": "Nov 12, 2012 07:36PM - edited Nov 12, 2012 07:37PM by clariz Thanks for the replies. **Scottiee1; I guess all dr's and hospitals do things a little different, like you I don't want to waste anymore time to start with the pill, 'just hope I will not have a lot of SE's. **Eph312, Yeah, your onco. test is high, my onco. told me that if it's less than 15 is okay if I remember it right.(I'll have to ask dh, since I can't absorb everything dr.s told me 'cause I'm so nervous)I take it as a good sign that I haven't receive anything from my ins. or genomic health then. ***Sheila888, The onco. test maybe a new thing they're doing now? I'm glad I had it , it helped me made an informed decision.",
      "MessageIndex": 13916,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "clariz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164099/profile",
      "Content": "Nov 16, 2017 11:56PM clariz wrote: Hi all, I will be done with my arimidex/anastrazole therapy in 6 days. I'm looking forward to it because I'm hoping it will get rid of the SE's like aches and pains, I feel so old sometimes, my hands, my shouders and neck hurts so much especially when the weather gets cold. ( I work as a cake decorator , that's why the parts of my body mentioned are the ones that aches a lot. I do excercise for bone health, I do weights and walking and cardio, I also take vit. D and calcium and multi vits. I have trouble losing weight though, My onco said that losing weight is hard when taking the AI's. On my last dexa scan in July 2017 showed that I have Osteopenia, ( a mild boneloss just a little bit higher than normal is what my onco said) , My onco. asked me if I want to continue taking the anastrazole for another 5 years since I have only have mild SE's , I told her No, because I read about the article that it may not be beneficial to me anyway, My BC is stage 1, low recurrence rate, negative nodes., and I'm post menopausal (surgical/hysterectomy) She readiy said, \"That's ok, there's not much benefit to you huh, and there's really no proof if it does help.\". I do not want to make my bone loss to get worst or my cholesterol to go up or have my kidneys and liver fails,if I continue on taking the AI, but at the same time gave me something to think about. Anyone continuing their AI therapy beyond 5 years?",
      "MessageIndex": 15425,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "clariz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164099/profile",
      "Content": "Nov 12, 2012 06:18PM - edited Nov 12, 2012 06:19PM by clariz Thank you all for the warm welcome! I have a question for all of you ladies... **How long after your radiation treatment you started on the hormonal therapy? (Arimidex,Aromasin,Femara, Tamoxifen etc.)My RO said it's usually 1-2 weeks, just wondering. **Anyone had the oncotype dx test done? My onco. did this to determine if I need chemo. or not and the result is low, I don't know the number exactly because my MO told me I could just see he after my radiation treatment, she just called me to tell me the results, which I thought was very nice so I don't worry any longer and started my radiation with her approval. Also, was it covered by your ins.? The Genomic lab.has filed the claim for me and I still haven't heard if my ins. will cover it or not, but when I callled my ins. they told me that as long as the documents/necessary health records sre submitted it should be covered, I hope so because it's a $3,000+ testing. Mimi1964,I have BlueCross BlueShield too and yeah, you have to make sure that the appt. and procedures they do is a day after your last one. What about the 3 mos. after surgery mammo. did they cover it?goodluck on your appt. next month.:)",
      "MessageIndex": 13912,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "clariz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164099/profile",
      "Content": "Jan 9, 2013 05:06PM clariz wrote: Hi all, I have a question for everyone...How many months after your treatment did you get your first mammogram for the breast that had the tumor? also, is it 3-6 mos. after surgery or after the radiation? I had lumpectomy followed by radiation, and my MO told me that in my case my first mammo. is 6 mos. after the radiation, which will be in the last week of April, I finished my radiation Oct. 26th. Just wondering if someone's schedule is the same with mine.My last mammo. for the unaffected breast was May 21, 2012, it will just be a month apart, 'wondering if I should just wait so I could get both done at the same time?Thanks in advance.",
      "MessageIndex": 14284,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "clariz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164099/profile",
      "Content": "Nov 10, 2012 05:42PM - edited Nov 10, 2012 05:45PM by clariz Hi, I'm new here,I had total hysterectomy because of large fibroids compressing my kidneys and around the same time dx with breast cancer,tumor is 1.8 cm,had. lumpectomy,stage1, low grade node negative,margins clear I just finished my radiation treatment (35 rounds for 7 weeks excluding Sat.&Sun.)Oct.26th,2 weeks ago,and now is  a little worried about the cancer coming back.I managed well physically, but the emotional part is really hard for me to deal with.I have an appointment to see my MO on Nov.13th so she could write me a prescription for Arimidex. I joined to gain some insight and inspiration from all of you.",
      "MessageIndex": 13904,
      "PostDate": "10/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "clariz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164099/profile",
      "Content": "Nov 17, 2017 11:58PM clariz wrote: I was 46.",
      "MessageIndex": 802,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    }
  ]
}