{
  "AuthorID": "clellene",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92497/profile",
  "Posts": [
    {
      "AuthorID": "clellene",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92497/profile",
      "Content": "Dec 20, 2009 01:07PM - edited Dec 20, 2009 01:14PM by clellene Hi!  I'm new to this list.  I'm IBC triple neg 3b - that makes me kind of an \"odd duck out\".  So, here is what I want to know.  I have 4 cycles of AC (of which i'm thru the 2nd) followed by 12 treatments of T (taxol).  So, 6 months of chemo prior to surgery.  I'm so tired.  I seem to \"hit the wall\" day 4 and went down for 36hrs the first treatment, and 72hrs the 2nd.  Does this seem to be about what everyone experiences?  I heard that the Taxol is a little easier on the system.  What does that mean?  I am struggling to keep my full time job and do it right.  I lost 1 day of work the first round and 2 1/2 the 2nd (thanks to the holiday the first time).  Is there a \"regular\" reaction of when the wall comes up to strike you down?  Please let me know what progress you experienced?  I am not just curious, but trying to survive here. Thanks! Clellene ",
      "MessageIndex": 386,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "clellene",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/92497/profile",
      "Content": "Dec 20, 2009 07:13PM clellene wrote: Thank you for a kind and thoughtful response.  So, to be clear, there is no \"wall\" with taxol like there is with AC?  I feel it is ok to hit the wall, it is just proving to me that the chemo is doing it's job.  I plan on laying down and vegetating until my brain clears.  I think maybe the exercise is a key.  But, after Christmas shopping yesterday, I was completely fagged.  It took 3 tries to get all the gifts into boxes, and several hours.  But, today, I was able to completely wrap all the gifts..  Hooray!  Dont get me wrong, it was only about 20 boxes and stuff like socks and underwear...  (a couple of better gifts)  I used to be a Scout leader and sitting still just annoys me.  I miss being able to work on the Christmas tree lot, and go rock climbing and hiking.  Thank GOD for my family and friends.  I have cried more because of unexpected kindness than because of my own situation since diagnosis.  I am so blessed with the good people in my life.  I am trying to allow helpfulness of others whenever possible.  I'm just tired.  I suppose I will be in better shape tomorrow.  I will try to exercise and will take the pug for a walk with his new Santa suit.  If nothing else, it makes me laugh!",
      "MessageIndex": 388,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    }
  ]
}