{
  "AuthorID": "clickety_cl…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193029/profile",
  "Posts": [
    {
      "AuthorID": "clickety_cl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193029/profile",
      "Content": "Apr 3, 2014 10:46AM - edited Apr 3, 2014 12:13PM by clickety_clack well now I just got the news of my mom's follow-up that happened today. The hospital wants to start a round of chemotherapy. in fact because it's a government hospital, they started today with no warning. There will be +- 7 more sessions over the next few months. The hospital said it's a precautionary method. I'm furious. I believe that any remaining healing could be achieved naturally through diet. Am I crazy? edit: my parents are very confused. I don't live near them. now they say it's stage 3 cancer. I will try to get the full story and start a new thread.",
      "MessageIndex": 9,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815538",
      "Title": "Worried about my mom clickety_clack clickety_clack"
    },
    {
      "AuthorID": "clickety_cl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193029/profile",
      "Content": "May 31, 2015 02:56AM clickety_clack wrote: Time for a follow-up. After the chemo I last wrote about, she went for another surgery to \"remove whatever was remaining.\" The government hospital doesn't communicate clearly with my parents, who are elderly and can barely take everything in anyway. After recovery, she was sent for 10+ sessions of radiation on consecutive days. (Dec 2014 / Jan 2015) She had onset of osteoarthritis before the cancer diagnosis, but it's become much worse. She was taking Arimidex. She was in so much pain and is now on morphine. She is walking with a cane. She went for a checkup, and now they say the cancer has spread to her bones, lungs, and liver. They want to do more radiation.  I am extremely angry. All this treatment has taken away her remaining health. She should have taken the surgery and then gone natural. It's criminal that they could prescribe such treatment for an elderly person who does not have the same immune system as a younger one.  Hippocrates, the father of modern medicine said, \"First, do no harm.\" Modern medicine is failing our family. ",
      "MessageIndex": 11,
      "PostDate": "31/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815538",
      "Title": "Worried about my mom clickety_clack clickety_clack"
    },
    {
      "AuthorID": "clickety_cl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193029/profile",
      "Content": "Dec 9, 2013 01:05PM clickety_clack wrote: Hi Thank you for sharing We live in South Africa, and it's a government hospital. The appointment is at the end of Jan 2014. The 'blood test' was FNA - Fine Needle Aspiration. At this early stage, we don't know, but my mom has been taking hormone replacement therapy for several years...",
      "MessageIndex": 5,
      "PostDate": "09/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815538",
      "Title": "Worried about my mom clickety_clack clickety_clack"
    },
    {
      "AuthorID": "clickety_cl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193029/profile",
      "Content": "Dec 9, 2013 11:59AM clickety_clack wrote: I really appreciate your responses. We live in South Africa. The follow up appointment is at the end of Jan 2014. It's a government hospital, so maybe that's why it's so long. When I said blood tests, I meant 'fine needle aspiration' sorry about the confusion. The doctor said it was cancer and that chemo may be needed... I guess we shouldn't panic until we get further results, but that will only be in 6 weeks, and it feels so long. Thanks ziggypop and Hydavis42",
      "MessageIndex": 3,
      "PostDate": "09/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815538",
      "Title": "Worried about my mom clickety_clack clickety_clack"
    },
    {
      "AuthorID": "clickety_cl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/193029/profile",
      "Content": "Mar 31, 2014 11:54AM clickety_clack wrote: Hi, I thought I'd follow up on this. It turned out that my mom had stage 1 breast cancer. The tumour and a lymph node were removed. She had 'radiation.' Her next follow up appointment is this week when we will get further information. Conclusion thus far: Inverted lump in breast that looked like a belly button turned out to be stage 1 cancer. Feeling relieved :) Love and light x",
      "MessageIndex": 7,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815538",
      "Title": "Worried about my mom clickety_clack clickety_clack"
    }
  ]
}