{
  "AuthorID": "clj57109",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229930/profile",
  "Posts": [
    {
      "AuthorID": "clj57109",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229930/profile",
      "Content": "May 19, 2016 08:49PM clj57109 wrote: Thanks, this is great. I start chemo on June 1st. I used the lists and tips here and looked on other sites as well. This is by far the most comprehensive and includes all the tips I found, plus a few more. It's great when someone helps make this whole process a bit simpler.",
      "MessageIndex": 1755,
      "PostDate": "19/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "clj57109",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229930/profile",
      "Content": "Jun 3, 2016 09:41AM - edited Jun 3, 2016 09:42AM by clj57109 What are reloads. The only thing stopping me from eating right now is the indigestion. I am also taking Zofran and the nausea isn't too bad right now. I am also experiencing headaches that don't seem to go away. This was my first chemo treatment and I'm receiving dose dense AC. I was given two anti-nausea medications with the chemo along with a steroid. I am taking Pepcid AC but so far it isn't helping to much. Anyone reading this post, suggestions would be greatly appreciated. I just want to be able to get through these treatments and feel normal (whatever that may be) again.",
      "MessageIndex": 1761,
      "PostDate": "03/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "clj57109",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229930/profile",
      "Content": "Jun 23, 2016 06:01PM - edited Jun 23, 2016 06:03PM by clj57109",
      "MessageIndex": 1768,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "clj57109",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229930/profile",
      "Content": "Jun 23, 2016 06:11PM clj57109 wrote: Thanks so much for the information, I'm not on the computer as much as I would like right now because the fatigue with the chemotherapy is intense. I did get the indigestion under control, the MO ordered some medicine to help with it. I have had two infusions so far and other than the fatigue I have been managing the side effects quite well. I do drink water all day long so hydration has not really been an issue for me so far. I was also diagnosed with a gallstone when they did my scans, that has been an issue with what I've been able to eat, my MO also forbids fresh raw fruit and veggies right now due to bacteria. With that being said, my diet has been very limited. I'm definitely learning to eat healthy right now. I appreciate all the support that this thread brings and all the research and suggestions that people offer. It's so important to educate ourselves with others who have already experienced what we are going through. Doctors read about it and study it but it is a whole other education when you survive it.",
      "MessageIndex": 1769,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    }
  ]
}