{
  "AuthorID": "CLmommy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275099/profile",
  "Posts": [
    {
      "AuthorID": "CLmommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275099/profile",
      "Content": "CLmommy wrote: Hello, I'm 7 weeks post BMX and been dealing with shoulder problems for the last 3 weeks. They started out of nowhere and were excruciating. The Orthopedic surgeon labeled it bursitis with impingement and gave me a steroid injection 2 weeks ago which helped a little bit, but pain persists. I don't feel comfortable driving because of the sharp pain which comes from upper and cross body movements. I am so wanting to get back to \"normalcy\", but it seems actually my shoulder of all things thats standing in my way the most. I do have TEs in but neither the ortho nor my PS thinks it's related to those. I'm extremely thankful that my pathology showed no cancer (my BMX was preventative due to a strong family history) and am humbled by what many others on this site are going through/have gone through. I'm just curious if others are having or have had shoulder problems post MX too?? Thanks Surgery 4/17/2018 Prophylactic mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865082",
      "Title": "Shoulder problems post BMX? CLmommy CLmommy"
    },
    {
      "AuthorID": "CLmommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275099/profile",
      "Content": "Jun 8, 2018 04:40PM CLmommy wrote: Thanks Billb for your response! I hope your shoulder is feeling better! Ihad been in PT with a breast/cancer specialist but we had to stop because the shoulder is so reactive :( I started it pre-shoulder flare since my movement was still restricted at 3-4 weeks op. I agree, the massaging is so helpful. I miss that right now!",
      "MessageIndex": 2,
      "PostDate": "08/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865082",
      "Title": "Shoulder problems post BMX? CLmommy CLmommy"
    },
    {
      "AuthorID": "CLmommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275099/profile",
      "Content": "Jun 14, 2018 01:31AM CLmommy wrote: Thanks 2002chickadee! Appreciate the encouragement. And to know others have experienced this. Ultrasound didn't show any tears today (I don't know how I could've torn anything!!) so back to stretching and trying to find a way to build strength. Much appreciation to both of you for reaponding",
      "MessageIndex": 4,
      "PostDate": "14/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865082",
      "Title": "Shoulder problems post BMX? CLmommy CLmommy"
    },
    {
      "AuthorID": "CLmommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275099/profile",
      "Content": "Jun 25, 2018 07:31PM CLmommy wrote: I've heard frozen shoulder is common post MX. Sorry to hear you've both struggled with it. Thanks for sharing your journeys with me! Hope everyone's shoulders are back to \"normal\" soon. I'm due for another injection (ultrasound guided) into the space between the joints in 2 weeks. Really hoping that gives some relief! That and having my expanders out in 4.5 weeks. Fingers crossed! Best wishes to everyone. Thanks again!",
      "MessageIndex": 7,
      "PostDate": "25/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865082",
      "Title": "Shoulder problems post BMX? CLmommy CLmommy"
    }
  ]
}