{
  "AuthorID": "cloet1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43096/profile",
  "Posts": [
    {
      "AuthorID": "cloet1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43096/profile",
      "Content": "Jul 14, 2008 12:52AM cloet1 wrote: hi, My name is Anne and I would like to join this group.  I was origianlly diagnosed in Nov. 2006 and had a mastectomy and chemo, 4 AC followed by 4 taxol.  Things went well but in a recent check up, more cancer was found.  I am now doing chemo again and would really like to connect to some people having treatment at the same time.  I did it alone last time and wished I had made contacts on this board.  I can probably help with some info on the treatments that I had, since I already dealt with the side effects.  I am doing different drugs this time so most people will not be albe to relate but would like to make some contacts here anyway.  Anne",
      "MessageIndex": 1413,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "cloet1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/43096/profile",
      "Content": "cloet1 wrote: I have just started using effexor for hot flashes and mild depression/axiety. I have never used any antidepressents before. I've been on a 37 mg dose for a week and while the frequency of the hot flashes are about the same, the severity has lessened so that is good. However, I still feel down and anxious, maybe a little more so than before. The internet is full of horror stories about the side effects of effexor and I was wondering if any of you had experience with it. At this point I'm not sure I want to continue with it and would appreciate any feedback, hopefully something positive. thanks so much. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/669768",
      "Title": "question about effexor cloet1 BMD"
    }
  ]
}