{
  "AuthorID": "clsweet",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183685/profile",
  "Posts": [{
    "AuthorID": "clsweet",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183685/profile",
    "Content": "clsweet wrote: On June 13th I got the call that I have breast cancer after having a mammogram, ultrasound, and biopsy.  Since then my life has been a roller coaster.  Doctors appointments and tests.  I havd Invasive Ductal Carcenoma Stage 1.  I am 37 years old and this is the last thing I thought I would ever have to deal with.  I am sure everyone diagnosed feels and thinks the same.  I have met with my surgeon and oncologist and meet with the plastic surgeon this week.  On top of that I have to have an EP study with ablation on Monday before my cardiologist will clear me.  My Echo and stress test came back perfectly fine but the event monitor showed an arrythimia.  I had a brain MRI Weds and go for ct scans of the chest and abdomen on Thursday as well as a bone scan.  Athought the breast MRI didn't show any cancer in my lymph nodes he wants to make sure it hasn't spread elsewhere.  I also had the BRAC test done last week so we are waiting on the results of that as well.  My oncologist doesn't know what treatments I will have after surgery as of yet.  I am so up and down.  One minute I am fine and the next I am breaking down and crying and feel so helpless.  I have been so anxious and stressed out...and so tired.  All I want is for the surgery to hurry up and get here so I can get this out of me.  I look at myself in mirror and I can see the lump...it sticks right out of the side of my breast and I can't stand seeing it.  My boyfriend, family, and friends have been great and very supportive but what I really needed was to share my story and talk to people who have or are going through the same thing I am.  Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "05/07/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/807251",
    "Title": "IDC clsweet footprintsangel"
  }]
}