{
  "AuthorID": "cocourt",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192072/profile",
  "Posts": [
    {
      "AuthorID": "cocourt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192072/profile",
      "Content": "Apr 21, 2014 10:30AM cocourt wrote: Bearhitch I was/am in a very similar place as you. I'm 29 and found out I was BRCA2+ late last year. In the couple of months after I found out, I think I was averaging 2-3 Dr. appointments per week just getting baseline tests done and setting a therapist to help me process things. It was stressful, but going through all that made me realize that a prophylactic surgery was right for me. The anxiety of the follow-ups and tests was just too much and I knew I'd have more options (in regards to the type of surgery and timing, etc.) if I made the decision before I got a breast cancer diagnosis.  I'm 3 weeks post nipple sparing pbmx (with expanders) and although I had a day or 2 when I thought \"why in the hell did I DECIDE to do this to myself when I didn't have to?\" I've mostly had a huge sense of relief. Relief that I don't have to worry (as much) about whether I think that's a lump or if I can't decide if my nipples are sensitive because I'm PMS'ing or because they're trying to tell me something. Relief that I know I can handle this and that I'm making choices that will probably keep me alive and able to be with my friends and family longer.  In my situation, the pain and recovery has been very tolerable. When reading stories about people's recoveries, be sure that you're reading ones from women who don't have a BC diagnosis and who are close to your age. For the most part, the recovery is much easier when you're younger and healthier. I started working from home 2 weeks post-surgery and was back at the gym after 2.5 weeks. It's a blessing to have the knowledge we do and it gives us a lot of options that other women (unfortunately) don't get.  My insurance company has covered everything (aside from my $3k max out of pocket for the year) and they're legally required to cover a reconstruction if they cover the mastectomy, so I'd urge you not to rule that out. I'm generally a petite/athletic build, so although I had smaller breasts, it's still nice to put something back on my chest (just my opinion). AND, now I don't have to wear a bra and my chest looks great (well...relatively, considering I still have expanders). So for me, the whole thing has really been an opportunity to make lemonade from the BRCA lemons. I'm very happy with my choice. Hope that helps in your decision-making process. I know it's not an easy one. ",
      "MessageIndex": 11,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/817809",
      "Title": "BRCA-1 Positive: To Do or Not Do Something Preventative Bearhitch Itiswhatitis2"
    },
    {
      "AuthorID": "cocourt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192072/profile",
      "Content": "Apr 15, 2014 02:11PM cocourt wrote: Not sure if/what kind of insurance you have, but I'd recommend just going to see another Gyn until you can get someone to actually do the test or refer you to a place that does them. My mom was BRCA2+ and I literally carried her test results with me to 2 different Gyn's who gave me a runaround, then the 3rd Gyn referred me to a cancer center for the test.  I know it may sound shady, but I've never gone back to any of the Gyn's I went to during that period -- not that it matters. I got the referral for the test and that's what I needed. Once I found out I was BRCA2+ as well, I was given a sort of \"case manager\" at the hereditary cancer clinic who helps me keep track of what tests I need to have done/when/results. When you request copies of your reports or medical records, so do in writing and keep copies of everything. I'm not an expert, but I believe HIPAA requires the recipient to provide the records (or an explanation) within 30 days of your request. If they don't, follow up with them and let them know that you plan to file a complaint. http://www.gpo.gov/fdsys/pkg/CFR-2002-title45-vol... Good luck. Sorry you're having to go through this trouble.",
      "MessageIndex": 2,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/820184",
      "Title": "Frustrated eyeh8beer cocourt"
    }
  ]
}