{
  "AuthorID": "Coffeegirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82785/profile",
  "Posts": [
    {
      "AuthorID": "Coffeegirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82785/profile",
      "Content": "Jun 22, 2009 11:35AM Coffeegirl wrote: Hello Liz, This was the most difficult thing to do. The first time I was dx my kids were 6 & 3 and did not understand what was going on. Fast foward 11 years and here I am again. I was in the hospital when I got diagnosed with the mestasis. My 14 year old son got so freaked when he found out from my husband that my cancer was back that he quit the track team at school the next day because he thought I needed him home to take care of me. He tells me he loves me more often and seems to stick closer to home than he used to. My husband and I sat the kids down to discuss what my illness was going to mean to our family. My daughter just graduated high school and chose to go to a college close to home rather than a few hours away because she wanted to be able to get home quickly if I needed her. I have promised them to do every thing in my power to fight this thing. They know that I am doing hormone treatment right now but at some time in the future I may need chemo. Kids realize more than we give them credit for but the decision to tell them is difficult one. Best of luck. Debbie",
      "MessageIndex": 6,
      "PostDate": "22/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735685",
      "Title": "How do you tell your child about cancer? ead raro"
    },
    {
      "AuthorID": "Coffeegirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82785/profile",
      "Content": "May 28, 2009 01:10PM Coffeegirl wrote: Age 33, Stage 2, BC Age 44, Stage 4, BC met. to clavical, sternum, pluera Did test BRCA negative",
      "MessageIndex": 239,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Coffeegirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82785/profile",
      "Content": "Jun 22, 2009 07:16PM Coffeegirl wrote: Hello Liz, I had a thorencentis with 70 ccs being drained. One week later the symptoms were back. I was admitted for a chest tube insertion (drained 100 ccs immediately). The tube drained for 1 week then the pleuradisis was done. A new tube was inserted and the talc was inserted through the tube. I will admit that the 10 days with a chest tube was not a pleasant experience but at least my breathing is back to normal and the cough that I had for 5 months is gone. That was done on March 30 and I have not had any fluid build up since then. I have pluera mestasis as well and the plueradisis seems to be working for me. Best of luck to you. Debbie",
      "MessageIndex": 4,
      "PostDate": "22/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735739",
      "Title": "Ladies could this be more fluid this quickly? ead Coffeegirl"
    }
  ]
}