{
  "AuthorID": "coffeelatte…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
  "Posts": [
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Jul 29, 2009 01:03PM coffeelatte wrote: mommysta, I am just now going through the waiting process regarding a BIRADS 4 category on my right breast.  This all started back on May 28 when my first mammogram showed a new, solid, 1 centimeter mass.  I had more pictures and US then I saw a breast surgeon three weeks ago.  I then saw a second surgeon last week to be sure I needed to have an excisional biopsy.  I am waiting for the second surgeon to decide how to do the excisional biopsy since I have had problems in the past with anesthesia and he wants to avoid future problems.  The waiting is driving me crazy.  I find I wake up at three in the morning obsessing about breast cancer.  This is certainly a rough patch in the road. Just know you are not alone and that the odds of it being cancer is in our favor until told otherwise.  Reading this forum has really helped me calm down; however, when I get in the car to go to the surgeon, or even get more tests, my legs are like jelly and I can't even see straight.  It is so amazing what fear can do.  I am crossing my fingers for your good news.  I just wanted to jump in and let you know I understand the fear part of this ordeal.",
      "MessageIndex": 5,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738103",
      "Title": "BIRADS 4 mommyalways mommyalways"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Aug 28, 2009 08:00AM coffeelatte wrote: Thank you all for sharing your experiences.  I am so nervous I am sick to my stomach.  I have to have an excisional biopsy with the needle guided thing in the next couple of weeks.  I see the breast surgeon again on Monday to pick a date.  I have been dragging my feet for over two months because I am so scared.  The suspicious spot is in the right breast, back by the chest wall so I keep having visions that the radiologist will puncture my lung and I will die while I am being squeezed in the mammography machine!  I am so nervous that I saw two other breast surgeons and drove two hours yesterday to have an independent radiology group look at my films to be sure I needed this. It is a difficult decision but I have decided to go through with it after receiving a second BI RADS category 4 report yesterday.  I should have just done it two months ago... the first breast surgeon I saw wanted to do the biopsy right away.  The second said I could wait six months.  The third said it could go either way but she felt at six months I would be facing a biopsy because the spot has grown from last year.  The second radiologist's report is what firmed up my decision.  I decided why should I even bother with getting yearly mammograms if I am not going to do something proactive when an abnormality if found. I can't tell you ladies how comforting it has been to read your comments and actually hear what to expect and more importantly that you did not die from the needle or by bleeding to death, etc.  I am going to reread this post about 50 more times so that I can get through this experience.  I will let you know what day this will be scheduled.  Thanks so much. Lisa",
      "MessageIndex": 37,
      "PostDate": "28/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/739298",
      "Title": "does the wire hurt in an excisional biopsy?? debnyc JCinAZ"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Aug 28, 2009 08:01AM coffeelatte wrote: Thank you all for sharing your experiences.  I am so nervous I am sick to my stomach.  I have to have an excisional biopsy with the needle guided thing in the next couple of weeks.  I see the breast surgeon again on Monday to pick a date.  I have been dragging my feet for over two months because I am so scared.  The suspicious spot is in the right breast, back by the chest wall so I keep having visions that the radiologist will puncture my lung and I will die while I am being squeezed in the mammography machine!  I am so nervous that I saw two other breast surgeons and drove two hours yesterday to have an independent radiology group look at my films to be sure I needed this. It is a difficult decision but I have decided to go through with it after receiving a second BI RADS category 4 report yesterday.  I should have just done it two months ago... the first breast surgeon I saw wanted to do the biopsy right away.  The second said I could wait six months.  The third said it could go either way but she felt at six months I would be facing a biopsy because the spot has grown from last year.  The second radiologist's report is what firmed up my decision.  I decided why should I even bother with getting yearly mammograms if I am not going to do something proactive when an abnormality if found. I can't tell you ladies how comforting it has been to read your comments and actually hear what to expect and more importantly that you did not die from the needle or by bleeding to death, etc.  I am going to reread this post about 50 more times so that I can get through this experience.  I will let you know what day this will be scheduled.  Thanks so much. Lisa",
      "MessageIndex": 38,
      "PostDate": "28/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/739298",
      "Title": "does the wire hurt in an excisional biopsy?? debnyc JCinAZ"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "May 15, 2014 08:04PM coffeelatte wrote: I am so glad I found my August 2013 surgery ladies. I love you girls. I am so humbled by your courage. We are a tough bunch.  I love the Pap smear story, I laughed so hard and can relate so well. Lisa, I have looked for you often on this board because I had wondered how you were doing. I was able to follow Wren but I could not find you.  I am so glad you have finally felt well enough to come back.  Your posts are so very interesting and I have learned so much from you. You kept me sane last year when we were going through our surgeries and post-op.  I always looked for your posts as soon as I logged on to this board; they always gave me a good feeling for the day. I am so sorry to hear you have had to go through all of the lung cancer issues. I guess you have had a wonderful cleaning out of cancer and will certainly have a good long life ahead of you so you may recover from all of this stress. Big hugs to you and all of the August ladies!",
      "MessageIndex": 1130,
      "PostDate": "15/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Feb 19, 2015 09:15AM coffeelatte wrote: Karen, you sure got things in place quickly.  Good for you.  So will you have a complete hysterectomy along with the tissue removal?  It sounds like your body just did not metabolize the Tamoxifen.  This seems to be a very smart course correction. Thank god for the experienced docs.",
      "MessageIndex": 1188,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Sep 19, 2013 06:43AM coffeelatte wrote: I too have been experiencing that extreme tightness and drawing in feeling at the incision area. Someone here said it feels like tape across the chest and that is spot on. I was referred to a physical therapist by my BS who specializes in lymphedema. Even though I only had one node removed I have had cording and some lymphedema in that cancer side. I told her about the tightness and she said that even though I can't see it there is swelling that accumulates around the incisions and that too can be a cause of that very tight feeling. And just like Honeybair said, she showed me how to gently massage in little circles all around the incisions and under the arms to move the lymph. Also rub across the collarbone area. It is a light massage, no muscle involved, only enough to move the skin. It really does help. I tend to do it more late afternoon and evening because that is when the tightness bugs me most. It gives me relief better than medication; it also helps the burning feeling in my arm and pain where the drains use to be. Those post drain areas tend to hold swelling in my case. The rubbing gets that all moving too. Hope this helps someone else because I was panicky over the tight feeling.",
      "MessageIndex": 542,
      "PostDate": "19/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Aug 6, 2013 12:15PM coffeelatte wrote: Good luck ladies. I too have an upcoming surgery August 13. I need to get better at posting so I can stay connected. I am in shock since diagnosis and can't seem to get my head around it all to make proper decisions. I met with a PS yesterday and after being told more than I ever wanted to know about reconstruction, which I really wanted, I find myself backing out due to fear of the expanders, pain, more surgery, etc. I wish I were braver like so many of the women I read about here. I hate feeling like everything is surreal and I can' t snap out of it. Must be the way I need to get through. I love reading everyone's stories and information. It has helped more than you will ever know.",
      "MessageIndex": 49,
      "PostDate": "06/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Feb 25, 2015 09:27AM coffeelatte wrote: Hoping the day has gone really well for KBeee.  Maybe by now the surgery is over and she is on the road to recovery.  I sure hope so; you have been through so much.",
      "MessageIndex": 1201,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Feb 26, 2015 05:47AM coffeelatte wrote: So glad to hear you are through the surgery Karen.  Now it is on to the next leg of the treatment and rest, rest, and more rest for you.  Soon all this darn snow should melt away and the warmer winds of spring will be blowing in some fresh air for you to take some nice walks and build your strength back up. You are young Karen, it helps so much because you have the ability to get strong quickly.  In your pocket for good luck. Lisa",
      "MessageIndex": 1211,
      "PostDate": "26/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Mar 3, 2015 11:29AM coffeelatte wrote: Karen, I'm with you, treat progesterone negative with chemo and nothing less.  Just like us who are ER-/PR- or triple negative; it is chemo to the rescue because nothing else is effective.  You do sound so strong for going through so much this past month.  You are an inspiration to me for sure.",
      "MessageIndex": 1215,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Mar 6, 2015 07:46AM coffeelatte wrote: Good luck today KBeee.",
      "MessageIndex": 1218,
      "PostDate": "06/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Feb 21, 2015 10:16AM coffeelatte wrote: Karen, I hope your PET scan went well yesterday and that you can relax to know you are one more step along in the process.  Maybe you can enjoy some portion of your weekend. Bravo Babs for having the strength to get a second opinion instead of going with the familiar of the MO.  It can't be emphasized enough how important, and often life saving, a second opinion can be for us.  I am so pleased to read you have found a caring medical team.  ",
      "MessageIndex": 1192,
      "PostDate": "21/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Feb 17, 2015 08:00AM coffeelatte wrote: Just catching up on this thread to see how the August 2013 ladies are doing and I was sick to read the news from both Babs and Karen.  God does this cancer ever just take a break?  I hate to think of the stress and anxiety you must be dealing with.  I am sending you huge cyber hugs and gentle prayers.  I so wish I could do more, help more, say something meaningful. I am just crying like crazy as I type because it hurts to see cancer come back and interfere with your hard-earned progress.  I am in awe in the strength you show in your writings on this board.  You women are so much braver that I will ever be.  Thank you for sharing.  It always helps others, always.",
      "MessageIndex": 1180,
      "PostDate": "17/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Feb 23, 2015 10:48AM coffeelatte wrote: Karen, you certainly have a big day coming up.  I am praying for your good news and easy recovery.  I am hoping it is very minimal, clear margins right off the bat and ovaries out for good measure.  Once you are done having the babies, I think it is a good thing to get those out to reduce the risk of cancer.  I felt that way in 2003 (age 46) when mine were taken out. You've got this girlfriend.",
      "MessageIndex": 1195,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Nov 12, 2013 12:18PM coffeelatte wrote: Prayers are going out to my very strong and brave August2013 ladies who are currently having a rough go of it. I read these posts every day on my Iphone but I am not able to respond since the upgrade a month or so ago. I am only able to log in to post when on the computer. I had to pull it up to let you know many prayers are going out to my brave BC warriors who are having a rough patch. Kbeee so so glad you are able to go home. Babs, we now need the same for you. And Lisa, bless you girl, you remind me so much of myself. Meds don't seem to agree with you just like me. You are so brave to take the chemo. And Wrenn, you have shown patience and grace in a way I can only admire. I don't think I could handle the slow healing like you have done. I hold on to what you women say as I go through my own struggles with other health issues. Breast cancer is on the back burner for me this week, but it is always doing a slow burn in my body in some way. Waiting for Babs to get the information you need. The waiting seems cruel but is a norm in the medical industry it seems. Soft, gentle hugs to my brave ladies.",
      "MessageIndex": 929,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Feb 18, 2015 11:24AM coffeelatte wrote: Karen, I am so pleased to hear you have such an awesome team put together for your care.  You are so smart to have two sets of eyes look your situation over because it does seem almost like a mistake.  A small tumor with a clean node and you then chose to hit it so hard; this not only seems crazy but wrong.  Thank goodness you are on top of this.  I am so sorry that you can't put it behind you just yet, but you will.  Keep us posted. ",
      "MessageIndex": 1182,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Mar 6, 2015 05:33PM coffeelatte wrote: KBeee, so happy to hear you have a great team in place and an aggressive plan that you know you need.  Do you need to do anything more before chemo starts or can you rest up a bit to get ready?",
      "MessageIndex": 1221,
      "PostDate": "06/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Mar 8, 2015 05:10PM coffeelatte wrote: Oh my gosh KBeee, I did not even consider you still have a drain in place.  Oh my, that was such a huge misery to me and you just take it in stride.  I hope the port placement goes well and the Echo is uneventful.  All forward moving to get you to chemo!",
      "MessageIndex": 1226,
      "PostDate": "08/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Sep 23, 2009 07:42AM - edited Sep 23, 2009 07:45AM by coffeelatte Ladies, I too am part of the waiting game.  I hate it.  I had an excisional biopsy last Friday and I am sitting on pins and needles waiting to hear - yet I don't want them to call.  My heart goes to my throat every time the telephone rings.  I have to sit down because my knees just start knocking together. Brady0819, my description is very similar to yours.  They said it is oval (I can see it is) with shadowing and no calcifications.  It is about 1cm and has grown in the past three months.  My head has been splitting with a tension/migraine headache since Sunday, it is bad.  I can't seem to get motivated to do much around the house.  My life feels like it is hanging on that one telephone call.  It is getting worse for me as the days go by - I am reading to get this moving along. I am praying for all of us to have B9 reports.  I fear mine won't be (the surgeon said she thought it looked like a cancer) so my second prayer is for strength to handle whatever I get dealt because right now I feel so weak and worn out.  I feel like I couldn't physically make it through treatment.  Scary stuff for sure. Lisa",
      "MessageIndex": 3,
      "PostDate": "23/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/740770",
      "Title": "Waiting on results of 2nd biopsy - can't think straight anymore brady0819 Karen3"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Jul 27, 2014 07:14AM coffeelatte wrote: Jeanni57 you mentioned in an earlier post that you have used an arm bike.  I have been thinking about doing this exercise to help rehab my very weak, atrophied arms.  I had arm surgery years ago that left me with a very weak left arm; then breast cancer on that side and lymphedema.  I have thought about trying the arm bike again; however, a bra fitter said she thought the arm bike might be to repetitive for people with lymphedema. I wonder what thoughts you ladies have regarding this type of exercise.  Thanks.",
      "MessageIndex": 4947,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Jul 29, 2014 08:59PM coffeelatte wrote: thanks ladies for the tips regarding plantar fasciitis.  I started to do some gentle stretches for the calf muscles, so that is a start.  And I will look for those inserts.  I noticed yesterday and today my shoulder was aching and feeling heavy (on the lymphedema side), so I got my shoes on and went for a 30 minute walk. Amazing.  The pain has been gone for hours.  Walking really gets the lymph moving for me.  It was just enough.  If I walk too far, I swell, but this was perfect today because it was cooler than usual this morning.",
      "MessageIndex": 4964,
      "PostDate": "29/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Jul 27, 2014 07:20AM coffeelatte wrote: Ok, after sitting on my couch for way too long, I want to get outside and start walking again.  I am always limping along a sore right foot with plantar fasciitis and metatarsal pain.  I wondered what type/style/brand of walking shoes those of you who walk are wearing. I am currently wearing those barefoot shoes, the Merrell Ghost, in the hopes of calming the plantar fasciitis, but after four months of wearing them, I don't think it is helping.",
      "MessageIndex": 4948,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Jul 27, 2014 11:12AM coffeelatte wrote: Proudtospin, I couldn't agree more. Lymphedema has changed the way I manage my life in a big way.  I am glad I came back to this forum because I was really letting the lymphedema get to me and feeling a bit depressed by it all. Then I come here and I feel hopeful and good again. I am struggling to wear any type of bra because they all seem to irritate the lymphedema I have on the left side of my chest. Yet if I go without a bra, I am reminded too much too often that I had/have \"breast cancer.\"  With a bra on under my shirts, I feel like me and I think my family feels the same. It just is hard to wear them even with the smallest puffs and an extra large bra band. Ok, done complaining.",
      "MessageIndex": 4950,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Jul 30, 2014 08:57PM coffeelatte wrote: Goldie, I will check into the Sketcher shoes, that is a great suggestion.  Through the years, I have tried custom made orthotics (at least five pairs) with not a good result so I am now all about the right shoes.  I will check it out.",
      "MessageIndex": 4972,
      "PostDate": "30/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Sep 19, 2009 06:10PM coffeelatte wrote: Hi Karen, I am so nervous and worn out by this whole exerpience so far. It has been going on since early June.  I just fear I will die half-way through a treatment or something.  My veins collapsed three times yesterday just trying to get the IV in my hand, foot and leg.  It was miserable.  I am so sore from the excisional biopsy that it is hard to take in a deep breath.  The surgeon took out more tissue than she planned because the wire had to be placed from the opposite side of the breast rather than from below.  I wonder if it is normal to hurt this bad after a biopsy.  I guess it is a lot of tissue though.  The surgeon said it is a lumpectomy but they don't call it that because I do not have a diagnosis yet.  She just scared me yesterday by looking so glum.  I am tired and that does not help. Lisa",
      "MessageIndex": 5,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/740616",
      "Title": "Got through the excisional biopsy, now so nervous coffeelatte coffeelatte"
    },
    {
      "AuthorID": "coffeelatte",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "coffeelatte wrote: I am sure trying to get this beginning of lymphedema under control but I have certainly taken some back stepping in the process. First of all I finally got in last Thursday to see a certified lymphedema specialist.  I was leery after the first 15 minutes with her because she said I did not appear to have lymphedema without an exam.  She said because I had only one lymph node removed and no radiation (she said \"just\" a double mastectomy like it was a skin tag that was removed) that I could not possibly have lymphedema. After I asked her, she did feel my left arm (through my sweater) and said she could feel swelling in the back of the arm, but it was probably surgery related. No, I don't think so after six months. Well, I gave her one more try this morning and I walked out of there barely able to breathe. She did about five minutes of what she called manual lymph drainage and I thought she was going to break a rib.  I asked her if she should be pushing that hard because I had read it should be much lighter and she said nothing short of vigorous rubbing would move the lymph. I called the main office when I got home and transferred to a different therapist.  I actually have a severe headache and increased swelling from the P.T. session. Also, this weekend I felt I needed to get out of the house, so much cabin fever in this weather, so I drove over to Dick's Sporting Goods store and tried on a men's Under Armor Compression T-shirt. I first tried on a medium and it was too large, so I tried to wriggle myself into the small. Oh my gosh, this was miserable.  I was half-way into the shirt and I got a little stuck.  I had my lymphedema arm in but could not get it to go over my other arm.  It was way too tight so I had to really contort to get it back off.  I did more harm than good to my arm by the time I got it back off.  I don't know what I did wrong.  I am 5'8\" tall and about 135 pounds so the medium was way to big but the small seemed to be three sizes down instead of one.  I compared that shirt to a few of the other colors and the sizing seemed to be the same. I was so sore by Saturday night so I got creative and pulled out a rather large Ace bandage that I had used after surgery to wrap my chest area.  It felt good to have it back on and it started calming the pain in my trunk area within an hour.  Unfortunately, it also causes me to get severe acid reflux so I can not wear it when I eat or for several hours afterward. I was really discouraged earlier this morning, but the sun is out and I had the good sense to change physical therapists so I guess I am doing some things right.  What do your guys do to calm down the pain from chest lymphedema once it is really flared?  Thanks for listening, this heavy arm and achey pain makes me feel isolated because I don't feel like driving when it hurts like this. Dx 7/2/2013, Grade 3, ER-/PR- Surgery 8/12/2013 Lymph node removal: Left, Sentinel; Mastectomy: Left; Prophylactic mastectomy: Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/817878",
      "Title": "Things I have tried this week that made my lymphedema worse coffeelatte tessu"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Feb 11, 2014 02:17PM coffeelatte wrote: Well I do feel better today compared to yesterday.  I woke up at two this morning with a really tight and swollen hand, so I got a bed pillow and propped it as I lay on my side and it did seem to help. Binney - I thank you and Musical for the links to the breast binder.  I did manage to get it to work so I could view it and I think I will order one this afternoon.  Looks doable for an uncoordinated gal like me. Lia13 - I am so glad you had a good session with your LE therapist.  She did something that I like and that is take measurements of your arm.  I like how she explained to you what to expect on the next visit and advised you to drink water.  The LE therapist I saw asked me to roll over on my stomach so she could feel my back.  I did so and she pushed a little, announced my thoracic spine was tight and started pushing down really hard on both sides of my spine with her weight in the palms of her hands.  It crunched my neck into the pillow, hurt the mastectomy scars and made my spine go pop, pop, pop. She told me she was not adjusting my spine, but that it was just air making all those loud cracks. I felt like I had just been to a chiropractor for a very strenuous adjustment. Not good. I am paying out of pocket because we have a high deductable so it sure bugs me on top of everything else to have to pay for a treatment that was hurtful. Oh well, I must let it go and focus on better days.  That is why this board is so helpful.  The ladies (and men) here understand the strain of a cancer diagnosis and all the emotional and physical effort it takes to get to be the best you can be after the treatments. I have had some things that did not work out this past week (also can't wear my new mastectomy bras that came in yesterday because they do cause more swelling in the trunk) so I have to chalk it up to lessons learned and move on.  OUT with the bras, in with finding some camis and a breast binder!",
      "MessageIndex": 8,
      "PostDate": "11/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/817878",
      "Title": "Things I have tried this week that made my lymphedema worse coffeelatte tessu"
    },
    {
      "AuthorID": "coffeelatte",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "coffeelatte wrote: Well I got through the excisional biopsy yesterday.  It was a long day for sure.  The mammogram technicians had a lot of trouble getting back far enough to capture the mass on the mammogram since it was up against the chest wall.  After an hour (and many mammograms) they finally got a good image of the mass.  The rest was easy.  The wire did not hurt at all but the radiologist had to go in from the side which resulted in a much larger cut.  Now I wait until I hear the news.  The breast surgeon said the mass had grown a little bit in three months and that it looked denser; so she was more suspicious of it.  Either way, I am glad I got it out.  I am praying God gives me the strength to handle the news either way.  Of course I am selfish and am hoping for a benign diagnosis.  I am scared because the breast surgeon said the last two ladies she had who's masses looked just like mine turned out to be cancer.  Not good news to hang on to through the weekend, but at least the biopsy is over. I am sore but the ice packs have really helped.  I can feel I am cut from one side of my breast to the other.  I am afraid to look at it.  I can't take the bra off until Monday, so that is good.  I can't believe how nervous I am about the findings... Lisa Dx 7/2/2013, Grade 3, ER-/PR- Surgery 8/12/2013 Lymph node removal: Left, Sentinel; Mastectomy: Left; Prophylactic mastectomy: Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/740616",
      "Title": "Got through the excisional biopsy, now so nervous coffeelatte coffeelatte"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Apr 2, 2014 07:45AM coffeelatte wrote: Yes, great information.  Kira's drawing has been a life saver for me.  I do that exact pattern twice a day at least.",
      "MessageIndex": 29,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/817878",
      "Title": "Things I have tried this week that made my lymphedema worse coffeelatte tessu"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Feb 13, 2014 09:36AM coffeelatte wrote: So much important information on this thread. I have read and reread it at least five times. Now that I am home and not on my phone I have been able to copy/paste the information into a Word document so that I can print it out.  I would also like to order the Lebed DVD later today. I love the information Kira posted regarding the sequencing of the MLD.  I have been using the handout the BS's nurse gives to patients before they leave the hospital after surgery (in case you feel or see symptoms of lymphedema) as a guide to help me do some light massage but there was no mention of clearing the abdomen, neck or good side. I am going to stand in the mirror and try it in a few minutes. I can't thank everyone enough for all the support and information. I don't feel so panicked and hopeless as I did on Monday.  I feel better knowing others have survived suboptimal PT sessions because my back still hurts from that treatment. And Lia13, I relate to many of the comments your doctor has said to you regarding lymphedema.  The BS said the same to me - you are too thin to worry about it, only SNB so you won't get it, and no rads so no lymphedema. I feel so uncomfortable bringing it up because the BS and his entire office acts like, well we saved your life by the surgery, you should be on cloud nine. I did not have any pain with the cancer (never felt it) so that was certainly a different medical condition compared to the medical condition of lymphedema. I can see it requires a different support system.  Thank goodness I have this website!",
      "MessageIndex": 20,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/817878",
      "Title": "Things I have tried this week that made my lymphedema worse coffeelatte tessu"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Sep 19, 2009 02:24PM coffeelatte wrote: Hi Clarice.  Yes, I am in one of those binding, tight bras.  The straps hurt as much as the bra.  I can tell it is really pressing down on the incision.  The incision is large and I am a 32DD, so I need the support.  I am going to see if my husband can cut the strap, then sew in about another 2 inches of material because the bra is really cutting into my shoulders.  I have very droopy girls after having kids so the weight just pulls. I am so nervous but you are right, this board has helped me so much.  I have been following your posts since you started in August - you are very very brave.  Thank you so much for sharing - it has helped me get through some very sleepless nights. As for the results; the surgeon said about five days.  So I don't know if that includes the weekend or not.  I wonder, do they tell you it is cancer over the telephone or do they have you come in?  Do they tell your primary doctor and then they call or does the breast surgeon's office call?  I forgot to ask and I really don't know. Lisa",
      "MessageIndex": 2,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/740616",
      "Title": "Got through the excisional biopsy, now so nervous coffeelatte coffeelatte"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Oct 16, 2013 07:35PM coffeelatte wrote: Lisa, I too suffer from lymphedema and I am waiting to be scheduled with a PT specialist. I have found only one position that helps me reduce the swelling. I have to lie down on the bed and prop my swollen arm so that it is above my heart. I make sure the wrist is higher than the elbow and the elbow is higher than my shoulder. I do this two or three times per day for 45 minutes. About 2 or 3 times during the 45 minutes, I open and close my hand 30 times. I was told to do this by a PT who works with my BS. She said that should help with swelling until I can get scheduled to see someone covered by our HMO. It took about three sessions before I started to see a difference. Not only did it stop that dead-aching pain and heaviness but it helped relieve the miserable claw feeling I get under my arm where the lymph node was dug out. My BS said the node was really deep plus I have had two prior (unrelated) elbow surgeries on that arm so I was not surprised when lymphedema hit. I hope you are able to get comfortable and find some relief.",
      "MessageIndex": 13,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/812820",
      "Title": "Lymphedema - what's all involved in getting diagnosis and care? LiLi1964 carol57"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Feb 10, 2014 02:32PM coffeelatte wrote: Thanks Musical.  I think I just had a bad go of things for a bit.  I still have a headache, but other than that I think I am ok.  The therapist meant well, it was just far too vigorous.  I thought she might break a rib if she kept going.  It was way too much pressure on the mastectomy scars, that is for sure.  I came home and ate a piece of cake, that seemed to help!  Too funny.",
      "MessageIndex": 2,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/817878",
      "Title": "Things I have tried this week that made my lymphedema worse coffeelatte tessu"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Oct 16, 2013 08:11PM coffeelatte wrote: Lisa, I too am one of the August 2013 surgery members but I do not post much because a slow recovery and lymphedema keeps me off the computer. I swell like crazy when on it; however, I read the posts all the time from my iphone. Unfortunately, I can not seem to log on when using my phone so I wait for a really good day to get on my lap top. I have been diligent with the arm prop and it has turned things around for me. I think it will help you too.",
      "MessageIndex": 15,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/812820",
      "Title": "Lymphedema - what's all involved in getting diagnosis and care? LiLi1964 carol57"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Sep 18, 2009 02:41PM coffeelatte wrote: Thanks all for the well wishes.  I am showered and ready to go.  I will be so glad when this is all over.  What a stress this breast cancer stuff is to bear.  Everyone have a good day and a restful weekend. Lisa",
      "MessageIndex": 5,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740551",
      "Title": "Having excisional biopsy in 16 hours coffeelatte communicationb"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Feb 12, 2014 09:32AM coffeelatte wrote: Kira, thank you so much for this post.  It has helped me feel a lot better about continuing to find help instead of listening to this therapist as I am sorry to say I suspect she is very wrong.  I was worried about lymphedema even before I had the mastectomies because I have had two ulnar nerve transposition surgeries in my left arm (the cancer side) in 2006 and 2007 that did not go well so I dealt with a lot of swelling and pain for three years. It seemed I was finally settled with my arm and then this cancer had to show up on the left side.  When I consulted with the breast surgeon, he feared triggering lymph problems in that area so he was considering skipping the sentinel node biopsy.  He said he would only take the node if it was easy to get.  He did remove it and that is the area where my pain and swelling has been centered from the day of surgery.  However, I did not notice swelling in my hand until the first week of January, 2014.  It was that miserable, tight skin and ache in the back of my arm that brought back a lot of miserable memories of the two arm surgeries. Plus I can not see the veins in my chest at all on the left side but I seem the clearly on the right.  The therapist never had me take my sweater off to look. Again, I am so lucky and thankful for this website.  Without it, I would have thought the therapist must be correct because she has the CLT training and I would have probably gone a very long time before getting a second opinion. I love the links you added as it just is another huge mental and emotional help to me at a time when I feel very isolated, anxious and depressed about this situation.  I have a lot to be thankful for (and I am) but pain is pain and it is hard to relax when you don't know the correct way to handle this.  So for now propping my arm and doing gentle massage from the armpit to the breast bone to move some of the fluid out (which it does). I see a different therapist on Monday.  I saw her for three visits right after surgery when I had trouble raising my arm.  She was excellent for that so I am hoping to get some help.  I did not go back to her because she is in the same building as my BS, which is a 30 mile drive compared to the PT I saw on Monday which is a five mile drive.  Funny, the distance seems like nothing now.",
      "MessageIndex": 11,
      "PostDate": "12/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/817878",
      "Title": "Things I have tried this week that made my lymphedema worse coffeelatte tessu"
    },
    {
      "AuthorID": "coffeelatte",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "coffeelatte wrote: I am so nervous.  I am going in to the hospital tomorrow at 10:00 a.m. so they can put in the wire around 11:00 a.m. and then the biopsy at 1:00 p.m.  I have had severe nerve damage from a prior operation to my left arm which left me with a condition called CRPS (also called RSD).  It is a miserable pain condition that flares up a lot.  I am just so nervous the biopsy will cause a bad flareup of the pain.  I just hope I can get through it all.  I feel so helpless right now. Lisa Dx 7/2/2013, Grade 3, ER-/PR- Surgery 8/12/2013 Lymph node removal: Left, Sentinel; Mastectomy: Left; Prophylactic mastectomy: Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740551",
      "Title": "Having excisional biopsy in 16 hours coffeelatte communicationb"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Oct 17, 2013 09:20AM coffeelatte wrote: I had a lot of swelling a few weeks after surgery. At a follow up appointment my BS did not like the way my arm looked and he was not happy with my limited range of motion. I went to PT hoping the improved range of motion would relieve the pain and swelling, but it did not. Instead it got worse with several of the exercises I was doing at home. I also noticed a lot of swelling around the incision on my cancer side but did not seem to have it on the prophylactic side. I kept massaging the cancer side but the swelling would not diminish. Also, the scar/incision on the cancer side began widening quite a bit from the swelling putting pressure on it. The other side is a nice little line and now the cancer side is a huge, red, mean looking scar. It did not look like that until the swelling put all the pressure on it. I keep doing the elevation with the arm and has helped the pain in my arm; but it certainly is not a permanent fix at this point. I just am so thankful it reduces my pain. I can't thank the ladies here who give such great words of wisdom and sage advice. In late August I was wrapping my arm with an Ace bandage for about four days until I came to this site and read it is not a good thing to do. It saved me from creating a more serious problem. Thank you so much for all the time and effort everyone puts in to this website.",
      "MessageIndex": 17,
      "PostDate": "17/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/812820",
      "Title": "Lymphedema - what's all involved in getting diagnosis and care? LiLi1964 carol57"
    },
    {
      "AuthorID": "coffeelatte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86699/profile",
      "Content": "Sep 22, 2009 10:08AM coffeelatte wrote: Hi Coolbreeze, I am sending prayers and positive thoughts your way as you are going through this terrifying experience.  Oh my gosh, you poor little thing.  I hope you have some distractions at home to help you escape the stresses and fear generated from all the testing.  At least your medical team is being thorough. If you want to see what an MRI for breast looks like, you can go to Google Images and type it in.  The MRI machines are not as long at a regular MRI machine and they are built so the doctor may get close to the patient.  The look more like a CAT Scanner to me.",
      "MessageIndex": 3,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/740739",
      "Title": "And, the saga continues CoolBreeze CoolBreeze"
    }
  ]
}