{
  "AuthorID": "concernedsis",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82386/profile",
  "Posts": [
    {
      "AuthorID": "concernedsis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82386/profile",
      "Content": "concernedsis wrote: Rad onc says no tamoxifen during rads- says increases side effects of rads. Medical Onc says no way Jose must start 1 month out from surgery. Who wins? Anyone had issues with tamoxifen during rads? Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/742036",
      "Title": "Tamoxifen B4 or after Rads concernedsis concernedsis"
    },
    {
      "AuthorID": "concernedsis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82386/profile",
      "Content": "concernedsis wrote: Sis will be starting rads probably in November - no signs of LE after her unilateral mastectomy & axillary node dissection on her dominant hand one month ago today. Surgeon poohooed LE evaluation. Rad onc says yes LE risk increased so med onc agreed to preventative LE eval prior to rads starting.What should we expect and what should we ask for?  Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/742173",
      "Title": "What to ask for in a LE Evaluation concernedsis concernedsis"
    },
    {
      "AuthorID": "concernedsis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82386/profile",
      "Content": "concernedsis wrote: has anyone had a PET scan show increasedd uptake around their tissue expander - is it normal? If not what does it mean? Will it affect timing of sister's exchange? Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/750142",
      "Title": "Should a PET scan be positive with a TE? concernedsis MicheleS"
    }
  ]
}