{
  "AuthorID": "ConnieW2018",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274432/profile",
  "Posts": [{
    "AuthorID": "ConnieW2018",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274432/profile",
    "Content": "ConnieW2018 wrote: I had a suspicious 3D mammo about a month ago--not an unusual circumstance, I have dense breasts and have gotten call backs before. This call back was for an ultrasound and halfway through the tech announced \"I'm sorry, but the doctor needs to see this.\" Great, I thought as I was ushered in to see the Breast Navigator...what? Breast Navigator? Okay, as far as risk factors go, I'm 55, and don't have kids...not for lack of trying or wanting. I'm healthy, though could stand to loose some pounds (thank you menopause). No family history of cancer of any kind. I started my period when I was 10; finished it around 53. So back to the navigator, she showed me a graphic while pointing somberly to the 7mm spot and after several perky \"I'm sorrys\", she handed me paperwork to schedule a biopsy. It took 2 1/2 weeks, during which I worked hard convincing myself that it was a fibroid. The biopsy last Monday was a drag and I ended up with a horrible 3+ inch purple, fuschia, yellow bruise that itches a bit right now. Then my primary care provider called me Wednesday morning with another \"so sorry\", but she hadn't read through the pathology report and couldn't give me any information. Now I'm waiting for my first visit with the surgeon on Tuesday...puts a damper on the whole holiday weekend. But I have to admit I'm really trying not to make this too precious...it's a boob, or rather a spot in my boob that wasn't there last year...because in constrast one of my closest friends is, at 56, fighting the rapid progression of early onset Alzheimer's and has lost nearly half of his words. A boob is not a brain, despite what Hollywood has been telling us for years. Still, I'm anxious to read the pathology, and not just a little perplexed about what triggered the cells to mutate--plastic water bottles, years working in hazardous environments, too many x-rays, not enough vitamins, fast food, power lines, or just dumb random luck. And more than anything I HATE that life as I knew it has changed. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "27/05/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864881",
    "Title": "This is surreal: got the \"so sorry\" call ConnieW2018 Ingerp"
  }]
}