{
  "AuthorID": "connie432",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168148/profile",
  "Posts": [
    {
      "AuthorID": "connie432",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168148/profile",
      "Content": "Jan 25, 2013 08:08PM connie432 wrote: Hi linaep, I hope that your breast exam went well. I'm interested in how it went because your symptoms sound similar to mine! I also have a quite large palpable lump on in my breast. The lump doesn't have definite edges - seems to mold into the rest of my breast tissue, and it seemed to be growing over a few months! I also found a small bump of breast tissue in a bony area inside my breast - i think it's above a rib - that just appeared relatively recently. Like you, I had an ultrasound that showed nothing at all. I have an appt for 1/31 with a breast surgeon, during which I'm going to try to push for a biopsy. I've been extremely anxious about my lumps, as I'm almost sure they've grown some. Anyway, I hope all is going well on your side. Wishing you the best~ connie",
      "MessageIndex": 4,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798551",
      "Title": "Breast lump for 3-4 mos, now hard pea-size bump on left clavicle baml connie432"
    },
    {
      "AuthorID": "connie432",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168148/profile",
      "Content": "connie432 wrote: Hi everyone, This is a long story, but been very worried about this lump in my right breast that I've had for about 1.5 years. Well I might have had it for even longer than that but I first discovered it in October of 2011. I found it coincidentally when I was in the shower and my right nipple was itching. The areola around the nipple looked shrivelled. I'm certain that that my right breast got smaller at that point, because years before discovering the lump they were the same size. I didn't even consider breast cancer at the time, because I didn't know much about it. I finally got checked in May of 2012 really worried about it. The primary physician didn't seem worried and kept telling me that \"I was too young to get breast cancer,\" as I am 19 years old. I had the odd feeling that she was just dismissing all my symptoms based on statistics, so I pressed for an ultrasound. The results came back negative- but no definite diagnosis- they didn't say it was a fibroadenoma nor a cyst, because the ultrasound showed solid tissue throughout my breast. I just took the doctor's word for it and actually stopped checking for about 7 months - until December 2012, when my mom asked me about the lump. I felt the lump- it was still there and the surrouding tissue felt thicker. The lump felt maybe 1.5-2 times as large. I also discovered a small bump on the side of my right breast near the sternum (it was a bump located above a rib bone). I got another ultrasound- it showed up as negative. Then a doctor evaluated the lumps and thought that I didn't a biopsy. I was relieved and went home, until I realized that I forgot to mention the history of the lump - which was that my breast had actually shrunk in size and that the my nipple changed color 1.5 years ago. Texture of the lump: The lump always felt kind of rubbery, and it was always attached to the surrounding breast tissue. I could not make out the edges of the lump. Symptoms upon discovery: slight shrinkage of right breast (assuming because of lump formation), nipple changed to darker color permanently and gets stiff when touched or cold. I'm going back in for an exam on the 31th of January, and this time, I'm going to press for a biopsy. I know the odds are technically on my side because \"I'm too young to get breast cancer,\" but the symptoms i've had, including the thickening of breast tissue and slightly larger lump are very much real. And it bothers me that I have this lump that feels 5cm in diameter now that hasn't changed in size and another small but irregularly shaped bump on the same breast and neither of them showed up on the ultrasound while they were clearly palpable. Has anyone experienced similar symptoms to what I'm going through, such as shrinking of breast, color change, and how did the diagnosis turn out for you, if you got one? Also, what's the growth rate of breast lumps that are cancerous - in other words, is there any chance that I could make it if i went with a lump for 1.5 years? I'm really anxious and looking for some support :( Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799211",
      "Title": "Worried about lump, shrinking of breast, nipple color change connie432 EmD"
    }
  ]
}