{
  "AuthorID": "Connie57",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249257/profile",
  "Posts": [
    {
      "AuthorID": "Connie57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249257/profile",
      "Content": "Connie57 wrote: I saw the surgeon on Tuesday have early stage 0. Will have surgery. Waiting for scheduler to call back with date. First it was to be the week of march 26 now week of April 2. Have called twice still no positive date. Going crazy waiting for that call. Have spent the last 4 hours on websites looking for an answer as to how long this surgery will be. He is taking 10 centimeters from my right breast an de the. Follow up with radiation. So can someone tell me how long this surgery will take. And how you feel or afterwards. Just feeling scare Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/853725",
      "Title": "Surgery Connie57 Hopfull2"
    },
    {
      "AuthorID": "Connie57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249257/profile",
      "Content": "Mar 31, 2017 08:01PM Connie57 wrote: so I don't know what to do with myself so I've been cleaning like a pregnant woman nesting and got the bruises to prove it. Seriously thinking of backing out. It's a financial besen to me. I'm a single mom have two girls one full time CSUF student and the works to helps ends meet. They raised the rent have car insurance to pay and a electricity bill to pay. I will go eight days without pay. I'm just not gonna make it financially this month but the surgeon wants to donit right away. He said the sooner the better. Woo is me:(. Sorry just feeling a little sorry for myseld. But seriously think of canxellin",
      "MessageIndex": 2,
      "PostDate": "31/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/853725",
      "Title": "Surgery Connie57 Hopfull2"
    }
  ]
}