{
  "AuthorID": "Coralyn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180103/profile",
  "Posts": [
    {
      "AuthorID": "Coralyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180103/profile",
      "Content": "May 29, 2013 07:40AM Coralyn wrote: I've only had genetic testing recommended in the last week - since I voiced concern about this new lump. Both the radiologist and my GP have suggested I get it when this is all over. I'm not against the idea, it was just not something that was talked about an awful lot 7 years ago when I had my biopsy. The radiologist has also suggested I get MRI's in the future, as they're more accurate than ultrasounds for the sort of problems I have with my breasts.  Thank you for your reply :)",
      "MessageIndex": 2,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805361",
      "Title": "Mass of normal breast tissue + strong (early) family history? Coralyn RobinJoy"
    },
    {
      "AuthorID": "Coralyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180103/profile",
      "Content": "Coralyn wrote: Hey there. To begin with, I'm 25 years old. My mother was diagnosed at 34 with breast cancer (mass was removed and she had radiotherapy) and my maternal grandmother was diagnosed at 41 (mass removed, radiotherapy attempted, double mastectomy). I have a history of fibro adenomas - have had them since I started 'developing' in my teens. I had a biopsy done on one when I was 18 because I was concerned about the size. All came back normal. They've appeared and disappeared randomly over the years, but all have the same features - hard, pea-like round lumps that vary in size and pain depending on where I am in my cycle. I'm vigilant about checking for lumps due to my own history of fibro adenomas, and my family history of cancer. I tend to give myself the 'around the clock' boob grope in the shower when I'm not rushing out the door someplace. In January I noticed a new lump for me, in my right breast right up near my armpit - the right axilla tail, they're referring to it as, in my records. Even at that point it wasn't quite the same shape/consistency as my normal ones, but I left it, just hoping it would go away. However, over the last 5 months it's slowly grown in size, it isn't as 'hard' as the others (it feels kind of bumpy-ish), and it's not the same round shape of my usual fibro adenomas. It also doesn't vary at all depending on my mostly non-existent cycle (I'm on an IUD now, but still notice slight variations in my other 'normal' lumps). I finally mentioned it to my partner a couple of weeks ago. He panicked and insisted I see a doctor about it, so I did. He referred me for an ultrasound, which showed a mass of 39mmx5mmx14mm. The lymph node is normal, sitting under it at 5mm. It doesn't show any serious markers (the density is normal, no shadowing, etc) of cancer, and it appears to be normal glandular breast tissue from what they can see. Took the results back to my referring doctor (just a general practioner - my local doctor) today to discuss them. Even though it looks normal, he wants me to see a breast surgeon because he's still concerned. He can't explain why I suddenly have a mass of normal breast tissue that's slowly growing and changing shape. It was about the size of a pea in Jan when I found it, now it's much bigger than that. I'm not a very 'gifted' woman in the breast department - lucky to fill a 10A in bra size after breastfeeding/expressing milk for 3 children. The lump was definitely not there much before January - As I mentioned, I check myself regularly. It's in an awkward place that I admit I'm not as thorough with, but with the frequency of my self-checks, I'm very, very sure I would have noticed it if it was there much longer than I discovered it. Has anyone else had issues with masses of normal breast tissue? Is there anything I should know/discuss with the surgeon before I see them? I have a genetic condition that causes an immunity to local anaesthetic, so a biopsy isn't an easy process for me (which we didn't know about when I had my last one done. Most painful experience of my life, far worse than childbirth!) Any advice on what to discuss with the specialist? Did anyone have something similar? I'm usually the last one to panic over breast lumps, but this one isn't right for me and it has me worried. Something is ringing alarm bells. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805361",
      "Title": "Mass of normal breast tissue + strong (early) family history? Coralyn RobinJoy"
    }
  ]
}