{
  "AuthorID": "corsa",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60319/profile",
  "Posts": [
    {
      "AuthorID": "corsa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60319/profile",
      "Content": "Jun 22, 2008 08:17AM corsa wrote: Hi Chris and Sue thank you so much for getting back to me. It sounds as if am having whole breast radiation but thanks for tip on google.  I have to have five weeks Ugh!!! start on Tamoxifen next week for five years , that is something else thats scaring me ,will  it ever end . Bobbie",
      "MessageIndex": 11,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/707537",
      "Title": "focused radiation vs whole brest radiation Marykak Nitsana"
    },
    {
      "AuthorID": "corsa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/60319/profile",
      "Content": "Jun 21, 2008 10:05PM corsa wrote: Hi I am having treatment in Uk. Do not understand focused against whole breast rads??I have undergone two rads out of 25 and have two zaps one on boob scar (WLE) and other on lymph node scar . I have two metal sticky plates on each scar and zapped on both these. Is that what you mean by focused.??????  Think you are more up to date in US regarding treatment and methods via us limeys . I am very lucky have had very good experiences with staff and have super ONC. I find myself getting very short tempered lately , Was diagnosed withh 18mm tumour (non palpable) found on Mamm . Op on lymph nodes found 1/7 positive . Chemo was absolute hell and I only had six out of eight planned sessions was very ill with pancreatitis.   Now I am being zapped daily (mon-fri), start tamoxifen next week.  It's been 10 months since diagnose and all this has completely taken over my life,  I know they are trying to save my life but I am tired of being prodded and poked about and not wishing to sound ungrateful but I feel I am coming to the end of my tether.   Anyone else feel like this????Bobbie",
      "MessageIndex": 7,
      "PostDate": "21/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/707537",
      "Title": "focused radiation vs whole brest radiation Marykak Nitsana"
    }
  ]
}