{
  "AuthorID": "countryfrau…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
  "Posts": [
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "Jun 4, 2010 04:56AM countryfrau wrote: Just to add briefly on the issue of antidepressants:  Many people shy away from them because they think it labels them \"crazy\". Nothing could be farther from the truth. Depression is often a chemical imbalance in the brain and nothing more. The medicine (even in a mild form/dose) can help. Many years ago, I was put on Celexa, and it was a life saver for me. I was never suicidal, but I just didn't care if I lived or died, and I was crying all the time. It worked wonders...and it took only a couple weeks to turn things around. So listen to Kina and Sue. And I will keep you in my prayers. I, too, hope you'll try the chemo and that you will find peace and happiness...one step at a time. Jan",
      "MessageIndex": 5,
      "PostDate": "04/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753597",
      "Title": "Deciding Against Chemo JudyAnnW Titan"
    },
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "May 21, 2010 02:19PM countryfrau wrote: Welcome to all and I really hope everyone is doing OK. I'm having a bit of a rough time, but not complaining since it IS manageable. The stomach pains continue, but eating small amounts seems to help. No matter how small the amount, though, the nausea sets in. So I take a compazine and fall asleep..feel a little better after a 2 hour sleep, but then it starts all over once I get up. Ugh! But it could be worse. Had a bad backache (Neulasta shot) which went away with only one pain med, so no complaints there. Question: I really have the dry mouth and am using the Biotene mouthwash. Has anyone had the problem of developing too much saliva after using it? I'm constantly clearing my throat for a hour or so after using Biotene. I think I'll switch to hard candy for mouth moisture.  I go for my wig today. I'll time it between compazines, although the 'fun' will probably keep me awake. I've read all your posts and have laughed and cried through them. I didn't expect this hair loss to be such a big deal for me. I'm 61 years old for heaven sakes, and have a DH who supports me totally. Guess I'm mostly worried about the eyebrows....I hate the thought of painted on eyebrows.  This is certainly not the cake-walk they made it sound like in my chemo-teaching, but it isn't as bad as I had expected, either. I'm still in awe of those of you with jobs and little ones to care for---you are my heroes! I think of you whenever I want to whine, and instead, count my blessings. God bless us all, and have a chemo-good day. Jan",
      "MessageIndex": 382,
      "PostDate": "21/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "May 13, 2010 03:54AM countryfrau wrote: I, too, will be starting chemo this month and I'd like to join this group. I'll be starting TC x 4 on the 17th and then have radiation. I'm triple negative, so not a candidate for Tomoxafin. By chance, does anyone have a diagnosis of metaplastic bc? It's a very rare bc..there is a forum on this website for it, but very few posters.  Anyway, your comments have encouraged me and I thank you for sharing. I'll be back after the 17th. Best wishes to all as we share this journey. adb1971 - My drain was in 4 weeks which pushed back my chemo as well. You're starting the day after I am. ",
      "MessageIndex": 225,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "May 14, 2010 06:11AM countryfrau wrote: Thanks for the welcome, Leanna9. This thread is wonderful! So many helpful hints from the strongest women I've ever met. Thank you so much! My port goes in today...just a little nervous about that. I'm not sure why, as everyone says it's no big deal. Just not the way I wanted to spend my 33rd wedding anniversary. I'm drinking, drinking, drinking, and following all the advice I'm reading. Getting ready for my first tx of TC on Monday. I'm glad I'll be premedicated with Benedryl and Decadron. The thought of a reaction is a little scary. Funny story.....at least my husband, Bill and I think it's funny. He has always been 'UB' (Uncle Bill) and I have always been 'AJ' (Aunt Jan) to our  nieces and nephews. Well, since my mastectomy, we now dubb ourselves UB1 and UB2....(Uncle Bill and UnaBoobie) So far we've only shared our little joke with our closest friends. We're not sure how the family would handle it, but we know that we have to keep everything in perspective...without humor we'd go nuts! Good wishes and hugs to all my new friends.",
      "MessageIndex": 254,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "May 15, 2010 06:29AM countryfrau wrote: Well, the port-a-cath went in yesterday, and it wasn't as bad as I had anticipated. The only negatives were that the anesthesiologist had to stop the IV sedation during the procedure because I started coughing...so there was a little pain involved. Otherwise, as someone else said, I could just feel the pressure of what I assume were the surgeon's hands placing the port. Once the local wore off, the pain I had up to now was controllable with Tylenol. All in all, it was well worth it so that I won't have to be stuck in the arm for every blood draw and chemo TX....I have lousy veins on the left side! packjen-Your SE on your hand at the IV site sounded painful. Did they consider a porta-cath for you? Redbarb804 & Jenny B. Thanks for your posts re your hair loss. I'm still debating whether to have my head shaved or stretch out the no-wig time by letting it fall out naturally. I'm leaning towards the latter. I go for my wig on Friday (21st). Leanna9-Thanks for the tip about Pain meds after the port insertion. So far, I've only needed Tylenol, but I just got up a little while ago and the site is quite painful. I'll wait a bit to see if it lessens, and then I may take a vicodin if it doesn't.  He put the port on the left side, upper chest. I was surprised when the nurse said he might put it on the rt side..mastec side...so I was glad he chose the left! Chemo starts Monday. My onc didn't say anything about a neulasta injection. Is that shot routine for a low WBC count or do some oncs give it right away when chemo starts? I worked in oncology 20 years ago, but either I've forgotten everything I knew, or there have been just so many advances...I suspect the latter. Shoot! Twenty years ago they never heard of Triple Negative bc or metaplastic bc(not to be confused with metastatic bc). Bc was bc, and they didn't have the meds to control SEs like they do now. Well, you ladies have a good week-end...I'm going to stay busy so I don't worry about Monday. Your posts have really helped me keep things in perspective. Throwing support out to you all! Jan ",
      "MessageIndex": 272,
      "PostDate": "15/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "May 17, 2010 09:08AM countryfrau wrote: Alice: Welcome! You have different drugs than Claudette and I (TC x 4), but we all are starting chemo today. And there are several starting tomorrow, too. So there are helps from people who are in all stages of tx. I, too, slept fairly well last night, but I can feel the anxiety coming as the time nearers. I come to these boards and read, read, read since that helps me to stay more controlled. Like you, before I found this site, I felt pretty alone despite all the great support I got from some friends, my family, and devoted DH. Come back often! fotopet: Thanks for the encouragement. I'm also glad (?) to see you've been cleared for tx...you know what I mean. Not so much glad for tx, but that your 'waiting' period is over. That's what I'm most grateful for..if it has to be, then let's get on with it. njbhwgirl: I'm sorry you're having these 'fuzzy' days. From what I'm reading it seems to be a fairly common occurance...but that doesn't make it easier, does it? Hugs and wishes for clearer days to come. Jan",
      "MessageIndex": 308,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "May 17, 2010 06:29AM countryfrau wrote: Well, today is the big day, and I slept pretty well considering. Thanks for the suggestions about a sleep aid...it really helped. I may have not slept a long time, but when I was asleep, I was SOUND asleep. ClaudetteK: I'll be thinking of you today as this is your first TC day, too. I go at 1:30 p.m. How about you? I'm glad you're here with us...you will find this the most comforting, informative site with so many helpful posts. How much more fearsome this disease must be with the 4 little ones. I want you to know that you, and all the Moms, are in my thoughts and prayers. I'm so glad you have the means of getting outside help for your family. Good luck today! bArb: Thanks for the words of encouragement. Glad to hear you're doing OK so far. sacphotomom: I read your post to Juliebed and felt the encouragement myself...that's the beauty of these boards. Little things we say to each other can be such a help to everyone. Thanks to all for 'getting me ready' to start my chemo. Not looking forward to it exactly (who is?), but let the show begin! Life is good! Jan",
      "MessageIndex": 303,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "May 18, 2010 03:44AM countryfrau wrote: Well, the anticipation of the first day of chemo was the worse thing about it..other than the hour delay in the waiting room. I really started getting worried then, but finally they called me in. My port was a little tender, but the RN accessed it without any discomfort at all. I was surprised as I expected it to hurt since I just got it on Friday. The premeds took 1 hour and were given in 2 IV bags 30 min. apart. One was Benedryl and Pepcid and the other was Decadron, Emend, and some other drug that I can't remember. The taxotere went in without any trouble and I slept through most of the Cytoxin...probably from all the pre-tx meds. The only thing I felt was a \"fuzzy\" feeling....sort of like not seeing clearly, but not really dizzy or anything like that. It's going away now. I go back tomorrow for the dreaded Neulasta shot...or I should say \"once dreaded\" since after reading the posts about being hospitalized for low WBC counts, I think I'd rather take the shot and hope for the best. Nanof2 and packjen: So sorry to hear you had to be in the hospital. Wishing you healthier days ahead. fotopet and snipinfood, and all others startiing chemo tomorrow: Good luck, and I hope your first Tx is as uneventful as mine was. Not saying chemo won't be a rough ride, but the first mile wasn't bad. Jan",
      "MessageIndex": 325,
      "PostDate": "18/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "May 19, 2010 05:22PM countryfrau wrote: Good morning, Im on Day 3 of TC and guess I'm having payback for the uneventful Day-1 I had. Feeling what I assume is the normal way to feel after being pumped full of toxic meds (designed to heal me; so how weird is that?) and other meds to lessen the SEs. Very tired, but no nausea...just a grinding stomach that hurts a lot, especially when I move around or it's empty. Cracker munchy helps. So I just 'go with the flow' and am grateful I feel no worse. Thanks to all who encouraged drink, drink, drink. I'm sure it's made a huge difference in how I feel. I'm up to about 80-100 oz a day. Is that enough you think? That, plus the small glass of prune juice have helped stem constipation so far. DRIM-Thanks for your comments about the Neulasta shot. Most everything I've read has been negative..hopefully I can be like you with no problems. Mommyto4Greatkiddos-Welcome to this thread. There's lots of support here. Good luck with your first treatment tomorrow. njbhwgirl-So sorry to hear you were at the hospital. Are you feeling better? That must have been scary. Day- Loved your comment about just going bald w/hoop earrings. I've seen that look and it's been great on those who can wear it. Wish I didn't have such a large round head...don't think it would work for me. I say, go for it if you can! fotopet-I'm so sorry that your first treatment began with such difficulty. It's comforting to know that the staff knew how to handle the situation, though, when you had the Taxotere reaction. That was a big fear of mine, since so many ladies have commented on it. I, too, have the 'decadron red'..probably not as much as you, but enough that my DH keeps telling me how healthy I look with this 'red glow'. :)  Hope your SE are less troublesome. JennyB, Merry, Summer38, and Julie-Good luck with your treatments tomorrow. Will be thinking of you and wishing for uneventful infusions for you all. And, once again, I am in such awe of all of you and thank you so much for your willingness to share and encourage.  Jan",
      "MessageIndex": 350,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "May 17, 2010 06:11AM - edited May 17, 2010 06:11AM by countryfrau",
      "MessageIndex": 302,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "May 17, 2010 09:13AM countryfrau wrote: DRIM: Our posts must have overlapped. Thanks for the kind words of encouragement. I've never drank so much water as I have these past few days...actually feel better having done so...or maybe it's the decadron. lol",
      "MessageIndex": 309,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "countryfrau…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101756/profile",
      "Content": "May 27, 2010 08:31PM countryfrau wrote:",
      "MessageIndex": 483,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    }
  ]
}