{
  "AuthorID": "Court",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273953/profile",
  "Posts": [
    {
      "AuthorID": "Court",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273953/profile",
      "Content": "Court wrote: I’m 33 years old and have naturally somewhat lumpy/fibrous breasts (some as a result of frequent running). Around nine months ago I noticed some dull pain in my right breast along with an infrequent mild itch in my armpit. I saw my GP about this but she chalked it up to the fact that I had been doing strenuous TRX workouts along with being on the minipill oral contraceptive. The pain and itching subsided greatly once I stopped taking oral contraceptives and changed my workout habits. I would only notice a slightly ache and feeling of fullness in either one or both breasts just before I got my period each month. Flash forward to March of this year and I came down with a terrible ear infection and fever, first on my left side for which I was treated with antibiotics. As soon as I completed the antibiotics course my right side came out in an even more nasty ear infection with low grade fever and fullness in my sinuses on the right side. This went on for another week before I visited my doctor for another round of antibiotics to treat the right ear/side. As I was finishing that course of antibiotics (which also coincided with the end of my patios) my right breast started to become quite painful in both the upper quadrant and lower right side with some pain even traveling into my side/underarm area. At time it feels like an ache, made worse especially if I’m leaning forward at my desk working and taking deep breaths. Other times I have a weird sensation that feels as if I have a growth or other mass stuck in the side of my breast/armpit though when I physically check I can’t find any signs of a lump or growth. The pain was quite unbearable last week, but has subsided and seems to be waning over the past week. I check both breasts regularly for lumps and haven’t felt anything to set off alarm bells over the last few months or ever. In addition my entire right side feels inflamed or infection to some degree. My ear pain and discharge is gone after the antibiotics but I still have an annoying feeling of fullness in my ear and I have had intermittent pain shooting down into my right side in my pelvic area (it feels like a period cramp or that I hurt my back). I have had two massages over the last two weeks thinking it might be a case of a pulled muscle or pinched nerve in my shoulder causing the ear and breast pain which did seem to help somewhat, but the pain and fullness is still enough to annoy/worry me that it might be something more sinister. My right breast isn’t red, inflammed or warm to the touch and I don’t have any nipple discharge or skin changes, which might rule out mastitis. I was so freaked out about it last week I went to the walk in clinic as I couldn’t get an appointment with my GP but the clinic nurse treated my like I was a hypochondriac and sent me on my merry way without doing an exam and told me to monitor it over the next few weeks. I’m just concerned about these symptoms and if they are characteristic with any symptoms of BC or just a benign problem or if my ear and breast pain even have any connection at all. Any insight would be great. I’m making an appointment with my GP to ask for a breast check, but I’ve just been made to feel that nothing is wrong with me and I’m over exaggerating about my issues, but I just feel like something is not right on the inside and it’s really freaking me out. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864578",
      "Title": "Pain in breast and side of body Court HoneyBadger47"
    },
    {
      "AuthorID": "Court",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273953/profile",
      "Content": "May 17, 2018 04:01PM Court wrote:",
      "MessageIndex": 4,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864578",
      "Title": "Pain in breast and side of body Court HoneyBadger47"
    }
  ]
}