{
  "AuthorID": "Cowgirlsand…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
  "Posts": [
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Apr 20, 2017 08:53PM CowgirlsandAngels wrote: I definitely will let you know. When I first walked in to the screening room the technician said it would be two weeks before my Dr had the results. I asked to see the images afterwards and she pointed out the area when the lump was. It didn't mean anything to my untrained eye. As I was leaving, she walked me out and said \"it will NOT take 2 weeks for your doctor to get THIS report\", if she was trying to reassure me, it didn't work.",
      "MessageIndex": 4,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Apr 24, 2017 06:29PM - edited Apr 24, 2017 06:29PM by CowgirlsandAngels DJMAMMO the receptionist from my doctor's office called this morning to tell me that I had to go for an Ultrasound on May 5th. My doctor is out of the office and I asked her what the report said. She said \"All it says is that the mammogram is inconclusive and an ultrasound is the next step\". There is a palpable mass. And the technician pointed out where the mass was on the image before I left. I wish I could just put it out of my mind.",
      "MessageIndex": 15,
      "PostDate": "24/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Aug 20, 2017 08:46AM CowgirlsandAngels wrote: Thank you Diane! I'd love if cysts was the answer. Just aspirate and let me move on with my life! I keep hoping that the cysts have just grown so large that it is causing the other symptoms. I'm being very optimistic, and I'd just to get past this..I have stuff to do :)  Angela",
      "MessageIndex": 32,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Apr 20, 2017 08:37PM CowgirlsandAngels wrote: I'm in Nova Scotia, Canada. As soon as I posted the message above the diagnostic clinic called for me to come in immediately. The breast with the lump had a noticeable amount of clear fluid expressed during the mammogram. The technician said that it happens sometimes. But I was alarmed. My baby is 10 years old, and I've never had any discharge from my nipple since I stopped nursing 9 years ago. ",
      "MessageIndex": 2,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Apr 28, 2017 09:31PM CowgirlsandAngels wrote: The diagnostic clinic called this afternoon. I was hoping it was for a cancellation because I was on the list. Nope. They've rebooked me from May 5th to May 15th. This is hard on the old head.",
      "MessageIndex": 20,
      "PostDate": "28/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "May 15, 2017 08:00PM CowgirlsandAngels wrote: I finally had my ultrasound Today, I didn't see the radiologist, only the technician. She told me that I had at least a dozen cysts, one of them was really large but she didn't tell me the dimensions. My family doctor will have the full report in a week. And that I will most likely need follow ups every 6 months. I'm exhaling, this feels like good news.",
      "MessageIndex": 22,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Apr 24, 2017 05:39PM CowgirlsandAngels wrote: Please keep me posted on tomorrow's appointment Mamalove. I'll send good thoughts and strength your way!",
      "MessageIndex": 13,
      "PostDate": "24/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Apr 25, 2017 12:36AM CowgirlsandAngels wrote: Thanks bevin, I am on the cancellation list, but I was told not to expect a call since the diagnostic clinic is due to shut down for maintenance the following week and they are trying to squeeze everyone in. I looked at private clinics to see if I could get in earlier. But the closest is a 2.5 hour flight away. I'm in Canada, and although we don't pay for our Healthcare out of pocket, the wait times are ridiculous. This afternoon I checked the website that gives estimated wait times for breast screening, and it said the wait time in our province for a biopsy is 26 days. So even after the ultrasound, if I'll need a biopsy, it's going to take almost another 4 weeks. I don't know if my brain can handle all of those waiting.",
      "MessageIndex": 18,
      "PostDate": "25/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "May 24, 2017 11:17PM CowgirlsandAngels wrote: The receptionist finally called today, the doctor only received the report this morning.  All simple cysts. Birads 2 and follow up in 6 months.  Phewff. Thank you all for your support while I felt like I was losing my mind. I appreciate all of you.",
      "MessageIndex": 24,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Aug 20, 2017 12:35PM - edited Aug 20, 2017 12:35PM by CowgirlsandAngels Same breast, new issue.  I was quite happy to have been diagnosed with simple cysts in May. And I was told to follow up in 6 months unless anything changed.  Well, now my nipple is inverted, I have a feeling of milk let-down in that breast, and a lump that has tripled in size. I am tender all the way up into my armpit and I asked my GP if she could drain this, if it was in fact just a simple cyst. She passed me off to another GP who is concerned by the palpable mass and other symptoms, so after discussing it with the radiologist, they've scheduled me in for another us tomorrow afternoon.  I don't want to feel crazy, I liked the idea of having just simple cysts. But my gut says something else is going on. My breast is full of prominent blue veins, and I tried for 3 months to ignore all the other symptoms just so that I don't lose my mind. How can one boob cause so much stress?",
      "MessageIndex": 27,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Aug 20, 2017 01:36PM CowgirlsandAngels wrote: Thank you beach2beach! My GP is on vacation this week, but the second doctor I saw last week actually works at the hospital where the us is being formed. He said I could go directly to him and he will have the radiologist give us the findings right then. That makes me feel reassured. I'm grateful to have a family doctor when so many around here don't, but she sits behind a laptop and uses Google to diagnose instead of even making eye contact with her patients. Our healthcare system in Atlantic Canada is in a sad state. All the patients need to advocate for themselves. It's pretty frightening. Hopefully it will be all good news and I can have the cysts aspirated and be done tomorrow afternoon. Fingers crossed.",
      "MessageIndex": 29,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Aug 22, 2017 05:43AM CowgirlsandAngels wrote: My ultrasound \"showed definite changes\" since May, whatever that means. The tech showed the radiologist on site and those were his words relayed back to me. I assume things are not concerning since the rad didn't come in to talk to me himself. He will also recommend that I see a specialist (Whatever that means)and come back for more follow up in a couple of months.  My doctor will get the report this week, and I was advised to see her and not the second doctor that ordered this ultrasound. Still lots of cysts in there.",
      "MessageIndex": 33,
      "PostDate": "22/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Apr 24, 2017 03:22PM CowgirlsandAngels wrote: I just got a call from the doctor's office that my mammogram results are incomplete and I'm scheduled for an ultrasound in 11 days. The waiting is the worst.",
      "MessageIndex": 8,
      "PostDate": "24/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    },
    {
      "AuthorID": "Cowgirlsand…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250693/profile",
      "Content": "Apr 24, 2017 05:10PM CowgirlsandAngels wrote: Thank you! I feel like the uncertainty is the worst part, don't you? Just give me an action plan. Give me something constructive to do.  I'm staying busy, but not busy enough. ",
      "MessageIndex": 10,
      "PostDate": "24/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854342",
      "Title": "It doesn't help when the Dr says \"I don't want you to worry\". CowgirlsandAngels CowgirlsandAngels"
    }
  ]
}