{
  "AuthorID": "CPB1167",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276987/profile",
  "Posts": [
    {
      "AuthorID": "CPB1167",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276987/profile",
      "Content": "Sep 5, 2018 03:56PM CPB1167 wrote: Hello, I'm jumping the gun a bit, Today I finally got my oncotype result, it is 27. My MO said that is not the number she hoped for, and that chemo is the appropriate treatment. I have an appt with her tomorrow to discuss, I really like her and feel that I am in good hands in regards to whatever she feels is the best course of treatment. I feel kind of numb I guess, I knew chemo was a possibility but now that it has been given, my brain is swirling. I guess I keep thinking, they removed the breast, I had no node involvement and clear margins do I really need chemo? Cant I just take Tamoxifen or something like that? I believe she said I would do 4 rounds of TC. I think she said with only taking Tamoxifen I have an 18% of recurrence. I am 51 yrs old. I'm sure after I talk to my MO tomorrow I will feel more confident that the chemo is the right course, but I just wonder how many people choose not to do chemo against what their doctor's say..? I will let you know after my appt if I will be joining you on this September thread. Thanks for letting me get this out.",
      "MessageIndex": 119,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "CPB1167",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276987/profile",
      "Content": "May 11, 2019 08:49AM CPB1167 wrote: Hello, Last chemo was November 2018. My hair is growing back (which I am so grateful for!) but i am struggling with the gray color it is. I feel so vain talking about this part of my cancer journey - I am healthy should be my main focus....I have always gotten blonde highlights and whenever I look in the mirror now I don’t know this person staring back at me. I’m 51, and trying to embrace my gray....not working so well. The texture is so different, someone described their hair as “the pelt of a dead rodent”, thats pretty much how I feel. My oncologist said to wait 6 mos before coloring and to use vegetable dye. I cannot find anything like this. I have seenthe Naturetint brand and am curious if anyone used this brand and is it really vegetable based? Thanks.",
      "MessageIndex": 26620,
      "PostDate": "11/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "CPB1167",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276987/profile",
      "Content": "CPB1167 wrote: Hello, 12 days ago I found a lump, found out 2 days ago I have been diagnosed with invasive ductal carcinoma. I dont think any of this seems real at this point, maybe I am still in shock as I have had clear mammograms every year including last September having the u/s mammo. I have a consult with a breast surgeon on Monday, I'm just curious what questions I may be asked, what info I need to bring, in general what happens at the appointment. Thank you so much for any info, and thanks for being here. Dx 7/11/2018, IDC, Left, 0/4 nodes, ER+/PR+, HER2- Surgery 8/15/2018 Lymph node removal: Left, Sentinel, Underarm/Axillary; Mastectomy: Left Chemotherapy 9/27/2018 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Hormonal Therapy 12/30/2018 Femara (letrozole), Zoladex (goserelin) Dx Grade 2, 0/4 nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865872",
      "Title": "What happens at first consult with breast surgeon? CPB1167 myusername"
    },
    {
      "AuthorID": "CPB1167",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/276987/profile",
      "Content": "Jul 19, 2018 04:59PM CPB1167 wrote: Thank you all very much for your information and support. There are 2 masses so the surgeon recommends mastectomy which I am in full agreement of. I feel very confident with my doctor, I know I will be in good hands with him. I had genetics testing yesterday and an MRI today to verify no cancer in right breast so anxiously awaiting those results. Next week I have a consult with reconstructive surgeon - I am trying to familiarize myself with reconstructive options at this point. I'm just going day by day, appt to appt....deep breaths.....",
      "MessageIndex": 11,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865872",
      "Title": "What happens at first consult with breast surgeon? CPB1167 myusername"
    }
  ]
}