{
  "AuthorID": "cplus3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136632/profile",
  "Posts": [
    {
      "AuthorID": "cplus3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136632/profile",
      "Content": "Sep 25, 2011 10:47PM cplus3 wrote: Thank you all so much for your thoughts. I have just come back from my follow up ultrasound. The lumps from before seem to be resolving, but there is another 'lesion' they said hasn't changed and they did a FNA on that. They mentioned the node in my armpit is larger than last time but doesn't look sinister??? now i will have to sit tight and wait for the doc. Carpediem, i read through WeeSee's thread and it does sound similar. I will askthe doc about it...you ladies really are amazing for helping me out. ",
      "MessageIndex": 6,
      "PostDate": "25/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/775401",
      "Title": "IBC Fears cplus3 SarahsMom"
    },
    {
      "AuthorID": "cplus3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136632/profile",
      "Content": "cplus3 wrote: Hi I have spent the last six weeks very stressed about IBC and am desperately seeking answers, reassurance and advice. My right nipple was sore for the first couple of weeks after my baby boy was born. My baby boy was four weeks old when I first noticed a small hard red lump near my areola on the right breast. That was a Sunday. By Thursday that week, it had become much larger, hard and there was another lump higher up near my armpit. A health nurse noticed red skin on the other side of the breast (not where the lumps were). She suggested going to the doctor for antibiotics, which I did on the Saturday. Feeding was painful by then. By the end of a week on antibiotics, I noticed a milk plug on the nipple. Assuming that might be the reason nothing had improved, I went to the GP, who lanced it and made sure milk was getting through. I expressed and still couldn't get rid of the lumps. By that stage (two weeks after the first lump appearance), I had noticed peau d'orange on the breast and a lot more pigmentation than on the other breast. The lumps weren't getting any better either. I went to my OBGYN in a panic when my baby was six weeks old. He didn't seem very concerned and said the peau d'orange could be from fibrocystic changes etc and sent me for an ultrasound the next day. They found the higher lump was a galactocele, which they drained and found heavy staph aureus growth. The other lump was looked at on US and mammo and they did two core biopsies and said it was benign. The radiologist also didn't share my concern about the peau d;orange and also said in that setting it is most likely related to breastfeeding. She also pointed out a similar, but less pronounced pattern on the other side. I was prescribed a second course of antibiotics. A couple of days later, I went to my local doctor again and asked for a skin biopsy. He did it but sort of on the edge of where the peau d'orange is. It came back as \"benign inflammation\" The next week, I went to a surgeon, who said he thought the peau d'orange was most likely because of the infection but couldn't rule out IBC. He did his examination and said to let everything settle for a while and let the antibiotics do their thing. When things still hadn't improved, I went to the emergency room in a panic and was referred to another breast surgeon. He also didn't see any great cause for concern and wanted to see me again in two weeks (which I did yesterday) and he thinks what he sees is normal for someone breastfeeding with a history of infection. The original surgeon meanwhile has given me a third course of antibiotics, which I have completed and has scheduled further follow up ultrasound on Monday. The lower lump seems to have softened and there is a bit of hardening where the galactocele was, but the peau d'orange has not changed in five weeks despite three courses of antibiotics and that is what terrifies me. The surgeon who is following up still seems to think the odds are in my favour. THe other one thinks I am a neurotic mess (which I am) with nothing much to worry about. I would really appreciate any advice on my situation and especially on what might (hopefully) definitely rule out IBC at this stage. I am 30 years old and have two small children and am so terrified. Every test has said I am ok, but somehow I just can't shake my fear. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/775401",
      "Title": "IBC Fears cplus3 SarahsMom"
    },
    {
      "AuthorID": "cplus3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136632/profile",
      "Content": "Sep 24, 2011 01:07AM cplus3 wrote: Thank you both so much for taking the time to respond. It means a lot to me. I will try hard not to keep obsessing about it.",
      "MessageIndex": 3,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/775401",
      "Title": "IBC Fears cplus3 SarahsMom"
    }
  ]
}