{
  "AuthorID": "Cpratt2010",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119993/profile",
  "Posts": [
    {
      "AuthorID": "Cpratt2010",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119993/profile",
      "Content": "Jan 27, 2011 04:51PM Cpratt2010 wrote: Thank you everyone for all your caring words and support! I spoke with my mom today and she agreed that if her current onc wasn't open to any other treatments after radiation then she would be willing to look for a second opinion from hopefully a specialist. This gives me great relief considering I never thought she would because she is so dedicated to her onc. She said opinions are good. Its like going to a mechanic to get your car fixed and it needs work on the engine and transmission and the mechanic said he only worked on transmissions.",
      "MessageIndex": 7,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763995",
      "Title": "My mom's brain mets Cpratt2010 hezzy"
    },
    {
      "AuthorID": "Cpratt2010",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119993/profile",
      "Content": "Cpratt2010 wrote: Hello all, this is my first post. I am 29 years old and my mom is 52. I am here for my mother. She was originally diagnosed in 10/07, had a right mastectomy in 11/07 to remove large tumor, 17 lymph nodes and a thin layer of muscle on chest wall because the tumor had attached. No follow up chemo or rads (her choice). 6-17-08 she went into the E.R. because she hadn't had a BM in five days...they found that her calcium was at 16 and she was near death...they also found that the cancer was now in more than half of her liver and a small amount in the lining of her lungs. She was diagnosed Stage IV Invasive Ductal Carcinoma ER-/PR-/Her2+ with extensive mets to liver and minimal mets to lung lining. She started treatment 7-3-08 which consisted of Taxol, Carboplatin and Herceptin. 9-19-08 Scans showed mets to lungs gone, small lesions in liver gone (over 50). 10cm lesion in liver shrunk 50%, 9cm liver in liver shrunk 30%. Discontinue Taxol & Carboplatin. She has continued herceptin with no further progression.  The beginning of this year she started seeing bursts of light and had some pulsation and burning in the left side of her face. Dr ordered brain scan 1-10-11 and found over 20 lesions scattered throughout most of her brain, most of them are small but two or three of them are larger, the largest being almost an inch and located in the cerebellum area. The dr said that according to the scans it grew quickly because the largest tumor had already outgrown its blood supply. They started whole brain radiation 1-18-11 and she will have 14 treatments ending 2-4-11.  She has two doctors, her oncologist and then her radiologist. Her rad dr stated that if the radiation treats most of the lesions and only leaves a few small ones gamma knife could be an option except for he was unsure about the largest one due to the location. He also said that if the tumors had very little shrinkage we could assume it didn't work and there would be no point of doing anymore whole brain radiation. When I asked her onc about another option such as Tykerb to help treat the brain mets he responded by stating that there is no proof that it breaks the brain barrier and he had no intention of taking her off of Herceptin as long as the rest of her body was clear of any progression. It was explained that her onc is now in charge of her neck down and her rad dr is now in charge from her neck up. (not in a rude or crass way by any means) So from all this I am assuming there is NOT a plan b... Am I wrong to assume this? What's next? I want to be realistic and not sugarcoat anything in my mind. I will always hope for the best but I want to be prepared. I am her main support system, caretaker, PR Rep, and loving daughter...I would do anything for her.  Any advise would be greatly appreciated. Candice Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763995",
      "Title": "My mom's brain mets Cpratt2010 hezzy"
    },
    {
      "AuthorID": "Cpratt2010",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119993/profile",
      "Content": "Cpratt2010 wrote: Hello all! I am here to report some wonderful news! My mom got her brain scan results today and they found that there are only two small tumors remaining. In january she had more than 20!!! We are all elated! The whole brain radiation seemed to have done it's job. Thanks to everyone for their positive thoughts and prayers! Candice from IL  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766457",
      "Title": "Good results!! Cpratt2010 mollyart"
    }
  ]
}