{
  "AuthorID": "Craftylass",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149727/profile",
  "Posts": [
    {
      "AuthorID": "Craftylass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149727/profile",
      "Content": "Aug 30, 2012 04:28AM Craftylass wrote: Amy, that's great news on your BRCA!  I'm still fighting with the insurance company to get them to approve the test.  (They say that since my mom was diagnosed at age 51 and I was diagnosed at age 48 that I don't meet the criteria!  Doesn't matter to them that my died at age 52 . . . and it was most likely she had the cancer before age 50.) At any rate, a site you may enjoy regarding vitamins and supplements, is the Sloan Kettering site.  It has amazing and easy-to-understand information on herbs, botanicals, etc.  www.mskcc.org/cancer-care/inte...   I find it to be very helpful.  I know I'm planning to add turmeric to my supplements regime, but was advised to wait until I was well past chemotherapy.  From the Sloan Kettering site:  \"Curcumin is known to interfere with cytochrome P450 enzymes (26) (27) and may interact with chemotherapy drugs like cyclophosphamide and doxorubicin (28).\"  (References found on site.)  I'm hoping the turmeric will help my digestive system recover from the assault it's been under and will start taking it about two weeks post-surgery.  Glad to hear your port went well.  I didn't get one.  Just had needle pricks each chemo cycle.  Craftylass",
      "MessageIndex": 30,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792550",
      "Title": "34 and just got diagnosed Aug 22, 2012 and have many concerns... Amy4978 annabug12"
    },
    {
      "AuthorID": "Craftylass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149727/profile",
      "Content": "Aug 27, 2012 11:06AM Craftylass wrote: Hi Amy!  I'm so sorry you were diagnosed with cancer.  I hope you find this forum to be of help for you. I was diagnosed with Stage IIIb breast cancer in late January/early February.  Hormone positive, Her2 negative.  I had neoadjuvant chemotherapy and my tumor shrunk almost 96% with the eight rounds (4 AC/4 Taxotere.  Didn't combine the three because we were still waiting for the results of the Fish test for the Her2 stuff.)  I will have a lumpectomy on September 5.  My breast surgeon is very optimistic about getting everything.  She will do a sentinal node biopsy at the same time.  I never even imagined that a lumpectomy would be possible.  I figured that if the goal of the chemo was to shrink the tumor to a removable size, then I should benefit from that shrinkage and go with the lumpectomy.  The surgeon didn't even ask me if I wanted a mastectomy and I really don't want one.  My hair has tried to grow all throughout chemo.  I cut it short (from mid-back length) at the beginning and then buzzed it after it started falling out after the first chemo.  I then buzzed it again after chemo #7.  It was about an inch long, but thin and scraggly.  Patchy in some areas.  Now, 3.5 weeks post my last chemo, it's an even 1/2 inch all around.  Still much thinner than it used to be.   I never wore a wig or scarves.  I wore a hat for warmth in the winter and walked around bald most of the time.  I didn't mind the loss of my hair as it is so temporary in the big picture.  I do want my eyelashes and eyebrows back, though!  I get frequent eye irritations and having some lashes would definitely help! These two sites really helped me in knowing what type of questions to ask:   http://www.cancer.net/patient/Cancer+Types/Breast+Cancer?sectionTitle=Questions%20to%20Ask%20the%20Doctor today.msnbc.msn.com/id/3957772...  Another very helpful site was one on understanding your pathology report (very helpful for explaining things to family members):  www.nosurrenderbreastcancersur...  Best wishes to you in your journey!  Craftylass",
      "MessageIndex": 23,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792550",
      "Title": "34 and just got diagnosed Aug 22, 2012 and have many concerns... Amy4978 annabug12"
    },
    {
      "AuthorID": "Craftylass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149727/profile",
      "Content": "Aug 29, 2012 10:19AM Craftylass wrote: Amy, Be sure to check with your doctor about what you can and cannot eat during chemotherapy.  I was advised to not eat raw foods due to the chances of ingesting micro-bacteria that a compromised immune system can't fight off like a fully functional immune system can.  While it seems a good idea to be juicing and making smoothies, it may NOT be compatible with your particular chemo plan.  Even when your counts are normal, raw foods can be difficult for a challenged digestive system to handle.  I'm now almost four weeks past my last chemo and my poor intestines are still in recovery mode!  However, I am now all clear to eat salads again! Same goes for any vitamins and supplements you want to take.  I cleared all of mine (I take 8) with my doctor, but he did have me wait on pill form vitamin C.  It can conflict with the AC chemo regime.   By the way, I was diagnosed at 48 (I'm now 49) and I have an 11-year-old and a 12-year-old.  They've been great all throughout our journey.  Take care,  Craftylass",
      "MessageIndex": 26,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/792550",
      "Title": "34 and just got diagnosed Aug 22, 2012 and have many concerns... Amy4978 annabug12"
    },
    {
      "AuthorID": "Craftylass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149727/profile",
      "Content": "Feb 2, 2013 03:07PM Craftylass wrote: I'm kind of a lurker.  I've read info from the boards, but haven't contributed much. Diagnosed 02/04/12 with Stage IIIb breast cancer.  ER+/PR+ Her2-  Underwent chemotherapy, successful lumpectomy that revealed zero cancer left in the remainder of the tumor. My last chemo was August 2.  Sugery was September 5.  Radiation October 18 - November 29.  I fell on October 26 and two weeks later, started having significant back pain.  EVERYONE thought it was a herniated disk. Follow-up with onocologist on December 20.  Started Tamoxifen.  Got MRI. Shock and awe, cancer was everywhere in my spine (every vertebrae but two), complete with a pathologic fracture in my C4.  C5-7 too weak to support surgery.  PET revealed cancer in my pelvis and one rib as well.  The oncologist believes that I've been Stage IV from the get-go, but that the lesions were just too small to be seen on my PET of 11 months ago. Receiving monthly injections of zoladex and denobusab (xgeva? . . . why do these things have two names?).  Continuing Tamoxifen.  Currently undergoing radiation from C2 - T2.  Followup with neurosurgeon and oncologist on Feb 25.  Will get more scans in April.  All my tumor markers are relatively \"normal.\"  CEA only a 6.2, CA27-29 is a 23 and CA15-3 os 14.  Married 15 years to a wonderful man, mother to a 2000 daughter and 2001 son.  I'm a \"jack-of-all-trades,\" master of none.  My training is in business, but for the past six years, I have been an English teacher in China.  My cancer diagnosis brought us back to the US. I am a Christian who fully believes that God's story for my life is a good story, regardless of the physical outcome.",
      "MessageIndex": 109,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798841",
      "Title": "Roll Call 2013 LilSchatzie reader123"
    },
    {
      "AuthorID": "Craftylass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149727/profile",
      "Content": "Apr 18, 2013 05:42PM Craftylass wrote: I don't know my number . . . got the pm . . . okay to add me in.  February 4, 2012 had final diagnosis of Stage IIIb.  Neoadjuvant chemo, followed by lumpectomy (clean path report), followed by radiation.  January 3, 2013 moved to Stage IV with mets in every vertebrae but two, including a fracture at my C4; mets on both sides of my pelvis and mets in one rib (on the opposite side of my initial cancer).  Been taking Tamoxifen and have had monthly injections of Zoladex and Xgeva.  Zoladex wasn't able to control the estrogen, so I had my ovaries removed two weeks ago.  (I just turned 50 in February.) Tomorrow, I have my MRI and PET/CT to check current status.  I waffle between thinking there has been regression to there is significant progression!  I'm expecting anything from \"the cancer is gone!\" to \"you now have mets in your lungs and liver!\"  I don't have a lot of middle ground expectations. ",
      "MessageIndex": 292,
      "PostDate": "18/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Craftylass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149727/profile",
      "Content": "Apr 25, 2013 11:47AM Craftylass wrote: Been there, done that!  I wore panty liners or even pads after that! ",
      "MessageIndex": 6,
      "PostDate": "25/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803823",
      "Title": "Embarrassing story…..Can only share the laugh… frankandfernsmom frankandfernsmom"
    },
    {
      "AuthorID": "Craftylass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149727/profile",
      "Content": "May 19, 2012 11:20PM Craftylass wrote: Pamela, I don't wear a wig!  I live in northwest China, in a fairly conservative area so when I go out, I wear a denim brim hat (I think it's the bucket hat by headcovers.com).  However, in my house, I don't wear anything.  My home is at a mile-high altitude and it's very dry, so the hat is very bearable. I commute to Hong Kong for my chemo treatments.  Hong Kong is stinking hot!  I go bald there!  I am the only woman in the clinic who doesn't wear a wig, but dang, I sweat like a horse as it is.  All these beautiful Asian women don't sweat like I do!  (I am Caucasian.)  The receptionist literally hands me a box of kleenex as I walk in so that I can wipe the sweat off and it's only a five minute walk from the subway station to the office!  (When I asked her if anyone else ever came bald, she replied, \"Uh, no . . . you're the only one.  Why don't you wear a wig?\"  I laughed as I asked her (while wiping sweat from my arms and head), \"How much sweat do you think I would have if I wore a wig?\"  She cracked up . . . \"I think you would look like a shower!\"   At any rate, I am very comfortable with my peach fuzz (my hair is trying to grow back between each treatment) and I don't mind the bald look.  Kit, I get an ultrasound before each chemo.  The doctor placed a tumor site marker when he did the core needle biopsy . . . it's getting hard to find it!  He also does a clinical measurement with calipers.  Clinical measurements are notoriously fallible (dense tissue can mess them up), but between the ultrasound and the clinical measurement, a somewhat accurate conclusion can be made.  I can tell the tumor is shrinking . . . it's very noticable to me.  I had a hard core with fissuring . . . kind of like flower petals . . . but I could always feel the outside edge.  It was from about 4:00 - 9:00 position and now, it feels like the size of a superball.  BIG difference!  (To be honest, I never dreamed I could be a candidate for a lumpectomy rather than a mastectomy.  It never even entered my mind that chemo would be this successful.  I could still end up with a mastectomy due to node involvement (I'll have a PET scan post chemo and most likely a sentinal node biopsy), but just the thought of a lumpectomy is very encouraging to me!",
      "MessageIndex": 8,
      "PostDate": "19/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/787729",
      "Title": "Question about chemo before surgery pamelahope kltb04"
    },
    {
      "AuthorID": "Craftylass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149727/profile",
      "Content": "May 19, 2012 09:52PM Craftylass wrote: Hi Pamela, I am undergoing neoadjuvant (before surgery) chemotherapy.  I have completed four rounds of AC and will have four rounds of taxotere.  After three cycles of AC, my tumor shrunk 60%!  The doctor said that if I were to have surgery now, that he would be able to do a lumpetomy.  I'll get my fourth chemo tumor measurement then (measurements are taken just before your next chemo). I will have my first cycle of taxotere on May 29.   The doctor expects a significant decrease in tumor size after the first treatment and then a gradual decrease in size after that.  I did have a tumor in my nodes as well and it can't be felt at all right now.   I've had two delays in chemo due to skin infections.  Overall, my eight cycles should take 24 weeks, but with the delays, it will be closer to six months.  Then, there will be a small recovery time (three weeks?) before surgery.  Then, there will be another small recovery time (another three weeks?) followed by radiation for approximately six weeks.   All told, it was estimated that my treatment would be about nine months.  I'm pretty much on track for that.  Give yourself time to learn about your cancer.  You've got a lot going on right now . . . it will calm down.   Best wishes to you!",
      "MessageIndex": 4,
      "PostDate": "19/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/787729",
      "Title": "Question about chemo before surgery pamelahope kltb04"
    },
    {
      "AuthorID": "Craftylass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149727/profile",
      "Content": "Nov 16, 2014 08:32PM Craftylass wrote: It's been a while since she posted, but lostinmo passed away today. She was diagnosed with triple negative breast cancer in March 2012 and with multiple mets on December 31, 2013. She will be missed. She mentioned several times how much she enjoyed playing the song game on BCO.",
      "MessageIndex": 903,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    }
  ]
}