{
  "AuthorID": "crazy4carrots",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70294/profile",
  "Posts": [
    {
      "AuthorID": "crazy4carrots",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70294/profile",
      "Content": "crazy4carrots wrote: All of us here have been/are in the position of waiting for test results.  My eldest sister claims she doesn't worry, until she's sure there is something to worry about.  She's had her share -- thyroid cancer (benign) and ovarian cancer (malignant).  She says that once she knows the results, then she can start doing what needs to be done, rather than waste her energy worrying. Wish I could be that sanguine!  I'm a worrier from way back.  The thing is, when I tell myself not to worry while waiting for results, I feel as though I'm tempting fate, as in \"Ha, you didn't worry, but the results are bad, so there\".  Sounds stupid, I know! Anyone else feel that way?  What are your coping mechanisms?  I should disclose that I'm not a believer in an omnipotent being, so prayer won't work for me. The demagogue preaches doctrine he knows to be untrue to men he knows to be idiots. Dx 1/10/2008, ILC, 1cm, Stage I, Grade 3, 0/4 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/727278",
      "Title": "Tempting Fate? crazy4carrots Mykidsmom"
    },
    {
      "AuthorID": "crazy4carrots",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70294/profile",
      "Content": "crazy4carrots wrote: Wasn't sure where to post this question, but here it is!  I have a hiatal hernia dx'd several years ago.  Over the last several months, acid reflux has been especially bad and Zantac just isn't cutting it anymore.  Since esophageal cancer is a major concern, my doc first ordered a fecal occult blood test (negative) and then prescribed Nexium. I've been reading about it and have heard some negative stories so I haven't filled the Rx yet.  Please let me know if/how it's working for you, if you're taking it. Thanks,    Linda The demagogue preaches doctrine he knows to be untrue to men he knows to be idiots. Dx 1/10/2008, ILC, 1cm, Stage I, Grade 3, 0/4 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761588",
      "Title": "Anyone taking Nexium for Acid Reflux? crazy4carrots lago"
    },
    {
      "AuthorID": "crazy4carrots",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70294/profile",
      "Content": "crazy4carrots wrote: I've noticed that many patients on this forum continue seeing their surgeon annually after tx has ended and am wondering why?  My mast was a year ago Feb and, other than a routine follow-up a couple of weeks later, I've been seeing my oncologist ever since.  She examines the surgery site, orders diagnostic procedures, blood tests and drugs.  Are there any reasons why the oncologist (who specializes in bc) would be less effective in determining probable recurrence than the breast surgeon?  Would love to hear others' opinions on this. The demagogue preaches doctrine he knows to be untrue to men he knows to be idiots. Dx 1/10/2008, ILC, 1cm, Stage I, Grade 3, 0/4 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735009",
      "Title": "Why continue seeing surgeon after tx has ended crazy4carrots JROGBURN"
    }
  ]
}