{
  "AuthorID": "crazystupid…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208136/profile",
  "Posts": [
    {
      "AuthorID": "crazystupid…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208136/profile",
      "Content": "Apr 1, 2015 12:49PM crazystupidbreastcancer wrote: I did. I had two primary tumors in the same breast. One of them was invasive ductal carcinoma. The other was DCIS. The DCIS tumor showed up on the mammogram but not the MRI. This was in May 2013. The breast surgeon and radiologist thought that the DCIS must have been benign, since MRIs are supposed to have higher specificity than mammograms and ultrasounds. They also didn't trust the results of the mammogram because I have very dense breasts (I was 23 at the time). Anyway, I did 8 rounds of chemo, and did a post-chemo breast MRI in October 2013. The breast surgeon and radiologist could not see the IDC tumor. Since I was planning to have a lumpectomy, my surgeon wanted to do a mammogram to see if I could do a wire-guided lumpectomy. The mammogram did not find any signs of the invasive ductal carcinoma, but it did find linear calcifications which are indicative of DCIS. One week later, I had a stereotatctic biopsy. And the results came back as DCIS. We asked my breast surgeon how did the mammogram catch the DCIS, and not the breast MRIs? She said grade 2 DCIS tumors can be hard to detect with breast MRIs. Also, she said the DCIS could have not been large enough to be detected by the MRI.",
      "MessageIndex": 12,
      "PostDate": "01/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/830063",
      "Title": "Has anyone had an MRI miss their cancer? oceangirl654 lulu2533"
    },
    {
      "AuthorID": "crazystupid…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208136/profile",
      "Content": "Mar 6, 2015 11:23AM - edited Mar 6, 2015 11:27AM by crazystupidbreastcancer",
      "MessageIndex": 390,
      "PostDate": "06/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "crazystupid…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208136/profile",
      "Content": "Dec 1, 2014 03:54PM crazystupidbreastcancer wrote: Diagnosed 15 days after my 23rd birthday.",
      "MessageIndex": 353,
      "PostDate": "01/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    }
  ]
}