{
  "AuthorID": "Crazeejane",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279922/profile",
  "Posts": [
    {
      "AuthorID": "Crazeejane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279922/profile",
      "Content": "Apr 2, 2019 01:42AM - edited Apr 2, 2019 01:43AM by Crazeejane Today I made the decision to take my life back and stop treatment. Call me crazy but it's what I have decided to do. I know what it means and I have thought about it fully and I am just going to go on with my life like I was before until I can't anymore. Even if it's a shorter period of time than what I had originally hoped for since I was young, I'm going to love each day as best as I can. Also My husband and I are the only ones that know about my decision. We have decided to keep it to ourselves because I don't want to hear all of the opinions of everyone around me about what's i have decided. It's just gotten to be too much",
      "MessageIndex": 39,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867178",
      "Title": "Vent about long term treatment Larkin Crazeejane"
    },
    {
      "AuthorID": "Crazeejane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279922/profile",
      "Content": "Nov 21, 2018 12:06PM Crazeejane wrote: I think one of the many things all of us have in common with this is that people who don’t know us would never be able to tell most days that every day we wake up and fight. You are so right when you say on the outside we can look perfectly fine but on the inside it’s completely different. So many days I just want to say “screw it” and rebel and skip all the pills and just live.....but I know that I can’t and I think that is what really bothers me....the fact that my whole life was turned upside down in an instant and now I’m stuck with the treatments and bloodwork and appointments. Yes I put on a smile and do my best not to think about it, however it’s always there lingering in the background. To those that have been doing this for years I commend you greatly because I am just at the beginning of this journey and I hate it all ready. The unknown just sucks!!! Next month I am scheduled to have my first set of scans since starting treatment and I am seriously stressing. But I keep it to myself because I don’t want my family to know. I don’t want them to know how hard it is for me to be strong all of the time. I don’t want them to know that at times I wanna crawl into a hole and just stay there.",
      "MessageIndex": 37,
      "PostDate": "21/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867178",
      "Title": "Vent about long term treatment Larkin Crazeejane"
    },
    {
      "AuthorID": "Crazeejane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279922/profile",
      "Content": "Sep 21, 2018 07:46AM Crazeejane wrote: I have been really down in the dumps the last few days because of the fact that everything is so unknown. I've been on my regimen of meds for a little over a week now and it's just depressing to me. 2 months ago I wasn't on anything except for maybe some Tylenol every now and then. Now I take 5 pills every day and 6 on Mondays. I always knew I would probably end up with the big \"C\" since it runs rampant in my family like wild fire but I had hoped it wouldn't be till way later in my life. I never tell anyone how I truly feel about all of this because I honestly feel like they just wouldn't understand and would just think I'm being a whiner. And I also don't say anything because I am trying so hard to stay strong for my kiddos and my husband. I just don't want them to worry ya know? What I wouldn't give to just have my old pre cancer life back. Am I wrong for how I feel? Being told from the get go that you have incurable cancer just really sucks....and treatments forever....it just really takes the wind out of a persons sails. I smile when I am out and about but when I am alone, sometimes I just want to cry and get angry.",
      "MessageIndex": 23,
      "PostDate": "21/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867178",
      "Title": "Vent about long term treatment Larkin Crazeejane"
    },
    {
      "AuthorID": "Crazeejane",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279922/profile",
      "Content": "Sep 24, 2018 04:40AM Crazeejane wrote: Candy-678 Thank you for your kind words. It is so nice to have this place to be able to release my feelings and talk with others who are going through the motions as well. It truly does help me not feel so alone in all of this. I hope you had a nice weekend. Mine went by way to fast as they usually do. It's back to work tomorrow night for this lady!!!",
      "MessageIndex": 25,
      "PostDate": "24/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867178",
      "Title": "Vent about long term treatment Larkin Crazeejane"
    }
  ]
}