{
  "AuthorID": "Crich2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263589/profile",
  "Posts": [{
    "AuthorID": "Crich2",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263589/profile",
    "Content": "Jan 21, 2018 09:44AM - edited Jan 21, 2018 10:21AM by Crich2 I have had Tinnitis mostly on the right since the 90's. I have had a great deal of chemo in the past for 2 Hodgkin's lymphomas, AML Leukemia, and a Bone Marrow Transplant. So much chemo I can't get what what I need now because \"I maxed out\". Have already had more than the max dose for Rads. Had Taxol, massive total body hives, switch to Abraxane, altered level of conscienceness, whoo, I couldn't even talk! And pneumonia. Stuck in the hospital for 10 days. Followed by Pneumonitis and home O2 for 10 weeks. Told by Pulmonary to \"never have that chemo again!\" Too bad, it seemed to help. Just requested a biopsy after the 1st mo of Ibrance & Faslodex . The NP told me last week when I requested a biopsy for the lumps on my side that if the biopsy was positive I was already on the chemos. I said it is one thing to be getting the chemos given to women with mets, and having mets. Just saying. But after having my 6 injections of Faslodex, both ears have this steady rush and high pitched squeal that is unreal! And loud! Much worse. I came on this site, surfing for this. Wasn't thinking about the Faslodex at all. I've been on Estrogen blockers for a year with no extra Tinnitis. But it is BAD! Thanks to all posting, first tip I've had that helped narrow it down. I use ear buds and Pandora and sleep meds. The meds are to help me sleep through the pain from severe neuropathy from all the chemos in the past . Which I can no longer get pain meds for since I moved from CA to VA. Don't think I would have moved if I had known that. Opiate crisis. Yeah. Great. Crich2 RN 10/15 Lump, Left 7/16 - IDC, 4.4 cm, 2,3 cm, 3 nodes positive Stage IIIb IBC (Inflammatory Breast Cancer) 9/16 Taxol, Hives 9/16 Abraxane, ALOC, Pneumonitis. 1/16 Anastrozole, 3/17 Disease progression. 3/17 5-FU. 9/17 Xeloda, 11/17 Disease progression. 12/17 Skin lumps found 12/17 Ibrance and Faslodex 1/18 Skin biopsy, positive for mets. Stage IV.   ",
    "MessageIndex": 8,
    "PostDate": "21/01/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/787704",
    "Title": "Neulasta and Tinnitus (Ringing/buzzing in the ears) ??? CatFromFL Crich2"
  }]
}