{
  "AuthorID": "cristinel",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244768/profile",
  "Posts": [{
    "AuthorID": "cristinel",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/244768/profile",
    "Content": "cristinel wrote: Hello to everybody and all the best for the members of this community in 2017! Happy New Year! I am new on this forum and I hope that your past and current experiences might help me during my treatment. Of course, if possible, I hope I can help others too... Right now, I dealing with an issue that is affecting a bit my morale during chemo treatment... Short info about my diagnosis: triple-negative breast cancer, one lump ~4cm, stage IIB - diagnosed in August 2016. I started neo-adjuvant chemo in September, standard 4 AC + 4 Taxol, every 3 weeks. Had already completed the ACs, and I responded well to the \"red-devils\" - my tumor size shrink to 40% of its size before chemo. After that I also completed 2 sessions of Taxol, but I am worried since the size of the tumor is roughly the same as in the moment I finished the ACs. To be honest, even tough I haven't run through official measurements, it looks that the length of the tumor is a few millimeters bigger. I have to admit that, on the other hand, the lump feels thinner. I started to worried a bit... I experienced a positive development with the AC treatment, and right now I fear that Taxol might not work. I will meet my oncologist one week from now, but I was hoping that you can also help me with some advice or share from your experiences: - how was your reaction to Taxol? - how did the tumor behaved? (it became thinner? it melted? its length shrink?) - what can I do if Taxol is not working? P.S. Sorry for my English. I'm not a native speaker... Dx 8/19/2016, IDC, Left, 3cm, Stage IIB, Grade 3, ER-/PR-, HER2- Chemotherapy 8/31/2016 AC + T (Taxol) Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "02/01/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/851569",
    "Title": "Worried that Taxol might not work... cristinel jlwins"
  }]
}