{
  "AuthorID": "crissie69",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136530/profile",
  "Posts": [
    {
      "AuthorID": "crissie69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136530/profile",
      "Content": "Jan 11, 2012 02:46AM crissie69 wrote: Thank KarmaKittie for reponding. I sure hope that's the case!",
      "MessageIndex": 2,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780826",
      "Title": "om the liver metsRising Tumor Markers, stable scan crissie69 crissie69"
    },
    {
      "AuthorID": "crissie69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136530/profile",
      "Content": "crissie69 wrote: Hello ladies, I have a question about weight gain. I have liver mets and take Aromasin and have been on hormonals for about 15 months. I was diagnosed with liver mets in 2010. Since that time I have gained about 4-5 kilos. Most of the weight is concentrated around my waist, stomach and bust. I exercise regularly, have a healthy appetite and try to eat healthily (most of the time). Has anyone else, especially ladies with liver involvement, experienced weight gain and what have you done to shed this weight. Could it be water weight or is this wishful thinking! Thank you in advance for any insights, advice or suggestions. Dx 2/24/2010, 2cm, Stage IIA, Grade 2, 0/14 nodes, mets, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782995",
      "Title": "Weight Gain and Liver Mets crissie69 crissie69"
    },
    {
      "AuthorID": "crissie69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136530/profile",
      "Content": "crissie69 wrote: Hi ladies I hope you can help clarify this situation for me. My tumor markers have been steadily increasing since June of last year but scans do not show new growths, apart for the liver mets I was diagnosed with in early 2010. In fact, the latest CT scan shows that my liver mets have not undergone any change, apart from an observation by one of the radiologists that my liver mets appear to be undergoing necrosis. My question is could this be the reason for the increase in my CEA and CA:15? My oncologist wants me to wait another 4 weeks before repeating my blood test and if the markers are still climbing she wants me to have another CT scan and possibly a bone scan. Apart from the increase in tumor markers I feel really good and have loads of energy. Thank you in advance for any insight anyone else may have in this matter. All the best. Chris. Dx 2/24/2010, 2cm, Stage IIA, Grade 2, 0/14 nodes, mets, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780826",
      "Title": "om the liver metsRising Tumor Markers, stable scan crissie69 crissie69"
    },
    {
      "AuthorID": "crissie69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136530/profile",
      "Content": "Feb 22, 2012 05:26PM crissie69 wrote: Yes I've always suspected that Aromasin was the culprit. I'll definitely try to lose some weight by cutting down on carbs and see if that helps. Thanks again for all your responses.",
      "MessageIndex": 11,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782995",
      "Title": "Weight Gain and Liver Mets crissie69 crissie69"
    },
    {
      "AuthorID": "crissie69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136530/profile",
      "Content": "Feb 22, 2012 02:08AM crissie69 wrote: I'm been taking Aromasin now for about 3 months and prior to that I was taking Femara. When I was diagnosed with liver mets in 2010 I did chemo for 6 months before being put on hormonals. My oncologist said that she doesn't want to change my treatment based on tumor markers alone. That's why I'm having the PET scan next week. I have the feeling that my oncologist thinks that necrotic or dead tissue may be causing the spike. I sure hope that's the case!",
      "MessageIndex": 6,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783023",
      "Title": "Tumors shrink but markers up mkkjd60 alesta29"
    },
    {
      "AuthorID": "crissie69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136530/profile",
      "Content": "Jan 12, 2012 03:12AM crissie69 wrote: Thank you all for your insights and reassurances. China I am currently on Aromasin and have been on it since September of last year. Prior to that I was on Fermara, and that was the time when my markers started creeping up. So my oncologist decided to put me on Aramosin and that's when my tumors markers significantly increased. WingofHope I can relate to what you've feeling and hope we both (and others in a similar situation) discover that the death of tumor cells is causing the rise in TM's. All the best to everyone, Love Crissie.",
      "MessageIndex": 8,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780826",
      "Title": "om the liver metsRising Tumor Markers, stable scan crissie69 crissie69"
    },
    {
      "AuthorID": "crissie69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136530/profile",
      "Content": "Feb 22, 2012 01:21AM crissie69 wrote: I'm in a similar position. My tumor markers have consistently risen for the past 7 months although nothing has been picked up on the scans. I, too, have liver mets. In fact, I'm having a PET scan next week to try and find out why my tumor markers have been increasing. You may ask the same from your oncologist.",
      "MessageIndex": 4,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783023",
      "Title": "Tumors shrink but markers up mkkjd60 alesta29"
    },
    {
      "AuthorID": "crissie69",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136530/profile",
      "Content": "Jan 12, 2012 08:21AM crissie69 wrote: I also keep copies of all scan reports, but reading them depresses me so I'm not sure of the value in this for me.",
      "MessageIndex": 13,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780854",
      "Title": "should i get a copy of pet scans bhd1 chrissyb"
    }
  ]
}