{
  "AuthorID": "Crittcuddle…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243187/profile",
  "Posts": [
    {
      "AuthorID": "Crittcuddle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243187/profile",
      "Content": "Nov 30, 2016 10:24PM Crittcuddler wrote: Hi. Nice to meet you and have a chemo buddy. I was just diagnosed with breast cancer. Here is the link to my first post on the \"waiting for results\" board. https://community.breastcancer.org/forum/62/topics... I don't know yet the ER,PR, HERP-2, or ki67 status. I have a Grade 2 tumor/s and they are intraducular carcinoma, infiltrative. I was told I am maybe a Stage lll (maybe 2). I will start chemo next week and I won't get my mastectomy until I am done with chemo because the tumor is so large and lymph nodes are involved. I will be getting a breast MRI next week to get a better look at the tumor/s to establish grade and also a PET/CT scan next week to see if it has spread. -Michelle  ",
      "MessageIndex": 57,
      "PostDate": "30/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "Crittcuddle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243187/profile",
      "Content": "Dec 1, 2016 10:44PM Crittcuddler wrote: @melinda0628 I will know at the end of next week, I get my PET on the 8th",
      "MessageIndex": 2,
      "PostDate": "01/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/850801",
      "Title": "Waiting to see if Stage IV, doubting I can handle this Crittcuddler barbe1958"
    },
    {
      "AuthorID": "Crittcuddle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243187/profile",
      "Content": "Dec 2, 2016 03:33PM Crittcuddler wrote: barbe1958 I take psych meds. I used to take 6, but have whittled it down to 2. Within the last week I had been trying to get off my antidepressant too, but have decided against it. I have taken meds since I was 18, I am 34 now. Unfortunately even tiny doses of an antidepressants give me insomnia now. I haven't slept good in over a year since I stopped drinking and got off Klonopin. That why'd I have been wanting so bad to get off of it. I have tried every sleeping pill and natural supplement and nothing works",
      "MessageIndex": 8,
      "PostDate": "02/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/850801",
      "Title": "Waiting to see if Stage IV, doubting I can handle this Crittcuddler barbe1958"
    },
    {
      "AuthorID": "Crittcuddle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243187/profile",
      "Content": "Dec 2, 2016 12:47AM Crittcuddler wrote: @claireinaz I wish they would take my boobs off now. I hate keeping the cancer in my body even though the surgeon explained the rationality to me. Yes, this site has already been helidul",
      "MessageIndex": 4,
      "PostDate": "02/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/850760",
      "Title": "Just diagnosed, likely stage 3, chemo and scans first Crittcuddler Crittcuddler"
    }
  ]
}