{
  "AuthorID": "CSMommy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
  "Posts": [
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Jun 28, 2013 07:29PM CSMommy wrote: Thank you, all,  for your responses.  I'm currently trying to get into a clinical trial - I met with the doctor and the research team today, and hope that I qualify.  Fingers crossed! ",
      "MessageIndex": 7,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806856",
      "Title": "Multiple Mets in Multiple Areas CSMommy justjudie"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Jul 26, 2012 07:34PM CSMommy wrote: Congratulations Kathleen! Your story is similar to mine, and it is inspiring and hopeful to hear from you. I hope you are able to find something to commemorate the day, because you deserve it.",
      "MessageIndex": 11,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/791152",
      "Title": "Today is my two year anniversary! kathleen1966 overjoyed4life"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Oct 17, 2012 07:35PM CSMommy wrote: I had my surgery yesterday. I can't believe it's over! I'm sitting in my hospital room now, since my blood pressure is a bit low they want to keep me one more night. I had such trepidation before the surgery. I kept focusing on that one big, giant tumor. Convinced myself it was worse than it really was. Turns out, because of the neoadjuvant chemo killing all the cancer in all the nodes, the only node that had to take out was the sentinel, which was negative. I'm still in shock! The time it had spent attached to my chest wall, however, required her to remove a bit of the muscle. My surgeon just stopped by and took off my wraps so I could see myself. I can't say \"oh, it looks fabulous!\", because they don't. But for what they are supposed to be now, they look just fine, I'll get used to them. I can say definitively that the pain on the first day was bad. Bad, bad, bad. But we're finally figured out the right pain protocol, and I'm doing ok. I asked my surgeon about physical rehab...because I've gotten some muscle atrophy and no energy. She's going to refer me to someone st my follow up appointment. I'm kinda excited about that!",
      "MessageIndex": 176,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "CSMommy wrote: I had a PET scan yesterday, and got the results today.  In April, I was diagnosed with mets to the lungs.  I first received gemzar/cisplatin, but the tumors grew.  We then switched over to taxotere/carboplatin.  Today, I found out that not only have my mets in my lungs grew, but I now have liver mets.  That was devastating for me to hear, but I suppose not a huge surprise.  The findings from the PET scan that did shock me was that I have a new, positive lymph node in my groin, a subcutaneous tumor in my arm, and evidence of mets in my abdomen.  Has anyone heard of mets spreading to the abdomen and random tumors in extremeties?  Thanks. Dx 4/26/2012, IDC, 4cm, Stage IIIB, Grade 3, ER-/PR-, HER2- Chemotherapy 5/3/2012 AC Chemotherapy 7/5/2012 Taxol (paclitaxel) Surgery 10/16/2012 Mastectomy: Left, Right Radiation Therapy 11/26/2012 Breast Dx 4/1/2013, IDC, Stage IV, Grade 3, mets, ER-/PR-, HER2- Chemotherapy 4/3/2013 Carboplatin (Paraplatin), Gemzar (gemcitabine) Chemotherapy 5/31/2013 Carboplatin (Paraplatin), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806856",
      "Title": "Multiple Mets in Multiple Areas CSMommy justjudie"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Oct 14, 2012 06:53PM CSMommy wrote: Hi. This is my first time posting on this thread. I'm scheduled for my BMX this Tuesday (Oct. 16). I was diagnosed 4/10/12, originally staged at Stage 2, Grade 3 Triple-Negative. Two weeks later, after a PET scan showed multiple node involvement, a few more tumors that weren't there a couple weeks earlier, and the main tumor growing to 4cm and attached to the chest wall, they changed me to Stage 3. Just finished up all my chemo on Sept 20. I still have my main tumor left, but I had a PET scan done again just before the end of chemo that showed it killed off all the other places the cancer had originally shown up in. I'm not having any recon at this time. Right now I just need to heal from this and go straight into rads. I've been ignoring the surgery date for so long, and to now have it a mere 2 days away has me a bit panicked. I'm certainly mourning the pending loss of my breasts, but after having felt this tumor every single day, day in and day out, obsessing over it, since I first felt it in February - I'm ready to have it out of my body. Neoadjuvant chemotherapy is great for seeing how your cancer responds to chemo, but to have felt a tumor for the past 8 months, and knowing it was cancer, has done a number on my psyche.",
      "MessageIndex": 134,
      "PostDate": "14/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Oct 19, 2012 05:00PM CSMommy wrote: Hello all. Well, it's all done. I'm home, and so happy to be here! First off...sentinel node biopsy. I was so scared for this. My oncologist gave me some lidocaine to put on the nipple before the dye injection, but I don't really think it helped. Now, it didn't feel good, by any means, but it really wasn't all that bad. I had for injections, at north, south, east, and west sides of my nipple. Felt like bee stings, but once they were done the pain was over. I had never heard, however, about the blue urine afterwards. It's a blue dye, and you have blue pee. I had it for three days. I just had to laugh because throughout this journey I've had the red/orange pee from my A/C chemo days, now blue....what's next? My BMX went really well. My sentinel node biopsy came back clear (woo hoo!) so they only took one node. My tumor was up against my chest wall, so they did have to take a bit of that, so my left side is a lot more sore than my right. I've got two drains, and I was checking my incisions out the next day. It was just my surgeon and I, and she took off all the bandages so I could see them. They are very clean, so I'm happy. Lots of swelling yet, but that's gone down a lot. I ended up staying in the hospital for 3 days. It sounds like I could have been sent home the second day, but my blood pressure kept dropping, so we played it safe and kept me another day. So that's my surgery story. I'm feeling incredibly well. I'm taking Percocet, just one every 4 hours, but I'm going to start weaning myself. I'm also taking the Zofran & Compazine left over from my chemo days because I'm still quite nauseus. I never got sick during chemo; can't say the same for surgery.",
      "MessageIndex": 212,
      "PostDate": "19/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Apr 8, 2013 11:47PM CSMommy wrote: 109",
      "MessageIndex": 127,
      "PostDate": "08/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "CSMommy wrote: Hi - I'm new here, and while I HATE that I have to be here, I'm happy to have found you all. On February 20th, while on a little vacation to San Diego with my family, I found a lump while in the shower. I put it in the back of my kind for our few days there, and called my gynecologist the day we got back. She saw me the next Monday, said not to worry, that it really felt no more than a fibroaedenoma, but she was sending me off for an ultrasound just to make sure. So the next six weeks brought an ultrasound, then a diagnostic mammogram, then finally a biopsy. The whole time being told by everyone that \"we don't know what it is, other than a hard mass, but there's no other calcification, it's got smooth edges...it's likely benign.\". On April 10th my gyno called me, and asked that I come to her office. She told me that day it was Invasive Ductal Carcinoma. On April 12th, I saw a surgeon, who has given me my first true, official diagnosis: IDC, Stage 2, Grade 3. Tomorrow morning, I will have a port catheter placed. Apparently the tumor in my breast is too large for her to consider surgery at this time, and she wants to reduce it with chemo first. Before that, I'll have the PET scan, CT scan, whatever scans they want to do to make sure it's contained in the breast. I hope and pray its contained in the breast. I'm so happy to find this forum, I'm sure I'll be everywhere on here looking for answers. But right now, it feels like I'm floating, and I'm sure that any minute I'll wake up from this nightmare. Dx 4/26/2012, IDC, 4cm, Stage IIIB, Grade 3, ER-/PR-, HER2- Chemotherapy 5/3/2012 AC Chemotherapy 7/5/2012 Taxol (paclitaxel) Surgery 10/16/2012 Mastectomy: Left, Right Radiation Therapy 11/26/2012 Breast Dx 4/1/2013, IDC, Stage IV, Grade 3, mets, ER-/PR-, HER2- Chemotherapy 4/3/2013 Carboplatin (Paraplatin), Gemzar (gemcitabine) Chemotherapy 5/31/2013 Carboplatin (Paraplatin), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785747",
      "Title": "The New Girl CSMommy CSMommy"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Apr 7, 2013 04:48PM CSMommy wrote: I was referred here by my dear friend Karen (Hi Karen!). I'll try to make my long story short. I was diagnosed Stage 3b a year ago. I went through 15 rounds of chemo (A/C, then Taxol). I had a double mastectomy, no reconstruction, in October, 2012. I finished up my radiation treatment in January, 2013. I've had two good months off, just dealing with post-treatment annoyances like lymphedema, but otherwise I've been feeling well and great. On March 19 I had a PET Scan which I had every assumption that would come back clean. On March 21 I found out there were some spots on my lungs. After a biopsy, bone scan, etc., I was officially diagnosed as Stage IV on April 1st. (April Fools! Or not...). I have mets to the lungs in the form of 6 tumors, both sides. I started cisplatin/gemzar on April 3rd. I'm feeling well, although I don't think I was quite prepared for chemo again, as it threw me for a loop. Just absolutely exhausted! I'm looking forward to getting to know everyone here! Thanks for having me. Janelle",
      "MessageIndex": 138,
      "PostDate": "07/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Apr 17, 2013 07:03PM CSMommy wrote: How are you feeling, Karen, after your Xeloda today? Did Zelda behave? That tumor profiling you had done sounds interesting, tortoise. I doubt my insurance company would pay for it, but it would be nice to be able to have it done. Although I'm tickled that the Xeloda worked so well for you. I had labs drawn today. I got a cold this past weekend, but otherwise am feeling fine, so I was shocked that my neutropenic level was 150. So I'm now on antibiotics for the \"cold\" and started neupogen shots today. Next week's chemo I'll start getting the neulasta shot. For those who have had these shots, is there much of a difference between the two? Is one better than the other? I had neulasta during my chemo last year and absolutely, positively hated it. It gave me such bad body aches. I was hoping the neupogen was perhaps easier, but the nurse today told me there was no difference in the side effects; if I had body aches with one, I'd have it with the other. Then again, this was a nurse I never met before and she wasn't exactly friendly, so I'm not even sure I want to take her opinion. In the meantime, I'm back to quarantine. This lady is going to be getting some bad cabin fever! Janelle",
      "MessageIndex": 159,
      "PostDate": "17/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Jul 21, 2013 02:57PM CSMommy wrote: Karen - any news on your tumor testing?  I am on pins and needles - it's been 3 weeks now and I haven't heard a thing.  I'm having some pain in my side & back - I'm assuming it's the liver mets, but I'm trying not to think about it.  I'm just keeping busy so I can keep my mind busy. Tortoise - I had the molecular testing done, too.  I am so glad to hear that Xeloda is working for you, despite the test!  Mine came back saying that no chemos would work, and I have been on 4 since I was diagnosed Stage IV and sure enough I had crazy progression on all of them.  But it gives hope that perhaps there's one out there that will work. ",
      "MessageIndex": 256,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Apr 21, 2013 02:25PM CSMommy wrote: So I did three days of neupogen, and got my levels back up to 1,900. Yay! Still staying inside until my appt tomorrow just to play it safe. The neupogen didn't affect me too poorly - a bit of bone pain, but I've been taking my ibuprofen and it really seems to help. My nurse is working with my insurance company to see if I can just take these at home. I get them in my belly, too. Can hardly feel it that way. But now my platelets are low, so I'm bruising from everything. If it's not one thing, it's something else, eh? I'm just searching for some energy. All I'm doing is sleeping. And I can't believe I'm concerned about this, but I can't seem to keep my weight on. I'm going to talk to my doctor about this next time I see her, but has anyone else experienced this? I mean, I have plenty to spare, but I've lost 7 pounds since I started chemo 3 weeks ago. And it's certainly not from exercising. How are you doing, Karen? Have your hands gotten better? When is your next chemo? Thinking of you all ~ Janelle",
      "MessageIndex": 162,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Apr 9, 2013 02:31AM CSMommy wrote: I hate this damn cancer. I'm so mad and angry, Karen, that it's back. You definitely need to come to Vegas - I have yet to do the zip line, and want to badly. Then you can make me one of those matzo balls I keep hearing about! My girlfriends took me out for pancakes this morning. That may be my go-to chemo food. I'm determined to become a regular at this new pancake restaurant. The red velvet pancakes on their menu looked insane. I think I have my dad convinced to go sky diving with me, too! Crossing off that bucket list... Quick question, also - in regards to lung mets, just curious as to how many nodules/tumors/funny looking things you all had? I have six showing up on my pet scan. I can't get worried, because worrying won't help a bit, but wondering if this is something for someone else to worry about?",
      "MessageIndex": 145,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Jul 5, 2013 08:33PM CSMommy wrote: Hi all.  I've had some changes since I last posted.  We've determined that not only did the chemos work for me, but the molecular test I also had done showed that there's no chemo that will work.  I had a PET scan last week which not only showed progression of my lung mets, but new mets in my liver, my peritoneum, my lymph nodes, my vocal cords, and my arm.  So I'm off the chemo, and trying to get into a clinical trial for an immunotherapy treatment.  I have an appointment next Tuesday to find out if I got in - it all depends on whether or not my tumors include a particular protein.  I had a brain scan today, and I'm trying my hardest not to focus on it and say it's only for a baseline setting.  I had one in March that was negative save for some lesions that they said were due to migraines  Welcome, faithgirl.  Sorry you're having to be here.  What a terrifying allergy, Mary!  Glad to hear that you're ok!!  I hope you can get some answers with your new allergist.",
      "MessageIndex": 229,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "CSMommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148888/profile",
      "Content": "Apr 18, 2012 07:53PM CSMommy wrote: Its been just a week since my first post. And wow, what a week. I had my port catheter installed on Friday, and it went really well. I met with my new oncologist on Monday, and I really liked her. I did find out that I'm Triple-Negative, which I am soooo not happy about, but really, is there anything to be happy about with this darn thing? Anyway, I'm set for a PET scan, a mugo scan, and then I tentatively start chemo next week. It's a looooooong chemo process - we're currently talking six months - but as long as we get rid of this little bugger, I'll do whatever I need to do!",
      "MessageIndex": 7,
      "PostDate": "18/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785747",
      "Title": "The New Girl CSMommy CSMommy"
    }
  ]
}