{
  "AuthorID": "ctberrier",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160977/profile",
  "Posts": [
    {
      "AuthorID": "ctberrier",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160977/profile",
      "Content": "ctberrier wrote: I have been battling breast cancer for seven years now.  I was Stage IIIC at diagnosis, had a mastectomy/hysterectomy at the same time as I was highly estrogen positive.  I did Adriamycin/Cytoxan four treatments, two weeks apart, I had Taxol four treatments, two weeks apart, and 26 radiation treatments.  I was put on Femara for five years.  At five years the Femara stopped working and I developed another lump (a lymphnode in the original site), had surgery to remove the lymphnode and was put on monthly injections of Faslodex.  I did Faslodex for a year, and I had mets to the breastbone.  It was a tiny, tiny met, but a met nonetheless.  I have been on Xeloda for five rounds now, taking three in the am, and two at night, and my markers dropped.  Yesterday I had my bloodwork done and my markers are elevated from two weeks ago.  They were 61 now they are 67.  In the past tumor markers have been an excellent indicator of activity for me.  I am waiting for the doctor to call and let me know where we go from here.  Have any of you had Xeloda stop working and if so, what treatment did they do next.  Please somebody let me know, I am scared I am on the downward spiral.  This is such a hideous disease. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793880",
      "Title": "New Here ctberrier Angelfalls"
    },
    {
      "AuthorID": "ctberrier",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/160977/profile",
      "Content": "Sep 21, 2012 05:19PM ctberrier wrote: Thanks for the welcome.  I know the Oncologist told me there were eight different drugs to fight breast cancer.",
      "MessageIndex": 3,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793880",
      "Title": "New Here ctberrier Angelfalls"
    }
  ]
}