{
  "AuthorID": "ctinas",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95337/profile",
  "Posts": [
    {
      "AuthorID": "ctinas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95337/profile",
      "Content": "Sep 2, 2010 06:47PM ctinas wrote: Thank you so  much for all of your information and photos. This Summer I woke up with puffiness on the top side of my hand along with my index finger swollen. My arm sleeve that I wore the day before while I was doing some gardening I think may have caused it. The sleeve being too tight at the wrist and also using the hand too much. Anyway, I found a great therapist that works weekends. She turned me on to Kinesio Tape. Applied it while my hand was flexed with fingers pointed up. Starting above the wrist crease and made a split down the middle like two legs. one stretched a little past my first knuckle on the finger and the other down my thumb.It\"s stretchy but tight and It seems to force the lymph fluid back up the arm. I've been wearing it everyday and am having great results. Of course I am also doing self LDM. Top of hand and finger shows no visible signs since I've been using the tape. It stays on for a couple of days then I have to reapply a new  one. Just want to let you ladies know to check out Kinesio Taping and lymphedma. Tina",
      "MessageIndex": 95,
      "PostDate": "02/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751566",
      "Title": "VISIBLE SIGNS OF LYMPHEDEMA - A PICTORIAL LindaLou53 glennie19"
    },
    {
      "AuthorID": "ctinas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95337/profile",
      "Content": "Jul 1, 2010 01:25PM ctinas wrote: I wish all of you the best.I hope this is the right decision for you. I was given a fifty fifty chance of reacurance in the other side. But, I am really having a hard time lately. I don't mean to offend any one by what I am writing but these are my feelings. 2 weeks ago I had one of my tissue expanders taken out due to an infection. Is this ever going to end? Honestly I chose to have a BMX after unclear margins with  the lumpectomy and, sometimes I wish I never made this choice. You finish with chemo, then radiation, and theres still at least another year maybe longer of reconstruction. The discomfort, drugs, I've had five surg. in 14 months. I feel anything but normal. I just turned 49 and I can't turn back the clock but I seriously think I made the wrong decision. excuse the spelling. Tina",
      "MessageIndex": 75,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    }
  ]
}