{
  "AuthorID": "cupcake7",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
  "Posts": [
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Jun 14, 2008 03:00PM cupcake7 wrote: Thank each of you that took the time to respond.  I kept waiting last night and watching for someone, anyone to answer my post.  I don't think I am going to be a good candidate for test results if I am this bad now in waiting.  I will get a folder, and ask for the reports as I am a good record keeper.  I just went through 9 months of learning diabetes and controlling it.  I thought I was in the clear to health with caging the diabetes monster and now this.  I just can't seem to get a break.  The only good thing is I have lost 43 pounds and moved from the obese range to just overweight, and my blood glucose numbers are now in the normal range.  I think that will help me going into this.  Dazed shock is a good picture of my condition. Freefall also.   I was just talking to my husband in the car and said, \"remember those yellow sun glasses you have and you said how they make the whole world look different wearing them?\"  That is how I feel today about this dx of Breast Cancer.  I think and look at life a whole different way now.  The dx has colored my view of my world just like his yellow sunglasses did.  If they haven't ask for an MRI I will ask for one and get a copy of the Pathology report so I can learn to read it thanks.  My husband wants to go with me.  He says he wants to be in on the very beginning.  He said friends don't let their best friend goes through stuff like this alone.  I am so blest to have him.  About 2 years ago they discovered a spot on my breast from a mammogram, and went in with the Dr. putting in purple dye and then cutting my breast open and scraped out everything purple.  They said at that time the cells were abnormal, but not cancer.  I think that is why they focused so much in that area with the mammogram and ultra sound this time and couldn't find anything, and told me there was no cancer.  Could this be the inflammatory breast cancer I have read about in here?  I am scared to death walking around knowing I have these cancer cells under my arm and want them out.  I guess its a mute point now cause they probably already have spread anyway.  Good chance of that?  I know I am jumping to bad conclusions here, but I can't help it.  I'm not facing stage I or II that has a fighting chance here. I'm 62 years old and feel like a scared little kid.  I have so many friends around me that has or battling cancer of some sort, and I called one this morning and said, \"once in talking to you I told you I just couldn't imagine what you are facing, I think only if you have walked it that you could truly know what you are feeling\".  I went on to say this morning that now I do understand.  I told him my dx.  I am washed out today.  So much emotion.  I am so glad to meet all of you and will so much depend on your support.  In the diabetes chat room I crawled, walked, and then ran to the finish and became a supporter for all the newbies coming on board with diabetes.  I remember knowing absolutely nothing at all about how to manage diabetes, but I learned through extensive tight control.  I was just beginning to walk into the sunshine. I would tell all the scared newbies that it would be ok, take a deep breath and lets unscramble out the feelings your having so we can get to work on controlling it.  Now here I am again, same place, just different disease.   ",
      "MessageIndex": 6,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707298",
      "Title": "so lost..please help cupcake7 angie27"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Jun 17, 2008 12:15AM - edited Jun 17, 2008 12:19AM by cupcake7 Thank all of you for the wonderful words of wisdom.  Right now I am so busy trying to get everything in order so I can focus on treatment.  I have large program projects with a lot of people depending on me so I have to get everything out of MY head and give it to others to do.  I cleared my calendar so no commitments for awhile.  Geesh I was a busy lady! Hard to think the world can go on without me..lol...Two more days until I see the Dr. can't wait to get this show on the road. I don't like knowing I have this ucky stuff in me.   I have a date with my son tomorrow so I can tell him face to face.  He probably won't take it well and I didn't feel it is something to tell him over the telephone.  I was going to wait until I got more information, but its time now.  I find it hard to tell people.  Yesterday I picked up the paper and there was a story in the parade section of the paper of a Dr. who had cancer.  Then people visiting next door came over and I couldn't believe it...the wife just got out of Chemo.  I got to sit with her and talk how it has been with her..Then I came in for some lunch and turned on the TV and Michael Keaton's movie, \"Life\" was on about his terminal cancer and recording his life.  Is seems like now Cancer is all around me..did I not notice it before?  Amazing. Thank you again my new friends....Brenda",
      "MessageIndex": 19,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707298",
      "Title": "so lost..please help cupcake7 angie27"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "cupcake7 wrote: After a lump under my arm and a mammogram didn't show anything they did a needle biopsy. It had mostly fat.  In three days it came back, but they sent it out for further test.  I got a call that no one wants and that was to hear the words from the Dr. on the other end of the phone that said it is breast cancer.  He said a whole lot of other things, but my brain stopped at the word cancer.  He did mention he would have to remove the breast, have chemo, etc.  He set me up with an oncologist, cat scan, bone scan etc.  I have been lurking in here the last few days trying to learn some things, but all the words are like Latin to me. Some say the treatment is based on the size of the tumor.  What tumor, they didn't find anything.  Is the Cat Scan to try and locate it in the chest, stomach area?  They want to start chemo right away...how can they determine how to treat what they don't see?  The Dr. apparently pulled out some lymph material that had cancer in it.  Is this considered a stage III?  Would those cells tell him my condition?  What should I ask?  Please help me in untangle up my mind with all this...any help would be so appreciated. Dx 6/13/2008, 1cm, Stage IIIA, Grade 3, mets, ER+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707298",
      "Title": "so lost..please help cupcake7 angie27"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Jun 14, 2008 10:30PM cupcake7 wrote: Really?  Do you think I have a chance?  I know that sounds silly, but when I used to hear the word cancer it struck me as the kiss of death.  I mean once you got that dx it was all over.  Sierra you are a grade 3?  Is that the same as stage III?  I thought when it got into the Lymph glands it was really bad, and your chances wern't that good at beating the cancer?  I know if the cancer stayed in the breast we could live a long time, as cancer in the breast isn't going to kill us, its when he gets out of the breast and spreads to our organs we die.    Shirlann sister sounds so connecting...thank you.  They can't go fast enough for me Hedi.  All I can think of when I wake up is feel that lump under my arm and think it is spreading every minute it is in there.",
      "MessageIndex": 10,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707298",
      "Title": "so lost..please help cupcake7 angie27"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Jun 14, 2008 10:49PM cupcake7 wrote: Thank you Nico I went right in and everyone I read brought tears to my eyes.  It is the first words of hope that really sunk in.  I think to print them out so I can read them over and over to bring me out of this fatalistic frame of mind I am in.  Deb C you are an inspiration!  You know ladies I think I just might make it......",
      "MessageIndex": 13,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707298",
      "Title": "so lost..please help cupcake7 angie27"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Nov 27, 2008 03:43PM cupcake7 wrote: Hello Mia:  Nothing has happened to you that did not pass the Fathers desk first.  There is no why me for us Christians.  I was in a class the other day with a lady that was so angry about loosing her breast and my heart was so heavy for her cause it was obvious she didn't know the Lord and have His strength.   As you go along and get your plan in action, as the ladies said, you will feel better.  I was dx with a stage 111a that has spread to my lymph nodes, and when I first heard this got my funeral dress and things in order.  I think back now and laugh at myself how pestimistic I was.  As Janis said that is just a label.  Bad news is we have HER2, good news is we have HER2.  We are able to receive the Herceptin ( a brand new drug 7 years old) that shrinks the tumors and in many cases cures the breast cancer.  I mean gone baby!  I just finished 6 rounds of Taxotere/Carboplatin/Herceptin and the lump, that was the size of a golf ball, is gone.  The aggressive chemo was to get all those rouge micro cancer cells that are floating around in my body so they don't cluster somewhere and start another cancer.  I go in for surgery, when I recover from the chemo, after Christmas to remove the lympth nodes to make sure it is all gone and then radiation on top of that.  I will have a modified radical mastectomy where they think the tumor started also.  So I lost my hair for awhile, so I will loose a boob, and go through all this misery in chemo, but it has made me even stronger in my faith as the Lord has walked the journey with me.  Most of the cancer patients have gone on to reach out in some way to help others as now we have don't have sympathy, but we have a true empathy for woman having breast cancer.  Only by going through this journey can we have this.  I have taken the BRCA 1-2 test this week and will know in 4 weeks if I have the gene.  I appologized to my first onc and ask her if she would take me back, which she did so I will be returning to the first onc group.  The grass was NOT greener on the other side.  It was brown and dead.  I have 5 appointments next week with my surgeon and plastic surgeons,  the old onc and a dermatologist.  (When I had the bcra screening they ask why I wasn't keeping up on my moles beings there is such a high rate of Melaloma in my family).  So immediately I set an appointment to begin the watch.  This journey seems to move from one stage to another so fast.  It's hard to believe I got my dx seven months ago.  I feel so good that chemo is past me, and I am feeling stronger everyday.  This page has been so helpful through all this, especially when the emotional melt downs hit.  The Lord knows we need a human touch and provides it for us. ",
      "MessageIndex": 28,
      "PostDate": "27/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/705460",
      "Title": "Newcomer of Breast Cancer at stage III JoyMia7 apple"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 19, 2009 03:20PM cupcake7 wrote: Will remember Kathy Debi and you too. Kari you live in Lincoln and we are neighbors.  I live in upper Carmichael, by Fair Oaks. I go to Kaiser Roseville, but doing Radiation in Rancho Cordova as it is a quicker drive.  We will have to meet up sometime. Denni I have tried exercise and it only makes it worse.  I listened to my body today and Lori was right on...exactly one hour from the treatment it hit.  I could just feel my knee's buckle.  That is interesting.  See I've learned something already.  How long does it usually last for you?  I am pegging it today to see if I am better by evening.  I don't remember yesterday cause I wasn't paying attention.  I just took a couple of Tylenol and hope that helps.  Asa soon as I sat down from lunch I dosed off.  Yesterday I slept an hour, but today the phone rang and woke me up, but I wanted a 15 minute one instead of a long one anyway.  I have a run to make up to Roseville to see the surgeon so hope to get some energy by then.....",
      "MessageIndex": 305,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 23, 2009 10:10AM cupcake7 wrote: Joy I am 63 so I'm up there with you.  Are you having pains from the rads or are you on Amiridex?  I stopped taking it this weekend cause I was in so much pain, but before everyone yells at me I am calling the onc this morning as soon as they open.  I have Arthritis, but this pain was 5 times as hard.  I know it was that unless rads cause the pain.  Anyone have any input on that? This Thursday will be half way mark for me of the 30 tx.  I think with all the holidays and not full weeks this one will surly give me a pattern how I will fair with the radiation.  I didn't do well on Friday, and Saturday was still pretty weak.  Today I am up and ready to hit it again.  I'm hoping the Armimidex was the cause of the pain.  They can try something else I am sure.  I know while on chemo the Zofran that was wonderful for everyone else did diddly squat for me.  They changed me to Emend and the rest of tx was fine.  Hope this med will be the same....",
      "MessageIndex": 376,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 24, 2009 05:20PM cupcake7 wrote: Kari:  I see my oncologist every Wednesday after treatment.  I just stay in my robe and make my way to his examining room with the nurse.  He looks at the x-rays, ask me if I have any SE's, and checks my skin. ",
      "MessageIndex": 398,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 27, 2009 05:40PM - edited Feb 27, 2009 06:05PM by cupcake7 mary:  What you are experiencing is completely normal.  From the beginning of this journey you have run here and there, this test and that, etc. and now you are done...seems like you have  came to a halt and doesn't seem right.  You never spent much time in thinking because you were just to busy, but now you have come to the end with no more test, no more appointments, no more what if's.  It will take time to readjust to being \"normal\" again so it is ok to think and to reflect back on where you have been.  Then it will be time for you to move on.  mandy/seabee:  Looks like we are on the same schedule as I just began my 16th round so over the hump and heading down the other side. I am finding that complete rest and sleeping well has helped me so much.  At first I was a mess and so fatigued.  Monday night slept good Tuesday felt wonderful...Wednesday night didn't sleep good and Thursday felt awful.  And that terrible fatigue.  Thursday night slept good and today feel great.  So put the dots together and I think that is going to be what I need.  Denni:  e-mailing you now thanks...",
      "MessageIndex": 449,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 14, 2009 09:04AM cupcake7 wrote: I have a deep faith in God and He has been my strength through all this and His calming presence has seen me through it. ",
      "MessageIndex": 572,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 16, 2009 09:30AM - edited Mar 16, 2009 09:32AM by cupcake7 Mary:  My hair was coming in by month 3 so be patient, yours will start too.  Remember your body will be repaired first and hair last.  Denise:  Its ok to rant, that is what this room is for along with information.  I think you are feeling like me in that I am done with all this!  10 months is enough already!!!  We are almost there.  I am large breasted to and had chemo, but not experienced as bad as you...we are all different as you said.    You do know you can have a break from rads if it is to bad.  Gives you some time to regroup.  Of course they don't want to, but if it is bad enough.  I noticed my red is now sore and itchy, but trying to blot it and not scratch.  Your insight on the radiation room is awesome.  Makes sense to me, but scary they are containing it with 6 feet concrete walls to contain it and here we are sitting in the room....I am fighting the oncoming of a vertigo attack and praying it stays away until these next 4 boosters are done.  I told my onc if it does I cannot come in at all cause I will be down in bed for 5 days or longer.  This morning I happened to lay on my right side (bad ear) and it set my head a spinning until I moved off from it.  The onset starts with a feeling of fullness in the ear and itching before it happens and it started that last week. Just praying it stays a way a few more days.   ",
      "MessageIndex": 601,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 20, 2009 09:39PM cupcake7 wrote: For all the ladies OUT of rads.  Can't do this until you have no more treatments because of the metals in the material, but I found a medicine that I originally got from the surgery dept that came in a little rip off the top and squeeze out called Calmoseptine.. I used it for around my wound after surgery and put some one the painful red spots and instantly the pain was gone.  It stays on all day cause it is like a thick cream.  I used the Eucerin sample from the rad clinic and it set that spot on fire so much I had to get in a shower to wash it off.  I called the nurse to make sure this was ok to use and she said yes after radiation.  My back still itches and little bumps.  Tolerable though.  So glad I am done.  Rest now",
      "MessageIndex": 639,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 20, 2009 12:00AM cupcake7 wrote: Wow group did someone throw me UNDER the train I am suppose to be riding on in here?  Dang I sure hope this is not going to be like chemo in that the longer you go the more saturated your body gets with the chemo and the worse you feel.  Please someone tell me when you begin the radiation fatigue it doesn't get any worse.  I did go to the surgeons and walked around a lot so did get some exercise Denni.  I timed the tiredness to about 5.5 hours and it was over.  I will rest I am sure tonight and get hit again tomorrow which will be the first day of my third week.  It was so nice to finally get through chemo and to feel like I am going down into that pit again just is not a place I want to go. ",
      "MessageIndex": 322,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 23, 2009 05:38PM cupcake7 wrote: Jobu:  I think it was you who wrote to someone about the supraclavicular area.  That is where my rads are and your explanation was better than anything I have heard through this whole thing.  Why doesn't the radiology onc just explain it the way you did.  That made sense to me and I keep thinking of it driving to the clinic knowing this treatment is to catch any cells that escaped the Axillary nodes and are making their way to the neck or thoracic duct.  Thank you very much, that really helped me although you said it to someone else.  My onc has been gone for so long I think she may be sick and not coming back.  I left a message on stopping the Arimidex and they will call me.  Also got an appointment for Wednesday to have my port flushed.  I'm lost in the shuffle, but am darn well gonna be loud until I get someone to pay attention to what is going on with me.  Thanks for the advise group...",
      "MessageIndex": 385,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 25, 2009 06:21PM - edited Feb 25, 2009 06:22PM by cupcake7 unique:  I don't think you are alone in the worry dept.  Cancer just has a way to rearrange our thoughts on stability and things going on.  My life came to a screeching halt when I first heard the words, \"you have cancer\".  Wow life might NOT go on.  New concept for me.  With worry I try to recall what the Bible says and that worrying about something will not change a thing about it.  When you think of it that is true and when I worry I just waste energy.  It isn't going to change anything, but I have to keep reminding myself of that 1,000 x a day.  Today I feel so good.  If by stopping Ameridex, or just that the beginning of rads is the cause it is easing up and I don't feel so rung out.  Will see how tomorrow does, but today I didn't even need a nap.  I'm pinkish like you Unique, but doesn't really hurt.  I do put on Aloe Vera everyday when i come home cause it is for burns.  Mary:  I have a small rash right under my Mastectomy.  \"What's up with that?\", I ask.  The tech just said sometimes it just happens there and they don't know why.  I remember my position numbers and one day they said its a 92 on this side Terri and I said it is suppose to be a 93.5 isn't it...silence...yep 93.5 here terri.  Would they have said opps...don't think so.  So pay attention gals...never know cause they really have so many patients its easy to forget.  They keep marking my tattoo and she said today that I have two small moles next to it and they can't tell when they go into their room which one so they mark it.  I can't tell you all how good it feels just to feel good.  I was really beginning to worry...(opps here I go again Unique)...that this was going to be this way the whole time.  I don't think so now. ",
      "MessageIndex": 415,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 27, 2009 10:08AM cupcake7 wrote: Denni:  Congratulations on your finishing these radiation treatments.  I am just half way, but will be where you are soon.  My place recommended Aquaphor too, but I found it to greasy, like Vaseline.  Good thing it was a sample and I didn't buy it.  Where did you find fresh cell?  I would like to try it.  Did it have a grease base too?  I have heard of Jeans Cream too being good.  We don't have a Behavioral Therapist but I have had a lot of that in college and it is a good way to go.  Everything we do is behavior, whether it is bad or good.  The Behavioral Therapist has you take a deep look at your behaviors and see if there is things you want to change and then gives you tools to do it in step by step plans.  Cancer has certainly caused me to take that look and appreciate more good health and how to better take care of this body.  Eating correctly and exercise is what I am going to focus on.  Rearranging my life so I can do it.  I had way to much on my plate which caused me not to take time to eat well or have a plan of exercise in my life.  I was so tired from the day I just plopped in front of the TV to unwind.  Had a good nights sleep and feel so much better today.  I think during these treatments for me sleep is more important than anything I can do.  So with that up and away to shower and run to the sparky show.....have a great weekend girls. ",
      "MessageIndex": 441,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 15, 2009 07:41PM cupcake7 wrote: Your right nothing heals it, but makes it feel better while it is.  I see my onc after this week, but actually I am thinking they have to do something else than Arimidex.  I don't want to live on Motrin as it is hard on the stomach.  The numbness is kina going away in the little finger so don't want that to come back either.  I am going to use this week to read up on it.  It's quality of life for me. ",
      "MessageIndex": 591,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 29, 2009 03:18PM cupcake7 wrote:",
      "MessageIndex": 705,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 19, 2009 08:31AM cupcake7 wrote: Hello:  I just graduated from Camp Chemo thread, had my Modified Radical Mastectomy, and now in Radiation.  I began Feb 4th with my first treatment of 30 being February 5th.  This sounds like an informative group and would like to join you.  Do you have room? ",
      "MessageIndex": 295,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 19, 2009 09:56AM cupcake7 wrote: I've been reading what you all have been doing and good to hear that this drag out feeling I am having is normal.  And it does hit about an hour after treatment.  Interesting.  I'm having #10 today.  Next week begins half way.  Any suggestions where or how to get some energy?  I just overall just feel lousy.  No cold or anything, just not myself.  Is this the way it is going to be for the next month of this?  How is it some has a lighter round of rads.  I ask beings I have a rare condition and a question even to have rads if I could do just half and they said no. ",
      "MessageIndex": 297,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 20, 2009 04:34PM - edited Feb 20, 2009 04:35PM by cupcake7 Ok I posted twice now and submitted.  I thought the first time with chemo fade and all I probably didn't hit submit, but typed it again and this time was sure and its not on.?????????? Alright this is weird I hit the submit button on this one and the one I posted came up...I SWEAR it wasn't on there before. ",
      "MessageIndex": 331,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 20, 2009 06:21PM - edited Feb 20, 2009 06:24PM by cupcake7 Ok came on again and no last post.  Can someone tell me what I am doing wrong? Ok I see it now as soon as I post something.  Thank you Unique, but I think this page has a belch instead of a burp.  Looks like we are all on the same rounds of rads so far.  I'm a little pink too, but nothing bad yet.  I have started to apply cream to the area as pro active.  I rested most of the 5.5 hours this time so don't feel quite so bad today...guess just have to rest when needed.  Hope your all going to have a great weekend.  Cyber hugs to you all",
      "MessageIndex": 333,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 21, 2009 11:09AM - edited Feb 21, 2009 11:10AM by cupcake7 Onehalf:  Yes I do and have put it on my favorites.  I think for some reason it gets stuck on page 10 and I go in and hit last and it works better.  This time no problem.  Just in the other room I would sign in and it took me directly to my last post.  Thanks Denni:  Yes for sure us women do put others first and it was hard for me to think of me being first, but you are right that is the right way to look at it.  That is helpful for me to know by the ends week that I will fade, and hopefully it is a weekly thing and not the whole 30 treatment thing.  What I mean is I can handle by the end of the week feeling this way and recouping for the Monday start again, but not if by treatment 20 it has accumulated to that point. Mary:  What is an Al? ",
      "MessageIndex": 342,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 24, 2009 12:31AM cupcake7 wrote:",
      "MessageIndex": 388,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 24, 2009 09:39AM - edited Feb 24, 2009 09:43AM by cupcake7 Jeanne: Good focus on the clocks turning ahead for us.  Don't worry about your treatment.  It is quick..and you feel nothing.  It takes a few times to get red, but I have been diligent in keeping on the creams and Aloe Vera after each treatment and have not had any problem and I am going for #13 today.  As it goes on you will feel a little tired, but someone posted at one time it is like you feel when you have worked a week without a day off.  I'm trying to combat that with coming home and resting.  I know some in here has children, work, and much to do, but for me being retired I can just take a nap when i want to that I am sure makes it much easier.  The procedure takes you longer to get there than to get the actual treatment.  Pascalrose:  I got tired quickly too.  Guess some of us does faster than others.  I questioned that too.  Each person is different.  Anyone in here that has to face chemo after this or surgery?  Been there and done that if you need any questions answered.  This is the end for me.  I am cancer free at this point.  Rads is just mop up.  I finally figured out how to fix this sight the same as the other one of chemo.  Takes us older people awhile to figure this out.  Anyway when I first put it on favorites it was saved on the original post so it automatically goes back there and takes a few clicks to get it to present.  Then today I saved it for todays post and now every time I go in it will come right to where I left off and I know all post after that is replies.  Oh I feel so good when I figure something out on this computer. ",
      "MessageIndex": 394,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 26, 2009 06:42PM cupcake7 wrote: Kari: Yes I got the Bolus cold sheet too.  Didn't know what it was but told them that if I had a nipple it would be sticking straight out.  They try and warm it at times.   Call Kaiser and ask when the next plastic surgeon class is. Their held at Morse as there is no plastic surgery at Roseville yet.   You have to take the class to be able to see a plastic surgeon.  In it they put on a little movie of the surgeries and then a surgeon will come in and answer all your questions.  I took it long before my surgery even.  You can take it anytime.  I think it will relieve your anxious feelings.  For sure I would ask the onc why they are saying that now.  Can you e-mail yours?  I do mine.  What is Avastin treatments?  I just know they want you to wait a year after radiation.  Two reasons one being to let the skin heal and the second is you won't want to put anything over the area incase something comes back and it would be hidden under the foob..(fake boob)",
      "MessageIndex": 436,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 12, 2009 10:43PM cupcake7 wrote: I thought I could talk my radiologist into not doing the 5 boosters, but alas he looked at me like I had three heads.  Opps on the pic.  I still go into my last chat room for TCH treatment gals and the ones just finishing chemo will be going to rads and wanted to see a picture so when I posted it for them it will stay on until I change it back.  I told them it looks worse that it hurts.  Actually doesn't bother me at all.  I only have used Aloe Vera.  The creams remind me of years ago you were told NOT to put butter on a burn cause it just cooks it more.  Wellllll those  creams to me seem like the butter so I didn't use them.  I feel so good today with a good nights sleep last night.  Just did wonders for me.  So treatment tomorrow and then 4 next week and I am done.  Spent the day going through all the saved papers, appointments, pictures, cards from people, wrist bands from chemo etc. and put them all in a box and after next week will close that box and tape it up as memorabilia of my cancer journey.  So very sorry to hear of all your other problems with rads, no rads, rads on then off.  That is awful. ",
      "MessageIndex": 556,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 18, 2009 11:40PM cupcake7 wrote: Diane:  I think the boosters are just to the scar area. Unique:  I got my compression sleeve and after one hour in it I was thinking this is going to end up in a drawer.  That is totally uncomfortable.  I have mild Lyphedema, but will wear it on the plane when we go on vacation. Kari:  I love my daffodils and to see them open the next day was such a job.  My back on the shoulder blade is itching like crazy and then today after my shower I saw it all red with bumps.  I guess the rays go through the back hunh?  Tomorrow is my last boost..HOO HA",
      "MessageIndex": 619,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 22, 2009 08:47PM cupcake7 wrote: I know what you mean Seabee.  I got my last boost on Thursday.  This week coming up is onc appointment and three months the rad onc.  What would they be looking for?  I know the onc, but the rad onc?  My back itches like crazy too and bumpy.  My front didn't hurt really the whole 6 weeks, but now very purple and tender.  I run around with a ruler to go up under my shirt to scratch my back, or rub up against the door frame like a bear in the Forest. I guess just a day at a time.  I have been thinking a lot of what I am thankful for since the last tx.  Yes for surviving this awful disease, but also to my God that while in the storm the storm was not in me. He gave me peace at times when I was the weariest.   I walked through the fire, but didn't get smoke on my clothes.",
      "MessageIndex": 661,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 29, 2009 09:09AM - edited Mar 29, 2009 09:10AM by cupcake7 Debi:  My heart is heavy for you in reading your post this morning. In this journey we have become so close that each thing that hurts one of us hurts us all.   Your sister has been led from her pain by the angels to the presence of the all mighty and she is safe.  I know that does not relieve the pain you are feeling right now by loosing your sister,  but take comfort that you are being told this by the sermon and the song that was sent to you even before she died to prepare you.   I believe that life does not end here when we die, there is life after death and your sister just slipped from this one to the next.  I am with Annie, if you feel like it share with us about your sister.  You will be in my thoughts and prayers the next few days as you struggle with your loss.  Cry for her and God will catch your breath for you.  Let us know how you are doing.  We are grieving with you. Donna:  I had the BRCA test and I do not carry the gene, but if you do you will certainly will have it return in the other breast and strongly advised to have it removed, plus all the females in your family to be tested.  Lets hope your test was like mine.  It has to be sent to NY as it is the only place in the world that does the test and beings they have a patent on the test the cost is $5,000.00.  They can charge anything they want with the patent.  I know it is hard to wait for you to get the results.  Kari:  We are all told we have a 1% chance of it returning in the other breast, but that is 99% chance it won't.  That is pretty good odds.  I'd like to have those when I go to Reno. ",
      "MessageIndex": 700,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 20, 2009 10:44PM cupcake7 wrote: Ok I think I may have the handle on this chat room.  TCH sight I was used to logging in and just going to my last post and then I could read the replies and here I have to hunt for it.  But in time will get used to what to do.  I apologize for the double of the post.  If that isn't a good explanation I could just chalk it up to chemo fade.  I am having a heck of a time getting my brain to work after the treatments.  In time I know it will come back. Lories:  Thanks for the idea that the end of the week may be worse.  That makes sense.  I will check that out next week to see how I am on Monday and how I progress. ",
      "MessageIndex": 337,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 21, 2009 02:57PM cupcake7 wrote: Mary:  Have you ever put metal in a microwave?  Seen the sparks?...yeah wear deodorant with metals in them like Aluminum, and you will set off sparks too and it will burn your skin...OUTCH!  Nope when I heard that it was convincing enough to me not to wear deodorant. Lories:  Thanks for the explanation of Al's.  Yes I am on Arimidex like Souad.  Souad:  My joints are killing me.  I don't know if it is the weather or Arimidex.  I know it can mess with the bones. ",
      "MessageIndex": 351,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 22, 2009 10:24AM cupcake7 wrote:",
      "MessageIndex": 365,
      "PostDate": "22/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 26, 2009 12:22AM cupcake7 wrote:",
      "MessageIndex": 426,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 26, 2009 05:36PM cupcake7 wrote:",
      "MessageIndex": 432,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 11, 2009 10:40PM cupcake7 wrote: Hi Mary I have begun to box up all the papers, information, notes, and cards along the way of this years journey with cancer, and ready to put it all behind me.  Oh yes there will be close watch visits to the onc, but it is over.  As long as I was resting through the radiation I was doing fine.  The last few days I haven't slept well because of being cold at night and it caught up with me today.  I was a draggin.  Going to bed early tonight and be ready for the last big one tomorrow then 5 boosters on the scar.  YIPEE its over!!!!!  Watch out world here I come...been down for awhile, but I am alive and cancer free and ready to take it all on again....",
      "MessageIndex": 547,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 14, 2009 11:56PM cupcake7 wrote:",
      "MessageIndex": 581,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 15, 2009 01:05PM cupcake7 wrote: Kari;  Bummer weather hunh?  Next week is suppose to be 75 degree's, can't wait.  Mary:  I changed the picture today, but yes the other picture was regrowth.  I had it cut to start the shaping of the do. I put this pic on cause that was hair before chemo and shaping to go back to it.   Keep in mind your body will repair the important cells that was damaged first and the hair will be last.  It will come though so just be patient. I remember someone saying the rays will go through me so I think my tx was that way.  It is healing now and itching alot.  Outside of that I am ready to move on with the next stage of my life.",
      "MessageIndex": 586,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 26, 2009 10:06AM cupcake7 wrote:",
      "MessageIndex": 681,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 20, 2009 02:57PM - edited Feb 20, 2009 03:06PM by cupcake7 Hey gang what in the world happened to me?  I feel like someone threw me off that train I am suppose to be riding on in here.  In one hour after radiation the fatigue hit like a ton of bricks.  I timed it and it lasted 5.5 hours before I felt half way decent.  Please someone tell me this is NOT going to be like chemo in that the father along you go the more fatigue you get.  Chemo got worse as more and more poison got into my body where I was saturated and the last few treatments were really ruff.  I am hoping that this is the fatigue..deal with it, and I can, but I am at a 8.5 right now and I have 4 weeks to go yet and if it progresses I am going to be in trouble. Denni I did some exercises but it doesn't seem to help, but drain more energy from me.  I am just sitting down at onset and rest.  I sit for a moment and I am out like a light.  Denise:  I went to chemo at Roseville and will finish up my Herceptin there, but doing rads at Rancho Cordova, much easier comute on SunRise.  You KNOW how bad that can get in traffic.  Your going to the new place by the mall?  I went there for a test, really nice place. ",
      "MessageIndex": 328,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 21, 2009 09:00PM cupcake7 wrote:",
      "MessageIndex": 362,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 24, 2009 06:17PM cupcake7 wrote:",
      "MessageIndex": 401,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Feb 25, 2009 09:42AM cupcake7 wrote: I feel the best in the morning after a good nights sleep.  As the day goes on I am more tired, but if this is all is gets then I can live with it.  I think sometimes I stress over things that makes it far worse.  I am going to settle in now with this is what I need to do to get through the next 16 tx.  I rest the remainder of the day after tx and it works for me.  Its just 3 more weeks and I can do it.  lori CONGRATULATIONS GIRL I am so happy for you.  Are you all done now and can put all this cancer thing away and move on with your life? ",
      "MessageIndex": 408,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 4, 2009 10:44AM - edited Mar 4, 2009 10:48AM by cupcake7",
      "MessageIndex": 498,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Mar 24, 2009 08:42AM - edited Mar 24, 2009 08:45AM by cupcake7 Joy:  Let me know what you find out on the Arimidex vs Femara.  I too went off the Arimidex for the joint pain.  I see my onc today to discuss it cause I took myself off it until after rads.  I just couldn't deal with the on going Arthritis with the cold weather and Arimidex too.  On researching the medical lib Arimidex also raises Cholesterol levels and I'm already taking Cholesterol meds, Body swelling, Sleep problems, Weight gain, Carpal Tunnel Syndrome, which my two fingers are numb.  Also not feeling well and Vaginal dryness that I am suffering from.  There is a long list of things I can't even pronounce so not thrilled about the S.E's of that pill. So sorry for all the things that has been happening to you.  Sometimes when it rains it pours. ",
      "MessageIndex": 666,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "May 25, 2016 12:47PM cupcake7 wrote: so very happy for you",
      "MessageIndex": 20,
      "PostDate": "25/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836950",
      "Title": "Stage III Cancer Survivors...15+ years and out weesa lexi4"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Jan 29, 2016 08:24PM cupcake7 wrote: do as you wish, but I'm still looking for direction to talk to someone who made it this far and what was out there still. I can't find any information of how bone cancer starts in the later years...I know enough to know you don't walk away from this scott free ",
      "MessageIndex": 198,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/815407",
      "Title": "Stage III Cancer Survivors .... 10+ Years and Out AlwaysHope karen1956"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Jun 25, 2008 10:16AM cupcake7 wrote: I had 2 mammograms, and one ultra sound that was clear and said I didn't have cancer.  Then they ordered a needle biopsy of the lump under my arm, and the tissue came back with cancer cells.  Because they can't find the tumor they ordered a Cat-Scan to check the chest, liver, stomach area, and a full body Bone-Scan, and found no cancer anywhere else in the body except the breast.  The lump may be the tumor they said even though it isn't actually on the breast.  I would think even though the cancer cells have not stuck anywhere and started a growth that they may be floating around getting ready to so the reason for the Chemo would be to kill any of those cells  floating around.  That is just my guess.  They will also do on me radiation and targeted Herceptin treatment to the cancer cells in that lump, and finally a mastectomy.  I have heard those bone biopsies are extremely painful so don't think I would ask for one unless they seen it necessary.  Absolute be your own health advocate in research to know what is going on with your body, but you have to rely on these OC that specializes in the cancer too.  Hope this helps some.  I know it is a difficult time.  Just getting those test back yesterday seemed like a weight of tremendous magnitude was lifted off me.  Yes bad news is I have a very aggressive kind of breast cancer, and good news is I have a very aggressive kind of breast cancer...hey its in the breast and not spread anywhere else at this point so I am very happy just to know that.  It is not going to be a walk in the park these next few months but at least there is light at the end of the tunnel.   ",
      "MessageIndex": 5,
      "PostDate": "25/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707975",
      "Title": "protocol on scans??? nobleanna007 nobleanna007"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Jul 6, 2008 01:36AM - edited Jul 6, 2008 01:37AM by cupcake7 I did get my port on Wednesday and stayed awake with local while the surgeon put it in.  Didn't hurt at all.  Feels weired though especially in the neck.  What are the risk involved you spoke of Deb?  My other message room I am in the girl said she got a clot in her's and now has to give herself blood thinning shots for 2 weeks.  Is this common? No one told me when to take a shower do you know the time?  It will be 5 days tomorrow and I have showered, but afraid to get the area wet or anything.  The surgeon told me no one to access the port but the Oncology dept.  He said someone could not be as careful on cleaning and get it infected and I could loose it.  I had a MUGA today and had them use the veins.  They were semi healed from the Scat Scan, Bone Scan and the MRI.  All done now and ready for treatment on Tuesday.",
      "MessageIndex": 10,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/706771",
      "Title": "i got my port today ekenny315 cupcake7"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Jun 24, 2008 12:48AM cupcake7 wrote: I will begin Herceptin with my Chemo Cocktail being every 3 weeks and the Herceptin every week.  After your done will you still have to take some kind of pill or something?  Will you always be HER2+++ for the rest of your life?",
      "MessageIndex": 3,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707880",
      "Title": "Herceptin ellie123 ellie123"
    },
    {
      "AuthorID": "cupcake7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68163/profile",
      "Content": "Jun 24, 2008 12:43AM cupcake7 wrote: I read all your comments on the ports.  I'm considering getting one since I have tiny veins that don't do well with shoving things in them like a cath.  Just from one cat scan they poked me 5 times on both hands and arms before they finally got it in and I am one solid bruise all over.  They must have blew a vein cause I see this line all the way up my hand.  Do you think I should have a port? ",
      "MessageIndex": 8,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/706771",
      "Title": "i got my port today ekenny315 cupcake7"
    }
  ]
}