{
  "AuthorID": "Curlyq1974",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
  "Posts": [
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Dec 24, 2015 06:08AM Curlyq1974 wrote: JFL, I am willing to bet that even though you were not ready for the picture with Santa, it maybe one of his favorites as he gets older. I think you should print your post above and tape it to the back of that picture for him. It will be many, many, many more years before he realizes the love of a mother, but one day he will and the story and the picture will be priceless to him. Try not to be so hard on yourself. You are a terrific mom.",
      "MessageIndex": 51,
      "PostDate": "24/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837368",
      "Title": "On the subject of \"Last Christmas\" sueopp artistatheart"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "May 29, 2015 03:30AM Curlyq1974 wrote: I am praying with you Penny.",
      "MessageIndex": 161,
      "PostDate": "29/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831418",
      "Title": "Please, Lord redwolf8812 GrammyR"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Nov 4, 2016 11:27AM Curlyq1974 wrote: LOL!!! I am sorry to be giggling... Mine came back on my face a peach fuzz. My brother would pull on it... Gotta love brothers. My beautician, when I finally had enough hair on my head for at trim took one look at me and was like, \"Oh no, we have to do something about this...\" and she waxed my face. Has not come back...",
      "MessageIndex": 1,
      "PostDate": "04/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849675",
      "Title": "Facial hair after chemo iz1999 iz1999"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Feb 7, 2014 05:27AM Curlyq1974 wrote: I'm so sorry Lovemyboysandlabs!  The waiting and unknown are the worst.  I remember vividly the nights ponderring the worst case scenerio.  As soon as I woke, it was the first thought I had - the stupid unknown.  It consumed my everything.  I couldn't think of anything else.  I couldn't concentrate, I couldn't work, I would start to do something and it would pop up in my head.  The days of waiting and not knowing are the absolute worst!.  I am so sorry you have to wait!!!  If only I ruled the world, I would make these tests and the results be instant!  (Actually, I would cure cancer, but instant results would be the second thing) Know that you are not alone.  And whatever the results, you will prevail!  Have a great weekend, Tuesday will be here before you know it. ",
      "MessageIndex": 9,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817769",
      "Title": "Radiologist said I likely have cancer Lovemyboysandlabs ziggypop"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Mar 11, 2016 09:09AM Curlyq1974 wrote: Ewygirl, you are such a good friend! Wow! I'll answer your question in the order that you have, 1. My cancer diagnosis, to surgery to chemo took about 2 months. Diagnosed 12/2, surgery 12/18, chemo started I think in January... yes, it seems fast, but most of us would prefer to have it that way vice the wait and anxiety. 2. Chemo - I have not a clue. Every person is different. What works for one may not work for another, what combinations, what drugs, all of that I left in the hands of my oncologist. I had to trust that he would guide me as he would his own daughter or mother. There is no way possible that I would be nearly as knowledgeable as an MD. 3. Family bully - YIKES. I'm not sure how to hand that? I'm sure the daughter just has her Mom's interest in mind. I am not a big fan of the food/marijuana treatment. I just don't know enough about it to say it is a viable option. 4. Second opinion - if your friend is uncomfortable at all with her treatment options, yes, I would say a second opinion. I did not have a second opinion. I did a lot of research on my docs, and was 100% confident in the protocol they prescribed. I was comfortable from start to finish. However, if I wasn't I certainly would be looking for a group of doctors that put me at ease. Reading this back, it isn't the best response. Not very helpful, I know, I'm sorry!! But good for you for being there. Whatever your friend decides, just support her decision, right, wrong or indifferent. This is such a roller coaster ride! I am so grateful for the friends I had that were by my side thru treatment. Prayers for you and your friend.",
      "MessageIndex": 1,
      "PostDate": "11/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/842121",
      "Title": "Understanding Diagnosis and Treatment Ewygirl Kicks"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Mar 10, 2016 12:28AM Curlyq1974 wrote: Ugh Mckaylaleigh! Sorry you didn't get good answers from your doctor. Exercise - my instructions were none. Do nothing, no lifting, no stretching, nothing... Not until the drains come out and you are checked to make sure the incisions are healing. I didn't realize how much internal work the surgeons did, internal stiches and stuff that they didn't want me doing anything. As for the drains, I \"milked\" mine when the bulbs started to fill and pull. Then I would drain the bulb and stretch the lines to get the yuck out... and then flatten the bulb as best as I could before closing it. Just take it easy - thank goodness you are feeling good. This is a lot for the body to go thru - rest! Best wishes to you! ~Janet",
      "MessageIndex": 1,
      "PostDate": "10/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/842041",
      "Title": "Post BMX Questions Mckaylaleigh Mckaylaleigh"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Jan 31, 2014 07:30AM Curlyq1974 wrote: Hi everyone!  I have been secretly reading this post for weeks now and figured I should introduce myself.  I was diagnosed 12/2 after a year long saga of test, surgeries, begging for BRCA testing and multiple lumps that I found upon self exam.  My mammo and ultrasounds always come back fine but I just knew.  Thank goodness for awesome doctors who were willing to listen to my concerns!  I am BRCA 2 positive, so it is now a family affair.  My mom and aunt are also both BRCA 2 positive.  No cancer for them - thank goodness!  They both will be joining the bilateral mx sisterhood soon.  1/21 started my first session of chemo.  Was a lot of anxiety but so far so good.  Had an episode of bone pain this week from the nulaste that was a lot more intense than I expected.  Accidentally took too much pain meds on an empty tummy and made myself sick.  That was a learning experience that I won't make make again!!!   Hair is starting to thin, but not what I thought it was going to be like.  I keep looking for clumps of hair, but it doesn't seem to be falling out in clumps.  It might be too soon.  I am going to try to hold on to my hair as long as I can.  I don't know why, but cancer can have my boobs, I can deal with chemo and radiation, but the thought of my hair falling out is devastating!  It took me my entire life to get my hair to the length it is, the style I love - and it hasn't done anything to try to kill me!!!   I know it is petty.  And I know it will grow back - it is just the one thing I am mourning!  Thank you all already for the support you didn't even know you provided me!  You are all so strong and powerful.  If there is an elite clube that I have to be a member of, I'm glad to be here with you! ",
      "MessageIndex": 477,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Feb 7, 2014 06:43AM Curlyq1974 wrote: Hi everyone!  This post is the best!  You are all so strong and motivating to me!!  I couldn't take my hair falling out anymore and the pain so my husband shaved my head for me.  Clearly, I need a new hairstyle when it grows back because EVERYONE has told me how young and vibrant I look and that I rock a bald head.  How funny is that!!!  All the anxiety, tears, anguish and I have had nothing but compliments!  And I'm not botherring with hats, scarfs or turbans.  Just plain ole bald.  And it is so easy to get ready in the morning!  I did buy some new make up.  Someone recommended a bronzer, so I bought one at the Bare Minerals store.  It is amazing.  My skin is so soft!  Not sure if it is the bronzer or chemo but I'll take it! Day 7 post Neulaste is complete and total hell!  Learning the hard way as always!!  OMG, tears were streaming out of my eyes uncontrollably.  The pain was unreal, worse than child birth.  An oxycodone and two hours later things settled down, but ouchy-wow!  I have read the Claritin tid-bit in this post and I'm willing to try anything to keep that pain at bay.  Living and learning... lol! On the worrisome front, I woke up this morning with a cold and it is quickly moving into my chest.  I spent the first couple minutes after waking up coughing up phlegm.  Normally, I would just take over the counter stuff and carry on with life, but as we all know, nothing is normal now.  I'll be calling my MO in a little bit.  I really hope it isn't going to delay treatment on Tuesday and I really hope it doesn't end up with a visit to the hospital... blah! ",
      "MessageIndex": 550,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Feb 18, 2014 10:41AM Curlyq1974 wrote: Hi everyone!  I am so grateful to read about port pain.  I thought I was going thru something major, so to see I am not alone was a great relief.  I hope everyone has a great week, minimumal se's and great counts!",
      "MessageIndex": 640,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Apr 10, 2014 01:55PM Curlyq1974 wrote: Augh Desimone!  Sending you prayers and well wishes for you and your mom. ",
      "MessageIndex": 873,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Apr 10, 2014 02:02PM Curlyq1974 wrote: I am SOOOO EXCITED!!!     I know this seems crazy, but Tuesday is my 5th round of chemo.  Do you know what that means???  ONE MORE!!!!  ONE!!! ONE!!!!  It seems like it has been an eternity, but that thought of only having to do this one more time is soooo exciting to me!  My dad is going to my treatment on Tuessday and that just makes me smile and cracks me up.  My dad is a character - I'm sure we will be misbehaving and giggling most of the time.  I cannot wait until my last treatment!  I am wearing my t-shirt that says, \"Cancer, you picked the wrong bitch!\"  and bringing champagne!  What a journey - it has been insane!  I guess i shouldn't start celebrating yet, but I'm just relieved to finally see a light at the end of this god awful long tunnel!",
      "MessageIndex": 874,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Jun 27, 2014 09:16AM Curlyq1974 wrote: belleb - interesting... My hip is just about killing me.  I injured it when I was very young and every so often it flares.  But this flare has been since chemo ended.  I told my husband I wonder if it is arthritis starting.  Now I wonder if it has to do with chemo... hmmmmm.....  My RO told me that anything and everything from this point forward, pain, disease, etc... we can blame on chemo and radiation.  Not happy about that thought - but we do what we have to do.  Wish you all a great weekend!!! ",
      "MessageIndex": 1028,
      "PostDate": "27/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Feb 7, 2014 08:01AM Curlyq1974 wrote: Hi Diamond!  Oycodone is prescribed, and I was shocked when they gave me the prescription.  I thought it was kind of a high powered medicine rarely prescribed, but I guess I was wrong.  I'm jealous of your warm weekend and walk on the beach!  We are expecting 2-4 inches of snow and wind chills below zero!  Enjoy your toes in the sand!  When I get thru treatment, that will be my gift to myself - a vacation to a beach where I can drink those tastey drinks with the umbrella in them :)",
      "MessageIndex": 552,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Mar 27, 2014 09:58AM Curlyq1974 wrote: Chemo round #4 done... 2 to go!  Thank goodness!!  I think that the weather is just wearing on me.  On top of the side effects from chemo.  I just think that being able to sit in the sunshine fighting side effects would be so much better than looking at 30-degree forecasts and snow.  Spring has not sprung in Northeast Ohio.  On the brighter side of things, my Aunt's prophylactic BMX went well and the pathology came back remarkably clear!  HIP HIP Hooray!   My Mom just had her prophylactic BMX and her pathology just came back clear as well!   I sobbed!  I have never been more relieved!  Thank God for not letting my mom have this horrible disease!  She sobbed from guilt that I have the mutation (BRCA 2+) and cancer and she only has the mutation.  Still so relieved and cannot thank God enough!! Need your ladies opinion - this last round of blood work showed my counts the lowest they have been but still in the normal range.  When my general surgeon and plastic surgeon saw me in the waiting room waiting for Mom's surgery to be done they both yelled at me about being in the hospital how dirty and unsafe it is for me.  I work in a hospital in an administrative area.  Work has granted me approval to work from home when I feel bad.  I don't feel bad per se, but think it is unsafe to be there especially after the doctors yelled at me for being with my Mom at her surgery and my blood counts on the lower end of normal.  I feel guilty not physically going to work and working out of the house.  Thoughts?  Best wishes to everyone for minimal side effects.  For those of you wrapping up treatment - I AM SO JEALOUS!!!  And so happy for you at the same time!  Prayers that this is the last time we go thru this fun, but grateful to be sharing with such a strong group of women.  You have no idea how much it helps me to read about you all.  Thank you! ",
      "MessageIndex": 797,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Apr 14, 2014 08:03AM Curlyq1974 wrote: Has anyone had this happen?  This weekend, wasn't feel well.   So, like we have been trained to do, I took my temperature.  It was 102.1... UH OH!!!  Couple minutes later...  101.5...  so I called the doctor who told me to head to the emergency room.  I get there and of course, I no longer have a fever.  WTH!!! Had a ton of blood work, chest xray, pee in a cup, all came back fine so sent home with an all clear.  I just don't understand why I had a temp at home.  Has this happened to anyone else?  I wonder if I just go overheated or something....",
      "MessageIndex": 880,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Mar 28, 2014 08:47AM Curlyq1974 wrote: Desimone, Been there.  Just sometimes everything is so overwhelming.  Cried and cried and cried the other night, no real trigger, just overwhelmed.  Then one of my very dear friends who had no clue I was having a down day posted this, it was meant for her, but it spoke to me too.  This is a tough road.  {{{Hugs}}}!   We will get thru this moment by moment, hour by hour, day by day.  Hope you have a better day today! ",
      "MessageIndex": 808,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Jan 31, 2014 08:45AM Curlyq1974 wrote: Thanks Mor!  My Dad did take me shopping and bought me a bunch of beautiful head scarfs and turbans.  I know is is completely irrational!  It is just the one thing I am caught up on.  I think it might be fear of the unknown - is my head egg-shaped?  Do I have weird marks under my hair?  Who knows - just don't want to look like an alien!!!  I have also noticed that the beautiful, bald women all have pretty dangly earrings.  That is my weekend shopping trip, to pick out some pretty earrings.  I normally just wear simple stud earrings, but a little dangle will be nice. ",
      "MessageIndex": 479,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Mar 27, 2014 09:43AM Curlyq1974 wrote: Welcome SmartassSmurf!   This is a great group to link up with. Bunch of very smart women here who are a great support!  Fingers crossed that your blood work comes back good and you can start the Taxol.  I completely understand wanting to be done and having you heart set on a specific date.  It is like moving Christmas - just isn't the same on another day!!!  Best wishes!!!",
      "MessageIndex": 795,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Apr 21, 2014 12:18PM Curlyq1974 wrote: Yeah Lisaj514!  I am so excited for you!  Two weeks and I will be in the same spot.  I am already an emotional roller coaster thinking about it.  Some days were so long and so hard.  I pray everyday that this chapter of my life is over and never to be repeated!   But in the meantime - you are AWESOME!  Way to go and high fives!  Just remember to take it easy for the next couple of weeks to make sure you last round is not your worst round! ",
      "MessageIndex": 914,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Oct 1, 2015 07:20AM Curlyq1974 wrote: Loveenduresall, I have no words of wisdom. I just wanted you to know I am thinking of you, your wife and children. Prayers for you all during this time. Hopefully someone more knowledgeable than I will be along to provide you some guidance.",
      "MessageIndex": 2,
      "PostDate": "01/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/835409",
      "Title": "Liver failing...Referred to hospice yesterday... Loveenduresall DivineMrsM"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "May 11, 2015 10:31AM Curlyq1974 wrote: Hi Sue, I gained a ton of weight with my BC diagnosis as well.  I was 39 at intial diagnosis.  For me, I had a bunch of things happen at once that caused the weight gain.  First the awful diagnosis, surgery, chemo - which brought on the steroids.  And my oncologist told me to stop running, exercising, etc... I was very very active prior to diagnosis.  He said he wanted me to just love myself and give my body lots of TLC.  Thru chemo, I ate whatever tasted good - which happened to be Mint Chocolate Chip Ice Cream.  The steroids added water weight.  Then I started radiation - and I was told at the onset that I absolutely could not lose weight.  Not a pound!  It would mess up the treatment - AUGH!  Then I had to have a hysterectomy - I have the genetic mutation and needed to get my ovaries out.  Now I have ZERO hormones in my body.  It sort of freaked out on me!!  So here I sit, 17 months after initial diagnosis and still am not allowed to run!  In the midst of reconstruction and the PS asked that I not run.  AUGH!!!  So, I have had to radically change my diet - no more mint chocolate chip ice cream.  :)  I lost some weight - about 10 pounds.  But the rest is going to be a slow go - if ever I lose it... blah :(  I can walk, the PS said I can ride my bike but I am finding that I cannot get the weight off.  I know this next sentence is going to be crazy to read, but I love myself just as I am.  Chubby and all!  I am so grateful for life!  And to feel better - my treatments were very very very hard!  I thought multiple times I was going to die!  Life is good!  Best wishes to you!",
      "MessageIndex": 1,
      "PostDate": "11/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831300",
      "Title": "Weight Gained after 15 Chemo treatments. suesener"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Apr 10, 2014 08:44AM - edited Apr 10, 2014 08:48AM by Curlyq1974 Lilyrose - I am triple negative.  I am 39 years old, will be 40 next week.  I am so sorry you are joining the group, but I am available to help answer any questions you have about my treatment, diagnosis, etc...  I am also BRCA 2+ Hi Ladies!  I just wanted to chime in because I know this is crazy as you all start your chemo journey, but I am so excited for my next round of chemo.  Bet you can hardly believe someone is actually EXCITED about CHEMO!!!   Tuesday will be round #5 of 6 for me and for some reason, I feel like I have finally turned a corner.  I will  only have one left!   ONE!!!   I can see the light at the end of the tunnel and all of this will finally be behind me.  These boards are a god send.  I don't know what I would do without them.  With that said,  just starting the chemo process don't always read the horrible, negative posts.  They will make you crazy with worry.  Take the good advice and ignore the rest.  Things I wish someone would have told me when I started chemo?  Stock up on Kleenex.  By the pocket packets and put them EVERYWHERE!!!  No one told me that hair loss also meant I would be without nose hair, which appearanlty keeps your nose from running.  My nose runs all the time!  I eat, my nose runs.  I walk, my nose runs.  My nose just runs all the time anymore - I miss my nose hair! :)  At first, i thought i was getting a cold.  Nope, just have no nose hair.  who knew! I have pretty much figured out my particular cycle for chemo and for you interested here is what it looks like: Week 1, Tuesday is my infusion.  I eat before my infusion, and mid-way thru to keep the nausea at bay.  Someone does drive me home from the infusion because I am a little loopy with the drugs and my legs are a little wobbly.  Wednesday is an ok day and I get my Neulasta shot.  Thursday is an Ok day, but I start to feel blah.  By Saturday/Sunday the blah feeling is full blown and I just lay low.  I go from bed to the couch back to bed and watch lots of movies.  Just general tired feeling.  Not horrible, just run down.  I also have a leg tick that starts.  My leg shakes like it is restless.  I have learned to ignore it, but it was embaracing at first to sit in meetings at work with a shakey leg.  Week 2 Monday/Tuesday is the start of the dull achy feeling from the Neulasta and that last until about Thursday/Friday.  Still have the shakey leg.   By Saturday/Sunday I start  feeling human again, i stop taking the steroids and anti nausea meds, the shakey leg stops and can pretty much do normal stuff, but I do get tired quick.  Hungry - the steroids make me want to eat the house down.  I have gained 15 pounds.  The doctor is not concerned and warned me I would gain weight.  I am not at all happy about it, but if my body needs a little pudge to fight this shitty disease and keep me around for another 40 years, I'll take the 15 pounds.  Week 3 is the most lovely week of all.  Feel good. I am able to do about 20 minutes of light exercise a day either walking or riding my stationary bike.  Nothing major as the adriamycin is rough on the heart, so trying to just protect it right now.  I also have continued to work full time thru treatment.  I take off for my infusion day, and occasionally i have taken a day off during week 2 because the fatigue is too much.  Other than that, I'm working.  I am no means super woman, my general surgeon told me at my post-op follow up appointment to get on with life.  Don't let this god awful disease rule it.  BEST advice ever and that is what I am doing.  I am living.  I am enjoying everything more.  I am less stressed.  Cancer sucks for so many reasons, but it has been such a blessing to me.  It has put into perspective the things that really are important to me and everything else doesn't matter.  I live for the now.  I enjoy my love ones more.  I care less about the things I cannot control.  It has been such a freeing thing.  Crazy, I know, but cancer has been a blessing to me.   I wish you all the best as you start your journey!  I hope you find your mint chocolate chip ice cream that tastes good for you when you have metal mouth and minimal side effects.  I am available for anyone if have questions or I can do something to help.   Best wishes, Janet",
      "MessageIndex": 104,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "Curlyq1974",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195588/profile",
      "Content": "Apr 10, 2014 09:51AM Curlyq1974 wrote: linda505, trust me, the journey has been looooong.  My attitude has been a roller coaster of emotions.  I do try and have a good time at chemo - whoever is in the infusion room with me, we do laugh about the craziness of this journey.  Most of it is sick and twisted about the side effects.  If I don't laugh, I would cry and I have had my fair share of tears. ",
      "MessageIndex": 107,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    }
  ]
}