{
  "AuthorID": "CurlyG23",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209950/profile",
  "Posts": [
    {
      "AuthorID": "CurlyG23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209950/profile",
      "Content": "Mar 17, 2015 11:00PM CurlyG23 wrote: Leslie, Thanks for the suggestion :) ....I had done the clip in extensions, I got a set of seven in various sizes (though I used mainly the biggest one, a long strip/weft of human hair). I used it the last month or so of chemo & just put my sad little strands over it, but I felt even that looked very obvious...(my hair was thin & frizzy w/out product & the clip extension was SO nice looking...I had to braid the extension at night to give it a kinky/frizzy by morning look to try to blend it better with my hair). Are you talking about the more permanent extensions that people get done professionally & last 3-6 months?...My sister suggested them also...I think I am too scared to try those? ....I feel anything I do breaks a little protocol for PCC...my wig I plan to wear for work covers my head therefore creating some heat, though its mesh & pretty breathable, my old clip in extensions create tension towards the some of the roots...either one is not great for \"babying the hair\" but?....I have four inches of hair everywhere & 6 inches of the little strands I used to have that make it look a TINY bit longer...the problem is, since my hair is curly, & it curls & looks even shorter! it doesn't look at all like 4 or 6 inches ...I have read that you only need about 3 inches of growth to do extensions.....I am just not sure how any extensions will blend w/ my crazy short curls? :/ ....I just feel kinda stuck right now, but I'm trying to think positive I DO feel like playing up the makeup & jewelry helps accentuate the short hair! lol btw....I go back to work teaching on Monday!!! thanks for listening, Lori ",
      "MessageIndex": 261,
      "PostDate": "17/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "CurlyG23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209950/profile",
      "Content": "Apr 8, 2015 09:13PM CurlyG23 wrote: Hi girls, I am 5 wks PFC & have no shedding, since so much broke off :( so I recently broke protocol by straightening it twice a week & I feel it adds more length since I have naturally curly hair which bounces & shortens up. ....I hope my rebel ways don't hurt me in the end? I'll include a few pics of before & after w/ curly & straight short hair....it's hard to get used to...Pardon my late tired midnight pic w/ no makeup & hardly there eyebrows :( one side is shorter so I put it behind my ear... Now that I'm back at work & have started radiation I feel like I never have time to be on these threads anymore :( I do wish all you ladies the best...kick ass! Lori  ",
      "MessageIndex": 281,
      "PostDate": "08/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "CurlyG23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209950/profile",
      "Content": "Mar 5, 2015 02:47AM CurlyG23 wrote: YAY, I can finally join the club/ post here also! ",
      "MessageIndex": 241,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "CurlyG23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209950/profile",
      "Content": "Mar 5, 2015 02:48AM CurlyG23 wrote: ",
      "MessageIndex": 242,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "CurlyG23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209950/profile",
      "Content": "Mar 7, 2015 09:09AM CurlyG23 wrote: Golden Paws & Harrysmom, THANKS! feels good to say I'm done... Hope to see Gatomal on this thread SOON?! So happy have sent those bleepin caps back today...though they didn't work well for me, I recently posted my picture timeline on the on the cold cap thread pg 436...BEWARE, it's kinda scary. I'll post a shorter version here.... I need advice??? 2 things...first, Geralyn had told me it's ok to cut off the random last few long ugly strands...Now that I have a short new do, I'm not as worked about shedding...haven't shed for a few weeks (yet there was HARDLY any hair left to shed)...but, I'm scared to lose my short hairs, which is prob unlikely, (But u never know) SO I plan on following the few months after protocol of \"babying\" the hair with regards to PH/Paraben free shampoo, cold temp etc, but I will use a headband for cuter style when I feel like it, but my question is how often can I shampoo now? every two or three days? I know I need to be gentle, but I just wanna scrub the SH#T out of my scalp!!! I have also bought the nisim FAST shampoo as recommended way earlier on this thread for faster growth from a stylist/member...they make a PH/paraben free version, but I may wait a month or so cuz think it needs to be used daily or at least every 2 days. With curly hair, I've never been a daily washer anyways. Second, has anyone hear of the DIY hair growth masks? most are coconut/Extra virgin/caster oil based mask/ scalp/hair treatments (some recipes have egg, honey, some onion) for hair growth? you leave in for an hour or so (some sleep w/ it overnight) & then wash out....It's all over youtube, & I am very tempted to try it eventually, but not sure when I can put oil/oils on my hair. I have only used bio silk on my length ends & w/ a slick pony tail...I really worry oil & water don't mix, so it may be a pain in the butt to wash out &I'll just look like a big grease ball....ANY ONE have any DIY/home remedies experience w/ this? thanks, Lori  ",
      "MessageIndex": 245,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "CurlyG23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209950/profile",
      "Content": "Mar 16, 2015 03:16PM CurlyG23 wrote: sorry, delayed responses! Ladies, Thanks for the advice on how often to shampoo & the nioxin 4, I know a lot of you use it....I was also curious like JennJdance about the PH & sulfate content...I use the liquid silica & biotin also...It's been kinda hard getting used to the extremely short new do, but I'm dealing w/ it! Hope it grows as fast as my Pre-chemo hair did! Kim, Again, CONGRATS! good to see you here rocking that shirt & full head of hair! Don't you love the freezer space back? I DO!!! lol ",
      "MessageIndex": 258,
      "PostDate": "16/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    },
    {
      "AuthorID": "CurlyG23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209950/profile",
      "Content": "Mar 19, 2015 09:07PM CurlyG23 wrote: Leslie, Thanks! I see now what you're talking about...My mom actually told me a few months ago that her hairdresser's salon has a girl who heard my story & specializes in those more permanent 6 month hair extensions (sewn in & glue/tape)...I never considered it until now, but I think in the end I am quite scared. I've only read a little bit from people who have done it (I still need to do more research though) & say that it can really damage what growing hair one does have & with us needing to be so delicate/not pull & tug on it I just am a bit hesitant, & am not sure of the cost 400-700 IF that? I spent so much $ on the cold caps...I did recently find out PCC is going to refund me my last month's fee 633, which I'm thankful for, but is tiny in comparison to what I paid total :( JennJ, Sorry to hear the big scare with the Nioxin 4 shedding....thats why I was scared to start too, i though I'd wait even though I'm not shedding & it's only been 2 wks out for me...Hopefully it was a one time thing, or maybe you can wait another four weeks or so to try it....I know I sure am eager to have mine grow...this week I am trying the oil/hair mask inversion method to grow an inch in a month VS 1/2 an inch of normal growth...I'll keep you posted! :) Lori ",
      "MessageIndex": 265,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819973",
      "Title": "Life After Cold Caps: a place for ex-cold-cappers to share OneTexasDay angiepie"
    }
  ]
}