{
  "AuthorID": "cyano",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
  "Posts": [
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Aug 15, 2012 06:47AM cyano wrote: My hair fell out in large clumps about a week after the first round. However, I was in the hospital then with neutropenia which probably sped things up. I didn't lose all of my hair. I have bald patches and patches of hair which are thin. I have round 3 tomorrow and I have stubble in the bald batches. I cut my hair in a pixie and the hair which didn't fall out has grown. My hair is naturally curly so the thin hair stands up vertically about 4 inches in every which direction. So I have a spectacularly bad hair do. Think patchy Albert Einstein. In real life, I am a mad scientist so it's pretty funny. Having some hair is good with the bandanna because I can spread it out where it sticks out under the bandanna and it looks like I do have hair.",
      "MessageIndex": 707,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jun 23, 2012 08:02PM cyano wrote:",
      "MessageIndex": 22,
      "PostDate": "23/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jun 30, 2012 12:41PM - edited Jun 30, 2012 12:52PM by cyano I started T/C on Thursday. I have good arm veins from rock climbing so no port for now. (Onco said no climbing - too high of risk of infection ). A few hours of  nausea Thursday night and yesterday in the periods between when the Kytril wore off and when I could take the next dose. A bit tired  and dry eyes but otherwise feeling good. Slept in a bit in the morning yesterday and went to work late. Got in a short hike to a viewpoint looking out at the mountains after work which refreshed the spirits. I'm sure the next few days will be harder, but it's been a good start. Also, I don't think I'll wear my contacts to the next appointment. One bonus with chemo is that I also have colitis that has never gone into remission even after trying many different treatments. The steroids given with the chemo are at a much higher dose than my gastro will give and for the first time in 8 years I have have no D, no cramping and the mouth sores have mostly disappeared. This might not last, but I'll enjoy it while it's here.",
      "MessageIndex": 82,
      "PostDate": "30/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 1, 2012 10:46PM cyano wrote: Lifeonitsside - good to hear about the kids; I didn't ask my dr. because I was afraid she might say no. I do the toddler thing on Sunday and I do science with the Boys+Girls club another couple mornings a week. I don't have kids of my own so I really enjoy my time to \"borrow\" kids. Part of my job is microbiology so I might be overparanoid.",
      "MessageIndex": 98,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 14, 2012 04:51AM cyano wrote: Two weeks out and feeling SOOO much better. Actually really good. The hospital stay knocked me for a bit of a loop, but I'll get neupogen next time so the counts shouldn't go so low. I finished one antibiotic tonight, metronidazole, and I finish the cipro tomorrow. I started back on a bit of solid food yesterday which really helped too. In 5 days, my blood counts will be measured again and I'll find out if I'm allowed to leave the house and go back to work. In a way, the rough start has been good. I live alone, my closest family is about 1500 miles away and I'm pretty independent. I have been tremendously blessed by friends who have run errands for me, gone grocery shopping, called, etc. and I've learned to rely on others a bit more.",
      "MessageIndex": 225,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 15, 2012 01:47AM - edited Jul 15, 2012 01:55AM by cyano Ellendou - I just noticed that you are from Alberta. I grew up in Calgary and lived there until I was 25. I have a job in CA and I actually miss the snow. I fly up every Christmas to see my parents and ski/snowshoe/play in the snow. Hope you continue to do well tomorrow.",
      "MessageIndex": 239,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 19, 2012 12:57PM - edited Jul 19, 2012 12:59PM by cyano I found a lot of cute hats/scarves/bandannas on Etsy.I just searched under chemo hat or chemo scarf.For example: http://www.etsy.com/search?q=chemo%20hat&view_type=gallery&ship_to=ZZ&min=0&max=0&ref=auto3 Because everything is handmade, in a couple of cases I was able to email the person making them and get a different color or size. My hair fell out like crazy for a while and then just stopped. Now it's thin, but still hanging in there after 3 weeks which is surprising for TC. I'm sure the rest will go the next round. I volunteered at the Boys+Girls club this morning and several of the kids said they liked the hat.",
      "MessageIndex": 342,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 24, 2012 10:56PM - edited Jul 24, 2012 11:04PM by cyano CityFi - my eyes burn/water and I had a sore/mild bloody nose. The nose healed completely in about 2 weeks and artificial tears are reducing the eye symptoms. It's funny that eye drops help watery eyes, but I think the tears help flush things out. I think part of the problem was wearing my contacts during chemo which trapped the chemo that's excreted in the tears under the lenses. sammy0345 I too had muscle pain on days 3/4 and then got a bowel infection on day 6 and I spent 3 days isolation in the hospital with severe diarrhea, vomiting and pain then 10 days in isolation at home. I went on clear liquids for a full week, then ensure/boost for a week and now I'm eating a low residue diet. I also am taking high doses of probiotics (VSL#3 - expensive but well reviewed in medical literature). The simple diet, antibiotics and probiotics have really helped and now I'm 4 weeks out from chemo and feeling good. I even went for an easy 45 minute hike this morning. If you'd like any info about a low residue diet, if you don't have it from the doctor, or the probiotics, let me know. I also have severe colitis which does make me more susceptible to bowel infections. PAeagles - I'm with you there. I've had people ask how things went and when I say that I had a bit of rough go the first round, I'm told that I need to stay postive and not focus on the negative. It frustrates me - they're not listening. Yes - I'm positive. Yes - the prognosis is good and I'm doing the right thing, but that doesn't make it any easier and having someone let me vent and then move on helps. Anyways, my white blood counts are 3.8 which is a slightly lower than the magic number of 4, but my oncologist gave me the go ahead to do chemo tomorrow rather than wait another week and make it 5 weeks between treatments. It's good to get it done, but I'm somewhat nervous with the tough time I had with round 1.",
      "MessageIndex": 408,
      "PostDate": "24/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 27, 2012 08:44PM cyano wrote:",
      "MessageIndex": 440,
      "PostDate": "27/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Aug 14, 2012 07:10AM cyano wrote: dventi - both rounds of TC so far I've had a sore throat and scratchy nose for about 5 days.",
      "MessageIndex": 686,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Sep 29, 2012 11:04PM - edited Sep 29, 2012 11:20PM by cyano Stride - I think being able to maintain physical capacity during chemo really depends on how your individual body reacts to the chemo.  I was in very good physical shape before surgery/starting chemo. I was running about a 7:40 minute mile and up to an hour 3-4 times a week. I was hiking up to 20 miles on Saturdays and I was rock climbing at an advanced level. I had considerable muscle pain during chemo that seemed to be due to the taxotere. Shortness of breath is also a big problem. I'm pretty sure that my quads are now some flavor of jello. My oncologist is unconcerned and said that these are common side effects. I finished chemo almost 4 weeks ago and things are slowly getting better. I walked 3/4 of a mile tonight on a flat route and wasn't wheezing. I ran 1/4 mile at 12 minute pace. last Wed. It's frustrating having lost hard-won fitness, but I'm hopeful that it will come back over time. I also wonder how much of the SOB and fatigue is due to anemia.",
      "MessageIndex": 1107,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 1, 2012 08:53PM cyano wrote: Today's a bit rougher, but still not bad. I have a mild headache, muscle aches and sore throat. Not sure whether it's the start of a cold or from the T/C. Time will tell. I ran the toddler group at church this morning with a warning to all parents that there will be absolutely no toddlers with sniffles accepted for the next 4 months. I made sure to bleach everything and hand wash everyone. I'm hoping to keep running the program; I love the little guys. I had a nap this afternoon and then went out to dinner with a friend.",
      "MessageIndex": 94,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 8, 2012 06:17AM - edited Jul 9, 2012 06:14AM by cyano I'm back home!! Neupogen works wonders. My white blood cell count went from 0.2 to 1.0 in a day. They never did find the source of the infection, but I did have a severe colitis flare up 5 days after chemo which may actually have been a gastro illness and not colitis. Little by little I'm learning to take it easy. I'm going to have to lay off running for a while. I'm super tired still and a bit weak after eating nothing but clear liquids for 5 days. Fortunately, I love jello. Hopefully some solids tomorrow. Mouthsores but that's expected with the low counts.  And an anal fissure from the gastro problems. Not looking forward to the next round, but I'm sure my onco will take work to prevent this happening again. For those who are just starting, my oncologist says that the risk of hospitalization for neutropenia with T/C chemo is <5%.",
      "MessageIndex": 145,
      "PostDate": "08/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 8, 2012 09:12PM cyano wrote: Gatorade and other sports drinks are better when drinking large volumes of fluids because they replace your electrolytes as well as water. If you drink just water or gingerale, your sodium, potassium, etc. levels can drop. Some ginger ale and water is fine or if you like you can eat some salty snacks like crackers or pretzels for sodium and bananas for the potassium.",
      "MessageIndex": 158,
      "PostDate": "08/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 9, 2012 12:25PM cyano wrote: Lisa - day 4 was the hardest for me with feeling like I had the flu and then I woke up way less achey with more energy on day 5. I think if I hadn't been hit with a stomache bug/neutropenia on days 6-8 I would have been feeling really quite good. And I think what happened was pretty unusual.  I'm only 10 days out, but my hair started falling out like crazy yesterday. I think that's early, but getting sick might  have speeded it up. My hairstylist was going to come by my house on Thursday. My hair is about 15 inches long and is making quite a mess so I decided to just cut it myself. I did about a 4-5 inch layered page boy and it turned out cute. I never thought I could cut hair so this was a good time to start.",
      "MessageIndex": 161,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 19, 2012 08:05AM cyano wrote: Winter flower - also some food that's easy on the tummy and water/gatorade. They may have it there, but it's nice to have your own comfort food. I had an appointment with my oncologist today. My white blood counts had climbed all the way back to 2.9, but she wants to delay my second round of chemo by a week to let the counts go a bit higher so that I don't risk going so low again. The insurance approved neulasta which should help too. I don't mind having another week to recover. I'm getting my strength back and finally went for a run again. I ran a 1/4 mile and walked a couple of miles. ",
      "MessageIndex": 326,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 27, 2012 12:26AM cyano wrote: Round 2 was yesterday. The oncologist dropped my chemo dose by 15% and so far things are much better. I had some nausea last night and I took a kytril which got rid of it completely. I had NO nausea today. A bit of a tummy ache today, but tums took care of that. I didn't wear my contacts and I have been flushing my eyes so almost no eye discomfort. I have so much more energy than day 2 last time and went for a short trail run this morning which felt great. Then I had the neulasta shot this afternoon. Hopefully, the neulasta shot and the lower chemo dose will keep making things easier than last time.",
      "MessageIndex": 431,
      "PostDate": "27/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 27, 2012 09:38PM cyano wrote: Marianne - all the best with the cut. Losing the hair is hard.",
      "MessageIndex": 442,
      "PostDate": "27/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 28, 2012 07:18PM cyano wrote: Agreed - Lifeonitsside - those are fantastic photos and it won't be long before you're back to where you were. Well - Neulasta so far is absolutely amazing. I feel SOOOO much better than I did at this time last round. I woke up with energy and I'm going for a run after breakfast. No feeling like I have the flu, tummy problems, mouth sores or thrush or anything. Just a bit of dry eyes and a mild sore throat. There may be some rough days next week when the white blood counts drop for a few days, but so far, this is much, much more doable.",
      "MessageIndex": 450,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Aug 22, 2012 01:57PM cyano wrote: Hugs Ann (and all). Lots of people having tough times.  I had round 3 a week ago. I had less nausea, but a lot worse heartburn and muscle aches. I can't do much about either of these. I'm on a restricted diet for colitis. My gastroenterologist said no colitis drugs until I finish chemo. So I'm allowed white rice, peeled potatoes, bananas, fish and liquids. I can't take NSAIDs, tylenol or heartburn meds because they are colitis triggers.  But here's the good part. My symptoms lasted way shorter this time. By yesterday, I was feeling completely back to normal.  I went for a very short run this morning which felt soooo good.",
      "MessageIndex": 772,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 6, 2012 11:08PM cyano wrote:",
      "MessageIndex": 132,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jul 15, 2012 08:18AM - edited Jul 15, 2012 08:24AM by cyano I'm in San Luis Obispo which is near the coast 1/2 way between LA and San. Fran. No complaints about the weather.",
      "MessageIndex": 241,
      "PostDate": "15/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Aug 14, 2012 07:08AM cyano wrote: MaddyMac,  Here's a big hug. Sorry you're feeling alone. Just know that you have a whole family here. For the thrush, ask your oncologist for magic mouthwash with nystatin. It cleared up thrush fairly quickly for me. I also started taking probiotics again (check with your oncologist if s/he is ok with probiotics).",
      "MessageIndex": 685,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Aug 15, 2012 07:17PM cyano wrote: PinkyWi -neutropenia is when you have very low neutophil counts. Neutrophils are a type of white blood cell that fights infection. Mine got very, very low at the same time as I picked up a stomache bug so I couldn't fight off the infection. The solution was strong antibiotics, neulasta and isolation to avoid picking up another infection. I now get neulasta every time I do chemo which has made a HUGE difference in how I feel. PAEaglesFan - sorry to hear about the car accident.You definitely don't need any added stress right now!",
      "MessageIndex": 718,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Sep 6, 2012 03:17PM cyano wrote: Yay!! I'm done chemo. :) :) My oncologist has been out for several months due to family problems and the last few times I saw the physician's assistant. The PA said that I absolutely needed 6 rounds of chemo. When I saw the oncologist yesterday, she said no way. 4 rounds of TC are standard for my stage/type and more rounds show no benefit with just increased side effects. So that was a nice surprise. I'll go onto tamoxifen in a month. I took vitamin B6 throughout to minimize the chances of neuropathy and hand/foot syndrome and so far, so good. I've had a lot of side effects, but I have colitis/very restricted diet so that doesn't help. I'm really hoping to get my fitness partway back so I can ski with family at Christmas. Even if I can just read a book in the lodge in the morning and ski for a couple hours in the afternoon, that would be great. I just need to get rid of the lead-filled legs and get my cardio back.",
      "MessageIndex": 902,
      "PostDate": "06/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jun 17, 2012 03:03PM cyano wrote: I'm Stage 1 and Grade 1 with 95%ER and 80% PR, but the Oncotype came out as 26. I meet with the oncologist on Wed.",
      "MessageIndex": 171,
      "PostDate": "17/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jun 10, 2012 09:17PM cyano wrote: I love to rock climb and I'm just under 3 weeks out from a SMX. I was surprised that I have some shape from the pec muscle given than I'm thin. Some of it is swelling, but there's a definite muscle mound. It will be a while before I'm back climbing again, so I'll probably lose most of that, but it will be interesting to see what happens when I start back up again.",
      "MessageIndex": 8,
      "PostDate": "10/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/788853",
      "Title": "Muscle tone for the flat-chested nibbana coraleliz"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jun 26, 2014 05:06AM - edited Jun 26, 2014 05:07AM by cyano I had a unilateral mx with SNB, no reconstruction as an outpatient. In at 9:30, back at the hotel by 3. It was good to be able to sleep in a quiet bed without being woken up by nurses and less chance of infection. No pain medication was necessary and I was able to go for a slow two mile walk the next day.",
      "MessageIndex": 18,
      "PostDate": "26/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821693",
      "Title": "Outpatient Masectomy? Pandabear cyano"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "cyano wrote: I had a unilateral mastectomy last week with no reconstruction which went really well. My BS gave me the go ahead to start working out again (building up carefully). I went for a short run yesterday which felt great. I'm hoping to get my arm mobility back and start swimming by the end of the month and so I need a new swimsuit. I love body surfing and eventually when I'm well-healed I plan to get back into it. The problem is that all of the mastectomy swimsuits I've seen don't look like they could hold together in the waves. I don't know that I'd feel comfortable at the beach totally flat on just one side, yet I'm sure I'd lose any breast forms in the surf. I also would need something sturdy enough that the straps wouldn't wash down. What to buy?? Dx 4/2012, IDC, 1cm, Stage IA, Grade 1, 0/1 nodes, ER+/PR+, HER2- Surgery 5/25/2012 Lymph node removal: Left, Sentinel; Mastectomy: Left Chemotherapy 6/27/2012 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Hormonal Therapy 10/3/2012 Surgery 8/27/2013 Prophylactic ovary removal Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/788409",
      "Title": "swimsuit for active sports cyano Sian65"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jun 8, 2012 03:23AM cyano wrote: Thanks all for the great ideas. If I had a BMX, I'd go flat, but I don't want to look lopsided. I looked at the suggested suits and lots of good choices. Sewing in a form or a scrunchie is a great idea. I actually haven't heard of tieing in a ribbon between the straps and I can see that would really help. I got tossed hard when I caught too big of a wave last year and when I got to shore to catch my breath and stood up out of the water on a very crowded beach, I realised my suit top had been washed down. I guess that is 50% less of a problem now. :) Sian65 thanks too for the suggestions about training. I've noticed that running with a tight bra actually decreases the swelling, but when I work on my range of motion I get swelling in the armpit.",
      "MessageIndex": 6,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/788409",
      "Title": "swimsuit for active sports cyano Sian65"
    },
    {
      "AuthorID": "cyano",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153085/profile",
      "Content": "Jun 9, 2012 03:47AM cyano wrote: I have been pretty swamped with work and haven't had time to figure out all of the abbreviations on the board or how to put the info under my messages. It's invasive ductal carcinoma. Stage 1A and 1.8 cm. Just a sentinel lymph node dissection at the same time as the mastectomy and 0/1 nodes positive. It's ER+/PR+ and HER2 is unclear so more tests are being run. I have two weeks before a decision is made about chemo so I've been wanting to get back in shape before then. Today was a good lesson in that I completely bonked on a run (another thread) so I realised I need to back off and be patient. I so want to be in the surf this summer, but I guess it's better to look at the long-term perspective in that if I wait now and heal properly, I may have many more summers to play in the ocean.",
      "MessageIndex": 8,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/788409",
      "Title": "swimsuit for active sports cyano Sian65"
    }
  ]
}