{
  "AuthorID": "Cydney",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49608/profile",
  "Posts": [
    {
      "AuthorID": "Cydney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49608/profile",
      "Content": "Cydney wrote: OK, it's probably nothing - and I didn't know who to ask - so I thought I check it out here first.  I am getting this tightening in the breast area where my mastectomy was.  My surgery was 9 days ago.  They removed the drains 4 days ago.  It feels like when you have a mammogram and they tighten the machine down really far.  This has been happening ever since surgery - but at first it was mostly when I felt \"jolted\" like riding in a car and hitting a pothole.  I figured my body was overcompensating and \"pulling all the muscles in.\"  Then I realized there are no muscles there.  If I put my hand on the area when I feel the tightening I can feel hard bands.  If I keep pressure on the area it seems to help it relax faster.  I also have been using cold packs. The severity of the associated pain is decreasing, but the frequency is increasing.  Also, my skin in the area is dusky, like when I had radiation.  This isn't in the incision area - it's below in the prior breast fold area.  My skin is sensitive there as well, so I've been putting cream on it like I did when I had radiation. Which of the various docs/nurse on the \"team\" do I ask about this? Live Boldly, Laugh Often Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731802",
      "Title": "Weird feelings in surgery area - normal? Cydney Joyceska"
    },
    {
      "AuthorID": "Cydney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49608/profile",
      "Content": "Apr 2, 2009 04:27PM Cydney wrote: Thanks Nancy and Alo, I called the breast surgeon and he thinks it's the underlying muscle firing incorrectly.  And he agreed with you Nancy that the prior radiation might have caused different than normal reactions in the muscle.  He suggested motrin, heat and rest. Alo, I was getting the \"letting down\" feeling just before I was diagnosed - I wondered if it was related as I am 10 years post menopause.",
      "MessageIndex": 3,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731802",
      "Title": "Weird feelings in surgery area - normal? Cydney Joyceska"
    },
    {
      "AuthorID": "Cydney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49608/profile",
      "Content": "Aug 19, 2007 03:24PM Cydney wrote:",
      "MessageIndex": 1,
      "PostDate": "19/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/680368",
      "Title": "chest soreness during radiation treatments shirleyb Shirlann"
    },
    {
      "AuthorID": "Cydney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49608/profile",
      "Content": "Mar 30, 2009 09:48PM Cydney wrote: Laurie & Tara -  I think it's so good that you can get in touch with that dark freaky side.  Too often we're pushed to be \"good.\"  I had my mascetomy exactly a week ago.  I know the why of it all and celebrate  the courage to take positive steps to LIVE - but I also mourn that part of me, my cute boobie - lost. Here is a great place to freak out, cause our sisters here are accepting of us in all the good, bad, and ugly feelings we have and give love, hugs, laughs, and true understanding back. I walk along side of you both - you are in my thoughts and good wishes.  Please keep me in yours. ",
      "MessageIndex": 17,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731566",
      "Title": "OMG-it hit me today-HARD! TCGGal faithandprayers"
    },
    {
      "AuthorID": "Cydney",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49608/profile",
      "Content": "May 21, 2012 11:18AM Cydney wrote: Hi, I'm long absent from the boards, but I'm a uni-boob.  I was a 34DD - still am on one side - so forms help me not feel so lop sided.    Anyway, I just got back from a vacation to St. John.  I had never used a commercial swim form before - I just used a homemade insert in my backyard pool.  Because this was a big deal vacation, I decided I needed big deal forms.  I bought a Jodee 92 lightweight swim form.  It is silicone and had an open pocket in the back to make it lighter.  I also ordered a Trulife 630 AquaFlow Swim form.  Although I ordered them about 6 weeks before vacation, only the Jodee showed up.  I used it all vacation long in two different suits.  It worked really well.  It filled out my suit, didn't look lumpy or odd.  Even my husband said it looked \"normal.\" The Trulife showed up while we were gone.  I tried it this week.  I don't like it nearly as much.  It tends to lump up and spread unevenly when I get out of the pool.  Somehow \"adjusting my boob\" isn't what I want to do when getting out of the water.   I realize I'm kind of large, but just wanted to give you my review of these two forms.   I purchased them over the internet. The fit charts were very accurate. I had some bad experiences with fitters in person.  I've kind of shyed away from going to fitters. I've become a good reader of fit charts.  ",
      "MessageIndex": 14,
      "PostDate": "21/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/785876",
      "Title": "Best form for swimming ??? TAPPY ca1160"
    }
  ]
}