{
  "AuthorID": "cydsong",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132926/profile",
  "Posts": [{
    "AuthorID": "cydsong",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132926/profile",
    "Content": "Aug 8, 2011 05:04AM cydsong wrote: Jessamine:  I am new to this site, but was so glad to find this forum about chronic health issues & breast cancer. I, too, live in the SF Bay Area (Alameda & Contra Costa Co.), and it makes me so angry that our b.c. numbers are so high!  I am sort of freaking out about having to go through chemo.  I had a bi-lateral mast. on 6/29/11, and am doing well as far as that goes; but, I was totally freaked out when my onco recommended a chemo protocol called Dose Dense (DD), which is given in 2 week cycles instead of the usual 3.  The drugs are AC-T; nasty stuff!  According to very reputable resources, DD can be harder on the patient and can have more profound short and long-term side effects, including a chance of getting a fatal leukemia anywhere from 5-30 years after treatment!  Also, it has a high probability of giving patients neuropathy, something I already suffer from with my FMS and other chronic health/pain issues. Needless to say, I told my doctor I wanted some alternatives to DD.  One she gave me is CMF, the more standard 3 week treatment.  I have to let her know by Aug. 15.  I will start treatment sometime beginning of Sept. I have considered using medical marijuana in the past for my chronic pain issues.  All of my doctors (Kaiser) agree that it is certainly an option, but my psychiatrist (see him for meds.) and therapist have concerns about anxiety, because I have a history of anxiety disorder & agoraphobia, which I've had under control for years.  I dont' think my Kasier doctors can authorize me getting the card for using med. marijuana, but I am nevertheless looking into it.  I've been told that if I get anxiety, it will lessen over time, and (believe it or not!) that if I feel anxious when using it, to smell a peach!  (Yep, that's right ... a peach!)  So I think I am going to go ahead and get my card, just to have it in case the chemo hits me hard.  I even know someone who knows distributors who will deliver to the house, which will probably be necessary if I'm feeling lousy from the chemo. The other thing is that pill that I will have to take for 5-10 years; it is known to have a very common side effect of joint and muscle pain.  Just what I need, more FMS symptoms!  That is another reason why I'm considering the med. mariuana.  Like you, I would like to hear from other FMS patients re: their experiences with b.c. treatments.  I notiice your post is from some time ago; I hope you are hanging in there and doing well.  If you can, I'd like to hear how things are going for you.  Nice to meet you!",
    "MessageIndex": 472,
    "PostDate": "08/08/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
    "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
  }]
}