{
  "AuthorID": "Cydz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
  "Posts": [
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Nov 14, 2011 09:25AM - edited Nov 14, 2011 09:29AM by Cydz Amazing grass wheat grass tablets. these happen to be gluten free and vegan. These came from Whole Foods.",
      "MessageIndex": 2,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777969",
      "Title": "Wheat grass and chemo side effects Cydz Cydz"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Cydz wrote: Recently, after being a stage 2 triple neg for 2.5 years, I got the big bump up a couple of stages with masses in my lungs and liver. Certainly not happy about this, but trying to retain some control of my out-of-control life. After this second dx, I consulted my natropath who said the best thing to do was a bit of detox, including alot of wheat grass. She wanted me to juice wheat grass, but instead I found the fresh frozen little cubes at Whole Foods. Well I have been popping these for about a month along with a super foods green drink. None of this tastes all that great but my dr told me the drink is the single most important thing I can do for myself, so I just slug it down. Two weeks ago I had my first round of cisplatin, and I was dreading it as I have heard how hard it is on the body, but so far so good. I have had minimal SE's and am knocking on wood. I also take blue-green algae and wheat grass tablets. I was concerned about these nutrients interfering with the chemo so I went on Sloan Ketterings Herbal website and did a bit of research. I was thrilled to see that not only does wheat grass not interfere but suggests that wheat grass is actually helpful in reducing the drop in wbc. I feel like this is working for me. If anyone is interested I have included a link to this page at Sloan-Kettering. I have also notice better blood pressure results!  http://www.mskcc.org/mskcc/html/69419.cfm BRCA1+ Recon with TE 5/28/10 Exchange surgery completed 9/1/10 dx with stage 1 melanoma 6/09 Prophylactic oophorectomy 12/10 Dx 4/13/2009, IDC, 3cm, Grade 3, 0/1 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777969",
      "Title": "Wheat grass and chemo side effects Cydz Cydz"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Jul 19, 2010 11:08PM - edited Jul 19, 2010 11:20PM by Cydz Take you daughter to a dermatologist right away. I am a melanoma survivor as well as a bc survivor. If it is something, they will need to take care of it soon. The only options for early stage melanoma is surgery. There is no chemo until it is advanced. Eileen is right on with the \"trained eye\" of a dermatologist! They are trained to spot things, ironically my dermatologist looked at my melanoma and said I don't think it is melanoma but I can't know without a pathology report. Thank goodness she did it saved my life! You were wise to not let the gyn lance it or do any removal. I will keep you and your daughter in my thoughts and pray for benign results. Please keep us all posted!",
      "MessageIndex": 11,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755532",
      "Title": "melanoma on the breast elleith elleith"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Jul 19, 2010 11:23PM - edited Jul 20, 2010 02:26AM by Cydz feel free to PM me if there is anything else I can answer for you! Best of luck! I should add too, that I AM FINE too, and people do fine if it is melanoma. It does just need to be dealt with immediately.",
      "MessageIndex": 12,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/755532",
      "Title": "melanoma on the breast elleith elleith"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Dec 8, 2010 04:32PM Cydz wrote: I was having severe shoulder pain that started about 7 months after my mx and 2 months after finishing chemo. It went on for quite awhile, even had a bone scan in there, but there was nothing not even any arthritic areas. I was dx with being vit d deficient and started megadosing the d. I now have no shoulder pain at all, my range of motion is back to normal. I read some other threads here about how vit d helped joint issues etc. It may be worth a search, but I am swearing by the vit d. I am taking 5500 IU per day. Hope this helps.",
      "MessageIndex": 7,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761635",
      "Title": "Frozen Shoulder stacey2275 brca1953"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "May 26, 2011 11:47PM Cydz wrote: I have had shingles twice. The first time I had no rash at all but the severe burning pain that traveled all over my body following the nerve lines, very bizarre. This was along with a severe headache. The second time I had them, I just had one area on my thigh with a rash. Mine looked just like chicken pox, but the pain was so severe that I could hardly walk. I agree, I would rather go through again!! Worst pain ever!!",
      "MessageIndex": 107,
      "PostDate": "26/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768149",
      "Title": "Shingles >:-( lago Teka"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Apr 20, 2010 09:42PM Cydz wrote: Hi Mary, I do. It is not constant and really is if I try to lift my arms over my head. My left arm, which was my mastectomy side, feels like I have a rotator cuff injury. I had one several years ago. They do get better after a hot shower. I am just surprised that it is 6+ months out and I am experiencing this. When I was going through treatments, I had alot of bone pain from the taxol. But this is different. Almost seems like maybe damaged cartilage.",
      "MessageIndex": 7,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751115",
      "Title": "Joint pain following chemotherapy MaryNY MaryNY"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Jan 6, 2011 01:21PM Cydz wrote: You are so wise to fight. I wish I had been as wise as you. The area where my tumor developed was in exactly what you are describing. A very dense area, that I had looked at the the age of 24 by mammogram, ( I was dx at 50). So dense, in fact that nothing could be felt until it was larger, 3.2 cm., and I was a religious self-examiner. Yes, we are our own and sometimes only advocates. But, we are our BEST advocates. We are talking about our lives here!!!",
      "MessageIndex": 3,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/762967",
      "Title": "Got what I wanted...but had to fight!! SarahsMom msippiqueen"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Jul 7, 2012 11:25AM Cydz wrote: I have a question. Had scans on Thurs, results showed lesions in liver had shrunk but lung lesions have increased slightly. We are talking millimeters on the lung lesions one only increasing by 1 millimeter and another by about 5-6 millimeters. This second one has almost doubled in size. Here's what I don't understand. My oncologist said these things can flucuate and she is not concerned about them and the big picture is that the lesions in my liver are responding beautifully to treatment. I guess I don't get how doubling in size can be not anything to be concerned about. When they shrunk that much we were all thrilled. I do know that things can get bigger before they get smaller, but the doubling part is what has me concerned. Anyone have any experience like this? thanks",
      "MessageIndex": 34,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787979",
      "Title": "Lung mets sallyyy Cydz"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Oct 20, 2010 08:53PM Cydz wrote: Mine hurt too.",
      "MessageIndex": 6,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759611",
      "Title": "everyone keeps telling me cancer doesn't hurt. is that true? jbarna Halah"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Apr 20, 2010 09:20PM Cydz wrote: I did 4 rounds of A/C followed by 4 rounds of Taxol. I finished my treatments on Oct.13th. In about January, I started having quite a bit of trouble with my shoulders. A bone scan confirmed that it was not mets. My understanding is this stuff is so toxic it just wreaks havoc on your body. I hope eventually that this will subside. Anyone else have trouble specifically with shoulders?",
      "MessageIndex": 5,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751115",
      "Title": "Joint pain following chemotherapy MaryNY MaryNY"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Jan 13, 2011 02:53AM Cydz wrote: Kro30, I was dx with melanoma a month after my bc dx. I understand they are the same \"pedigree\". I just figure at that point in my life, my body was determined to grow cancer, and my immune system was asleep at the wheel. I hope your mother is doing well. ",
      "MessageIndex": 4,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/763191",
      "Title": "My New Years Resolution kro30 kro30"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Jan 10, 2011 06:42PM Cydz wrote: Good for you! I was pondering the same thing very recently, how I should come on more often too, for the very same reasons you sited. It is so comforting for the newly diagnosed to get some words of encouragement from those who have walked the same path. I am almost two years out, dx 4/09 and you are so right, there is light at the end of the tunnel. I will also make myself more available!",
      "MessageIndex": 1,
      "PostDate": "10/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/763191",
      "Title": "My New Years Resolution kro30 kro30"
    },
    {
      "AuthorID": "Cydz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100705/profile",
      "Content": "Aug 21, 2010 02:53PM Cydz wrote: I have had shingles twice and understand that it is an auto immune issue as well. I have also had melanoma (dx between my mx and the start of chemo last year!) My oncologist said breast cancer and melanoma have the same \"pedigree\" and women with breast cancer are at a higher risk for it. I wonder if it is the other way around as well. If you have melanoma, you can be predisposed to bc. In my case, they were neck and neck, so I feel as if a cancer \"switch\" was flipped and there they were. I am also brca 1 and can trace the bad gene down from my paternal grandmother. She had bc and oc. My dad had pancreatic and liver cancer. One of my dad's brothers had esophageal cancer, another RA and another Multipled Sclerosis, more autoimmune diseases. In my mind, there is a distinct connection between autoimmune disorders and cancer.",
      "MessageIndex": 27,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    }
  ]
}