{
  "AuthorID": "CyndieM",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57436/profile",
  "Posts": [
    {
      "AuthorID": "CyndieM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57436/profile",
      "Content": "Oct 20, 2007 02:58AM CyndieM wrote: What a great topic!!! I had a modified radical bi-lateral mastectomy in Jan of this year - then the chemo and rads... and my surgeon was extremely supportive - I had BC in left breast and we did a prophylactic on the right - they found a benign tumour in it anyway.... I have made the decision not to have a reconstruction at this time, I was a 36F, so am absolutely happy at being boob-free. I have the Amoena prosthesis, and have only just got them a couple of weeks ago, and am extremely happy with them - I can pretty much choose if I want to wear them or not. Although I am pretty much wearing them mainly to work - as soon as I get home in the evening - they are off!!! Exercise is definitely the key in getting the lymph nodes re-distributing - it has made a big difference for me. Hugs Cynthia",
      "MessageIndex": 82,
      "PostDate": "20/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "CyndieM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57436/profile",
      "Content": "Oct 14, 2007 05:07AM CyndieM wrote: Hi Sue, It's great to hear that you are up and about - life does go on. I was the same - although it took a little longer for me as I had a double mast. But here I am 9 months later and through the other side!!! I think you are about 7 hours behind Oz. Love Cyndie",
      "MessageIndex": 429,
      "PostDate": "14/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "CyndieM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57436/profile",
      "Content": "Nov 19, 2007 03:33AM CyndieM wrote: Hi Sue, I'm so glad to hear that you are feeling better. I found that sucking on ice chips whilst I was having the chemo infusions really helpful in preventing mouth ulcers. They really made a huge difference. That and avoiding I have loved catching up on your posts - they have really made me smile today - I really needed it!!! hugs & kisses from the land down under!!!",
      "MessageIndex": 1077,
      "PostDate": "19/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "CyndieM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57436/profile",
      "Content": "Oct 11, 2007 04:34AM CyndieM wrote: Hi, Just a thought - when I had my bi-lateral mastectomy, I was still pretty ga-ga for a couple of days on the pain meds - I know that they will probably have a couple of drains in place as well, so Sue will be feeling a little out of it... I was in hospital for 5 days after my surgery. Love Cyndie",
      "MessageIndex": 338,
      "PostDate": "11/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "CyndieM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57436/profile",
      "Content": "Oct 10, 2007 06:02AM CyndieM wrote: Hi Sue, Wishing you a speedy recovery,  with lots of prayers for a good result. Have been reading your posts, I was only 38 at dx last Dec, and through everything now - the year has passed really quickly and was given the all clear at my last check up. Cyndie",
      "MessageIndex": 325,
      "PostDate": "10/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    }
  ]
}