{
  "AuthorID": "cyndesign",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130502/profile",
  "Posts": [
    {
      "AuthorID": "cyndesign",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130502/profile",
      "Content": "Jun 12, 2011 12:20PM cyndesign wrote: MDG, You are a wealth of great information...exactly the kind of acton items we need!  Some for those nearby and across the country.  Special thanks for taking the time to write and be so specific, it's so very helpful. I will be sure to include these forums in my first card to her, I think support and info from people who have and are experiencing this journey first hand will be invaluable to her. The only people who can truly say \"We understand.\" Thank you again, I'm so grateful for your guidance.",
      "MessageIndex": 2,
      "PostDate": "12/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770222",
      "Title": "Help/Suggestions cyndesign TwoHobbies"
    },
    {
      "AuthorID": "cyndesign",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130502/profile",
      "Content": "Jun 13, 2011 11:16AM cyndesign wrote: Dragonfly, Thank You, Thank You, Thank You! You have really hit the nail on the head. We are trying to raise her up and come to some level of understanding of what she'll be facing. You have given the information for both.  Great book suggestions! I think maybe we can set up a wishlist for her on Amazon, and she can even add her own :) You're wonderful :)",
      "MessageIndex": 4,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770222",
      "Title": "Help/Suggestions cyndesign TwoHobbies"
    },
    {
      "AuthorID": "cyndesign",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130502/profile",
      "Content": "cyndesign wrote: Hi all, my friend was just diagnosed Stage III.  All of her friends from around the country want to support her but don't know the best ways.  Can you tell me what are some of the things your friends and family did that helped you cope/made you laugh/strengthened you?  Are there things you need day to day that we can send? Are there things that aren't good...for instance is sending food bad because you get so sick during chemo? Any guidance or suggestions are greatly appreciated.  Thank you and swift recovery and healthy days to you all. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770222",
      "Title": "Help/Suggestions cyndesign TwoHobbies"
    }
  ]
}