{
  "AuthorID": "CyndieMon",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238603/profile",
  "Posts": [
    {
      "AuthorID": "CyndieMon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238603/profile",
      "Content": "CyndieMon wrote: I posted a few months ago about a large fatty mass I have under my left arm where the tissue has changed over the last year to where I feel my lymph nodes are hard and sore and the mass itself has changed in its texture. Even my doctor felt my lymph nodes under my arm and said that they were hard. His recommendation was that I move my left arm more. LOL!! But he reluctantly gave me a request for an ultrasound. My breasts are also very lumpy and fibrous - I'm always finding a new hard lump but nothing comes up on the mammograms. When I went to get the ultrasound it was a very busy day at the radiologist. I was under the impression I was getting a breast ultrasound; but when I explained to her the general area that was of concern, under my left arm, and that I had fibrous, dense, lumpy breasts she said in a high pitched angry tone \"you mean you don't have a specific area for me to look at?\" I suddenly felt really stupid for being there. She did an ultrasound of a couple of areas under my left arm and came back with a report that I was fine. I'm still feeling the same lumps under my arm and now my right nipple has been inverted everytime I take off my bra. I'm still very worried as my right breast has a significant amount of fibrous tissue. Seeking advice please! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851576",
      "Title": "not getting answers from medical staff CyndieMon tennischick888"
    },
    {
      "AuthorID": "CyndieMon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238603/profile",
      "Content": "Aug 30, 2016 05:36PM CyndieMon wrote: It's nice to hear that your doctor is being thorough; that's a positive thing. Sounds like you have a great doctor. We can really work ourselves up when there's an issue we don't have an answer for; but rest in the fact that your doctor is triple checking and not just sweeping it under the rug.",
      "MessageIndex": 3,
      "PostDate": "30/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847374",
      "Title": "A little help please. AmyJane2695 CyndieMon"
    },
    {
      "AuthorID": "CyndieMon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238603/profile",
      "Content": "Aug 31, 2016 06:04AM CyndieMon wrote: I'm not an expert on breast health as I have my own issues I'm trying to resolve in that area. However, I can call myself a bit of an expert on being made to feel like a drama queen. I have Lyme Disease but that diagnosis took six years, 7 doctors, and six prescriptions for antidepressants which I didn't take because I knew I wasn't depressed; I was in severe chronic pain in every joint in my body from my toes to my head - not depression. It takes a lot of advocating for yourself and persistence; doctors still seem to treat women for hysteria even now. If you're not getting the answers you need or you feel like you're not being taken seriously find another doctor. Also, find out your food allergies as you may be severely allergic to yeast and may be having a yeast infection - yes it can come out of your skin. I had the same thing and found out I was super allergic to yeast.",
      "MessageIndex": 7,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847548",
      "Title": "Am I a drama queen? Sunflowersandweeds Sunflowersandweeds"
    },
    {
      "AuthorID": "CyndieMon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238603/profile",
      "Content": "CyndieMon wrote: I'm 50 years old, haven't had a period in nearly two years, and I've seen the Dr. several times throughout the past 10 years about new lumps and bumps I have found in my breast tissue and muscle walls. My mammograms are always normal so I never get really worried. All the doctors have said that I have fibrous tissue in my breasts and that is the reason for the lumps and bumps. I've had extra breast tissue under my left arm for quite a few years. It's extra breast tissue - nothing concerning. However, recently I have noticed the feel of the breast tissue under my arm feels different. It feels thicker; I feel chords of tissue just under the skin where they are not there on the other side; my left breast has become ever so slightly larger than the right. I just had another mammogram and they said it was normal but the mammogram doesn't show the tissue under my arm. I just went to the doctor today and asked that he look at large mass under my arm and the chord type of tissue. He wasn't concerned but said that my lymph nodes are inflamed on the left side but not the right. He just said I need to move more. I run and I hike - just hiked 10 miles in the Sierras this past weekend. Should I be worried? And, any suggestions? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847534",
      "Title": "Worried about changes in my breast CyndieMon CyndieMon"
    },
    {
      "AuthorID": "CyndieMon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238603/profile",
      "Content": "Aug 30, 2016 10:33AM CyndieMon wrote: Thank you for sharing your story.",
      "MessageIndex": 2,
      "PostDate": "30/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847534",
      "Title": "Worried about changes in my breast CyndieMon CyndieMon"
    },
    {
      "AuthorID": "CyndieMon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238603/profile",
      "Content": "Aug 31, 2016 12:15AM CyndieMon wrote: Thank you, that is very helpful. I have an ultra sound scheduled for Sept. 12. My doctor wanted me to wait, put warm compresses on the area and move my arms more. LOL I move both of them when I run. The office manager at the doctors office went ahead and called in the prescription for the ultra sound anyway and I scheduled it. If I was a man and there was a mass growing on the side of my testicles it would have been removed and biopsied by now. :)",
      "MessageIndex": 4,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847534",
      "Title": "Worried about changes in my breast CyndieMon CyndieMon"
    }
  ]
}