{
  "AuthorID": "CYNTHIACHAVEZ01",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136628/profile",
  "Posts": [{
    "AuthorID": "CYNTHIACHAVEZ01",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136628/profile",
    "Content": "CYNTHIACHAVEZ01 wrote: IN APRIL 1991, I WAS DEVASTATED TO KNOW THAT THE LUMP IN MY LEFT BREAST WAS CANCEROUS. DR. VINCENT ANSANELLI WAS REFERRED TO ME BY MY PRIMARY CARE PHYSCIAN. PRIOR TO MEETING WITH DR. ANSANELLI I HAD MET WITH OTHER SUGEONS BUT AFTER CONSULTING WITH DR. ANSANELLI WAS CONVINCED THAT HE SHOULD PERFORM THE SURGERY. HE RECOMMENDED A LUMPECTOMY AND WOULD USE HIS LASER PROCEDURE TO REMOVE THE LUMP AND SEVERAL LYMPHNODES. THE RECOVEREY FROM SURGERY WAS THE EASY PART WITH SOME DISCOMFORT AND LITTLE BLEEDING. THE CHEMOTHERAPY BEING THE DIFFICULT ROAD. SO GLAD DR. ANSANELLI WAS ABLE TO MAKE THE SURGERY MORE BEARABLE THROUGH HIS REMARKABLE TECHNIQUE OF USING LASER  INSTEAD OF A KNIFE. IN 2001 DR. ANSANELLI DISCOVERED ANOTHER LUMP IN MY RIGHT BREAST. I WAS VERY SCARED BUT DR. ANSANELLI RECOMMENED A LUMPECTOMY WHICH WAS PERFORMED IN HIS OFFICE. I WAS SO GLAD TO HAVE THE SURGERY DONE IN THE COMFORT OF HIS OFFICE. AGAIN HE USED THE LASER PROCEDURE WHICH MADE FOR LITTLE DISCOMFORT AND BLEEDING WHILE RECOVERING QUICKLY. THE SPECIMEN WAS BENIGN. THANK GOD AND FOR DR. ANSANELLI. HOWEVER, IN NOVEMBER 2005 MY WORLD WAS SHATTERED AS DR. ANSANELLI AGAIN FOUND A LUMP BUT THIS TIME ON THE LEFT BREAST. I HAD A BIOPSY DONE WHICH SHOWED CALCIFICATION AND DR. ANSANELLI AGAIN RECOMMENDED A LUMPECTOMY, ALTHOUGH I DID CONSIDER HAVING A MASTECTOMY. I DECIDED TO HAVE DR. ANSANELLI PERFORM A LUMPECTOMY, KNOWING IT WOULD BE DONE IN THE CONFINES OF HIS OFFICE. A PLACE I NEW AND TRUSTED. THE LASER SURGERY WENT VERY WELL WITH LITTLE DISCOMFORT AND BLEEDING. THANKFULLY THE CANCER WAS STAGE ONE. I CAN'T THANK DR. ANSANELLI ENOUGH FOR ALL THE CARE HE HAS GEVEN ME OVER THE PAST TWENTY YEARS. HE IS NOT ONLY THE QUINTESSENTIAL BREAST SURGEON BUT A WONDERFUL AND CARING PERSON. I AM VERY PROUD TO CALL HIM MY LASER BREAST CANCER SURGEON. MY HOPE IS THAT HE WILL BE ABLE TO TEACH OTHER DOCTORS THE MERITS AND METHOD OF BREAST LASER SURGERY. IT WOULD BE EXTREMELY REGRETTABLE FOR LASER SURGERY NOT TO BE ADVANCED AND MADE AVAILBLE TO ALL BREAST CANCER PATIENTS. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "23/09/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/775394",
    "Title": "LASER BREAST SURGERY CYNTHIACHAVEZ01 CYNTHIACHAVEZ01"
  }]
}