{
  "AuthorID": "d-too",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139895/profile",
  "Posts": [
    {
      "AuthorID": "d-too",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139895/profile",
      "Content": "Dec 18, 2011 07:54PM d-too wrote: Hey guys I think I probably should be in this group too. BMX 11/28. Drains pulled this past week. Chemo school completed this past Friday. Chemo will start after Christmas. Only complications so far is a little more pain 3 weeks post op as opposed to 1 week postop. I'm ready to get this treatment started. I'm also going to be involved in a research drug trial. As soon as I know which one I will share it with this group.I hope everyone starting chemo this week or in the near future have no problems or minimal or no SEs. I'm so glad I found you guys... Have a nice week!!",
      "MessageIndex": 8,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "d-too",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139895/profile",
      "Content": "Dec 24, 2011 08:03PM d-too wrote: Happy Holidays everyone. It's nice to have a little break from doctors for a week or two. My power port was inserted in my left upper arm on wednesday. Thursday and Friday the site was very tender and there was no way to position my arm for pain relief. This morning when I woke up there was a big difference. A lot less pain and a lot less swelling. It looks like chemo will now start after New Years because of the research drug I'll be taking with herceptin. I met with the PS last week and I really like her. Looks like early summer I'll have new foobies. Still a little weirded out about looking for wigs and deciding if I even want one. I'm sure I'll change my mind several hundred more times. I can't ever remember having a personal friend having breast cancer. Last weekend my dearest friend had an abnormal mamo and found out it was just a good scare and all was fine. Today I had another close friend come to me and inform me she was diagnosed this week with breast cancer and is scheduled for a BMX Jan 4th. I spent a little time with her this morning and begged her to get on this website. Without the experiences shared by you ladies I would have truly been out of my mind. Reading what's shared from the heart in these forums is what relieved so much of my fears and kept me moving forward. My friend is experiencing that initial paralyzing fear. She thinks she's not going to survive the year. All I can do for her is to be a positive example right now. She doesn't want to hear/believe that she can survive this. I've been praying for her all day. On a good note I had a wonderful Christmas with my family this afternoon, celebrating earlier than usual because my DH will be working tomorrow. Still have a great day planned for tomorrow with my DS and my mom and a couple of close friends. I think something just landed on my roof...LOL... Goodnight alll.",
      "MessageIndex": 52,
      "PostDate": "24/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    }
  ]
}