{
  "AuthorID": "DA9707",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58692/profile",
  "Posts": [
    {
      "AuthorID": "DA9707",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58692/profile",
      "Content": "Aug 4, 2008 09:45PM DA9707 wrote: Therese, The clips are very commonly used to \"tag\" a mass so that it let's everyone know that it has been biopsied and probably because it is still there, is benign. The mammography assistant keeping me company while I was waiting for my biopsy, told me she had 5 clips in one breast.  The clips come in different shapes (mine is a spiral), so she has 5 different shapes to distinguish each lump. Most likely, they will take more films after placing the clip to make sure that they can see it.   Keeping my fingers crossed that you have clips as landmarks of your benign lumps!! Donna ",
      "MessageIndex": 5,
      "PostDate": "04/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/718882",
      "Title": "Waiting for 2 Biopsy Rpts :-/ therese48 therese48"
    },
    {
      "AuthorID": "DA9707",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58692/profile",
      "Content": "DA9707 wrote: Sorry - I think I need to vent right now and I know all of you will understand. I had my annual mammogram on 7/14 and they found a lump in my other breast by u/s. They probably only found this lump because they had to take extra pics because my old films got lost in the shuffle and the radiologist was probably more experienced in looking at mammograms.  The radiologist thought it  was most likely a fibroadenoma (benign mass). Went back on 7/22 for a biopsy. It is now 7/31 and I still haven't heard back yet from my dr.  Don't they realize how stressful this is to us? Even though I was told it was probably nothing to worry about, we all know that \"We worry about everything!\" I called the dr. office this morning and they said a nurse would call me back with the results. Hmmm, it's now after 2 PM and I still haven't received that call yet.  I guess I'll call them 30 min before they close if I haven't heard back by then.  You ladies are the greatest!! Dx 7/2007, IDC, 2cm, Stage IIIA, Grade 2, 5/12 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/718837",
      "Title": "Waiting for biopsy results DA9707 Ked1019"
    }
  ]
}