{
  "AuthorID": "daffodil123…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195922/profile",
  "Posts": [
    {
      "AuthorID": "daffodil123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195922/profile",
      "Content": "Feb 7, 2014 06:44AM daffodil123 wrote: Thanks Marie. It also says that some previous calcifications are no longer there. Is it good or bad? Does extreme dense tissue increase the possibility of cancer?  If it is cancer, will it be in very early stage can be cured by surgery only without any medication and radiation? I have kidney failure and I just started Peritoneal Dialysis. They asked me to get mammogram before they consider me for kidney transplant. Now calcifications are another thing I have to worry about. I will get it biopsied next week but I just want to have some piece of mind.",
      "MessageIndex": 14,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817419",
      "Title": "scared silly teaspoon teaspoon"
    },
    {
      "AuthorID": "daffodil123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195922/profile",
      "Content": "Feb 7, 2014 01:25PM daffodil123 wrote: Thanks so much. You are really very helpful. I can clearly see calcifications on the mammogram even though the breasts are extremely dense. Left breast is completely clear. There is no lump or anything else. Dealing with two problems at the same time is very difficult.",
      "MessageIndex": 16,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817419",
      "Title": "scared silly teaspoon teaspoon"
    },
    {
      "AuthorID": "daffodil123…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195922/profile",
      "Content": "Feb 5, 2014 01:15PM daffodil123 wrote: my mammogram says: The breast tissue is extremely dense. It appears that the calcifications located the 12:00' 4 cm from the right nipple have changed in appearance and size, measuring 1.7 cm in maximal diameter. The previously ( mammogram done 15 months ago) noted sub centimeter punctuate calcifications at the immediate subareolar right breast is no longer identified. The left breast mammogram unremarkable and unchanged. Biopsy suggested. Should I be concerned.",
      "MessageIndex": 12,
      "PostDate": "05/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817419",
      "Title": "scared silly teaspoon teaspoon"
    }
  ]
}