{
  "AuthorID": "Daliddle1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221956/profile",
  "Posts": [
    {
      "AuthorID": "Daliddle1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221956/profile",
      "Content": "Aug 19, 2017 03:42PM Daliddle1 wrote: Hi, I hope you've seen your dr...but after I read your post, it made me think that this cod be the nerves coming from your neck. That would explain the chin and part of face. You should probably see a neurologist. Good luck and please let us know your outcome. Blessings...",
      "MessageIndex": 4,
      "PostDate": "19/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857202",
      "Title": "Could this be symptoms? leslievasquez19 Daliddle1"
    },
    {
      "AuthorID": "Daliddle1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221956/profile",
      "Content": "Nov 22, 2015 06:21PM Daliddle1 wrote: Thank you for responding so quickly! The mass (as they called it, they said they couldn't see a papilloma) was 20 X 5 X 5 mm. There are so many questions I have. I live in a small town and think I should get a second opinion at UC Davis Medical Center in Sacramento, CA. Maybe then I'll get my questions answered. I'm just scared, confused and lots of things seems contradictory? Thanks again! Hope you're having a nice Sunday",
      "MessageIndex": 2,
      "PostDate": "22/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/836965",
      "Title": "Intraductal Papilloma~Need answers on pathology report! Help! Daliddle1 Daliddle1"
    },
    {
      "AuthorID": "Daliddle1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221956/profile",
      "Content": "Daliddle1 wrote: Can anyone explain to me what all this means? And, what I should do next, if anything? It all started with clear, then bloody nipple discharge, and a dilated duct. Nothing shows on mammogram or ultrasound, only MRI. They tried to do biopsy guided ultrasound, but couldn't see it well, so then went to MRI guided biopsy. I had a Bi-Rads 4. Now the radiologist has said it's Intraductal papilloma. Do I need to have it surgically removed? Please help if you can! Anything will help! Thank you so much! IMMUNOHISTOCHEMISTRY RESULTS: CAM5.2.................. epithelial cells positive (block A4) E-cadherin.............. positive (block A4) P63......................... staining of myoepithelial layer (block A4) Muscle Actin.......... staining of myoepithelial layer (block A4) SMMH.................... staining of myoepithelial layer (block A4) Comment The biopsy demonstrates benign breast ducts, with fragments of a benign intraductal papilloma and background fibrocystic changes, showing intact staining of the myoepithelial layer on a panel of immunostains. There is no evidence of malignancy. A. MRI GUIDED CORE NEEDLE BIOPSY, LEFT BREAST AT 5:30 POSITION, RETROAREOLAR: BENIGN BREAST TISSUE, WITH INTRADUCTAL PAPILLOMA AND FIBROCYSTIC CHANGE. NO EVIDENCE OF MALIGNANCY. Never say never... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/836965",
      "Title": "Intraductal Papilloma~Need answers on pathology report! Help! Daliddle1 Daliddle1"
    },
    {
      "AuthorID": "Daliddle1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221956/profile",
      "Content": "Oct 20, 2015 10:57AM Daliddle1 wrote: Thank you so much for taking the time to respond to my post! It means a lot to me that you cared enough to write! Of course I'm hoping it's something other than cancer, but I've been researching and nothing else quite fits. I'm calling my doctor today to get this biopsy done ASAP. Did it take you a very long time to get diagnosed? If I can pry a little, what type of cancer did they find? I'm terrified of the treatment if it's positive. I'm only 59, but don't know if I would want chemo. I have a lot to live for (my 2 grandkids mostly), but I've been sick most of my life with other stuff. I'm just tired I guess. Thanks again for your encouraging words! I really appreciate it! Hope your day today is peaceful",
      "MessageIndex": 2,
      "PostDate": "20/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/835915",
      "Title": "MRI shows 20 x 5 x 5 mm elongated mass! Daliddle1 Daliddle1"
    },
    {
      "AuthorID": "Daliddle1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221956/profile",
      "Content": "Oct 16, 2015 09:38AM Daliddle1 wrote: Glad they told you something after your mammogram and ultrasound. How long gave you been having the clear discharge? I've had that and now, 3 months later, it's turned bloody. Please keep us posted after your next tests. I'm hoping for the best.",
      "MessageIndex": 3,
      "PostDate": "16/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/835785",
      "Title": "Diagnostic mammogram and US tomorrow liza1964 liza1964"
    },
    {
      "AuthorID": "Daliddle1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221956/profile",
      "Content": "Daliddle1 wrote: This started with spontaneous clear nipple discharge (Sept 2014), then a month ago it turned to blood. I'm also having shooting pains all around left breast. My breast feels bigger, swollen like. I've had a mammogram and ultrasound last week. It as recommended to have MRI. Now I'm supposed to have an ultrasound guided biopsy. I read a little about this and it appears there are several types of these biopsies. I'm hoping I get a call tomorrow to schedule this. It's all I think about, 24 hours a day! Well, except for sleeping a few hours a night I'm 59 years old, was told I have dense breasts 2? Now this Bi-Rads 4. Can anyone tell me a little about what was written on my report? Please be honest, I'm here to learn of others experiences and am seeing how brave and strong you all are! Thanks for reading and \"being there\"! Findings:There are scattered fibroglandular elements in both breasts. There is a 20 x 5 x 5 mm elongated slightly irregular mass without significant enhancement in the 5:30 subareolar position of the left breast extending to the nipple. There are scattered enhancing foci in the central right breast and there is slight asymmetrically increased vascularity in the right breast. Skin and nipple enhancement is normal bilaterally. There is slight asymmetric prominence of right axillary lymph nodes. No marrow signal abnormalities are seen. No internal mammary lymphadenopathy is noted. Impression: Suspicious 20 x 5 x 5 mm elongated mass in the 5:30 subareolar position of the left breast extending to the nipple. Never say never... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/835915",
      "Title": "MRI shows 20 x 5 x 5 mm elongated mass! Daliddle1 Daliddle1"
    },
    {
      "AuthorID": "Daliddle1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221956/profile",
      "Content": "Oct 20, 2015 06:11PM Daliddle1 wrote: My doctors office just scheduled for my ultrasound guided biopsy, which I was told will be a fine needle biopsy. The problem is, is that it's not until next Tuesday! A whole week away! It's going to be challenging for me to wait that long! I'm having pain and swelling. Also I forgot to mention, a few weeks ago a felt a dryness around my nipples. It went away, now it's back again. I've never had this before? Honestly I'm worried it's inflammatory breast cancer as things seem to be moving along too quickly",
      "MessageIndex": 3,
      "PostDate": "20/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/835915",
      "Title": "MRI shows 20 x 5 x 5 mm elongated mass! Daliddle1 Daliddle1"
    }
  ]
}