{
  "AuthorID": "DancerMel28…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
  "Posts": [
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 25, 2010 12:21AM DancerMel28 wrote: Hi Sweeney, I'm 3 weeks out from my last TC (4 rounds).  All in all I found it to be very doable.  Typically all 4 cycles followed the same path for me - day of and da after infusion felt ok, day 3 started coming down from steroids so felt tired mainly, days 4-6 worst days in cycle just felt blah - no nausea but had no energy, felt like I was in a fog, mouth was soreset on these days also, after that would gradually build up until by the end of week one I was feeling pretty ok.  Weeks 2 and 3 as long as I was careful not to overdo it I felt ok to do things. I didn't work during chemo but some people do.  I found overall that there were lots of 'little' things - dry eyes, taste issues yes (lemon juice helps a bit), a bit of eye twitching, I had headaches during first cycle but I think my scalp was sore from my hair falling out (which really started by day 15 cycle 1, I shaved by day 18). My biggest issue was that I had a reaction to the taxotere during the infusion - don't be afraid if this happens to you, the nurses were quick to stop it and gave me extra meds and I was fine when it re-started.  If you feel strange at all during the infusion tell the nurses straight away and you'll be fine I promise!  I wish I had known earlier - but the best thing that a nurse did during my 4th was to start it off slowly and gradually increase it and I had no reactions on the 4th one so that seems to be the key! Good luck, feel free to PM if you have questions.",
      "MessageIndex": 3,
      "PostDate": "25/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755819",
      "Title": "TC chemo- what can i expect? sweeney Anna2017"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jun 3, 2010 08:24AM DancerMel28 wrote: hello everyone - just dropping in from the april thread.  Just wanted to say good luck to everyone.  I've had 2 x TC so far and both cycles have followed a similar pattern though #2 hit a little harder.  Best advice I can give is to drink drink drink - even when you don't think you can drink anything else drink some more!!  If water begins to not taste good - try putting some lemon in tends to do the trick and help with sore mouth too.  Don't put up with SEs - let your Onc/chemo team know as they can usually give advice/script for how to fix it. We have enough to deal with without putting up with SEs that can be fixed easily. If you need any further advice - check out the april and may threads also - both packed with info! Again, good luck!",
      "MessageIndex": 100,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753229",
      "Title": "Chemo June 2010 Del9 grneyd5600"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 6, 2010 02:14AM DancerMel28 wrote: thanks everyone for the advice - i rang the nurses yesterday and they told me that it wasn't a usual side effect of TC (huh I beg to differ!) but were worried about possible infection so said to go to my GP.  I saw him this morning and he gave it a name (too long and complicated to remember!) and said normally a dose of antibiotics would clear it up but preferred not to give them to me as I've got so many other bits and pieces in my system and he didn't want to cause nausea which would put me in a worse situation. So instead I've got an antibiotic cream to apply twice a day with the view to prevent inflamation and further break outs. Basically it's all the toxins in the body casuing it so by keeping the skin clean with this cream it should help. He also said that he sees it a lot as a result of Chemo so there you go. LauraM - good luck tomorrow. The anticipation really is worse than the actual thing so hopefully you'll be fine! Saralmum - I have a friend who went through chemo and for ages afterwards couldn't even drive past the place where she had her infusions without feeling nauseous because of the association with it.  I don't think it's as strange as you think. Hope you feel better soon.",
      "MessageIndex": 348,
      "PostDate": "06/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 29, 2010 02:28AM DancerMel28 wrote: SGJ05 - I'm on TC and have had 2 rounds so far.  I'm not having any shots - there was no mention of it by my Onc at all have only heard about it on here.  My counts were fine after my first round and I had my second without any delay. I'm only a week out from that so we'll see what happens in two weeks when I'm due for my next one. Overall - this week has played out the same as my first round, though I think it's hit a bit harder.  I had it last friday, and was fine (though a little tired) until the Monday when it really hit, just felt 'blah' and mouth/throat/neck was really sore.  Tuesday was the first time I've had any nausea - took my extra pills and it settled but didn't really feel like eating at all - which is the first time so far.  By Thursday was feeling much better and was able to get out and about (was going stir crazy being stuck at home!!!).  Friday - no taste buds whatsoever!! Am feeling a bit tired but am just trying to rest when I need it. Hoping everyone is coping ok.  :-)",
      "MessageIndex": 529,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 29, 2010 11:14PM DancerMel28 wrote: Hi arubajan05!  Yes the sore throat has been present both times. I have had my chemo on Fridays and both times by Monday I had a really sore neck and throat.  The sore throat has stuck around a bit longer this time - I've just been putting up with it mainly. Ice-cream definitely helps as does milk/dairy in general funnily enough.  Don't know what the solution is at this stage. I have been feeling a lot better this weekend - I'm a bit tired today as I had big day yesterday (teaching ballet and then out for tea for a family birthday), so I'm taking it easy today!  This winter weather makes it easy to stay inside and curl up with a good book!",
      "MessageIndex": 539,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 2, 2010 08:08PM DancerMel28 wrote: Kad22 - thanks for the best wishes regarding kids - I so hope everything goes to plan over the next couple of years! They say I'm lucky as I'm only 29 (28 when diagnosed) so have every chance that ovaries will recover and I'll be fine I just worry about having to take tamoxifen for 5 years (though it's been said that if all is ok I can go off after 2 to try for kids - fingers crossed!). Char - I've been alternating between watery and dry eyes for a while now - eye drops have helped in both regards for me. Twitchy eyes and nose for me are very common! Not sure about the splotchy arms - I had a couple of splotches over the time but only once or twice and only little ones.  SGJ05 and toughmom - I'm going to be moving on to rads but have more surgery (nothing major) just to tidy up my scar on my breast as my wound opened up when it was infected and the scar is very noticeable and I can't wear certain tops as it's right in my decolletage so quite noticeable - seems like a silly thing but I'd like it fixed.  So prob won't be starting rads until august as surgery is set for end of this month.  I had my initial surgery before chemo back in feb - lumpectomy and Sentinal Node biopsy. Have to have rads as I only had lumpectomy.",
      "MessageIndex": 737,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Apr 30, 2010 04:21AM DancerMel28 wrote: HI Everyone, Well just got home from having my first lot of TC.  I had a reaction to the Taxol - which they had told me could happen luckily - was not the most pleasant thing (bright red face, heart beat faster and had an awful feeling down to the pit of my stomach) but the nurses were so quick they stopped it, gave me a steroid boost and then waited and started it again and I was fine after that phew!  I must say other than that the whole experience was a lot less stressful than my mind had made it out to be - it's true what you have all said the anticipation is a lot worse than getting the actual treatment.  Am feeling ok at the moment - had a long 3 hour trip home and was dreading that in case I was ill but so far so good. We'll see what tomorrow brings! Hope everyone is feeling ok and is managing well with the SEs.  Check back soon :-)",
      "MessageIndex": 285,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Aug 3, 2010 10:56PM DancerMel28 wrote: kad22 - I had bloody nose during taxotere which is related to taxol (I think?).  Mine cleared up about 3 1/2  weeks after my last chemo dose so I'm definitely sure it was the taxotere.  My Onc said the nose just gets very sensitive and it doesn't take much for it to bleed - just advised me to try not to blow it at all (I took to 'dabbing' at my dirppy nose instead of blowing it all out - annoying but seemed to calm the blood noses a bit but didnt' stop altogether) and also be careful not to bump it. It was annoying as I ended up feeling clogged up from the dried blood but it did pass and quite quickly once I stopped. Hope the same for you!",
      "MessageIndex": 917,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 9, 2010 10:21PM DancerMel28 wrote: Arubajan & Dutchgirl6 - I am the same with the dairy thing, ice ream and milk of any form is the only thing that tastes okay on the bad mouth days. I'm on day 11 from my first treatment and am feeling pretty okay. The hair is really beginning to shed now - and yes my husband remarked that it's a competition between me and the cat at the moment. Here in Australia this weekend we had the annual 'field of women' event in Melbourne.  This year they got 14100 people wearing pink ponchos (and some blue to represent ment diagnosed) onto the MCG (big footy ground) to form the pink lady to represent the 14100 people who will get diagnosed with BC this year in Australia.  It's a huge event and takes place before an aussie rules footy game.  They Breast Cancer Network Australia do it to raise money and awareness. It was a really moving event - I only watched on tv this year but the aerial shot was amazing. Til next time, Mel",
      "MessageIndex": 394,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 17, 2010 07:59PM DancerMel28 wrote:",
      "MessageIndex": 457,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 29, 2010 11:19PM DancerMel28 wrote: Oh I forgot to add - funny story!! At ballet yesterday I had my little tiny tots (3-4 yr olds) and it's the first time they've seen me with a scarf on.  One of the little darlings said to me \"why are you wearing that?\" pointing at my head. I said that my hair had fallen out so that's why I got to wear some pretty scarves. She replied \"You're hair fell out!!! But why?\" and the look on her face was just gorgeous - it wasn't a scared look but a look of absolute wonderment that it was possible for hair to fall out.  So nice to have a cute moment rather than rude stares",
      "MessageIndex": 540,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jun 5, 2010 06:55AM DancerMel28 wrote: hi susiesue - (unless I've missed things....) I think most of the reactions have occurred from Taxotere not Taxol, i think they're from the same fmaily but not are not the same.  Just know that in my experience the nurses are absolute PROS when it comes to dealing with this and have it sorted out before you know it so try not to worry too much. arubajan - I'm so sorry about the reaction! I've had some itching around the back of my heel this time but I think it's more from the dry skin (I must admit I haven't looked after my feet as well as my hands when it comes to moisturising - I've been pedantic when it comes to my hands but need to extend it to feet also!). Hopefully someone can give you some answers about if it's chemo related or not - I guess so much is going on with our bodies that it could be a delayed reaction who knows! Hope next round is more uneventful for you.",
      "MessageIndex": 574,
      "PostDate": "05/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jun 30, 2010 09:03AM DancerMel28 wrote: Hi girls, sorry been a bit quiet on the boards - been a busy couple of weeks!  Round 3 has been bearable - no nausea like the second round so that's been a bonus!  Been fine weeks 2 & 3 except for the bloody nose thing - new SE that's shown up not sure what's going on had to have an extra blood test last week but i think everything's ok there so who knows??!?? Gearing up for LAST one on Friday!!!!!!!  Just have to convince the Onc that I don't want to change my regime (know what the reaction is, I handle it fine, I can manage the SEs - don't want to change at this late stage).  Not sure if she's going to insist on a change or if she'll be okay with my deicision to continue with T even though I have areaction during infusion - we'll see what happens on Friday. So then after the the SEs wear off - I've got surgery at the end of July to look forward to (just to fix my scar that occurred from the wound infection - nothing major) then Rads.  So looking forward to being done with this chemo stuff!! Maybe I'll feel well enough to start tackling the weight thing (dreading seeing what the scales say on Friday - have steadily been increasing each treatment but I figure if eating keeps the nausea away then I'd prefer to put on some kilos). Hope everyone is well!",
      "MessageIndex": 707,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jun 30, 2010 10:31AM DancerMel28 wrote: I was wondering how you got on Char.  I'm hoping I can continue with T - just don't see the point of changing when there's only one left. Spoke to my GP about also - he said that he sees a lot of patients react to the 3rd and 4th ones (of any type of chemo) anyway regardless if they react to begin with, so i figure there's no guarantees that I won't react to the alternative anyway!",
      "MessageIndex": 709,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jun 30, 2010 09:46PM DancerMel28 wrote: Char - SE not too bad overall.  My second round was the 'worst' as in the only time I've had nausea so far.  Have learned must keep on top of the constipation!  First round had a rash but cream cleared it up and haven't had anything like that since.  Main issues have been with mouth - not sores as such but just very sensitive and there are days that nothing tastes right which makes it hard to drink and eat.  This round had 3-4 days where the only thing I could drink was Pepsi everythign else tasted like dirt!  Nails are starting to get a bit flaky - not lifting off but just break easily.  Got really dry skin too - moisturising like crazy - and my eyes get dry also so eye drops are my best friend! New SE this round has been blood noses but that seems to have settled a bit now - they said I can't blow my nose so I end up with a bit of dry blood up my nose still but not having the bleeding as such anymore. I've found overall that I've just had a heap of 'little' things but have managed to get thorugh it all and have 2 good weeks out of the 3 so it's been a better experience than what I was expecting (dreading!!) before I began. Kad22 - I'm on Taxotere which I hear is in the same family as Taxol but is different from my understanding.  I react within a couple of minutes of it starting through the drip - get an awful feeling in my chest, heart beats fast and I go bright red!!  Once they stop and give me extra steroid and phenergen wait a bit to calm down, it restarts and I'm fine! So weird - almost as if my body goes - hell no you aint putting that poison in me but then realises it doesn't have a choice so shrugs it shoulders and soldiers on haha. Merideth - I'm having Zoladex shots monthly which I hear is the same sort of thing as lupron.  I too am hoping that ovaries survive all this as I haven't had kids yet and was actually trying to start a family when I got dignosed putting an end to that for now.  I was totally freaked out when I saw the onc and she said 5 years of hormone therapy so can't have kids til after that - but saw the fertility specialist 2 days later and she said generally it's okay to stop after 2 years (PHEW!!!) to try for a baby so fingers crossed it's all okay!",
      "MessageIndex": 718,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 10, 2010 02:42AM DancerMel28 wrote: So a week post chemo - must say this last one hit the hardest in terms of fatigue. Had no energy at all this week - took a couple of days longer to get back to feeling like doing something.  Funny story - I didn't think my hands were too affected by any neuropathy but after dinner last night I'm not so sure.  My DH took me out for dinner last night (even though I had no taste buds!), anyway I was chatting away and was holding my (full) drink of soft drink in my left hand, which somehow it was like my hand forgot what it was doing and it was dropped all over the table.  I'm sure it looked a sight that's for sure - it went everywhere.  It just slipped - Don't know what was going on",
      "MessageIndex": 771,
      "PostDate": "10/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Aug 13, 2010 04:07AM DancerMel28 wrote: Hi LauraM, I found the article on another forum so share away I say - But I think I did post it on the May one too (could be mistaken as I'm still suffering from chemo brain!).  I had my surgery 2 weeks ago - the scar from the lumpectomy was the one they had to fix due to the gaping hole that I had as a result of the infection and the ''beautiful\" purple gash it left.  So far so good - just a straight line now and I hope in time I'll barely notice it!!!! Amazing really what these infections can do - hopefully your surgery goes well when you have it (I found it much easier than the initial surgery that's for sur, but I guess it depedns on what you have to have done).",
      "MessageIndex": 955,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 3, 2010 04:43AM DancerMel28 wrote: HI everyone, well i must say i was pleasantly surprised - I had a fairly good weekend, a little tired at times but ate normally and didnt' really begin feeling any SEs until last night.  So far just feeling a bit sore around the neck and throat - def got the dry mouth so trying to keep the fluids going.  I am surprised that my hair feels prickly around the nape of my neck already - thank heavens I took the advice of others and got a satin pillowcase, was comfortable to sleep on that's for sure. We'll see what the next few days bring.  Mel",
      "MessageIndex": 312,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 14, 2010 06:03AM DancerMel28 wrote: Ok so I'm hoping that this isn't a stupid question BUT as my hair is really beginning to fall out I've been thinking - how do you care for your scalp? I've heard some bits and pieces about follicleitis (spelling?) so I'm keen to care for my scalp as well as I can to hopefully avoid this. Any ideas?",
      "MessageIndex": 429,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 21, 2010 04:34AM DancerMel28 wrote: Hello everyone, Well just got home from having TC #2.  Started by seeing my Onc and my blood work was fine (I was a bit worried as I read of everyone having shots to take to get the WBC up but my Onc necer mentioned it - so am glad I was ok).  Unfortunately took two goes to get IV in - the first one collapsed then she got another nurse who got it in elsewhere. Had another reaction to the Taxotere - even though they gave me an extra shot of steroid before they started.  This time they stopped it and gave me phenergen then once again I was fine once it restarted.Now they're saying that if it happens a 3rd time they might change the dose (when they said it very rarely happens on 3rd and 4th!). So am hoping that it doesn't happen again. My hairdresser buzzed my hair on Wednesday - so weird!!  I didn't cry just felt weird - looks funny as I have some bald spots but still got hair in other places.  While I was in Melbourne I went wig shopping (got nothing locally). THey were so lovely - they look after a lot of chemo patients they said.  THey made me where my wig out of hte shop and I must say the push was good - I dont' think I would've had the confidence otherwise. Felt nice not to have people staring at my scarves like I've had since I began wearign them on Monday . Hope eveyone's going well. Check in again soon!",
      "MessageIndex": 489,
      "PostDate": "21/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 2, 2010 11:25AM DancerMel28 wrote: Hi Char - what are the new SEs? nothing too serious I hope. good luck with your Rads too!",
      "MessageIndex": 729,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Apr 20, 2010 07:22AM DancerMel28 wrote: Hi Everyone, I'm due to start my chemo on April 30th - TC x 4.  I'm feeling rather anxious about it all as I've had a rough time after my surgery - lumpectomy and sentinal node biopsy - as my breast wound got infected and it took me going to lots of different people to finally get someone to take me seriously that something was not right (it wasn't just 'my way of healing' as one nurse told me). After reading everyone's posts and the fact that I'm actually finally starting to feel 'normal' again I am feeling so much more positive about everything - I figure that's a much better frame of mind to go into next week with Anyway, am seeing my oncologist tomorrow so have a long list of questions to ask after reading your posts. Thank you to everyone for sharing your experiences so far - am looking forward to sharing more over the coming months. Fingers crossed",
      "MessageIndex": 149,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Aug 18, 2010 10:11PM DancerMel28 wrote: Hello everyone, I must admit the same questions are going through my mind too - I haven't had any scans since the ones I had to get diagnosed (chest x-ray, mammogram and ultrasound).  I had wondered if I should be having further scans done as a lot of people talk about getting all these other scans done - am glad I'm not the only one wondering!  I saw my Onc last week and she wants me to start tamoxifen right away but my rads onc doesn't want me to start until after radiation (different treatment centre), so have to talk to my rads onc next week when I have an appointment with him. I started Rads yesterday but don't have an appointment with him until then so we'll see what he says.  I asked my Onc what happens now that I'm getting to the 'end' of treatment and she basically said for the next year I would have 3 month check ups (didn't say exactly what the chekc ups were), and that it would either be with her or my surgeon. I see her again at end of November to check how tamoxifen is going, then she said we'd work out next plan of check ups then. Hope everyone's going ok, have to go and get ready to drive to rads #2 (only 28 to go after that!). Mel xx",
      "MessageIndex": 981,
      "PostDate": "18/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Apr 27, 2010 08:47AM DancerMel28 wrote: Hi everyone, well I've 2 more days of 'freedom' before my first chemo begins. I've been frantically running around getting as much done as I can before then so that I don't have to worry when the side effects hit. :-)  One thing my oncologist said to me at my last appointment was that I was to make sure to ring them if nausea was a problem as in her opinion 'noone in this day and age should have to put up with it'.  I'm hoping that means that there's some way of controlling at least the worst of it (well here's hoping anyway!).  Had my hair cut into a shorter style today - just couldn't face having to look at my longish hair in my hands when it starts to fall out, so hopefully it won't be so bad.  Must say it's different - was a nice excuse to experiment as I said to my hairdresser it's going to fall out anyway so if I don't like the style it's not goign to matter too much at this stage.  She was really good though and I'm lucky that her salon is at her home so when I need to shave it, it can be done privately.  Hope everyone's feeling ok or at least got some support through the bad days, your posts and updates have really helped me get ready for Friday so thank you.",
      "MessageIndex": 234,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Sep 3, 2010 08:53AM DancerMel28 wrote: Hello Ladies, Soooooo - thought I was all clear on the effects of chemo....... hahahahahahahahaha!  8 weeks out from my last one and I wake up this morning missing my bottom eyelashes!?!? WTF??????? So Weird - last week it was the eyebrows thinning this week the eyelashes are jumping ship. Oh the human body is a strange thing.  In other unrelated news - I'm 12 down on the rads - only 18 to go!!  Got some rockin' tunes happenign in the car - pity the poor souls who pull up next to me at the lights with me singing so loudly in the car!! Hope everyone is well! Mel xx",
      "MessageIndex": 1061,
      "PostDate": "03/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Sep 22, 2010 11:03AM DancerMel28 wrote: Hi Girls, Have been off for a while as my ballet girls have been competing in a local Eisteddfod so have had pretty long days for the past 5 days.  I finish Rads next week (only got 5 boosts to go!!!!) and I am returning to work just 2 days a week the week after.  THis past 5 days has been interesting as I've had really long days with my girls dancing (one day was 8:30am until 11pm and then the next was 12pm until 1 am damn scheduling sucked!!). I've been getting a little worn down with the driving too and from rads but the Eisteddfod was in same town as my treatment so one of my parents drove me down and took me to my appointments in between the girls dancing so that was really helpful. Will be interesting to see how I go back at school anyway - the best part is my principal is really supportive and he told me we'll take it week by week and see how I go so no pressure which is good. Have read through all the posts but can't remember everything!  Something about blood noses - yes had them during chemo my onc said bridge of nose gets very sensitive during chemo which causes them.  I've been going 'topless' more and more lately - got a nice coverage of hair but it's still only about 1cm long (sorry have no idea with inches as we use centimetres in Oz but I know an inch is longer!) so it's not really a style yet but am just so sick of scarves and beanies and I really haven't taken to wearing my wig. Most people say I look better with nothing on then the scarves so there you go.  I too went to a concert and it got soo hot I just whipped the scarf off and kept dancing - people next to me were a bit shocked I think! Hope everyone is well anyhow, til next time. Mel",
      "MessageIndex": 1117,
      "PostDate": "22/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 5, 2010 03:43AM DancerMel28 wrote: hi again everyone, marcy - i know what you mean about the haircut, i cut mine last week and everyone keeps saying how nice it is. I keep saying won't be there for long now.  I'm on day 6 from my first TC and already strands are falling out so i figure it won't be long now :-) I've decided that I can't sit around any longer - I don't actually feel like doing anything but I feel worse sitting around so am trying to be a bit more active and surprisingly it is helping to make me feel better. I woke up with a massive headache this morning but it's virtually gone now after doing some washing and other bits and pieces around the house.  The DH won't recognise the place when he gets home.  The other thing that I've discovered works - putting on your favourite music.  It really does help lift the spirits Only other thing - i've seen mention of some people experiencing a rash of pimples as a result of chemo. Has anyone discovered anything that helps?  I've currently got a bad rash over my face, neck and upper back. Not sure if there's anything that can be done but it's getting annoying.  None of the literature I recieved about side effects says anything to help - only mention is that you may get a rash and that it will clear up after treatment. So weird! Hope everyone else's going ok, til next time, Mel",
      "MessageIndex": 335,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 11, 2010 07:51PM DancerMel28 wrote: Sorry to hear that JenC - must be very frustrating for you. Hope everything sorts itself out soon. Marcy4 - I can't help you as I've only just got to the stage where my hair is really beginning to fall out.  I've decided not to go for a wig at the moment just going to try the scarves then if I feel too self-conscious then I'll get a wig then I think.",
      "MessageIndex": 410,
      "PostDate": "11/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 2, 2010 08:03AM DancerMel28 wrote: Well ladies - Good NEWS!!!  My onc let me continue with Taxotere..........but even better........I DID NOT HAVE A REACTION TODAY!!!!!!!  THe weird part is - I didn't have any extra steroids or phenergen before they began this time. BUT the one thing they did do differently - started the drip SLOWLY then increased it gradually.  Now why hadn't they done that before???  I actually feel really good tonight as I haven't been ovredosed on steroid and phenergen. So that is Chemo over and done with!!! Woohoo!! Just have to survive the SE's of the next week or so (fingers crossed its the same as last round which was ok overall) then I can cross that part off as done!!! When I met with Onc before my chemo she arranged my referral for rads which I'm going to be having closer to home (30 mins each way instead of the current 2 1/2-3 hours each way). I'm also going to be referred for genetic testing (which normally would've been done earlier but due to earlier complications I had from other things got overlooked), since I'm so young I'd just like to know one way or another for future and I have 2 sisters who could be affected also so want to have all the info.  AND I've noticed some swelling in my arm on the side of my SNB so also have a referral to a physio as I oculd have a slight case of Lymphodema grrrrrr!  Always thought it strange that I wasn't seen by a physio after my surgery (as most seem to?) so am worried that because I haven't been doing any exercises that it's caused it. Will see what physio says I guess.....  All in all - have had a really good week - caught up with 2 dear friends that live far away so haven't seen in a while, my husband won a competition (that I actually entered him in!) his prize was $1000 which is about to come in real handy! and my chemo has gone well.........can't complain!",
      "MessageIndex": 727,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 25, 2010 03:28AM - edited Jul 25, 2010 03:29AM by DancerMel28 Ditto here with the hot flushes!  The 4 days after my 4th chemo were the worst - coudlnt' sleep at all during the night.  I think mine is a combination of having zoladex and chemo - i haven't had a period since i began chemo as a result of my ovaries being shut down for protection during chemo.  I'm 29 so am hoping (silly as it sounds!) that they return soon now that I've finished....and that the hot flushes subside though with going on tamoxifen next am thinkiing they will prob stick around",
      "MessageIndex": 863,
      "PostDate": "25/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Aug 1, 2010 01:26AM - edited Aug 1, 2010 01:28AM by DancerMel28 Hi everyone, I found this article link on another forum and just had to share it.  As we're all heading towards the end of all this treatment I think it could come in handy - I was nodding my head in agreement all the way through as I read it. http://www.cancercounselling.org.uk/northsouth/extra4.nsf/WebResClient/1761049276601BD68025735B00604834/$FILE/article3.pdf?openElement ",
      "MessageIndex": 903,
      "PostDate": "01/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Aug 8, 2010 06:31AM DancerMel28 wrote: Hi kad22 - I was teaching Grade 5/6 but had to give up my grade after term 1  (only just made it to the holidays between surgery and other appointments).  I'm hoping if everything goes to plan I should be back in some capacity in term 4 (early oct) so should see out the end of the year.  I've been back to see them a few times (but have been careful to keep the distance a bit as the teacher who took over was a graduate teacher so had to give him time to settle in and for the kids to get used to him) they keep coming up to me saying they want me back (so heartbreaking!).  I was ifnally brave enough to show them my bald head last time - they loved it! They want to see my wig next time so I think I'll go see them with a novelty wig on first - maybe bright pink? I'm down in Victoria so it gets pretty cold down here but only snows in the mountains. I'm pretty close to them so we get the wind chill from the snow.  I'm so ready for spring (means this year is getting closer to the end!).",
      "MessageIndex": 932,
      "PostDate": "08/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Aug 11, 2010 03:20AM DancerMel28 wrote: Hi everyone, Well had my rads planning today, my centre doesn't use tatoos so I currently have texta marks in various colours all over my chest! It's hilarious - looks like a 5 year old has gotten into the textas and drawn all over me while I was asleep!  Oh well the high neck tops need to come out again.  I have to powder the marks every day to try and make sure they last until next week when I begin - they're a bit smudgy already so we'll see what happens I guess. Kad22 - We have 4 terms a year, major 6 week break which begins mid dec through to end of january (our summer), then have 2 week breaks between each term - one early april (depending on Easter), one end of june/early july, and the other end of september.  So our school year runs from Feb-Dec. Wasn't as bad as I thought it was going to be taking off my scarf - I'd been in a few times prior and hadn't had the guts and then one of my smart alec Grade 6 boys (love him to bits but he has a mouth) whinged after I'd kidded with him that he needed a haircut (think justin beiber hair!) so I whipped it off for them to have a look. They're faces were hilarious.  I must say I'm much more relaxed about the bare look now - it's just so damn cold here so always cover up with beanies and scarves when I go out otherwise I freeze!",
      "MessageIndex": 939,
      "PostDate": "11/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Aug 24, 2010 08:38AM DancerMel28 wrote: Hi Kelli - You will be very busy gearing up to being back at school!  I went and saw my school principal last week and have begun to plan my return - unfortunately not to 'my' grade but will be a general all-rounder for the last term of the year.  WIll be starting again in early october (date still to be decided) just 2 days a week to start with and if all goes well 3 days a week in november and hopefully full time again by end of year.  It will be a good opportunity to try a few new grade levels and help me decide what I want to do next year (this was to be my 4th year in grade 5/6 so principal was hinting that next year I will be changed to a different level).  Good luck with your return anyhow! Hi to everyone else. Hope you are all well. I'm still having my moments re: the emotional rollercoaster but now that I'm travelling every day for Rads I don't have as much time to dwell on things too much.  I've sent my husband away on a holiday with his parents and sister, brother in law and niece - he's had a few hassles at work lately so will do him good to have a break from that and the 'cancer' stuff.  He never was one to have a high level of tolerance for 'bulls**t' but since all this has happened he has NO patience whatsoever for everyone's every day gripes about nothing.  He needed a break it was just unfortunate that I started Rads last week so couldn't join him - next time hey! til next time, Mel",
      "MessageIndex": 1018,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jan 18, 2011 06:38AM DancerMel28 wrote: Hi Girls, I've found I've been quite busy - I still check in but don't post as much these days. I'll be going back to full time work in a couple of weeks (I'm on school holidays at the moment). Once I finished rads at end of Sep, I went back to work a couple of days a week and gradually built up my days over the term until I was doing 4 days a week before the Christmas break. Was a nice way to get back into teaching without having the responsibility and stress of writing reports and planning lessons as I was just a sub. Am freaking about whether I'll handle full time and my own class again but I'm sure I'll muddle through. As for body - well full head of CURLY hair, nails are almost back to normal (though i'm still worried baout a couple of my toe nails possibly falling off) and the tamoxifen hasn't caused any huge issues (yet touch wood!).  Weird thing is I still have my 'down' days wondering if this crap is going to happen again - as I'm sure we all have our moments but overall feeling good most of the time. Hope everyone else is well xx",
      "MessageIndex": 1192,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Feb 9, 2011 05:16AM DancerMel28 wrote: Hi girls, Like everyone I'm coming up to my one year. Have mammogram and ultrasound booked in for next week (valentines day of all things!) and I've made sure I've got my husband comingn with me after last year - I'm just not sure that I'm going to be able to go back into that room, such a scary thing. Glad to hear everyone is doing ok.  I resumed full time work last week - I'm still tired but am coping ok overall and feeling better every day. Good luck to everyone having to undergo tests soon!",
      "MessageIndex": 1215,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 2, 2010 08:36AM DancerMel28 wrote: Hello again - further to my last post..... I had my last round today my onc let me continue with the taxotere - and I DID NOT REACT!  I had no extra steroids or phenergen like usual (had them on hand in case I reacted) but they did start the drip off slowly and gradually increased it - worked like magic! Now why they didn't try this earlier I do not know - but I'm feeling quite okay tonight as I'm not doped up on extra steroids and phenergen.",
      "MessageIndex": 20,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753507",
      "Title": "TC Chemo really not bad so far KGBinDC KGBinDC"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jun 30, 2010 10:22PM DancerMel28 wrote: KGB - I'm the same as you - have nothing apart from the decadron for three days (day before, day of and day after) and the anti nausea meds for 2 days after (and others on hand just in case).  I've been okay with everything so far - have my last round tomorrow so hoping that everything's still ok with counts but I'm feeling fine so should be right! Main issues have been with my mouth - really dry, awful taste (had 3-4 days this round that the only thing I could stand to drink was pepsi aaargh!!). Got dry eyes, have to keep on top of the constipation.... but everything has been 'manageable'. My only issue with the Taxotere - is that I react to it within a couple of minutes of it beginning to go through the drip. But once they stop it give me extra meds and restart after 1/2 hour I'm fine with it. I know what to expect now so the reaction doesn't get as far thorugh as the first time but I know the nurses were worried after my last round as they gave me extra stuff before hand to try and stop the reaction and I still reacted!  My onc was happy to restart it again and I was fine as per the first two rounds. There was talk of changign me to A but I dont' want to change (for a lot of reasons) so when I see my onc tomorrow before my chemo I have to convince her to not change it! ",
      "MessageIndex": 19,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753507",
      "Title": "TC Chemo really not bad so far KGBinDC KGBinDC"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 18, 2010 09:00AM DancerMel28 wrote: Oh Emme - That was me on Sunday.  Saturday Evening I sat watching tv and my hair was just coming out all over the place. It put me in such a downer on Sunday - I was grumpy with everyone.  I was surprised as I'm not normally one that fusses over my hair so the fact that it hit me so hard came out of left field a bit.  I wore my scarf yesterday for the first time - I haven't completely lost my hair but from Friday to Monday the difference so so much and I had a bald spot at the front.  I'm feeling better now - have made the decision to shave what's left tomorrow morning (everyone kept asking when are you going to shave - I just couldn't go there until today and won't promise not to cry when the rest is shaved off!) and am going to a wig shop on Thursday (before TC #2 on Friday) to see if I want to get a wig. I hope you feel better soon - like you said in your post your half way there.  I guess we just have to continue to take it one day at a time and we are so lucky to have this wonderful group to help us through",
      "MessageIndex": 463,
      "PostDate": "18/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jun 3, 2010 12:53PM DancerMel28 wrote: My gosh how time flies!  It feels like only yesterday that I had my 2nd TC but it was actually 2 weeks ago - so only have 1 week left before #3.  I feel like I've still got so much left to do before I begin the cycle again. I've actually started to worry a bit - I've had a reaction to the taxotere both times so far and I'm really hoping that I dont' have a 3rd reaction (it's just not fun!!).  My Oncologist has actaully lowered my dose of steroids too - instead of starting the mornign of the day before, I now only start the night before. SO will only have 2 doses before my chemo.  I had a reaction the second time even though they put extra steroids through the IV before starting.  So I really don't know if I should contact my Onc to question the lesser dose (I only found out she'd changed it when the pharmacist brang my meds up to me during my chemo), I think she changed it as I've broken out in a rash in the week after my first treatment which she thinks was caused by the steroids.  Who knows!!!  Anyway - I guess we'll see what happens.  Hope everyone's doing ok today. ",
      "MessageIndex": 561,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jun 4, 2010 02:26AM DancerMel28 wrote: ellen_1959 I've had a reaction both times so far - the first one I had this awful feeling start in chest that moved down to the pit of stomach, I went bright red, my heart started beating really fast and had shortness of breath.  They stopped the drip gave me extra shot of steroid and when they restarted I was fine.  THe second time I said to the nurse I hope I dont' react again, and before starting it they gave me the extra shot of steroid first, but I still reacted - I got it stopped quicker this time as I knew the 'wrong' feeling straight away so alerted the nurses befroe it got too bad. Then they gave me some phenergen and aagain when it restarted I was fine.  THey told me initially that you can have a reaction the 2nd time but very rarely the 3rd. But after I reacted the 2nd time they said if it happens again they may change my dose (which I sorta don't see the point of as I'm only having 4 cycles - I figure they may as well just leave it).  I just hope that the reaction doesn't get worse each time. My Oncologist has been really good (apart from the not telling me she changed the dose of steroid), I always have an appointment on the day of my chemo for review before I start my chemo that day so can bring up any issues then.  I have numbers I can ring 24/7 if any side effects which I've only had to use once and they were really helpful. (I'm in Australia not sure if you're in states like a lot of people??).  My hospital where I'm being treated is a specialist hospital for cancer patients so they seem to have a few extra things in place to help which is good.",
      "MessageIndex": 565,
      "PostDate": "04/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jun 11, 2010 08:03AM DancerMel28 wrote: Well what a day!! Had my 3rd round of TC today - and it nearly didn't happen! (after staying down last night and having a 3 hour drive!) Started off with my 9:00 appointment with my Onc being 20 mins late getting in (what the hell - first appointment of the day???). By the time we discussed what needed to be discussed and I got out of there and up to the 5th floor Chemo Day unit I was 30 mins late for my appoinment up there.  So I sat there waiting....waiting.....waiting.... it got to 11:15 and I asked how much longer as my appoinment was supposed to 9:30 and heaps of others that got there after me were going in before me.  Finally at 11:30 got in there. Started off with extra pre meds to avoid a reaction to the taxotere (phenergen AND extra steroid) waited 1/2 hour for them to kick in. Then they started the T and guess what? Yep had a reaction for the 3rd time - I've officially been labelled a trouble maker by the nurses haha.  So they stopped it gave me MORE phenregen and steroid and then while i settled down I heard them discussing me behind me - saying that they didn't want to proceed with it! Even though I'd told them that both times before once it restarted I was absolutely fine. SO they ring my Onc who came up to talk to me. Basically they don't know why I keep reacting as today they did absolutely everything to Prevent the reaction and it still didn't work. However, she was happy to restart it (which I was fine for the remainder of thankfully) but now she wants me to change regime to AC instead of TC (so only changing the T to A but keeping the C).  As funny as it sounds I dont' really want to change as I only have 1 more round so figure I know what to expect and what side effects I geneally have and don't really want to stuff the system up by chanigng now.  If I still had 3 left or somehting I'd go with it but I'm really in two minds!  She said to think about it and gave me thie information so that I can read about and we'll make a decision when I see her next. So all in all a frustrating day - didn't leave hospital until 4:15 then had to face peak hour traffic and long weekend traffic so the trip home took a lot longer.  Such a long day and now I don't know what to do about my last treatment",
      "MessageIndex": 608,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 12, 2010 08:50AM DancerMel28 wrote: Hi Jan - the fatigue has hit me a bit harder this final round - only really been last two days that I've felt like doing anything and I tire so easily after doing not much.  The dry eyes are really driving me crazy - the eye drops don't seem to be makign as much of an impact at the moment. Hoping they fix themselves really soon. I was also wondering about the hair thing - I only shaved to a #2 back in May when i began to lose my hair and i still have these wiry little bits hanging on for dear life. Was thinking of shaving it completely for a fresh start (also would feel more comfortable with people seeing me completely bald as compared to these weird sticky up bits!) but I've been too scared to shave them off completely in case nothing comes back (seems silly I know but still.....) Emme - it's so hard - just when we think we're getting on top of things and the SEs new things happen or things continue on that we thought were done with. Hope you're feeling better soon.",
      "MessageIndex": 779,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 13, 2010 08:33PM DancerMel28 wrote: So thought I was travelling really well (apart form the tiredness) after this final chemo but today I just feel like a twitchy-nose bleeding freak!  My eyes are so dry and they just keep twitching - I can't concentrate on anything, the nose bleeds have started again (20 mins this morning - ick!) Plus when my nose is not bleeding I have a twitch at the side of my nose.  I just want to do normal stuff - but the eyes are keepign me awake so I'm getting more tired!! Grrr - sorry just had to vent! Off to put more eye drops in........",
      "MessageIndex": 783,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 29, 2010 05:59AM DancerMel28 wrote: Emme - my thoughts are with you, glad you're taking some time for yourself - something we all need to do at times during this - but I think you definitely deserve this time to yourself. Shelley - I broke out after 1st taxotere, onc said was steroids. Didn't happen as bad as the first time again - just occasional spots but nothing like the rash that first time. ArubaJan - good to hear from you.  I have a close friend at work who has been on tamoxifen for 2 1/2 years so I was quizzing her about the SEs she'd had.  She said that there was a pattern to her moods - and had worked out in particular that there were 3-4 'really bad days' that she warned her husband and duaghter when she felt it coming on and they knew to steer clear, as she said that tiny things would send her off and she just generally feels low on these days.  Overall though she said that she was generally ok most of the time.  My guess would be that we will all need some time for our bodies to adjust to the tamoxifen - hopefully things settle down and you feel yourself again soon! I see my onc on Aug 13th about hormone therapy so I guess will find out for myself once I begin..... Overall am starting to feel a little more like myself again - been 4 weeks tomorrow since my last chemo.  Last week was quite a struggle emotionally - just didn't feel myself at all. I think the not sleeping part wasn't helping either - finally took a sleeping pill and boy what a differnece a good night's sleep makes.  Had my second surgery this morning to fix my scar - 20 min surgery and was only under a local not general anaesthetic so feel pretty ok right now.  Just fingers crossed that I don't get an infection this time!",
      "MessageIndex": 886,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Aug 6, 2010 08:37AM DancerMel28 wrote: Hello everyone, Well I've had my surgery last week to fix my scar - all is going well so far. Had the dressing taken off yesterday and it's looking soooooo much better - I just hope it continues healing well with no infections this time (fingers crossed!).  I had my first appointment with rads onc on wed - I'm changing centres for rads to be closer to home (45 min instead of 3 hour drive each way) so I was abit nervous at first but they were all really nice and doc was excellent put me at ease straight away.  As I have to wait for incision to heal I'm boked in to start in less than 2 weeks - have my planning session first next wed then begin a week after that.  Have 6 weeks of driving to do.  But I am getting so excited - I can finally see the end is coming!!!!  I'm going to see my boss next week about easing back into work once I finish rads. I've decided not to go back full time to begin with (teaching full time is just abit too much right now stamina wise) so will start slowly and see how I go.  Hope everyone is well - things are a little quiet on here at the moment. Hopefully it's just that everyone is out in the sunshine enjoying SE free days!  Wish it was summer here - I'm so over the winter chill!",
      "MessageIndex": 922,
      "PostDate": "06/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Aug 11, 2010 09:39PM DancerMel28 wrote:",
      "MessageIndex": 942,
      "PostDate": "11/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Sep 4, 2010 09:02AM DancerMel28 wrote: Ok so I'm sorry in advance as I'm going to vent big time and its not really a chemo related thing. My husband is going to be turning 30 in early November so I've decided that I want to throw a little get together - just mainly family and close friends.  He's not really a 'party boy' as such so thought a sunday lunch would be nice - good food and some drinks.  I had decided to hold it at home to save hiring a venue but get someone in to cater so I didn't have to worry about cooking and cleaning up (basically take the stress out of it all). Got some prices - nothing extravagant but will cost a little bit of money but defintiely not too much more than if I'd got all the food and cooked it all myself.  So I'm happily making plans (giving me something to do in between rads appointments) and today my Mother in Law found out what I was planning. She basically turned up her nose and said it'd be cheaper to buy the meat and spit roast it yourself rather than pay someone to cater.  She made me feel stupid for spending money when i'm not in work (though up until 2 weeks I ago I was on full sick pay and now am on half pay long service leave which is covering the mortgage just fine!) and that I should be saving every penny as we were destitute.  I just want to do something nice for my husband - we've had a horrible year overall and as things will be 'getting back on track' soon once I finish Rads I just thought it would be a nice thing.  It's not like I'm spending our life savings on a silly party. Grrrrrr! I'm just so angry that I let her upset me.  My DH had a party in his garage for his 18th (can't have too many people traipsing through the house and messing it up), he just went out for dinner for his 21st, so this was my way of putting on something special for him, Sorry - its trivial I know but she just makes me so angry - not everyone wants to miss out on life for the sake of saving a dollar or two. It' s not like you can spend your money when your dead. We haven't had to rely on them for money or anytihng these past months so I don't see what her problem is. Ok rant over - again sorry - just had to get it out somewhere!!! Hope everyone's having a great weekend :-)",
      "MessageIndex": 1065,
      "PostDate": "04/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Sep 6, 2010 01:17AM DancerMel28 wrote: Thanks everyone for your comments - I just had to get it out.  I can't say anything negative to my DH about her as he gets all defensive adn they've been a few 'little' things building up lately and that was just the last straw! Keli - I hope you're feeling better after your 3 day weekend. It must be such a big adjustment for you.  I'm counting down until I'm back at school - thankfully as it's near the end of our school year I will just be 'filling in' where needed when I go back in Oct so won't have to write reports or anything which will take the pressure right off. Marcy - Glad to hear you had a lovely weekend away.  It's so nice to go away and 'forget' for a while. JenC - I'm sure you're son is going to love the party no matter what - space theme does sound like fun! Dutchgirl - Rads are a breeze - except for the travelling for me which is a pain.  I've just had #13 and will hit the halfway mark on Wednesday. Skin is a bit pink but the cream they've given me is soothing things so far.  They keep a very close eye on the skin (between the rads techs, nurses and my rads onc) and apparently I'm 'pinking up right on schedule' according to my doc. Sounded like he was cooking haha! Good luck on Tuesday hope it's as easy for you also. raerae - my hair is really coming back in force now (8 weeks from day of last infusion).  Have multiple colours coming thorugh so will be interesting to see what it's like in few weeks.  I think I saw someone on here describing the regrowth as salt and pepper - quite apt!",
      "MessageIndex": 1072,
      "PostDate": "06/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 10, 2010 11:48PM DancerMel28 wrote: Bon - I had daily headaches after tx #1 but i put it down to a combination of things - i usually woke up with it so think I could of been a bit dehydrated once I got going and started eating and drinking I felt a bit better (paracetamol helped too!)  also I think my scalp was hurting from my hair which also didn't help. I found the headache wasn't really a factor through tx #2-4.  The sore neck happened for me each time - usually hit day 4 and hung around for a couple of days, they were generally my worse days in the whole cycle anyway.",
      "MessageIndex": 27,
      "PostDate": "10/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753507",
      "Title": "TC Chemo really not bad so far KGBinDC KGBinDC"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Sep 1, 2010 06:55AM DancerMel28 wrote: \"Ok so my new obsession is rubbing my head..the hair is so soft..I find my self feeling it all day long..\" sacphotomom Hehehehe - I do the same thing",
      "MessageIndex": 1428,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 18, 2010 01:20AM DancerMel28 wrote: Hi CTherese, I also woke up with headaches around days 5, 6 and 7.  I found that it went away after I had something to eat and drink and just began my day.  Not a nice feeling though when you first wake up.  I am now getting ready for my second TC this Friday and for the past week have felt really good - the headaches went away as I started feeling better. Hope that's the case for you also :-)",
      "MessageIndex": 321,
      "PostDate": "18/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 4, 2010 02:48AM DancerMel28 wrote: Hi KGBin DC - yes I'll be moving onto tamoxifen. Am seeing my Onc in 6 weeks which will give me time to get over last chemo, and operation to fix my scar. My onc was going to discuss it with me at my appointment before chemo but ended up haveing to discuss other matters - chance of mild lymphodema in my arm so referral to physio, and also due to complications earlier she had forgotten about possibility of genetic testing so that referral had to be done too. Also have rads coming up - haven't met with them yet as it will be done at a different centre closer to home (was not willing to move 3 hrs away for the daily rads will be bad enough with 35 minute drive each way as it is).",
      "MessageIndex": 23,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753507",
      "Title": "TC Chemo really not bad so far KGBinDC KGBinDC"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 2, 2010 07:28AM DancerMel28 wrote: Hi Girls, Just got home from my final chemo - my Onc let me keep going with the Taxotere (thank god!) BUT guess what??  I DID NOT REACT!!!!!!!  Save the best for last I guess.  I didn't have any extra steroid or phenergen to begin with so I was sitting there expecting it to happen - but you know what the nurse did today that they ahven't done any other time?  Started the drip SLOWLY and then gradually increased it - worked like magic!!  Now if they'd done that the 2nd and 3rd time I may have avoided those reactions - benefit of hindight I guess. sacphotomom - I too was worried - my onc decreased my dose of dex to just beginning the NIGHT before instead of the morning of the day before, but when the pharmicist gave it to me he said that the dosage wasn't decreased by much so wouldn't make much difference.  I think it may've helped with the rash that I had the first time which I didn;t have the 2nd or 3rd rounds. With my expereince it didn't really matter what they gave me before hand - I think if you're going to react you are going to react - all three times for me as soon as they gave me extra meds then restarted the drip I was fine. It's scary the first time but the nurses know exactly what to do to fix it.  My body handled it a lt better today with no pre-meds but a slower drip so go figure!  TIme wise - the first 3 took prob 1 1/2 hours or so as mine was stopped in the middle each time due to my reaction and they had to wait before restarting, today it only took about an hour. apparently T is one of the longer ones I think? xraygirl - I've had 4x TC and have had the steady weight gain each round grr!!!  Unfortunately because of taste issues I find I'm attracted to ANY food which has a strong sugar/salt taste which is all the food we probably shouldn't be eating.  I'm resigned to that fact that due to some fatigue and the fact that I'm not working at the moment means I'm definetly not as active as I usually am - I'm hoping now that i've finished my last one I can slowly build myself back up with my fitness and hopefully (fingers crossed) I can lose the weight again.  I find taking the colxyl and keeping on top of constipation helps with the bloating a bit - but it's mostly from the water loading unfortunatley.  Sorry not much help!",
      "MessageIndex": 857,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jun 11, 2010 06:39PM DancerMel28 wrote: hi fotopet, I'm in the same boat with you in regard to the alergy to T. I had my 3rd yesterday and again reacted - even after they gave me all the extra premeds they could (steroid and phenergen).  I have one more cycle to go and now my Onc wants me to change to A.  I'm a bit reluctant as I know what to expect with T - the reactions have all been the same except I get it stopped quicker as I recognise the symptoms straight away and after more med boost the restart is fine, I know what to expect afterwards in regard to side effects etc so I don't know what to do!  I can understand that they say that my body is put under more stress with the reactions but with one more to go what's the point of changing and not knowing if I'll have a whole new round of SEs that are harder to handle?? So confusing! Hope you work something out to help you. Just thought I'd share that I have to make the same decision. Mel",
      "MessageIndex": 681,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 20, 2010 01:38PM DancerMel28 wrote: Hi girls, just catching up on all your posts.  RE: Taxotere reactions - my last chemo I had no extra premeds, the nurse started it slowly and increased in increments and I did not react. Shows that the key with taxotere seems to be to begin SLOWLY!  Wish I had of known it earlier may have avoided a reaction or two! Keep strong! Mel",
      "MessageIndex": 1044,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Aug 2, 2010 10:13AM DancerMel28 wrote: Barb - I posted this article on the april chemo forum but I think it might help you too.  I found it on an aussie forum that I'm a member of - and the article just put into words exactly how I was feeling now that chemo is over.  Last week was probably the worst week for me - just didn't feel myself, didn't have any desire to do anything at all and I just couldn't understand what I was feeling full stop.  Then I found this article - helped me a lot and I am beginning to feel a bit better as I think I understand more about why i'm feelign what I'm feeling.  Not at the end of it all yet but I will get there. Hope this helps. http://www.cancercounselling.org.uk/northsouth/extra4.nsf/WebResClient/1761049276601BD68025735B00604834/$FILE/article3.pdf?openElement",
      "MessageIndex": 1167,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jun 24, 2010 02:25AM DancerMel28 wrote: Hi Day and Redbarb, Just dropping in from the April group (I started at end of april - so my timeline is closer to a lot of you May girls!).  I've had 3 lots of TC now - and have reacted to the Taxotere all three times during the infusion, but once they stopped it and gave me more meds it restarted and I was fine.  My onc got called by the nurses the last time because they didn't want to restart it - but my onc said that I'd already had the reaction so she was happy for it to restart then but she wants to change my last one to A. I said I didnt' want to change as: I've only got one left, I know what happens with the reaction and get it stopped pretty quickly, there's no guarantees that I won't react to the A, and I know what SEs I get and how to deal with them - don't want to have to worry about new SEs at this late stage!!  So she said we'll see - gave me the info on A and said we would make a decision when I see her next. So I'm gearing up for a fight.  I just don't want to have to make more decisions at this time grr!  It's amazing what our bodies have to deal with during this chemocrap hey? Mel",
      "MessageIndex": 798,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "May 16, 2010 01:30AM DancerMel28 wrote: JennyB & Sacphotomum - Hi I started TC April 30th (so have been checking both april and may threads) and am on day 16 now. I too am having same issues with hair - I didn't think it would really affect me so much but am on a bit of a downer today as last night it was just falling everywhere!!  I reckon I only have about a third of my hair left - bald spots are appearing but I can still sort of cover it but I know myself that they are there. So when people say to me - \"Oh but you can't notice it\" - I get so defensive as I know they are there and that my hair is not MY hair anymore.  *sigh* must try and snap out of this funk - I keep thinking now I get to wear my beautiful scarves. Oh and from what I've read about the taxotere - there is a rare(ish) side effect that hair either takes a long time or doesn't regrow after it. My Onc didn't say anything about that to me - only found out through reading these threads so am hoping that it is on the rarer side fo the possible SEs.  I think it comes back to the 'it affects everyone differently' and it's too hard to predict exactly what may happen as our bodies are so different.  Here's hoping it all goes to plan hey? Bye for now, Mel",
      "MessageIndex": 284,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "DancerMel28…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100628/profile",
      "Content": "Jul 2, 2010 06:53PM DancerMel28 wrote: Hi Day - such a nice feeling not to have a reaction hey? I wish I had of told the nurses earlier to start slowly to see if that helped as I'd read about it in posts on here- I just presumed they had tried that, I must keep remembering not to presume anything!",
      "MessageIndex": 863,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    }
  ]
}