{
  "AuthorID": "danielle3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
  "Posts": [
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 22, 2013 05:52PM danielle3 wrote: I just read your story - I do hope everything goes well for you. Enjoy your time with your family too and try to just have fun!",
      "MessageIndex": 95,
      "PostDate": "22/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Feb 10, 2014 05:26PM danielle3 wrote: Keeping my fingers crossed and prayers for you that everything will be okay! Please keep us posted - and do enjoy your vacation when you go!",
      "MessageIndex": 107,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "danielle3 wrote: I am new here. A couple weeks ago I had severe itching in my right nipple / areola to the point I actually woke up itching this. This lasted for a couple of days then stopped, with occasional itching, only this breast. After the itching stopped I noticed flaking and the areola had a different texture. This prompted me to re-schedule the mammogram that had been canceled in the summer. I had my mammogram last week with no results as of yet. I did make an appointment to see my doctor, but because the flaking stopped, I canceled and decided just watch this area. Now, I notice a spot on the same breast that looked like a cluster of \"blackheads\" so I felt this spot last night and noticed a \"new\" lump. Very small, but there. I have a history in this breast of spongy lumps and under this armpit swollen lymph nodes that are non-cancerous. This breast  has always been a little bigger than the left, but now it seems bigger than it should be, and the patch on my areola is white. My breast is not red, and I am not in pain. Just worried, as my mom had breast cancer and not hearing anything yet on my mammogram gets me nervous. I shouldn't read things on-line but I do, and one worry was paget's disease of the breast, as the symptoms can sometimes \"wax and wane\". Thanks to anyone who reads this. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 20, 2013 12:29PM danielle3 wrote: Ok, so now today, the same area where I had the flaking is back, and it's dry and feels more tender. Still, no mammogram results. If it is still there tomorrow I will call the doctor. I have read some on other threads regarding paget's - and I am worrying. *Mental note to stay positive*",
      "MessageIndex": 3,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 20, 2013 06:53PM danielle3 wrote: Thank you Stephanie. I called my doctor and have an appointment tomorrow at 9:30AM - As I was explaining to the nurse (I have known her for 25+years now!) she told me he may give me a cream, I told her  \"I want a biopsy\" she said \"well he just may do that too!\" I am going to insist on the biopsy though because this is different. I made my husband feel the area he's like \"it feels ok\" then I had him feel the other side and then he noticed the difference too. I also made him look at the area I am unsure of, the cluster that looks like blackheads,  and push in and feel, and he also felt the small lump I felt. He couldn't tell me what he thought that area looked like though. I actually live near Worcester, so unless I get very bad news, I am going to stay in the area. Going elsewhere will depend on future assessments. I will keep t in mind though if the latter is the case, the Providence area. Thank you so much! Will post tomorrow on what transpires at the doctors.",
      "MessageIndex": 7,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 21, 2013 12:11PM danielle3 wrote: juneping, I am 47 years old.",
      "MessageIndex": 10,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 25, 2013 12:00PM danielle3 wrote: Well, I got some good news. From what they saw it looks like it is a cyst. However, they do not believe the cyst is \"communicating\" with the ducts. This is in the nipple area. I have to go back in 6 months for a follow up Ultra Sound and Mammogram again to look for changes. As for the dry skin and itching, same story from the radiologist. Use cream see a dermatologist. Aerola is the skin of the breast not the breast itself. So, I will wait and watch for the dryness. She said it could be eczima. I am still worried about that though as it is only on one and not the other. I will watch it closely though. Thank you for your support and will keep you updated!",
      "MessageIndex": 17,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 20, 2013 12:56PM danielle3 wrote: I am in Massachusetts. Even if I called today I still won't be seen today. I was trying to wait for the Mammogram Results to come back too - I will call today.",
      "MessageIndex": 5,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 21, 2013 11:19AM danielle3 wrote: Ok, so I went to the doctors and my mammogram results are back. I have to go for an ultrasound and a diagnostic mammogram of the right breast - this is scheduled for Monday, at 8:30. The spot that I noticed is where they found a mass and they need to test it further. My doctor said it could be a cyst, as when he pressed in that area it hurt. But the test will confirm whatever this is. As for the dry area on the nipple, I was told to us hydrocortisone cream. I did ask for a biopsy and he told me I need to take the steps needed and then if a biopsy is required then I will get one. He was not concerned even when I mentioned paget's. He said the areola is the skin, and cancer happens underneath. I was not getting into it with him, and said \"ok\". Yes, even though I researched this and have a concern, and paget's does \"wax and wane\" like the spot on my areola, and presents itself on the skin, he was kind of irritated I think that I looked up my symptoms on the internet (I told him I looked up my symptoms). But, it was because of that severe itching that I had along with that dry area and flaking, and that research on the internet that pushed me into full mode to reschedule the Mammogram that was canceled in June. And it was after my mammogram I found the spot that looked like a cluster of blackheads with a lump underneath it, that they found on the mammogram. However, this is in the same breast that I have swollen lymph nodes, the \"lumpy\" breast. I love my GYN but today I was upset with him. Sometimes I think doctors are so used to getting reports such as this that they don't realize the anxiety the patient feels, and don't want to talk about what actually prompted the visit, which was not the lump, but the dry spot that prompted me to get moving, which was the reason the lump was found.  Okay - thank you to whomever reads this!",
      "MessageIndex": 8,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 19, 2013 12:19PM danielle3 wrote: Thank you!",
      "MessageIndex": 2,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 24, 2013 09:05AM danielle3 wrote: Well tomorrow is my US and Diagnostic Mammorgram. I have the dry spot back on my areola with flaking again. Reading more stories and watching youtube video \"vlogs\" gets me more worried and anxious. I know chances are everything is going to be ok, but there are always those other chances. *Trying to stay positive* but can't help those other feelings of negativity. Keeping busy and trying to get the house in order for Thanksgiving helps, but it's times like this in the morning that keeps me searching. Thank you for whomever reads this.",
      "MessageIndex": 11,
      "PostDate": "24/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 24, 2013 02:04PM danielle3 wrote: Graceber - will be thinking of you tomorrow too! please keep us posted on the with the results!",
      "MessageIndex": 15,
      "PostDate": "24/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 24, 2013 02:02PM danielle3 wrote: thank you juneping!",
      "MessageIndex": 14,
      "PostDate": "24/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    },
    {
      "AuthorID": "danielle3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192081/profile",
      "Content": "Nov 25, 2013 12:01PM danielle3 wrote: Good luck with your appointment 760Liss! Let us know how things turn out!",
      "MessageIndex": 18,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814727",
      "Title": "Question on Itchy Nipple / Areola danielle3 Moderators"
    }
  ]
}