{
  "AuthorID": "Dani18",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179963/profile",
  "Posts": [
    {
      "AuthorID": "Dani18",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179963/profile",
      "Content": "Jun 23, 2013 10:31PM Dani18 wrote: Of the three tests (mammogram, us and MRI) the MRI is the most accurate for size. I also had my MRI after my biopsy and the surgeon told me there could be scar tissue but I just received my pathology report this week and the cancer was 2.3 cm which was the exact size estimated by the MRI. My ultrasound had it at 2.2 cm though so I didn't have the discrepancy that you did. Unfortunately there is no way of knowing until after surgery. Believe me I know it's hard but you will get through it.",
      "MessageIndex": 2,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/806610",
      "Title": "MRI results--confused. kika2013 fifthyear"
    },
    {
      "AuthorID": "Dani18",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179963/profile",
      "Content": "Jun 11, 2013 10:52AM Dani18 wrote: I was in the same position as you.  Trying to decide between lumpectomy and mastectomy (just one as I live in Canada and my breast surgeon advised me he would never agree to do a mastectomy on a healthy breast).  I also only know that I have IDC estimated at 2.2 cm and it is grade 2 and won't know anything else until after surgery.  I spoke with my family doctor and told her I didn't feel I had enough information to make the decision for a mastectomy and that I thought I would go with a lumpectomy and then decide after the pathology.  She totally agreed with my decision and told me she has another patient who is 3 years out from her treatment and is still having issues with the mastectomy.  Two failed reconstructions and currently still dealing with infection from third reconstruction and that emotionally the mastectomy took a bigger toll on her then the cancer treatment.  When I advised my BS he felt it was the right decision and that as I will almost certainly be having chemotherapy (due to size of tumour and my age - 42) I had lots of time to decide if I wanted to have the mastectomy before radiation.  He said he feels that the Angelina Jolie story makes it seem like mastectomy and reconstruction is a walk in the park when in fact for a lot of people it really isn't.   Although I may ultimately have the mastectomy after pathology and speaking with the oncologist, I feel that I will have made the decision with all the information instead of the little bit I have now.  My lumpectomy and SNB is scheduled for Thursday and at this point I'm just anxious to finally have something being done to get rid of the cancer. It's a tough decision but I think you have to do what feels best for you.  Good luck!",
      "MessageIndex": 4,
      "PostDate": "11/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/805959",
      "Title": "Need to make a decision...would like help from all of you... peace777 ruthbru"
    },
    {
      "AuthorID": "Dani18",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179963/profile",
      "Content": "Aug 8, 2013 04:41PM Dani18 wrote: The waiting is definitely the hardest. I just received my results last week. I can't imagine how frustrating it must be to be told they have to do it again. I'm in Canada and the report was ready in less than two weeks so hopefully you won't have too much longer to wait. I felt the same way you did and almost told them I'd just go ahead with chemo without the result because its cancer and we should be doing something but then my RO pointed out that the most important step was done which is removing the tumor the rest is insurance so we have time to wait. I think especially for those of us with grade 2 the Oncotype is an important step because it really could go either way with chemo. Even though all other protocols indicated i should have chemo because it was over 2 cm and I'm fairly young my oncotype score came back low which means my cancer doesn't benefit from chemo so all I'd get out of it is the toxicity. I hope you get your results soon.",
      "MessageIndex": 5,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/808993",
      "Title": "Oncotype test-waiting and waiting.... brown471 SpecialK"
    },
    {
      "AuthorID": "Dani18",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179963/profile",
      "Content": "Aug 15, 2013 03:00AM Dani18 wrote: Ovarian suppression is where they shut down your ovaries to stop them from producing estrogen either through an injection (Zoladex) once a month or surgery. It basically throws you into menopause. The advantage to the injections is if I don't tolerate it I can stop them and reverse the effect. Rhody - I've actually heard of that happening before. The samples are tested differently for the pathology report then they are for the oncotype. I hope you get some answers soon.",
      "MessageIndex": 10,
      "PostDate": "15/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/808993",
      "Title": "Oncotype test-waiting and waiting.... brown471 SpecialK"
    },
    {
      "AuthorID": "Dani18",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179963/profile",
      "Content": "Aug 9, 2013 03:45AM Dani18 wrote: Wow, I'm 42 and my surgeon said the same thing! It definitely made me hesitate when my oncotype came back low. Luckily my other 3 doctors reassured me that age use to be a reason for chemo but they knew a lot of people were having it and not gaining any benefit from it but they weren't able to tell between who needed it and who didn't so they gave it to everybody who fit a certain criteria. Now they are able to look at the molecular makeup when you are ER and PR positive and for some people hormonal treatment is more effective. My MO also said that they think some people benefitted from chemo because 50 percent of the patients go into menopause but that there are other ways of doing that without the toxicity. So on top of Tamoxifen she told me to consider ovarian suppression.",
      "MessageIndex": 7,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/808993",
      "Title": "Oncotype test-waiting and waiting.... brown471 SpecialK"
    }
  ]
}