{
  "AuthorID": "Danie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
  "Posts": [
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "May 31, 2009 10:35PM Danie wrote: Dear lynt, My brother had lung cancer and I was his care giver at home.  He had the same phlegm problem.   The Doctor had mentioned to me that it was not worth suctioning the phlegm out as it would come back a quick as we take it out.  What he gave my brother was a medication that dries up the phlegm.  There is one that can be taken orally which he took for a couple of days, then he was given an intravenous medication.  The intraveous medication does cause lots of sleepiness though.  One problem with these two med's is that it also dries up the throat, mouth and nasal cavaties, thus being also incomfortable but better than the phlegm billed up.  Besides these medication, I don't think there was any.  I wish you good luck with your journey.  My thoughts and prayers are with you and your Mom. Comfort hugs, Danie",
      "MessageIndex": 3,
      "PostDate": "31/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735057",
      "Title": "large amount of phlegm in throat and lungs lynt lynt"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 19, 2009 12:23PM Danie wrote: Thank you for your response Becky.  I had a CT scan in June, but there was no mention of this on the results.  I told my onc of this when I went for the CT results and he told me it was probably from the bone disease.  I am going for a PET scan at the end of Nov., so maybe something will show on this.  I have bone mets and is currently in a rib, just above my numbness.  My numbness does sound like the same area as yours and is about 4 inches by 6 inches, but mine is constent I just feel nothing all the time.  It doesn't bother me to much as I don't feel anything, thus numbness is better then pain.  I just wanted to know if it could be something else causing it, so maybe I can get it fix.   Maybe, I'll talk to my GP about it, to see what he will say. Comfort hugs, Danie",
      "MessageIndex": 2,
      "PostDate": "19/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742382",
      "Title": "New symptom for my bone mets, Numbness??? Dr. says bone disease. Danie Danie"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Danie wrote: Hello to all, I have developpe a numbness in the left side of my middle back.  It starts from the vetebrae area to the side and its on my left side just below where I was diagnose with rib mets.  My rib is very painfull, but this new symptom of numbness just below it started about 6 month's ago and is a steady numbness feeling.  It feels like when being frozen at the dentist, but it's in my back.  My onc say's it is the bone disease causing this numbness, but I was wondering if it could be something else.  Has anybody else had this numbness symptom for their bone mets??? Comfort hugs, Danie  Dx 6/27/2007, IDC, 2cm, Stage IV, Grade 3, 1/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742382",
      "Title": "New symptom for my bone mets, Numbness??? Dr. says bone disease. Danie Danie"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Nov 7, 2009 05:58PM Danie wrote: So sad to hear this new.  Ron, family and friends please accept my deepest condolescence.  My thoughts and prayers are with you all. Comfort hugs, Danie",
      "MessageIndex": 28,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743454",
      "Title": "Luv2Travel is an Angel now LuAnnH BonnieVA"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jan 25, 2008 10:04AM Danie wrote: Hello to everyone, Thank you for the comments, they will be helpfull.  I am in a major cancer centre, called Tom Baker Cancer Centre.  Thus, there is many oncologists.  I am trying to call other bc ladies that I now to see how are their oncologist.  I would like to know if we are dealing with the same problems.  I know the onc's are very busy and maybe they just don't have the time.  I would also like to put a complaint, but I am worried that the onc's at the Tom Baker are all very close and having them all mad at me or have the reputation of being a complainer. I do have copies of all my reports.  I started that from the very beginning. I tried to call the patient relations at Tom Baker, but she is on holidays till Feb.19th and nobody is replacing her.  I also tried my surgeon, but he is gone till next week.  I called my GP today for recommendation for a second opinion.  He hasn't called me back yet, but I'm sure he will be helpful.  I am very upset and discouraged.  It makes you feel worthless.  I am a person who would do anything to help another always with a smile, thus I find it very difficult to be treated this way.  Maybe, this is the problem, I'm to nice.  I guess I'm going to have to start to be more agressive, which I find it a shame that this is what cancer is going to change me into.  Thank you for your support, it is nice to be able to let these feelings out. Hugs, Danie   ",
      "MessageIndex": 5,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699146",
      "Title": "Steps for second opinion or search for new Onc. Danie awjkej"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Danie wrote: Hello ladies, I would like to have a second opinion regarding my case or maybe even look for a new onc.  Does anybody know what the steps would be for this. Last Friday, I was to receive results from my various scans (bone scan, CT scan, MRI).  First when I got in the office, my onc. mentioned to me that my spine was fine from the MRI, but they had not mentioned anything regarding my ribs.  My ribs was the concern from a previous bone scan showing a hot spot on one of my ribs.  Thus she said \"probably no news is good news\" and said she would call the radiologist to ask him about the ribs.  I also mentioned to her I had a CT scan results.  Thus she said she would read it later and call me back regarding the scan and MRI rib report, but not to worrie since it is probably nothing.  Then she left and we talked to her nurse a little bit and prepared to leave.  My husband and I were talking about celebrating the good news as we were leaving the office.   I hear my onc. screaming from the hallway to come back saying that I needed a bone biopsy.  Thus we return and she says after reading all 3 reports including the rib ( I guess she had missed it) that I have bone mets.   I was clinically diagnosed with the scans, but they were not 100% sure that it is bone mets, thus a bone biopsy would confirm this.  Then we left the office for a second time, but this time with terrible sadnest.    She called me yesterday to tell me that they could not do a biopsy, since the bone was to small and to much risk in puncturing the lung.  She is sending me for radiation and put me on tamoxifen.  Shortly after talking to her on the phone yesterday, I called her nurse and mentioned that I would like to meet my onc. in person to discuss these issues further and had more questions for her.   Then I made an appointment with her.  Her nurse called me back today to cancel the appointment I made, because my onc. said that there was no need for us to meet again and rescheduled my appointment for in 3 months and that I would have another bone scan at that time.  I feel no support from my onc. and I have lost confidence in her.  I thought that they were there to explane us of what was going on with our health and giving us option to treatments.  I guess this is not the case in my situation.  Does anybody else have the same experiences with their onc.? Anybody from Calgary with a good onc. to recommend? Thx for your inputs, Hugs, Danie  Dx 6/27/2007, IDC, 2cm, Stage IV, Grade 3, 1/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699146",
      "Title": "Steps for second opinion or search for new Onc. Danie awjkej"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jan 22, 2008 12:59PM Danie wrote: Joni, Thinking about you and praying for good news. Big hug, Danie",
      "MessageIndex": 26,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698145",
      "Title": "Scan results not good jonimb jonimb"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Nov 7, 2008 09:17PM Danie wrote: Yahoo!!! That is great news.  Comfort hugs, Danie",
      "MessageIndex": 6,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724092",
      "Title": "Ct scan results cathy50 luvtotravel"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 14, 2009 11:05AM Danie wrote: Hi Krystyna, I just sent you a PM (Private Message) with my home email.  Just go on top of this page and you will see a tab that says Private Messages.  You will see that you will have at least one outstanding message. Just press on this tab and it will bring you to my message.  You can reply to this message or sent me a message at home.  It would be my pleasure to chat with you. As for my bone mets, I take clodronate and it has been working well up to date.  I also had an Oopherectomy last year, since I'm hormone positive ER/PR+. Looking forword in hearing from you, Comfort hugs, Danie",
      "MessageIndex": 23,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741902",
      "Title": "Just diagnosed with liver metastasis Krystyna Krystyna"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 13, 2009 11:07PM Danie wrote: Hello Krystyna, I am so sorry to hear about your diagnoses.  It is so devasting when learning of this news.  It does take a while, before being able to swallow and digest this news, so give yourself and your family time for this.  I don't have mets to my liver, but I do have bone metastasis.  I do know many ladies with liver mets and that have good QOL and have been living many years with it.  I am also from Calgary.  I am part of a Breast Cancer Stage IV support group if you are interested.  This is very helpful with every aspect of dealing with this disease.  You can PM me for more details or contact the Tom Baker Centre and they will give you some info on it.  If you just have the need to talk, please don't hesitate to PM me, it would be my pleasure to talk with you.  You also need to do your Columbia trip.  A nice trip is just what you need at this time and visiting with your daughter will be a blessing.  The love and caring of family members is so important at moments like these.  Sending you cyber <<>>. Comfort hugs, Danie",
      "MessageIndex": 19,
      "PostDate": "13/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741902",
      "Title": "Just diagnosed with liver metastasis Krystyna Krystyna"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Dec 31, 2009 06:07PM Danie wrote: Your SIL is simply a very selfish person.  What goes around comes around and hope she get what she deserves soon.  You of all people do not deserve this treatment.  Please do not waste your energy on her (she does not deserve it) and try to concentrate on your needs instead.  This will give you to much stress and you have enough stress as it is, so you do not need her stress as well.  Your partner seems to be a very good support for you and you are probably his number one concern right now.  I'm sure he can deal with his sister and when time comes he will deal with her his own way.  My SIL did something similar and I just took my warm fussy feelings away from her and just simply ignore her now.  I really don't think that she deserves my energy as it is way to important to spend it on her. Wishing you lots of peace. Comfort hugs, Danie",
      "MessageIndex": 29,
      "PostDate": "31/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745800",
      "Title": "mean people stink..... chainsawz saint"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 7, 2012 10:41PM Danie wrote: Hello ladies, I will be there as well for both days.  Looking forward for the conference and meeting BCO ladies in person :) Comfort hugs, Danie",
      "MessageIndex": 39,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793142",
      "Title": "MBCN Annual Conference is Oct. 13 in Chicago: Who is Going? EnglishMajor LuAnnH"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Mar 20, 2008 09:42PM Danie wrote: Anita, So sorry for your progression.  I feel for your pain and you are right we do need more miracles.  No mother should go through such a devastating ordeal.  What a terrible time to find out, on a holiday where the say dreams come true.  I hope you and your family get a chance to return to Disney for a beautiful and fun holiday as it should have been.  Wishing you courage and strengh through these difficult times.  Best wishes for all your upcoming tests and hope your treatments are a success.  My prayers are with you. Comfort hugs, Danie   ",
      "MessageIndex": 16,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702536",
      "Title": "And the hits just keep on coming... Anita1969 MissShapen"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Mar 20, 2008 02:50PM Danie wrote: Dear Darryl and family, My sincere condolence to you and Johanne's family.  My thoughts and prayers are with you.  Darryl - thank you for letting us know this sad news and for all the last updates you have shared with us.  This was a long fight for her, but she is now at peace and no more suffering.  Johanne was a very strong lady and will be truly missed. Comfort hugs, Danie",
      "MessageIndex": 71,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702566",
      "Title": "Fare Thee Well Love.... joannes_brother lewisfamily503"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jun 20, 2009 12:14AM Danie wrote: Wendy, My thoughts and prayers are with you.  Wishing you a quick recovery with no pain. Comfort hug, Danie",
      "MessageIndex": 27,
      "PostDate": "20/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736081",
      "Title": "WendyV needs our support katie11 heatherpalmerton"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 30, 2008 07:20PM Danie wrote: Yahoo!!!  Sure nice to hear good news like this and may it last forever.  We sure need to hear them, because those good news do exist out there. Comfort hugs, Danie",
      "MessageIndex": 9,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723634",
      "Title": "Still Dancing mthomp2020 saint"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Danie wrote: Hello to all, I was just on the \"Just diagnose with a recurrence or Mets\"  and found a thread regarding Maya(Bernice) from Newfoundland going into palliative care.  Her sister started the thread called \"Beginning of End\"  then lower in the thread there is mentioned that she passed peacefully on April 6th.  Bernice was a wonderful women an gave great inspiration to us.  Maya \"Bernice\" was a regular on our thread.  I think these new threads are a bit confusing, as I think that thread was ment to be in the Stage IV BC aswell. God has gained a beautiful Angel and sure she is with many of her friends from this board. You will be greatly missed Maya \"Bernice\". Comfort hugs, Danie  Dx 6/27/2007, IDC, 2cm, Stage IV, Grade 3, 1/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732467",
      "Title": "Another Angel Maya Danie MissyBraddy"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Mar 23, 2008 05:19AM Danie wrote: Hi Joy, Sorry to hear your tumor markers are up.  One of the worst step of our disease is the waiting part.  Please don't be sorry for a melt down, it comes with the bc the up's and down's.  We are here for you and to help you up.  Sending you good news vibes.  My prayers are with you. Comfort hugs, Danie",
      "MessageIndex": 22,
      "PostDate": "23/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702669",
      "Title": "Not good news for me JoyRebecca NYCarol"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 8, 2008 07:14PM Danie wrote: Deb - I'm so sorry to hear about everything that is happening to you.  This is sooo unfair.  My thoughts and prayers are with you. Comfort hugs, Danie",
      "MessageIndex": 323,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jun 6, 2008 07:17AM Danie wrote: I'm so sorry for your loss.  My prayers are with you and your family. Comfort hugs, Danie",
      "MessageIndex": 9,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706848",
      "Title": "My mom is an angel now EXAIMA omo"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Aug 23, 2010 11:26PM Danie wrote: Dana thank you for notifying us.  I had the previledge to meet Beth at the conference in PA as well.  She was a wonderful person.  She will be greatly missed.  This is such sad news.  My deepest condolescences goes to her dh, the girls, family and friends.  May she rest in peace.... Comfort hugs, Danie ",
      "MessageIndex": 18,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757103",
      "Title": "Beth (BMDALEY) .....may she rest in peace WingsofHope Stefanie"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Aug 24, 2010 10:32PM Danie wrote: WOW!  Your son's video is amazing.  He is a God send himself.  May God Bless his little heart, you and your family.  I pray that his efforts are not in vein and may the FDA does NOT take this drug away from us who needs it.  Please tell your son his video and efforts have touched me deeply and he is an amazing person.  You must be so proud of him. Comfort hugs ♥, Danie",
      "MessageIndex": 17,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757138",
      "Title": "My son made a you tube video to help us fight!! stage4triplenegsurvivor nancyh"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Aug 1, 2010 01:56PM Danie wrote: Yeah!!!!",
      "MessageIndex": 32,
      "PostDate": "01/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755952",
      "Title": "PET Scan still-kickin Danie"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 14, 2009 02:22AM Danie wrote: Thank you for sharing this with us, it was simply beautiful and very emotional.  Heidi was a wonderful person and her memory will live for ever.  My thoughts and prayers are with her family and friends, which I know she had many. Comfort hugs, Danie",
      "MessageIndex": 19,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742066",
      "Title": "Heidi's Memorial Service - October 12, 2009 elizzim AnnaM"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jan 23, 2010 10:27PM Danie wrote: I was 45, stage II in June 2007 I was 46, Stage IV in January 2008 Danie",
      "MessageIndex": 382,
      "PostDate": "23/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Feb 27, 2010 06:59AM Danie wrote: Dear Diane, My thoughts and prayers are with you and your family.  May you be comfortable, pain free and surrounded by your loving family and friends. Comfort hugs, Danie",
      "MessageIndex": 57,
      "PostDate": "27/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748885",
      "Title": "BadBoob67 is in Hospice Now :( LuAnnH Danie"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Mar 26, 2009 12:59AM Danie wrote: Original dx at 45 with stage2 DCIS Had mammograms every yr since 40 yrs old, but cancer never shown.  I found it myself. 46 yrs old dx with stage 4 - bone mets to rib, which was 6 mos after orig. dx Comfort hugs, Danie",
      "MessageIndex": 198,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "May 31, 2010 02:52PM Danie wrote: Born in Dalhousie, New Brunswick. Moved north of Montreal, Quebec when I was five yrs old and have been living in Calgary, Alberta for the past 17 years, but three of these 17 years was in Nova Scotia.  I have lived in many provinces, but all in Canada :)",
      "MessageIndex": 35,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753351",
      "Title": "Where is everyone from? shelbyjane72 BarbaraA"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 13, 2011 01:01AM Danie wrote: OMG Darla, I'm so sorry to hear about this.  My thoughts and prayers are with you, your son and family. Comfort hugs, Danie xox",
      "MessageIndex": 29,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776210",
      "Title": "Out of remission, now my son has cancer mcbird edwh001"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Mar 11, 2009 07:47PM Danie wrote: Hi Nicki, So sorry to hear you had to join our stage IV club.  I know its a shock to the system and so difficult to accept.  Scream, cry do whatever it takes and let it out!    I know you already have many friends on this board and will make new ones.  We all are a bunch of caring people and we are here for you.  My prayers and thoughts are with you. Comfort hugs, Danie",
      "MessageIndex": 17,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730557",
      "Title": "New stage 4 here"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Apr 22, 2008 03:11AM Danie wrote: Hi Joni, I haven't been on the site for a while, thus I've been out of the loop with everything that is going on. I'm so sorry to hear about the pain you're going through with the port and your new chemo regime.  Hope everything goes well with you and I will have you in my prayers.  I'll try to contact you later in the week. I'm going for my scan and tattoo on Wednesday, but I still don't know when radiation is starting or for how long.  My onc. is sending me for it, thus I haven't seen the radiologist yet. You take good care of yourself and my thaughts are with you.  I'm sending you a big gental cyber {{{hug}}} with love. Comfort hugs,  Danie xox",
      "MessageIndex": 7,
      "PostDate": "22/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704301",
      "Title": "Start new chemo Taxol/Gemzar tomorrow jonimb Jodian72"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Nov 1, 2009 01:54AM Danie wrote: Such sad news. God is able.  May you rest in peace. My prayers and thoughts are with Stephanie's family and friends. God has gained a wonderful Angel. Comfort hugs, Danie",
      "MessageIndex": 125,
      "PostDate": "01/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742956",
      "Title": "Stephanie is an Angel 2timer Britt"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Danie wrote: Hello to all, Haven't posted in ages. I guess it is a good sign in a way :) This one is for my 32 years old son. He was diagnosed in May 2015 with stage 4/ Metastatic Pancreatic cancer. He has been on Folfininox since August 2015. This cocktail has different chemo agents (5-FU, leucovorin,irinotecan and oxaliplatin). The oxaliplatin has given him bad neuropathy, thus having no feelings in his hands and feet. He is now getting injuries from it and very uncomfortable. They did stop the oxaliplatin in January, but the neuropathy keeps on getting worst every week. His oncologist mentioned that it happens that the effect continues even after stopping the drug. She says the other drugs in that cocktail will not cause the neuropathy! My younger brother in 2009 also had metastatic cancer at 41 yrs old, and they had given him lyrica/gabapentin and it had worked great for his neuropathy, but his kind was causing pain not numbness. My son's oncologist doesn't want to give him lyrica has she says it's for pain induce neuropathy and not numbness??? If any of you that has numbness neuropathy, can you please share how you are dealing with this meaning side effects and what are you doing to relive it! Maybe a miracle drug 😉 As for me I am still stable with my bone mets. I'm one of the lucky one's I can say, but now I'm dealing with my son who has metastatic Pancreatic cancer which is so darn difficult. He is also a single Dad with a 15 yrs old daughter with no Mom in the picture 😔. I also lost my brother in 2009 of pancreatic cancer and he was 41 yrs old when he died in my arms. Its such a terrible disease and hate it with a passion... I still come and read the thread on a regular basis :). I took a break from posting a couple of years ago and here I am, back at it! Comfort hugs to all xox Dx 6/27/2007, IDC, 2cm, Stage IV, Grade 3, 1/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843475",
      "Title": "NUMBNESS NEUROPATHY DUE TO CHEMO OXALIPLATIN Danie Danie"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Mar 20, 2010 01:35AM Danie wrote: May you Rest In Peace Pat.  My deepest condolences to her family and friends. Comfort hugs, Danie",
      "MessageIndex": 16,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/749913",
      "Title": "Wayover20 - Pat Alyson Kim_888"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Apr 14, 2009 12:54PM Danie wrote: Yhong, So sorry for your loss. My prayers and thoughts are with you. Comfort hugs, Danie",
      "MessageIndex": 41,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732116",
      "Title": "My mom is an angel now YHong luvtotravel"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Apr 14, 2010 11:01PM Danie wrote: Hello to all, I'm up to either night. I will be arriving around 5 O'clock on Friday and Saturday works for me as well.  Are we going to be meeting somewhere at the hotel.  Comfort hugs, Danie",
      "MessageIndex": 7,
      "PostDate": "14/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751254",
      "Title": "PHILLY CONFERENCE and a dinner heatherpalmerton AliceJean"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Apr 16, 2016 11:04PM Danie wrote: Thank you for the kind words Mods :)",
      "MessageIndex": 2,
      "PostDate": "16/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843475",
      "Title": "NUMBNESS NEUROPATHY DUE TO CHEMO OXALIPLATIN Danie Danie"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Mar 29, 2009 10:27AM Danie wrote: Hi guys, I applied on Thursday night, but haven't heard from them.  I emailed the contact to verify if I gave them the right email.  I have a #1 in my email address and sometimes forget to give it.  I hope I get the grant.  I'm looking so forward in meeting you all. Comfort hugs, Danie",
      "MessageIndex": 43,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730403",
      "Title": "Another Conference...Travel Scholarships Available!!! WingsofHope heatherpalmerton"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Apr 3, 2009 08:25PM Danie wrote: Hello to all, I have a friend going to the conference and looking for a roommate.  Wondering if there is anybody still looking for one aswell.  Looking forward to meet you all.  I will be arriving at 7 O'clock at night on Friday. Comfort hugs, Danie",
      "MessageIndex": 60,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730403",
      "Title": "Another Conference...Travel Scholarships Available!!! WingsofHope heatherpalmerton"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 31, 2013 09:26PM Danie wrote: Karen, So sorry to hear that you've had to deal with this terrible ordeal. What a disappointment for our medical system. I'm assuming one of the hospital you were dealing with, was the TBC or Foothills but what was the other hospital you were dealing with? Glad to hear you are now at home and recovering. Wishing that your infection subsides and don't come back. My thoughts and prayers are with you :) Comfort hugs, Danie",
      "MessageIndex": 30,
      "PostDate": "31/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813797",
      "Title": "Brain Infection Karen2012 Padiddle"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 26, 2008 07:39PM Danie wrote: I am so sad to hear of your passing my dear friend.  I had surgery on Monday and just came out of the hopsital.  I was going to call Joni today, but had company, thus I was going to call her tomorrow.  I just learned of this terrible news on this site tonight.  My tears can not stop from rolling down my cheaks.  My deepest sympathy goes to you Dan.  Joni Loved you so very much, she always mentioned you in our conversations and thought very highly of you.  I am also sad for Thor and Clem, she loved them very much and know they will miss her immensely.  Sincere sympathy to Joni's sisters, nieces, nephews and family.  We had many talks about you all and she was very proud of her family.  My thoughts and prayers are with you all. This is such a devastating news.  I will miss you so much my dear friend and words cannot describe.  You were such an inspiration to me.  I will miss hearing your voice, your encouraging words and great sense of humor.  You had so much wisdom and always found a way to put a smile on my face.  It was such an honor to have you part of my life and for this I'm a better person today.  Heaven has gain a Beautiful Angel and may she rest in peace.   I will Love you forever my dear friend.  Comfort hugs, Danie   ",
      "MessageIndex": 32,
      "PostDate": "26/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723347",
      "Title": "Joni Maya1 MissShapen"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 19, 2009 06:37PM Danie wrote: I'm so sorry to hear the sad news.  My sincere condolences to Tucker, Sandy, Amy's mother, sisters, family and friends.  May she Rest in Peace.  My thoughts and prayers are with you all. Comfort hugs, Danie",
      "MessageIndex": 26,
      "PostDate": "19/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742333",
      "Title": "AMES (lv2cmp) RIP -angel- heatherpalmerton"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Mar 25, 2008 10:31PM Danie wrote: Hi Joni, I had an MRI this morning aswell for my brain and eyes.  I'm sending you good news vibes.  Lets keep positive and pray for each other.  Hope your scanxiety is not to strong.  I'm leaving tomorrow morning for Mexico and I'm so excited.  I'll be thinking about you and praying for you.  Take good care of yourself.  I'll call you when I come back. Comfort hugs, Danie",
      "MessageIndex": 15,
      "PostDate": "25/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702811",
      "Title": "Scans Mar 25 & Mar 31 jonimb 30something"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Apr 1, 2009 12:20AM Danie wrote: Hi to all, It's confirmed I got my travel grant accepted, booked my flight and hotel room.  Can't wait to meet you all.  I'm so excited!!! Ellen - That sounds like a great idea to do those labels.   Are we meeting somewhere at the conference???  Is there a time and place that is set up to meet. Comfort hugs to all, Danie",
      "MessageIndex": 51,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730403",
      "Title": "Another Conference...Travel Scholarships Available!!! WingsofHope heatherpalmerton"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Apr 10, 2010 03:05AM Danie wrote: Hello to all, I'm going as well.  Looking forward to see you all there!  I'm arriving at 2:45 on Friday at the philadelphia airport.  Is there anybody else arriving that time, maybe we could share a cab to the hotel.  I don't have a roommate either, if somebody is looking for somebody.  My husband does say that I snore, just want to be honest :)   Comfort hugs, Danie xox",
      "MessageIndex": 22,
      "PostDate": "10/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/750556",
      "Title": "lbbc conference Fitztwins heatherpalmerton"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jan 27, 2009 07:09AM Danie wrote: I``m in shock.  She was such a big part of our site.  My thoughs and prayers go to her family.  We will miss you dear Deb.  She is in peace now.  They will have lots of laughters up there with her around. Comfort hugs, Danie",
      "MessageIndex": 138,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Danie wrote: It is with great sadness that I'm announcing that our sister Krystyna is now an Angel. She passed on Sunday May 17th, peacefully surrounded by her family. Krystyna was happily married and had two beautiful adult children, a young men and a beautiful daughter. My deepest condolences goes to her husband, children and family. I am so sad to have lost a beautiful, wonderful, lovely friend. Her memories will be in my heart forever. Heaven has just welcomed a beautiful Angel. Love you my dear friend and I'll miss you lots! Comfort hugs xox (Edited by Mods to remove user's personally identifiable information) Dx 6/27/2007, IDC, 2cm, Stage IV, Grade 3, 1/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831647",
      "Title": "Krystyna is an Angel Danie Leah_S"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Apr 14, 2009 11:48AM Danie wrote: Ellen, You are doing a great job.  I will give you my coordinates. Danie Danielle Calgary, AB  Canada I do feel very previledge to be participating in this conference.  What a great weekend we will be having. Looking forward in meeting you all. Comfort hugs, Danie",
      "MessageIndex": 74,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730403",
      "Title": "Another Conference...Travel Scholarships Available!!! WingsofHope heatherpalmerton"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 13, 2011 06:08AM Danie wrote: I'm so sorry for your lost.  Your Mom will be missed at this forum, she was a great lady. My prayers go out to you and your family. Rest In Peace Joy. Comfort hugs, Danie ",
      "MessageIndex": 54,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776066",
      "Title": "JoyRebecca is an angel tjgraham Danie"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Mar 6, 2012 01:20AM Danie wrote: My deepest sympathie to Linda's family. Comfort hugs, Danie",
      "MessageIndex": 9,
      "PostDate": "06/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783700",
      "Title": "LinTol is an Angel reesie Linda1966"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Apr 4, 2009 12:32AM Danie wrote: So sorry to hear about your progression Pee.  My thoughts and prayers are with you. Comfort hugs, Danie",
      "MessageIndex": 13,
      "PostDate": "04/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731867",
      "Title": "Not a good scan... pee bmdaley"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Aug 31, 2010 02:07AM Danie wrote: Dave - I'm so sorry, this is happening to all of you.  These moments are so stressful, energy draining and emotionally sad.  My prayers and thoughts are with you, Kimberly and the kids.  May she have a speedy recovery and may you and the kids have strenght physically and emotionally.  Sending you all a cyber hug. Comfort hugs, Danie ",
      "MessageIndex": 27,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757424",
      "Title": "Today was frightening day Kimberly is in ICU dhmeiser RobinWendy"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Danie wrote: Hello to all, How was your bone mets diagnosed.  I just got diagnosed with bone mets on Friday with various test such as a bone scan, CT scan and an MRI.  I did not get a biopsy, since the rib is to small and there is a high risk of perforating the lung.  Therefore, they have decided not to perform the biopsy and have me have another bone scan in 3 mos.  As for treatment they have given me tamoxifen and I will start radiation.  As for current pain control I am on Tylenol 3 or morphone which doesn't always work. My original bc was diagnosed in June 07 and had a mastectomy with chemo.  I have a constant terrible back pain which started in Oct.07 and this is where this whole bone issue started.  I also have some pain in the bum bone but this one is not necessarily constant and did not create a hot spot on the bone scan. I am curious to see if there is many others that have been diagnosed with bone mets, without a bone biopsy.  Hugs, Danie  Dx 6/27/2007, IDC, 2cm, Stage IV, Grade 3, 1/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699088",
      "Title": "How was your bone mets diagnosed Danie awjkej"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jan 24, 2008 08:15PM Danie wrote: Hello ladies, The onc said they can't do the biopsy because the rib bone is to small and there is a high risk to puncturing the lung.  Therefore, they have clinically diagnosed me with bone mets, but can't be 100% sure because of no biopsy.  The thing is that it only showed one spot on the rib in all those scans (bone scan, CT scan, MRI).  It is difficult, since I only have one bone that is affected and who knows maybe it is something else.  The MRI radiologist said that to him it looks like mets, but he can't bet that it is a 100% that.  I'm currently taking tamoxifen and they scheduled me for radiation.  I have constant pain in the back, which wakes me up every night.  This pain has been constant since Oct.07, thus they gave me tylenol 3 and morphone for the pain.  They will be sending me for another bone scan in 3 mos, then maybe there we will see a change. Once again, thank you for all your responses.  They are very helpfull and appreciated. Hugs, Danie  ",
      "MessageIndex": 8,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699088",
      "Title": "How was your bone mets diagnosed Danie awjkej"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jan 10, 2010 02:43AM Danie wrote: Thoughts and prayers for River and her family.  May they all have Peace, Strenght and lots of Love. Comfort hugs, Danie",
      "MessageIndex": 52,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746352",
      "Title": "A message from River's husband Fitztwins lizws"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Mar 26, 2009 01:29AM Danie wrote: Susan, So sorry to hear about the bad/sad news.  My thoughts and prayers are with you. Comfort hugs, Danie",
      "MessageIndex": 20,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731371",
      "Title": "I'm looking at brain mets, also... SunshineSmiles denise1962"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "May 14, 2009 10:50PM Danie wrote: So sorry to hear this devastating news.  I just lost my little brother to Lung cancer on May 3rd.  He also had a painful death, but I he was in my arms on his last breath and he did go with lots of Love.  I feel so sorry for your friend.  I know it seems very difficult, but there is still lots of good on this earth.  It is time for her to do the opposite and take advantage of every minute of this life.  There is still beautiful sunny days and sure she has family and friends around that Love her very much.  You should welcome her to our site here at BCO.  This is a great place for support.  My thoughts and prayers are with her, may she have strenght to go through this ordeal and lots of Love and Peace. Comfort hugs, Danie",
      "MessageIndex": 7,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734215",
      "Title": "Her Husband Passed Away Tonight lovemyfriend PattyP"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jan 25, 2008 12:36AM Danie wrote: Hi Joni, Actually my rad onc. is Dr. McKinnon.  It is nice to hear that he is good.  I needed to hear this, since I am having problems with my regular onc and thinking of a second opinion. Thx for the info, Danie",
      "MessageIndex": 12,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699088",
      "Title": "How was your bone mets diagnosed Danie awjkej"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Aug 15, 2010 02:18AM Danie wrote: Dana - thank you so much for updating us on Beth.  I'm always amazed at how this disease can progress so quickly.  I too was fortunate to meet Beth at the LBBC conference.  This is so very sad news. My thoughts and prayers are with Beth, her family and especially her dh and daughters.  I will send her positive vibes and cyber gentle hugs.  May she have comfort, strength, peace and a painless journey. Comfort hugs, Danie",
      "MessageIndex": 17,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756727",
      "Title": "Please pray for Beth (BMDALEY) WingsofHope littletower"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jan 27, 2008 12:07AM Danie wrote: Hi Pam, I just went through a similar situation, with back pain.  I had a bone scan showing activity in a rib.  Then they sent me for a CT scan and MRI.  The CT scan is the one that showed the most detail.  My pain on the rib is constant and I currently take tylenol 3 and morphone for the pain, which does help a bit.  Maybe a CT Scan would put your mind at ease.  These bone scans are very sensitive, thus they can show many things, such as an old fracture, arthritis etc.  Thus it can be just old arthritis.  Hope you get this resolved soon, as the unknown is very stressful.  Be positive.  My thoughts are with you. Danie  ",
      "MessageIndex": 3,
      "PostDate": "27/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699219",
      "Title": "New here newbieagain skirk"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Oct 15, 2009 01:37PM Danie wrote: My thoughts and prayers go out to her husband, children, family and friends.  Amber was such a sweatheart.  Rest in peace dear Amber.  No more suffering. Comfort hugs to all who knew her, Danie",
      "MessageIndex": 26,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742156",
      "Title": "Mrs_X_Sunneedazee (Amber) dmacw janie44"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jan 24, 2008 12:12PM Danie wrote: Bubble, So sorry to hear you are in the same boat as I.  What was your treatment once you got diagnosed with the bone mets.  I only have it in one rib for now.  It is rib 6 on the left side.  I also asked them if they could take it out, but they said they couldn't.  How is your health now and when did you get diagnosed. I'm looking at various treatment and wondering if I can get rid of this beast, since it is only in one bone. Thx for your input, Hugs, Danie",
      "MessageIndex": 3,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699088",
      "Title": "How was your bone mets diagnosed Danie awjkej"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Jan 25, 2008 01:26PM Danie wrote: Hello ladies, I asked my onc. for tumor marker test, but she said that we don't do this here at Tom Baker.  Thus, she is sending me for radiation and gave me tamoxifen.  My onc. informed me of all this over the phone.  I wanted to discuss this matter (bone mets and options)further with her in person, thus I called the appointment centre.  Her nurse called me back yesterday and said that we had no need to discuss this matter further and rescheduled my appointment for in 3 months time with another bone scan. I am definitely looking for a second opinion now! Thx for all your comments and support, it is much appreciated. Hugs, Danie",
      "MessageIndex": 17,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699088",
      "Title": "How was your bone mets diagnosed Danie awjkej"
    },
    {
      "AuthorID": "Danie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61998/profile",
      "Content": "Mar 24, 2008 11:56AM Danie wrote: HI Diane, Sorry to hear about the pain and worries you are going through.  My prayers and thoughts are with you.  Praying that this is an old fracture acting up, that you will have a quick recovery and that your treatment is top notch. Comfort hugs, Danie",
      "MessageIndex": 34,
      "PostDate": "24/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702750",
      "Title": "Please pray for me badboob67 katie11"
    }
  ]
}