{
  "AuthorID": "Danjulieo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176455/profile",
  "Posts": [
    {
      "AuthorID": "Danjulieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176455/profile",
      "Content": "May 4, 2013 11:17PM Danjulieo wrote: I am ghostwriting now for my wife, who has elevated liver functions and mets.  Just diagnosed with liver mets 4/8/13.  She had a little jaundice in her eyes earlier this week after having one round of Halaven.  She responded poorly to it with terrible mouth sores and thrush that have prevented her from eating solids all week.  Also, her WBC's were only 1.4, too low for the 2nd Halaven this week.  She is weaker now because of this and very concerned about her ability to handle any more chemo - the cancer is pretty advanced in her liver despite feeling pretty good one month ago.  Has anyone had similar rough starts to chemo with advanced liver mets and rebounded with another chemo.  We will be meeting the oncologist Thursday to discuss a new plan.  Evans, I hope Xeloda works well for you.",
      "MessageIndex": 2,
      "PostDate": "04/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804210",
      "Title": "Liver mets/ functions Evans1128 steelrose"
    },
    {
      "AuthorID": "Danjulieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176455/profile",
      "Content": "Danjulieo wrote: This is Julie's husband again.  My last post was in early May.  Sorry for the absence - I am still adjusting to Mr. Mom status.  As you all know, it is a hard job.  Julie had a rough start on Halaven in late April and then it was reduced to 75% dosage and with other prophylactic measures, she tolerated this well, until neuropathy and muscle weakness became so bad that she had to stop two weeks ago.  She sees her oncologist next week to likely start the next chemo and she wants chemo that is better for her neuropathy.  Oncologist had discussed switching to abraxane as his first choice - but also discussed gemzar and xeloda.  Thoughts as to these choices?  Julie has also been dealing with ascites since early June which requires paracentesis once a week and she has suffered worsening muscle weakness over the past few weeks.  In researching malignant ascites, the prognosis is quite poor, but the Halaven helped to reduce Julie's liver markers significantly over the summer.  I guess I am looking for some frank thoughts from anyone who has encountered similar symptoms, but primarily, thoughts as to the 3 chemos listed and/or the effect of the good news/bad news as to lower liver markers vs. ongoing ascites.  Thank you.  Dan      Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808983",
      "Title": "Is there a chemo easiest on neuropathy? Danjulieo Padiddle"
    },
    {
      "AuthorID": "Danjulieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176455/profile",
      "Content": "Danjulieo wrote: I was diagnosed with triple negative breast cancer in July 2011.  Had bilateral mastectomy, TAC chemo and radiation up to March 2012.  Doing well until recently and just learned that the cancer has metastasized to my liver.  Seeing my oncologist Wednesday.  He has already mentioned  Halovan?  Looking for information and successful treatments undergone by others.  Thank you.  Julie Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803373",
      "Title": "Just Diagnosed With Liver Met - Looking for Info Danjulieo ButterflyLady"
    },
    {
      "AuthorID": "Danjulieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176455/profile",
      "Content": "Danjulieo wrote: I know this is difficult, if not impossible, to list - but, can other Stage IV with liver mets women give a listing of the best-working chemo drugs with the mildest or least side effects?  In looking at the most commonly referenced liver mets drugs, some list them as working wonders and others describe the same drugs as causing horrible side effects.  Is there anywhere for statisitics on these?  Thank you. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804401",
      "Title": "Liver Mets Chemo re Side Effects Danjulieo LizLemon"
    }
  ]
}