{
  "AuthorID": "dannii",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69339/profile",
  "Posts": [
    {
      "AuthorID": "dannii",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69339/profile",
      "Content": "Jul 11, 2008 10:32AM - edited Jul 11, 2008 10:33AM by dannii hi Im only 24 and i had an excisional biopsy two years. It was worring for me and my family as i had just lost my Aunt aged 36 to breast cancer and secondary cancer, all i can say is dont worry too much, i know its hard to do and everytime someone told me not to worry i wanted to swear at them. I had stitches with mine but i guess different doctors do it different ways. I was very sore for about 2 weeks until it strated healing. I wnet back to work 2 days after but i had a sit down job where i didnt have to move much really. I was on pain relieve afterwards for about 2-3 weeks but this was because i had a really bad head after teh anisthetic. I was really worried about it scarring but people reassured me it wouldnt be that bad considering! Now i do have a scar and to be honest its not a bad scar and i do use bio oil on it everyday and that seems to help it fade. I really wouldnt worry too much about the op but do insist on having a couple of days off, just to recover. Being under anisthetic does make you feel worse then it actually is.",
      "MessageIndex": 5,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708871",
      "Title": "Have you had an excisional biopsy? What can i expect? erin1 leaf"
    },
    {
      "AuthorID": "dannii",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69339/profile",
      "Content": "Jul 15, 2008 05:31PM - edited Jul 15, 2008 05:31PM by dannii Hi, I am 24 and my aunt died of breast cancer and secondary cancer at the age of 36. she developed breast cancer at the age of 30. Cancer runs through my family too and not so long after my auntie died i found a lump in my right breast. I was 22, i went for screenings and had a needle biopsy doen and then they decided to remove the lump as they couldnt find anything from the biopsy. I was really concerned and then they came back and said i had fibrosis tissue, i think thats what they called it. Anyway, two years on and i found another lump, had another screening and another needle biopsy and they said it was nothing to worry about. Iwas also getting really sharp shouting pains through my right breast. I treid everything, eating healthier, getting my breasts measured making sure i was wearing the right sized bra ect and the pains stopped, the lump is still there. now a few months on i am getting the pains again, i have found another lump and my nipples are lumpy too. Im extremely worried because my nipples were never like this before. i am going to contact the breast clinic again but worried that this time it might be something more, who knows. Last time i saw the breast nurse she was duscussing the removing the lump again or even worse removing the full breast, it was in big discussion. Iw ould keep an eye on yours for a week or so and see if it changes, if your are really worried then go and see your doctor, they will be able to tell you whether it is worrying or transfer you to the breast clinic.",
      "MessageIndex": 2,
      "PostDate": "15/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709119",
      "Title": "Worried campe pennzer"
    }
  ]
}