{
  "AuthorID": "dannysgirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289278/profile",
  "Posts": [{
    "AuthorID": "dannysgirl",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289278/profile",
    "Content": "dannysgirl wrote: I am 68 (well, OK 69 next month). When my gynecologist died several years ago I just decided to stop the well woman check ups. About a year and a half ago, while showering, I felt a small hard pebble like growth which appeared to be on the outside of my breast. After a couple of months, I decided to have a mammogram which came back OK so I quit thinking about it. It never went away, but recently became a little bigger (though still very small and now feels more inside than outside and more flattened out). I called my health care provider (a nurse practitioner) who advised me to see him immediately. He took a look at it, said it was probably nothing and ordered another mammogram and said we would go from there. He said \"don't mention it to anyone\". By \"anyone\" I assumed he meant the technician doing the mammogram so when they called me to make the appointment and asked if I had any problems, I hesitated but said \"no\". Now I'm wondering if I did the right thing in not mentioning it and whether or not I should mention when I have it done next week. One other thing...all the mammograms I did have the last few years before quitting were done at one hospital breast center here in town. I didn't see any reason not to go back there, but he wants me to go to one affiliated with his practice which I guess is OK, but he also said there was not need to send previous records to them. I don't want to discuss this with anyone I know, but would appreciate someone else's thoughts on this approach. And whether or not I should even be concerned about such a small lump. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "18/05/2019",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871602",
    "Title": "Am I going about this the right way? dannysgirl djmammo"
  }]
}