{
  "AuthorID": "dansbetta",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127637/profile",
  "Posts": [
    {
      "AuthorID": "dansbetta",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127637/profile",
      "Content": "Apr 30, 2011 01:14AM dansbetta wrote: If decisive role in the pathogenesis of the disease belongs to a single gene, but this gene in each family is different, then it is said about the genetic heterogeneity. To such diseases include family breast cancer, caused by a mutation of a gene BRCA1 on the 17-th chromosome or BRCA2 gene mutation on the 13th chromosome. Mutations in BRCA2 gene , located on the 13th chromosome , significantly increase the risk of breast cancer (and to a lesser extent - the ovarian cancer ); men who have mutations in BRCA2, also predisposed to breast cancer . Mutations of the gene BRCA2 meet approximately in two times less than the mutations of the BRCA1 gene. Approximately 1% of ashkenazi jews have a specific mutation of the BRCA2 gene: 6174delT .",
      "MessageIndex": 4,
      "PostDate": "30/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/768141",
      "Title": "brca2 variant of uncertain significance sanbar8771 Bradygirl"
    },
    {
      "AuthorID": "dansbetta",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127637/profile",
      "Content": "Apr 15, 2011 05:40AM dansbetta wrote:",
      "MessageIndex": 4,
      "PostDate": "15/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/767329",
      "Title": "To Tomax or not to Tomax, that is the question... wonderfullymade Rennasus"
    },
    {
      "AuthorID": "dansbetta",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127637/profile",
      "Content": "Apr 16, 2011 05:39PM dansbetta wrote: And of course tamoxifen in this case is required .. Tamoxifen helps prevent cancer. The main thing is not self-medicate, and is under constant medical supervision while taking this medicine. Tamoxifen has many side effects, and it is a hormonal drug.",
      "MessageIndex": 5,
      "PostDate": "16/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/767329",
      "Title": "To Tomax or not to Tomax, that is the question... wonderfullymade Rennasus"
    },
    {
      "AuthorID": "dansbetta",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127637/profile",
      "Content": "Apr 16, 2011 05:34PM - edited Apr 17, 2011 04:01AM by dansbetta Apologies for such a long post. I hope this information will help you. I wish you good luck!  ",
      "MessageIndex": 14,
      "PostDate": "16/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "dansbetta",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127637/profile",
      "Content": "Apr 21, 2011 01:48AM dansbetta wrote: Hi momoschki. Your feelings are understood. But the doctor is a person with experience. Such patients like you and me, a doctor scores. I would recommend you follow the advice of a doctor. Have cancer or not, if a doctor prescribes TAMO, schitet means that there is a likelihood of cancer you have. Thank you for a doctor is at risk. Naturally, the doctor knows all the side effects of TAMO. And certainly learned all of the features of your body. Do not worry, stress is our enemy. From the stress of all diseases. Everything will be fine.",
      "MessageIndex": 3,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/767804",
      "Title": "Borderline DCIS-ADH? momoschki momma_of_3"
    },
    {
      "AuthorID": "dansbetta",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127637/profile",
      "Content": "May 17, 2011 08:48AM - edited May 17, 2011 08:53AM by dansbetta But these figures do not apply to women who have burdened with a family history of ovarian cancer (Family history means the presence of relatives with the disease). The chance of such women for ovarian cancer is much higher. Some of these women also have inherited a particular genetic variation, which is called BRCA genetic variation. Their chance of developing ovarian cancer is very high. Surgery to remove the ovaries is called ovariectomy. Women, whose risk of developing ovarian cancer is very high, may decide to make such an operation, to reduce the risk. Taking a decision, take into account the following factors: You can't make the decision on carrying out of this operation until't know how high your risk of ovarian cancer. Your doctor will help you learn about this, talk with you about your medical history and family history. You can also talk to a genetic counselor, an expert who helps people to learn about their cancer risk. If your cancer risk is low, removal of the ovaries with the aim of preventing cancer is not recommended. Your decision will depend on how high your risk, as well as from your health, age and personal feelings. Removal of the ovaries significantly reduces the chance woman's chances of getting ovarian cancer. At the same time remove the fallopian tubes. This is one more place where it may be cancer. Cancer perhaps even after the removal of the ovaries. Without ovarian you will not be able to become pregnant and have children. The removal of the ovaries causes menopause. Many women who have inherited a genetic variation of the BRCA, doctors recommend that you should remove the ovaries to prevent cancer. For most women, there is no this is a rare genetic variation. Sometimes women feel that their risk is higher than it actually is. Therefore, it is important to talk with your doctor or genetic counselor to understand how high your risk. What are the benefits of the removal of the ovaries? Studies show that surgery can reduce your chance of developing ovarian cancer at 85 - 95%. This means that it can reduce your risk of ovarian cancer, and you will have the risk of the same or a little higher than the average woman. The figures given below, will help you understand. What are the risks of the removal of the ovaries? If the ovaries are removed, you can no longer have children. In the absence of ovarian you will come sooner menopause. Menopause often accompanied by symptoms such as hot flashes and vaginal dryness. It also increases your risk of heart disease and osteoporosis. Although many women in menopausal period take hormone therapy to prevent symptoms such as hot flashes, hormone therapy is not recommended if you are trying to prevent ovarian cancer and breast cancer. Removal of the ovaries does not always prevent cancer. Sometimes the woman is sick of a cancer before the operation, but does not know about this, because it has no symptoms. And the cancer cells could already begin to spread beyond the ovaries. In this case, with the removal of the ovaries will not remove all of the cancer cells. The cancer can also occur in the abdominal cavity after removal of the ovaries, but this happens rarely. A recent study showed that women who removed the ovaries before the age of 45, live longer, if they accept the use of estrogen replacement therapy. One recent study showed that women younger than 45 years old, which removed the ovaries and do not accept the use of estrogen replacement therapy, are more likely than other women to develop heart disease, mental disorders or diseases of the nervous system. I very much hope, that this information will help you. Be healthy!",
      "MessageIndex": 3,
      "PostDate": "17/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/769062",
      "Title": "BRAC testing and PBMX rehm046 vmudrow"
    },
    {
      "AuthorID": "dansbetta",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127637/profile",
      "Content": "Apr 27, 2011 07:26AM dansbetta wrote: Do not be so nervous. If there is any doubt, if You feel a new tumor, go to the doctor. Don't be shy and wait for the planned reception, the sooner there will be tumor, the better for you.",
      "MessageIndex": 6,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/768061",
      "Title": "Found new lump in between 6 month checks... what to do? mdoak dansbetta"
    }
  ]
}