{
  "AuthorID": "Danyel98",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69952/profile",
  "Posts": [{
    "AuthorID": "Danyel98",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69952/profile",
    "Content": "Danyel98 wrote: Well today's apt was with my new oncologist.  I learned that the PET scan did show no cancerous materials in other areas aside from the right breast and lymph nodes.  Apparently there is a lymph node that is located behind an area on my breast.  This was new info to me and a bit discouraging. I had hoped it would be in the breast and only in the lymph glands ascending upwards towards my collar bone.   I don't like my oncologist's bedside manner.  He interupts alot.  I also don't get why we need to go over info on stages of cancer that are less than mine.  No offense but since I am in stage IIIC (so they tell me that is advanced) I don't think it will do any good to tell me all about things people with a different stage, smaller tumors etc are doing.  I was told that although I am walking 8 mph per week currently and I have a diet with no caffine, white flours, or the bad type of sugar (the only type I tend to get is via my fruits or veggies and those are juiced fresh) that I can expect to gain 15-20 lbs with the chemo. I know this should be a minor concern but amidst all the other bad news and concerns this was just one more.  I have suffered from eating disorders most of my life so such a thing is a bit upsetting.  I am trying to keep the big picture in mind but sometime all the dark clouds that keep adding up make it confusing on how to see it all.     I am apparently HER-2 Positive.  I am quite confused if I should be happy or not.  On one hand, I was told I can take medicine Hercepin to help fight the illness.  On the otherhand, I was told it could cause me more damage b/c of heart failure.  I was also told that this drug suggests the cancer will more than likely come back.  Should I be happy about that result?  I truly am unsure. Thanks for listening Danyel   Dx 7/24/2008, IDC, 6cm+, Stage IIIC, Grade 3, ER-/PR-, HER2+ Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "05/08/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719128",
    "Title": "update from doctor Danyel98 Maryiz"
  }]
}