{
  "AuthorID": "darah58",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
  "Posts": [
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Mar 3, 2008 09:11PM darah58 wrote: Hello to you all, I have one more rad treatment to go.  I have been doing very well, so I thought I would send my best advice to you who are yet to begin.  Skin:  I used calendula cream (marigold-extract cream from Whole Foods) three times daily.  My radiation oncologist recommended this and, after five weeks, my skin is still supple and I only now have some redness under my arm.  Fatigue:  If you already have an exercise program, stick with it.  I have been doing pilates for six years -- continued during radiation 4x weekly -- and it has been so, so good for me.  I had lumpectomy for DCIS -- no mastectomy or chemo -- but stretch as much as you can comfortably do it.  Some of us have underarm stiffness, so work on keeping your muscles flexible.  Rest when you can, and don't try to be too brave.  Deodorant:  I have been using Tom's of Maine Calendula deodorant.  It's been working well, and I have also been using cornstarch powder for my underarm and under-breast area.  Shaving:  I bought a battery-operated razor at CVS, and I use it every Sunday.  I hadn't used an \"electric\" razor since I was 14, but this has worked well, and it has not exacerbated underarm irritation. Bra:  Many people on this site have recommended good bras.  I've been using a Title Nine sports bra, but I only wear it for exercise.  If you can possibly do without it, do not wear a bra. Hope this is helpful.  I'll post again if I remember anything more. Darah ",
      "MessageIndex": 6,
      "PostDate": "03/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/701378",
      "Title": "March 2008 Rads Team brst26 juliajo"
    },
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Jun 22, 2008 10:40AM darah58 wrote: I am truly sorry that you have to go through all of this.  It's not fair for any of us, but you are so young.  Keeping fingers crossed for good results.",
      "MessageIndex": 40,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/705266",
      "Title": "Here I Go Again? msvirgo828 redheadace1"
    },
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Apr 12, 2008 10:27AM - edited Jun 14, 2008 09:46PM by darah58",
      "MessageIndex": 24,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703581",
      "Title": "MASTECTOMY FOR DCIS thetrumumshow Noni"
    },
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Apr 11, 2008 09:14PM darah58 wrote: Hi Ladies, I have posted here only a few times, but have benefitted very much from reading all your posts.  I finished rads in early March -- after two excisions for lb DCIS -- and I am doing pretty well now.  Please know that skin heals and life moves on. I haven't felt many after-effects from rads, just a little soreness in my ribs.  My next check-up is in six weeks, but I honestly do think it will be fine. Slbooch and Mrs Deg, your daughters are lovely!  Hope you are all doing well. Darah",
      "MessageIndex": 448,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Sep 26, 2008 08:33PM darah58 wrote: Hi Sue,  I hope you are doing OK and wanted to wish you a happy 50th.  I will be celebrating mine next month!  I am still not yet taking tamoxifen, though may start soon.  Sending best wishes and hugs. Darah58",
      "MessageIndex": 648,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Mar 10, 2008 10:31PM darah58 wrote: Hi Everyone, Sue -- thanks for your good wishes on my completion of rads.  I did well through the six weeks of treatment but, since I finished last week, the boost area has become much more red, sore, and itchy.  It doesn't seem to be worsening anymore, though, so I hope it will begin to improve soon.  I'll report on the tamox talk with my onc. Tay -- I kept up with pilates classes through radiation, but I gained 15 pounds anyway.  I've had zero discipline re: eating -- anything to give myself some comfort -- so I know what you mean about body, weight, etc. Darah",
      "MessageIndex": 259,
      "PostDate": "10/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Mar 9, 2008 11:29PM darah58 wrote: Hello to you February Rad members, I have gained so much from your posts in the past several months -- just finished my own radiation treatment this past Tuesday.  Thank you.  My boost area has definitely become redder, leathery, and more itchy, but the rest of my breast is doing so much better now.  I am still using calendula lotion 3x/daily, as well as a little anti-itch lotion. I have/had DCIS -- excisions in August and November and started radiation in late January.  So happy to be finished now.  Time to think about tamoxifen now.  Thanks to all of you for your advice and posts. Darah",
      "MessageIndex": 251,
      "PostDate": "09/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/699183",
      "Title": "Looking for a February Rad Team debbbyb twirlgirl"
    },
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Jun 17, 2008 06:51PM darah58 wrote: Hi Viv, I have just gotten to \"know\" you on another thread.  I am wishing you the very best -- hope things turn out all right. xx Darah",
      "MessageIndex": 23,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/707230",
      "Title": "Panic Attack!! Too Soon crazydaisy crazydaisy"
    },
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Aug 17, 2008 10:21AM darah58 wrote: Hi Kajo, My radiation breast (also left) hurts more now than it did when I finished rads in early March.  It's not terrible, but I notice it when I lean on it or when dh hugs me. Has anyone else experienced a change in nipple color?  The nipple on the radiation side is much paler than it used to be.  I think it's probably just another side effect -- like the bruised feeling Kajo mentioned -- but I'm curious to know if anyone else has noticed this change in color. Darah",
      "MessageIndex": 2,
      "PostDate": "17/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719619",
      "Title": "How Long Do Radiation Side Effects Last? kajo cm1122"
    },
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Apr 29, 2008 11:42PM darah58 wrote: Dragonfly, I did not have chemo, but I did find rads quite terrifying initially.  (Did rads from 21 January to 3 March 2008) All I could think of was Chernobyl.  I agree with Shirlann -- I took .5 mg of ativan before most sessions and it helped a lot.  I also went to a cognitive therapist --paid for by the hospital -- and that helped too.  My treatments were always at 12:15, so I always went out to lunch afterwards.  Sometimes with friends or my husband, sometimes just with a good book.  Mostly, though, I just got used to it over time.  Somewhere during the third week I found I could relax just a bit more than previously. I am glad to have done it, following two excisions for DCIS.  You should definitely ask your rad onc any questions you may have.  Good luck to you, and please let us know how things go with you. Darah",
      "MessageIndex": 16,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/704707",
      "Title": "I want to quit Dragonfly92127 twirlgirl"
    },
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Apr 13, 2008 07:09PM darah58 wrote: Hi Clueless, I had two excisions for DCIS just above the nipple.  I also had rads after that.  Please try not to worry too much about scars, or being \"disfigured.\"  I am very happy about the appearance of my breasts now -- just two months after treatment -- there is barely a difference from before. Darah",
      "MessageIndex": 38,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/703643",
      "Title": "excisional biopsy scar/indentation clueless1 Dukemom2"
    },
    {
      "AuthorID": "darah58",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63863/profile",
      "Content": "Apr 15, 2008 08:20PM darah58 wrote: Clueless, I wanted to let you know that when I said two days ago that I was pleased with the way my breasts looked, it was two-months post-rads, not two months after excision.  I had a needle-biopsy in mid-August, several MRI-guided biopsies shortly afterwards, a left breast excision (DCIS) at the end of August, and a re-excision in November.  I went through rads from late January to early March.  Both breasts were terribly bruised after all of the biopsies/excisions.  I tolerated rads very well.  I've been happy with my healing -- I barely notice a difference now -- though I don't really think that it's anything I did.  I had a good surgeon, I took care of myself, and I let time take its course.  When I went through rads, I used calendula cream 3x/daily.  Please do not worry too much about scars, etc.  Time takes care of it, and the scars from lumpectomy are less scary than you imagine, Wishing you the Best, Darah",
      "MessageIndex": 44,
      "PostDate": "15/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/703643",
      "Title": "excisional biopsy scar/indentation clueless1 Dukemom2"
    }
  ]
}