{
  "AuthorID": "Daring_Brav…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235173/profile",
  "Posts": [
    {
      "AuthorID": "Daring_Brav…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235173/profile",
      "Content": "May 6, 2018 11:46AM Daring_Bravely wrote: Thank you for replying 🙂 I have read a lot and it seems in most cases it isn't anything to be concerned about. I'm not overly worried, mostly curious. I'm feeling confident it's scar tissue or fat deposit. Take care",
      "MessageIndex": 2,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864423",
      "Title": "Lump ~ Is it scar tissue? Daring_Bravely Daring_Bravely"
    },
    {
      "AuthorID": "Daring_Brav…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235173/profile",
      "Content": "Jun 27, 2016 04:13PM Daring_Bravely wrote: I have been experiencing some numbness and tingling in my arms & legs. He was checking for inflammation or muscle tissue damage. I had a fu app't w/my GP this morning & although my levels are elevated, he told me that there were not high enough to be concerned about. That's good news! I asked him if there is a correlation between the C Reactive Protein & breast cancer & he said no",
      "MessageIndex": 2,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/845479",
      "Title": "Not Diagnosed ~ Waiting For Ultrasound Daring_Bravely Daring_Bravely"
    },
    {
      "AuthorID": "Daring_Brav…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235173/profile",
      "Content": "Jun 16, 2018 09:34AM Daring_Bravely wrote: Good Morning, Had my ultrasound Wednesday afternoon and receive a call Thursday morning from the breast health clinic. Everything looks good! The lump is a hematoma, combination of tissue and clotted blood that I apparently got after the lumpectomy I had in Nov 2016. It's possible that it's been there and has just grown in size. I have lost 25lbs since then and with the weight loss, the lump is now palpable. I have a follow up appointment for an ultrasound and to see the Dr at the breast health clinic in December. I am so relieved!! @whitleypark how did everything go? Did they tell you anything? I'm hoping that you too received good news!",
      "MessageIndex": 3,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/865190",
      "Title": "Ultrasound Today ... What I know Daring_Bravely nonomimi5"
    },
    {
      "AuthorID": "Daring_Brav…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235173/profile",
      "Content": "Jun 6, 2018 08:56PM Daring_Bravely wrote: Nervouskay, That's great news!! It's also fantastic that the radiologist talked to you immediately. I have my US next Wednesday and will then wait for a call from the breast health clinic to let me know. I hope you're able to relax a little now. What do you continue to feel anxious about? Southernbelle77 - Sorry you're also having to go through this again. I had a lumpectomy for suspicious lump in 2016 but all was good. My lump feels close to the surface and it's between scar from breast reduction 20 yrs ago and the lumpectomy scar. The indent or pucker is in the exact spot the lump is located. Nothing I can do about any of it until the ultrasound. Until then, I will remain positive",
      "MessageIndex": 10,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865048",
      "Title": "Indent on left breast Nervouskay Rvreg"
    },
    {
      "AuthorID": "Daring_Brav…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235173/profile",
      "Content": "Jun 6, 2018 12:17PM Daring_Bravely wrote: Nervouskay, I am going through the same thing right now. I had a lumpectomy in 2016 and everything was good 😊A few weeks ago I found a small, hard, pea sized lump in my right breast, in the area the lumpectomy was done. It is also indented/puckered. The lump wasn't found on mammogram but I saw the Dr at the breast health clinic and I am scheduled for an ultrasound next Wednesday. Waiting is the worst. Like you, I research and google everything, which I feel is a normal reaction. Good luck today, will be sending you positive thoughts! C",
      "MessageIndex": 5,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865048",
      "Title": "Indent on left breast Nervouskay Rvreg"
    },
    {
      "AuthorID": "Daring_Brav…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235173/profile",
      "Content": "Jul 2, 2016 07:39AM Daring_Bravely wrote: Worried ... I haven't had a biopsy. I have had a screening & diagnostic mammogram & am waiting for an ultrasound. I saw a Dr at the breast health clinic & my breast has been sore/tender since she did the exam. It makes sense that your breast would be sore, especially after a biopsy. I think the entire situation causes stress, stress causes anxiety, anxiety causes symptoms. I try to take a deep breath, relax as much as I can, the waiting for the next step is the most difficult for me. Hope you're doing ok.",
      "MessageIndex": 1,
      "PostDate": "02/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/845571",
      "Title": "Psychosomatic symptoms while waiting for test results? worriedspecialneedskidsmom Daring_Bravely"
    },
    {
      "AuthorID": "Daring_Brav…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235173/profile",
      "Content": "Jun 6, 2018 12:40PM Daring_Bravely wrote: Thank you Southerbelle77, you're exactly right",
      "MessageIndex": 7,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865048",
      "Title": "Indent on left breast Nervouskay Rvreg"
    },
    {
      "AuthorID": "Daring_Brav…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235173/profile",
      "Content": "Jul 1, 2016 11:35PM Daring_Bravely wrote: Thank you for your reply ChiSandy ~ I feel positive, especially since 80% turn out to be benign. I'm not sure how it works here, but I hope that I know something soon after the ultrasound :)",
      "MessageIndex": 2,
      "PostDate": "01/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/845603",
      "Title": "Asymmetrical Focal Density Daring_Bravely Daring_Bravely"
    }
  ]
}