{
  "AuthorID": "darkestB4da…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158771/profile",
  "Posts": [
    {
      "AuthorID": "darkestB4da…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158771/profile",
      "Content": "Feb 8, 2013 07:21PM darkestB4dawn wrote: Thank you all for your responses! Beckers, I can't remember the sites I found that info on, but there were two different ones. Then a third site which said a 1st degree relative dxed w bi lateral bc pre menopause put lifetime risk at 36%, and post menopause puts risk at 30%. That made more sense to me, but I don't like those odds much either. The tamox for your sister sounds like a proactive choice, I will ask about that when I go for counseling. I'm sorry to hear of your dx- I hope you are doing well now! Mods, thanks for the info- I will check out the section on Risk that you recommended! Farmerlucy, I will definitely see a genetic counselor, it seems to be well worth it! Thanks!",
      "MessageIndex": 4,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/800086",
      "Title": "My Mom Has Bilateral Breast Cancer- What's My Risk? darkestB4dawn GoldenGirls"
    },
    {
      "AuthorID": "darkestB4da…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158771/profile",
      "Content": "Jun 29, 2014 09:30AM darkestB4dawn wrote: Hi Everyone,  First of all, I'd like to thank the wonderful ladies who contribute to this thread- it's such a kind and helpful thing to do!    I'm here for my mom- we're  looking for opinions and advice on what treatment she should try next- chemo, and if so what kind, or another hormonal. To avoid an endless post (which I'm prone to!) I will break this down into a timeline, which will give more info than the profile. May 2012- Mom, age 65- Dxed Stage IV ER/PR+ HER-. Bilateral malignant pleural effusions, mets to lungs/pleura, bones, adrenal gland, spleen and many nodes.  June 2012-Started Femara and recieved Pleurx catheter- ended up with pneumothorax and trapped lung. August 2012-Regression on scan, adrenal nodule gone, nodes shrinking, pleural effusions diminishing. Dec 2012- Pleurx catheter removed!! :) Declared stable- feeling great with no sx! Sept 2013- Tumour markers rising- CA127 & CEA both. Dec 2013- Both markers still rising, clear scan. March 2014- Liver mets appeared on scan- 3 small spots, largest 13mm. No change elsewhere. Faslodex added to tx- still NO sx! April-May- CA127 rising slowly, but CEA dropped from 21 to 7. June- After 3 Faslodex injections, liver mets increased slightly in size, new spot appeared. Tumour markers both dropped though. Dr. stops Faslodex and Femara, suggests clinical trial of Halaven. My mom is 68 now, still working full-time and very active, full of energy and enthusiasm. She makes a good salary but will probably not be able to stay long in her house if she retires. Prefers to keep her cancer dx fairly private- the thought of losing her hair is upsetting. Most upsetting is loss of vitality, feeling tired and nauseous, being  unable to live the lifestyle she loves.  Given all this, she is very afraid of chemo, BUT acknowledges that she doesn't want to give the liver mets too much time to progress. She has no symptoms right now. Our choices are the Halaven trial, Xeloda ( which onc mentioned a few months ago as a \"down the road\" tx) or another hormonal. Femara did work quickly and well and kept mom stable for at least 18 months. I've thought that the Faslodex might just be taking time to kick in, but progression isn't a good sign. Some questions I have are: Is Halaven too \"strong\" a chemo to start, and could it decrease the effectiveness of subsequent chemos? I wonder if that is one reason for the trial. Is Xeloda a good first line chemo, or are there gentler or better ones? Once one aromatase inhibitor fails, is another likely to work? Is a chemo more likely to work, hence the onc's suggestion, or would it simply work more quickly if it was effective? Any thoughts or advice is appreciated. Thank you all so much!         ",
      "MessageIndex": 2533,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "darkestB4da…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158771/profile",
      "Content": "Jun 29, 2014 11:57PM darkestB4dawn wrote: Thank you for your reply, Chrissy! I'll definitely compare the two chemos- research is always good. I agree that mom's onc is suggesting chemo due to slight progression of the liver mets. My understanding is that chemo can work very quickly, that's probably what he is looking at. Have a great day- I love your avatar btw!  ",
      "MessageIndex": 2536,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "darkestB4da…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158771/profile",
      "Content": "Apr 2, 2013 11:34PM darkestB4dawn wrote: AY!!!!",
      "MessageIndex": 1230,
      "PostDate": "02/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "darkestB4da…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158771/profile",
      "Content": "Apr 1, 2013 08:45PM - edited Apr 1, 2013 08:53PM by darkestB4dawn I rarely post here, but read every day. My mom is stage IV and I've gained a wealth of knowledge on this site and have the utmost respect for all the women here.  Wayne, did you really come here to \"try to understand\"? It seems that you are intent upon stating and restating your opinion on chemo, including the \"slash & burn\" expression, which I've heard before from others opposed to \"conventional\" treatments. The fact is, those treatments are the best option available today, whether the intent is to cure, extend life or relieve symptoms. I don't think we have a right to judge who should or should not choose to take chemo or anything else. The women on this forum are well aware of \"the realities\"- we could benefit ourselves and our loved ones by reading here and educating ourselves, not coming here to lecture. And I'm horrified by the flippant way you talk about this- \"itching to travel down the yellow brick road\"?! This is about people trying to stay alive, not some game! What if your wife has progression and wants to do chemo again? It should be her decision- I hope that she is able to weigh her options and do what is right for her in the future.  I'm sorry if I've been too outspoken. I really value this forum and would never want to offend any of you ladies here!",
      "MessageIndex": 1211,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}