{
  "AuthorID": "DARLENEDENI…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
  "Posts": [
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 7, 2009 07:37PM DARLENEDENISE wrote: Lemonpie: Been there with the hand & foot thing with Xeloda and it sounds like you are grade 3 by your description.  Hard to believe, but it can get worse.  Try all of our tips but, get with your onc.  Sounds like you might have to stop for a extra week or two and resume at a lower dose.  Like you I had lobster like hands and feet and couldn't walk or use my hands.  I had to sleep with ice packs on my hands.  I kept trying to tough it out, thinking it would get better, nope, it gets worse.  Soak those puppies in cool water with Epsom salt and elevate them as much as possible.  Take an anti-inflammatory if you can.  Keep your hands straight up in the air with cold compresses.  Do not put your hands and feet in warm or hot water, it really makes them worse.  Everything hurt my feet, even socks.  I found open soft slippers the best when I did need to walk.  It took several days to feel relief.  Slather on the balm several times a day.  You will probably still have the entire bottom of your feet peel off.  My feet also looked dirty until they peeled.  I hope yours isn't as bad as mine was and I hope you feel better asap! I tried to avoid the ER but 911 type diarrhea finally landed me there.  I had to come off for two weeks and then started back at 1/3 dose, much better.  I did that for 3 cycles and have been on 1/2 dose since. I have some minor hand & foot issues at the 1/2 dose.  Even with the stop and start and reduced dose, scans showed my two liver lesions had shrunk more than half after only two months.  Scans again soon and I hope I can continue as I am. By the way, lemon pie is one of my favorite deserts, surely it must be good for cancer! May the force be with you!!!  Darlene",
      "MessageIndex": 4,
      "PostDate": "07/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735474",
      "Title": "Help with chemo side effects lemonpie LinTol"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jan 28, 2010 03:50PM DARLENEDENISE wrote: Dee:  I have brain mets and my nickname is Dee!  I have had 11 brain mets treated by Cyberknife and it's been 17 months since the brain mets were diagnosed.  Still here.  I have a friend who had liver mets at dx went on Herceptin only after inital chemo back in 1997, had a brain met treated in 2002 has remained on Herceptin only and is still here too.  Hmmm, let's see how many months is that exactly?  I worked in the insurance industry and it is to your advantage that he keeps your timeline within life expectancy guidelines, even though they are old and out of date.  I know of several other gals on different boards who have outlived the stats with brain mets.  I think we should join them!!! This is a hard place to be in and I know your fear too well.  Keep us up to date and show some of these types of e-mails to your onc and bring him up to date!! Sending well wishes....Darlene  aka Dee",
      "MessageIndex": 15,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747297",
      "Title": "\"Frank conversation...\" Dee2810 candy14510"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jul 13, 2010 06:43AM DARLENEDENISE wrote: Sweet Robin:  So sorry this is happening.  Is TACE  a possibility?  Maybe the chemoembolization could get a quick response in the liver and you could go onto one of the systemic chemos.  Was there discussion about biopsy to see if it now has Her2 receptors? I hope you can feel the love and hugs coming from this forum!!!! Darlene",
      "MessageIndex": 45,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755270",
      "Title": "The prognosis in not good RobinWendy BrokenHeart"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 20, 2009 09:26AM - edited Jun 20, 2009 06:08PM by DARLENEDENISE Thank you, kind spirits, for all of your spirit filled creative words and thoughts.  They are a beautiful gift only to be had from angels like you.  My heart says...many thanks.  My family thanks you as well. Darlene Tiger lilies are good, I love lilies and that pooper scooper could be real handy too!!!",
      "MessageIndex": 13,
      "PostDate": "20/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736197",
      "Title": "STUPID BRAIN! DARLENEDENISE EGAL"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 19, 2010 06:44AM DARLENEDENISE wrote: Caelyx is also known as trade name Myocet.  It is is Liposomal Doxorubicin.  The liposomal delivery mechanisim alows the doxorubicin to stay in the body for longer periods to kill more cancer cells with fewer side effects.  This drug works in the same fashion as Abraxane which is Liposomal Taxol. Sounds like it is working for you and you didn't mention that you are having difficult side effects, so, hope it squashes those lumps at the higher dose!!!! Good luck with your treatment!!!!!!!!!!! Darlene",
      "MessageIndex": 2,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752798",
      "Title": "what about Caelyx? vivo vivo"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 19, 2010 07:33AM DARLENEDENISE wrote: MJL:  Thanks for correcting me on the Abraxane.  I'm dangerous without my entire cup of coffee!!",
      "MessageIndex": 4,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752798",
      "Title": "what about Caelyx? vivo vivo"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 21, 2010 03:51PM DARLENEDENISE wrote: Janis:  Are you thinking about good looking cabana men again?  Brian mets!!!  I wish I had men on my brain instead of mets!!  Couldn't resist, too cute!!!! Hope you are doing okay an have a Tykerb game plan lined up!! Darlene ",
      "MessageIndex": 3,
      "PostDate": "21/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752957",
      "Title": "Brain Scan Scheduled Lynn1 meima-Bev"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 16, 2010 05:31PM DARLENEDENISE wrote: Daisylego:  Glad you are going to scan the noggin.  I have had 11 brain lesions treated with Cyber-knife ranging in size from 2mm to 1cm.   Most of them were 4 & 5 mms.  They do not have to be 1cm to be treated.  Your best options are when they are small in number and size.  I am monitored every 3 months with a brain MRI.  My onc scanned me at diagnosis and then in 3 months and was going to scan at 6 month intervals because of the high likelihood of brain mets for Her2+.  I had no symptoms, but a gut instinct, so I asked for a scan 4 months later.  He said hard to scan again so soon without symptoms and asked if I have ever had a headache and when I replied yes, he said \"there's a symptom.\" He thinks it's crazy to not scan Her2+ patients regularly and does.  He has to wrestle with some insurance companies to get it done at times. We scanned 09/08 and there were 8 lesions all under 5mm.  An unusual headache or dizziness will get you a brain MRI order. I know most of the ladies on this board would jump on a scan if there was even a small chance of having a new site of mets in their bodies, wow,  I just don't understand why they are willing to ignore something that if let go could cause you loose your sight, use of limbs or have seizures.  If the lesion is too large when found, then you can only have a crainiotomy for treatment and cannot use focalized radiation treatment. In some instances there are no choices when it is too large. Of course this is a fearful thing to do, but aren't all of our scans and treatments?  Breast cancer is one of the most common cancers to metastasize to the brain and it is part of the stage IV package.  I wish those that are too scared to pursue monitoring of the brain would keep those thoughts to themselves. A few wrong comments could keep someone from doing the right thing. Ladies facing this aspect of this disease need only support and knowledge.  We have to stay strong and proactive in our treatments!!  Remember 30% of Her2+ will get brain mets, so there is a 70% chance the scan will be CLEAR!!  Even with all of the associated anxiety waiting on the scan, nothing spells relief like a clean scan!!  There is a clinical trial at Rush Universty by a leading neurosurgeon to gather data to try to make routine, regular brain scans standard of care for Her2+ patients.  Daisylego, you are brave, and smart to do this, now go get a clean scan and tell us all about it so we can have a reason to celebrate!!! Love and strength being sent your way...Darlene",
      "MessageIndex": 19,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752623",
      "Title": "Would you want to know? daisylego konakat"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 23, 2010 06:44PM DARLENEDENISE wrote: Sherry:  I know the fear you are feeling and I am so very sorry that you are experiencing it.  Let's hope this is another \"scare\"  and you get a clean scan.  I hope you don't  \"crossover\" to our Stage IV forum.  But we are here if you should need us. Please be sure to post back about your results.  I will be thinking of you and looking for good news! Stay strong...Darlene",
      "MessageIndex": 29,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752623",
      "Title": "Would you want to know? daisylego konakat"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 23, 2010 07:34AM DARLENEDENISE wrote: It is not new research.  You can google brain mets and Her2 and find many medical studies, ASCO, Peer Review, etc. articles on the subject.  I consult with a doctor at Dana Farber who specializes in bc brain mets and she has written many research papers on the subject. Here is a cut and paste from Brainmetsbc.org web site from FAQ section that puts the info in a clear summation: Breast cancer metastasizes (spreads) to the brain in about 15-20% of women with metastatic disease. However, some factors put patients at higher risk. Women who are under fifty years of age, who have HER2-positive tumors, estrogen receptor-negative tumors, and lung or liver metastases are somewhat more likely to be diagnosed with brain metastases. Studies indicate that mutations in the BRCA1 gene are also a risk factor. Women who have HER2 metastatic disease have a risk of brain metastases ranging from 25-40%.   ",
      "MessageIndex": 27,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752623",
      "Title": "Would you want to know? daisylego konakat"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jul 14, 2010 01:36PM DARLENEDENISE wrote: Targeted radiation treatment with spheres can be effective only in limited tumor involvement with location and size of the lesions the determining factor.  It would not be an option with diffuse liver involvement.  High liver enzymes and billirubin are indicative of diffuse involvement where systemic treatment would be needed.  Spheres, ablation and cyberknife are good options when there is limited disease in the right locations and the lesions have not responded fully from chemo.  Stubborn limited mets are the best candidates.  I have consulted on all of these several times and sadly was not able to take advantage of them.  Just a little FYI.  For sure, check out all of your options. Darlene",
      "MessageIndex": 10,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755297",
      "Title": "surviving high liver involvement? dantow pee"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jul 13, 2010 04:16PM DARLENEDENISE wrote: What is her tumor type?  Does it have hormone receptors?  Is it HER2 positive?  What other treatments has she had?  Are the mets in the liver only? Where does she get treatments and where do you live? Sorry for all the questions.  Want to help but need more info. Stay strong...Darlene",
      "MessageIndex": 2,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755297",
      "Title": "surviving high liver involvement? dantow pee"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jul 14, 2010 09:51AM DARLENEDENISE wrote: Dantow:  I did indeed survive high liver involvement.  I was initially dx with liver mets from the get go.  They were innumerable and within weeks I was in the hospital with sky high billirubin and alk phos due to blockages.  I was so on the edge, family was called in from out of town.  All the docs would say, is that I was a very sick woman and they didn't know if I would turn around.  Well, here I am!!  I think it is important to get your dear wife on chemo ASAP and to line up a consult at a NCI facility once you get a treatment started.  I get treatment locally in Virginia and go to Dana Farber  for consultive care and access to clinical trials.  I also have had Cyberknife tx at UNC and go there for surveillance and follow up care.  There are many options and I think it is important to have information from thought leaders and researchers in addition to guidance from local oncologists. Data supports rechecking the tumor type when dealing with the liver.  I would want to have discussion with a NCI onc about that possibility.  If she is now Her2 pos or TN, there are specific treatments you would want to use. As you know, everyone responds differently to tx.  Typically, when Xeloda fails, Gemzar is next up.  I had severe side effects on Xeloda and it didn't work well.   I reluctantly moved to Gemzar and I had severe side effects as well and it did not work.   Since Gemzar causes platelet drop and is in the same class of 5FU drugs, perhaps Navelbine might be a consideration (looks like she has many left).  I started it the end of March at a 50% dose and in one cycle my liver enzymes and tumor markers dropped significantly and my liver pain was greatly decreased.  I had to reduce to a 30% dose due to low WBC and RBC.  It is still giving me strong results with minimal side effects even at this modest dose.  I am getting with Herceptin.  I know it can be given with Avastin.  I am not educated about that, but perhaps something to consider for your wife. I will hope for quick results from her tx plan.  Keep us informed and give her a hug from a fellow liver metsister who has been there and is still here!!! Stay strong...Darlene",
      "MessageIndex": 7,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755297",
      "Title": "surviving high liver involvement? dantow pee"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Dec 28, 2009 01:22PM DARLENEDENISE wrote: SSDI is taxed at 85% of the benefit.  If you also receive LTD it is taxed at 100% if your employer paid the premiums and no taxes if you paid the premiums.  I received advance on three of my  life policies.  There are no tax consequences on advances of life insurance proceeds. I know you work for an insurance company and  as you know I was a PC, Life & Health and registered rep and we differ on best ways to handle your advances.  I would access ALL of the life insurance money and would NOT pay off all of the debt.  I am currently considering entering a trial at Dana Farber in Boston and I live in Virginia, it will cost approx $1500 a month for travel expenses and my COBRA premium just went up $480 a month and my co-insurance out of pocket just increased as well effective 01/01/10, so, having funds available for these kinds of situations can be very important.  I would rather have all of my life insurance money, invest it and earn interest, pay my monthly debts and keep the cash available for my care and unexpected circumstances.  The bills can wait and be left behind, my medical care cannot.  Anyway, just my humble two cents.  I hope you will talk with your CPA or a trusted advisor to help you navigate these important decisions.  If it helps, I had a 31 year insurance career, owned my own insurance agency and loved what I did, but, since going out on disability last March, I learned how much stress was involved in working and don't miss the stress one bit.  I feel better knowing I am taking care of myself and all of my family feels the same way.  Once you get all of the details sorted out with SS and benefits, I know you will have wonderful cherished times with your family.  I will wish that for you. Take care and my best wishes...Darlene",
      "MessageIndex": 1,
      "PostDate": "28/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745955",
      "Title": "Disability, Life Insurance advance..and Taxes Fitztwins LuAnnH"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Feb 24, 2010 03:16PM - edited Feb 24, 2010 03:17PM by DARLENEDENISE Ladies:  It's not the B6 that is the issue with Xeloda, its FOLIC ACID that is usually combined with Vitamin B supplements.  B6 and B12 combos include Folic Acid.  You can buy B6 without the Folic Acid. I took Xeloda and B6 and read about it on the Xeloda site and had discussion with the Xeloda nurse that called me every week while on treatment.  She confirmed the issue is the Folic Acid, not B6. Always follow your oncs advice, but maybe there is some miscommunication going on and you could reopen the conversation. Good Luck...Darlene",
      "MessageIndex": 5,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748856",
      "Title": "NO VIT B6 WITH XELODA dfleaman shopper16"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Mar 14, 2011 11:37AM DARLENEDENISE wrote: My heart is hurting and I am prayerful that you will take a little time  to restore your body and spirit to have loving time with your beautiful wife and family during this most difficult time. My thoughts and loving prayers are with you....Darlene",
      "MessageIndex": 60,
      "PostDate": "14/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765945",
      "Title": "The verdict is in Bernicky lwd"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jul 21, 2009 01:19PM DARLENEDENISE wrote: Anne:  I struggled with this decision too.  I had liver mets.  The plan became to remove the primary with the least amount of surgery if my mets responded to chemo.  My onc allowed me to make the surgical decision and then shared that it was his desire to see it removed.  I opted for a lumpectomy since my breast tumor shrank down to almost nothing along with my liver mets.  I told my surgeon if she could get clean margins, not close ones, then we would go with that and add radiation.  If they were close or questionable to go with a mastectomy.  I wanted the primary gone with the least stress on my body and immune system. I wanted to avoid additional reconstructive decisions and potential cosmetic surgeries.  If I have recurrence, then I can have a mastectomy.  The goal for stage IV is not curative, it is to reduce tumor burden and to obtain loco-regional control. I had a conversation with a gal at my onc last year who was stage IV and she said \"you don't do surgery on a stage IV patient, it won't help me now and I don't want the risks or the agony of surgery.\"  I tried to talk with her about the importance of loco-regional control and apparently her breast surgeon did not fully explain what that entailed, so, she had no use for my thoughts. Anyway, the tumor continued to grow, so, she would only do radiation, no surgery.  Well, she endured tremendous pain, infection and many issues with that procedure only to find that she had no choice but to do surgery because the radiation did not work and caused additional problems.  Her surgery was more extensive than it would have been in the beginning because of the radiation damage. I have know several other women who did not have surgery and when their disease progressed, so did the tumor and it broke through the skin and it was horribly painful and smelly and caused additional unnecessary agony during their last months of life. I say, if the window of opportunity opens to do surgery while you are doing relatively well, take advantage and get loco-regional control.  It may or may not add to your survival, but it just might and will help with loco-regional control and to perhaps keep it from invading the chest wall which is very difficult to treat. It's been a year since my successful lumpectomy and I just had my mammogram and the girls are behaving right now.  I hope this gives you and anyone thinking about this issue some thought provoking information.  I might add that you should talk with a BREAST surgeon about this, not a GENERAL surgeon who also does breasts along with other surgeries.  The oncologist's role here is to think about disease management, the breast surgeon will focus on loco-regional control, two different animals that can help support one another. Ask your breast surgeon to show you some pictures of tumors that have progressed out of the breast. Good luck...Darlene",
      "MessageIndex": 22,
      "PostDate": "21/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737465",
      "Title": "Any chance tiny lung nodules are NOT mets? AnneN AnneN"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 3, 2010 07:44PM DARLENEDENISE wrote: Sloop:  Why are they doing follow up with a CT and not an MRI?  MRI is the gold standard for this and I am shocked a CT is being utilized.  There are many reasons she might be experiencing these news symptoms, some more concerning that others.  I would call her oncologist ASAP about this.  They may want to move scan up and if I were you, I would request it be an MRI, especially in light of these symptoms. I hope thing work out for your bride.  Let us know how things go along. Darlene",
      "MessageIndex": 1,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753587",
      "Title": "brain mets sloop chainsawz"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 15, 2010 10:17PM DARLENEDENISE wrote: Fuckkkkkkkkkkkkkk!  I do not like this news.  Are you sure that it is not worth a biopsy to determine current tumor status?  Has this REALLY been put on the discussion table?  How about a platinum being added to a chemo to help go after the rapid dividing cells and hiting their ability to repair DNA? If you have already had platinums, have you ever had Vinblastine and Mytimyocin?  Is the Eribulin the only thing Winer has in his bag of tricks right now?  Any other choices? Would you be willing to share your tx history?  My heart hurts for you and I am so very wishful that a plan will present itself and set that liver right again. Sending all my very biggest and bestest vibes........Darlene",
      "MessageIndex": 13,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758065",
      "Title": "Gemzar Sucks and Isn't Working RobinWendy 3katz"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 20, 2010 08:25PM DARLENEDENISE wrote: Robin: Heartfelt hope, hugs and prayers.  With you in thought.  Wishing you the best possible outcome. Darlene",
      "MessageIndex": 64,
      "PostDate": "20/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758065",
      "Title": "Gemzar Sucks and Isn't Working RobinWendy 3katz"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jul 2, 2010 06:00PM DARLENEDENISE wrote: Hi:  Like Chainsawz I worked in the insurance industry as an agent for over 30 years.  I had the same thing happen to me and the anesthesiologist office told me to appeal to my insurance company and I told them since they provided the service of which I had no choice, they could either deal with the insurance company or they could simply write the balance off and that as a terminally ill patient I did not have the time nor the patience to deal with it.  She told me she would refer it to the office manager and I asked her to have the manager correspond with me in writing.  Three days later I got a copy of the bill with a letter indicating they had written the $1200.00  off and I had a zero balance. Hope someone with some sense has some compassion for you and does the right thing!! Good luck!!!  Darlene",
      "MessageIndex": 17,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754866",
      "Title": "A Moment of Rant khartoregon khartoregon"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Oct 21, 2010 06:28AM DARLENEDENISE wrote: Bo:  I have had these issues and found sucess with Sennacot and Colace taken at night.  I take the max dose and if it doesn't get things going, then I take Miralax in addition until things move along.  Then I go back to 1 Sennacot and keep with the 3 Colace to keep things softened up.  You can then use just the Colace, stay with the full dose, everynight.  If things bind back up, add back the others.  Try soaking in a nice hot bath each night to relax things.  I still shower but the bath does help and makes my achey bones feel better too.  I throw in some epsom salts. Another good thing is a tea made with Senna called Smooth Moves by Traditional Medicinals.  Make nice and hot and sip it in the am.  Helps to do it the same time each day while relaxing.  Hope you resolve this and get a little routine going that keeps you going and going... Darlene ",
      "MessageIndex": 27,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759610",
      "Title": "Bowel Blues bopeep bopeep"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 15, 2010 09:52PM - edited Sep 15, 2010 09:56PM by DARLENEDENISE FYI:  Dr Damian Dupuy at Rhode Island Hospital is the country's top RFA doctor.  I consulted with him for Nanoknife (still in investigational study) because my lesions were close to portal vein and bile ducts and I was not a candidate for Cryoablation, Cyber (due to volume) or any of the RFA proceedures.  I would go for focalized treatment for a few stubborn liver mets if I was eligible.  Use your chemo options wisely.  They can go fast.  Saddly for me I'm not a candidate for any of these great options.  I was able to send my last CT scans and last three doctor's office notes by mail, used e-mail and the phone for consultation.  It took about 9 days since Dr Dupuy was out part of that week.  There was no cost involved.  I did not use my onc, since he is so busy, it just slows the process.  I just gave him the info for my file once I had an outcome.  And remember, your onc will probably shy away from these treatments, since they know how to treat systemically with chemo and are not always up to date on EVERYTHING out there.  Sometimes we teach them and go after treatment that makes the most sense for us as individuals.  And, of course, everything is not for everybody. Good luck ladies and please let me know how things go. Darlene ",
      "MessageIndex": 7,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758088",
      "Title": "Cyberknife for liver mets? Rach958 thisisme"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 19, 2009 09:02PM DARLENEDENISE wrote: Wendy:  Rolling out the prayer mat, on my knees for you and your family.  Sending prayers and waiting for good results news soon. cyberhugs...Darlene",
      "MessageIndex": 24,
      "PostDate": "19/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736081",
      "Title": "WendyV needs our support katie11 heatherpalmerton"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 15, 2010 09:52PM - edited Sep 16, 2010 05:14AM by DARLENEDENISE",
      "MessageIndex": 6,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758088",
      "Title": "Cyberknife for liver mets? Rach958 thisisme"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 20, 2010 07:04PM DARLENEDENISE wrote: Good point, however, radiation is not the same as all RFA techniques.  Radiation is delivered by linac accelerators, ie Cyberknife, SirSpheres and Theraspheres.  Double edge sword here.  Some chemos will exclude you as well.  We can't win.  This disease doesn't ever let us plan anything from treatments to life events!!!  We gotta take the punches as they come.  Sigh.......Darlene",
      "MessageIndex": 10,
      "PostDate": "20/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758088",
      "Title": "Cyberknife for liver mets? Rach958 thisisme"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 15, 2010 08:30PM - edited Sep 15, 2010 08:31PM by DARLENEDENISE Rachel:  I have had Cyberknife to the brain and I love what the Cyber has to offer to so many.  My rad onc is the Cyber director and he is a real top doc, Stanford grad, that I respect imensely.   I have three stubborn liver mets that I consulted with him on for Cyber.  The total volume has to be under 6cm.  The reason being, although the liver will regenerate itself, it will develop scar muscle when radiated.  It does not regenerate like most would think. I am a bigger fan of Cyroablation for the liver which is done by an interventional radiologist.  It is easy for them to see on CT the lesion and the formation of the ice ball to be sure they are getting only the lesions with minimal margins and there is emerging data suggesting that this particular method causes an immune reaction by the body not seen with RFA (heat or radio waves) or any radiation. Since your liver is vital and we especially tax it with chemo and will need to continue to have future chemos, I would leave any radiation to the liver as a last choice. If you go the Cyber route, I would only have it done at Stanford.  Just my humble opinions, here. Let us know how things go and good luck....Darlene",
      "MessageIndex": 1,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758088",
      "Title": "Cyberknife for liver mets? Rach958 thisisme"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Feb 25, 2010 08:02AM DARLENEDENISE wrote: Elizabeth:  Cyberknife veteran here.  I have had 11 critters zapped.  I have had to lay there perfectly still in one session for 3 freaking hours!  Be sure to go pee before you go in!  The mask is tightened to imbolize you and you will find it better to have eyes shut and no make up.  The mask leaves a lovely imprint on your forehead and cheeks.  You will not be camera ready when you leave!  When they do the CT simulation and make your mask, ask them to make the nose area a little loose.  They can pull on it before it hardens and it does make it easier to breathe and relax.  My first mask was too tight on the nose and it really bugged me. Put on lots of chap stick.  The room is dry and COLD and you wont be able to lick your lips or open your mouth to swallow. I have a two mask collection.  I put my wig, some glitter false eyelashes and wax lips on the first one.  I call her Hoochey Mamma.  Went with Mr Potato Head on the second one.  The posts on the back of the eyes and lips stick in the holes of the mask well.  Spudnick! Just wanted you to know that after 11 zaps, I still know my name and my ABC's!! Wishing you well and no extra critters on your MRI!!! Darlene",
      "MessageIndex": 270,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Aug 29, 2009 10:42PM DARLENEDENISE wrote: Carla:  Although scary, I hope your onc will order a liver biopsy.  Since you have had mets since 2006 and you indicate aggressive cancer behavior, perhaps you are correct that you are now Her2.  It would be beneficial to use Herceptin and Tykerb as you know.  The bad news is you could be Her2 positive, the good news is you could be Her2 positive.  I'm Her2 positive and have had liver mets since inital dx in 2007. Good move getting with an onc who specializes in Advanced breast cancer.  Good luck and I'll be on the look out to see how you are doing, so, keep us posted. xoxoxo Darlene",
      "MessageIndex": 1,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739694",
      "Title": "Crap Liver Mets ccarter48818 sportsmom"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 19, 2010 01:34AM DARLENEDENISE wrote: How large is your lesion?  Cyber-knife is used when there is less than 6 cm in total volume of lesions and other treatments have not worked.  Other options, ie RFA, Cryoablation, ThereaSpheres etc., typically cannot be done when the lesions are too close to veins or bile ducts.  I consulted for Cyber-knife (used it for my brain) and my liver lesions had too much volume and are also too close portal vein and bile ducts for any focalized treatments.  So, for now I am using chemo.  I may look into TACE (chemoembolization) if this chemo is not sucesssful.  My cancer has not reocurred anywhere else in the body and I have had several systemic treatments.  I have the same three lesions since Jan 09 and since they are stubborn, focalized treatment when available, might be of benefit to me. When I was first dx my liver had too many lesions to count and I had an accute liver episode right after starting treatment.  It was a very unpredictable time and the oncologist wasn't sure how things would go for me.  I responded very well to Taxol, Carbo Herceptin and the liver cleared up in 4 months.  Those three stubborn lesions came back after 8 months of Herceptin only.  In your circumstances, it might be best to go with systemic treatment with chemo and maybe use focalized treatments to clean up any stubborn mets that are left (if any!). I hope you are able to move to a treatment that works well and fast for you!!!! Darlene",
      "MessageIndex": 9,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752357",
      "Title": "LIVER METS BUTTERFLYBONNIE vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Oct 7, 2010 03:27PM DARLENEDENISE wrote: Butterfly:  I think you live  in IL?  If so, I would go to the University of Chicago asap.  I would not rely on a community oncologist at this point.  I will be thinking of you and hoping you find your way to something to turn this around. Darlene",
      "MessageIndex": 27,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752357",
      "Title": "LIVER METS BUTTERFLYBONNIE vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Feb 1, 2010 06:18AM DARLENEDENISE wrote: Fitz;  Was the form submitted directly to the insurance company?  If not, don't send it.  Request to speak with your onc directly.  My onc doesn't fill the forms out, his PA does.  The PA called and said she did not want to put anything in writing that would upset me.    I told her I would be more upset to be refused the benefits I needed to finance no longer working AND paying all of my extra medical expenses.  My onc had no issues in completing the form as needed, since NO ONE knows for sure when someone will die.  He said he was sorry for the issues we were dealing with, but was happy to help in anyway he could.  He said it's the least we deserve with all that we have to deal with.   Two of my policies required life expectancy of 12 months or less and one 6 months or less and he signed off on all three.  I hope the form was not sent and you can have your onc complete the form in your favor.  If it was, request he send a letter indicating it was not completed correctly by his staff and send a corrected form.  I'm sorry this isn't going smoothly.  I hope it can be turned around.  Keep us posted. Your friend in Virginia Beach...Darlene ",
      "MessageIndex": 5,
      "PostDate": "01/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747631",
      "Title": "WTF accelerated benefits Fitztwins Shaysmom"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jul 4, 2009 08:16AM DARLENEDENISE wrote: JoJo:  May I respectfully inquire as to your tumor status?  I respect your decision and am all about QOL, I have made most of my choices based on grabbing as much QOL as I can while undergoing what I perceive to be life extending treatment.  I know I will know when enough is enough.  I would like to offer this thought.  Seeing the recent fights/decline/deaths of your friends can certainly stir emotions and thoughts, but your disease management QOL and outcome WILL be different from everyone of them.  Breast cancer does not treat everyone the same, it is a different disease for each of us. I spent time with a friend yesterday that came into my life when I had similar thoughts as you.  I was stage IV at dx with extensive liver mets, and did not want face ongoing chemo.  My friend was diagnosed at age 37 with extensive liver mets and did endure 9 months of chemo.  She had told her onc and family that she would endure no more treatments and went off the chemo at 9 months and our onc had to beg her to accept Herceptin (she was a lottery recipient of the drug in 1998).  When she stopped treatment he had been working behind the scenes to get her approved to receive the drug and it took him 3 months.  He told her you can chose to take it and you can chose to stop it if it impedes your QOL.  She agreed to try Herceptin and has only been on Herceptin with no real QOL issues, other than going in for infusions every three weeks since 1998 and is still NED, has worked, watched her 3 children graduate, go on to college and became a grandmother 10 months ago.  I am on Xeloda which is an oral chemo I take at home with a good QOL and have been on it since Jan.  This was not my oncologists first choice for me and he wanted to give me a more agressive cytotoxic chemo.  I know others who have been on Xeloda for several years and are stable.  Had they not tried Xeloda they would have subcumbed to the disease.  Months with a good QOL is a HUGE gift to you and your family.  I don't know you or what information you based your decision on, I can only hope you have been given all of the CORRECT medical information about YOUR type of breast cancer. You can even chose to skip standard of care regimens and perhaps try something aimed at QOL and see if it gives you comfortable time.  Even if you forgo chemo or target therapies,  there are palliative treatments that will improve your QOL during your remaining time.  Please don't close your mind to these options.  Your thoughts, feelings and need for support are always welcomed here.  There are many women here for you.  I sense you do not want the pity and attention this disease brings.  You don't have to tell anyone but who you chose to tell.  I did not want the pity part and I can say what I perceived as pity has shown to be true care and compassion and friendships at a depth I have never known and would have never known otherwise.  Another gift in this mess. I wish you peace and comfort physically and spiritually as you move forward. With loving respect, Darlene",
      "MessageIndex": 18,
      "PostDate": "04/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736822",
      "Title": "No Treatment JoJoPotatoes Lowrider54"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Aug 14, 2009 02:48PM DARLENEDENISE wrote: I have heard around the chemo room that ports can cause heart problems.  I never saw or read anything like that and thought it wierd or perhaps they were misinformed.  Guess not.  Damn, sorry for the new ripple in the old cancer pond.  It just never seems like we get calm waters for long.  It's always something. I hope it is a simple fix and sorry you have to be the one to teach me a lesson about ports.  I hope if you get a new one out the deal, it one of the power ports. Good luck and keep us up to date with your progress and what you learn. Feel well...soon  Darlene",
      "MessageIndex": 1,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738940",
      "Title": "Superior Vena Cava Syndrome - any experience? Analemma jeanne46"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jan 26, 2010 07:05PM - edited Jan 26, 2010 07:07PM by DARLENEDENISE Marybe:  I am currently on Gemzar for liver mets.  I have been on it since the middle of December with minimal side effects.  I was one sick puppy on Taxol/carbo (it worked exquisitely) and had lot's of side effects on Xeloda and although it was working, had to stop it.  I just scanned and liver is responding along with no new sites.  I have had to have dose and frequency changed due to platelets.  I started a very low dose weekly every 3 weeks, one week off.  My platelets tanked, so my dose has been increased and tx is every other week and so far so good.  Platelets holding and se manageable.  If I remember, I am at 80% dose now.  I am feeling more fatigued now and required an Aranesp injection.   I'm a delicate flower when it comes to drugs and chemos and I find this a very doable chemo.  I consult at Dana Farber and metronomic dosing of cytoxin and mexotrethate are being used by doctors there, maybe something to explore for later? I will hope that Gemzar is a real \"gem\" for you in efficacy and tolerability!! All of my best...Darlene",
      "MessageIndex": 1,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747403",
      "Title": "Gemcitabine for liver and bone mets Marybe Marybe"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 25, 2010 07:24PM DARLENEDENISE wrote: When mine gets bad from chemo, I increase my Protonix to 40 mg twice a day and use the extra strength malox or mylanta for break through discomfort.  Once things settle down, I go back to one Protoix a day.  Hope it is chemo related and you get a handle on it ASAP.  That stuff hurts!!! Darlene",
      "MessageIndex": 1,
      "PostDate": "25/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758539",
      "Title": "Acid reflux pain and chemo, or could it be mets spreading? mom2acat konakat"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 12, 2010 04:41AM DARLENEDENISE wrote: National Cancer Institute accreditation.  You can find them on the NCI web page.",
      "MessageIndex": 9,
      "PostDate": "12/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757891",
      "Title": "Sorry to be joining you and I'm scared to death... bopeep leprechaun"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Oct 22, 2010 04:46PM - edited Aug 20, 2013 05:59AM by DARLENEDENISE Sometimes these twinges are a result of lesion shrinkage.  I hope so for  you!! Darlene",
      "MessageIndex": 1,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759740",
      "Title": "Tykerb - liver met twinges??? flachica flachica"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Nov 11, 2010 01:12AM DARLENEDENISE wrote: The Mayo Clinic is tops on liver treatment.  Visualase is being used on the liver there.  Not sure of  the criteria.  Interventional radiologists perform chemoembolization and they should be available  where you live.  Look under interventional radiologists society for info. Many factors play in what treatment you qualify for.  Check them all out.  Also NIH is doing hepatic arterial infusion with filtering of the bloofd after chemo is introduced to minimize side effects.",
      "MessageIndex": 5,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760582",
      "Title": "Looking for targeted liver trial bopeep lwd"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Mar 25, 2011 09:53AM DARLENEDENISE wrote: Check your LTD benefits to see if it has a terminal illness provision that may give you a higher percentage of your salary for a specific period of time.  Mine paid an additional 30% for 12 months giving me 80% of my income.  Also consider taking Accelerated Benefits from any life policies that you have including any group coverage.  Good luck. Darlene",
      "MessageIndex": 7,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766614",
      "Title": "I WANT MORE TIME! jenn3 AnewBeginning"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 5, 2009 05:36PM DARLENEDENISE wrote: Emma:  I've been looking for a PARTAY and looks like you will be having one to celebrate this most awesome gift and the good news about the brain MRI.  She is beautiful!  Hey, let's mix up some of those Morrocan Martinis!!! Darlene",
      "MessageIndex": 2,
      "PostDate": "05/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735394",
      "Title": "New Baby Girl! Analemma marie1963"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Mar 2, 2010 01:29PM DARLENEDENISE wrote: Tami:  Request a change of policy ownership making you the owner and keep your father as primary beneficiary, then make the claim.  Accelerated Death Benefits are a pre-payment of the policy face amount, they are not a loan and do not under any circumstances have to be re-paid.  Any assets can be used in determining eligibility for certain programs such as Medi-CAID and Social Security INCOME, programs for those with limited resources.  Not to be confused with Medi-CARE and Social Security DISABILITY which are not affected by assets and are granted to us because we have paid SS and Medicare taxes.  As metastatic breast cancer patients we automatically are granted SSD and will be eligible for Medicare health benefits after 29 months from SSD date of disability determination. Although you are NED and have had a nice long dance with it, your disease is UNPREDICTABLE and sadly for all of us, it can change in one scan.  Your onc will be attesting to \"statistics\", not  just your individual prediction, which he really does not know, no one does.  Your insurance company knows this too.  It is not likely they will request anything more than the claim form once they see that you have Metastatic Breast Cancer.  Even if they do, and find a way to not pay the claim, what have you lost?  You are not a cheater or making a fraudulent claim.  You are taking the steps set forth by the policy contract to see if you are eligible for a policy benefit that you have paid for. I think  your onc should and will simply sign off on the form.  They do these types of things every day.  You need to take these steps while you have a valid contract and are well enough to make these decisions.  I encourage you to obtain advice from a trusted adviser after obtaining the funds about using them to pay off your father's mortgage.  There may be reasons to not use the funds in that manner.  Might be better to use it to make payments and keep the bulk of the money available to help you in the future, should you need it for disability, medical reasons, etc.  Once it's gone, it's gone.   Just want you to consider YOUR best interests now and later. I hope this goes your way (I expect it will)!!  Let us know...Darlene",
      "MessageIndex": 72,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Mar 2, 2010 06:16PM DARLENEDENISE wrote: One more thing, you can convert the balance of the policy from term to a whole life or universal life product without evidence of insurability before it comes to the end of it's term in 2014.  If you do a conversion and keep premiums current, you will have coverage available upon your death. Darlene",
      "MessageIndex": 73,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Apr 9, 2010 07:06PM DARLENEDENISE wrote: Allison:  You are correct.  I was referring to the negotiated reduction amounts of your debts.  Accelerated benefits are not taxable, nor would be the remaining benefits that would be paid to your beneficiaries.  Darlene",
      "MessageIndex": 118,
      "PostDate": "09/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 1, 2010 06:57PM DARLENEDENISE wrote: Don't send them.  Talk to your onc.  Of course it's unknown, everyone knows that including the insurance company.  They asked for his/her OPINION of number of months.  What ever the definition of your policy benefit is ie 6 mons, 12 or 24 months is what he/she needs to put.  If they did not ask for medical records to be submitted with the form, eliminate them.  Tell your onc the deal, you are in need of these benefits now and since it is unknown you need for him/her to complete the forms in your favor.  It's the least your onc can do to help your quality of life. Hoping the best for you!   Darlene",
      "MessageIndex": 150,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 1, 2010 07:28PM DARLENEDENISE wrote: 3katz:  They are NOT taxable income.  It is an advance of life insurance proceeds.  Take a look at the 1099, it states that is is not taxable.  You still need to include the 1099 in your tax return.  As a tip, keep some aside in case you need it for treatments or clinical trial travel.  I put all of mine away for that 21/2 years ago and I have used some to go to Dana Farber for consultation, UNC Chapel Hill for Brain treaments and follow ups every two months for the last 2 years.  I am now using some of it to travel from Va Beach to Nashville for trial participation.  I have spoken with several gals that cannot afford to travel while on SSD.  Take care and think of your big picture when exploring this important decision. Darlene ",
      "MessageIndex": 172,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jul 30, 2009 04:30PM DARLENEDENISE wrote: I would encourage you to consider the use of Xeloda with the Tykerb, not only to enable you to get the Tykerb, but, Tykerb with Xeloda gives better results than Tykerb monotherapy.  Since you have a met causing pain related issues, the Xeloda just might be the agent that can kick that met.  I take Xeloda, Tykerb and Herceptin currently.  The Xeloda is being given at 1000mg a day 7 days on and 7 days off to minimize any side effects.  I have had it a higher doses and it did indeed give me side effects that required medical intervention.  I am tolerating the 1000mg dose well.  I understand not taking the ovaries based solely on the hormonal issue, if they were not causing pain related symptoms.  I would think here in the US most oncs would support removal for pallitive pain relief.  Maybe a trip to the ER in unbearable pain might encourage the doctors to remove the ovaries?   Sometimes a girls gotta do what a girls gotta do to get what she wants!!! Anyway, just my humble 2 cents worth.  Good luck! Darlene",
      "MessageIndex": 4,
      "PostDate": "30/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738118",
      "Title": "At a crossroads again. Need treatment advice. mason204 konakat"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jan 16, 2010 01:04PM DARLENEDENISE wrote: Jen:  I took my benefits from all three of my life insurance policies.  One group and two individual.  I actually was the writing insurance agent for my two individual policies, that really makes it weird when you process your own claim forms!  Most policies are 12 months life expectancy, some six.  Insurance is based on statistics.  The insurance industry knows that no one doctor or you knows exactly will you will die.  If you have a disease that statistically meets their definition and you supply supporting documents, then you are entitled to the benefits contained in the policy contract.  If your doctor has signed off on the forms, he is not sure about your time, he is simply attesting to your dx and the stats the disease carries.  I'm sure he feels an obligation also to provide you with this document to enable you to obtain all of the support you need and are entitled to, not that he really thinks or knows your timeline.  While the benefits are in force and available to you, I say take your benefits and use them as it best benefits you and your family.  It's the least you should get in this deal. By the way, I have lived longer than the forms stated!! Good luck on this...Darlene",
      "MessageIndex": 2,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Apr 5, 2010 07:41PM DARLENEDENISE wrote: Tami44:  What do you mean you can't find the \"others' whole life policies at the moment?  Do you not know the company they are with or do you just mean you can't find the physical policy contracts?  Maybe I can help? Darlene",
      "MessageIndex": 109,
      "PostDate": "05/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Apr 21, 2010 09:28AM DARLENEDENISE wrote: Tami444:  Hooray!!  I'm so glad for you to have this piece of mind.  Just passing along some random thoughts.  I can't help it, I was an insurance agent/financial adviser.  It's not always in your best interest to pay mortgages etc off.  Remember, you will more than likely not be able to earn money in the future due to treatments/disability.  Don't let all you have go.  Any monies you choose to save, consider putting in only in your name with POD arrangements for your husband, family etc.  Although many of us have very supportive husbands, like this disease, things change and some leave or want to spend the money, so, protect yourselves.  If you have paid off loans, mortgages, etc that are in joint names, that money is gone if he should leave.  I have spoken with women whose husband also became disabled, lost a job, died etc and they found themselves in need of cash and these circumstances do not allow them to get credit any longer.  I recently looked into a procedure for my liver and if eligible, would have had to pay for my probes (not an FDA approved procedure yet, still in research) and travel to have it done.  Easily I would have needed $40,000.  Another reason to have some money aside.  I often see posts of women that can't get certain drugs approved by insurance.  I want all of my medical options available, even if I have to pay for some. Sorry to sound like your mother, just want everyone to think hard about their circumstances and plan well. Glad Tami444 got the money she deserves!!! Darlene",
      "MessageIndex": 129,
      "PostDate": "21/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 25, 2010 11:43AM DARLENEDENISE wrote: There could be many reasons it wasn't available on your WL.  The amount of coverage on your policy may not qualify (typical on old small WL policies), the fact that the company doesn't offer it on that particular contract type, etc.  Just want to be clear for everyone that the accelerated benefit can be available in many different circumstances and you should not make assumptions from what you read here.  Contact the life servicing department of the company that has your coverage to find out all of your options.  Don't forget, if the rider is not currently on your contract there are circumstances in which it can be added at your request and then a claim made.  Be sure to ask and request explanation anytime you are told you do not have the benefit and/or cannot add it now.  I encourage this, since it can be a complex issue and not all staff is experienced with it.  Don't be afraid to ask for a supervisor to help you.  This is a very important and life changing benefit. Darlene",
      "MessageIndex": 161,
      "PostDate": "25/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Mar 29, 2010 02:13AM DARLENEDENISE wrote: Cathy-CA:  Guaranteed issue does not mean there aren't medical questions and criteria to meet.  It means, if you can answer the medical questions with acceptable answers and meet their criteria, they will guarantee issuance.  You will not get around any individual applications without the cancer questions and request for physician information, not even the AARP ones, which are underwritten by New York Life. I wish this wasn't an issue for any of us!!  I wish I could wish it all away!!!!!!!!!!!! Take care, my sisters! Darlene",
      "MessageIndex": 17,
      "PostDate": "29/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/750327",
      "Title": "life insurance patti4511 DARLENEDENISE"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 19, 2010 06:08PM DARLENEDENISE wrote: Janis:  I started out taking mine at bedtime.  I have GERD and Tykerb REALLY made it worse, so, I found by taking it in the am and increasing my 40 mg of Protonx to twice daily helped with the acid reflux issues.  I had to use Lomotil, Immodium did not help.  Ultimately, I used injectable Sandostatin and had to reduce dose.  I made stool soup constantly!!  It wasn't easily managed for me.  I wasn't able to stay on it.  I became severly dehydrated several times.  Load up on Gatorade. I hope you are one of those gals that have no real issues and it crushes those mets fast!!! IMHO, I would wait until after the wedding.  Take care....Darlene",
      "MessageIndex": 3,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752828",
      "Title": "Tykerb questions Fitztwins awjkej"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Aug 3, 2010 07:17PM DARLENEDENISE wrote: Hey Robin:  I am on this liver ride with you.  I'm on 5th line of tx since 1/08 and have been watching my markers and enzymes like a hawk.  Onc orders every three weeks.  Markers have been dropping nicely, then bam, Alk Phos takes an upward turn, then down again, but markers drop.  Whew!  Then next test shows Alk Phos dropping, but markers up three points.  WTF?  This week, markers down to normal range, but Alk Phos starts climbing.  This ride sucks.  I feel like Sybil!  One minute I'm bawling thinking I'm gonna be toast, then I'm doing the jig because my markers dropped again!  Crazy isn't fun!!!!  I have scans week after next.  I pity my family and friends right now!  So, I'm not feeling it right now either.  Here's to hoping Gemzar (for you) and Navelbine (for me) are crushing some cancer in spite of our upside down faces. Darlene aka...Sybil",
      "MessageIndex": 12,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756267",
      "Title": "I Spoke Too Soon But The News Is Not Bad RobinWendy Lowrider54"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 9, 2010 01:29PM - edited Jun 9, 2010 01:30PM by DARLENEDENISE OHHHHH YEAH!!!  You know how I feel about my bff, Cyberknife.  I am so very glad this may be an option for you.  It will save you so many unecessary side effects and long term issues, not to mention, it will enable you to get the highest TARGETED dose of rads right on those effin lesions. Heres hoping Cyberknife is approved!!!!!!!!!!!!! Darlene",
      "MessageIndex": 2,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753872",
      "Title": "The cyber way ead konakat"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Mar 28, 2010 04:48AM - edited Mar 28, 2010 04:51AM by DARLENEDENISE The question will be, Have you been diagnosed, treated or displayed symptoms of cancer in the last (blank) years.  Usually 2-5 years.  Along with heart, AIDS etc.  They will also ask if you have been treated in an Er, hospital or doctors office for these or any other reasons not stated in (blank) number of years.  No medical exam, does not mean there will not be medical questions.  They will usually require your primary care doctors information to order reports.  If you do not list one, it will be a major underwriting red flag. NED doesn't mean you don't have cancer, that would be a cure.  NED means there is no CURRENT evidence of the disease detectable by current scans and testing, you still have cancer and it will be come evident again. Stage IV, even NED, will be a no go, I'm sorry to say.  Because of my life insurance background, I have had many pm's aimed at trying to \"find ways around\" this and I just want to stress, that the application becomes part of the policy contract and any misrepresentations or ommissions will cause the company to exercise the contestibility clause and not pay your beneficiaries the policy face amount, only a return of the premiums that you paid. And in this economy, you better believe they will investigate heavily any short term death. If you have a large sum of money, there are some companies that will accept it and set a live to date and if you live past it your family will get the stated death benefit.  For example if you have $25K and the insurance company accepts it and you live say, 10 years, a death benefit of $50k would be paid.  This is not a market I worked in and don't know much more about it that this.  But maybe a life representative with a large life insurance only company would be able to help you. Sorry to spread such unwelcome information.  Darlene",
      "MessageIndex": 14,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/750327",
      "Title": "life insurance patti4511 DARLENEDENISE"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Nov 13, 2010 10:24PM DARLENEDENISE wrote: If you have an HMO or POS that may be the underlying issue since you will be out of state and out of policy provisions of using only the company's MANAGED Care facilities.  All related, scans, tests, etc should be paid by ins and drugs/vaccines by sponsor of trial.  You should be able to arrange those protocol required scans, tests etc back at home in NY under your HMO and reports sent to trial investigator/doctor.  This was the case for a family member who had a VA HMO and went to a trial out of state and the insurance did pay for services related here in VA. Call your insurance claim benefits supervisor for clear policy determination.  Don't rely just on a trial coordinator dealing with all kinds of insurance issues that all differ from yours. I think it will work your way. Hope so and let us know. Darlene",
      "MessageIndex": 12,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760689",
      "Title": "Insurance won't pay for clinical trial, a cautionary tale claygirl justjudie"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 26, 2008 03:09AM DARLENEDENISE wrote: Where was the spread?  How long ago?",
      "MessageIndex": 13,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721722",
      "Title": "HER2 + Gals - a Question mthomp2020 mthomp2020"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 26, 2008 01:58AM DARLENEDENISE wrote: I'm Stage IV at dx and was given Herceptin at dx and onc told me I would stay on it for as long as I am here.  I met a patient who went on Herceptin 1998 for Stage IV with mets to liver at dx in 1997, mets to brain in 2002 and has always been and will continue to stay on Herceptin.  It's worked for her for 10 years!! Herceptin only given one year as adjunct treatment for early stage disease to reduce chance of reoccurance. Hope there is a misunderstanding and that Herceptin will be your best friend for many years to come!! Darlene in Virginia Beach",
      "MessageIndex": 11,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721722",
      "Title": "HER2 + Gals - a Question mthomp2020 mthomp2020"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 28, 2009 03:17AM DARLENEDENISE wrote: Janis:  What's next, Jay Leno or the Whitehouse?  You are making the rest of us cancer chicks look pretty unexciting!  I hope you can post the video for us all to enjoy.  You will make us all look good, I'm sure of it.  Oh, what is the trial about? xoxoo  Darlene",
      "MessageIndex": 14,
      "PostDate": "28/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740974",
      "Title": "15 minutes of Fame Fitztwins LRM216"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Aug 10, 2009 12:57PM DARLENEDENISE wrote: Heidi:  I just finished using all of my best cus words!  I hate this for you.  I have brain mets and had a lepto scare, so, I am aware of the dark place you are in right now.  My heart melts for you and your family.  I am glad you will be getting care at such a fine facility as Sloan. I am forwarding two recent posts from another site to give you hope and direction.  I'm sure these ladies won't mind the cross post. We all care and stand by to help in any way we can.  Darlene Re: Intracranial chemotherapy via Shunt advice needed Reply to the list I had leptomenengeal mets last fall. We found it when I had an attack of Bells Palsy. I've had an Ommaya Reservoir installed and had intrathecal Methotrexate chemo. It was pretty heavy duty. Within 15 minutes of infusion, I was laid out like a baby. We were able to clear out the CSF of the cancer, but I ended up with menegitis that almost killed me. I'm told that if it should return, we'd use Depocyt instead of Methotrexate. It's easier on the body and you need it less often. After we finished chemo, I had WBR and full spinal radiation. Knocked the you know what out of me. Damaged my spinal nerves and I've lost feeling from my braline down to my toes. But, the neurologist thinks with PT, something will come back. We check my CSF regularly and, so far, so good. We are working now on between the neck and the hips. Hope this helps. Caryn Debbie in Texas writes: > Hi Mary, > > I also have received intrathecal treatment through an Ommaya reservoir. > Receiving the chemo is not difficult and didn't take long. My doctor > insisted someone accompany me to drive me home and restricted my driving > while on the IT treatment due to risk of seizures.(which I later > developed) > > As for side effects, I was not quite as fortunate as Victoria. I was > hospitalized several times, developed chemical arachnoiditis and all > that goes along with that.There is a lot of discussion in the archives > if you search leptomeningeal and also info on brainmetsbc.org > > The good news I can share with you is that I have had clean CSF since > September, 2007. So, in spite of the \"Mr. Magoo\" glasses I now wear, the > bi-cross hearing aid,and the achey necrotic joints I am living life to > the fullest! And, feeling very blessed to be here. > > I work full time and am busy helping my daughter with plans for her > November wedding - something I really didn't think I would be here to > see after the LMC diagnosis. > > Wishing you all the best as you begin this treatment. > Hugs and blessings > Debbie > >",
      "MessageIndex": 8,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Oct 17, 2010 06:37PM DARLENEDENISE wrote: Denis:  You know in Cancer World we have to adjust our expectations, always.  I'm sorry this is the only option, but I am glad there IS an option.  I'm sorry for this difficult situation.  I sincerely admire the strength, courage and support you offer your wife.  I will be hoping she has the best possible outcome and a very speedy, recovery. Thinking of you both....Darlene",
      "MessageIndex": 14,
      "PostDate": "17/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759144",
      "Title": "Don't know what to think Bernicky chainsawz"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 7, 2010 12:45PM DARLENEDENISE wrote: HOOOOOORAYYYYY!   So glad you got this well deserved news!!!  I am hoping with big hope that the edma issue is resolved without too much trouble from the Decadron. Stay strong.....Darlene",
      "MessageIndex": 8,
      "PostDate": "07/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753743",
      "Title": "MRI results all clear. Bernicky EnglishMajor"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Feb 23, 2010 02:03AM DARLENEDENISE wrote: Cwrightrn:  Accelerated Death Benefits are available on both group life and individual policies.  You mentioned your benefits have lapsed and that you can convert to a smaller Met Life policy, before you do that please find out if the group is still active at the higher policy amount.  Typically, you can obtain 50 to 80 percent of the policy amount.  Most group plans would also have a premium waiver due to your disability so that any premiums due on the remainder of the policy benefits would be waived and you would still have additional benefits available for your family upon your death.  PM me if you need any additional info.  I have been in this industry for over 30 years and I exercised my accelerated benefits on my Met Life group policy. Good luck as you work through all of this. Darlene ",
      "MessageIndex": 51,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Mar 2, 2010 08:35PM DARLENEDENISE wrote: Tami:  Your comments lead me to think he is on Social Security retirement based on his age eligibility and it is not impacted by asests or earnings.  His Medi-CARE is not impacted either.   For the reason you stated, I suggest getting ALL you can and put it in CDs etc and earn additional income from interest until you use the money.  You can set up payable upon death beneficiaries on the CDs as well.  Enjoy your dinner! Darlene",
      "MessageIndex": 75,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Apr 6, 2010 10:07AM DARLENEDENISE wrote: Ladies:  Just a reminder, any accounts that are negotiated and settled will have taxes due on the amount not collected.  You will receive a 1099 for those amounts.  Be sure to put enough of your proceeds aside to pay the taxes so you are not put in a bind later.  Your accountant should be able to help you estimate an amount so you can be prepared.  These tax amounts depending on your individual circumstances can be quite substantial.  Even in our circumstances, Uncle Sam puts his hand out!!! Wishing you all well and easy processing of these benefits!!!! Darlene",
      "MessageIndex": 111,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Apr 19, 2010 08:00AM DARLENEDENISE wrote: Alpal:  Nice shot.  Good correct info.  You will receive a 1099 from the insurance company and it states on it that accelerated benefits are exculded from taxable income.  Glad to see more ladies benefiting from this benefit!!!  They deserve it! Darlene",
      "MessageIndex": 125,
      "PostDate": "19/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 23, 2010 09:37PM DARLENEDENISE wrote: Accelerated benefits can be on term, universal life, group life and whole life contracts.  If it is not on your policy based on it not being offered at the time you purchased it and you did not initially refuse the coverage if it was available and the company now offers it on similar contracts, it can be added and then a claim made.  It is an endorsement that is usually added or included for no additional premium.  If you are able to claim accelerated benefits the balance of coverage will be reissued and you will be able convert the term coverage to a whole life or universal life product that will enable you to continue coverage beyond 2014, regardless of your health.  Be sure to leave enough coverage in place to qualify for a conversion.  I would consider keeping the balance on the term policy and look at conversion closer to the end of the term.  Even if your policy doesn't have accelerated benefits and it can't be added, you can still convert all or part of the term.   Request assistance and guidance from your agent or directly from the life servicing division of the company that issued the policy.  You may find that dealing directly with the company a better situation, many agents have not had experience with this policy provision and I have seen many give incorrect info.  Also check to see if your policy has premium disability waiver that would waive future premiums. Good luck on this....Darlene",
      "MessageIndex": 157,
      "PostDate": "23/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jan 14, 2009 06:53PM DARLENEDENISE wrote: Tamantha Dear, I assume you are Her2+, how strongly positive are you?  Do you have any surgical or radiation options?  I think you still have plenty of highway left here, don't exit yet!!  Perhaps you can go back to Herceptin and add in other chemos, Navelbine, Iressa or maybe Avastin and  there is the TDM1 trial as well. Can you go for another opinion with a NCI facility, if you are not sure that your onc is heading in the right direction or just to put your mind at ease about your choices?  I went to Dana Farber just to explore all of my options and gain knowledge to work more effectively with my local onc.  My onc is brilliant, but I needed to cast my research net to get me through my brain mets.  I figure it's always better to cast a large net than fish with a small pole!!  This damn disease will rob you of all that you are, if you let it, don't let it!!  I dig into research info so I can make a plan and have intelligent conversation with my onc.  It empowers me and keeps me busy.  It also enables me to help others.  DIG IN!!  Stay on the highway, come up with a new plan that may very well kick your cancer's ass, and put you in the fast lane!!  I'll be watching and waiting for you drive by with with a big net full of options and good news to share with all of us soon!  Your friend in Virginia Beach...Darlene PS  You haven't failed anything, the drugs failed you!!  By the way, I have driven past liver mets and am currently doing a drive by shooting of my brain mets!!  Cancer better stay the hell out of my lane!",
      "MessageIndex": 3,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727343",
      "Title": "Scan results not good Tamantha suecco"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Apr 10, 2010 05:41PM DARLENEDENISE wrote: Dang, Dasiylego:  Sorry for the overwhelming fear you are experiencing.  I had a melt down myself.  Laid on the kitchen floor and would only let my son lay with me, for hours!  Many of us have had them and  for many more than once.  It's okay.  It upsets those that love us to see it, but, they will get over it. Sorry about the liver spots.  I was one of the rare birds that was Stage IV with liver mets revealed during my routine scans that were done right after my breast biopsy.  Like you I was ready to deal with what I had been told, \"I think we caught it early, Stage II.\"  I had no reason to even think otherwise, I had regular mammograms, every 6 months at times and all diagnostic ones.  I had no symptoms except some fatigue.   So, I thought for sure it would be a very early case.  My tumor markers were high, so my oncologist was pretty sure we were dealing with distant spread, but explained that he had to have confirmation by a biopsy.  It is an out patient procedure, not fun, but you will get through it.  I will hold out hope that these are NOT mets.  They can be other things as I am sure you were told about.  This is a good time for Xanax.  If you don't have any, call your doctor and ask that they call you in a few to help carry you through this anxious and difficult week.  I tried hard to be strong and not need any anti-anxiety drugs, it was much better for everyone that I took them when necessary, it really was a big help. I will be wishing, hoping and praying that you stay out of our club and that those spots are just spots!  Let us know if you need us and I for one will be looking to hear back about your test results.  Send us good news!! Darlene",
      "MessageIndex": 3,
      "PostDate": "10/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751090",
      "Title": "Initial diagnosis of stage IV? daisylego redskies"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 21, 2010 02:43PM DARLENEDENISE wrote: My heart breaks to read this.  I hope your journey home is filled with love, comfort and peace.  I will hold you and the ones that love you close in prayer. Love....Darlene",
      "MessageIndex": 61,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758297",
      "Title": "How do you say goodbye? Nanalinda konakat"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 27, 2010 10:15AM DARLENEDENISE wrote: Vicki: No, they cannot drop you for any reason other than not paying the premiums.  I don't want to come of as insensitive, but, this is not an emotional issue for your doctors as it is to you.  This is a business/insurance transaction and you are not the first patient to request this from your oncologist.  They deal with it all of the time.  Handle it like business.  It is a contractual benefit that you are entitled to.  You don't need to speak to your onc about this.  If it is an emotional  difficulty for you then just ask your onc's office who handles life insurance paperwork for your onc and give it to them.  Tell them you want to pick it up when it is completed and ask that they NOT send it in to the insurance company.  Attach a note to remind them.  When it is completed, check to see it is answered in your favor to obtain the benefit.  If not, THEN speak to your onc and see what can be done.  Be sure to make a copy of the incomplete form so it can be re-done if need be.  Corrected forms are a red flag, so, be sure the form is clean. Many gals who have obtained their benefits would say all of the worry and anxiety was for naught.  You and your family deserve this valuable benefit. ",
      "MessageIndex": 165,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 27, 2010 09:59PM DARLENEDENISE wrote: Damn, Vicki.  Sorry you are feeling so blue.  It hits us all.  I hope you are feeling better soon and are able to find some ways to induldge yourself.  I hope the insurance thing goes smoothly.  Best wishes....Darlene",
      "MessageIndex": 168,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746825",
      "Title": "Accelerated benefits - Have you considered withdrawing? JennGrace vickib"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Apr 11, 2010 09:11AM DARLENEDENISE wrote: Daisylego:  Tumor markers are not considered part of routine CBC or CMPs.  My liver and all of my other blood tests were in the normal range too at diagnosis.  CA27-29 is the test utilized to see about your tumor markers.  It is a different blood test and is not routinely run.  Some oncs don't use them, mine does and he orders them every three weeks to see if treatment is working.  He uses that info combined with how I feel and scans to get a real picture.  Mine were elevated.  Normal is 30 and at diagnosis they were 93.  Markers are not always reliable for each person.  Your doctor, if he uses them, will have to watch yours a while to see how they trend. Ask your onc if he/she will be ordering these markers and if they use them in the course of your treatments.  I hope this helps.  I like to know what mine are, some gals prefer not to know.  Try not to worry about anything you do not know to be factual.  Educate yourself to a level that makes you comfortable.  Many smart cookies on this site.  Call out to them if you have questions. Darlene",
      "MessageIndex": 9,
      "PostDate": "11/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751090",
      "Title": "Initial diagnosis of stage IV? daisylego redskies"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jul 31, 2010 05:00PM DARLENEDENISE wrote: Hi:  Sorry your mom is dealing with all of this too.  I did not have WBR, only Cyberknife.  Eight lesions treated 09/08 and three popped up in 06/09.  The first eight have completely resolved and no longer visible on scan.  Just had a scan 07/19/10 and the last three still appear but after 13 months of no change, considered necrotic.  Rad report says, stable. Sometimes they take a while to fully resolve, my first ones took about 11 months to disappear.  If she is not symptomatic and are stable, I think close monitoring (every 2-3 months) is reasonable.  They may still disappear.  If any do increase in size or she becomes symptomatic, then SRS could be used.  I would insist on very close monitoring with MRI. I hope she improves and no further intervention for these brain mets becomes necessary. Stay strong...Darlene",
      "MessageIndex": 32,
      "PostDate": "31/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755649",
      "Title": "Brain scan says.... DARLENEDENISE katie11"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 12, 2010 03:02AM DARLENEDENISE wrote: I say clear the stage and get a new group of players.  Ones who deal with metastatic breast cancer a lot and only are breast oncologists.  At this point the surgeon is no longer the driver of the bus.  Since it has spread, a oncologist specializing in breast cancer with a large mets patient population is the new driver and will call the shots.  You may need a surgeon again, jut not now and not guiding any of your care.  If the facility you are at is not a NCI accredited facility, I urge to to develop a relationship with one ASAP.  You can get your continued care at your local cancer center and coordinate all decisions with the doctor at the NCI facility.  At these institutions they see women like us every day, are not afraid of giving us care and have the latest research info to guide them.  This is advanced cancer and requires ADVANCED care.  It won't come to you, you have to go get it.  I get consultive care and trial info at Dana Farber in Boston, local care in Virginia Beach with an onc who did residency at Sloan Kettering and has many contacts there, brain treatment at UNC Chappel Hill in NC where my nuerosurgeon is widely published and well known the brain surgery world and recently EAP study at Sarah Cannon Cancer Research Center in Nashville.  I don't like to travel, but I will not accept shitty standard of care and doctors who don't push the medical envelope in my behalf.  I have been dealing with liver mets since 12/07 at my inital dx and brain mets since 09/08.  I hope all of the words from this forum will empower you to move past this inital fear and begin to find your best way to outstanding care.  If you share where you live, I'd be happy to tell you of nearby facilities that you might want to consider. It is hard to follow through on this when you are so scared.  I'm just one mean witch when it comes to my health so nothing scares me.  If you need help, find your strongest ally and ask them to help you advocate and help you with information. Really, I'm not bossy, I just hate cancer and seeing someone in a situation that is not the their best interests. Stay strong....Darlene",
      "MessageIndex": 5,
      "PostDate": "12/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757891",
      "Title": "Sorry to be joining you and I'm scared to death... bopeep leprechaun"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Aug 18, 2009 09:28PM DARLENEDENISE wrote: I say, yes you are.  Are you having some type of reaction or unmanagable side effects?  My friend who was 36 at dx has been on it without additional chemo since 1997 and is just now having issues with a low muga score.  I know many other women on the other bc boards who have been on it over 10 years.  Since you are young, you will probably tolerate it well for a long time. You are indeed in an enviable mets position and may get to ride with Herceptin mono-therapy for a long time.  This is not a be done with it type disease, which is why they call it incurable.  You will need to manage your cancer, always.  My initial dx was mets to the liver and even though I did Taxol, Carbo, Herceptin for 13 weeks and got the all clear on my liver, then had lumpectomy and axillary node dissection (path showed clean margins and no nodes) and had 35 rad sessions, then continued with mono-therapy Herceptin, 8 months later it made it's way to my brain.  Even though your scans may show \"no evidence of disease\"  now, you still have circulating cancer cells that have \"metastasized\" to distant sites that are microscopic and cannot be seen on scans and  they will eventually grow.  The name of the game is to slow that progression which requires treatment.  No treatment will equal progression.  Then you will need nasty chemo again with Herceptin.  I would do anything to increase my odds to not have chemo again anytime soon. An IV treatment every three weeks is a small price to pay.  This is a sneaky, evil disease that lurks in our bodies, never let your guard down.  My onc has many patients out over 5 years because of the continuance of Herceptin and gives it for life.  Good luck...Darlene",
      "MessageIndex": 2,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739154",
      "Title": "Am I crazy to want to stop Herceptin? ninismom DEAK95"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 22, 2010 12:55PM DARLENEDENISE wrote: Lorrhaw:  Plan summary calls for notifiying the plan administrator within 60 days of receipt of SSD award letter if your disability is within the 18 months of COBRA.  If you were determined disabled by SSD before COBRA, then you have to notify them withing the first 60 days.  The 60 days is not based on the date of disability determination, it is based on the date of the award letter.  I suggest you contact the plan admininstrator and advise them you sent a copy of the award letter within that 60 days and that you have not received or heard anything regarding your extension.  Keep in mind this 11 month extension is at a higher premium, 150% of the group rate.  Hope this is of some help to you. Darlene",
      "MessageIndex": 20,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751114",
      "Title": "My COBRA runs out in 6 months lorrhaw MaryNY"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Aug 2, 2010 04:44PM - edited Aug 2, 2010 08:13PM by DARLENEDENISE",
      "MessageIndex": 8,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756137",
      "Title": "brain mets and herceptin Joyce4123 Lowrider54"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Oct 9, 2009 01:49PM DARLENEDENISE wrote: Flollow through on the Cobra ASAP.  It will be backdated if you elect to take it within 60 days of your last day of coverage.  Use certified mail when you send the form and payment.  Take copies to your oncs office and perhaps they can use that in the ineterim to keep her treatments on schedule. She is eligible SSDI also and the Cobra Reduction is available to her husband for the Cobra premium of 65%.  You can apply for it once you submit your Cobra documents. Good Luck  Drlene",
      "MessageIndex": 9,
      "PostDate": "09/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741735",
      "Title": "Suddenly NO Insurance/ NO TREATMENTS Sewfinegirl concernedsis"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 19, 2010 10:53PM DARLENEDENISE wrote: I vote to keep it at current dose.  I did TCH and was supposed to have it for 15 treatments.  My chemo nurse miscounted and on the 13th dose advised the PA that I had had all 15 and they changed me to Herceptin.  I kept telling the nurse that she was wrong.  Anyway, I reviewed my info at home and confirmed only 13.  Spoke to PA and she said \"well, you are really over getting chemo and the last two doses were for good measure anyway, so it's up to you if you want the last two.\"  My recent scans showed only two immeasurable lesions left in the liver so she felt Herceptin would take care of them.  Nope!  They stayed stable until my next scan 4 months later and the next scan at 8 months they had progressed.  That was Jan 09 and I have been on three failed chemos and now am on Navelbine that appears to be working, but they had grown considerably and have proven to be very stubborn.  From my experience, I say complete the chemo until they are GONE before switching to Herceptin.  I had some neuropothay as well and it cleared up within six months.  I have some occasional tinglling but have full use of my apendages.  Let everyone else change those diapers!!!!  You have a real deal excuse!!!!  LOL Hope everything works out for you.  Sending my best. Stay strong...Darlene",
      "MessageIndex": 4,
      "PostDate": "19/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754315",
      "Title": "Dilemma- neuropathy or lower the taxol dose? makmak makmak"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Feb 11, 2010 06:37PM DARLENEDENISE wrote: Tell them what I say, \"I'll go back to work when there is a cure for Metastatic Breast Cancer and I don't have to undergo constant treatments that make it impossible to hold a job.\"  I give them the same answer no matter how they phrase the question.  The are hoping to catch you off gaurd and that you will get mad and give them the answer they want.  They finally stopped asking. Sorry you have to go through this, but our road at every turn is difficult with this disease.  Stay strong,  Darlene",
      "MessageIndex": 2,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748218",
      "Title": "Some people are just stubborn... **rant** leprechaun Melanie36"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jul 1, 2009 11:16PM DARLENEDENISE wrote: I had innumerable liver lesions and I had pronounced pain that required use of Percocet.  Lesions on the liver will cause pain by expanding the capsule of the liver due to lesion growth AND pain when they are SHRINKING.  When mine were growing it was an on and off pain under the edge of my right rib that was dull to moderate and came and went.  When they were shrinking it hurt MORE.  The pain was much more intense and lasted longer and I had to take Percocet.  I did not believe my doctor when he told me it could be from shrinkage, but my first scan showed dramatic reduction, he was right. How are they sure they are mets, biopsy, PET scan? I hope this is helpful/hopeful info and that mom's lesions are shrinking! ",
      "MessageIndex": 4,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736797",
      "Title": "Liver Mets Question madams30 Denny123"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 7, 2010 10:02PM DARLENEDENISE wrote: I am not enjoying this shit sandwich!!  So sorry for this suck ass news.  I know it's sooooo hard to deal with this type of set back.  I will be hoping for all good things for you with the Tykerb/Herceptin combo.  At least you don't have to travel and sit in the freaking chemo room with this tx.  More time with those delightful little ones!  Shift gears and enjoy your Mother's Day week-end.  I hope it is rewarding and relaxing for you!! Will be thinking of you and checking in on your updates...Darlene",
      "MessageIndex": 26,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752335",
      "Title": "I am out of my trial. Fitztwins 3katz"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "May 30, 2010 09:48AM DARLENEDENISE wrote: Shit!!!  This sucks.  Normally I would encourage an appeal, but, your onc's statement is the reason they are denying this.  They are using the other reasons as reinforcement.  I hope your onc realizes what a negative impact this is making on you and your family!    I wish this had gone your way, I'm sorry! Darlene",
      "MessageIndex": 3,
      "PostDate": "30/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753332",
      "Title": "Mad as Hell ... Accel. Benefits are now declined JeninMichigan Fitztwins"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Aug 2, 2010 08:31PM DARLENEDENISE wrote: Joyce:  I would never leave Herceptin, except for TDM1.  I have been on Xeloda, Tykerb & Herceptin together but was unable to stay on it due to liver progression and side effects.  Since she has already had WBR treatment and they are better, that seems like good news!  She may or may not have been a candidate for SRS.  Since she has been treated already, you can only go forward from here.  To try to keep the brain stable, I would want to add Tykerb to the Herceptin.  If she develops progression in the body, I would want to think about adding in Xeloda.  The side effects of the three can be harsh for some, so, I would see what the addition of Tykerb could do first.  Some oncs will not want to give the Tykerb unless there is some measurable disease to be sure it is working.  It is almost impossible to determine the effect in the brain. It took a long time for the first eight lesions to totally dissolve and not be visible on scans.  Even after 13 months the last 3 treated are still the same size, but since no increase in 13 months they are considered necrotic and may or may not dissolve completely.  It may take a while before you see reduction in size.  WBR delivers grays of radiation in lower amounts over a period of time and it is not uncommon for it to take some time. I hope you are able to arrange the addition of the Tykerb without too much resistance, if you decide to use it. Darlene",
      "MessageIndex": 12,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756137",
      "Title": "brain mets and herceptin Joyce4123 Lowrider54"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Feb 2, 2010 06:56PM DARLENEDENISE wrote: I would encourage a consult with a radiation oncologist who has the ability to treat with SRS and WBRT to be sure you are being given all of the choices for treatment.  WBRT has it's place, but may not always be best treatment choice.   I obtained treatment with Cyberknife at a University/National Cancer Insitute.  Where do you live?  Why are they indicating WBRT should be her treatment? Darlene",
      "MessageIndex": 1,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747730",
      "Title": "WBRT marieibrahim marieibrahim"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 11, 2009 05:16PM DARLENEDENISE wrote: Don't know your history, but, can you enroll in a PARP Inhibitor trial?  I hear good things from ASCO about this for triple negs.  I hope the Avastin works and allows the QOL you want for your travels!!!!!!! Thinking of you...Darlene",
      "MessageIndex": 10,
      "PostDate": "11/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/633329",
      "Title": "AVASTIN QUESTION stage4 DARLENEDENISE"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Oct 4, 2009 04:10PM DARLENEDENISE wrote: Denise:  Do you have mets in other areas of the body right now?  Since you are Her2+, has there been any discussion about Tykerb?  Are you on Herceptin? Glad to see  your feeling better post.  By the way, I am a Her2+ brainmetsister.  Dx with the brain mets 08/08 and I was lucky enough to turn 50 years old yesterday!! Stay strong...Darlene",
      "MessageIndex": 16,
      "PostDate": "04/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740688",
      "Title": "Encouragement for Brain Mets denisela DARLENEDENISE"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Aug 2, 2010 09:36PM DARLENEDENISE wrote: Joyce:  Are you referring to Temador?  Measurable disease is an area in the body or brain that can be visualized on a scan and it's progression or regression can be monitored effectively. Remember, you can always get another opinion after your meeting if you feel unsure.  Let us know what is discussed on the 10th.  Darlene",
      "MessageIndex": 15,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756137",
      "Title": "brain mets and herceptin Joyce4123 Lowrider54"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Oct 7, 2010 05:41PM - edited Oct 7, 2010 05:43PM by DARLENEDENISE I had an accute liver event when first dx and Taxol, Carbo with Herceptin turned things around.  Carbo is processed by the kidneys as oposed to the liver.  FYI, my friend was thought to not be able to process any more chemo and had very poor liver function and has turned the corner using the graduating 5 FU in the infusion pump. They plan on increasing it one more time and then moving her to a different chemo option.   It has been considered short of a miracle.  Not sure why our onc used this treatment.  She is triple neg.  I don't know enough about chemoembolization, but perhaps you can check with your onc.  You obviously need something that will work quickly.  Wishing and hoping for you...Darlene  Courage is when you are scared to death but saddle up anyway. John Wayne Liver and Brain Mets Diagnosis: 12/14/2007, IDC, 2cm, Stage IV, Grade 2, 5/6 nodes, mets, ER-/PR-, HER2+",
      "MessageIndex": 6,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758954",
      "Title": "High bilirubin in liver mets - options? love-my-mom Joannan"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Apr 18, 2008 10:03AM DARLENEDENISE wrote: I was initally dx with Stage IV with mets to the liver and have been on chemo plus herceptin since January.  I have not had breast surgery and it is still not been decided if I should.  I don't seem to find much info on the subject.  Would appreciate any info about what you might know. ",
      "MessageIndex": 12,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703346",
      "Title": "Surgery 30something anitach"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Aug 2, 2010 04:44PM DARLENEDENISE wrote: Hi Joyce and all the other sweet ladies on our forum!  I recall that your daughter just recently completed WBR.  Are these new lesions that are mentioned here?  This is an area of medicine that is not evidence based, therefore, you will find varying individual medical opinions.  You will find that the options presented sometimes reflect the type of radiation equipment the doctor you are consulting with has at his disposal. Treatment of brain mets outside of standard of care WBR requires seeking out equipment, open minded physicians and the right facility.  Typically, you will do better at a university NCI facility that has a tumor board.  It is very important to know that the number of lesions is not the key to being a candidate for SRS.  Tumor volume, where they are located and your level of education play the largest role in determining if SRS could be utilized in your INDIVIDUAL case.  Don't go by my treatment or anyone else's.  All of the factors about your case have to be considered.  DO reach out for all available options and considerations BEFORE accepting WBR or any proposed treatments. Chain and I are happy to know that we offer encouragement to those who are afraid to look at ALL options.  Please call out to us anytime.  Love you Chain!!! Stay Strong....Darlene",
      "MessageIndex": 7,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756137",
      "Title": "brain mets and herceptin Joyce4123 Lowrider54"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Dec 11, 2009 04:02PM - edited Dec 11, 2009 04:03PM by DARLENEDENISE Yvonne:  Sorry for your fears right now.  I see you are getting excellent advice and support here.  I did note you have Inflammatory Breast Cancer which requires very specialized care and treatments.  I go to Dana Farber which is an excellent facility, but it is my understanding that MD Anderson in Houston is the hands down leader when it comes to Inflammatory Metastatic Breast Cancer and has a Inflammatory Breast Cancer Department.  I encourage you to seek a consultation there and then perhaps coordinate care at UPMC or with a local onc that sees other IBC cases that will work colabratively with MD Anderson. Your doctor's unacceptable words lead me to believe that he/she is not highly experienced in the care of IBC with Mets and you should consider other possibilities.  We are all here for you anytime and I look forward to hearing about the special times you will be having with your family and friends during the holidays. Sending only my best...Darlene ",
      "MessageIndex": 14,
      "PostDate": "11/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745212",
      "Title": "The \"get your affairs in order\" talk mossybaby RobinWendy"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jul 13, 2010 07:20AM DARLENEDENISE wrote: Lynn:  Ativan and/or Xanax!!!!!   Wishing you good luck and calmer times....Darlene",
      "MessageIndex": 3,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755277",
      "Title": "The ramblings of a worrywart.... Lynn1 susan_02143"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Oct 5, 2010 03:08PM - edited Aug 20, 2013 03:52AM by DARLENEDENISE You need a very rapid second opinion from a breast oncologist at an NCI facility.  Some times using 5FU in a low dose infusion pump gradually building up the dose can turn the liver around and then reconsider other chemo options.  There may be other reasons that she should not have further treatment, but, I would want one someone else to confirm it or let me know what else could be considered. If you mother wants to continue treatment, get something set up asap. Wishing your mother the best possible outcome. Stay strong...Darlene",
      "MessageIndex": 1,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758954",
      "Title": "High bilirubin in liver mets - options? love-my-mom Joannan"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Feb 5, 2010 05:35PM DARLENEDENISE wrote: KellyM.  When was the last time you had a brain MRI?  Hope it's ENT related, but since you are having headaches and you have lung mets, might be a good idea to check everything out. Good luck! Darlene",
      "MessageIndex": 5,
      "PostDate": "05/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747848",
      "Title": "Feeling a bit in limbo julie26 DARLENEDENISE"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 10, 2010 12:11AM DARLENEDENISE wrote: I totally agree with the Netti Pot.  There is a squeeze bottle made by the same company that is easier to use.  I use it in the shower after things have steamed up.  Immediate results!  I can't say enough for Mucenix D.  My son has severe allergies and migranes, I turned him on to these suggestions and he can't stop thanking me.  Easy to try these and I hope you do and get relief ASAP!! Darlene",
      "MessageIndex": 2,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753890",
      "Title": "Help with headaches dfleaman konakat"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Feb 10, 2010 06:46PM DARLENEDENISE wrote: Janis:  I hope you are able to get a Power Port.  I had a regular port for 2 years and all of the scans with the big needles and contrast plus lots of labs trashed my one good arm.  I was really not happy to have to go through the surgery again.  I did get the Power Port three weeks ago and all went well.  I love the Power Port.  I have had scans and chemo with already. May the \"power force\" be with you on this and the trial.  I'll be thinking of you!!! Darlene in snowy Virginia Beach ",
      "MessageIndex": 5,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748172",
      "Title": "My oncology nurse (bragging) Fitztwins bourscheid"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 21, 2010 07:48PM DARLENEDENISE wrote: Must have been the sun.  Nothing this bad could possibly come from a cocktail, especially one with healthy stuff like the pineapple in it!! Did the Xeloda/Tykerb, gonna have to burn these undies after I didn't make it also!!  Wish I'd had a cocktail to blame it on.  Needed one after that clean up! I now travel with a clean pair of undies, several individually wrapped \"Fresh n Flush\" and a pair of disposable gloves in a zip lock.  And, I'm not even on Xeloda/Tykerb anymore.  One episode of warm, heavy, smelly pants will make you want to be always on the ready!!!!  Does anyone know if Depends work for number 2?  I keep meaning to check them out in Walmart.  I think I now need a cocktail after revisiting such a horrific incident!! Fitz, sorry that shit happened..................Darlene",
      "MessageIndex": 3,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754407",
      "Title": "WARNING: Tykerb and Pineapple juice does not mix!! Fitztwins kimmie68"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Feb 1, 2010 10:09AM DARLENEDENISE wrote: Ead:  If your policy has a premium disability waiver, then premiums are waived after a specified period of time.  If not, your premium should be reduced to correlate to the reduced policy face amount after the accelerated benefits are paid.  Hope this is the info you are looking for. Darlene",
      "MessageIndex": 1,
      "PostDate": "01/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747655",
      "Title": "Accelerated Benefits ead WingsofHope"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Jun 30, 2010 08:46PM DARLENEDENISE wrote: Cha Cha Cha, Cathy!!!   That's better than any Dancing with the Stars Episode!! Just promise to share NED with the rest of us.  We would all love a spin with him!!! Celebrate........Darlene ",
      "MessageIndex": 2,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754804",
      "Title": "Doing my dance with Ned tonight Cathy-CA turtleknits"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Feb 1, 2010 04:26PM DARLENEDENISE wrote: Liz:  Your policy may have the endorsement for you to review.  Keep in mind, it may not be on the policy, but you can have it added at no charge and then make the claim.  I don't understand why you are afraid to ask.  It won't change the terms of the policy contract if you inquire.  You should be able to obtain benefits on both of the policies.   Ask also if you have waiver of premium on the individual policy.  The group policy should have a disability provision that will waive future premiums after a stated period of time.  Your premiums on the individual will be reduced based on the reduced policy amount.  Example:  Policy is $100,0000 and premium is $50 per month.  You take accelerated death benefits of 50% which is $50,0000.  Your policy death benefit will reduce to $50,000, a new policy face sheet will be issued for the balance of $50,0000 and premium of $25 would be charged. I was a Life and Property/Casualty agent for many years.  If you have any questions as you work through this, feel free to ask me. Darlene",
      "MessageIndex": 5,
      "PostDate": "01/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747655",
      "Title": "Accelerated Benefits ead WingsofHope"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 19, 2010 07:31AM DARLENEDENISE wrote: Frankie:  We have PM'd over this issue and I am happy to that you have had the opportunity to treat with Cyberknife.  We are CyberSisters!!! I wish you luck with that devil drug, Decadron.  I refuse to take it, it's awful.  Hope you are done with it soon.  Best to you on your future surveillance brain scans.!! Darlene",
      "MessageIndex": 17,
      "PostDate": "19/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758185",
      "Title": "Metastisis to the Brain JannyM chainsawz"
    },
    {
      "AuthorID": "DARLENEDENI…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65819/profile",
      "Content": "Sep 20, 2010 07:51PM - edited Aug 20, 2013 03:46AM by DARLENEDENISE I have learned toI refuse Decadron.  Speak with your docs about eliminating it where appropriate.  It is my understanding that using it prophylacticly may not even be of benefit.  If you do have swelling/edema which cause symptoms then you can begin the Decadron  and it works quickly, you do not need to build up the dose for effectiveness.  They gave it to me on my first batch of mets, before I knew better and I swore I would never take that shit again and haven't. I had three lesions treated by Cyberknife the second time and did not take any Decadron, before, during or after and I had no symptoms.  My research reflects what was mentioned in the above post from the docs at Stanford. Darlene",
      "MessageIndex": 20,
      "PostDate": "20/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758185",
      "Title": "Metastisis to the Brain JannyM chainsawz"
    }
  ]
}