{
  "AuthorID": "daughterofmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277113/profile",
  "Posts": [{
    "AuthorID": "daughterofmom",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277113/profile",
    "Content": "daughterofmom wrote: Hello: My single mom was diagnosed in 2012 with stage 1, oncotype 11, hormone positive breast cancer, no lymph nodes she had a bilateral mastectomy and no radiation/chemo as they said it was not needed. she has been on tamoxifen since then. For the past 2yrs, she has had low platelets. They have gone down to like 135. but then back to 140 and 145 and then down again to 132, etc. The cancer hospital did not seem too concerned. Her GP last time seemed more concerned as this was the first time she ran blood work and saw the low platelets. And the GP said they would keep an eye on it. Today my mom went to the GP and said she was having back pain and the GP said they would run an xray. The thing is though that my mom has been saying she has back pain since she was diagnosed and all other sorts of problems too. All have previously been looked at by countless doctors and we continue to go back for this test and that test. I am 20 and I am feeling frustrated and scared and overwhelmed. For one, I feel as though my mom is a hypochondriac. She has been saying she has back pain since she was first diagnosed because she knows the connection. she also brings up new things ever year. I do not mean to sound insensitive but I am just very scared each time she does this. I find it hard to eat, sleep and function. 1. Does low platelets have a connection to recurrence? or metastasis? 2. Should I be worried the back pain is related to moving to stage 4? 3. Also, the technician didn't say anything my mom said when they ran the X-ray. Would they have said anything if they had seem something concerning? Please help me. I just feel really hopeless and scared at this point. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "16/07/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/147/topics/865923",
    "Title": "Worried about my mom and metastasis daughterofmom JoE777"
  }]
}