{
  "AuthorID": "Dawnsigkap",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
  "Posts": [
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dawnsigkap wrote: Good Morning !  How long did you wait between your mammo/US and biopsy?  I go in tomorrow for my mammo/US.  My surgeon said if they dont see anything \"spectacular\" we will schedule for January.  If they see something \"spectacular\" it might be before the holidays. Im assuming then if my mammo/us is okay and I am not called back before the holidays then I can breathe a sigh of relief?  I know it is kind of desperate, looking for any sort of clues...but Im just trying to get through the holidays without all this weighing on my mind!!!  Thanks for any info! Dawn Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/779107",
      "Title": "How long did you wait between mammo and biopsy? Dawnsigkap Tenmom"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dec 7, 2011 03:10AM Dawnsigkap wrote: Thank you all for the feedback! I have my appointment this morning. I wish I had a \"feeling\" about the results...haha, I gues that's like asking to be psychic. I also wish my biopsy was before the holidays not after although with my deductible it's probably better after. I'll let you know how it goes! Thank you all!",
      "MessageIndex": 12,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/779107",
      "Title": "How long did you wait between mammo and biopsy? Dawnsigkap Tenmom"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dec 8, 2011 08:53AM Dawnsigkap wrote: Thank you again !  I took your advise and called right now.  The receptionist said the doctor will look at the results and call to follow up with me and make an appointment.  Which is good, seems like regardless of whether the results are positive or negative I will still meet with him face to face.   So, just have to wait for that appointment! Thanks all!!! ",
      "MessageIndex": 21,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/779107",
      "Title": "How long did you wait between mammo and biopsy? Dawnsigkap Tenmom"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dec 6, 2011 10:37AM Dawnsigkap wrote: Char and Book - yikes...it sounds like they identified things right away and pulled you right back in...just the time between those results and then the biopsy was the wait...  And oh Marie! 10 weeks!!!!! Through all those holidays?  Ugh, the thought...  I think the thought of not knowing or having a secure plan, a date is the worst part for me....according to the surgeon he is going to do a biopsy regardless of what the tests say because it is palpable. So at least I know that. At least I dont have to worry about them not finding something on the tests and feeling like nobody is taking me seriously or that I am imagining things. But its also the little details that got me confused...do I need to give him the tests? do they send them to him? will somebody call me with results or will they tell me right there (birads i think I have read?)...all of those things that I feel bad asking...I think I need to get over that \"feel bad\" \"dont want to inconvenience people or make them upset or put them out\" attitude. Thank you all! Im going to do some deep breathing and try to pay attention to other things till tomorrow!",
      "MessageIndex": 4,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/779107",
      "Title": "How long did you wait between mammo and biopsy? Dawnsigkap Tenmom"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dec 7, 2011 10:57AM Dawnsigkap wrote: Well, I had mammo and us. The films were given to radiologist. Tech came back and said \"your free to go, doesn't look like anything, follow up with your doctor.\". Doesn't look like anything??? I feel it! I'm going to take it as good news and see if my doctor contacts me. Initially he said it had to come out, I wonder if he will even do a biopsy now if the mammo and us came back negative. I hope he does do something because it's uncomfortable and hurts, I'd rather it just be out, whatever \"it\" is. Is it a cyst? Fibroadema? I have no idea. I wonder if my doctor will at least call me in to explain... Feel a little but better, relieved I didn't get called back for more pics or anything but still, more unanswered questions and another wait to see if doctor contacts me...blah.",
      "MessageIndex": 17,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/779107",
      "Title": "How long did you wait between mammo and biopsy? Dawnsigkap Tenmom"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dawnsigkap wrote: Hi All, I go to surgeon tomorrow.  Negative mammo and u/s but I feel a little bump, last year it was the size of rice, this year more like a small pea.  Did not have biopsy last year. Now I feel thickening by my armpit at 3 oclock. I was just wondering, did any of you have a breast fungus/rash around your breast before your diagnosis?  For about a year now I have been fighting or dealing with this rash under my breast, of course I have been told its because I have large breasts and living in south texas doesnt help... I know the symptoms of inflammatory bc and I dont think it is it, I mean its been a year now and from what I understand about IBC is things would have progressed by now, it is usually very fast from what I know about it. I have read the post on symptoms before diagnosis. Nobody said anything about that being a symptom for them, there is debate about whether bc is related to a fungus.  Just wondering if anybody else had to deal with that before dx? Thank you all! Dawn Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797687",
      "Title": "Link between breast fungus (candida) and bc? Dawnsigkap flash"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dec 4, 2011 10:19PM Dawnsigkap wrote: I didnt realize they didnt do excisional anymore....now Im a little concerned as well. My doctor said we had to take it out (the lump) not sure why they would take it out and not just do a biopsy then...Ill need to do some research then , thanks phgraham!",
      "MessageIndex": 10,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778967",
      "Title": "Infection, cyst, IBC or ??? LaLa13 bcisnofun"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dec 7, 2011 05:21AM Dawnsigkap wrote: You are in my thoughts LaLa!",
      "MessageIndex": 27,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778967",
      "Title": "Infection, cyst, IBC or ??? LaLa13 bcisnofun"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dec 5, 2011 02:40AM Dawnsigkap wrote: So confusing, Im just gathering this information so that I can make an informed decision if it comes to this. Thank you all for the information, I am going to read and re-read so that I understand correctly.  LaLa, Ill be reading for an update...good luck to you! Your in my thoughts!",
      "MessageIndex": 19,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778967",
      "Title": "Infection, cyst, IBC or ??? LaLa13 bcisnofun"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dawnsigkap wrote: In another post I think I wrote .. I should be in the \"not diagnosed but not worried\" area...Im still not too scared....my breast hurts a little and I have been doing a lot of reading on fat necrosis so Im suspecting that is what is causing my issues.  I have a three year old with a nasty elbow, knee, foot habit...meaning, my boobs get a lot of abuse...a lot.  So Im thinking it is trauma from that...but we will see. I could be in complete denial or just remaining positive, who knows, my mind is kind of playing tricks on me these days (for example, if I was so convinced it was fat necrosis why would I be on here in the first place?)  In the meantime though I am a little concerned about what my surgeon said, he said \"it needs to come out.\"  I have my first mammo and US on Wednesday.  But why or how could he say that if he hasnt even planned for a biopsy?  To me \"it needs to come out\" means surgery, not biopsy.  Should a biopsy come first?  Any help would be appreciated! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779017",
      "Title": "Confused? Dawnsigkap Tenmom"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dec 4, 2011 12:07PM Dawnsigkap wrote: Marie and Bessie, Thank you both so much for the information and suggestions!  I am definitely trying to be positive and think that this is really nothing, the majority are nothing but I research a lot...part of my education and profession and probably not the best trait in this situation.  He is a surgeon, he says he specializes in breast and I was referred to him by my PCP.  My mother in law had breast cancer and surgery but I dont want to freak out my family so once I get the mammo/US done and the reports if I need to, I will check with her as well, I know she went in for a couple of different opinions until she made the decision that she felt was right for her.  So although I trust this surgeon, and has a pretty good bedside manner, I will still go for a second opinion before I do anything. Getting feedback from all of you really helps though, you have been through this already...and I agree Marie, waiting is the hardest part.    Sometimes I just get confused by all the terminology and the worst stories I hear are the ones where people didnt know and then regretted decisions later or let the doctors do what they want then found out they made some mistake or something...Im just trying to head that off at the pass and be an \"informed patient.\" So I really appreciate all your feedback and your help. I cant thank you enough!",
      "MessageIndex": 3,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779017",
      "Title": "Confused? Dawnsigkap Tenmom"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dawnsigkap wrote: Hi Everyone,  I have been lurking here for awhile and decided to finally post, share and follow through so that other woman who need help can get informed or help.  Plus, Im not sure if I actually fall into the \"not diagnosed but worried\" category. Im really not that worried, I dont think it is anything...Im more curious than anything else.  I was going to surgeon for another lump in my side, probably a lipoma but my doctor wanted me to check. Well, I made appointment, had to cancel and rescheduled.  On and off my body has been itchy.  Then a couple of months ago I had one week where my left breast was incredibly itchy...I mean it drove me nuts! But then it went away...all this itchiness made me start doing research and I thought possibly some sort of lymphoma because I had a lump on my neck that they said was a lipoma but who knows, doctors can be wrong ! And, I was kind of embarressed, he didnt do it on purpose but I felt stupid for going to him for a lump of fat on my neck.  The week before Thanksgiving my breast became itchy again...horribly itchy. But, no redness, no swelling, no marks of any kind so I thought nothing of it really. But, one night I thought, maybe I should give myself a breast exam. I dont normally do them but thought I probably should. Well, found a slightly squishy (thats the technical term...haha) thing but I have tons of those...slightly different then the rest though...I thought it was a cyst...no biggee.  Then behind that or slightly higher I felt a hard something...not a lump, it wasnt big like that...it was a like a grain of rice in there. Hard, I couldnt tell if it was moveable or not. No pain. Well, days later (after feeling it 8 million times)...I had my husband feel it, he said he could feel it...but didnt seem too concerned. And then, it started to hurt...actually I think the squishy lump started to hurt..I thought phew, it hurts...but then again, its not surprising because well, seriously...I couldnt stop touching it.  Tried to put it out of my mind but well, as you all know, that can be pretty hard. So the day finally arrived and I went to the surgeon, he could care less about lump on side, could barely even feel it. But he did care about the breast issue but not overly. Didnt give me a definitive anything , didnt say \"oh that is nothing!\" but didnt really show any concern.  He did say \"oh that does need to come out but probably not till January\" Then asked if I had any testing, which I havent because I literally just turned 40 and havent had my first mammo yet.  Didnt say it was urgent or anything though. Said \"make the appointment and we will take it out in January, unless the people who do the tests get excited about something.\"  Huh? Whatever. So, made the appointment for next Wednesday.  I dont know if Im supposed to call him to set up an appointment in January after mammo or they will or what...I hate not knowing what Im supposed to do next.  Anyway, I will keep you updated...I just found everybody's journey so interesting so I thought it might be helpful to start recording this in case somebody else has a similar story. I do have one question....can I request films etc on that day or do I have to go back for those??? How did you request your records/films etc? Thanks all, reading all of your posts have been so helpful to me! Take care, Dawn Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778986",
      "Title": "Found lump...yuck Dawnsigkap Dawnsigkap"
    },
    {
      "AuthorID": "Dawnsigkap",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140216/profile",
      "Content": "Dec 3, 2011 12:33PM Dawnsigkap wrote: Thank you Marie and Mods!  I really appreciate the info...even if it comes out as nothing I think it will be helpful to have all the info for later too in case it is needed.   Thanks again! Dawn",
      "MessageIndex": 3,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778986",
      "Title": "Found lump...yuck Dawnsigkap Dawnsigkap"
    }
  ]
}