{
  "AuthorID": "Dawn41",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231663/profile",
  "Posts": [
    {
      "AuthorID": "Dawn41",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231663/profile",
      "Content": "May 8, 2016 06:03AM Dawn41 wrote: 41 years old",
      "MessageIndex": 600,
      "PostDate": "08/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Dawn41",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231663/profile",
      "Content": "May 7, 2016 11:29PM Dawn41 wrote: Hello ladies I too am early 40's (41). I was diagnosed March 15th and it still don't feel real. I had chosen to go with a lumpectomy trying to save my breast after genetics came back normal, that was 2 1/2 weeks ago. The morning of the surgery my surgeon told me she was also going to remove another area of concern that had earlier been ruled out to be anything, and I was fine with that let's get this out of the way and move on. Well when pathology came back she let me know that not only site b came back to be invasive lobular carcinoma but when clearing the margins for that area she came across another area and she removed some of that to have tested which in turn also turned out to be cancer as well with the negative did come a positive no lymph nodes came back positive. Still in shock over everything. I thought I was well on my way to moving forward to have to find out that it would be best for me to go ahead with the masectomy. In all honesty that choice was easy I cannot keep going through this and putting the family through it. The unknowns are too scary.",
      "MessageIndex": 2,
      "PostDate": "07/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844094",
      "Title": "When does it become \"real?\" Addlantan Shirlann45"
    },
    {
      "AuthorID": "Dawn41",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231663/profile",
      "Content": "May 17, 2016 09:17PM Dawn41 wrote: Wishing you a speedy recovery and will be thinking of you Friday.",
      "MessageIndex": 15,
      "PostDate": "17/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844094",
      "Title": "When does it become \"real?\" Addlantan Shirlann45"
    }
  ]
}