{
  "AuthorID": "dcdrogers",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
  "Posts": [
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Dec 31, 2016 01:23PM - edited Jan 2, 2017 01:48PM by dcdrogers @ILSunrise I started my period 4 days early on 12-24. It appeared to be a normal cycle, but then 4 days into it it seemed as if my period restarted itself on what should have been my normal start day. Here I am now going on my 8th day (my cycle normally lasts 6 days) and it doesn't seem like it is letting up any. My MO warned me that I might go into menopause (I'm 46 yrs old) and that after Chemo some women resume having a menstrual cycle while others don't. I told her with my luck and my menstrual cycle I'd be surprised at all if it even stops....let alone stop any never comes back. ~Dee",
      "MessageIndex": 330,
      "PostDate": "31/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jan 4, 2017 05:35AM dcdrogers wrote: @bareclaws Thankfully I haven't had to deal with mouth sores. I've been trying to be proactive with that as I've been prone to canker sores and mouth ulcers in the past. I've been gargling with baking soda and salt rinses twice per day. Once in the morning and again at night after my last meal. I've also been brushing after each meal with Biotene toothpaste followed by gargling with the Biotene mouth moisturizer (mouth wash) and so far it seems to be helping. FWIW I'm also on a Proton Pump Inhibitor meds for stomach issues which can deplete certain vitamins and minerals (magnesium, calcium, b12, etc...) over time. My magnesium and vitamin d tends to run on the low side so I take magnesium, calcium, vitamin d and vitamin b6 each day. These are the only vitamins and minerals that I'm taking and my MO is aware of this. I myself have found that when my magnesium levels are low I tend to suffer more with mouth sores. I'm familiar with the pain that comes along with mouth sores. Hope you feel better soon. ~Dee",
      "MessageIndex": 357,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Feb 17, 2017 03:35PM dcdrogers wrote: @ILSunrise, thanks for the good luck wishes. Round 4 yesterday and it seems like the SE are coming along a little faster this round. Dry mouth and nose last night which usually doesn't occur until around day 2 or 3 after treatment. My hemoglobin was also down a little to 8.5. Not enough to stop treatment and no blood transfusion this time. It's been coming in on the low side each time they do bloodwork before treamtent. This would explain the increase in fatigue and overall feelings of illness with each treatment. I'm not looking forward to having a transfusion, but it will help me feel better and get to my 6th round I'm all for it. I'll be meeting with my MO next Tuesday for my usual follow-up after infusion and I know that she's already scheduled me for extra fluids. I'm a little nervous she'll probably order up blood on the same day. I can only imagine how I'll feel by next weeks meeting since the SE are definitely kicking in sooner this 4th round....as it did the 3rd round. Hope you ladies (and gents if you're reading this) are all doing well. ~Dee",
      "MessageIndex": 667,
      "PostDate": "17/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Feb 24, 2017 08:54AM dcdrogers wrote: @Summer2016 I too am noticing that with each lab draw my glucose is climbing. My normal range is low to mid 80's, but with my last blood draw for infusion #4 it is was 129....(it was 103 with infusion #3). My MO doesn't seem to concerned with it, but I wonder if it will continue to increase for infusions #5 and #6. I sure hope it returns to normal as sugar/glucose is not something I've ever had problems with. With regards to the whole sugar feeding cancer thing. I've never been big on sugar, but I take in more than my fair share and I'm sure I could find ways to cut down. My problems are carbs which pretty much are nothing but sugar once your body digests them. I have a HUGE carb addiction, bread, rice, pasta, potatoes, etc.....and I'm not a vegetarian. Hmmm...definitely something to think about. \"Luckily\" chemo has made the taste and texture of bread all but disgusting to me so I've had almost no bread since starting. Still need to eat less of the other carbs. ",
      "MessageIndex": 695,
      "PostDate": "24/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Feb 15, 2017 12:05PM - edited Feb 16, 2017 10:17AM by dcdrogers Whelp.....tomorrow is my 4th infusion. My Dr. has ordered additonal fluids to be administered 4 days after infusion as round 3 was horrible. Sour stomach, extreme bloating, fatigue, light-headedness, dizzyness, disgusting taste issues (ice didn't work for me) and just an overall crappy feeling. Unfortunately, 3 days ago I begin having very slight numbness in my finger tips :(. I'm hoping that the additional fluids will help round 4 not be as bad as round 3. Not sure what will be done about the slight neuropathy, but I'll be discussing this with my Dr when I follow-up with her next week. After my 3rd infusion my brows are barely holding on. There's just enough left for me to use as a guide to pencil in the rest with a brow pencil. I'm hoping I hang on to my lashes, but I won't be holding my breath :) Anywho........I'm still holding on. Not looking forward to tomorrow and any potential side-effects in the days to come, but definitely glad I'll be over the mid-way hump. Thanks for letting me share. Dacia Rogers",
      "MessageIndex": 658,
      "PostDate": "15/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Mar 27, 2017 03:18PM dcdrogers wrote: @scaredash - that's a great question. I'll be getting my 6 and last treatment this Thursday and will have a follow-up with my MO next Wednesday. I'll be sure to ask how she plans to monitor me going forward. I'm opting for a double-mastectomy so I know that mammograms are out.",
      "MessageIndex": 795,
      "PostDate": "27/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Apr 13, 2017 04:37PM dcdrogers wrote: I also noticed tightness and swelling in my calves and overall retention of water right before my last treatment. I literally gained 8lbs in 2 days. Turns our my potassium levels were low. Dr called in a prescription for potassium and my levels were back to normal within a week. Luckily I only had to take the potassium for one week and the issue seems to have resolved itself. Next week is my first Herceptin only infusion and I'm actually looking forward to it since I won't be getting that horrible taxotere and carboplatin. I'll also be having an Echo next week to make sure my heart is still functioning ok. Dr. says I'll be getting an Echo every 3 months while I'm on Herceptin. P.S. my eyes are watery all the time. It started after infusion #4. I sure hope it clear up in a few weeks as it is very annoying and interferes with reading etc...",
      "MessageIndex": 852,
      "PostDate": "13/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Nov 27, 2016 09:11PM - edited Nov 29, 2016 10:32PM by dcdrogers Hello all, I was just diagnosed on November 15th and will be meeting with the MO on Tuesday, November 29th. My BS has already mentioned that I will more than likely be doing neoadjuvant (sp) chemo due to the size and aggressive grade of my tumor. I suspect that after meeting with the MO I'll be beginning my chemo in early to mid-December. I've alway had great veins, but I'll be asking about getting a port. I am NOT looking forward to chemo, but I'm so ready for them to throw the kitchen sink at this thing in hopes of getting a complete response. Thanks for letting me share. ~Dee",
      "MessageIndex": 41,
      "PostDate": "27/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Dec 2, 2016 12:43PM - edited Dec 2, 2016 12:44PM by dcdrogers I'm schedule to have an Echo on December 7th followed by port placement on December 9th. No MUGA scan has been discussed. My assumption is that they'll do a MUGA scan after the Herceptin treatment to see how/if Herceptin is effecting the heart. My first chemo and Herceptin (TCHP) treatment is scheduled to start on December 15th.",
      "MessageIndex": 67,
      "PostDate": "02/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jan 24, 2018 11:06AM dcdrogers wrote: Hello there fellow chemo buddies :) I'm just checking in. Finished TCHP March 30th and my last Herceptin was November 2017. I had a one month break and started Neratinib/Nerlynx on December 10th. So far so good. I'm chugging along, but I feel very much back to my old self and finally was able to start my workouts (easing into it) again this week. Hope you all are doing well and keeping strong. ~Dee",
      "MessageIndex": 931,
      "PostDate": "24/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jan 3, 2017 01:34PM dcdrogers wrote: Unfortunately I don't have any tips for stopping the pain, but I do hope it lessons and goes away soon. Did you mention this to the nurse during your treatment? It sounds like what you're experiencing may be signs of neuropathy. My MO told me to let her know as soon as possible if I experience neuropathy. Any sort of tingling, numbness or burning sensation should be reported as I think they will adjust the dosage next time you have your treatment. Hope you feel better ~Dee",
      "MessageIndex": 348,
      "PostDate": "03/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jan 4, 2017 12:32PM dcdrogers wrote: @Scared My MO only recommended Vitamin B6 to possibly help with any neuropathy I may or may not experience as I go through chemo. When I mentioned to her that I'd like to try it she was on board and said that taking B6 wouldn't hurt so I could give it a try. I was already taking Vitamin D, Magnesium and Calcium before I was diagnosed with BC. My Vitamin D levels are always low. I'd get them within range and as soon as I stop taking the supplement my levels would take a nose dive. My PCP has me taking 5000 units every other day. I started taking Magnesium only after taking Dexilant for a stomach ulcer. The Dexilant (it's a PPI) causes low levels of Magnesium and B12. I had both checked and while my B12 levels were good my Magnesium levels were very low. I am taking Prednisone (I'm tapering off) for muscle inflammation. Since Prednisone is known to cause osteopenia and osteoporosis along with MANY other horrible side-effects I started on Calcium. My rheumatologist initially wanted me to take Fosomax, but researching I decided against it as the manufacturer clearly states in the literature that if you've had an Ulcer in the past year you should not be taking Fosomax. Not to mentioned the Prednisone alone was destroying my digestive system (reactivated ulcer). No way was I taking Fosomax on top of it. After doing more research, I brought it to my rheummy's attention that the Vitamin D I was already taking coupled with adding Calcium should be enough to support my bones since my initial bone scan was normal. She agreed that I could give it a try. I made sure to mention to my MO all of the vitamins/supplements that I was on in case she wanted me to stop taking anything, but she's ok'd everything on my list. ~Dee",
      "MessageIndex": 368,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Feb 25, 2017 12:04PM dcdrogers wrote: @pamela23 - thanks for the suggestion. I'm going to pick up a few things from the grocery store to give them a try. My tastes buds are shot, but I don't think that'll matter much. @bigcgoaway - I experience the same issues 1 week after chemo/neulasta. I've always attributed the dizzy and lightheadedness to chemo, but I guess it could be coming from the Neulasta shot. I've been getting the kit (self injector) since my first infusion of chemo. I too experience rapid heartbeat starting 6 or 7 days out from the shot. I'm usually clocking in around 116/119 bpm, but it has gotten as high as 131/133 bpm. My MO doesn't seem too concern as it does come back in the normal range sometime between days 10 and 12. I stopped taking Clariton after infusion #2 (I'm on #4 now) and experienced the same side effects on AND off Clariton. BTW....I found out that Clariton is what was giving me the extreme extended/bloated belly after each round of chemo. Also, I've found that for me the bone pain is lessened after each Neulasta shot. Hope this helps. ~Dee",
      "MessageIndex": 702,
      "PostDate": "25/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Dec 15, 2016 04:42PM dcdrogers wrote: My first treatment of THCP which was given in the order of PHCT. I was at the center from 9am to 4pm. They really like to take things slow and monitor reactions the first day of treatment.. Luckily only reaction I had was a minor headache, but the nurse allowed me some Tylenol that did the job in half hour. I was surprised because Tylenol usually doesn't work for me. Next treatment will be after the new year and should take closer to 4 to 5 hours. It is a nice center but not nice enough to spend the entire day for treatment.:) 1 down 5 more to go. I'm just hoping that the winter weather coming doesn't delay any of my future treatments. ",
      "MessageIndex": 198,
      "PostDate": "15/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jan 2, 2017 05:09PM dcdrogers wrote: Ok. So here I am 3 days from getting my 2nd infusion and my taste buds are just starting to reactivate. I would say I have about 30% to 40% of my sense of taste which is great considering everything tasted like cardboard for the past 2 weeks. I'm looking forward to treatment as it will mean 1 more under my belt, but I am not looking forward to the digestive issues (extreme stomach bloat) and no taste buds. ~Dee",
      "MessageIndex": 337,
      "PostDate": "02/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jan 3, 2017 04:17PM - edited Jan 3, 2017 04:56PM by dcdrogers Interesting you mentioned having sore teeth. I noticed that after my 1st treatment that the teeth along my lower jaw line ached a little off and on for about a week and a half. I forgot to mention that to my MO. I wonder if that has something to do with the chemo treatment or the Neulasta shot. Very Interesting.",
      "MessageIndex": 350,
      "PostDate": "03/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jan 3, 2017 06:03PM dcdrogers wrote: I'm taking Vitamin D, Calcium, Magnesium, and Vitamin B6.",
      "MessageIndex": 352,
      "PostDate": "03/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jan 4, 2017 05:24AM dcdrogers wrote: @Leslie, I had pain from the Neulasta shot. I started Claritin the day before my 1st treatment and took it for 5 days. I didn't have any problems or pain. 2 days after I stopped the Claritin (I thought 5 days would have been enough) I woke up in the wee hours of the morning with excruciating lower back pain that radiated up my back and into my chest. My heart was also racing. I also took Tylenol which did absolutely nothing. I didn't make the connection to Neulasta at the time, but luckily I had an appointment the next morning with my MO for follow-up after my 1st treatment. I casually mentioned that I was experiencing terrible lower back pains and she made the connection to the Neulasta. She wrote me a prescription for a very low dose of Oxycodone which I had no plans on taking. Boy was I glad for that prescription. There is no way I would have been able to function and I already couldn't sleep, sit or rest without major pain. Luckily the pain subsided in 2.5 days so I didn't have to take much of the pain meds. I wonder if I stopped to soon taking the Claritin? Not sure, but my 2nd infusion is tomorrow and this time I'll try taking the Claritin for 7 days.",
      "MessageIndex": 356,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jan 4, 2017 12:49PM dcdrogers wrote: @Pamela I had been placed on Iron supplements earlier this year because my Ferritin (iron stores) are low and I've always been slightly anemic. I had to stop taking the iron supplement in May of this year after learning I had developed another stomach ulcer. Iron can be a little rough on the stomach and there was no way I could continue taking it until my ulcer cleared up. I should have started back on the iron supplement in July when my ulcer cleared up, but in July I started developing muscle weakness which led to me being put on Prednisone. Since, I'm experiencing digestive issues on Prednisone and Chemo, I decided to hold off on trying to add iron back into my supplements list. Instead I've been trying to incorporate more red meat (not that easy) and leafy greens into my diet. Once I've finished chemo I'll have my PCP check my iron again and I'll probably have to go back on iron supplements. Dee",
      "MessageIndex": 369,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jan 7, 2017 02:06PM dcdrogers wrote: @Gingkoleaf1 Bloated is an understatement. It feels like there is a balloon in my stomach and that it keeps trying to expand even though there's no room left to do so. It is very uncomfortable. My poor belly is hard and filled with air. I just got some gas ex (already tried many other things), but it doesn't seem to be doing anything. Dee",
      "MessageIndex": 394,
      "PostDate": "07/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Apr 2, 2017 08:17AM - edited Apr 2, 2017 08:34AM by dcdrogers @Hopfull2 - I began experiencing sensitivity to my front teeth a few weeks ago. I ONLY drink room temperature spring water and my teeth have become very sensitive. Crazy enough it's just the front two front teeth so far. I'll be bringing it up at my next visit with my MO. Not sure anything can be done about it as I finished my last chemo on 3-30.",
      "MessageIndex": 826,
      "PostDate": "02/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/850251",
      "Title": "Starting Chemo in December 2016 scaredashell07 Hanging_in_there"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "May 12, 2017 02:07PM dcdrogers wrote: Hi All, Happy thoughts and feelings to everyone who has had their May surgeries to date and well wishes to those that will be having surgery later this month. Please, remember to take the prescribed meds as indicated and to take it easy and listen to your body. Yesterday I went in for my Herceptin only treatment. Took a total of 1.5 hours. 1 hours total transportation to and from the facility and 30 minutes for the actual treatment. I took Lyft as I'm still on driving restrictions (although I feel like I could actually drive I'll continue to follow Doctor's orders). Anywho....after only approximately 2 hours out of the house I was so tired and exhausted when I made it back in. I pretty much spent the rest of the day \"napping\" on and off all day after having such a long day out:). Luckily, I have next to no pain now and was able to get some real quality sleep in. Today I had a follow-up with the BS. She came in with a huge smile on her face and said \"I have great news. I just went over your pathology report and you had pCR\". Chemo had done it's job. Couldn't find traces of cancer anywhere. They had trouble finding the clip that was placed in the positive lymph node and the previous day could only get the seed close to where they thought it was. Thank goodness my BS was diligent during surgery and got both the seed AND the clip(s) out ensuring she got the lymph node that had originally tested positive for cancer. She ended up taking a total of 10 lymph nodes. Here's something to think about. When I first diagnosed as positive I told my BS that I wanted a BMX even though the option of having a lumpectomy was on the table. She had no problems with whatever decision I chose to make. I had small boobs barely A/not quite B and saw no reason to remove a good chunk of such a tiny boob :). Anywho, when I had my first breast MRI the right breast had some suspicious areas they wanted to biopsy. When they tried to biopsy the right breast via ultrasound the imaging doctor said \"you have a very busy right breast so we'll have to do a MRI guided biopsy\". Those biopsy results came back as benign and fibrocystic breast changes, BUT I received the dreaded letter in the mail saying to come back in 6 months to see if there were any changes. Since I had already made up my mind to have a BMX I knew wouldn't be back in 6 months for another biopsy. Why do I bring all of this up you wonder? Well....after neo-adjuvant chemo (TCHP). My BS ordered a post-chemo MRI to see if the tumor had moved away from the chest wall. The post-chemo MRI no longer showed a mass in the left breast and the 2 enlarged lymph nodes (only 1 was biopsied) were now both regular sized. But get this....the MRI did not mention the 2 suspicious masses in the right breast that were biopsied from the December MRI. I found that suspicious and was planning to ask my BS about it, but I didn't see her again until the day of surgery after the anesthesiologist had given me volume. Anywho, during today's visit she informed me that they had found atypical cells in the right breast tissue. So what was biopsied and OK just 5 months ago was already showing potential signs of turning into something else. I'm so glad I never gave the decision to have a BMX a second thought. Hang in their ladies (and gents if you're reading this). ~Dee",
      "MessageIndex": 127,
      "PostDate": "12/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "May 15, 2017 10:05AM - edited May 15, 2017 10:07AM by dcdrogers @NotVeryBrave - not sure why the MO is dragging their feet. I asked my MO before surgery if I would be getting a break from Herceptin after surgery and she said no. I have continued on my every 21 day schedule. Had my first Herceptin only treatment on 4/20, BMX surgery on 5/4, and my second Herceptin only on 5/11. Didn't miss a beat. I have a port placed in, but during my Herceptin treatment last week I asked my nurse to give my treatment through my vein instead of using the port because 1) I was still tender in that area and 2) I didn't want any needles coming so close to my new implant so soon. I may ask them to use my vein for my next treatment if the implants hasn't settled in a little more by then. p.s. I had 3 drains in during my treatment. Just pinned them on the inside of my sweatshirt and everything went fine. ~Dee",
      "MessageIndex": 145,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "May 18, 2017 01:37AM dcdrogers wrote: @OhHeyItsDee - I had my BMX surgery on 5/4 and still have 2 of the 3 drains in. Scheduled to meet with the PS tomorrow with hopes of removing one more, but with the past two days of outputs on the remaining 2 drains I don't see that happening :(. I believe I read in several places that moving around increase the fluid output. This just plain sucks because each day as I get stronger I tend move around more and thus create more output. I have 10 nodes removed from under my left arm and also have numbness in the back of the arm. It seems to get just a tad better every few days and I'm hoping the numbness will eventually go away. Armpit is also completely numb. ~Dee",
      "MessageIndex": 181,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jun 13, 2017 02:20AM dcdrogers wrote: @Lordhelpme, I'm so glad they found it. That is so scary. I also elected to have a BMX even though I was offered a lumpectomy. Turned out to be a good decision on my part as well as they found atypical cells in my \"good\" breast. ~Dee",
      "MessageIndex": 311,
      "PostDate": "13/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Aug 23, 2017 12:22PM dcdrogers wrote: I started taking Evening Primrose Oil to see if it will help with the hot flashes and night sweats. I've been taking it about 1.5 weeks and so far no change. I did notify my MO that I have added that to my vitamin regime to see if it would help. She was ok with it. Now....if only it will start working so I can get a full and decents nights sleep. ~Dee",
      "MessageIndex": 12,
      "PostDate": "23/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858109",
      "Title": "Living with Long Term Side Effects of Chemo eevah Mybctc"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jun 15, 2017 12:35PM dcdrogers wrote: @Lordhelpme - I was pretty sure I would need radiation going in. When I had my initial scan the mass on my left breast lit up in addition to 2 lymph nodes. My BS did a biopsy the mass and 1 of the lymph nodes. The biopsies came back positive for cancer. After getting my biopsy results both my BS and my MO said that it was high likely I'd need radiation treatment. Although I recieved a complete response to chemo and there was no evidence of the disease in my pathology report, the radiologist I met with still recommended radiation since the cancer had at one point reach my lymph nodes. BTW my BS removed 10 lymph nodes and all were negative for cancer, but again...this was after neoadjuvant chemo. ~Dee",
      "MessageIndex": 334,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Apr 19, 2017 09:22AM dcdrogers wrote: Count me in. I originally thought I'd be part of the April group, but I just got my call yesterday and I'm scheduled for May 4th. Had my last chemo (TCHP) on March 30. I opted to have a BMX instead of a UMX or lumpectomy. I was diagnosed with IDC and had 2 enlarged lymph nodes. They biopsied the mass and one of the nodes. Both came back positive. Had my post MRI last week which showed that the mass has disappeared and the lymph nodes are both normal sized. During my last consult with my BS she mentioned that she would do the surgery 4 weeks after chemo, but it looks like they could only get me in during the 5 week. I know it's just one additional week, but I have a fast growing aggressive type of cancer so I feel like every hour counts. I originally didn't think to do recon because it seemed like too much work. I was leaning either way honestly. I told myself that I'd give recon a try and met with a PS to go over my possible options. She said that it looks like I'm a candidate for immediate \"one-step\" recon with skin sparing and possible nipple sparing. She'll go in with the intent to place the implants immediately (I'd like to bypass TE if at all necessary) and if it turns out she needs to place the TE instead we'll go that route. I told my PS that I wanted to go any route that would limit the number of surgeries I will need. My rationale was that if starts looking like I'm going to have multiple corrective surgeries or several complications, I'll just have the implants/TE removed and go flat. Congrats to all who are on their last chemo or coming up on their last chemo.",
      "MessageIndex": 14,
      "PostDate": "19/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "May 6, 2017 07:32AM - edited May 8, 2017 06:50AM by dcdrogers Hello All. I had my BMX May 4th and am now home recovering. The BS left it up to me as to wether or not I felt up to coming home after 1 night stay in the hospital or if I felt like I needed to stay an extra night. I chose to come home after only 1 night stay. I felt fine after surgery and while I did have a pleasant night at the hospital (pain was managed well), I felt I could watch television, read and take my pain meds at home just fine. I chose to give reconstruction a go and I must say that so far I am very pleased with my results. I was able to do skin sparing and nipple sparing and my implants were placed over the muscle. I was originally a little bigger than an A cup but barely a B cup. I told the PS that I would not object to being a little bigger, but my ultimate plan/goal was to minimize the number of surgeries as possible. Pain is very manageable. I have a ParaVertebral Block (PVB) so I am carrying around 2 bags of the pain medicine which is a pain in the rear, but I'll only have them for 4 days so it's very doable. I also have a few other pain and anti-inflammatory meds to take and so far so good. Now I just need to watch for any signs of infection. Thanks so much to everyone for the well wishes regarding my surgery. ~Dee",
      "MessageIndex": 73,
      "PostDate": "06/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "May 6, 2017 10:01AM dcdrogers wrote: @Kacop - I agree that the post surgery bras AND the camisoles are way too expensive. I went to Wal-Mart a week before surgery and picked up some Danskin zip-front sports bras for $12 a piece. I figured I'd need Mediums, but I did pick-up a few in the Large size in case I had swelling after surgery. I also found a snap-front gown on Wal-Mart's website for around the same price. With the gown I cut a slit on the inside of the pocket and am able to insert and carry my drains on the inside of my gown. ~Dee",
      "MessageIndex": 79,
      "PostDate": "06/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Dec 6, 2016 02:20PM dcdrogers wrote: Can you possibly push to have an MRI done since you have dense breast? I ask because I was recently diagnosed with breast cancer in my left breast. 2 masses showed up on a CT Scan and I was sent to have a mammogram and ultrasound which also showed these masses. After having a biopsy, I was sent to have an MRI which showed not only the left breast masses, but also 2 masses and several cysts in the right breast. Neither my previous CT Scan nor my mammogram from just a few weeks earlier detected anything going on in my right breast (I also have very dense breast). Just yesterday my doctor sent me to have an ultrasound and guided biopsy of my right breast, however, the technician informed me that \"I have a very busy right breast and that they couldn't do an ultrasound guided biopsy because they didn't want to biopsy something other than what showed up on the MRI. Now I'm scheduled for an MRI guided biopsy of my right breast. I am not trying to scare you, but wanted to let you know that dense breast really can hide things (hopefully nothing bad). I have very small breast small A/barely B yet the density of my breast tissue managed to cover up and hide some suspicious activity. If at all possible, push for the MRI. ~Dee",
      "MessageIndex": 2,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/850992",
      "Title": "Cystic Dense Breasts Possible BRCA1 Positive Rebekah77 Rebekah77"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "May 15, 2017 10:01AM dcdrogers wrote: @TpRalph - My snb and BMX incisions were done same as Herculesmulligan.",
      "MessageIndex": 144,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "May 2, 2017 10:14PM dcdrogers wrote: Thanks for the well wishes. Is it crazy that I'm looking forward to getting this surgery over and done with? I just want to get on to the next phase and put this BC behind me as much as I can. I don't think I'll ever be able to put it behind me completely, but I so look forward to being Cancer free.  ~Dee",
      "MessageIndex": 61,
      "PostDate": "02/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Apr 27, 2017 10:52AM - edited Apr 28, 2017 06:03AM by dcdrogers Hello ladies and gents, Had my pre-op with my PS yesterday for bloodwork, EKG, post-op instructions and to answer any lingering questions. I have another pre-op schedule on May 3rd, the day before surgery, to have the radioactive seeds placed. I can't believe I am actually looking forward to surgery next week. I hope I don't have to spend more than 1 day in the hospital. My BS said at least 1 day MAYBE 2. The PS says it will more likely be 2 days. Guess I'll know for certain a week from now. p.s. I'm currently on 10mg of prednisone for muscle inflammation and my PS is concerned about wound healing so she prescribed 10,000 units of Vitamin A to help with counteracting the prednisone.",
      "MessageIndex": 34,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Apr 28, 2017 10:44AM dcdrogers wrote: @Dizzygirl, I was hoping to get into consult with the radiologist before my upcoming surgery on May 4th, but that isn't going to happen. I'm being treated at a breast cancer center so my doctors are all under one umbrella and work together. The RO that I wanted to consult with had no openings until after my surgery so I think I'll wait at least 2 weeks after surgery so that I'll have some time to heal first. I'm about 99% sure I'll be needing radiation (2 enlarged nodes with 1 testing positive node). I'm going for direct-to-implant. I consulted with my PS and she thinks radiation will not impact my skin much, if at all. I'm black (not sure that factors into anything or not :) and I do plan to begin moisturizing and massaging the implant and surrounding skin as soon as I get the go ahead. PS seems pretty confident that I'll not have skin issues, but she informed me that if radiated side becomes an issue I'll still have the option of a DIEP. I only have enough stomach fat for 1 breast. If the implants prove too much of a problem (multiple surgeries, infections, etc...) I'll probably go flat. I'm \"only\" 46, but I already know I don't want to be in and out of surgery for the next couple of years. I plan to LIVE after BC. ~Dee",
      "MessageIndex": 40,
      "PostDate": "28/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "May 14, 2017 08:18AM - edited May 14, 2017 07:18PM by dcdrogers @MamaOz - Yes. I had Silicon Implants placed at the time of the BMX. I had already discussed with my PS my concerns about the implant holding up during radiation and she said she doesn't think I'll have a problem. I don't know what she based that on, but from what I researched she is very experienced and I trust her enough to give it a go. She stated that in the event that there are issues that occur from radiation she could always go the DIEP route to build up the radiated breast if it comes to it. When I had my first consultation with the PS I really had no solid plan but was prepared to just go flat. I explained to her that I would like to give reconstruction a try, but only if I would minimize (as much as possible) the number of surgeries I would need. I also wanted to avoid tissue expanders if possible. That's when she mentioned that I was a candidate for direct-to-implant skin and nipple sparing reconstruction. She did warn that I might need a little fat grafting down the road if rippling occurred and I was ok with that. She also mentioned all of the other complications that could happen with implants. My mass was budding up against my chest wall and I had at least 1 lymph involved. According to my research it looks like I will at the very least need radiation to the chest wall and lymph area. I'm also guessing I'll receive radiation to the clavicle area. I'm not sure if radiation will be necessary to the whole breast since I have had a mastectomy. My patient navigator will be scheduling my first appointment with the radiologist soon and I'll have a ton more questions when I have my first consultation. I plan to start moisturizing the breast and surrounding areas that may require radiation as soon as I get the go ahead that it's okay to begin. I also plan on continuing to moisturize these areas 6 to 8 weeks after radiation ends. I sure hope everything holds up as I am pretty pleased with the way things have gone so far. I really don't want to have any more surgeries other than possible fat grafting down the line to soften up the outer edge appearance of the implants. I am prepared to go flat if necessary, but I wanted to give reconstruction a go. ~Dee",
      "MessageIndex": 134,
      "PostDate": "14/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "May 1, 2017 05:18PM dcdrogers wrote: @Flowmom - hope surgery went well and that you are recovering nicely. Please let us know how things went once you get rested. @Kim345 - It looks like I may be next. BMX scheduled for May 4th. ~Dee",
      "MessageIndex": 54,
      "PostDate": "01/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "May 12, 2017 02:56PM - edited May 13, 2017 07:07PM by dcdrogers @NotVeryBrav - I do remember your similar post, but I couldn't remember your username. I'm so glad you ran across my post as we had similar issues with our \"good\" boob. I also saw your post regarding pain. Maybe the Doc can prescribed something else for you? My pain level never went above a 5 and that was even during my overnight stay in the hospital. I'm thinking the PVB nerve block they gave me really took the brunt of the pain off. I did have a very stiff/sore left elbow and arm for about 48 hours after surgery, but I attributed that to whatever awkward position they had my arms in during surgery. I see you're also from Maryland. I too live in Maryland near DC. My bio lists Washington, DC just for a little privacy, but if you're from around these parts you know we refer to all of it as DMV :) I had all of my services and care at the GWU Breast Center in Washington, DC. I've had great experiences with all of my doctor's and even my short overnight hospital stay at GWU. Hopefully my great experience will continue once I meet with the radiologist. Waiting on an appointment to be scheduled now. I'll also be meeting with a physical therapist in a few weeks (BS wants me to heel a bit more first) who will talk to me about the potential of lymphodema. ~Dee",
      "MessageIndex": 129,
      "PostDate": "12/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "May 17, 2017 05:39PM dcdrogers wrote: Sending blessings and well wishes for those who are facing surgery this week. You got this! ~Dee",
      "MessageIndex": 171,
      "PostDate": "17/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jun 14, 2017 02:49PM dcdrogers wrote: @NotVeryBrave - I'm so sorry you've having more issues after surgery. I hope all goes well and that the antibiotics you're given wipes out any infection you may have. xoxo ~Dee",
      "MessageIndex": 323,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jul 27, 2017 06:47PM dcdrogers wrote: @Twills I applied Miaderm followed by Aquaphor once in the morning and then again after my nightly shower. I noticed that the areas I applied it to would still be very tacky in the morning. Since I was told not to put on any lotions or creams before treatment (I had mine at 9am Mon-Fri), I would take a warm damn cloth and gently lay it over the areas in the morning prior to treatment. I found that this absorbed almost all of the product. A few times I even added some Dove sensitive soap to gently cleanse the area, but I found that the warm cloth worked just as well to remove the residual product before treatment. ~Dee",
      "MessageIndex": 83,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Aug 3, 2017 03:25PM dcdrogers wrote: I didn't have to wait that long for rads after surgery. I had surgery on May 4th and started radiation on June 14th. I did have an issue with authorization for one of my MRI's in December 2016. I ended up calling my insurance carrier to get to the bottom of it. Turns out and incorrect DOB was put on the pre-authorization request and it was just sitting in limbo at the insurance carrier just waiting on someone there to take action. Luckily after the phone call to clear things up I was approved/authorized within 24 hours. Not sure where you a located or who your insurance carrier is, but you may want to give them a call if possible. I was able to ask them to expedite my request since I had already been waiting a few weeks. ~Dee",
      "MessageIndex": 1,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/857631",
      "Title": "Time From Surgery to Radiation hippiegirl hippiegirl"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Apr 27, 2017 08:16AM dcdrogers wrote: @Lexico3 - yes....both enlarged nodes were on the same side as the lump/mass. Thanks for the suggestion. I have never heard of the technique, but it's going into my notebook with my other list of questions to ask the RO. I had already made a note to ask about risks to heart and lungs during rads, but will definitely ask specifically about the breath hold technique since this is the first I'm reading about it. Again, thanks for the tip. ~Dee",
      "MessageIndex": 6,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854488",
      "Title": "At what point in the process did you meet with a RO? dcdrogers dcdrogers"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Apr 25, 2017 09:29PM dcdrogers wrote: Thanks everyone. I think I'll see if I can get an appointment before surgery even though I think the pathology report from surgery will be needed. Both my BS and MO seem to think it's likely I'll need rads but neither can say for sure until after surgery. A consult would give me the opportunity to meet the RO to see if we will mesh and to also ask questions. I'm extremely pleased with my current team and want to make sure the RO will be a good fit.",
      "MessageIndex": 4,
      "PostDate": "25/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854488",
      "Title": "At what point in the process did you meet with a RO? dcdrogers dcdrogers"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "dcdrogers wrote: I had neoadjuvant chemo (TCHP) and will be having a BMX on May 4th. I've met with a plastic surgeon already who will be working with my BS in the operating room to hopefully have direct-to-implants if my skin condition looks good. Both my BS and MO say that it is likely I'll need radiation (at least 1 positive node, but they can't provide me with a definitive answer yet regarding radiation. I'm just now wondering if I should meet with a RO before surgery or if it makes more sense to wait until the pathology report comes back before scheduling a meeting. Anyone meet with the RO after having surgery? If so, did it work out for you time-wise or do you wish you had scheduled an appointment before surgery? Thanks ~Dee Dx 11/15/2016, DCIS/IDC, Left, 2cm, Stage IIB, Grade 3, ER-/PR-, HER2+ (FISH) Targeted Therapy 12/15/2016 Herceptin (trastuzumab) Targeted Therapy 12/15/2016 Herceptin (trastuzumab) Chemotherapy 12/15/2016 Carboplatin (Paraplatin), Taxotere (docetaxel) Targeted Therapy 12/15/2016 Perjeta (pertuzumab) Surgery 5/4/2017 Lymph node removal: Left, Sentinel, Underarm/Axillary; Mastectomy: Left; Prophylactic mastectomy: Right; Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Radiation Therapy 6/14/2017 Whole-breast: Breast, Lymph nodes, Chest wall Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854488",
      "Title": "At what point in the process did you meet with a RO? dcdrogers dcdrogers"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Jun 24, 2017 02:34PM dcdrogers wrote: @Maria, I also do not have lymphedema, but like you have concerns. My BS wanted me to see a PT to at least have a discussion about lymphedema and what to look for. However, I just recently learned that the PT at my breast care center does not accept my insurance. (bummer) I'm currently receiving radiation treatment. I will be vacationing in September and have a 5 hour non-stop flight. I'm worried about lymphedema occurring from either radiation or my future flight. I've been doing my own gentle exercises and stretches, but I don't know if that will be enough. I planned to purchase a sleeve and gauntlet from lymphodivas.com, but ordering online can be a pain when you have to make returns for sizing issues. May I ask where you bought your compression sleeve? Also, how is the fit on it? Thanks ~Dee",
      "MessageIndex": 1864,
      "PostDate": "24/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "dcdrogers",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242686/profile",
      "Content": "Mar 28, 2017 07:23PM dcdrogers wrote: I'd request the MRI sooner rather than later. It's probably nothing, but I'd rather have my mind put at ease with an MRI.",
      "MessageIndex": 1,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853790",
      "Title": "Is MRI necessary? Hotmessmama Lula73"
    }
  ]
}