{
  "AuthorID": "dcsige",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78493/profile",
  "Posts": [
    {
      "AuthorID": "dcsige",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78493/profile",
      "Content": "dcsige wrote: I noticed two days ago that my left hand was a little more swollen than my right hand, and yesterday I went in and was formally diagnosed with lymphadema.  I got two compression garments: an arm sleeve and a little hand glove.  However, when I took off my hand glove before going to bed last night my swelling was worse! It is like all the fluid can't go into my wrist because of the tightness, and just gets trapped in the area between my wrist and my fingers and balloons up.  It was better after I slept with the garments off, but this afternoon all the swelling returned to my hand and it 10 times worse than it did in the morning with no garments.   Has anyone had their hand glove make things worse rather than better?  Thank you so much, still new to all of this (sigh). Dx 1/27/2009, IDC, 6cm+, Stage IV, Grade 3, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/737598",
      "Title": "Does your hand compression garment make it worse? dcsige Binney4"
    },
    {
      "AuthorID": "dcsige",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78493/profile",
      "Content": "Jan 28, 2009 07:32AM dcsige wrote: Thank you for that!  I am 29 and just diagnosed, and was really looking forward to trying to have a child with my new husband.  Obviously that is on hold for a while, but I love these happy stories! Thank you!",
      "MessageIndex": 51,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727180",
      "Title": "Just diagnosed 3 months after giving birth to my second child kelty kelty"
    },
    {
      "AuthorID": "dcsige",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78493/profile",
      "Content": "dcsige wrote: I feel a little guilty posting here since so many of you have a much more serious diagnosis of Stage IV.  I was diagnosed this January with metastasis to the lymph nodes in my neck (above the clavicle).  I was wondering if there were any other Stave IV girls in this situation.  I can't seem to find a suitable place in the Stage III diagnosis, because my Doctors keep talking to me as a Stage IV patient (life preservation vs. cure), yet I am not experiencing what most other people are experiencing here.  I would love to discuss radiation to the neck and surgery options with anyone who might be in a similar situation (or not simly have insight or stories to share).  Thank you so much. Dx 1/27/2009, IDC, 6cm+, Stage IV, Grade 3, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731581",
      "Title": "Mets to Distant Lymph Nodes Only dcsige dcsige"
    },
    {
      "AuthorID": "dcsige",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78493/profile",
      "Content": "Mar 31, 2009 10:40PM dcsige wrote: Thank you so much for replying everyone.  I had a really quickly growing tumor so Stage IV is my first diagnosis with cancer.  The tumors have been stubborn so far, but Herceptin is something I have in my arsenal and will take after surgery.  I really appreciate all you have shared, and looked up all the different medicinces that were metioned.  Reading all your words here and in other posts has really motivated me to stay postive.  Thank you again.",
      "MessageIndex": 3,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731581",
      "Title": "Mets to Distant Lymph Nodes Only dcsige dcsige"
    }
  ]
}