{
  "AuthorID": "DeAnaR",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201434/profile",
  "Posts": [
    {
      "AuthorID": "DeAnaR",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201434/profile",
      "Content": "DeAnaR wrote: Hi!! I found a lump a few weeks ago on the edge of my areola. It feels almost tubular. I seen my dr a couple of weeks ago about it and she sent me for a diagnostic mammogram and ultrasound and also wants me to see a surgeon because of my family history (my mom and aunt both had breast cancer). My dr said that it is most likely dense breast tissue but would rather be safe than sorry. The tech that did the mammogram could feel the lump. During the ultrasound the radiologist came in and asked me when I found the lump. He said that he could not see anything on the mammogram or the ultrasound and he thinks everything is fine. The other problem is that my right underarm has been feeling swollen for a couple of months now. There is not a lump that I can feel just feels swollen when I have my arm down, enough to be annoying. I got the paperwork in the mail yesterday to go see the surgeon but since nothing showed up on the mammogram or ultrasound I don't know if I should still see him or just cancel the appointment. Maybe I am just worrying too much.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821870",
      "Title": "Lump not showing up on mammogram or ultrasound DeAnaR Nemmett44"
    },
    {
      "AuthorID": "DeAnaR",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201434/profile",
      "Content": "Jun 11, 2014 07:36AM DeAnaR wrote: I called the surgeons office and asked them if they thought I should cancel the appointment and the lady said No especially since I have family history of breast cancer. So I will go see them next Tuesday the 17th. Thanks to all of you for your advice!! :)",
      "MessageIndex": 4,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821870",
      "Title": "Lump not showing up on mammogram or ultrasound DeAnaR Nemmett44"
    }
  ]
}