{
  "AuthorID": "Dearjaimee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
  "Posts": [
    {
      "AuthorID": "Dearjaimee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
      "Content": "Apr 11, 2016 10:03PM Dearjaimee wrote: Castromi, is the oophorectomy recommended for you based solely on your history with ADH? This will be my second mass surgically removed in 9 months. I decided to skip the core needle biopsy this timeand go right to surgery given my first surgery found radial scar and ADH (I figured why waste the time and money when I know I just want it out.) Because I'm only 25, my surgeon won't even consider putting me on Tamoxifen. She told me after my first surgery that it's never been tested in anyone younger than 35 and no doctor/surgeon/oncologist will go near me with it. So that option is out of the picture /: ",
      "MessageIndex": 7,
      "PostDate": "11/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/843258",
      "Title": "Should I consider getting a mastectomy? Dearjaimee ChiSandy"
    },
    {
      "AuthorID": "Dearjaimee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
      "Content": "Dearjaimee wrote: Last July, I had surgery to remove a 3.9cm mass that when biopsied, showed to contain radial scar and atypical ductal hyperplasia (ADH) cells. I had an MRI last month that showed another 1cm mass in the same breast. After having a mammogram and ultrasound done, my surgeon is recommending surgery to remove this mass as well. I'm scheduled for surgery next Friday. My question is, at what point do I consider getting a mastectomy? I know ADH isn't cancer, but if it's something that is going to keep coming back every year that requires surgery to get removed, when should I consider getting a mastectomy done? I'm 25 years old, and don't want to have to keep going through this same surgery every year. Please, any opinions are greatly appreciated! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/843258",
      "Title": "Should I consider getting a mastectomy? Dearjaimee ChiSandy"
    },
    {
      "AuthorID": "Dearjaimee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
      "Content": "Apr 13, 2016 11:49AM Dearjaimee wrote: I had my apt with my surgeon yesterday morning. I asked her about genetic testing and if meeting with a genetic counselor could be an option. She said since I have no family history of breast cancer, that it's not an option. There's cancer in my family, (dad passed away of jaw cancer, dads dad passed away of esophageal cancer) just not breast cancer. I also asked her because of my lifetime risk of developing cancer, my age, and if things keep popping up on scans every 6 months to a year, if considering a prophylactic mastectomy is a dramatic step that I should think of with a grain a salt, or if it's something that I should seriously consider..she definitely validated that it's a reasonable measure to take. My husband wants me to get a second opinion, not because he doesn't trust my surgeon, but because even though she has decades of experience, she doesn't have much experience at all treating someone my age with stuff she normally sees in women going through or post menopausal. She's told me herself she's not quite sure how to proceed with a treatment plan. What happens if in a year, I find a lump but am pregnant? I can't have the testing done needed because of pregnancy, and what if that's the lump that turns out to be mallignant? I know it's a lot of 'what ifs' but they're realistic concerns at my age. I'm at the point of thinking, why not nip it in the bud so I won't have to worry about this the rest of my life? Hence, considering a mastectomy.",
      "MessageIndex": 11,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/843258",
      "Title": "Should I consider getting a mastectomy? Dearjaimee ChiSandy"
    },
    {
      "AuthorID": "Dearjaimee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
      "Content": "Apr 11, 2016 10:11PM Dearjaimee wrote: Farmerlucy, I'm not sure how that calculation was made for me. I looked back at the radiology/pathology reports from my first surgery and didn't see anything about what my lifetime risk of developing breast cancer is. My surgeon told me that having ADH makes me 4-5 times more like to develop breast cancer later in life than the average woman walking down the street, which would put me between 20-25%. So it came as a huge shock to see 41.6% on my most recent reports-it seems like a significant difference that definitely impacts my decision on whether to have a prophylactic mastectomy done.",
      "MessageIndex": 9,
      "PostDate": "11/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/843258",
      "Title": "Should I consider getting a mastectomy? Dearjaimee ChiSandy"
    },
    {
      "AuthorID": "Dearjaimee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
      "Content": "Apr 10, 2016 10:48PM Dearjaimee wrote: Thank you so much for the reply (: I don't have a family history of breast cancer or any breast conditions. The closest thing would be my maternal great grandmother who had a mastectomy in the early 90's because they saw a 'suspicious mass' but as far as I know, no other testing was done. I have a really great surgeon, my radiologist referred me to her after I had my very first mammogram last June, she described her as one of the best breast surgeons in the southwest, so I'm comfortable with her..but even having the decades of experience she has, she told me I am her youngest patient she's ever had and is trying to think of a treatment plan since I'm too young for something like Tamoxifen/other treatments she would recommend if I was older. I have an appointment with my surgeon on Tuesday to go over my most current scans and everything, so I'm the meantime I'm just trying to get my list of questions ready (:",
      "MessageIndex": 2,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/843258",
      "Title": "Should I consider getting a mastectomy? Dearjaimee ChiSandy"
    },
    {
      "AuthorID": "Dearjaimee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
      "Content": "Apr 11, 2016 08:02PM Dearjaimee wrote: Update: I picked up my scans and radiologist reports from my MRI and mammograms to bring to my appointment with my surgeon tomorrow morning. While looking over them, I noticed something kind of shocking that I've never seen before.. At the end of my mammogram report, there is a section that reads, \"Tyrer Cuzick calculations report this patient's 10-year risk for developing breast cancer is at 1.1% and lifetime risk at 41.6%.\" I feel like this gives me even more reason to consider a mastectomy sooner rather than later. Has anyone seen something like this on any of their reports???",
      "MessageIndex": 4,
      "PostDate": "11/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/843258",
      "Title": "Should I consider getting a mastectomy? Dearjaimee ChiSandy"
    },
    {
      "AuthorID": "Dearjaimee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
      "Content": "Apr 14, 2016 09:48PM Dearjaimee wrote: Momof6littles: I don't have the family factor, but I am considered high risk. I have extremely dense breast tissue, the mammogram techs always have the hardest time getting decent images because of that. I'm onto my 2nd surgical biopsy in 9 months due to a suspicious mass that they want removed based on the fact that the last mass I had removed was ADH and radial scar. And after finding out I have a 42% lifetime risk of developing breast cancer in my life, I definitely have a strong concern about it.",
      "MessageIndex": 14,
      "PostDate": "14/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/843258",
      "Title": "Should I consider getting a mastectomy? Dearjaimee ChiSandy"
    },
    {
      "AuthorID": "Dearjaimee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
      "Content": "Mar 21, 2016 12:20AM Dearjaimee wrote: I just had my 6 month post op MRI..the first mass I have removed through a wire guided excisional biopsy was 3.9cm containing both ADH and radial scar. I got the results on Friday of my MRI. They found a 1cm mass that they want to mammogram, ultrasound, and core needle biopsy, and then most likely leading to surgery. I'm nervous that if there's already a mass that's back within 6 months of surgery to remove the first one, that I'm headed towards a viscous cycle of constant scans, biopsies, and surgeries ):",
      "MessageIndex": 666,
      "PostDate": "21/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "Dearjaimee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
      "Content": "Jun 18, 2015 01:12AM Dearjaimee wrote: Juliecc thanks for sharing your story! I think that's the tough part, reading about radial scars and having such different info all over the place..it's tough to know what is actual fact. When I went in to get the lump checked out, they did a diagnostic mammogram on my left breast, but not my right since nothing was felt on that side. Do you think I should get the right side checked out, just to be safe?",
      "MessageIndex": 4,
      "PostDate": "18/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/832691",
      "Title": "1 inch Radial Scar w/ Calcification..could it be cancer? Dearjaimee Dearjaimee"
    },
    {
      "AuthorID": "Dearjaimee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
      "Content": "Dearjaimee wrote: Two weeks ago I found a lump in my left breast. Last week I saw my primary physician to get it checked out. She referred me to a breast health and research center, where within two days I had 2 mammograms, an ultrasound, and an ultrasound assisted core needle biopsy. The results came back benign, and my radiologist told me the lump I found wasn't a tumor, but instead a radial scar covered in calcification. She urged me to have surgery to remove the entire mass so it can be biopsied and made sure that it is not hiding any malignant cells. I have a consultation with a surgeon next week where we will go over my reports and scans, and schedule surgery to remove the radial scar. I've tried researching as much as I can on radial scars since it is something I had never heard of prior to last week. A lot of the info I'm reading is very contradoctory on whether radial scars have a direct correlation with breast cancer, if they are a precursor to breast cancer, or if it's something I shouldn't worry too much about. I'm wondering if anyone has gone through the process of radial scar removal, and what their results were? Did it come back totally benign? I've read that the average size of radial scars are between 1-2 centimeters, which is somewhat alarming to me being my radial scar is 1 inch-considerably larger than most cases I'm reading about them. I'm 24 years old, have never had any breast abnormalities in the past, so this is all very new to me. Any information would be greatly appreciated!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/832691",
      "Title": "1 inch Radial Scar w/ Calcification..could it be cancer? Dearjaimee Dearjaimee"
    },
    {
      "AuthorID": "Dearjaimee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/217234/profile",
      "Content": "Jun 18, 2015 11:54AM Dearjaimee wrote: My doctor is the one that ordered a diagnostic mammogram over a regular one. She has diagnosed 2 women over the past 3 months who are both in their early 30's with breast cancer, so I don't think she wanted to take a chance on missing it with me if I had been diagnosed with it. I think once the radial scar is removed and biopsied I'll have more peace of mind, as long as the biopsy is benign. It just amazes me that something mimics breast cancer so well on a mammogram! My radiologist thought I 100% had breast cancer after seeing my scans which is why everything has been moving so quick.",
      "MessageIndex": 6,
      "PostDate": "18/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/832691",
      "Title": "1 inch Radial Scar w/ Calcification..could it be cancer? Dearjaimee Dearjaimee"
    }
  ]
}