{
  "AuthorID": "DebAL",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
  "Posts": [
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 24, 2018 06:22AM DebAL wrote: Groo, i hope you got some sleep. Losing your hair is tough. The first couple days were the roughest for me but we are all different. You definitely have the right attitude, free clothes sounds great!! It also seems like you have a very supportive family. You are beautiful with or without hair my dear! Personally, i was very lucky and so thankful that I had no other chemo side effects ( exercised, worked, no nausea) that I decided hair loss I can deal with. Sure, I miss it but summer is a good time to be bald. Just left Florida. 100+ degrees and humid i sure didn't miss my hair last week! Plus I get ready quicker than my husband. Left my \"lid\" at home lol. After I buzzed mine it slowly started coming in throughout treatment. But I still look like my dad. Illimae, you are a trip! Your pic is hysterical! Breeze does feel good. A guy i work with that has a buzz told me to swim while i have no hair; that the water feels awesome gliding over your head. And people are kind. We went to a concert and asked to pay to upgrade one section. The boss was standing there and said \" put them in the best available\" free. I didn't say a word but guessing it was my scarf. I just choose to embrace that kindness when it comes into my life. I hope everyone has a good day and enjoy the breeze on your scalp, through your peach fuzz, or through your hair today!",
      "MessageIndex": 6,
      "PostDate": "24/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/865410",
      "Title": "Shaved my head today GrooGruxQueen GrooGruxQueen"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 5, 2018 09:08AM DebAL wrote: ingerp, you look great!! Laydeebug, once you buzz your hair the scalp will feel better. The weight of even a pixie that I had for a short while hurt. My scalp felt better within 1-2 days. For me, the anticipation of losing it was the worst. I've done so much better with hair loss than I thought I would. In this heat and humidity being bald isn't half bad. This too shall pass. I hope everyone is feeling well!",
      "MessageIndex": 25,
      "PostDate": "05/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/865410",
      "Title": "Shaved my head today GrooGruxQueen GrooGruxQueen"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 3, 2018 05:01AM DebAL wrote: I was told 60ish is good also. Do you have any GI issues that would contribute to less absorbtion of vitamin D? I take 2000 daily but will bump up to 4000 in the winter months. Find that sunshine if you can!",
      "MessageIndex": 4,
      "PostDate": "03/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/868123",
      "Title": "Vitamin D level 36, too low or enough? stephilosphy00 FarAwayToo"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Mar 9, 2019 04:35AM DebAL wrote: Well crap. I'm really sorry both of you have to deal with this again. My understanding is that radiation after mastectomy probably depends on if there is lymph node involvement. Most dont have family history or BRCA gene and we somehow still wind up with this disease. Remember reconstruction is optional so you can choose to do nothing. I had dense breasts so decided on both so I wouldn't have to deal with mastectomy again. However, try not to second guess your choice too much. BMX doesnt give me a pass and isnt always the answer. This disease does what it wants. Ladygrey, keep us posted. I do hope you get to break out the champagne. Secondchances, I hope you are doing well. Take care ladies",
      "MessageIndex": 3,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/870254",
      "Title": "Contralateral BC —really? TheLadyGrey wallan"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 3, 2018 05:10AM DebAL wrote: Egads, I probably should have done the ice baggies throughout treatment but did not. I will tomorrow; it may be too late but it can't hurt. I just hope I can make it through flip flop season before my toe nails fall off. Eyebrows are definitely thinning. There is a lady at makeup counter at local dept store that is also went through treatment. I may pop in there today for an eyebrow 101 lesson. It's funny what u mentioned about what chemo does to nails. My skin has been flawless throughout treatment. Smooth, even, soft, not a zit to be found. Don't get it?. Maybe it's the \"last hurrah\" before AI's take it all away.",
      "MessageIndex": 17,
      "PostDate": "03/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864321",
      "Title": "Finished T/C 2 months ago, now side effects! mudd DebAL"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 4, 2018 03:30AM DebAL wrote: Debgads beauty report!! LOL . I will get the brow gel tomorrow. Looked in the mirror and half of one of my brows is pretty much gone. Have you seen it? Were you the one on one of the threads that posted pictures of eye brow tatoos on these adorable babies?? It sounds like something you would do and I barely know you! I seriously laughed so hard my abs hurt I feel like one of them after looking in the mirror this morning. Hopefully my tootsies hold up. I have a beach vacation in less than 2 weeks that was planned before all this happened. Here I am bald and I'm concerned about my toes lol. Keep the beauty tips coming! Off to knock out this last chemo. Enjoy your day and thanks for the laughs!",
      "MessageIndex": 19,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864321",
      "Title": "Finished T/C 2 months ago, now side effects! mudd DebAL"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 5, 2018 05:50AM DebAL wrote: Egads, chemo finito! I will see what side effects TC brings although when starting an hormone therapy how do we really know what drug causes what side effect. Just deal with each one when it comes I guess. My husband laughed at the golden arched eyebrow pic lol Me and my half an eyebrow will keep my eyebrow 101 appt at cosmetic counter tomorrow. I'm a hands on learner so hopefully it will help. Is the product you mentioned only online? Hope you are feeling well. Enjoy your day!",
      "MessageIndex": 21,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864321",
      "Title": "Finished T/C 2 months ago, now side effects! mudd DebAL"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 1, 2018 06:34AM DebAL wrote: Mudd, just wondering how the delayed side effects of TC are going since your last post? My last TC is this Monday 6/4 so just trying to be more prepared. I have been using acetone free nail polish remover. Egads, I got the nail base and glass nail file. LA minders how is it going for you? Brows and lashes fine now but i know to expect loss in july- august. Any suggestions on products to help strengthen my eyelashes? How often do you all get pedicures? My hair is already growing back lol bummed this last treatment may change that. We shall see. Thanks ladies!",
      "MessageIndex": 9,
      "PostDate": "01/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864321",
      "Title": "Finished T/C 2 months ago, now side effects! mudd DebAL"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 2, 2018 03:51AM DebAL wrote: Mudd, LA, and Not Very, thanks for the advice. If eyebrows and eyelash issues are only for about a month I think I can handle that. I will be on the lookout for white nails and will try gently trimming it away if I can. I agree that moisture getting trapped can cause problems like fungal infections etc. vinegar makes sense. Mudd, your younger and trendier comment made me smile. I'm in the same boat. I mainly wear scarves at work, wig a few times but think I will start wearing it more. Bald around the house but also in my backyard when hanging out , what I call my \"safe zone\" lol. I have great neighbors on both sides and I just feel comfortable. I have done so much better with the bald thing than I thought I would. It's already growing back but I'm prepared for whatever with this last treatment. I'm so fortunate to have pretty much sailed thru chemo with no side effects. Never even lacked energy. You hear everyone's experience is different. I just wish I could bottle up my experience for those that are suffering through treatment ; my heart goes out to them. I'm truly thankful. Moving on to AI's could prove differently. Thanks ladies and I hope you have a nice weekend!",
      "MessageIndex": 13,
      "PostDate": "02/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864321",
      "Title": "Finished T/C 2 months ago, now side effects! mudd DebAL"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 30, 2018 05:57PM DebAL wrote: mudd, I am only 2 treatments in but I have heard of darkening nail issues after treatment is over but not white. I did not ice but do have nails painted dark. Are u having tingling in your fingers tips or just the color change? I'm expecting the lashes and eyebrows to go , like you said, just when you start to feel normal. I hope this resolves quickly for you. Keep me posted.",
      "MessageIndex": 1,
      "PostDate": "30/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864321",
      "Title": "Finished T/C 2 months ago, now side effects! mudd DebAL"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 5, 2018 07:45AM DebAL wrote: Egads, lol, I will swing by Sephora on my way to my brow gig! Heading to Florida end of next week for rest and relaxation. I usually only take day of and day after chemo treatment off but decided to be good to myself and took this week off. Feeling a bit guilty but need to let that go. Going straight from bmx to chemo, then another surgery in July I just need to chill this week. I'll let you know if I find my brows! Enjoy your day!",
      "MessageIndex": 23,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864321",
      "Title": "Finished T/C 2 months ago, now side effects! mudd DebAL"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 2, 2018 04:59AM DebAL wrote: I will keep that in mind charger, thank you. TC, the gift that keeps on giving. Maybe I will at least make it through flip flop season!",
      "MessageIndex": 15,
      "PostDate": "02/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864321",
      "Title": "Finished T/C 2 months ago, now side effects! mudd DebAL"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 1, 2018 01:05PM DebAL wrote: Thank you egads, heading to sallys now! ! LA, you made me laugh. I'm looking forward to not shaving my legs for first half of the summer anyway!",
      "MessageIndex": 7,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864321",
      "Title": "Finished T/C 2 months ago, now side effects! mudd DebAL"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 10, 2018 10:41AM DebAL wrote: Christy, everyone's pain tolerance is different. My advice would be to take your meds as directed and try to stay ahead of it. I alternated narcotic with motrin and that helped. To be honest I set my alarm at night because there is nothing worse than letting the pain get too bad. Keep lots of pillows around for positioning. Most will agree that the drains are the most annoying part of the surgery. You may also be given a muscle relaxant which helps. It's no picnic but you will get through it. We are here to help you get through it. Best wishes!",
      "MessageIndex": 5,
      "PostDate": "10/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/866425",
      "Title": "double masectomy and implant surgery pmac NotVeryBrave"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 14, 2018 05:01PM DebAL wrote: hello, I have had 1 out of 4 TC treatments as well. Got neulasta but almost didn't due to insurance. It is not always used and some patients have an extra lab or 2 drawn before the next treatment to be sure things are ok. Some get neupogen. My understanding is that you are the highest risk of your wbcs decreasing near the last 10-14 days before the next treatment. Maybe your MO will offer it with the rest of your treatments? Dont hesitate to ask questions!",
      "MessageIndex": 2,
      "PostDate": "14/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863963",
      "Title": "Neulasta with TC MTNCLMBR NotVeryBrave"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 16, 2018 11:59PM DebAL wrote: hey druanne! I remember you but forget what threads I'm on! . I had that sunburn/ nerve sensitivity feeling at the beginning after surgery. A shirt or sheet over the area drove me crazy. I remember a shower and gentle massage to the area helped. I don't remember how long it lasted but it's gone now. Yes. Maybe try some of the creams suggested for the mosquito bite issue. I'm guessing it takes awhile for the nerve issue to settle down. There are meds for nerve pain you can ask for if things don't calm down. I hope you heal quickly and each day gets better for you!",
      "MessageIndex": 81,
      "PostDate": "16/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860079",
      "Title": "Hypersensitive skin/nerves after mastectomy az2017 Silverpullet"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 8, 2018 01:18AM DebAL wrote: Engine, sorry to hear your wife is feeling bad. Hopefully she is staying hydrated, resting, and able to eat to keep her strength up. What you are describing seems to be normal. In addition to this thread. you may also want to check out the TC thread and see if that helps. I hope she turns the corner soon.",
      "MessageIndex": 77,
      "PostDate": "08/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Feb 17, 2019 06:18AM DebAL wrote: judy, figuring out your plan is one of the most difficult aspects of this experience. A second opinion is always a good idea. Being in good health going into this is to your advantage. It was important to me to make the decision that allowed for the least amount of worry. No matter what we do this disease can resurface. The best decision is the one that feels right to you. When we look at each others signatures here on the boards we need to remember there is soooo much more than what is written that factors into our decisions. Many have other medical conditions to consider. it's not always as cut and dry as it appears. I wish you the best with your decision. Keep us posted!",
      "MessageIndex": 3,
      "PostDate": "17/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/869871",
      "Title": "Should I have chemo everetta everetta"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 15, 2018 05:32PM DebAL wrote: yes, keep going to PT. They will reinforce home exercises, maybe add a few knew ones. She massaged my shoulder blade/ armpit area which helped me with the movement. It will get better but it does take time. Warm showers helped me and I stretched twice a day Hang in there!",
      "MessageIndex": 2,
      "PostDate": "15/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864624",
      "Title": "Muscle tightnes Brownnurse70 Egads007"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 20, 2018 01:54PM DebAL wrote: Hi Grace, I stopped at 4. Was never offered 6. I am assuming going to six is because of your 1 positive node. I hope you are feeling ok overall. Hopefully you have a few more weeks to decide. ((Hugs))",
      "MessageIndex": 1,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867321",
      "Title": "How many rounds of TC did you do? GracelessLady GracelessLady"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 17, 2019 04:07PM DebAL wrote: labmom, hi there! I'm not sure about the node correlation. I recall never feeling \"clean\" for awhile. I felt like my armpit was always sticky is the best I can describe. A shower felt so good! I recall it lasting a few months to be honest. The skin was very sensitive. Even my sheet touching the area would hurt. I still keep aquaphor on hand and use it after a year. It's great if you actually do get chafing. Used it on drain sites, anywhere. Lol, my 2 cats would not welcome a lab sister. I hope you heal quickly!!",
      "MessageIndex": 1,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869407",
      "Title": "Armpit sweat and pain Labmom3 Spookiesmom"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 24, 2019 05:13AM DebAL wrote: kec, aquaphor is great for chafed areas. I still use it. Kb2115 your \"associated yuck\" is a perfect descriptor lol Thankfully, it does resolve!",
      "MessageIndex": 6,
      "PostDate": "24/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869407",
      "Title": "Armpit sweat and pain Labmom3 Spookiesmom"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 5, 2018 06:11PM DebAL wrote: Mudd, license pic? That's a tough one.!! You guys will laugh at me. Last chemo was June 2 and I ditched the scarves 2 days ago. Only wore my wig about 4 times. Its 90 degrees and humid. I'm over it. I'll post a pic soon once I take the time to fix my missing eyebrow. We are all different. I'm sure once it grows out but I dont yet have a style that will put me in a pickle. Thankful my head is covered with hair.. hope everyone is feeling well!",
      "MessageIndex": 26356,
      "PostDate": "05/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 10, 2018 01:28PM DebAL wrote: sunnyjay, thank you for your post and you look beautiful!! I used nioxin thru chemo and I'm 9 weeks PFC and still using. I was wondering what to do when the bottle ran out. I may just continue. Plan to make a quick appt with my hair stylist just to chat at the end of the month. I started biotin a week after I stopped chemo and hair is growing at a good pace for now. So is the hair on my legs unfortunately. Hope you had a great birthday!",
      "MessageIndex": 26373,
      "PostDate": "10/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 12, 2018 01:49AM DebAL wrote: Hi ladies, silly hair question and maybe I didn't go back far enough in the thread but do you see any reason why I can't use nioxin during chemo treatment as well as after? Also, you ladies that posted pictures look beautiful!! You look great!",
      "MessageIndex": 26299,
      "PostDate": "12/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 13, 2018 09:05PM DebAL wrote: Leesa, you sure have been through a lot. You look wonderful! CBK you look great also! I am hoping for those chemo curls soon. Thanks for posting ladies!",
      "MessageIndex": 26336,
      "PostDate": "13/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 8, 2018 04:45PM DebAL wrote: Libby, my hair is about the length in the leopard pic and very dark. Very tempting to try that look. Lol. Ingerp, I get it. I look quite a bit different from my ID badge at work. Everyone is different on the hair growth. With my 4 rounds of TC my hair slowly grew through treatment. I take biotin every other day or so. I will also post a pic of the vitamin I got at Walmart. Just check with your Dr. Its growing in pretty fast. Still missing the middle section of my left eyebrow lol. Crazy. Take care everyone",
      "MessageIndex": 26364,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 8, 2018 04:49PM DebAL wrote: ",
      "MessageIndex": 26365,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 11, 2019 11:09AM DebAL wrote: Jenkins, first I'm sorry you found yourself here. I'm not a regular on this thread. I just wanted to chime in that I had essentially zero side effects with my 4 rounds of TC. I walked 3 miles everyday. Including chemo day. Took day of and 2 days after treatment off work to hydrate, rest, pee alot lol. Then back to work to a fast paced job as a nurse. I'll admit , I'm the exception to the rule. Just wanted to give you hope. Please feel free to PM with any questions. Joining the chemo January 2019 group would be helpful. I found it additionally helpful to talk with those that are on the same regimen. Please dont get ahead of yourself and worry too much. You will get through it and it will be over in a snap! I will bottle up my experience and throw it your way! Take care! Deb",
      "MessageIndex": 15725,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 16, 2018 04:46PM DebAL wrote: Danaqtr, it's an individual decision of course. My breasts were very dense ( 50% each breast at final surgical pathology) so mammograms would not do me much good and I did not want the extra worry. My cancer had most likely been there 2 years or so by the time it was detected on mammograms due to density. Did not want the chance of fighting insurance for MRI's. Cancer on the left side and I did not want radiation due to potential for heart damage. My understanding is that mastectomy could decrease local recurrence chances but not distant metastasis. So many more decisions to make than I ever imagined, none of which are easy.",
      "MessageIndex": 4,
      "PostDate": "16/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867240",
      "Title": "Why majority choose mastectomy not lumpectomy?? Danaqtr Bagsharon"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 22, 2018 10:44PM DebAL wrote: Welcome Ingerp, everyone's experience is different but some things are standard regardless of the chemo agents used. Hydration is huge. My second treatment is tomorrow and I will drink at minimum 64 oz of water today plus a small Gatorade or juice. Adding a splash of lemon helps. I drink that much the day of through day 4-5. Taper a bit after that but still stay hydrated. Treatment room is cold so bring a blanket ,dress warmly. I over packed the first time and wont do that this time. With my treatment i'm out in under 4 hours. Leafed through a magazine, talked to hubby and nurses. Closed my eyes listened to music for a bit and it was time to go. Light breakfast is a good idea. They let you go to the restroom during but will need to disconnect infusion for safety reasons so I made a quick trip in between chemo agents. I sucked on lemon drops most of the time to to ward off the metal taste. IV shouldn't restrict you much. I brush my teeth after each meal when I'm home and biotin mouthwash works for me. I'm sure u will get an education handout with instructions with a phone # to call with additional questions. GA warrior, Dee...or anyone on the neulasta..how are you all doing? I started my claritin yesterday and will continue thru day 10, that's what I did last treatment. Onco said I could take as long as I wanted. I had zero side effects with neulasta at all. No way to say if it was the claritin but I don't want to find out so I will do the same this time and see how it goes!! I hope everyone is feeling better!💗",
      "MessageIndex": 122,
      "PostDate": "22/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 14, 2018 09:21AM DebAL wrote: HI engine, I'm glad your wife's counts are going up. As we speak I am getting TC #3. Neulasta and neupogen approval can be tricky with some insurance companies as they consider it \"optional\" for TC treatment and not \"recommended\" as it is for others is one thought as to why it may not have been offered? I had to send appeal letter to get neulasta approved. Hindsight is 20/20 but your wife's hospitalization should warrant it moving forward but I'm sorry she had to go through all this. PICC b4 she is discharged would be great. You mentioned the patch..i believe you mean the one for neulasta. I don't believe they have that for neupogen. The only reason I opted to go back in the next day for the shot is because there is a chance, although rare, that it could malfunction and I wanted to be sure I actually got the med. I live 10 min away from the office and didn't mind driving in. I hope all goes well and your wife is discharged soon.",
      "MessageIndex": 323,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 17, 2018 02:30AM DebAL wrote: maggie2, I'm sorry about your headaches and bone pain. I looked back through but couldn't tell if u took neulasta? I have had 3 TC treatments. Have you tried Aleve by chance? I was also wondering if you take oral steroids the day b4 and after treatment?. It's interesting to see how pre-meds and Rx for nausea differ even though our chemo meds are the same. I hope things go better for u tomorrow! Engine , glad your wife is home and feeling better!",
      "MessageIndex": 359,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 17, 2018 08:15AM DebAL wrote: Djt, I drink 6-16 oz water a day the day before, day of chemo and 2 days after. Today 5, tomorrow 4. I pee a lot of course but I was told to empty my bladder even if I really didn't have to so I do. Not sure if that's the key but i have just been duplicating everything i did the first time since it worked. I sincerely hope this treatment goes better for you!",
      "MessageIndex": 373,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 17, 2018 05:43PM DebAL wrote: FD, sounds like you have a good plan with the clarion and Aleve. And if it works stick to it! Frog, I'm sorry to hear you are feeling blah. How frustrating that everything tastes so yucky. I'm not a big ice cream eater but have given in more lately cuz it tastes good. I hope you are at least able to keep your fluids up. Keep nibbling . I hope this gets better for you soon. Hugs",
      "MessageIndex": 376,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 6, 2018 08:14AM DebAL wrote: Hi Frog, thank you. Starting arimidex in about 2 weeks. MO said I can have time to detox from chemo. I'm more nervous about the side effects of this pill that I was chemo. Just such a long time to take it. I was very very fortunate to get thru TC with no side effects. I'm sure the neulasta helped. I need to wait 6 weeks then surgery for permanent implants. I hope your taxol goes well with minimal side effects. A friend starts the A.C. and taxol soon. I'm sure returning every week for treatment will get old. I do like the soft face side effect i must say! I hope everyone feels better soon. I will definitely check in to see how everyone is doing. HUGS to all of you",
      "MessageIndex": 557,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 12, 2018 11:04AM DebAL wrote: Hi LIFE, I still check in on this awesome group. I finished my chemo June 2. Consider using bag balm (Wal-Mart $7 for a big jar) for your cuticles if you haven't tried it, it may help. It's been around for ages. I use it faithfully twice a week. Rub it in well all over my hands and feet, focusing on the cuticles. Its pretty greasy but soaks in. Then I put on a cheap pair of cotton gloves and socks for about an hour or two, read a book or watch tv. I may start doing it more since nail issues tend to come after taxotere treatment is complete. It's worked well for me do far. Hugs to everyone!",
      "MessageIndex": 616,
      "PostDate": "12/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 22, 2018 08:23PM DebAL wrote: Clear margins are usually taken care when a mastectomy is done. I'm sorry if I am not answering your question correctly. Do you mean did the Dr tell me how much tissue is a clear margin?",
      "MessageIndex": 938,
      "PostDate": "22/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 23, 2018 07:11PM DebAL wrote: urdrago, I'm glad you have a plan. I'm sure it was a very overwhelming day for you. It's just so much information. There are plenty of other resources on this forum and plenty of support. I hope you can sit back, take a deep breath, and let your mind relax for a bit this evening. Let me know if I can help you in any way. (Hugs)",
      "MessageIndex": 955,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 27, 2018 12:57PM DebAL wrote: Hello all, I hope everyone has a good weekend. Its exciting to hear everyone is on the homestretch with chemo. As far as the hair I am doing well there. I take biotin and a plant based hair skin and nail vitamin that I found at Walmart. Be sure you are using a shampoo that cleanses your scalp and keeps it clean so the follicles aren't clogged. That's very important. No shampoo can really make your hair grow. I used Nioxin throughout chemo and to be honest my hair grew ever since the buzz. I will be 8 weeks out from last chemo this Monday. Scalp is totally covered. I'm already ditching the scarves more often. Ask your hairdresser for advice if needed. Engine, I'm glad your wife is feeling better. Take care everyone. Hugs.",
      "MessageIndex": 984,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 7, 2018 02:21PM DebAL wrote: Hugs from Ohio Linda. It is ok to cry and please know you can always find support here. There is nothing wrong with you!! It's tough to think losing the hair is not even the disease but the treatment we go through. I hope the days get easier as time goes by. The anticipation of the hair loss was worse for me than actually losing it. I have my moments that's for sure. For me I look at hair loss as one step closer to getting through this journey and moving forward. You hang in there and remember you are not alone.",
      "MessageIndex": 284,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 7, 2018 06:42PM DebAL wrote: Djt, nice to hear you had a good day. I find myself having more and more periods of \"normalcy\" which is encouraging. Sometimes it's hours or even all day long. It just gives me hope that bc won't be on my mind all the time. It's funny that you mentioned looking forward to crossing hair loss off the countdown. I felt the same way. Frog, yes we will all move to the hair thread together! A coworker I has a \"buzz\" cut most of the time. He said Deb, try swimming with a bald head, the water glides over and feels awesome! lol. Didn't really plan on that as a bucket list item but might as well. I can do that next month on vacation where no-one knows me! I hope everyone has a nice evening.",
      "MessageIndex": 289,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 2, 2018 07:22PM DebAL wrote: Yes Maggie this is an awesome group!. My exchange surgery is on the 9th. I will definitely post on the exchange board. Today was the day I ditched the scarves at work. Scalp is covered with dark hair. It felt nice. I do take more time with makeup and wont leave the house without earrings on lol like that makes a difference. Inna B hang in there. The countdown is on. Frog, good idea to ask your GP about the supplements. I feel its helped me to add them to a balanced diet. Undrago I will post a pic of the plant based hair skin and nails vitamin I take daily. Got it at Walmart and MO approved. I take 5000 of biotin every other day in addition. It's nice to hear chemo is wrapping up for everyone. I'm sure 3 weeks seems like 3 months. Please know I celebrate each one of you as you put this phase of treatment behind you. Hugs",
      "MessageIndex": 1042,
      "PostDate": "02/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 2, 2018 08:06PM DebAL wrote: wonderful news engine!!!",
      "MessageIndex": 1044,
      "PostDate": "02/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 14, 2018 02:10PM DebAL wrote: engine, look in to vitamin C and wound healing. Now that janice is done with chemo maybe you can get her boosted up a little. Like 1000-2000 mg a day. And of course protein. I hope each day gets better for her.",
      "MessageIndex": 1132,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 14, 2018 04:50PM DebAL wrote: hey engine, research vitamin C and wound healing. You really can't go wrong. It helps with collagen production. I am on an anti hormonal too with no restrictions on vitamins but please ask. I can't believe it, I have a morning and night weekly pill dispenser. I'm officially my mother. However other than thyroid and the anti hormonal pill the rest are supplements. I found that once I was passed chemo my attention went to making a few needed dietary changes, getting in my exercise and learning more about a plant based diet. I'm not willing to give up everything but I have learned a lot from the other threads. I hope each day that janice is feeling better.",
      "MessageIndex": 1134,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 26, 2018 05:50AM DebAL wrote: Thank you ingerp, I can see her possibly wanting to return to work for a sense of normalcy. I'm glad to hear you are up to working. I hope the rest of your treatments go smoothly. Enjoy your weekend!",
      "MessageIndex": 464,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 26, 2018 11:56PM DebAL wrote: positiveinohio, I'm positive in Ohio too! ..Columbus area. I'm so glad you are doing well. I had kind of assumed working through A.C. would be out, then I saw GA warriors post which was also encouraging. I'm sure my friend will talk to her MO. Not only is she my friend but coworker but I manage her schedule. Reassuring her to take the time she needs and not to put an ounce of worry into coming back and to leave that to me. I want her to take care of herself. It breaks my heart that 2 weeks after my last treatment she will be in my chair for her first treatment. I'm sure in the near future she will find herself supported greatly through this forum. Thank you all so much.",
      "MessageIndex": 472,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 27, 2018 03:20PM DebAL wrote: Congrats weeddie!!! Drum role for you!! I will have to look in to the pallas trial. Hope you are feeling well.",
      "MessageIndex": 1249,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 4, 2018 04:48PM DebAL wrote: Hi everyone! Duffy, I hope they get back with you soon so things can get rolling. Mini meltdowns are so draining and sure put a damper on the day. I hope tomorrow is better for you Frog, I hope all of your testing for surgery went ok GAW- this time tomorrow you will be done!!! Congrats! I'm so bad about keeping up..best wishes to you InnaB and anyone else that is wrapping things up. Maggie..are you out there? I hope you are healing well. My belly is still tender from that fat grafting. I'm walking a lot , stretching exercises so I feel like I'm doing something at least. Djt, urdrago, ingerp, engine I hope everyone had a good holiday weekend. I'm headed to a plant based education class tomorrow evening. I'll pass on any tips. Reading a good book recommended on another thread. Broccoli, flax seeds seem to be the buzz words! Have a great evening everyone.",
      "MessageIndex": 1277,
      "PostDate": "04/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 9, 2018 06:14AM DebAL wrote: good afternoon, Just wishing everyone an uneventful weekend with minimal/no side effects. Duffyzmom, I'm so sorry. The emptiness the loss of a pet causes in your home is indescribable. Congrats to everyone finishing chemo and or moving on to the next step. With TC done I'm waiting a week or 2 to start with the AI and just waiting for exchange surgery. The pill is on my counter but right now I'm just looking at it!! Take care everyone and have a great weekend",
      "MessageIndex": 594,
      "PostDate": "09/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 9, 2018 10:16PM DebAL wrote: Morning everyone! Ingerp, glad you are feeling well and admire you being a gym rat!I hope you see some hair growth soon. LIFE, great pic and your hair is coming in nicely. Your energy will come back. I still get in a quick nap or 2... on the weekends. Once you are cleared inquire about supplements. Your goobers are adorable! Batata, I can picture you facepalming about the weight but good grief our bodies have been through alot! Once we get through the initial period after chemo and start feeling better we can chip away at it. Frog, I hope you are feeling better each day. Duffy, djt, innaB, engine ,GAW , maggie and anyone following this thread I hope you all are doing well and don't mean to skip over anyone. Urdrago, sending best wishes as you wait for results. You mentioned a life plan in an earlier post and it really hit home to me. Working out a few things to make my job less stressful. As much as I love it the stress is just not good. Been going at that pace for 35 years so it's kind of hard to let it go. Just because you \" can\" doesn't mean it's good for you. I've been looking into 'integrated medicine' and thought I would share. I didn't really know it existed..it focuses on the care of the whole person. I am meeting with an integrative physician for a consult to discuss goals ( I have an autoimmune disease so I'm VERY interested in knowing everything I can do to keep a strong immune system). They offer free massage, acupuncture. Nutrition, mind-body therapies to help with relaxation and stress. Now that I'm done with surgeries, chemo I am glad there is service out there that focuses on continued healing. I would assume the larger hospital systems offer this service. I will let you know how it goes. I hope everyone has a good Sunday!",
      "MessageIndex": 1329,
      "PostDate": "09/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 16, 2018 09:24AM DebAL wrote: morning everyone, Duffy glad rads is moving along, bummer about the exposure. Did you get the vaccine? Engine I bet janice loved the pampering! I'm so glad she seems to steadily be on the upswing. Linda great news on the path report. Implants feel odd at first. I'm getting more used to them. I hope you heal quickly. Urdrago. Eyelashes and brows are typically last to go and last to come back. Yes be patient lol I literally lost just the middle section of my left eyebrow and middle section of my left eyelashes. crazy! I hope everyone is feeling ok and enjoy your Sunday!",
      "MessageIndex": 1401,
      "PostDate": "16/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 27, 2018 12:37PM DebAL wrote: I agree Maggie! Love all the pics! Hope everyone is feeling well today, deb",
      "MessageIndex": 1486,
      "PostDate": "27/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 29, 2018 07:07AM DebAL wrote: Morning everyone! engine, maybe it will be good for janice to get back to work. I'm glad she can work from home a few days a week. Encourage her to drink lots of water while on the bactrim InnaB, YES! on the swelling. I finally got a prescription for water pill and took it maybe 3-4 times a week for about a month. I went to the provider most likely to write the prescription lol. It really helped. Told him I just needed a little help to get this fluid off. I remember I was patient and waited for a few weeks after chemo b4 I finally asked. And I agree about the black panther. They bald women did look pretty bad assed lol Ingerp you would not scare children !! Hope everyone has a nice relaxing weekend, deb ",
      "MessageIndex": 1494,
      "PostDate": "29/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Oct 9, 2018 10:35PM DebAL wrote: hi everyone. I hope everyone is doing well. Evacuated safely to new orleans. We wanted to experience bourbon street anyway! Hopefully some sight seeing tomorrow. Engine we had the hula pie in Maui. It's delicious! Take care everyone",
      "MessageIndex": 1583,
      "PostDate": "09/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 13, 2018 09:10AM DebAL wrote: Hi everyone, just checking in and hoping everyone is doing ok. Djt, I am 6 weeks out post TC. I am doing fine during the day but definitely tire out more by early evening. Each day will slowly get better. Just listen to your body. Let me know if you find yourself with swollen feet and ankles. I heard it's a taxotere side effect and this started for me after my last treatment. Between work and exercising I get in a lot of steps plus the heat doesn't help. By the next morning it's gone but reappears in the evening. It seems weird to just be taking a pill a day and not focusing on chemo. Definitely an adjustment. Each one of you will get there and I can see and feel how you all truly lift and carry each other through this. You are a special group and that is why I check back. Hang in there. Hugs to all of you.",
      "MessageIndex": 865,
      "PostDate": "13/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 22, 2018 07:40PM DebAL wrote: HI everyone, GA Warrior and any of you that are having an upcoming mastectomy I will be more than glad to answer any questions. I wont lie, it's a bit rough at first but you all have been through chemo, you can do this!!! I started taking a low dose aspirin after I got through surgery. I didn't qualify for a study but was advised to take it Taking vitamin C and eating protein, lots of fruits and veggies will prepare your body so you can go into surgery as strong as possible. No question is off limits my friends!",
      "MessageIndex": 934,
      "PostDate": "22/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 22, 2018 09:17PM DebAL wrote: I will be thinking about you. Bring a note pad so you can jot things down. I think you will feel better once you understand your options. You are right, the decisions seem never ending sometimes and not always easy to make. (Hugs)",
      "MessageIndex": 944,
      "PostDate": "22/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 17, 2018 11:29AM DebAL wrote: duffy, oh no! Two of you!. I think you should color your hair scarlet and gray! LOL. Go Bucks!",
      "MessageIndex": 1771,
      "PostDate": "17/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 26, 2018 09:53PM DebAL wrote: Hi again! I wanted to fill you all in on my appt with the integrative physician. Not sure if I mentioned it before but I filled out an 18 page history form that the Dr reviewed before I could even get scheduled. Appt was 2 hours long! I took notes but I left them at work , ugh, so I'll fill you in best I can. My Dr used to be a primary care physician for many years. He decided to go into integrative medicine to make more of a difference. Not just see a patient for 10 minutes, hand out a Rx, and send you out the door. Integrative medicine basically looks at all the factors that influence your health, wellness and disease. He mentioned making the body so it is less of a host for disease. The approach is evidenced based and meant to enhance traditional treatment. He was very big into gut health. Probiotics and prebiotics foods that help the probiotics work better. We discussed nutrition at length. More cruciferious veggies which I knew I was lacking. Not sure I can get in the 6-8 servings a day he suggests but I can certainly improve. Cage free organic eggs, 100% grass fed beef etc. He would like me to try adding trace elements drops to my water which I will consider. Definitely filtered water. Added 1mg melatonin to start. He couldn't believe how little sleep I get. Not good. He was very impressed with the change I made in my job to decrease stress. He said \" people anymore live in a constant state of fight/ flight\" constant stress at my job without a doubt. He said fight/ flight is meant for emergencies only not for our daily lives. He is drawing a comprehensive thyroid panel. Also sending blood out for all vitamin and trace element levels. It will guide us on which supplements I need and dont need. Looking forward to knowing what I need or dont need. I was really impressed with our visit. It gives me a little more control back since this disease takes so much away. I know there is no guarantee but I'm hoping I can make needed changes to optimize my health and feel even better. If you have this service offered in your health system maybe consider looking into it. It was nice to sit across from someone that was interested in my overall health. I'll take it. Sorry so windy! Deb",
      "MessageIndex": 1793,
      "PostDate": "26/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 31, 2018 05:36PM DebAL wrote: great news Engine, I am sure you both cannot wait to have this last one in the rear view mirror. Keeping fingers crossed her last one is uneventful. I am 8 weeks from last chemo. I am missing the middle section, yes middle section of my left eyebrow, have any of you seen it?! Of all things, how ridiculous! The rest of the eyebrows are pretty thin, a few eyelashes left to put mascara on. On a positive note scalp is covered with hair and its growing in fast so I'll take it. Hoping each of you feel a little better each day. Hugs to all",
      "MessageIndex": 1025,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 4, 2018 07:40AM DebAL wrote: hey ingerp, my hair is really thick. Growing fast. I went in for a trim and stylist said leave it and try to work with it. So glad she did. Its unruly but a taffy like product works well. I've had no shaping at all and honestly get compliments daily on my \"short cut\" lol. We have waited so long for it to grow. I have the surf curl too...I blow dry to get dampness out then taffy on the fingertips to work it through. Also learned to go with the direction and not fight it. Your last picture looked great!! ",
      "MessageIndex": 1842,
      "PostDate": "04/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 14, 2018 08:16PM DebAL wrote: GA warrior, I had skin sparing and nipple sparing and so far very happy and if I have to go thru this consider myself lucky. They expand u quite a bit further than the actual implant. I wanted to be a tad bigger than b4 diagnosis but I feel I look the same. I made my daughter look, she seems to think I'm a little bigger. I guess I got used to the TE size because I was expanded for so long. Anyway, I have the \"gravy\". I have dull sensation on my skin along with nipple sensation. When I'm cold, they are cold. When I'm not, they aren't but there may be a slight delay in response time. It is different but it's ok. My incisions are infra mammary so they are not visible. I was very fortunate to be a candidate for this type of surgery. I just could not go on worrying about dense tissue in the healthy breast. Final path said 50% dense on healthy one, 40% on the bad one. That's crazy. For piece of mind I made the right decision for me. 2-3 months sounds about right for exchange. My PS would not fill until 4 weeks after mastectomy. If it takes a month to get fills in you usually wait a month from last fill b4 exchange. Have u decided pre- pectoral or behind the muscle? Decisions seem never ending. I'm glad everyone is headed towards or crossed the finish line with chemo. Hope everyone has a good night.",
      "MessageIndex": 1136,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 17, 2018 03:04AM DebAL wrote: LIFE, you are too funny. I have had enough colonoscopies to cover everyone on the April thread lol. Stick to things that digest easily today. Chicken noodle soup and crackers, mashed potatoes, scrambled eggs, applesauce, things like that. Tomorrow is Gatorade, Sprite, tea, broth. Not fun. Dont sit in the lunchroom with your coworkers lol. Ok. 3 days is all you get to hold your grudge lol. That's what I tell a few friends at work. Think it through, calm down a bit , then try to explain it to him again. Ask him to cut you some slack. The kids take bets around here as to how long I stay mad at anything. Big family joke. Average is 15 minutes to an hour. I've always been that way for some reason. The prep really is the worst of the whole thing. It's a great way to drop a few lbs before a beach trip lol. Bottoms up LIFE!!",
      "MessageIndex": 1897,
      "PostDate": "17/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 18, 2018 11:37PM DebAL wrote: morning all! GAW, hoping Bryce got to go home. Sleep in his own bed and no hospital food. He is so fortunate to have you there. Update us when you can. Linda, I know what you mean about floating on air. No awkwardness at all since we already \"knew\" each other. What a nice break for Robin to be able to visit with you. You both look great! Congrats on the trial on finishing rads and starting the trial. All in is right!! LIFE, hopefully all went well for you. I'm sure you will enjoy your dinner tonight! It's just so funny. You just never know when paths may cross. Heck, urdrago and I may watch an OSU/Michigan game together. You just never know!! Hope everyone has a good day! ",
      "MessageIndex": 1906,
      "PostDate": "18/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 17, 2018 06:22PM DebAL wrote: hi everyone! Engine I hope your wife's hair comes back in quickly. It is such a bummer to still have that reminder long after treatment is done. Yes, I can see being a \" blondie\" would take longer to seem like the scalp is covered. Duffy you are gorgeous!!!! Oh Maggie, you feel my pain. I agree much better than mastectomy. More of a severe soreness than pain. Glad that you are doing well. I bet you were glad to get rid of the port. My swelling is getting better. Now I have all the lovely colors on my belly as the bruising heals. I agree, chest area is not too bad. Although, it is smaller. I got used to those filled TE's I guess lol. Get some rest this weekend and I hope you heal quickly. Happy Friday everyone :)",
      "MessageIndex": 1168,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 30, 2018 08:42AM DebAL wrote: morning everyone. just catching up. InnaB and urdrago I hope things resolve soon. I'm so sorry. Linda I hope trial is going well. How nice to have others here that can give advice and helpful suggestions. Just chiming in. I've used aquaphor often along this road. Right now on the areas where fat grafting stitches were removed. Bag balm is awesome. If you haven't tried it, treat yourself. Lather your feet and hands with it. I bought a pair of thin cheap cotton gloves, thin cheap socks to cover. Watch a movie. Let it soak in. ( it's harder to leave the gloves on longer) oh my, skin is so soft afterwards and feels sooooo good. I do it about once a week. Oh frog, I hope your anxiety gets better. Enjoy the time with your parents. I'd love to see another hair pic after the first of the year. Urdrago, I hope mom and baby are doing well. GAW how many times have you called Bryce since Friday?? I'm sure you are glad to be home. LIFE, get off that crazy train, not worth it. Best news ever for me, i accepted a position in our cardiac rehab dept. It's based in the fitness center. Teach lifestyle modification classes. Work along exercise physiologists and dietician. Monitor patients for for exercise intolerance (cardiac arrthymias, blood sugars ) as they begin treadmill, elliptical etc. Most patients have had open heart surgery, vascular surgery, heart attacks. And I get to wear gym clothes to work and listen to xm radio that's piped into the gym. What an environment to have for an office! I'm beyond excited. Stress was by far a large contributor to my bc. I just cant stay on that road. Once you identify a contributing factor that you know in your heart is not good, please make even a small change to make it better or eliminate it all together. Ingerp, glad you are doing well on anastrozole. I'm 6 months in. Joint stiffness and rotating aches in the bones. A definite difference but not affecting quality of life enough to switch meds. I just cant sit very long in one place. A desk job would not work for me at all. Engine, how is janice? And you too maggie! Duffy, djt, hiking lady..everyone I didnt mention..I wish everyone a healthy 2019. Deb ",
      "MessageIndex": 1950,
      "PostDate": "30/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 11, 2019 11:17AM DebAL wrote: hey duffy..do you mean how long your hair is at a given month? To get an idea for styles? If so I have a link. Of course the girl is super young but some great idea for styles as we go through the hair stages. Deb",
      "MessageIndex": 1993,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 27, 2018 03:04PM DebAL wrote: ",
      "MessageIndex": 1247,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 11, 2019 12:26PM DebAL wrote: duffy, girl..my hair is a mess. I really should make a sooner appt. Right now its Feb 13th which is over 8 months PFC LOL. We are going to south beach the following week. If it were summer I would care more. I know what you mean. We want a longer style but it still needs shaped. I think I'm going to have a few awkward months where it looks worse before it looks better. You could get your neckline and sides shaped. Taffy is great to keep the rest under control. Google \"my cancer chic-anna\" one of her links showed how she got through each month as she grew her hair out. It helps to have a young face of course lol. I have a feeling I will have a headband stage if I want this to grow out right. Hope you are doing well! Deb",
      "MessageIndex": 1995,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 11, 2019 10:54PM DebAL wrote: Udrago, I'll tell u my story. I was denied neulasta and was prepared to pay $8,000 X 4 shots but wrote an appeal. No way was I going to be hospitalized for neutropenic fever in order to get covered. Makes no sense. I was approved on Easter Sunday last year with chemo starting that Monday. I will share what I learned. Your office is probably submitting an appeal on your behalf. In my case I was denied too. Should that happen to you again this is what you do: Call Insurance company yourself. Demand to talk to someone that can email you the guidelines for Xeloda approval. Plan to be on hold for awhile. It is your right to those guidelines. DO NOT take no for an answer! Offices can NOT get the guidelines but you can. Once you get them there is probably a list of criteria that you must meet to get approved. Read each one carefully. You may only need one of them!! If you find something that may work write a letter to the insurance company focusing on the one criteria you meet. I'm serious, I will help you. I was denied neulasta for chemo. I spent many minutes on hold, got my guidelines. I built my appeal letter around one of the criteria I needed. If the office tells you that you are denied again please call yourself. It's worth the effort. What i learned is that it takes an escalating an appeal before it goes peer to peer between 2 oncologists. Once 2 physicians in the same field discuss, you have a better chance of winning. My insurance admitted it could be YOUR oncologist doing a peer to peer with an OB GYN lol..on the other end asking for approval. Is that not insane??? Once YOU escalate they are forced to make 2 oncologists discuss and you have a better chance of getting approved. Sorry but it pisses me off that it comes to this. I've already decided when I retire that's my calling lol. Write appeal letters. Insurance companies should not decide your treatment. It may not always work but it's worth the fight. Should you get a 'no' from the office again I'll help you with an appeal. This ain't over yet my friend...no more tears just yet. Keep us posted. Hugs!",
      "MessageIndex": 2002,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 4, 2018 08:46PM DebAL wrote: urdrago, I am guessing..but could always be wrong... that 'hook wire' that frog mentioned is the same as 'wire local'. I work in pre-op and we call it \"needle localization\". patients go to breast imaging for that about 2 hours prior to surgery. Our patients do come back to pre op briefly (with a large Dixie cup taped to the area for protection) once they are done prior to going to surgery",
      "MessageIndex": 1283,
      "PostDate": "04/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 17, 2019 08:24PM DebAL wrote: ",
      "MessageIndex": 2033,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 17, 2019 08:44PM DebAL wrote: You look great urdrago! Sending positive thoughts for tomorrow.",
      "MessageIndex": 2035,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 5, 2018 09:33PM DebAL wrote: WOW, hi everyone! exciting news this evening!! Batata, thanks for checking back in. Claritin worked great for me too. I never stopped it so I like to think it is warding off some of the bone pain from arimidex also. Weight gain ugh. It's all about being where we are comfortable. I gained about 13 lbs. It took awhile. To be honest I do a 15 hr fast at night (and that's when I noticed the difference), dedicated to walking at a good clip and it did finally come off as of last week..so a good few months. Hate to say it but be patient. Your body needs to adjust. DING DONG GA WARRIOR! congrats! We are all there celebrating with you. Big hug! Engine thanks for the chuckle!! Duffy, happy dancing with you, best wishes! Krissy, congrats!! I hope the sense of calm is because you did it..and you did what you needed to do for your own piece of mind. We all had different decisions to make none of which were easy. Getting on with life without the 'all consuming worry' is what I wish for everyone. I'm still just sorry that we all are going through this. Good night my friends! ",
      "MessageIndex": 1301,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 19, 2019 01:04PM DebAL wrote: and happy belated birthday frog!!",
      "MessageIndex": 2047,
      "PostDate": "19/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 26, 2019 08:42PM DebAL wrote: oh linda, I'm so very sorry for the loss of your sister in law. This will be front and center for awhile as you work through your grief. You hit the nail on the head. Fear is normal and we all have it. It ebbs and flows like anything in life. We each work through this differently as to not let this disease control our lives. I'm glad you still made your trip. It was probably good for both of you. I hope the GI side effects subside a bit for you. Please take care and again I'm so sorry for your loss. Deb",
      "MessageIndex": 2073,
      "PostDate": "26/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 14, 2018 08:39AM DebAL wrote: hi everyone, engine. Benefits town hall..ugh..we have been through that a few times. Best wishes there. Sorry if I'm repeating but is janice taking biotin and a hair skin and nails vitamin? Keeping the scalp clean with a good shampoo ( I used nioxin) i know she has been through chemo before so i would expect that's a factor in her regrowth. I'm so glad she is feeling better and is on the other side of this. There is nothing you wouldn't do for her and that is obvious. Maggie, appt went well. I did find out FDA recommends MRI screening 3 years after implants then more frequently after that. I can go without a bra at night if I want. Was told in the end gravity always wins so use my judgement. Things are evening out a little more and I'm cleared as far as activity goes. I hope things are getting better each day InnaB and LIFE I hope you are feeling better today. I hope everyone has a good weekend. I think of all of you everyday and how fortunate we are to have each other to lean on.",
      "MessageIndex": 1389,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Feb 3, 2019 11:28AM DebAL wrote: sounds delish duffy! I'm breaking out the air fryer my sister in law got us for Christmas and making wings. Will add veggies on the side for good measure. I agree about the commercials. I must admit the trailor for pepsi commercial with lil jon cracks me up for some reason. Oh my, gets my funny bone!!. A local \"kid\" that went to high school with my oldest is #43 for the patriots Nate Ebner. So I will say go with NE for today. My son texted him yesterday and said my mom said \"Go Pats and shes rooting for you\" My other son said..NO WAY.. the day before super bowl will he text back. Ding..instantly a text back!! \"Lol , tell your mom thanks\" . I think it's the word mom that gets a response from good guys. I hope everyone has a good Sunday. Deb",
      "MessageIndex": 2112,
      "PostDate": "03/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Feb 23, 2019 08:42AM DebAL wrote: good morning, Wow, everyone looks gorgeous! You all look like models! Linda, good news for you and Duffy I hope you report the same soon. Urdrago, when will you hear back about the rest of your blood work? GAW I know you are more than ready for your exchange surgery. You will be beach body ready for the summer. I'm plugging along on this AI. Really good during the day but once I stop to rest and then go again it's a different story. Achy old lady bones. So I guess feeling like this just 3 hours a day is not bad. We are going to Florida next week for a few days so I'm anxious to see if the warmer weather makes a difference. Engine, how is janice feeling since her fall? Batata, maggie, ingerp, LIFE, innaB, frog..it was nice to go back to read how everyone is doing. I hope everyone has a great weekend. Hugs to all. Deb  ",
      "MessageIndex": 2164,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Oct 1, 2018 08:53PM DebAL wrote: hi everyone, I went back to look through all the pics again. Everyone looks great! GAW you have fuzzies! It's nice to see everyone. I had an Express color on my hair. The back is starting getting wavy so I think the chemo curls are next. Engine, I hope janice had a good day at work. Let us know how it went. I'm heading to the beach Wed morning for 12 days. I will send a nice beach pic next week. Really looking forward to disconnecting a bit and my only concern being which way to turn my beach chair. Looking forward to long walks, a few runs, sunrises, sunsets, a good book and seafood. I actually took 3 weeks off from work so I come home to a staycation. I hope everyone is feeling ok. You all are close in my thoughts. Deb",
      "MessageIndex": 1506,
      "PostDate": "01/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 3, 2019 06:25AM DebAL wrote: hi everyone. A year has passed and April is here. I think of all of you often as we move forward. I've been away for a bit and need to catch up as well. Forgive me for not being caught up. Without going in to details..minor \"almost \" car accident- seatbelt caught me thankfully but burning implant had me concerned, daughter moving out, passing of a close family friend from bc,, close friend with a reccurance after 25 years, and settling in new job. It's been tough but at the same time it's not been all bad. Got away for a few days to Florida about a month ago and met up with a friend I met on another thread. The 4 of us had breakfast in southbeach and the time went too fast. We had a great time. Sending healing wishes to everyone and please know I think of you all often. Hugs. Deb",
      "MessageIndex": 2312,
      "PostDate": "03/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Oct 21, 2018 08:22AM DebAL wrote: Good morning, GAW I'm so glad you are doing well. Keep us posted LIFE I hope your CT results are normal and that you just need a tweak with your medication Urdrago, hmmmm white chicken chilli sounds good. I may need to get that recipe from you! Ingerp I hope you have a wonderful trip. Hoping everyone is having a good weekend and that everyone doing rads is getting through. I had a really good nights sleep which is a bit odd for me. Going to take advantage of the extra energy and hit the treadmill early this morning. Take care and have a good Sunday",
      "MessageIndex": 1650,
      "PostDate": "21/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 3, 2018 10:12PM DebAL wrote: Hi friends, I've been on the boards briefly to read and I'm just now catching up. Engine, how is janice handling going back to work? I'm sure some sense of normalcy is good. I hope it's not to stressful. LIFE, every one of us here is a negative Nelly or Nelson from time to time. This experience is hard. You are aware of it which is a good thing. We get it. Most others in our lives dont. I think the anger is there for everyone but maybe more so at different times during treatment. You are right on about the sleep factor. Definitely plays a huge part in having a good or a not so good day. Still waiting for an appt with the integrative medicine physician. I've been on arimidex for 5 months. Minimal side effects so far. Let me know if I can help you there Urdrago, I have your recipe ready to go! I just saw you are from Michigan. Are you a wolverine? Lol Maggie! I hope you are getting used to your new ta ta's and that you are feeling well. I'm scheduled for fat graft #2 in dec but not 100% sure I'll go through with it. Will decide next month. InnaB I hope you are feeling better. I'm having the same feelings. Effexor may be in my future too. Holding my own for now but it's a challenge sometimes Ingerp, looks like you had a great vacation!. You are beautiful Frog, congrats on finishing rads. I hope you are feeling ok. I hope everyone else that I didnt mention is doing well. Djt said it once..I think of ALL of you often even though we may drop off the boards from time to time. Ok GAW.. I'm going to reveal our secret! GAW and I are meeting for coffee next weekend!! Our family will be in Atlanta for a wedding. A real hug will be so much nicer than a cyber hug. Looking forward to it ! Hopefully we can take a pic to post! I hope you all have a nice weekend. Sending good vibes to each of you. ",
      "MessageIndex": 1699,
      "PostDate": "03/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 4, 2019 08:47AM DebAL wrote: ingerp, how super nice of you to mail the care package!! InnaB, sorry if I'm not up to date but I'm assuming it's your exchange surgery? If so, much easier than the first. Are your TEs pre pec or under? We are staying at riu republica. Sister in law made the arrangements and we just said \"sure\" when she asked. My hair is so darn thick I wont need to worry too much about my scalp burning. Looking forward to getting away. Have never been to an all inclusive before. On the bitmoji..where you normally click the text button I click add to camera roll. Then its mixed in with my pictures and I attach it that way. I hope everyone has a great weekend! Deb ",
      "MessageIndex": 2436,
      "PostDate": "04/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 15, 2018 10:35PM DebAL wrote: good morning everyone. It has been awhile. I was telling GAW when we met how I think of everyone often, I like to reply when I have the time to truly catch up. InnaB congrats! You are just too darn cute. I believe you suggested accupuncture. After few sessions I do believe it started to help me. Then my work schedule changed. I want to go a few more times. How often do you go? Urdrago, brrr. We are in for a long winter. I say we go live with frog for a few months. You are the nicest Michigan fan I know!!. I'm from Columbus so we have a big football showdown coming up soon!! It will be funny that we will be rooting against each other for a few hours that day. That's the only reason I would ever root against you!!. Lol. I'm rooting for all of us as we move forward in putting this disease behind us. Frog, enjoy swimming and please post another pic of your unruly hair! Hoping for minimal or no side effects for next monday. LIFE. I hope they can figure out your elevated liver enzymes? Many pain meds are metabolized in the liver is probably why they prefer you not take anything unless necessary. You mentioned it's been elevated after chemo, any chance its due to the arimidex? I dont think it's one of the major side effects but I believe it's possible. Then again, what isnt on that list. Ugh. Please keep us posted. Ingerp, so far my side effects on AI are minimal and I wish you the same. I've been on arimidex for 5 months. I'm on the go from 5am with work, exercise and when I get home I take a half hour nap. When I go to get up I literally feel 90. Its bizarre.!!!! It's only after my nap. I think it's my body in shock because I'm so active all day. Thankfully 15 min later it's gone. I dont feel that bad when I wake up in the mornings. So far I can deal. Enjoy your trip. Getting away is magical. Enjoy. Hi engine. How is janice doing? Omg a home hyperbaric chamber, are you kidding me?! The fires and shooting is just devastating. I hope your community can begin to heal. I cant imagine. Duffy, no shaping at all as far as my hair goes. I use a taffy styling product which helps. I had a temporary color that only lasts a few weeks to tone down the gray. It's not near the coverage permanent color is but my hair is so healthy right now I dont want to start back with that just yet. Its unbelievably thick. I'm hanging on to every hair right now as some struggle with thinning due to the arimidex. I'll cross that bridge if I get there. How are you feeling? Hey miss maggie! I have PS appt today to firm up if I will go through with this 2nd fat grafting next month. Things have settled more. I notice a bit more rippling but honestly I cant complain. Part of me wants to see this through ( covered 100%) and part of me says leave as is. I hope you are doing well! Found a comfy bra at nordstroms and the fitter was very helpful. Djt and and everyone that check in from time to time I hope all is well and sending good vibes. I have my integrative physician appt Tuesday. It's a 90 min- 2 hr appt. Are you kidding me? Not a single provider has spent that much time with me. I filled out an 18 page history form. Looking forward for some direction on keeping my immune system healthy ( I have autoimmune issues) Not sure if this is a one time visit or not. Finding my self at the \"end\" of treatment comes with concerns. I just need validation that I'm on track as far as what is in my control. It was so nice to meet GAW. I told her I felt like I was on a mystery date LOL. If you pictured us yacking away you were right! Time went too fast. A good example that you just never know when our paths might cross. It was nice to feed off of her positive spirit and I hope I did the same for her. We both agreed dark thoughts and worry surface from time to time but as long as they are not in the forefront all the time that is normal. Do something you enjoy every single day. Dont feel guilty about doing something good for yourself. With that said. I think I will enjoy another cup of coffee under my warm comforter and be thankful I'm not driving in this ice storm. Hugs to all! Deb",
      "MessageIndex": 1750,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 15, 2018 10:41PM DebAL wrote: ",
      "MessageIndex": 1751,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 19, 2019 10:20PM DebAL wrote: must I leave? ",
      "MessageIndex": 2491,
      "PostDate": "19/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 26, 2018 09:07PM DebAL wrote: hi everyone, hair talk! ! Duffy your hair looks great!!. You look awesome! It's like peach fuzz then all of a sudden it turns to 'real hair' and that's when mine really took off. You will get there too. LIFE, I hope your appt went well. Keep us posted. Thanks, I had a temporary color put on only because it's less harsh according to my stylist. If you look close my hair has a mixture of colors lol. The temporary color doesnt give the coverage or last as long as the permanent color. My hair is pretty unruly to be honest but that's fine. This taffy stuff I'm using keeps it a little tame anyway GAW, your hair is filling in great! I agree with GAW innaB, maybe wait on the helmet. It seems to be filling in nicely. Darker hair seems to give the appearance of filling in quicker. ",
      "MessageIndex": 1790,
      "PostDate": "26/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 28, 2018 06:31PM DebAL wrote: hi everyone, InnaB please let me know how your integrative appt goes tomorrow! Did you have a long history form to fill out too? Frog you are stunning! As time goes on I do think people mean it when they compliment. So we need to learn to accept them. My intentional doo is getting out of control at times. I use a taffy type gel that helps. Just letting it do its thing. GAW, that many veggies is tough for me too. May take urdragos tip on juicing. Ingerp, beautiful! Your color is so pretty and yes I see the beginning of the \" bending\" of the hair. Curls to follow! Urdrago..I just saw your link and will read. Hope you all have a good night",
      "MessageIndex": 1804,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 16, 2018 11:54PM DebAL wrote: hi everyone, Robin please give a quick update on your son when you have a minute. As he gets better I hope you become less worried if there is such a thing. Going back to what Frog said about concentration and struggling to find words. That's me! The words eventually come to me with just minimal delay for the most part. As far as memory I still honestly question whether I listened in the first place. I told my husband if there is something important make me repeat it. There has not been one time..so far..that I've forgotten. Otherwise, I'm probably not really listening! Ingerp your hair looks great. Duffy, hope you are enjoying Florida. Engine, I agree with innaB. Look into the hyperbaric oxygen therapy with your insurance company. High dose vitamin C also promotes would healing. I've seen several threads on that so maybe it's worth searching. I hope janice is doing ok at work and that it's not too stressful. Maggie, hope you are doing well. I'm having my final fat grafting this Thursday. Urdrago, you are cute as a button! LIFE, hope all is well I apologize for missing anyone. Hopefully everyone is feeling ok, getting through rads with minimal side effects. I would expect that is pretty draining. Have a good week! ",
      "MessageIndex": 1893,
      "PostDate": "16/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 26, 2018 03:41PM DebAL wrote: duffy, most gorgeous pic..EXCEPT for the shirts! No doubt 'grandma to be urdrago' will chime in with her support of your attire choices. Beautiful family! Your hair looks great. You know temporary color was great. Timed it for a wedding but it's just that, temporary. Lasted 3 weeks at most. What I noticed..and confirmed with honest co workers..that the more hair I have the less gray is noticable. Before it was more the primary color. Now it's more brown with gray highlights. Believe me, I'm no beauty but I'm good with just letting things be as they are. My hair is so healthy, soft , feels so good I hate to use permanent color just yet. I know i eventually will. Plus my curls are out of control right now lol. Its definitely about what makes you feel best! You look great! I'm glad you had such fun time with your family!",
      "MessageIndex": 1923,
      "PostDate": "26/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 6, 2019 12:51AM DebAL wrote: morning everyone, Beautiful lid InnaB! You look great. Mine is curly a bit out of control. I can make mine look like Don King if I try. Lol. Once it gets going it really seems to take off. Urdrago, I hope you get some relief with your skin issues. Congrats on finishing rads. Cut your self some slack as far as the energy goes. Dont be discouraged. Even a day here and there of being less tired is progress. Hang in there. Howz the baby? Linda, how are you doing? Robin, please give an update when you can Hope everyone is having a good start to the new year! Deb ",
      "MessageIndex": 1971,
      "PostDate": "06/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 17, 2019 08:23PM DebAL wrote: OMG BEAUTIFUL!!!! You are one hot granny!!",
      "MessageIndex": 2032,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 19, 2019 01:00PM DebAL wrote: frog, Great to hear from you. You are absolutely stunning!! Glad you are doing well and enjoying time with your family. Safe travels! Deb Duffy, sounds like a good day! We only have rain so far. Still a nice day to stay in jammies! ",
      "MessageIndex": 2045,
      "PostDate": "19/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 26, 2019 03:34PM DebAL wrote: hi everyone. Wow so much to catch up on. InnaB great news! And lol yes, hubby shall not divert attention from your plight! Urdrago. What a bummer. I'm so glad you are feeling better. I do hope it was a bad week and my goodness. That's what panic buttons are for. Just better to be safe. Uneventful going forward. Welcome krissy! Hang in there. This is an awesome group! Engine, glad janice is doing better. Sorry if I missed it. How is she holding up with her job? Duffy, nurse debbie 'duh' here lol Are the percentages you speak of describing your heart function? Cold in ohio too and even colder next week. Hubby and I are escaping to south beach for 5 days in February. If I'm not frozen first. LIFE, sorry about your coworker. Cancer seems to be everywhere. I took care of a 32 year old guy..in for port removal so it was a good day. Colon cancer. Father of 4 including triplets. I pointed to my poodle head and told him I could relate. I'm serious, when people fight for parking spots at oncology offices there is a serious problem. He knows 3 other young men diagnosed recently. I just dont understand it. He was very upbeat and ready to get back to his life. I still feel like the tin man in the wizard of oz ( on arimidex) by the evening. I go so much ALL day long that once I stop to rest then try to get up again my body is like WHOA. I honestly dont think cold weather helps either. I need to start bringing my oil can to yoga class lol I hope everyone else is doing well too. 2 more shifts of my alarm waking me at 3:15 am. More than ready for my new job. Job stress on a 10 scale went from a 9 down to a 1. I'll take that. Take care everyone. Hugs , deb",
      "MessageIndex": 2071,
      "PostDate": "26/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 28, 2019 02:20PM DebAL wrote: engine, I'm so sorry! Good call by everyone at the retreat to seek help. Best wishes, deb",
      "MessageIndex": 2084,
      "PostDate": "28/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 29, 2019 07:50PM DebAL wrote: hey engine, how is janice? That's too bad about the McDonalds incident. Try not to dwell too much but focus on the fact others did recognize she needed care. I would think an adult manager would see she needed help but who knows maybe it was a kid at the counter. Rehashing and reflecting is tough. Dont do that too much. You are so right. It could have meant surgery. I'm sorry you are going through this.",
      "MessageIndex": 2087,
      "PostDate": "29/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Mar 5, 2019 05:47AM DebAL wrote: morning all, Duffy, glad you had a wonderful trip. Keep us posted on your MRI. Frog, yes, would love to see your hair. My curls are everywhere but I think I have enough to try a flat iron to straighten them. Just not sure I feel like fighting it. I laugh at myself because I'm due for a new driver's license pic this year..like it matters!!! I already get looks at the airport when they look at me then my license lol InnaB. Looks like your hair is \"bending\" I bet curls are coming! Engine, I hope PT helps Janice's shoulder. Hopefully they gave her home exercises too. GAW, I hope you have a speedy recovery from the exchange. It definitely takes time to get used to the permanent implants. I hope everyone is feeling well. Time to push this cat off my lap and get ready for work! Deb",
      "MessageIndex": 2197,
      "PostDate": "05/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 20, 2019 10:04PM DebAL wrote: Congrats Duffy!! Enjoy your trip! Ingerp, you are next!!! So happy for both of you!",
      "MessageIndex": 2379,
      "PostDate": "20/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 3, 2019 07:56AM DebAL wrote: morning everyone. I enjoyed my 4 hour nap. And also glad to not have that \" outside of body\" feeling that worrying causes. Krissy, graduation will be that much more special and sweet next month. Congrats! GAW, how is your incision healing? And when is your birthday? Ingerp, I agree. Hanging out with adult kids is so fun. I love when it works out but understand when it doesnt. Your hair looks great. Love the color. I'm glad you accepted the chemo bag. My mind now tends to go to the meaning or intent of the giver. You are obviously special to them. It probably took some time to get it together. How thoughtful. Duffy, beautiful pic and glad you had a nice time with your family! Urdrago, cant help but chuckle when I picture u in the midst of the NFL draft and marathon mayhem lol sorry if I missed it but hope all in well with your CT. Batata, congrats on being portless. Did it go ok?so glad you had good news with your testing. Innab, so sorry about your job. Ugh. That's tough after 19 years. LIFE, what did you mean about your socks? Swelling? Your comment about the curly hair weighing down was timely. I had a hair appt and stylist said if I'm committed to growing out my hair she doesnt want to cut. I need to be patient and eventually curls will weigh down. Part of me like thick and curly hair. I didnt have that before. A wavy bob length would be nice. We have a friendly lawn mowing competition here too lol Frog, simply gorgeous pic. Wow, where in Europe? I tend to stay back when hubby's business trip are in boring places lol. But I am taking along to anaheim, ca in september. Just go with the messy look. I have a product that i put in at the very end that tames the curls. Air drying helps. I also bought a diffuser for when I do dry Linda, hope you are doing well. Engine and janice? I only went back a page or 2 so I'm sorry if I missed anyone. Running a cinco de mayo 5k Sunday. Still absolutely loving my job. Heading to punta cana in 10 days. Inna B, didnt you just do an all inclusive? I hope it's a good day for all. ((Hugs)) deb",
      "MessageIndex": 2425,
      "PostDate": "03/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 2, 2019 08:07AM DebAL wrote: wow, am I behind on everything!! Staying busy is a good thing I guess InnaB I hope you are feeling better! Happy belated BD GAW. Always count on urdrago for a pic lol Adorable hair urdrago! Love seeing all the vacation pics Hitting the 1 year pfc mark tomorrow. Still needing a headband. I notice my hair straightening a little at the crown but I literally wash and go. Put in my taffy and air dry. Running 3 miles a day pretty regularily. The last 3 days and today have been walking 7 miles at a golf tournament here in town. If you flip on the TV this evening look for me! Lol I will be the one in a headband. Have a nice Sunday, hugs to all! ",
      "MessageIndex": 2519,
      "PostDate": "02/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 20, 2018 04:21AM DebAL wrote:",
      "MessageIndex": 6,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 30, 2018 01:50PM DebAL wrote: Hi everyone, I thought I would join even though I am 2 treatments in. I think it's nice to chat with others on the same regimen. I will be totally honest ... I had zero and I mean zero side effects with the first 2 treatments. Doesn't mean the next 2 will go this smoothly and I will be thankful for the 2 good ones I did have if that's the case. If I wasn't bald I would think they gave me water! In a nut shell, I take the steroids twice a day the day b4 and day after chemo. Infusion day I get an IV drip of steroid and anti-nausea med. I have needed nothing at home for nausea. Slightly constipated and take a colace for that. No diarrhea. I go in for neulasta shot the day after. I take claritin 2 days b4 chemo and continue for a week after chemo. No metal taste, great appetite. I do drink 6-16 ounce waters starting the day b4 chemo for about 4 days then taper off a bit. Treatments are Monday and I go back to work on Thursdays. Walk 3 miles a day even on chemo day. I did not do cold caps. Had my hair till day 23. I do hear that eyelashes and eyebrows fall out weeks after treatment over and some have nail issues. Not looking forward to that. I do not ice my nails so I guess I will see what happens once I'm through. I was told to take anti nausea med at first \"twinge\" of not feeling well and to try to snack frequently. I feel fortunate to have done so well and don't really know why. I just wanted you to know that it can happen. Be hopeful you will do well too and we all can have this behind us soon.",
      "MessageIndex": 168,
      "PostDate": "30/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 11, 2018 02:04PM DebAL wrote: hi everyone!! clareco , I hope you are feeling better. I'm sorry you were in the hospital. Did your MO change anything with your plan that may help you for your next treatment? I am headed in for #3 on Monday. I hope everyone has a good weekend!",
      "MessageIndex": 175,
      "PostDate": "11/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Feb 3, 2019 10:18AM DebAL wrote: one KT, I'm sorry you find yourself here. It's normal to have so many questions. You will find lots of good advice on this forum. You could also write your specific questions down and talk to a nurse at your infusion center. I was very fortunate and got through TC with virtually zero to minimal side effects. 2 days after treatment was my \"yuck\" day. Tired but couldn't sleep, hungry but couldn't eat, sad but couldn't cry. Just an off day. I kept a log for each round of TC. Hydrated well before and after treatment. I never needed the zofran for nausea. I felt fine. Be sure to take any premed as directed. You should be given some IV prior to your chemo. I did take regular clartin throughout chemo for bone pain with neulasta. I had no bone pain. Walked 3 miles daily including day of chemo. I found it very doable and just took day of and 2 days after then back to work I know you are scared but you may find it's not nearly as bad as you are thinking. Keep track of any side effects and when they happen so you can make needed changes on the next round. We are here for you. I will bottle up my experience and throw it your way. Take care!",
      "MessageIndex": 2,
      "PostDate": "03/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869662",
      "Title": "Starting TC chemo next week and need advice on meds OneKT OneKT"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 6, 2019 12:57AM DebAL wrote: agree with KB. I'm sorry for the added stress. Waiting is hard enough. Your high PR is in your favor. Lower PR drives your score up. Hang in there",
      "MessageIndex": 35,
      "PostDate": "06/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868774",
      "Title": "High Ki-67, but low grade and stage? evily Renee9487"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 15, 2018 02:53PM DebAL wrote: hello! Thought I would join in. First of 4 TC treatments 2 weeks ago. Zero side effects with the first one at least. Waiting for the hair to go but ready with wig and scarves. Trying not to worry about the rest of the treatments and enjoying feeling good. Lifting light weights, walked 4 miles yesterday and back to work. I have moments of \"forgetting\" I have cancer and that gives me hope that those moments will come more frequently in time. Best of luck to everyone! We will get through this!",
      "MessageIndex": 65,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 15, 2018 09:06PM DebAL wrote: leli, that made me smile! I'm glad you had a couple good days☺",
      "MessageIndex": 71,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 20, 2018 07:57PM DebAL wrote: Frog, bless her heart and yours💗 It is not gross at all! I could use the help with mine right now lol ugh. Who knows, she could have thought losing hair may hurt you. I would imagine it was comforting to her that she helped you. I noticed we started chemo at the same time. I'm trying hard to hang on to this hair through the weekend. I'm sure my 2nd treatment on Monday will knock the rest out. Positive thoughts for EVERYONE today💗",
      "MessageIndex": 108,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 24, 2018 09:13PM DebAL wrote: Hi Frog, #2 treatment went well. Walked 3 miles when I got home before a few days of rain here. Go for neulasta today and have my phone alarm set to take claritin. Ha ha. Hoping that's what helped last time. Mall opens an hour ahead of the stores so I will be a mall walker today ugh! I slip in an Aleve also. How are you doing with the shot? I hope everyone has a good day today.",
      "MessageIndex": 148,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 26, 2018 08:11AM DebAL wrote: I am 3 out of 4 in on TC so I can't answer to long term effects of course. Agree, with okkate, no regrets. My number was also on the upper end of intermediate is why I chose chemo. I'm very, very fortunate with no side effects",
      "MessageIndex": 6,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864856",
      "Title": "Do you regret doing Chemo? GreenEyes81 Zenmushroom"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 14, 2018 06:54PM DebAL wrote: FD, good luck with your treatment tomorrow. Mentally prepare but at the same time be hopeful it will go as last time!!. I agree, the pain on the scalp hurt so much it was a relief to have most of the hair gone in a way. I looked at it as one more step forward in this journey. Frog, congrats on your last A.C. treatment! I hope it is a good week for everyone!🙂",
      "MessageIndex": 329,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 15, 2018 04:47PM DebAL wrote: Marie, my 3rd TC was yesterday and eyes are fine. Good idea to ask onc tomorrow. Engine, great your wife is going home. I was hoping they were ruling out c diff. Enjoy your evening at home and I'm glad she is feeling better!",
      "MessageIndex": 340,
      "PostDate": "15/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 16, 2018 06:48AM DebAL wrote: Engine, ha ha! NASTY! But it's good they covered that base. The big D sure wears you out. I hope she gets some rest in her own bed and feels better tomorrow!",
      "MessageIndex": 343,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 21, 2018 03:39PM DebAL wrote: Duffy, I'm so so sorry about your dog. Are you convinced due to the timing of symptoms? Pets are like family and another support system for us. I'm sure your heart is breaking. I'm assuming on antibiotics in case it is pneumonia? Thinking of you",
      "MessageIndex": 409,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 25, 2018 11:31PM DebAL wrote: Question, a friend will be getting A.C. x 4 then taxol weekly x 12 weeks. She's concerned about working. Will she be ok to work during the time she is getting taxol? Just wondering in general how you all did with side effects. Thank you",
      "MessageIndex": 462,
      "PostDate": "25/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 6, 2018 12:06AM DebAL wrote: Hi djt, this too shall pass is right. I just finished TC #4 yesterday - done!. 2 week break then will start arimidex. I assume you are getting steroid day b4 and day after treatment? Keeps me awake a fair amount over the 3 days. I am able to nap and at least I'm not wired and jittery. Hope all goes well for you today. Hugs!",
      "MessageIndex": 552,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 25, 2018 01:13PM DebAL wrote: FD, I was glad to see your post. As we start the \"downhill\" of completing chemo my focus changed a bit too. At first it's dealing with chemo side effects then starting AI's. I always cared about making a few needed changes to my diet but didn't have the mindset to focus on it for long. (3 weeks out from last chemo) Now I'm all about making a few changes and continuing my exercise routine. I bought the book that others raved about \" how not to die\" by gregor I believe. What I like is that it breaks down not just breast cancer but other diseases and conditions (hubby has heart issues) . It's a very interesting read and I even brought out a highlighter lol. Looks like you are on the right track. I'm glad you are on the downhill of chemo! Deb",
      "MessageIndex": 706,
      "PostDate": "25/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 22, 2018 08:12PM DebAL wrote: undrago, I believe the wait is to be sure chemo is out of your system to decrease the chances of infection. Take this time to rest when you need to, exercise if you are able, and nourish your body with healthy food. I know it's hard, try not to get too far ahead about how many surgeries. I know it seems like this will never end. I hope you are feeling well and let me know if I can help in any way.",
      "MessageIndex": 936,
      "PostDate": "22/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 23, 2018 07:05PM DebAL wrote: GAWarrior, yes, I take 81 mg. Figure I'm at the age where it will help my heart too. I can tell you what I know about direct to implant. If your skin integrity is good and you don't mind being possibly smaller you may be a candidate. I almost went that route but last minute changed to expanders; he felt more accurate placement of implant that way. I didn't care too be much bigger but didn't really want to be smaller than what I was and that could have been the case. I was instructed no repetitive motions after surgery and you may fall into that group in your profession. No pushing heavy xray head around!, pulling, or lifting over 10 pounds. I went back at 6 weeks but was still very careful about what I did. I decided early on that I will look out for myself and that nothing is worth potentially complicating things. Just not worth it to me. Should you find yourself down \"expander lane\" you may have a choice between choosing behind or in front of the pec muscle. Yes, more decisions but cross that bridge when you get there.",
      "MessageIndex": 954,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 12, 2018 07:31PM DebAL wrote: very well said djt. I feel the same",
      "MessageIndex": 1112,
      "PostDate": "12/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 17, 2018 05:55AM DebAL wrote: Good morning everyone. LIFE, good for you. I agree, once the scarf came off it felt a little odd at first but now it's just fine. The reaction I got from others was the same. You continue to rock it girl, I love it! As far as posting the pic..right above where u write a post there are little icons. On mine it's the 8th one over. Then choose file. After that it takes you to the pics on your phone. That's how it works on my end anyway. Urdrago, you look awesome too! We are all different when it comes to when it's time to lose the headwear. I have enough hair now that in a few weeks people may think I chose a short style. I hope this is a good weekend for everyone. I'm a week out from my exchange and fat grafting. Still super sore and bruised in the belly area. Hugs to all but not too tight lol",
      "MessageIndex": 1161,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 25, 2018 01:59PM DebAL wrote: hello again engine. I had a feeling with all Janice has been through that her activity tolerance is low but to be expected. It will get better. Time or keep track of distance on your next dog walk. Then add a minute or 2 or ..add a tiny bit further distance. I would seriously consider logging it for her. I could so see you doing that for her!!! That way you both will see progress. Even try to get her out again later today. You could log total minutes for the day..it doesn't matter how she breaks up the little walks as long as she gets it in. As she takes more pills and doesn't move she will feel stiff in the coming days or weeks. As she starts feeling better the log will help..it keeps us accountable. You will enjoy tracking her walks rather than those dang chemo side effects!! Keep me posted!",
      "MessageIndex": 1220,
      "PostDate": "25/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 26, 2018 09:48AM DebAL wrote: Good morning! Hi LIFE, doing well. I'm 2 weeks post exchange with another 2 weeks of lifting restrictions. Cleared to start stretching which is good. Thanks for asking. If you are going to PT maybe they can give you hand exercises to help. Ibuprofen daily to get through is fine but not forever as it is not the best for our livers. Arimidex can be tough and you aren't alone with the joint pain. I take a plain claritin since I took it to prevent neulasta pain with chemo. Keep checking the other boards for ideas. Have fun camping! Inna B, I am under the same understanding as you about the lymph nodes .We have 3 \"levels\"of lymph nodes. Each person has a different number in each level. Some surgeons will take a whole level or further if needed depending on each unique situation. So that is why we may see 2/23 etc. Someone else may have 2/15. I guess you just cant tell from that if it's all one level or into the second unless you ask since we all have different numbers in each level. Frog, when is your surgery date? I'm sorry you aren't sleeping and you are not complaining! My family called me Voldemort too. Especially when I do the \"hand\"thing. Now I am even passed the \"stranger things\"stage if you saw that. Lol. I looked like Eleven! If not , Google it lol You will get there. Urdrago, yes I'm driving. No drains with exchange surgery. I had 4 drains longer than I wanted with mastectomy. I had a few PT visits. I made sure I saw a PT that was qualified to do lymphadema screening too and I did get a sleeve. I don't wear it often but will wear it when I fly. I hope neuropathy and eye crust thing is improving. Ingerp. I understand the waiting for the hair. You will get there. Are u taking biotin or a nail vitamin? I'm very close to where people think I chose a pixie cut..not! Duffy, djt. Hope you are doing well. GAW, I hope you got some rest this weekend. I know a few of you are close or just started the AI's. You can pretty much bet on joint pain will happen to some degree. I cant stress how much moving will help and will give you the best chance of success. If you are moving faithfully and still having issues you can always switch to another. Unless you are dedicated..some of us are and some not..log your exercise for the day. Think ahead..and plan your walks/gym/runs whatever around your schedule. Logging will keep you accountable and with time you will want to fit it in. And to be honest we truly NEED to. Take care everyone and enjoy your Sunday!",
      "MessageIndex": 1231,
      "PostDate": "26/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 27, 2018 03:03PM DebAL wrote: hi everyone and thank you all for your kind words but InnaB's 'smashing' comment cause me to laugh and choke on my coffee this morning! Maggie, I hope each day gets better for you. I'm so glad a few of you have trips or getaways to look forward to. It's so refreshing just to take off and have something to look forward to. I'm glad for all of you! Linda, I so agree with your topless comment and you are spot on. I agree it does feel good! It is our own insecurities of how we view ourselves, not how others do. Sure, those \"other\" stares will happen but I honestly think they will be few and far between. I've found most people very kind. Enjoy your reprieve to strengthen your mind, body, and soul for your surgery. Grieving is normal I just think we all do it at different times during this experience. Ok, I honestly have probably less than a dozen pics of my self over the past 20 years but here is another. I'm 12 weeks today PFC. Hair is very thick. You all will get there too. I just happen to be ahead of you a little bit. It's hard to take a selfie of the back of your head too lol. Hope everyone is having a good day. ",
      "MessageIndex": 1246,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 11, 2018 07:12AM DebAL wrote: morning..flu shots...I thought we were done with decisions. Ugh. Those immunocompromised are at higher risk of the flu which unfortunately include all of us. It still would make me nervous if i was still in the midst of chemo and would have to have a serious conversation with my healthcare team about the best timing for the shot. I personally feel I am far enough out that I will take it. Our employee deadline at work ( hospital) to take it is Dec 1 to be protected during peak season even though its offered now. I would still consider your past experience with the shot also. The flu can be nasty and we don't want to be hospitalized for that.",
      "MessageIndex": 1359,
      "PostDate": "11/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 21, 2018 10:34AM DebAL wrote: morning everyone! Ingerp , you should pat yourself on the back, I'm patting you too!! Good for you! Frog, you are funny. I almost reposted after my original post. To say hair cut is a stretch. Its bed head and as maggie says scraggly hair lol. In no way am I ready to donate to locks for love just yet! I think I will feel better to have it shaped and highlighted. Its bending so I'm sure chemo curls is next. I hope everyone is having a good day. Deb ",
      "MessageIndex": 1450,
      "PostDate": "21/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 22, 2018 08:21AM DebAL wrote: Morning all! Engine, \"be prepared, don't live in the future\" so true. When going through surgery and chemo I felt like I was in that fight/ flight mindset. Focusing on avoiding chemo side effects and following surgical restrictions etc..you know..\"doing something\". For me, I find the thoughts of recurrence in my mind more now that things have settled down a bit and I'm just taking a pill. MO says this is normal. Thankfully it is not that obsessive worry but what I call normal amount of worry that I hope fades a bit with time as members that are ahead of us have said. Enjoying each day and pushing the 'what ifs' out of our minds is great advice. Some days much easier than others. I just don't want to look back and see that I've wasted time worrying when I could have enjoyed my family and friends. ( with that said, off to a college football game with my family!) I will worry when I have to worry. Today I don't have to but I know this could change tomorrow. Thanks for posting engine. Thanks again to everyone one of you. I think DJT once said even though you can't fully keep up with everyone we truly celebrate each others good news and support each other on the bad days. Inna B, did I see on another thread that you have tried acupuncture? If so, could you tell me about it..i know nothing. You can PM me if you prefer. Its offered through the integrative medicine service and I made an appt for next week. I hope everyone has a relaxing weekend! Deb",
      "MessageIndex": 1458,
      "PostDate": "22/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Oct 19, 2018 10:28PM DebAL wrote: morning everyone, GAW I will be thinking of you today. Hoping your path report is clear. Day by day. You know we are all here for support and any questions. Inna B and Frog thinking of you as you go through rads. I've not experienced rads to offer any advice. I'm sure it is draining physically and emotionally. Inna B I'm sorry for your loss. Frog, go topless when you feel ready. Urdrago and everyone that is having limitations with movement please consider PT. I had my drains 3 weeks with mastectomy which put me behind on the exercises. PT helped alot. My therapist said I came for treatment early and she wished others would too..rather than wait. Howz it going Maggie? I will know Nov 15th whether I keep my dec appt for round 2 fat grafting. I'm making my appt today for bra fitting at nordstroms . Engine. I hope Janice's job is not too stressful. I know you were concerned. It does appear immunotherapy is the direction of the future. Just to think of the possibility.of a vaccine is amazing. I just hope it happens soon LIFE, congrats on the end of rads. It could be the anastrozole affecting your labs. Ask at your next appt. There are 2 others you can switch too. It seems to never end sometimes I know Ingerp, try your best to not focus too hard on the side effects of the AI. I had to make a conscious effort to be aware of the major side effects only and will deal when or even if they occur. I've been on arimidex for 4 months. My joints are stiff but movement helps and the stiffness works out quickly. Returning to yoga today. I take calcium and vitamin D also. I do have 2 pretty intense hot flashes at night but I did that with chemo too. No nausea, weight gain so far. I take mine in the evening. I also take a claritin at the same time. I was on it during chemo to help with bone pain from neulasta and with permission stayed on it. I dont want to stop the claritin to find out. I'm sure you have had your dexascan to see your baseline for osteoporosis. However, some do have major side effects. Give it time but by all means do not be miserable. There are 2 others to switch to if needed. Just dont talk yourself out of it before you try it. Duffy, djt, and ALL I have missed I hope you are doing well. Well, I actually dropped my work schedule to 2 10 hr shifts per week. VERY stressful job but I can handle anything 2 days a week. On a 3rd day I work in the fitness center helping with cardiac rehab. Love it. There was no doubt job stress was the #1 modifiable risk factor for me. Alarm going off at 3:15 am everyday is over. Slept till 6am today and feel great. Heading for a walk then yoga. Had lunch with a SIL yesterday that I haven't seen in a long time. Really nice to reconnect with her. That's what life is all about. Try to do something everyday or spend time with others that 'fill your bucket' . It makes for a better day.    ",
      "MessageIndex": 1641,
      "PostDate": "19/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 21, 2018 12:06PM DebAL wrote: hi everyone! LIFE I hope you get your test results soon and sending good vibes your way for good results Duffy, good one about the gray hair! Lol. Urdrago there is still time for you to add some scarlet to your hair too! It's funny to know we will be rooting against each other. Thinking about 20-25 at my house for the game Saturday I wish you all a wonderful Thanksgiving with your families. I'm thankful to each one of you for being here for me over this past year. Your support means so much. Deb",
      "MessageIndex": 1776,
      "PostDate": "21/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 27, 2018 06:43AM DebAL wrote: LIFE, looking great! We are in the same place. Hair has a mind of own! Urdrago. I did not have rads to be of much support to you. LIFE gives great advice. I'm sure its draining. I'm sorry if I missed it but did you have PT for cording? You will get close to your \"go\" back. You just need to get passed this first. I'm ok with not being 100% I still tire easily early evening. naps are a necessity not an option anymore. Thanks for the juicing tip too. I remember the 10 year span where we lost every game. It's a fun time of year for us. Beautiful winter pic! Today is my terrific Tuesday. Slept in till 530, Meditated for 5 minutes, enjoyed my coffee. By the way there is a free app called 'insight timer' you can download. There is a map that shows all the people in the world that are meditating at the same time. Engines part of the country was pretty dark LOL I go straight to the timer and listen to the babbling brook for 5 min. It's a start. I will have time for the treadmill before working in our fitness center at the hospital at 10. This helps so much to feeling more balanced. I'm babbling like the babbling brook now! I hope everyone has a great week. Thankful again for all of you, deb ",
      "MessageIndex": 1796,
      "PostDate": "27/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 30, 2018 06:24PM DebAL wrote: hi everyone, Thanks for sharing the recipe engine! I'm having a few issues with nails again. They were looking good for awhile but I believe it goes in cycles. A couple of weeks ago I went to put on mascara but barely any eyelashes on my left eye lol. This too shall pass LIFE, I seriously love your attitude. Your suit also reminds me of the robot in that lost in space show from my childhood! I sure hope it helps you. You hit the nail on the head about memory and being the center of attention. I'm a nurse in a very busy preop area. Being in charge is like an air traffic controller in the medical profession. People at the desk, phone rings non stop, patients, families, anesthesia,surgeons ,19 OR rooms. I still do well but not like I used to with all of the stimulation. Waay too much going on. I can multitask 3-4 things but not 8+ issues at once like i used to. I know people may have to repeat things to us but we really need to ask ourselves ....were really listening in the first place? Probably not! We are just fine! lol Hi maggie. Good to hear from you. yes having just fat grafting above non cancer breast for a dent on 12/20 Also more rippling as things have settled but mainly when I bend down. I could live without the 2nd grafting but PS says easy fix, not near like last time..so he says. I was diagnosed in January so all treatments fell in this calendar year for deductible. I'll just see this through. I wasnt kidding about making a change. Today was debbie day lol. Took breakfast to a friend that just had surgery, got on my treadmill, on to yoga, shopped for an hour then accupuncture. Then I napped. Dont feel the least bit guilty. I'm over that. I hope everyone has a nice weekend and that you make time to do something for yourself. Because if you wont, I will!! Hugs.Take care, deb",
      "MessageIndex": 1822,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 2, 2018 09:00AM DebAL wrote: morning all! Duffy and Maggie, you guys definitely need to meet. GAW and I yacked like we knew each other forever! We all have the same connection. You honestly dont know when paths may cross. Thanks for your kind words maggie. I've tried. I struggled with backing down from a position I loved but knew was just not good for my overall health. Coworkers so supportive and appreciative, I'm still a resource for them. I feel like my mind was in a bee hive after chemo is the best I can describe it. I surrender. Waved the white flag. I go back to the biggest take away from integrative appt...\"fight or flight mode is for emergencies only\" We should not be living our daily lives in that state. And I was for 8 hrs a day which left me for no reserve when I got home. I hope your recovery is going well. Things definitely keep settling dont they? InnaB, how did your integrative appt go? Ingerp, let us know if you get response from the other thread about the eyelashes. Maybe those that are out of chemo alot longer than us will chime in. Right now I'd say mine are shorter than before. Nails acting funky now too so I think I'm in one of those 'cycles'. Beautiful day here today. Going to the zoo to see Christmas lights this evening. Hope everyone has a great Sunday. Deb ",
      "MessageIndex": 1826,
      "PostDate": "02/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 26, 2018 12:33PM DebAL wrote: Keep us posted urdrago! How exciting. GAW, enjoy your last few days with Bryce. I'm sure you have very mixed emotions about leaving. LIFE, last round of fat grafting. Sore and bruised but a bit easier than last time. I had a dent above non bc implant. Almost was going to let it go then decided what the heck, see it through. PS said the skin had adhered to the implant and causing the dent. He took a letter opener like tool to separate. The implant wasnt gliding under the skin like it should. Needless to say, I'm glad I went through with it in case it would have caused problems down the road. I had a temporary color put on once beginning of November. Only lasted 3 weeks. I cancelled Dec appt. Hair is thick and out of control curls but it seems I have less gray. I'm still just going with it but probably need to finally get it cut in January sometime. I hope everyone has a good short week. My wish is that 2019 will be good to all of us. Deb",
      "MessageIndex": 1920,
      "PostDate": "26/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 27, 2018 08:00PM DebAL wrote: Linda, glad to hear the trial is going well. I agree with you, it's so nice to have periods when we arent dwelling on BC. Hopefully those periods stretch out longer for all of us. Good for you on the piercing and doing something for yourself! Urdrago , wow she is beautiful!!! Congrats. Thanks for sharing. You must be on cloud 9. I hope your collar bone heals quickly. Ouch GAW, so happy Bryce is feeling better. It's difficult to leave but I'm sure you are also ready to get home. You have been through so much. I hope everyone is doing well and having a good week. Deb",
      "MessageIndex": 1927,
      "PostDate": "27/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 2, 2019 04:13AM DebAL wrote: wishing everyone a happy and healthy 2019! I appreciate being part of such a wonderful group. LIFE. back to your weight gain and arimidex question. I dont feel weight gain is a given but I think it will take extra effort. There is a 'doing well on AI ' thread that has discussed this topic. Several have done well at keeping the weight off. Have a good day everyone!",
      "MessageIndex": 1960,
      "PostDate": "02/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 15, 2019 07:08AM DebAL wrote: hi everyone, flying through the last posts before I head out for the day. LIFE we look like twins. Can you hide an egg in your hair too? Ingerp thumbs up looking good! Duffy, simply adorable. When is your sons wedding? You have no worries there. InnaB and urdrago please give an update when you can. Hugs, deb  ",
      "MessageIndex": 2020,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 20, 2019 08:06AM DebAL wrote: urgrago lol I cant wait for my birthday in August You dont have him shoveling snow like that do you? I feel restless this weekend. It's just weird. I'm usually not big on remembering dates. But this is my one year diagnosis weekend. I recall already being told I most likely had BC from fridays biopsy. In shock, sad, scared. Got the actual call on Monday which would be tomorrow. I was laying on the couch, phone rang. Cat was on my chest facing me which had never happened. She always faces away. Picked up the phone and got the confirmation. Hung up. She just kept staring at me purring with her big eyes almost to try to comfort me. Oh well, sorry for going down memory lane. I've come along way and despite BC I'm thankful for so much. Especially ALL of you. Hope everyone stays warm today! Hugs deb",
      "MessageIndex": 2051,
      "PostDate": "20/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 31, 2019 10:16AM DebAL wrote: good news engine. Her \"head\" needs to rest also even though the bleed is small. No straining at her computer or stress on her mind etc Good to hear from you maggie. I hope everyone is doing well. Deb",
      "MessageIndex": 2095,
      "PostDate": "31/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Feb 2, 2019 08:47AM DebAL wrote: morning everyone. Looking away from the IV is best if there is any doubt. I dont recall my infusion center using a numbing agent but we use it in preop which patients love. Many patients dread the IV more than the surgery! Ingerp. Glad you are in the home stretch! Off to the treadmill. I hope everyone has a great weekend and enjoy the big thaw! Deb",
      "MessageIndex": 2102,
      "PostDate": "02/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 2, 2019 02:36PM DebAL wrote: hi everyone, thankful to report I'm the proud owner of a 1.5 cm ball of scar tissue. I'll take it! Off to nap. Not much sleep the last few nights. Zzzzz. Looking forward to catching up on everyone!",
      "MessageIndex": 2419,
      "PostDate": "02/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 3, 2019 01:18PM DebAL wrote: urdrago, ",
      "MessageIndex": 2430,
      "PostDate": "03/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 11, 2019 07:51AM DebAL wrote: urdrago, I really dont have the answer. The waves of fear can be very intense. When you asked how we all get past cancer I dont know that we ever really get past it but live with it. My hormone receptors were so low on oncotype that I was very close to triple neg. With other auto immune conditions I cant help but think bc is another way my body is turning on me. We all have different ways of coping. I hope your good periods out weigh your periods of worry. Hugs to you my friend. Looking great LIFE. Hope you enjoyed your pampering. Inna B I wish you could go with me. We leave tomorrow. GAW, yep on the headbands Happy Mothers day to all. Enjoy your weekend. Hugs ",
      "MessageIndex": 2460,
      "PostDate": "11/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 19, 2019 10:17PM DebAL wrote: congrats ingerp! Hope to catch up next week. Enjoy your Sunday everyone!",
      "MessageIndex": 2490,
      "PostDate": "19/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 30, 2018 06:01PM DebAL wrote: jmora, I'm sorry you are going through this. You will find much support here. Once you get your plan together and get started you will feel a little better. Its alot to take in and absorb. Hang in there. You are not alone in this. Big hug to you.",
      "MessageIndex": 19,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868510",
      "Title": "Mammogram scheduled Jmora22 Dani444"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 15, 2018 07:33AM DebAL wrote: Faithsmama, How are you feeling now?",
      "MessageIndex": 1676,
      "PostDate": "15/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 26, 2018 10:40AM DebAL wrote: just curious..do those of you that had oncotype s find that it decreased the results from your path report? Meaning..i was 100% ER, and 3% PR at first. Then i looked at oncotype graph and for being 100% I should have been off the chart to the right but I was not. I was midway on the chart. So i take that as not as ER positive as first reported?. Of course it lowered me to PR neg which I expected. I guess it just gives a more detailed report or maybe it's a different form of testing than the staining altogether, I don't know. It doesn't effect my treatment it's just me trying to understand my disease!",
      "MessageIndex": 13,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864856",
      "Title": "Do you regret doing Chemo? GreenEyes81 Zenmushroom"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 15, 2018 06:11PM DebAL wrote: Djt, I got my wig at a local breast cancer shop affiliated with my hospital. I purchased several scarves from headcovers.com. I really like their scarves and they do carry wigs. I did splurge and get a real hair wig. Luckily I'm a nurse in a surgical services dept where everyone wears head covers anyway! Not planning on wearing the wig to work much. When is your first treatment? There is just so much to think about at first! Best of luck to you!",
      "MessageIndex": 68,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 17, 2018 07:21AM DebAL wrote: Maggie and djt, I take claritin the day before, day of chemo up till about 10 days out. I take an Aleve one a day for about 3 days after the neulasta shot. I have been lucky, no side effects with anything. Walk 3-4 miles a day throughout. I do drink a lot of water. I honestly wish I knew how I got off so easy with this. Wishing everyone better days ahead and less side effects. Hugs",
      "MessageIndex": 369,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 19, 2018 04:23AM DebAL wrote: hey engine, remember sniffles and sinus discomfort and pressure are a side effect of the cytoxan too. Claritin also helps with that in addition to neulasta bone pain. I agree, I wouldn't think a slight cold would not stop a treatment. I guess you may not know exactly what caused the fever but you do know what they were able to rule out. I hope your wife is feeling better and she has a better weekend.",
      "MessageIndex": 386,
      "PostDate": "19/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 22, 2018 12:15PM DebAL wrote: Falcon (karen), I am so sorry your first treatment was so rough. I am also on TC but it seems the pre- meds and prescriptions / instructions for managing side effects differ for each of us. Are you getting the neulasta shot the day after chemo? It seems that side effects hit day 3-7 for most. If you are following the instructions that were given to you and you are still feeling bad I would contact the office. Also, consider keeping a daily log of your symptoms the first week. That way you can duplicate the good things and change what didn't work for upcoming treatments. I will be glad to share what works for me if it could help you. Just send me a private message. I hope you feel better soon.",
      "MessageIndex": 430,
      "PostDate": "22/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 31, 2018 05:28PM DebAL wrote: Hi Engine, glad your wife is feeling better! Hopefully she can enjoy this upcoming \"off\" week before her next treatment. Is she up for getting out for a walk? My last TC is Monday. I'm planning on waiting a good week or 2 to detox from chemo before starting arimidex if it's ok with my MO. Just want you to know how i admire how much you are supporting your wife. I know it's not easy for you. Just the fact that you seek advice and support here shows how much you care for her. I hope you are taking some time to be good to yourself too because you deserve it.",
      "MessageIndex": 509,
      "PostDate": "31/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 27, 2018 09:43AM DebAL wrote: GAWarrior, you will be proud. All clear at my dentist appt today! And don't be jealous about the hair. I still look like my dad! It's been coming back throughout treatment. I'm filling in my eyebrows now. Prepared for the eyelashes to still go. Di, I took 8mg of dexamethasone the morning and evening b4 and after treatment, only thru the IV day of treatment. It kept me awake but thankfully not wired or jittery. I didn't have the least bit of nausea during my TC treatments. The day after the last steroid I just felt blah. It still seems a bit weird to just be worrying about remembering a pill. Still early, but so far so good. I hope everyone has a nice evening!",
      "MessageIndex": 722,
      "PostDate": "27/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 17, 2018 09:16PM DebAL wrote: LIFE and djt, I have been on my anastrozole for a month and so far so good!. Others that have been on it awhile insist exercise is key. I am back to my normal exercise routine and feel great. Some take glucosamine/ C to help with joint pain and I will if I need to. I actually just continued with claritin ever since chemo. Discussed with MO, if it works for neulasta pain hopefully it will help with this. She was fine with me staying on it. I had hot flashes on and off throughout chemo, still do , so I don't think it's the med. I take mine early evening and so far so good. Congrats on finishing chemo!",
      "MessageIndex": 898,
      "PostDate": "17/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 20, 2018 07:05PM DebAL wrote: Hey DJT, it's been awhile! And I am right there with you and LIFE, I'm on thyroid medication too. I am not sure if it is the pill or the estrogen as fair as the hair goes but remember it's not always a given we will have that side effect. I heard potential sleep issues so I take arimidex around 6pm. I recall I am out further from last treatment than you but are you noticing any hair growth? I'm 7 weeks out this Monday and doing good in that area so far. My bone scan had a comment \"young normal\" which made me chuckle. Maybe visit a few of the other AI boards and see what others are doing for joint pain. Many seem to take glucosamine. I was already on the claritin because of neulasta after chemo so just stayed on it. May I ask how your energy level is and how active you are right now? If you are not where u feel you should be yet I would want to do anything I could to prevent the joint pain. Exercise exercise exercise is a recurring theme you will notice. Figure I will find out in 5 years whether I go for another 5 or not. I hope you are doing well. Hoping for minimal side effects and uneventful weekend for everyone! Hugs",
      "MessageIndex": 926,
      "PostDate": "20/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 2, 2018 08:08PM DebAL wrote: ",
      "MessageIndex": 1045,
      "PostDate": "02/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 10, 2018 11:09AM DebAL wrote: morning everyone, I was awake all night too. Too bad we all aren't neighbors and you could have come over! Exchange surgery went well yesterday. They gave decadron as part of an anti nausea cocktail so I'm sure that's why I was awake. Chest and belly pretty bruised and sore. Need to wear abdominal spanx for 4 weeks due to the fat grafting. In August, wonderful. I hope everyone is doing well. I'm looking forward to keeping up with you all a little more since I took some extra time off work. I'm so glad everyone is winding down with this part of treatment. I wish I could hug each one of you in person.",
      "MessageIndex": 1099,
      "PostDate": "10/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 26, 2018 03:03PM DebAL wrote: hi ingerp, I get the sprinkling of longer hairs!. I had the same and i will attach a pic. I was exactly 7 weeks out from last chemo and you can see the long hairs when you zoom in. I'm coming in dark with more gray than before and you are a blondie so it may seem to take longer to cover the scalp. I used nioxin shampoo throughout chemo and still do. Just be sure you are using one that keeps the scalp clean so the hair can come through. Everyone is different as to when the right time is to lose the headwear. I probably felt comfortable sooner than most. I worked with a girl years ago that had her chemo curls poking out of her wig. She could barely get it to fit over her head. She finally ditched it soon after. I would look constantly too just like you are! Now I'm actually washing hair. It's coming in pretty thick but too short for chemo curls just yet. GAW. Glad you are feeling better and going thru with the next 2 treatments! ",
      "MessageIndex": 1234,
      "PostDate": "26/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 28, 2018 07:50AM DebAL wrote: morning all, Duffy, good luck with your first H, getting that port out and preparing for the temporary Michigan move. How far is that from home? GAW, so agree about how this disease hits you later on. That's where I am now and why i thankfully could take a 'bonus' week off from work with this exchange. Once treatment slows down there is more time to think. It's hard to explain. Best of luck to you tomorrow and InnaB too. Seems like Wednesday is the big day for everyone. Healing thoughts to anyone that I missed. Djt, you are funny. It seems like I'm in a group if blondies! I was always dark so I'm sure that's part of why it shows up more. I've used the biotin shampoo to keep scalp clean and alternate a plant based hair and nails vitamin with biotin. My hairstylist was helpful in guiding me to the right products. Off to the trail then stopping into work to meet with bosses. Transitioning back to work makes me uneasy. Love my coworkers and my job. It's just very high stress and super fast paced. Iove that but know it's not the best thing for me anymore and that's difficult. Trying to find that balance I guess. Hope everyone is feeling well. ",
      "MessageIndex": 1257,
      "PostDate": "28/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 29, 2018 11:59AM DebAL wrote: Morning everyone, yay duffy you are portless today! Google mycancerchic when you are up to it. A beautiful young woman that has been through all this but she's still an inspiration to older gals like me. Let me know what you think. I love all of her hair styles. I can dream can't I? GAW, InnaB I hope today went well for you..and anyone else having appts today.🤗 ",
      "MessageIndex": 1264,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 10, 2018 04:54PM DebAL wrote: Libby. I'm sorry you are feeling so tired. At 3 weeks that's totally normal. Remember all this chemo is cumulative so right now it would make total sense that you feel this way. Be sure you are staying hydrated and rest when you need to. Consider talking to your onc about vitamin supplements. B complex is one that comes to mind. I was the exception to the rule and really didn't feel too fatigued. I still take a short nap everyday and I'm over 3 months out from chemo. When you do feel good, take advantage of the time. Otherwise just give yourself a break and a little more time. It will get better!! Drop in any time and congrats on being done with chemo!",
      "MessageIndex": 1349,
      "PostDate": "10/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 13, 2018 10:23AM DebAL wrote: Morning All! InnaB you look adorable! Congrats!!! Happy birthday LIFE! Duffy and GWA, hang in there. Our bodies go through so much. I'm tired of it to be honest Djt, urdrago, engine, ingerp I hope you are doing ok. Maggie, I have my exchange post op appt today I'm 5 weeks out. They put me on the books for a 2nd round of fat grafting in Dec for insurance purposes but I guess I will know today if that's a go. I'm still tender in the belly area. I've been stretching and hoping today I can get back to the light weights and start back jogging again with a supportive sports bra. Its hard to believe I've been wearing a bra to bed every night since Feb 12. Hoping one of these days maybe you dont have to? I never asked that question but it still wouldn't be comfortable just yet that's for sure. I'm still trying to get used to the feeling of having these implants . Take care everyone..",
      "MessageIndex": 1384,
      "PostDate": "13/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 20, 2018 05:27PM DebAL wrote: Duffy, you sure deserve some R and R! It was nice to catch up about everyone on your post as I have been a bit MIA myself. Still working crazy hours for 2 more weeks then I will be on more of a regular schedule. I need to practice saying no. I'm getting more used to these implants. Definitely takes time. I'm getting my first real hair cut and color next week. My hair is kind of bending different directions..guessing the start of chemo curls. I look like I have bed head all the time now. Not very attractive but oh well that's ok Happy belated birthday Inna B ! I hope everyone is on the upswing and feeling better. Hugs to each one of you",
      "MessageIndex": 1444,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Oct 8, 2018 09:00PM DebAL wrote: hi everyone, as soon as I would write \"April\" in the sand it would wash away! Thinking of all of you. We are in the middle of the hurricane path. Will ride it out unless mandatory evacuation and should have a plan in the morning. I hope everyone is feeling well. Looking forward to reading back a bit to catch up. Sending good vibes to each of you! ",
      "MessageIndex": 1572,
      "PostDate": "08/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Oct 17, 2018 08:41AM DebAL wrote: Hi strangers! I'm back and hope you all are feeling well. I plan to read back this evening to catch up on how everyone is doing. It was great to have some time away. Hard to believe all the devastation was only 50 miles from where we stayed. I think the sunshine and ocean air helped my hair grow too. For the first time this morning I actually needed to use the blow dryer for about 60 seconds. My husband was like..whaaat???? He had not heard that sound for 7 months! I'm heading to the basement to get on the treadmill. For those of you getting ready for AIs I'm sure you will understand. Moving helps. I'm starting to notice some joint pain but does resolve pretty quickly. Starting back to yoga Friday. Thinking of all of you and sending healing thoughts to everyone. ",
      "MessageIndex": 1627,
      "PostDate": "17/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 16, 2018 11:46PM DebAL wrote: urdrago, OMG. SERIOUSLY??!! You look like a model!! Vogue magazine should be calling you soon. I think most will agree those spinning bad thoughts are worse at night. I've always wondered why. I hope that the stretches of time that you dont think of this disease gets longer. I remember when I went back to work on our busy unit 3 hours later i thought \" wow. I totally forgot\" i also had a great run on the treadmill not too long ago. Listening to good music, sweating. I hopped off and got choked up because I felt like my old self. I hope rads brings you zero or only minimal side effects. Maybe a week from today we can share pics in our game day gear! We have had an annual party for well over 20 years. Now that the game falls on Thanksgiving weekend it's down to about 25 friends..and that's a good thing! LOL",
      "MessageIndex": 1762,
      "PostDate": "16/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 17, 2018 08:52AM DebAL wrote: ingerp, I totally understand. I love my breast surgeon. Shes been through breast cancer herself and you cant imagine how it is to be under the care of a physician that \"gets it\" . Luckily, she operates once a week and I pre-op her patients. I get a big hug from her once a week. Cant imagine going through this without her. InnaB...care less..hmmm. that's sounds good. I'm doing ok so far but if I find I'm not I will not hesitate to ask. Engine, wow. This continued news of the fire is truly devastating. I hope everyone is feeling well. Deb",
      "MessageIndex": 1769,
      "PostDate": "17/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 24, 2018 01:59PM DebAL wrote: hey urdrago and duffy!! No plant based diet today. Still love you both GO BUCKS! ",
      "MessageIndex": 1782,
      "PostDate": "24/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 4, 2018 06:26AM DebAL wrote: morning everyone, Engine, that's tough. I'm sorry but I dont recall Janice's profession but you have said many times you worry about her job stress. If their is any creative way for her to take even something SMALL off her plate? It may make a BIG difference. You cant come home exhausted...physically or mentally..and expect to have reserve left to exercise. Or eat right. All which contribute to chances of recurrence. It all ties together. Decreasing the stress may make a difference in other aspects of her life. Is there anyone at all she can ask? I'm sure she is very valued in her role. I feel for her..and you ..on this. I'm mad at myself for not changing sooner than I did. I'm very fortunate that the nursing profession provides so much opportunity. Not everyone has the flexibility I have but something had to give. Thinking of you both GAW good luck Friday. I'm sorry you have this thrown in the mix too. Im sure you know but these surgeries are not difficult, just tedious, sometimes lengthy. Not so much lengthy if pathologist is on site. Maybe you want to get your holiday photos first GAW. Either that or find a red nose and antlers for the pic. You are so darn cute anyway it wouldn't matter. Hugs and best wishes. Inna B. Best wishes at work. Let us know your day goes. Just clarifying..did you mean \"fasting\" when you mentioned restrictive eating? I'm very interested!. I did a 13 hr fast for around 3 weeks to drop the last few lbs after chemo. I felt better. Forget why I stopped. Like you, the weekends thru me off but 5 days a week was easy. There are studies out there that point to decreased recurrence chances with fasting. When you have time please share! I hope everyone has a good Tuesday! Deb  ",
      "MessageIndex": 1840,
      "PostDate": "04/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 4, 2018 11:36AM DebAL wrote: hi ingerp! Definitely do what makes you feel best! I heard the chemo curl thing peaks at 6-10 months. I'm 6 months PFC today. I'm letting my hair do its thing naturally and using the taffy to tame it down. I went in to salon with the intention of trimming around the ears. Then she showed me how to bring part of the hair forward and tucking the other behind the ear. Then it really started to curl up so it didnt need trimmed afterall. To be honest I have a feeling this may be my easier stage lol. I have a feeling more funkiness to come lol before it settles back to normal. Can't believing I'm saying this..I'm actually find it funny to watch my hair morph into whatever. Knowing its temporary makes it fun. Thankful to have hair and feel good. My friend has her old thin hair back after 13 years. She misses the thick , healthy hair she had after chemo. I will ask how long it took for her. Definitely play with it! Post a pic before your holiday party!!",
      "MessageIndex": 1846,
      "PostDate": "04/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 4, 2018 05:41PM DebAL wrote: InnaB, lol yes enjoy it while you can! IT people are so darn smart! It really will be good for you to get back to it, as crazy as that sounds. And dont feel guilty lol! Try to be patient about the hair. Darker hair sure seems to present itself earlier. If I recall your last pic you seemed fine! It's so hard tho. I constantly had my hands rubbing my head. I'm sure you are taking vitamins/biotin. A good clarifying shampoo is important. If you truly are concerned make a quick appt with a dermatologist. I'm with you 100% . fasting for 13+ hours works 5 days a week but weekends are challenging. It's all about balance. Engine, wow. How demanding. And I fully understand not everyone can make the changes like I did. I'm fortunate. All I can suggest is take advantage that she can work from home. Maybe she can sneak out for a walk on those days. Not going in probably gives her a few extra zzzzz's since she doesnt go in to work so that's a plus. I've always admired how much concern you have for her. You are awesome.",
      "MessageIndex": 1849,
      "PostDate": "04/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 11, 2018 09:41PM DebAL wrote: Robin, I've been thinking of you and your family. I hope each day get a little bit better. It truly is day by day if not hour by hour at times. I hope you are taking care of yourself as best you can under the circumstances. Not surprisingly, here you are, thankful to be healthy. Thankful to be in a position to care for your son. Finding something positive. Like you said, you could have been in the middle of chemo or recovering from surgery yourself. When we met I could tell instantly what a special person you are. There is no doubt your presence by his side is making all the difference in the world for his recovery. We are all keeping you close. Hugs, Deb",
      "MessageIndex": 1877,
      "PostDate": "11/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 7, 2019 05:23AM DebAL wrote: Linda, I'm sorry about the emotional struggles this stupid disease puts us all through. Like you said one day at a time is all you can do sometimes. I hope you beat your hubby at golf! Exercise definitely helps. Robin, Ingerp looking good! Just got off the treadmill. I would not dare go out in public like this lol. No color right now just letting it go. 7 months PFC. It's pretty unruley but not complaining. I hope everyone has a good day. ",
      "MessageIndex": 1979,
      "PostDate": "07/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 7, 2019 08:33PM DebAL wrote: Batata, I'm glad you checked back in. This thread is pretty strong and there is always someone here. Linda and urdrago, so many ups and downs. Just know we are here. Urdrago, I love it. Tomorrow will be better. Big hug to each one of you",
      "MessageIndex": 1986,
      "PostDate": "07/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 18, 2019 08:30PM DebAL wrote: that's crazy!!!  I dont know about you guys but my BS gives a better exam than my MO. GAW, just like you to take the time to help your friend.",
      "MessageIndex": 2042,
      "PostDate": "18/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 14, 2019 08:18AM DebAL wrote: Hi everyone, hope everyone is having a good weekend. I'm a bit behind on everything but urdrago I noticed your pic. Total badass. You look great. I'm now in the headband stage..you know \"the let's get physical- olivia newton john phase\" lol. Thankful its growing. I love seeing everyone's hair pics. My friend that made it 25 years did chemo, triple neg, and had her diep this year. Shes walking the neighborhood and doing great. A true inspiration. I dont think we were informed 25 years ago as we are now. She never worried for 25 years. Never a thought of recurrence so this was an absolute blow to her. She was never waiting for the other shoe to drop. There is a blessing in that in a way. 25 years of living your life and never giving it a thought. it was a family friend that was not as fortunate. Happy birthday duffy! Not sure a 13 mile is in order on this arimidex. But never say never. I've been on the treadmill until last weekend. Ventured outside on the first nice day not knowing what to expect. 10:30 mile for a 5k no stopping!!. I was in shock lol. I really felt like forrest gump. It was so nice to feel like the old me. GAW, keep me posted. We are traveling alot this year too. Those of you who know who flat stanley is..I just may show up! Moved my daughter this weekend so officially empty nesters. She stuck around these last 9 months after graduating nursing school to pay her student loans off but it certainly help me to have her around. Bittersweet. I think of all of you often and hope everyone is feeling well. What a great group we have. Hugs to all. Deb ",
      "MessageIndex": 2343,
      "PostDate": "14/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 16, 2019 09:05AM DebAL wrote: looking beautiful everyone!! It's only for special friends that I post a pic post workout, no makeup, messy hair... did I brush my teeth yet?? Lol ",
      "MessageIndex": 2362,
      "PostDate": "16/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 29, 2019 10:06PM DebAL wrote: hi everyone, my apologies again for not being more up to date but I do plan to catch up with everyone. I found a small lump along mastectomy scar. Non BC side about as far away from original tumor you can get. Should have an ultrasound scheduled tomorrow and on to MRI if inconclusive. Hoping its scar tissue. Doing ok, then waves of panic. You know the drill. Trying hard to stay busy. Hope everyone is doing well. Hugs to everyone, deb ",
      "MessageIndex": 2407,
      "PostDate": "29/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 3, 2019 10:42AM DebAL wrote: LIFE , nurse deb here and saying this with love lol. Cut back or eliminate the Mexican, steak, Chinese. Its packed with sodium. Try going back to your fresh fruits, veggies, and chicken and see what difference that makes. It would be awesome if this could be an easy fix for you! Enjoy your long weekend. You deserve it!",
      "MessageIndex": 2427,
      "PostDate": "03/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 5, 2019 02:56PM DebAL wrote: 5k 32:19 time. Not bad for 55 years old and 11 months PFC today. Screw u breast cancer! ",
      "MessageIndex": 2438,
      "PostDate": "05/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 19, 2018 08:45PM DebAL wrote: Angel, I work in a surgical pre op area. Patients are done mainly under MAC anesthesia for lumpectomies. Consider researching that a little bit. Anesthesia always prepares for general if need be. Without getting all medical on you it's mainly the difference in the airway. Please know the anesthesia team will speak with you prior to going back to surgery and will discuss anesthesia options with you. Best wishes.",
      "MessageIndex": 3,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/866708",
      "Title": "Lumpectomy withOUT general anesthesia Angel1109 beach2beach"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 14, 2018 09:16AM DebAL wrote: hi everyone, I went with BMX no regrets. Lump had been there roughly 3 years according to breast surgeon but 2 normal mammograms before the 3rd picked it up. I had very dense breasts and that was the tipping point for me. I was handed my final surgical report. It was surreal to read the description of my breast by the pathologist. Both breasts were 50% fibro-dense breast tissue. Wow..mammo could only potentially pick up breast cancer on half of each breast. Confirmed my decision for BMX was the best for me. We all make decisions that hopefully provide us with the least worry possible. Tough tough decisions for all.",
      "MessageIndex": 13,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867148",
      "Title": "Single or Double Mastectomy Advice?? Megsed kista"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 6, 2018 02:10PM DebAL wrote: 54",
      "MessageIndex": 866,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 11, 2019 12:38PM DebAL wrote: How are you doing Penny?",
      "MessageIndex": 15727,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 20, 2018 08:33AM DebAL wrote: Frog, I think you are handling things with your daughter perfectly. My own kids are grown but i have 7 year old twins next door that are like my own. We told them \"Mrs. Debbie\" will be taking some strong medicines that will make her feel not so good before I get better. One of them is a worries a lot, the other is a bit more mature for her age. Kids are so different but you will know what to say. I see them almost everyday. Preparing them for my hair loss..and boy it's happening! Ugh. You are not thinking too much, Mom. Throw in a Disney movie and snuggle💗 I just said the same recently, it's the meds that make us look sick, not the disease. I try to look at this as something I have to go through. We will get through this ladies. I hope everyone feels better soon.",
      "MessageIndex": 103,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 21, 2018 05:09AM DebAL wrote: leli, I lost half my hair in the shower this morning. Wearing a cap around the house so I don't get what's left everywhere till my 6pm buzz appt. Daughter and hubby going with me. I'm almost relieved to get this over with. When my daughter saw the hair in the shower she cried and said she is glad for me that this part will be over. Not my idea of a fun Friday night😕",
      "MessageIndex": 111,
      "PostDate": "21/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Apr 23, 2018 02:26AM DebAL wrote: GA Warrior, I hope the tinnitus gets better for you. I kept a pretty detailed log last time Hoping to refer back for tomorrow's treatment. Doesn't mean it will be the same but sometimes patterns do emerge. Personally, day of chemo is just that. I count day one as the the next day. That's just me. I go in for my neulasta shot the next day on my \"day 1\". Hang in there and get your rest since you are slow today. I'm so glad it's better than expected.",
      "MessageIndex": 127,
      "PostDate": "23/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 19, 2018 06:08AM DebAL wrote: engine, maybe others can chime in if they take claritin after the neupogen, I would assume it would help as it does with the neulasta. Maybe start the day before chemo then for 5 days or so. I take it for 10 days. Hoping for an uneventful weekend for all of us!",
      "MessageIndex": 388,
      "PostDate": "19/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 24, 2018 09:40PM DebAL wrote: Djt, keep us posted on how it goes today. There are definitely days where the line is blurred between laughing and crying. Engine, wow. I am so so sorry about your wife's experience so far. I don't know much about the neupogen but don't they sometimes give several daily doses if needed? Again, not sure if claritin helps with neuopogen as it does with neulasta but I can't imagine it would hurt her to take it. The last thing she needs is bone pain after all she has been through. I am glad she is feeling better! PS..does she have a PICC or a port? Sorry if I missed that",
      "MessageIndex": 451,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 24, 2018 02:40PM DebAL wrote: Hi everyone, just checking in on my April chemo group. It is weird to think if I wasn't done with my 4 TC that tomorrow would have been #5. It's been 3 weeks, hair is coming back which it sort of had started during chemo. Been taking arimidex for 10 days now with no side effects but only time will tell. I did breakdown and buy a morning and evening weekly pill container. I'm officially my mom now. It does seem strange, but good to have the chemo stage behind me. Still exchange surgery next month. I didn't go back real far in the thread but I did see raisin bran lol I ate it everyday!. It has a fair amount of iron in it too. I also broke down once and bought those small can of Prune juice and chugged one of those once or twice. I hope everyone is doing ok with minimal side effects and that you are able to enjoy some of your weekend. Hang in there and hugs to all.",
      "MessageIndex": 697,
      "PostDate": "24/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 22, 2018 08:41PM DebAL wrote: He did not define it ahead of time. I also read some institutions have 1mm others have 2 mm as the closest margin. I looked at my path report and the closest in my case was 7 mm.",
      "MessageIndex": 940,
      "PostDate": "22/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 22, 2018 08:57PM DebAL wrote: Yes I was told no radiation since nodes were clear.. I am not totally sure about radiation and implants. For some reason I thought I saw a conversation about that on another thread. If I see something I will definitely let you know. Have you had your surgery consult yet?",
      "MessageIndex": 942,
      "PostDate": "22/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 23, 2018 04:13PM DebAL wrote: DJT, there is nothing at all wrong with you. I am sorry that I cannot offer any advice since i did not do radiation. As a nurse, if you were my patient i would probably try to talk to you too. Once i picked up that you weren't up do it i would ask what i can or shouldn't do to help you get through this. Sometimes its hard to read someone's mind. Not much can be done about the necessary touching for the treatment but definitely the small talk. They can do what they need to and be done. Just kindly tell them what u want or don't want. Most in healthcare deal with patients on many different levels. Some will pick up on it, some will need to be told and that's ok. I know it seems like this road never ends sometimes. Take care and hang in there. You are moving forward.",
      "MessageIndex": 949,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 31, 2018 08:04PM DebAL wrote: Engine, I am so so glad Janice is almost done with chemo. She really has had a tough time. Reason to celebrate once you get her through this. Ingerp, wooley caterpillars lol! I still have a few lashes. I pleased with the hair growth. Even more thankful for feeling good to be honest. Truthfully I haven't felt this good in a long time. Looking back in the months prior to diagnosis I was dead tired. Then I heard so many others say they felt the same. Surgery next week and 100% ready. I hope everyone has a good evening.",
      "MessageIndex": 1029,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 1, 2018 09:20PM DebAL wrote: hi everyone, LIFE give it more time. Rest when you need to but also make time to walk etc if you can. Consider a B complex supplement. Can't believe it but I do have a weekly pill container for morning and evening. Mostly supplements and improving my diet a bit has helped. FD, I found a few good eyebrow fillers that don't look too bad. I draw mine in at 330 am lol. One day I went in to work with just one done! DJT, yes we all inspire each other without realizing it sometimes. GA, good news and I hope you slept like a baby! Sleep tight all!",
      "MessageIndex": 1035,
      "PostDate": "01/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 5, 2018 06:06PM DebAL wrote: InnaB, are you taking a B complex vitamin? Look into it if not and ask if it's ok. I hope you are feeling better soon.. hang in there",
      "MessageIndex": 1058,
      "PostDate": "05/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 14, 2018 07:04AM DebAL wrote: Frog, so happy you are done with chemo. I hope you have plenty of time to rest. I hope you have the energy everyday to take a walk and drink plenty of water and get that stuff out of your system. Consider in a week asking about some vitamin supplements. I take 1000 vit C daily the weeks b4 surgery and still do. I do think supplements continue to help me. GA, I also went the BMX route. I wavered a little bit which is normal but all things led me to stick with my decision. With dense breasts I could not deal with all the testing on the other breast. Fighting for MRI with insurance when mammos clearly don't pick up cancer is something I didn't want to deal with. Of course, cosmetically the results would most likely look better. Not sure where you are with things but maybe nipple sparing is an option on your healthy breast. I just had my final exchange and things look ok but still bruised and swollen. Flap surgeries were off the table for me anyway. It is such a personal decision. Just know it's normal to waiver a bit, it's not an easy decision. I must say, when I was handed my final path report ( very strange thinking pathologist was dissecting my breast) it was a relief that no other cancer was found in either breast. Very thankful. Had there been it would have confirmed my decision even more. One of those things you just don't know for sure unless you go with BMX . Continue to ponder and research. Hugs to all",
      "MessageIndex": 1130,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 14, 2018 09:04PM DebAL wrote: GA, I'm glad you are going the pre pec route. If you read on exchange city and the pre pec thread there are active women that are unhappy with sub pec due to animation deformity. That was one decision that was easy anyway. They can fill u pretty rapidly with very little to zero pain. You can follow whippetmom also. She has helped many women with implant sizing. Thread is implant sizing 101 when u are ready. I have mentor round high profile implants. Again, I'm a pretty small person. I maybe would have liked to have been a little bigger but I'm still ok with it. I'm here to help as you move forward. Sounds like u are in the hands of a great team!",
      "MessageIndex": 1138,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 25, 2018 01:19PM DebAL wrote: hi engine! How is Janice feeling? Regardless of which of the 3 AI's she is on exercise is the key to noticing the least side effects as possible. If you look through a few of the other threads it's a recurring theme. How is her activity level at this point? She has had a tough road. It will be upward from here. You just keep doing what you are doing by lifting her up. Take care, deb",
      "MessageIndex": 1218,
      "PostDate": "25/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 10, 2018 04:04PM DebAL wrote: Inna B and LIFE I'm a Virgo too! and I'm not just saying that to give urdrago more to do lol Ingerp, great news on the hair and hopefully Duffy is right behind you. Maggie, the whole color thing is weird. I'm coming in pretty dark black. At first there was more gray but now just silver highlights. I'm getting it highlighted at the end of the month before a beach trip. I've already told my stylist she better not make me look like Justin Bieber. I've gotten a lot of compliments on the short hair. I think I'm to the point everyone thinks it's a short style. I officially put away my wig and scarves yesterday. I wish I could say never to be used again but I know better. I got a little emotional when I tucked everything out of sight in the top of a spare room closet and closed the door. Time will tell. Frog, I hope your bruising is better and you are feeling ok. Engine I hope Janice is regaining her strength each day. GAW, I'll let you know how the integrative medicine appt goes. Duffy, I'm glad rads are going well. I went to PT for a few visits after mastectomy and will go for a few more visits after I'm cleared this Thursday from exchange surgery. It really does help. Djt, batata, I hope you all are doing well.",
      "MessageIndex": 1346,
      "PostDate": "10/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Sep 26, 2018 12:51PM DebAL wrote: hi everyone, Engine, how is janice doing? Did you look into the hyperbaric oxygen? One day at a time.. GAW, I dropped to partime when I come back from vacation. When I think about all the things that contribute to recurrence stress is the biggest area I need to work on. The job will still be stressful but I wont be there as often. InnaB, thanks for your info on acupuncture. First appt was this morning and I have a few more set up. I wont see the integrative medicine dr until November and I will keep you posted. I hope everyone is feeling ok and having a good week. I think of all of you often, deb",
      "MessageIndex": 1468,
      "PostDate": "26/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Oct 23, 2018 08:53PM DebAL wrote: congrats LIFE!! Enjoy your staycation. You deserve it! I hope everyone is doing well. GAW, I hope you are letting others spoil you while you recover.",
      "MessageIndex": 1659,
      "PostDate": "23/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Nov 16, 2018 12:05AM DebAL wrote: innaB, I just looked back through pics too. My hair is pretty dark. You are lighter correct? I think that makes a difference. I did still have some scalp showing at that point. It's so hard not to look for growth every hour. I went to accupuncture 3 times. Anything to help with focus is a good thing. It was strange. After the 3rd treatment I felt this unusual calmness after something that would normally upset me. I just felt balanced. Didnt over react like I might have. Could that be the accupuncture? I am definitely going to go a few more times regularly to see how things go. I'm bummed that my acupuncturist and my schedule doesnt jive right now but I'm determined to go back Keep in mind for those of you that work for larger companies. Most have and EAP. Employee assistance program. Mine offers 6 free counseling sessions. I think I may check into it. Why not. If you are at a place where you are down , more nervous etc than you feel you should be on a regular basis it's so important to seek help. I think we all find ourselves there at different stages when traveling this road. ",
      "MessageIndex": 1755,
      "PostDate": "16/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Dec 23, 2018 09:43AM DebAL wrote: hello...Just wanted to wish everyone a happy holiday season!. I hope everyone can spend it with those they love. Wishing everyone good health, strength, love, and much joy. Hugs, deb",
      "MessageIndex": 1913,
      "PostDate": "23/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 15, 2019 08:07PM DebAL wrote: great news urdrago! Uneventful days it is! GAW glad Bryce is doing well. No news is good news is right! Inna B hopefully you can get in a little sooner. Just a thought..Any chance your breast surgeon or maybe a PA in the office could see you sooner? Just to ease your mind. Dreary and cold here. Speaking of ..Frog...how are you doing?? Take care everyone!",
      "MessageIndex": 2024,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 17, 2019 05:44AM DebAL wrote: morning all Linda I hope your tummy settles down. I'm envious of where you live. So much to do! Good for you in keeping busy. I thought for a minute or 2 about picking up golf. Man, that hole is awful little. I'd probably be like my great uncle and wrap a club around a tree. I'll stick to driving the cart. If you follow golf tournaments we live close to muirfield. We are getting passes all 4 days this year. Come on out in May! As for the hair, my stylist had me put taffy on my fingertips and pull bangs down with my index finger and thumb. Otherwise they kept curling up. In your pic with robin your hair looked great. ENJOY your trip! LIFE. Job is perfect. Not doing it full time till Feb but I should be paying them lol. Lots of snow here this coming Saturday so i will watch that movie! Urdrago..\"no SE's\" innaB so glad you got in sooner. You dont need that extra worry. Have a great day everyone! Deb",
      "MessageIndex": 2029,
      "PostDate": "17/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Feb 24, 2019 08:13AM DebAL wrote: urdrago. I hope you get your results soon. I honestly think it's the AI affecting my bones more than the chemo. Not joint pain but deep pulsating aches in the bone. You are right. Comes and goes and some days are better than others. And the timing is pretty predictable. Your hair looks adorable and I hope the baby is doing well.",
      "MessageIndex": 2166,
      "PostDate": "24/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Feb 24, 2019 08:11PM DebAL wrote: urdrago, she is absolutely precious!! Just beautiful!! I hope you find out your results before next weekend too. It's super windy here. Saw a bird flying in the air into the wind. Going nowhere, just flying in place lol. 60 mph winds. Heading to florida tomorrow. I'm ready for a little getaway. I will send the sun your way. I hope everyone is doing well. Deb",
      "MessageIndex": 2168,
      "PostDate": "24/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Mar 5, 2019 05:53AM DebAL wrote: ",
      "MessageIndex": 2198,
      "PostDate": "05/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 7, 2019 09:37PM DebAL wrote: hey frog, scrunch and go for me too. I spend little time messing with it. When is your trip? LIFE, you have a TON of hair! It looks great!. Hope everyone is having a good week!",
      "MessageIndex": 2444,
      "PostDate": "07/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jan 11, 2019 10:52AM DebAL wrote: joE, yes, stage, hormone receptor status, how many lymph nodes etc factor in. I believe there is a quiz on the oncotype site where you plug in info and it gives you an idea. Sorry I'm not much help! Hope you are doing well.",
      "MessageIndex": 60,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868830",
      "Title": "New Here and Just Diagnosed justme1964 justme1964"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 7, 2018 02:57AM DebAL wrote: Wow Therese, I celebrate you and your milestone! Warmed my heart and I love that you are enjoying life and treasuring each day. You are an inspiration. Thank you so much for sharing",
      "MessageIndex": 7,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/866431",
      "Title": "Ten years-whooopeeee! Celebrate_Life dorimak"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 20, 2018 03:59AM DebAL wrote: ",
      "MessageIndex": 3,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jun 2, 2018 08:19AM DebAL wrote: Cindy, I'm sorry you are going through this. Easier said than done but try not to let your mind go too far ahead. Remember, treatment options are choices although in certain circumstances some of them will come highly recommended. There will be a lot of decisions you will make in the near future. Take a deep breath and seek support from your medical team, those close to you , and this forum. Waiting is one of the hardest parts of a breast cancer diagnosis. Try your best to stay busy and don't Google too much. Hugs and we are here for you!",
      "MessageIndex": 1,
      "PostDate": "02/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/864987",
      "Title": "Feeling anxious again, waiting for marker results Cindymb OCDAmy"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 7, 2018 09:37PM DebAL wrote: Clareco, how are you feeling?",
      "MessageIndex": 172,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 17, 2018 02:11PM DebAL wrote: Hi Emac, sorry you find yourself here. I also had an oncotype of 27. Had TC #3 last Monday. I've gotten through this pretty easy. I had NO side effects at all with the first 2. Took chemo day(mondays) and 2 days after off work..to hydrate, rest, walk etc then back to work. Today I'm more tired than usual which is a first. Walking 3 miles a day. I left work early ( nurse in pre-op) came home and took short 2 naps. I do get the neulasta shot after each treatment and done fine there too and I do feel that helps. Everyone is so different with how they respond but in general it seems like most are blah days 3-7 then feel better. There are always exceptions of course. I honestly wish I could bottle up my experience for everyone going through this as it has not been bad at all. Take care. You will find a lot of support here! PS, my hair is actually coming back in already. Go figure. No neuropathy. My biggest concern would be you caring for infected patients while you are receiving treatment.",
      "MessageIndex": 187,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 16, 2018 01:53PM DebAL wrote: Ready, thinking of you and glad you will have this part behind you! I hope all goes well and so glad this part of the waiting game is over for you! Best wishes!",
      "MessageIndex": 115,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 26, 2018 10:06AM DebAL wrote: mustlovepoodles, our experiences are similar except I don't even have the fatigue. Before chemo I worked 430am-1pm shift. Got up at 3:15,am .didn't go to bed till 10pm. Shame on me and that has changed. So my baseline tired beforehand was off the charts. Slap me for saying this but just piggybacking off what u said. I would do it again too. I know some get 6 rounds of TC rather than 4. I would gladly go 2 more if there was evidence to support it could possibly decrease my chances of recurrence.",
      "MessageIndex": 12,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864856",
      "Title": "Do you regret doing Chemo? GreenEyes81 Zenmushroom"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 26, 2018 08:45PM DebAL wrote: moth, thanks for the link to the article, very interesting. Wow, having that additional info did change things for you. Glad you could understand what i was asking lol. Green eyes, first of all a big hug and I'm sorry you are dealing with this again. No apologies for a long post, that's why we are here! Moving is stressful but I'm glad you will be closer to family for support. I can tell you are scared and it is a decision that isn't always easy. Lean on those around you that support your decision.",
      "MessageIndex": 24,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864856",
      "Title": "Do you regret doing Chemo? GreenEyes81 Zenmushroom"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Mar 3, 2019 02:44PM DebAL wrote: mother of two, you are so right. I'm sorry you are going through this. It's normal to waiver back and forth. It's not an easy decision. My reasoning for BMX was that I didnt want to go through this again. I had dense breasts and didnt want the worry of future cancers possibly being missed. My relatively small tumor had some aggressive features. You are right. It's a sad and difficult decision. I do not regret my decision in the least. No matter what any of us do cancer can still come back. I have a normal amount of worry but dont obsess about recurrence. I was a candidate for skin sparing, nipple sparing and cosmetically had a good outcome. Yes, there is loss of sensation but not totally. Nips still respond to temperature change and there is still some sensation. I'm only mentioning this so that should you choose bilateral maybe there are some options for the healthy breast as far as keeping the nipple, inframammary incision etc. I wish you the best in making your decision and again I'm sorry you have to deal with all this.",
      "MessageIndex": 1,
      "PostDate": "03/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870141",
      "Title": "Double or Single Mastectomy Motheroftwo36 HopeBry"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Mar 3, 2019 04:15PM DebAL wrote: yes. The MRI will help with your decision. My Surgeon had me prepared for something in the other breast so there was definitely relief when all was good there. By that time I was pretty solidified with my decision to have both removed. Mountainmomma is right. I have an onc appt this friday. I feel myself a little more anxious this week. I also agree, not as much loss of feeling as I expected too. There is so much to understand and so overwhelming. Your PS should lay out all of your options. Also, keep an open mind. I knew before I went in I may be direct to implant or wake up with expanders. Tissue perfusion and blood flow is determined in surgery. I trusted my PS to make the best decision at the time. Many here also get second and 3rd opinions. That sometimes makes your decision a little more clear.",
      "MessageIndex": 6,
      "PostDate": "03/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870141",
      "Title": "Double or Single Mastectomy Motheroftwo36 HopeBry"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 4, 2018 03:54AM DebAL wrote: Mama, that is so good to hear. I honestly can't keep track of where I have been on these threads. It's helpful to share experiences but especially helpful when you know others are on the same regimen. My heart aches when i read so many are having side effects and i have had none. I wish with all my heart I could bottle up my first 2 experiences for each one of you. In fact that is one of the reasons i don't post often but I do want to give others hope. Everyone one of our experiences are different but if anyone cares to PM me feel free. Even if my next 2 treatments are terrible I am thankful for the first 2 going so well. We can get this done together ladies!",
      "MessageIndex": 171,
      "PostDate": "04/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 11, 2018 03:36PM DebAL wrote: oh no engine, I'm sorry to hear that. Very smart to seek treatment. I hope she feels better soon. Take care",
      "MessageIndex": 177,
      "PostDate": "11/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855318",
      "Title": "Cytoxan Taxotere Chemo Ladies- May 2017 rdsm Engine104"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 20, 2018 07:33AM DebAL wrote: Hi tigerlily, I finished 4 rounds of TC June 4th. Never lost much on the right side at all as far as eyebrows and eye lashes. On the left the middle section of my left eyebrow thinned down to almost nothing. Is that not bizarre? Eyelashes thinned. This all occurred during the month of July, a month after completion. Eyebrows are back to normal now and there are more eyelashes each day to put mascara on. To me this was absolutely no big deal at all. I used a clinique and Sally's product for the brow and no one could tell. I hear this happens in cycles so I'm keeping my products handy for the future. You will get a lot of good responses to your questions I am sure. In fact, be prepared for \"egads\"to start posting pics of babies with bushy eyebrows. She had me in tears. Best of luck with the TC. I wish for you my experience, no side effects. Take care!",
      "MessageIndex": 54,
      "PostDate": "20/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781368",
      "Title": "Eyelash and Eyebrow Regrowth Rockym eulainemc"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Feb 10, 2019 04:12PM DebAL wrote: 36andcounting, I also dont have an answer to your question. As frustrating as it is I do know it was in your best interest that the anesthesiologist cancelled your case. He very well most likely saved you from a less than optimal outcome. Heart failure can come on quickly..even since you saw your cardiologist ( as you know from your ER visit) you could have ended up on the vent and sometimes it can be difficult to wean once you are on it Cardio and pulmonary need to see you again. You didnt mention any other meds but often patients are put on ACE inhibitors/ARB's if you want to research. It's so important and that you are optimized for surgery. Please go right back to the ER immediately if your symptoms resurface between now and your other appointments. Please update when you can. I'm so so sorry for this added stress. Your anesthesiologist made a good call",
      "MessageIndex": 2,
      "PostDate": "10/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869726",
      "Title": "Delayed Surgery/heart failure 36andcounting Meow13"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Jul 9, 2018 09:35PM DebAL wrote: Lilanj, sorry you are going through this. Waiting is so so difficult. Hopefully you will get in for a biopsy soon. Try not to let your mind get too far ahead. Easier said than done. You will find great support in this forum. Keep us posted. (Hug)",
      "MessageIndex": 6,
      "PostDate": "09/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865728",
      "Title": "Waiting and scared Lilanj Lilanj"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "May 14, 2018 09:00AM DebAL wrote: magneto, I also had dense breasts and never missed a yearly mammogram. I asked for a MRI last year but I didn't meet \"the guidelines\" which includes 2 direct female relatives with breast cancer and had no other risk factors. Dense breasts alone are normally not enough to warrant an MRI unfortunately guessing partly due to cost of the test. Even had your mom gone at 6 months it still may not have been detected. As others stated most breast cancers are slow growing. Moving forward should she choose lumpectomy you can inquire if they can alternate MRI and mammo. The waiting is one of the hardest part of this journey. When diagnosed we want the cancer out now. I remember my surgeons words who also had breast cancer \"while it is life-threatening to us it is not a threat to life\". Time is needed to formulate your care team, seek second opinions, and further testing. You will find much support in this forum and she is fortunate to have a daughter that cares so much. Hugs to you as you support your mom through this journey and you are not alone!",
      "MessageIndex": 6,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864572",
      "Title": "Mom diagnosed with breast cancer, did they drop the ball? magneto YYC_Girl"
    },
    {
      "AuthorID": "DebAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272008/profile",
      "Content": "Aug 5, 2018 12:53PM DebAL wrote: caren, I agree with the others. It's normal, comes in waves. Please know we are here for you. It's hard for others not going through this to' get it' so you will find support here. There was a time at the beginning when I couldn't talk to anyone about it because everything they said to comfort me just made me angrier. You are not alone and I'm sorry you are going through this. Every time I see a new member diagnosed on this board it pisses me off. Let us help you. You are strong",
      "MessageIndex": 4,
      "PostDate": "05/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/866417",
      "Title": "Im starting to lose my sh@# Careninnj msphil"
    }
  ]
}