{
  "AuthorID": "DebbieSawye…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
  "Posts": [
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Sep 28, 2009 06:00PM DebbieSawyer wrote:",
      "MessageIndex": 712,
      "PostDate": "28/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 6, 2009 07:03PM DebbieSawyer wrote: Hi all. I'm Debbie; living in the San Francisco Bay Area. A stage one'er as well. I am on these boards only occasionally, as it seems I'm always at doctor appointments (blood tests, bone density scan, onc, etc) for this breast cancer! Had lumpectomy and SNB on Oct 14, now awaiting second lumpectomy/re-excision on November 10th for unclean margins. Rads at some point in the near future.Good to meet you, and thanks for starting this thread!",
      "MessageIndex": 16,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 6, 2009 09:47PM DebbieSawyer wrote: Pat; yes, very helpful. My rads will be on the left side, so I had wondered about damage to heart and lungs. Sounds like you had a good rad onc, to go through all your concerns.",
      "MessageIndex": 61,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 13, 2009 11:25AM - edited Nov 13, 2009 11:26AM by DebbieSawyer Pumpkin, cherry, olallieberry. I'm not a chocolate person, but give me a pie with a flaky crust, yum. My husband does a fabulous grand marnier souffle. What's your fav, Sheila? (sorry I know it's off Stage 1 topic) Edited because some of the sentences didn't make sense!",
      "MessageIndex": 261,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 13, 2009 11:32AM DebbieSawyer wrote: Has anyone had Mondors Cording? I now have that, along with seroma and infection in my armpit. It was suggested to me by another poster to do a search on BCO, and I will, but would like to hear first hand experience from any sisters. Although I'm reading it needs to be gently exercised, my bc surgeon said no exercise until the seroma and infection are gone. I'm also reading conflicting information about it: one outside website says it's an irritated blood vessel, another says it's lymphatic fluid. One says it's not a precurser to lymphadema, another says it is. Very confusing.",
      "MessageIndex": 262,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 13, 2009 11:44AM DebbieSawyer wrote: Oops, gotta go. Husband is tapping me on the shoulder, he needs the computer for work. Everyone have a good weekend, stay safe. Debbie",
      "MessageIndex": 263,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 13, 2009 05:42PM DebbieSawyer wrote: Hi Kira; Thank you so much for the information. I am very fearful of getting lymphedema, so may be over reacting anytime I get a new symptom, such as three that are on the list you sent (infection, seroma, cording). I only had one node removed; the BS and onc said no way will I get lymphedema, but....I worry. Hence I wanted to get started on exercises as soon as possible, but I have a re-excision lumpectomy November 24, and have to start all over with the recovery process. Gosh I'm sorry to hear about your appaloosa. I've lost two in twenty years of owning horses, but the other four are still going strong. Yes, the avatar is my six year old gelding, Chip. He's a Paint Quarterhorse. Do you have other horses? Maybe PM me so we don't bore everyone else with horse chat.....?",
      "MessageIndex": 278,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 6, 2009 08:58PM DebbieSawyer wrote: Pat; Do you mind if I ask what the rad doc said to make you change your mind about doing rads afterall? I haven't met with one yet, so don't know much about pros and cons. Did you have many SE's from the radiation? I realize there's a radiation thread, and I'll get on it when I get closer to that time, just wanted to hear your take on it. Hi Swimangel! \"Stage 1 Sisters who had mastectomies\"---I'm glad you mentioned that. When I was dx'ed, it was a Tuesday. On Wednesday I had to decide if I was doing a lumpectomy with rads or a mx, without much time for research.  At the time all I could think about was saving my breast, but what I've learned in the last 6+ weeks, I've rethought that decision. As I go into this second lumpectomy next week, I've decided if the margins still aren't clean, I'll do an mx; which maybe I should have done to begin with. My husband and friends can't understand such a drastic measure. I just want it over with...and not to lose any more lymph nodes! How are you doing? Are you done with surgeries? (sorry, I don't know the time frame of recon).",
      "MessageIndex": 30,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 6, 2009 09:18PM DebbieSawyer wrote: Ok, I spoke too soon about TM. This is an interesting conversation: it sounds like several of you are getting alot more procedures than I am, yet we're close in stage and grade.",
      "MessageIndex": 40,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 6, 2009 09:40PM DebbieSawyer wrote: Sue, you got yourself a deal! Hi Joyce--are you going to follow up sooner than six months? Seems like they'd want to double check, now, given your history.",
      "MessageIndex": 60,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 6, 2009 09:48PM DebbieSawyer wrote: Well ladies, it's nearly 7pm and I've still got chores to do. You all have a good evening, and we'll yak again soon...yes?",
      "MessageIndex": 64,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 13, 2009 03:39PM - edited Nov 13, 2009 05:27PM by DebbieSawyer Hi carolinachick--let us know the results of your x-ray. Hopefully you won't have to wait through the weekend for the results. Seems like our time is filled with either Dr's appts or waiting for results, doesn't it.  And wow, coconut cake sounds decadent! otter, prayrv--thank you for the suggestions on cording, I'll go there. Welcome MarciaGoudie! I haven't started rads yet, so can't comment on your shrinking breast, but someone here might have answers for you. You've read through all the posts on the radiation threads? Hey, we're pretty close to each other, I'm in San Jose. bluewillow, sido, makraz--the LGFB sessions sound interesting. I've never heard of them before, and plan on checking out their website.  As for piecrust, if anyone has a good homemade recipe, please PM it to me. I can make good crust, but it seems the flour these days doesn't make the crust as flaky as decades ago. I thought it was my imagination until my mom said the same thing. I've resorted to Marie Callendar's frozen pie crusts (okay okay, I know that's cheating!)",
      "MessageIndex": 274,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 13, 2009 07:52PM DebbieSawyer wrote: Welcome ktmimi2! I have not heard that wine is bad for ER+, but someone clue me in if I'm incorrect. I am continuing to have my nightly glass! Did you ask your onc about it? I can't comment about Femara and Arimidex, since I've not taken those, but others here will probably be able to answer your question. I had a lumpectomy, waiting for re-excision in a couple weeks, due to not enough clean margin taken. Then rads. So you're just ahead of me in treatment, and yes what a journey. If you find out more about wine and ER+, let me know! Debbie",
      "MessageIndex": 289,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 6, 2009 09:14PM DebbieSawyer wrote: TM. Tumor marker. Duh. No brainer. I haven't had my glass of medicinal red wine tonight, so am not thinking clearly yet.",
      "MessageIndex": 38,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 6, 2009 09:21PM DebbieSawyer wrote: ...and Sheila, great news on the good results from your TM!",
      "MessageIndex": 42,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 8, 2009 06:50PM - edited Nov 10, 2009 04:23PM by DebbieSawyer I'm gone out of the room for a mere two days, and we're up to page 5--AWESOME! Been enjoying catching up on the new posts. My weekend was swamped, and I'm heading out the door for mex and margs with friends, but wanted to stop by and say Hey. So guess what, my SNB incision is way infected. Started feeling it late Friday night, and today it is five inches of screamin'....red. It's starting to spread to the lumpectomy incision about two inches below. Oh oh. I was so swamped over the weekend, I couldn't get into the hospital, but I'm calling there first thing tomorrow morning. I wonder if this will postpone my re-excision on Tuesday? Any one have their SNB incision get infected? Oh, did I mention I have the seroma from hell in the SNB site, as well? It's been drained twice and keeps on coming back. Size of an egg. Ouch. Hi jeanneann8, I've been thinking about you too. Did you get my PM's? Sorry to dash in, dash out, but I'm not passing up margaritas with my riding buddies...see you later, and great work on the forum, Sheila!  ",
      "MessageIndex": 128,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 10, 2009 04:44PM DebbieSawyer wrote: Hi everyone! I've been gone a couple days, now back and glad to see this forum going STRONG---Yahooooo! Hi Sheila, Sue-61, cakeisgreat, hmm, makraz, and others I haven't met yet, but who are making this the best forum! Read up on the posts, and it's hard to catch up on the past conversations, so I'll just jump in, regarding the oncotype. It was offered and I had the test done, but results not back yet. My onc said \"only order it if you're prepared for the consequences\", meaning if it comes back a high score, chemo is a must, no choice. I'm gambling that with my 1's across the board (1.2 cm, Stage 1, Grade 1), my onco score will be low. My infected SNB site (with seroma from hell), has postponed re-excision surgery until Thanksgiving week. Rads for Christmas, yippee. :(",
      "MessageIndex": 179,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 12, 2009 08:55AM DebbieSawyer wrote: Good morning everyone, seyla, makraz, hmm. Nice to meet you denverdiva, swimangel72, reneejean. Meece, where abouts in So Cal are you? I grew up out near Palm Springs. Hi sue-61, how ya doing gurl? Deborye thank you for the welcome back, to me! A warm welcome to kal52! Sorry if I missed anyone; that first cup of coffee hasn't hit yet, still bleary eyed. I'm just sitting down at the computer for a few minutes with very hot, strong coffee, and a piece of fresh pumpkin pie. Hard to resist that pie when it's on the kitchen counter calling my name! We're heading out in a few minutes to haul horses and gather cows to give fall vaccines for the rest of the day. I'm so happy to see all of you here, and thank you for making this a wonderful place to chat! Have a great day and talk again soon! Debbie",
      "MessageIndex": 222,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 13, 2009 11:03AM DebbieSawyer wrote: Good morning! Can someone please hand me a cup of coffee off the breakfast cart?   deborye, I too feel I'm missing alot by being gone off the forum for a day or two! makraz, where is the pie forum??! denverdiva, congratulations on finishing up chemo! You're awesome! Hi Sheila, cakeisgreat,meese, sue-61, and other early risers on both coasts. What's up for everyone's weekend?",
      "MessageIndex": 259,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 13, 2009 06:00PM DebbieSawyer wrote: Hi Sue! Thanks again Kira. I've been reading some of Binney's posts as well, about lymphedema.",
      "MessageIndex": 282,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 6, 2009 07:50PM DebbieSawyer wrote: Sheila, thanks for the encouraging words about re-excision. I'm pretty much at the point of \"let's get 'er done, so I can get back to whatever I was doing before dx!\" hmm, how were the rads? I'm still on the fence about doing them, but have a few weeks to think about it. So when I got this dx, I was told by surgeon and onc, to get off the hormone replacement therapy NOW, immediately, pronto. Great....now I'm back having big time hot flashes. What are you all doing for them? (Uh, I mean for those that are of the age to have hot flashes!). What has your doctor prescribed/suggested?",
      "MessageIndex": 23,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 6, 2009 09:09PM DebbieSawyer wrote: OMG Sue, I hate pink too! If one more person asks me will I be wearing pink more often now, I'm gonna slap 'em silly.  mmm5: Scans and tumor markers at each visit? I got one bone density scan, and a tumor marker was place during the core needle biopsy, but that was it. You're getting scanned or tumor markers at each visit? What's a TM? I looked it up in the abbreviation post, but didn't see what it stands for.",
      "MessageIndex": 35,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DebbieSawye…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89732/profile",
      "Content": "Nov 6, 2009 09:26PM DebbieSawyer wrote: aabinion, your doctor said okay to mx two years after your lumpectomy?",
      "MessageIndex": 47,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}