{
  "AuthorID": "Debbie68",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95071/profile",
  "Posts": [
    {
      "AuthorID": "Debbie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95071/profile",
      "Content": "Jan 7, 2010 12:53PM - edited Jan 7, 2010 01:37PM by Debbie68 Hello everyone, I haven't been on for a couple of days.  Welcome to all the new people.  It's sad we have to meet this way, but encouraging to be able to talk to some that are going through the same thing. Well, I had an appt. Tues with PS.  I thought I was going to have my first fill, but he said there was still a little swelling and wanted to wait.  I currently have 600 ccs in each side that was done at the time of surgery, so I am pretty comfortable with how things are already.  I had to laugh at myself... I was so worried about the fill and everything for a few days before the appt., and really had nothing to worry about at all.  I think when I actually do get the fill, it won't be so bad now.  I also had another appt. on Tues. with my BS to look at a couple of small bb sized lumps that just devoloped last week.  We both seem to think they are scar tissue from previous biopsies, so I will just have to keep a close eye on them for any changes.  I was relieved! Last night we got about 2\" of snow.  It's still snowing right now and we are expected to get about another 4-6 inches.  It looks so beautiful!!!  Today is a snow day for us, so we are staying in where it is dry and warm. CakeisGreat - we went to WDW in Orlando back in Feb. 2003.  The weather was great, mostly 75, and the park was not crowded at all.  We were able to get a great deal off of e-bay for our condo house - $58/night.  The condo was 3 bedr, 2 ba, fully stocked kitchen, laundry room, built in pool, and garage.  It was only 15 mins away from the park also.  I just thought I would mention this if you were looking for places to stay. I hope you have lots of fun!!! Sullykm - I like your positive attitude.  Keep the faith! I am thankful for everyday and for the many blessings that this awful disease has brought.  Have a wonderful day everyone.",
      "MessageIndex": 1544,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Debbie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95071/profile",
      "Content": "Jan 7, 2010 07:43PM Debbie68 wrote: Mimi1964, Here's some snow sent all the way from Illinois... ",
      "MessageIndex": 1553,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Debbie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95071/profile",
      "Content": "Jan 2, 2010 11:45PM Debbie68 wrote: Hello everyone, I just discovered this site a few days ago and have been doing A LOT of reading. I wish I would have found this a few months ago when I was going through testing, etc... it would have answered a lot of my questions. Oh well, I'm here now, and it's so nice to meet others who are sharing the same experiences. A little bit about myself. I am 41, married, one daughter (9), had my very first mammogram the beginning of Sept., called back with results and told they \"saw something in the R breast\". Had sonogram and was told they saw a mass, didn't appear to be a cyst. Had biopsy in October and was told I had IDC (I cm) on Oct. 12th. MRI was scheduled and I was told I also had Atypia Hyperplasia (AH) also in the R breast. A MRI directed biopsy was then scheduled and I was told the AH was borderline DCIS. This was not exactly what I expected when I went in for my first mammogram, but I thank God that it was caught early. My BS and I decided my best course of action would be to do a SNB followed by RMX and a prophylactic LMX. So I had my Bi-Lat Mx on 11/30 followed by immediate reconstruction (TE). My PS was able to put 600cc in at the time of the surgery. I have an 800cc capacity, but do not want to go that large... I was large breasted before and want to be smaller. I was suppose to have my first fill the week before Christmas, but decided to wait, and I'm glad I did after reading posts here. It's good to know that I should take Advil beforehand and have someone drive me, since someone posted that it was very sore for them to drive home. I feel like my breasts are swollen, even my husband commented the other day how much bigger they were. My PS does not seem to think there is a problem, but I wonder if I am developing seroma. My Oncotype/DX was ordered on Dec 30th, so I am waiting for the results of that to determine if I need chemo. I have 2 appts. On Tues. One with PS... he will probably want to do first fill... not looking forward to this. The other appt. is with BS... I was released from her, but noticed two bb sized lumps on R breast last week and she wanted to see them. On Friday I meet again with oncologist. I will probably be started on Tamoxifen. My ONC also mentioned the BRCA test and recommended I have them done, but I went to a Q/A session lead by my BS back in Nov. and she said there is still a lot of controversy about these tests because of privacy laws and discrimination. On one hand I would want to know, but on the other I don't if is going to cause discrimination problems for my daughter in the future. Have any of you had problems or heard of this? A Happy and Healthy New Year to all! Debbie",
      "MessageIndex": 1472,
      "PostDate": "02/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Debbie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95071/profile",
      "Content": "Jan 4, 2010 09:11PM Debbie68 wrote:",
      "MessageIndex": 1496,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Debbie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95071/profile",
      "Content": "Jan 2, 2010 11:49PM Debbie68 wrote: Hi Meece, We took all of our Christmas decorations down yesterday.  It's always sad for me to do, even more so this year, but I do enjoy getting my house back in order at the same time.  Way to go on getting the sewing  room reorganized! Debbie",
      "MessageIndex": 1473,
      "PostDate": "02/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Debbie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95071/profile",
      "Content": "Jan 3, 2010 01:30AM Debbie68 wrote: Thanks everyone for your input. I have been searching more on this site and found this thread that talks more about discrimination: BRCA2+ with young daughter -do you have her tested?  I will have to google more on the act they talk about that was passed by Bush. Meece: thanks for the posting hint! I hope everyone has a good night's sleep.  Good night. Debbie",
      "MessageIndex": 1478,
      "PostDate": "03/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Debbie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95071/profile",
      "Content": "Jan 7, 2010 07:33PM Debbie68 wrote: Hello everyone and thanks for the warm welcome.  It is so nice to \"meet\" all of you. ",
      "MessageIndex": 1551,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Debbie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95071/profile",
      "Content": "Jan 9, 2010 12:44PM Debbie68 wrote: Sullykm (Kelly), Thanks for the reassurance about the TE fills.  I don't know why I have been so worried about it... I wasn't even like this before the bi-lat mx. LOL.  I know it's going to be fine.  Thanks for sharing, and have a great day.",
      "MessageIndex": 1602,
      "PostDate": "09/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Debbie68",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/95071/profile",
      "Content": "Jan 11, 2010 10:46AM Debbie68 wrote: Sullykm, I was suppose to get my first fill last week, but PS thought I was a little swollen and wants to wait 2 weeks.  My next appt. is next Tues (1/19).  I already have 600cc in each breast that was put in at time of surgery, so I am not wanting to go much bigger.  I will post next week after appt.  Thanks for your encouragement. Debbie",
      "MessageIndex": 1610,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}