{
  "AuthorID": "Debbiem425",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
  "Posts": [
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jul 4, 2008 06:19AM - edited Jul 4, 2008 06:20AM by Debbiem425 I found the hair loss the worst part of this whole process.  I loved my thick hair.  Only my family has seen me bald.  I wear a wig everywhere I go and if my kids are bringing friends home they call first so I can \"put my hair on.\"  The wig felt funny when I first got it but within a week or two I don't even feel it any more.  It isn't a full cap so it doesn't get hot and it has adjustment straps to make it the right tension. I am sad to hear that it takes so long to grow back. There is one good part - I love not having to shave my underarms!!! I did enjoy reading everone's post - put some humor in the situation! Happy 4th everyone!",
      "MessageIndex": 36,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708370",
      "Title": "What I hate MOST about being bald! HeatherBLocklear dhettish"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jul 8, 2008 03:20PM - edited Jul 8, 2008 03:21PM by Debbiem425 Traci - I also do not like being seen bald but with this Florida heat and the head sweats I have given in and go bald in front of my husband and kids.  The kids know if anyone is coming over I must know so I can cover up.  I always wear a wig out but wear scarves at home.  I Loved my hair and I HATE being bald.  It makes me look and feel sick.  When I had hair I could never go too long without  a haircut because it grew so fast but I bet it seems so slow waiting for it to fill back in.  Everyone tells me how strong I am and how they can't believe what a good attitude I have but every time I look in the mirror it makes me so sad. ",
      "MessageIndex": 67,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708370",
      "Title": "What I hate MOST about being bald! HeatherBLocklear dhettish"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jun 9, 2008 06:21PM Debbiem425 wrote: I am mourning the loss of my hair also.  Last week it started to come out a bit so I had it shaved on Thursday which was day 15.  Now that I still have a lot of stubble left I am thinking I was too hasty - I could have had a few more days of my own hair.  Today at work I got a ton of compliments on my new hair color (I got a wig with my hair color but it also has highlights).  Very few people at work know I am going through chemo.  I am not 100% comfortable in my wig - I still feel like I have to keep my head straight.  LOL I probably looked like I was a little stiff at work. I wear a bandanna at home but I ordered a couple of the BeauBeau scarves I have seen mentioned on these boards.  I haven't let anyone, not even my husband, see me uncovered yet.  I am not even comfortable looking in the mirror.",
      "MessageIndex": 15,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706996",
      "Title": "Mourning for my hair Sable MsKarin"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Apr 1, 2008 02:04AM Debbiem425 wrote: Hi  You don't say how old you are but whether your mom gets tested or not you need to be fanatical about getting yourself checked.  My mother who also had breast cancer post menopause refused to be tested, didn't see the need.  That upset me as I thought I was enough of a reason.  Turns out before I made a decision about being tested myself I got breast cancer.  At that point I was tested for my daughters but it turns out I was negative.  So, in my opinion even more important then the testing is that you must be followed by a specialist so if you do get diagnosed at any point it is discovered early.  I was being checked every 6 months so even though it was discovered in two places and I chose to have both breasts removed, I do not need radiation or chemo. Good luck with your decision. ",
      "MessageIndex": 2,
      "PostDate": "01/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/702964",
      "Title": "genetic testing elysaleonard Debbiem425"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jul 25, 2008 08:04PM Debbiem425 wrote: My hair started falling out around day 14 and the following day I went to where I had purchased a wig and they shaved me and trimmed the wig.  When my husband got home from work I looked just like when he left but now I had highlights.  I just finished my last TC and am looking forward to when it starts to grow back. I will have to ask how long until I can color it - I am almost completely gray and I am only 47.  I am not a short hair person so I will probably be wearing my wig for a while.  Yesterday the oncologist asked where I got my wig - she said it was the best one she has ever seen.  She probably says that to everyone. haha",
      "MessageIndex": 180,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "May 30, 2008 11:44PM - edited May 30, 2008 11:45PM by Debbiem425 My grocery store (Publix) carries Biotene.",
      "MessageIndex": 608,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jun 26, 2008 09:20AM Debbiem425 wrote: Hi everyone Just got back into town - wish I had been here for the venting and deleting.  When I am in the mood I will have to tell you a story or two about my mother (maybe they went to the same parenting class?). How do I get an avatar?",
      "MessageIndex": 1093,
      "PostDate": "26/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jul 26, 2008 08:53AM - edited Jul 26, 2008 08:55AM by Debbiem425 Hi everyone  Had my fourth and last TC yesterday.  Yea!  It was a bit depressing though when I asked how long until I feel myself again and they said it could be as long as 6 months :( Ellenoire - I want the recipe too!  Speaking of recipes, I am so sick of ordering out because I am too tired to cook - anyone have good easy and fast recipes so I can start cooking again? Gracie - they told me it takes 3 weeks for RRCA results.  I signed for them to start before they got the insurance okay since I knew the insurance would pay.  They messed up and didn't start it so when I got the insurance approval my doctors office raised a big stink with them and days later I had the results. RawD & Sable - I was told to take vitamin B but the taste is terrible! My Mah Jongg group wanted to come play at chemo but there isn't enough room - would have been fun if we could have done it. haylat - with your family history your insurance won't pay for a bilateral with reconstruction?  I think it's the law that they have to.  Did you talk to your doctors office about it?  Maybe they can help with the insurance.  I have  Aetna and they paid no problem. Have a great weekend everyone!",
      "MessageIndex": 1708,
      "PostDate": "26/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jul 11, 2008 05:38AM - edited Jul 11, 2008 05:39AM by Debbiem425 Hi everyone Gracie - how wonderful that you got to spend some time with your Granddaughter - those good times are so important. Otter & Rock - love the idea about the point system :)  But I am still a wimp and won't go out without my wig.  I did take it off and drive home from work bald today :)  Mominez- I love listening (reading) the mom vents - it makes me feel so much better about my mom who is totally wacko Ewesterman - so sorry about the shingles - as if you didn't have enough to deal with.  Roxi - sorry about your sisters - confused about if you had the BRCA test or not.  Most females in my family have been hit with BC.  My grandmother of course was before testing was available, my aunt tested positive  My mother who had BC refused to get tested - didn't see any value in it (wacko like I said - no value?  what about me am I of no value?) I was tested and was convinced I would be positive but in the end I was negative.  On one hand you would think that's good but negative or positive I have BC.  The person who did my testing said even though I am negative my family has some gene that hasn't been detected because everyone gets it.  So, regardless of my test results or your test results our daughters have to be very careful.  They have to start getting checked early, frequently, and regularly.  Hopefully prevention will improve and our daughters will be spared this experience.",
      "MessageIndex": 1348,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "May 29, 2008 11:23PM Debbiem425 wrote: Okay I feel like such an idiot.  In my defense, I have been skimming the posts as I have been a bit light headed since my first chemo last Thursday.  I thought Kristy was really going on vacation!  LOL  I thought she sure is brave going so far away.  And I saw reference of a couple gals going to the pool.  I was so jealous that I had to go to work!  I must read slower and pay better attention!!!!  But I made myself laugh a least. I had a boost of energy today and actually baked for my daughter's graduation party. Roxi - so sorry you are getting grief at work - shame on them treating you this way. Go Gators - so sorry you had such a rough time.  Do you take anything for your stomach before you even have a reaction?  My doctor put me on Nexium and said I must take one each morning until I am completely done with chemo. Otter - you said you are almost at #4 - is this the last one?  It's almost the weekend!!!!!",
      "MessageIndex": 591,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jun 2, 2008 07:48PM Debbiem425 wrote: I have a question and I am not sure it belongs here or on the reconstruction board.  I had my exchange surgery 6 weeks ago and am halfway between my first and second chemo.  The last two days I felt great.  Today I was exhausted at work and came home a little early.  When I changed I noticed that my boobs are all red around my insicion.  The incision itself is not swollen or anything but the skin is all red.  Drs office is closed and it doesn't seem like an emrgency.  Has antone had anything like that happen?",
      "MessageIndex": 669,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jun 9, 2008 09:37PM Debbiem425 wrote: Hi everyone I have only posted a couple of times - I also have mostly been lurking.  I have CT #2 on Thursday, that is if it is not postponed.  I have been having a problem around both incisions.  My skin is all red and the scar line is not the nice think pink line I used to have, it is a bit infected looking, below the skin.  My oncologist thinks it is nothing.  My ps thinks it's a big problem but he is perplexed about exactly what is happening.  He has me on two antibiotics, instructions to take it easy and he is afraid if it isn't under control soon I could loose my implants.  I saw him twice last week and since he is on vacation I am seeing his partner on Wednesday. My ps was supposed to call my oncologist last Friday to see if they could postpone this weeks chemo but they never called me with an outcome.  I am hoping it clears enough to just get on with it. I went to work today for the first time in a week and the first time I wore my wig there.  Very few coworkers know I am going through chemo.  I got a lot of compliments on my highlighting!  LOL  I did feel a little \"stiff\" like as if I was trying to keep my head still.  I guess comfort will come in time. I finally looked on line at the Feel Good Feel Better classes and there was one tonight at my hospital - guess I should have looked sooner.  There is another one at a different local hospital in a couple of weeks so I will call them tomorrow.  I hope they feed us - haha - my appetite has not suffered through this, I feel like all I do is eat!  I just made brownies. ",
      "MessageIndex": 832,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jul 9, 2008 07:40AM Debbiem425 wrote: I just have to vent.........First I must say that my office has been wonderful about all the time I have been out and I am covered by disability.  I am down to having around 30 hours left of paid disability.  I have been working part time through chemo - I work until I am tired.  With only one treatment left I was feeling pretty good with the time I had available.  Yesterday was the first time I missed an entire day - I was just wiped out.  This morning I go in with the goal of staying all day as I have to conserve those few paid hours I have left.  As I walk in I knew something was wrong - NO AIR CONDITIONING.  8 am and it must have already been close to 90 degrees in there. My doctor has been very clear that I am not to be in the sun and not to get overheated.  I made it for 2 hours and had to leave.  I Just checked my e mail and they aren't even sure if we will have it working tomorrow.  UUGGGHHH  Now I am going to quickly use up those precious hours I have left.  Okay I ranted and got it out of my system.  Thanks for letting me vent!  Guess I will have to use my vacation days.  Like I tell my kids, life isn't always fair.  I think I'll go eat some cookies, that will make me feel better.",
      "MessageIndex": 1319,
      "PostDate": "09/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jul 19, 2008 12:33PM Debbiem425 wrote: Otter -  I think our Mom's must have gone to the same parenting class.  My mother doesn't even call to ask how I am after chemo.  My husband called her after the second one and asked her if she remembered I was going.  He though he was doing a nice thing reminding her.   Her response was that she knew I went and she was worried sick about me and why haven't I called to tell her how I am!  She is moving next week to a different room  in her senior living building and she tells me this week that I need to come with my dh and 2 dd's for a few hours each day this weekend to help her move!  I don't even have the energy to cook for clean and I should help her move.  So she responds that I can supervise. Well I wrote this response this morning before work and am just getting back to the computer to see I never posted it!  I just scanned back a bit but going to go read more thoroughly.  But I did see some mention of emotions and I am also crying a bit which I usually never do.  Have a great weekend everyone and feel good!",
      "MessageIndex": 1541,
      "PostDate": "19/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jun 2, 2008 12:30AM - edited Jun 2, 2008 12:31AM by Debbiem425 hi everyone Susan Welcome - I am new here also. I am a few days behind you - started on the 22nd so I am curious to hear how your hair week goes. I have my wig and plan to go to the place I bought it from when the shedding starts.  They will shave my head and fit the wig. Only my two bosses at work know I am having chemo so until I am ready to share with my coworkers a wig is a must.  Maybe they will figure it out with my new hair.  I always wanted highlights but have been too cheap to pay for them so I got a wig with highlights.  The hair shade is a bit off too but they know I vary with that anyways to cover the gray.  I actually love the color of the wig so when my hair grows back I plan to match the color. As far as counting days my oncologist says chemo day is day 1.",
      "MessageIndex": 658,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jul 6, 2008 11:06AM Debbiem425 wrote: Day 4 of treatment #3 for me and I slept all day.  Now that I am awake, what a treat reading the last couple of days posts.  You all crack me up!  Love that fudgesicle picture!",
      "MessageIndex": 1262,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jun 14, 2008 08:40PM Debbiem425 wrote: Sherry - I hope the IV antibiotics do their job!  Hope you get good results and are feeling better soon.",
      "MessageIndex": 24,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707029",
      "Title": "Right Foob is red MsSherry MsSherry"
    },
    {
      "AuthorID": "Debbiem425",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64165/profile",
      "Content": "Jun 11, 2008 08:12PM Debbiem425 wrote: I am having similar problem on both breasts.  The area above and below the incisions are red.  I have been on antibiotics since last Tuesday and it is better but not gone.  PS has me on two antibiotics and wants me to postpone chemo which is supposed to be tomorrow but the oncologist hasn't called him back.  PS has told me to go tomorrow and insist the oncologist call him and refuse chemo until she does call him.  He thinks I am having a reaction to the sutures but is a little baffled because my surgery was 7 weeks ago!  He said it's probably caused by my resistance being low due to chemo.  He is nervous I will lose the implants.  Mssherry hopefully we will both respond well enough to the antibiotics to avoid further problems!",
      "MessageIndex": 17,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707029",
      "Title": "Right Foob is red MsSherry MsSherry"
    }
  ]
}