{
  "AuthorID": "DEbeachgirl…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
  "Posts": [
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Nov 12, 2014 02:21AM DEbeachgirl wrote: Apparently my oncologist didn't know to give claritin w neulasta. Would explain my severe reaction. Oy!",
      "MessageIndex": 10,
      "PostDate": "12/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824558",
      "Title": "My Neulasta experience ... Lori1967 april25"
    },
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Dec 11, 2014 04:03AM DEbeachgirl wrote: I will have my 3rd cycle of Gemzar next Tuesday. My TMs were 370 last week and went up to the 400s and if they don't go down my onc wants me to go on Abraxane or Eribulin. I lost all my hair in 2009 from ACT and I don't think I can do it again. As far as side effects w Gemzar; I've been tired and had a slight fever after. I also had my white count be low last time and felt pretty bad. But overall not as bad as ACT by a long shot.",
      "MessageIndex": 30,
      "PostDate": "11/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824942",
      "Title": "Scared to start Gemzar Deb5013 Deb5013"
    },
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Mar 15, 2013 11:09PM - edited Mar 15, 2013 11:18PM by DEbeachgirl I'm not writing this to be the negative nelly but I had a horrible experience with my port.  It was placed near my collar bone and caused me constant soreness or outright pain until it was removed at my insistence after chemo.  I don't think having one placed for a blood draw 4 times a year is worth it at all.  After it was removed I had some pain until it healed and now I have a nasty looking scar that has faded a lot with Scar Guard, btw the best scar treatment that is out there, recommended by my plastic surgeon.  I apparently had a suck it up bunch of doctors bc they never used lidocaine when accessing my port either.  Mine pertruded a lot btw and I'm average weight.  If I had to have one now I would insist that something be done about maybe moving it but I also have a new oncologist who I'm more comfortable with so I don't think the problem would persist like it did back then.  If it's working it's worth not having to be stuck for sure. ",
      "MessageIndex": 26,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801787",
      "Title": "Port Placement Z28Femme justjudie"
    },
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Jan 6, 2015 02:01AM DEbeachgirl wrote: My oncologist has recommended i start Halaven next week. Anything I can do to prevent hair loss? I just can do that again? I read a few places he infusion time is quick. How long is it? Anyone do cold caps w it? Thanks!",
      "MessageIndex": 1242,
      "PostDate": "06/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Apr 7, 2015 11:21AM DEbeachgirl wrote: I just had the first infusion of my 2nd cycle today. My biggest side effect has been fatigue right after and for a few days. I also have decreased appetite. My hair started thinning on the off week of the 1st cycle. It's not pouring off like w ACT but I'm getting good amount of shedding. I fortunately have thick hair but I am going for a wig consultation this week. Has anyone used minoxidil or biotin to thickened hair back up?",
      "MessageIndex": 1320,
      "PostDate": "07/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Apr 14, 2015 08:26PM DEbeachgirl wrote: End of 2nd cycle. Next week is my off week. Get TMs done. GemStateGirl - My hair is still falling out but has slowed down considerably. My main problem is that my part, I had really long hair that I cut shoulder length before this so I have a middle part, is thinned a lot and around the front of my head has some small bald patches. If I wear a wide headband or bandana you can't tell there is hair loss at all. I'm hoping that I can maintain this amount of hair as I've seen some people on this thread say they've had hair loss in the beginning and then it stopped and started growing back. I can deal with that. I'm not holding my breath though. I'm still getting a wig and I appreciate your suggestion. I need a wig for my part time job if I lose all of my hair. I DJ weddings. As far as SE's this time; I haven't been getting the decodrone bc I had a bad reaction to it back when I was on Gemzar. I felt like I had 4 tequila shots for about 45 minutes. It was super scary. So they weren't suppose to give it to me. Well I wasn't paying attention Monday and she gave me the Dec. I didn't have any problem with it and I actually felt better then afterward then the last 3 infusions so we're thinking that the one that made me dizzy was given too fast. My appetite is still down but I haven't had the bad nausea w almost vomiting that I've been having off and on for the past 6 weeks. (knock on wood). I haven't had to have neupogen. Is that fairly normal? I'm still on oxygen but I'm better every day and I can be off of it for short periods. I'm doing exercises with a Spirometer and have been improving with that each day. One suggestion I have for the ladies with constipation; I have added a lot of veggies and black beans to my diet. I have a salad for dinner every night with snap peas, avocado, good dark leaf lettuce and spinach, tomatoes, carrots, peppers, etc. I also drink pure organic juices. I don't have a juicer so I get Bolthouse Farms juice smoothies. They are in the produce section. I love the berry, mango, and green juice (it's ugly but it tastes like fruit). They also have single size flavors that are yummy too. I try to drink at least one serving of them a day. If I do get constipated I use Benefiber chewables for a few days. They taste good and they work if you aren't too constipated. You can also just take them every day if you need to.",
      "MessageIndex": 1323,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Jun 8, 2015 06:20AM DEbeachgirl wrote: HI! I haven't updated recently. Just wanted to say Hi! I'm on my 4th cycle. Doing pretty well. I had really bad nausea that Zofran didn't do anything for the first 3 cycles. They changed to compazine and that seems to help. I haven't had any foot issues. I already had a little neuropathy in my left foot from Gemzar but with the warmer weather it is mostly in my little toe and I'm mostly barefoot which helps. I did have significant hair thinning after my first and second cycle. I lost about half my hair. fortunately it was very thick. Unfortunately the worst hair loss was around my face and part. I can disguise it with a wide fabric headband. After the third cycle hair loss slowed down and I'm not losing hardly anything. I did get my long hair cut bc it was all over everything. It's chin length now. Which sucks for me bc I hate short hair on me but I have hair so.... I am also using Nioxin shampoo, conditioner and treatment. It seems to be helping some and I do have some \"sprouts\" filling in at the front of my head so I do go to treatment sometimes w/o the headband bc I don't want to wear them (I got a dozen for cheap on amazon) all the time in case it restricts some hair regrowth!!! My tumor markers have gone down 200 points since starting Eribilin too,",
      "MessageIndex": 1383,
      "PostDate": "08/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Apr 7, 2015 11:24AM DEbeachgirl wrote: Oh yea, I was admitted to the hospital a few weeks ago for pneumonia and found out I have a few lung mets now. Been on oxygen but feeling better. Has anyone else weaned themselves off of O2? Did you see a pulmonary specialist?",
      "MessageIndex": 1321,
      "PostDate": "07/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "DEbeachgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "DEbeachgirl wrote: I just got scan results back today and my cancer has spread. It was in my tailbone and is now in several other bones. I was on Xeloda and they want me to start Gemzar next week. I'm having a pic line put in bc I had trouble w a port last time. Can someone share their experience or direct me to a thread already going? And what is your experience w a pic line? Thanks Michele. ~The lowest ebb is the turn of the tide. Dx 11/4/2008, IDC, 4cm, Stage IV, Grade 3, 3/13 nodes, ER+/PR+, HER2- Surgery 11/20/2008 Lumpectomy: Left Surgery 12/16/2008 Mastectomy: Left Chemotherapy 1/21/2009 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 7/6/2009 Breast, Lymph nodes Surgery 10/10/2009 Reconstruction (left): Tissue expander placement Surgery 10/10/2010 Reconstruction (left) Radiation Therapy 8/4/2011 Bone Hormonal Therapy 9/1/2011 Arimidex (anastrozole) Surgery 10/10/2012 Reconstruction (left): Nipple reconstruction Hormonal Therapy 2/24/2013 Aromasin (exemestane) Targeted Therapy 3/2/2013 Afinitor (everolimus) Chemotherapy 7/10/2013 Xeloda (capecitabine) Chemotherapy 11/4/2014 Gemzar (gemcitabine) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825891",
      "Title": "Gemzar DEbeachgirl raro"
    },
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Sep 12, 2015 01:31AM DEbeachgirl wrote: I couldn't drink anything especially stuff with champagne in it. I'd immediately have a severe hot flash. Now I can drink a little but more then one drink and I feel like crap the next day so it's not worth it.",
      "MessageIndex": 6,
      "PostDate": "12/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/834875",
      "Title": "Alcohol and hot flashes terrij152 DEbeachgirl"
    },
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Nov 12, 2014 05:45AM DEbeachgirl wrote: This has to be a mistake. stage 4 automatically qualifies you for disability.",
      "MessageIndex": 67,
      "PostDate": "12/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825656",
      "Title": "I received a letter today-SSD will stop in two months Fitztwins"
    },
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Mar 16, 2013 01:44AM - edited Mar 16, 2013 01:46AM by DEbeachgirl I just started Aromasin and Afinitor about 2 weeks ago.  I've been having migraines with nausea, fatigue, heartburn, and lose of appetite.  I had migraines when I started Arimidex too and they were under control with Fiorcet but it isn't really helping this time.  I haven't had any mouth problems really.  I thought the roof of my mouth felt funny but I might be imagining that.  Not diarrhea but I'm on oxycontin twice a day for pain for bone mets so that causes constipation so I'm thinking it's balancing it out maybe.  lol  I'm really sorry that some of you are having trouble with the cost.  That's the last thing you need to worry about!  (((HUGS)))",
      "MessageIndex": 34,
      "PostDate": "16/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794038",
      "Title": "Starting Afinitor and Aromasin, what to expect? hope10 Rseman"
    },
    {
      "AuthorID": "DEbeachgirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/173756/profile",
      "Content": "Nov 12, 2014 05:24AM - edited Nov 12, 2014 05:25AM by DEbeachgirl I discovered an awesome nail oil called Bliss Kiss. It's all natural. I had white spots on my toenails and they were getting weird bc I was on Xeloda. I initially bought it for my fingernails and then happened to try it on my toes. It has faded the spots and my nails look and feel more normal. Www.nailcarehq.com",
      "MessageIndex": 4,
      "PostDate": "12/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825072",
      "Title": "Advice needed for preventing neuropathy & nail care. Gretta april25"
    }
  ]
}