{
  "AuthorID": "DebinUtah",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
  "Posts": [
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 7, 2011 10:08AM DebinUtah wrote: Thanks to everyone for the warm welcome and for the advice!.  The rash on my face is gradually fading.  I've been using Atopalm MLE cream--it's amazing--originally designed for post-cosmetic surgery patients.  Pure moisture and no side effects.  Vivie, I know exactly how you feel.  For the first week after TCH I just feel absolutely toxic: miserable, depressed, anxious, angry--I hate everything about myself and how this damned disease is ruining my life.  Then about day 7 or 8 I can literally feel the toxins leaving my body: I'm still tired and shaky, but mentially  I feel more like myself again.  I know I'm very lucky that most of week 2 and week 3 are pretty good for me, but I can barely stand the thought of FOUR MORE first weeks!  I know it may seem a little corny to some folks, but during those bad times, I get a lot of comfort from some CDs I bought called Relax into Healing for chemotherapy patients.  It's just guided relaxation with a focus on \"welcoming\" the healing effects of the chemo--very calming.  Peace and strength to everyone.",
      "MessageIndex": 1382,
      "PostDate": "07/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 20, 2011 10:42AM DebinUtah wrote: Because I had a reaction to my second taxotere infusion, they have \"slow dripped\" me the last two times--I'm in the chair for 6-7 hours, even with a port.  My onc said that there has been a high rate of negative reactions all over the country to the lastest \"batch\" of taxotere.  Are you kidding me?  Does someone just cook this stuff up in their kitchen? You'd think with so many lives at stake they'd have the recipe down!  I'm keeping my fingers crossed for you, Ellen.  I'm so glad the CDs are helping a little. Best to everyone with tx this week!",
      "MessageIndex": 1693,
      "PostDate": "20/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 24, 2011 12:57PM DebinUtah wrote: Grimbol--after my first tx I had really bad throat pain--felt like a little vomit burning in my throat all the time.  My doc said it was acid reflux and put me on Prilosec.  I had to take it morning and night for about a week before it started to work; now I just take it at night.  My onc says this kind of acid reflux is one of the most common SEs of chemotherapy and definitely needs to be treated or it can cause permanent damage to the esaphagus. You can get Prilosec over the counter if you don't want to wait until Monday for an Rx.  Good luck!",
      "MessageIndex": 1783,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 28, 2011 10:42PM DebinUtah wrote: Does anyone have a recommendation about eye drops?  I used some moisturizing drops I had on hand, and my eyes stung for hours.   Welcome MizMarie--sounds like we're on a similar schedule.  I had my 3rd TCH infusion on Sept. 16.  My days 3-7 are pretty bleak; after that I gradually start feeling better, although I'm not bouncing back as fast as I did in rounds 1 and 2. Are you having radiation after the chemo?  I am scheduled for 6 weeks' worth, but I'm wondering if it's really worth it.  I sooooo want to just be done with all this! I want my real life back. Good night, everyone.  Let's have a better tomorrow.",
      "MessageIndex": 1876,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 2, 2011 10:00PM DebinUtah wrote: Michelleo--ask your onc for an RX for \"magic mouthwash.\"  It's a little nasty tasting, but it totally numbs your mouth--feels like you've been to the dentist. It is really odd that there are so many different schedules.  I have SIX rounds of taxotere plus carboplatin and herceptin.  Any other triple positives doing six rounds of Taxotere?  Grimbol--you're right; just when I start getting stronger physically, I get totally weepy, especially in the evening. I've been using the Systane, and my eyes feel better, but they're twitching so much that it's driving me crazy. Makes it hard to read--one of my few pleasures these days. Hope everyone has a good week.  Even if we don't, we're still one week closer to being done with all this. Peace and strength.",
      "MessageIndex": 1924,
      "PostDate": "02/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 9, 2011 11:56AM DebinUtah wrote: About the \"bad batch\" of taxotere:  my onc actually admitted to me that his clinic (a huge clinic) had dozens of allergic reactions with the last national batch of taxotere.  I have no idea where it's being made.  I had a scary reaction during my 2nd infusion on the \"bad\" stuff.  By the time I had my 3rd infusion, my clinic had a new batch.  I did not have a reaction to the taxotere on infusions 3 and 4.  This kind of thing makes me furious!  Aren't the regular SEs bad enough on this sh*t?  Who's regulating this stuff?!  There should be no such things as \"bad batches\"! vtEllen--most of my exercise before getting my diagnosis was cycling and weight lifting; now I'm trying to do a little light yoga and just started QiGong.  Because I've always exercised and eaten healthy and I have no family history of any kind of cancer, I have such a hard time understanding how this could be happening to me.  I know that kind of thinking gets me nowhere, but the week after each infusion, when I'm feeling really weak and emotional, it's all I can think about: how did this happen to me?  After all these months, it's still so surreal. I keep thinking, I am NOT this sick person; this is NOT me.  Sorry to be a downer--just the \"Day 3 Blues.\"  I'm going to go watch NFL--go Steelers.",
      "MessageIndex": 2044,
      "PostDate": "09/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 11, 2011 07:12PM DebinUtah wrote:",
      "MessageIndex": 2092,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 25, 2011 12:43PM DebinUtah wrote: Summergirl and MizMarie--I'm a fuzz-top too.  Some of my hair never fell out and even though I shaved it, it's growing.  I think I'd rather be totally bald since my head looks like a little old man's! Missey--I've thought about that question too.  I get cards and texts that say \"so sorry you're sick.\"  I feel like saying, I'm not sick, I don't even have cancer (since the surgery).  I feel lousy because I'M BEING POISONED!  The only time I feel like I'm \"sick\" is when I look in the mirror. Kasi--you lucky gal (who deserves every ounce of that luck!); I wish I felt like running again.  I think I'm looking forward to that (and having hair) more than anything else. Thanks for the words of encouragement, Ellen.  Be sure to tell us all about your shop re-opening! I love it! Life after chemo!",
      "MessageIndex": 2273,
      "PostDate": "25/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 27, 2011 08:09PM DebinUtah wrote: Wow, this has been a big day for so many--congratulations and love to Missey and Ellen!  Ellen, I may never get to Vermont, but when I'm doing my relaxing meditations, your store sounds like a beautiful place to picture: a running stream is the one thing my property here in the Rocky Mountains is missing! Chrys--when it rains it pours, huh?  A dog bite?!  Please keep posting us and updating us--I suspect that many of us will continue to have SE long after our last infusion (although you seem to have gotten far more than your share!). I'm also a big fan of Burt's Bees--nice scents, no parabens and no skin reactions.  I really like the lip balms, energizing body wash and the coconut-scented foot rub. I like the Alba products as well, although some \"fragrance free\" products are stinkier to me than ones with natural perfumes.  I'm off to #5 of 6 tomorrow morning.  Wish me luck!  Blessings to all!",
      "MessageIndex": 2309,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 14, 2011 12:50PM DebinUtah wrote: Taylor--I'm the blonde with the cheesy smile. The brunette is my BFF Becky.  I think you're right about some folks having a little devil in them.  If I had to guess I'd bet that you've always been more attractive than your sister-in-law, right?  Now she's making you pay for it (whether she realizes it or not). Classic passive aggression.  Don't waste an ounce of your precious energy thinking about it; it's her problem!  Let's all think about next spring when we'll be sporting cute new hair styles and training for marathons and preparing to go to Hawaii with our hubbies!! ",
      "MessageIndex": 2421,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 14, 2011 05:35PM DebinUtah wrote: Terry--I don't really know the difference between a picc line and a port.  I have port, and I hate it with all my heart (except on infusion days). But I don't dare have the surgeon take it out because I have so my herceptin treatments left.  Will you do all the remaining herceptins with a regular IV? MizMarie--I'm wondering the same thing about my crispy stubble.  I was crying to my hair stylist friend today about my hair.  She says she does the hair of a woman who's had chemo three separate time (God forbid!) and that her hair grows in thicker and more beautiful every time.  I'm not doing this three times, but I'll take the thicker/more beautiful hair! Capinva, I'm sorry to hear about your return to chemo! I'm having taxotere so I can't say from experience, but most women I know say ANYTHING is better than the AC!  What effects are you still having from the AC?  Does anyone else have numbness in their cheeks and lips?  It comes and goes for me and drives me crazy!",
      "MessageIndex": 2429,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 23, 2011 11:43AM DebinUtah wrote: Happy Thanksgiving, Everyone!  Congratulations to Taylor, Allformy4, Lele, Robo and everyone who is sooooo close!  I'm 6 days out of my last chemo tx. I'm tired, sore and sick, but I'm still happy.  Robo, your description of yourself fits me EXACTLY! I can't wait for hair, clear skin, my normal face shape, a flat stomach, pain free muscles, ankles and tastebuds! Tastebuds or not, I'm still planning on eating as much pumpkin pie as I can get tomorrow!  I have an excuse for over endulgance! Patience and peace to all.",
      "MessageIndex": 2495,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Dec 11, 2011 05:40PM - edited Dec 11, 2011 05:40PM by DebinUtah I'm also waiting impatiently for my three Coobie bras to come! Thanks, Ellen, for the tip.  I know women who went \"commando\" during rads, but I'd rather not.  Maryj--I've taken my Tamox for two NIGHTS in a row. The first night was fine, but I barely slept at all last night.  Is insomnia one of the common SEs?  If so, I'll definitely switch to mornings. My onc also gave me an RX for gabapentin for the pain in my finger/neuropathy.  I''ve been on it for two days and the numbness is still there but the pain is much less.  Also, I swear it's helping with the hot flashes AND moodiness.  Anyone have any experience with this drug?   Good luck on Tuesday, Michelle!",
      "MessageIndex": 2546,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Dec 13, 2011 08:24PM DebinUtah wrote: Thanks, Ellen and YaYa, for the rads info!  I'm thrilled to hear, Ellen, that your fatigue didn't set in until the last week.  I'm feeling happier and stronger everyday since chemo, and I hate to think that might end next Tuesday when I start rads.  YaYa--are you having any SE's from the herceptin alone? I swear my nose and eyes started to run more after my first solo H treatment.  Good luck, Grimbol with rads and your first solo H!  Robyn--what's your man's problem? Sometimes I think it's easier for our friends to be nice (and then go home and thank God they're healthy) than it is for those people who live with us day in and day out.  I also think men tend to shut down their emotions when something scares them.  Go ahead and kick him; then go snuggle with your puppy.  Good luck on Monday! Hurrah for you! Here's wishing energy and blister-free skin to all!",
      "MessageIndex": 2555,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 5, 2011 02:33PM DebinUtah wrote: Hi Everyone, I've been eavesdropping on your conversations for a few days and just got up the nerve this afternoon to join in after I read the last post from vtEllen: it was like I had written those very words.  I couldn't express how I feel any better.  Although I'm not feeling as nauseated during this 2nd round as I did my first, I feel like it's one nasty SE after another.  I thought losing my hair was the worst that could happen; then suddenly a couple days ago my face and neck broke out in a very unattractive rash. Geez, could I feel uglier? I don't know if it's the chemo, the steroids or my own out-of-whack hormones.  Anyone else dealing with this?  I'm also curious whether anyone on Taxotere has had any allergic reactions during infusion. I didn't during my 1st infusion but did during my 2nd.  My onc RN said they'd had many, many more reactions since going to the generic Taxotere from Doxetaxel, but insurance companies won't pay for the Doxetaxel anymore. Thanks, everyone, for lettting me read your words and join your community.  Peace.",
      "MessageIndex": 1356,
      "PostDate": "05/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 12, 2011 05:44PM DebinUtah wrote:",
      "MessageIndex": 1498,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 17, 2011 12:28PM DebinUtah wrote: Sounds like a lot of us are on a similar schedule--I have my last infusion on Nov. 18th. Hallaluha! Then start 6 weeks of M-F radiation.  I just had my third tx yesterday: taxotere, carboplatin and herceptin (other HER2/neu positive gals: I'm surprised your oncs are giving you the herceptin along with the other chemicals already).  I had a mild adverse reaction to taxotere #2, so they loaded me up with steroids the day before and boy did I get a lot done!  Cleaned my entire house, did 4 loads of laundry, wrote a report for work--of course, I was so wired I couldn't sleep!  I take a second big dose today. Then I hear that the post-steroid crash is bad. Oh, well, I'm planning to rely heavily on my Ativan and stay in bed and watch NFL all day.  I swear the emotional anxiety and black mood of days 3-7 are worse for me than the physical SEs. Family reactions are weird, huh? Mine are just the opposite of Vivie's; it's like they're so hesitant to impose that I have to go visit them instead of the other way around.  No one would have said a word about my wig if I hadn't started the conversation.  I am normally a pretty private person, but COME ON!  I could use a little mother-henning!  Luckily my DH is very mothering; sometimes I have to tell him to just get out of the house and do his own thing for awhile.  He also gives me little \"pink poisoning presents\" after each chemo--just little things: pink pjs and slippers, a lovely little pink quartz ring; kind of silly but it gives us something to share and me something to look forward to. That and the no hair below the neck line are the only perks of all this!  (PS--if you're losing your eyebrows and don't like the painted-on look, try the real hair ones from Headcoverings.com--they're easy to apply and pretty realistic looking.) Love, peace and strength to everyone with tx and SEs this week    ",
      "MessageIndex": 1627,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 25, 2011 08:38PM DebinUtah wrote: Grimbol--although Prilosec and Prevacid are different chemically, they're both proton pump inhibitors and do the same thing.  Let me know if you get quick relief; the Prilosec takes several days to work for me. ",
      "MessageIndex": 1801,
      "PostDate": "25/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 27, 2011 02:13PM DebinUtah wrote: Just a word or two more about the Anti-Cancer book:  I love that this book doesn't dwell too much on how we all came to be cancer patients (no guilt trip); it's primarily about life after cancer--something we're all looking forward to!  Although a lot of the advice is common sense, the book is absolutely filled with studies (often outside of oncology) that show a very powerful connection between slowing (even killing) cancer growth and common foods.  For example, breast cancer tumors in mice that had stopped responding to Taxol responded to curcumin (the primary ingredient in the spice tumeric); a Harvard study showed that a combination of soy plus green tea inhibits the progression of estrogen dependent tumors; a Japanese study showed that breast cancer survivors had 57% fewer relapses if they drank 3 cups of green tea a day (as opposed to 1 cup); cancer patients in Japan are commonly given mushrooms (any Japanese variety or oyster) in order to improve their immune systems during and after chemo; the Natl Cancer Inst has demonstated that rosemary extract helps chemotherapy penetrate breast cancer cells.  I'm a university researcher myself (linguistics), and I'm often very sceptical of these kinds of claims, but this doctor has done his homework!  I'm very lucky to have great insurance that is paying for 100% of my bills right now.  I know some of you are not as lucky.  If anyone out there is struggling financially, I would be HONORED to buy a copy of this book for you--I feel that strongly about the information it provides.  Just give me your mailing address. Best to everyone with SEs and TXs!",
      "MessageIndex": 1852,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 6, 2011 02:05PM DebinUtah wrote: So good to hear from you, Chrys!  From what my oncologist friend tells me, your doctor made the right decision, and it's not unusual for someone to have a reduced number of treatments and still make an excellent recovery. I'm happy for you that this nasty part of the journey will soon be over! I'm truly delighted that so many of you are so close to being done!  Enjoy every single minute of it! Remind us all of the light at the end of the tunnel!  I think when I get to that point (3 more infusions to go), I'll do exactly as Ellen said, cry for joy through the whole thing! Happy Yom Kipper to my sister and all my Jewish friends, and happy Thanksgiving to all the Canadian gals.  It's definitely American Thanksgiving weather here in Utah right now.  A couple days ago we were in the mid 80s; today it's 35 degrees and snowing!  Crazy!   I go in for my 4th infusion of taxotere, carboplatin and herceptin (a 7-hour adventure!) tomorrow, so wish me luck!",
      "MessageIndex": 1997,
      "PostDate": "06/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 14, 2011 04:33PM DebinUtah wrote: Thanks, YaYa. Good to hear you're feeling better! Day 8 has been significantly better for me than the last 7, although last night I had a bit of a breakdown. I'm trying to keep a stiff upper lip, but sometimes it's all so overwhelming.  I HATE that I'm so emotional!  When my husband is super sweet, I cry; when he's not super sweet, I cry.  The poor man. I swear that he's just hanging on to the thought that in about 8 weeks all this will be over.  And I'm just scared that I'll be as tired, sick, crazy, and emotional on rads and on the hormone blockers as I am now!  No, it's got to get better than this! JMULL--my onc recommends a mixture of Claritin and Aleve for any bone/muscle pain I'm having; I wonder if that combo would help with your cold.  The nausea drug Phenergren is actually an anti-histamine and might help too.  Good luck!  I had a cold during my first round, and it was miserable.  I was really congested and when I'd blow my nose, all this blood would come out.  My PN's suggestion was that I not blow my nose.  Really? ",
      "MessageIndex": 2131,
      "PostDate": "14/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 27, 2011 08:22PM DebinUtah wrote: Missey (and others going on hormone blockers)--you should talk to your onc about the new research on the benefits of taking an osteoporosis medication like Actonel or Prolia while you're on the hormone blockers (there are a number of articles on the breastcancer.org site--just search for hormone blockers and bone loss).  Because I've had osteopenia since I was 40 (a family trait), I had been on Actonel for 3 years before my bc diagnosis.  My onc told me to definitely keep taking the Actonel during chemo/rads. In his words, \"it can't hurt and we think it might help.\"  My bone density has improved on Actonel and, I think, from the fairly serious weight lifting I've been doing for the last couple years.",
      "MessageIndex": 2310,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 4, 2011 10:21AM DebinUtah wrote: Hey all--it feels like many of us are kind of hunkering down and toughing out these last couple of rounds.  I'm on day 7 of round 5 (of 6), and I'm pretty much just on autopilot, trying to get through the next few weeks without thinking or feeling too much. YaYa5--if you're out there--round 5 (touch wood) has been a little kinder to me than round 4.  I hope the same is still holding true for you. Does anyone out there know anything about 3DCRT partial breast radiation?  You have it twice a day for one week instead of everyday for 6 weeks.  That sounds good to me. Blessings and low SEs to all!",
      "MessageIndex": 2346,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 13, 2011 03:17PM DebinUtah wrote: Glad you're still with us, sweet Vivie! What a wild ride you've been on!  I couldn't agree with you more about the most hated phrases: \"just one more treatment,\" \"just 6 more month till your hair comes back.\" Six more freakin' months?! That's supposed to make me feel better?  I know people are just trying to help me stay positive, but I kind of feel like it trivializes what I'm going through and have yet to go through.  ANYONE who has gone through chemo would judge you for saying enough is enough! Vivie, you deserve every bit of good energy and peace the universe has to give! I''m feeling incredibly unattractive and very sorry for myself today, so, Robyn, cheer me up and tell me about your new puppy: breed? name? latest antic?  Ellen, how was the store last week?",
      "MessageIndex": 2412,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 13, 2011 03:19PM DebinUtah wrote: (Of course, I meant anyone who's gone through chem WOULDN'T judge you, Vivie.  I should proofread my postings!)",
      "MessageIndex": 2413,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 14, 2011 01:58PM DebinUtah wrote: Best of luck tomorrow, Michelleo!  You did it!  How are you going to celebrate?",
      "MessageIndex": 2424,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 16, 2011 08:49AM DebinUtah wrote: Dear YaYa--How happy I am for you!  Your grandkids are gorgeous!  I can't wait till I join the post-chemo ranks on Friday!  Keep me posted on how you recover from the last chemo and how your rads simulation goes.  The long muscles in my arms and legs are still so stiff and sore, even though I've been stretching/doing yoga everyday. I thought it might be the Neulasta, but MO says it's the taxotere. Are you keeping your port for the rest of the Herceptin treatments? Doodlebug--congrats on the great prognosis! What an incredible relief that must be!  I know your kids must want their \"normal\" lives back; don't we all!  My dogs, on the other hand, have been thrilled to have a stay-at-home mom for once.  Peace and perserverence to all today!",
      "MessageIndex": 2445,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 30, 2011 01:18PM DebinUtah wrote: Thanks, everybody, for the skin cream info.  When you say Aquaphor, do you mean the same kind of greasy stuff you put on your lips? I'm so relieved to hear that most folks are finding the SEs of radiation to be managable.  Do you have any problems wearing a bra?  Robyn and Ellen--I'm so happy to hear that you're boh doing so well.  Life after chemo sounds good! YaYa--I'm dreading my simulation appointments as well.  I know there will be very little pain involved (the needle pricks for the tattoos), but I'm just so tired of being poked and prodded and positioned.  Just zap me and get it over with.  I still don't undetstand why I need THREE separate simulation appointments.  The way the RO talked it's all about getting the computer/lasers configured accurately.  Still seems unnecessary.   Okay, so when does my hair start coming back?!?!  I've still got the same crispy stubble on my head that I've had since the 2nd round of chemo.  Is there anything I can do to stimulate growth? Special shampoos? supplements? standing on my head? Patience and hugs to all!",
      "MessageIndex": 2515,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Dec 9, 2011 05:33PM DebinUtah wrote: Lots of congratulations due!  Hurrah for MizMarie for having enough platelets, to MaryjRN for surviving the wedding in style, and to Robyn for finishing rads next week!  YAY! Maryj--I actually had a conversation with my MO today and asked the same question. He said that since the hot flashes at night are the most common SE, some women find that taking the tamoxifin in the AM helps a little; he said others who are heavier sleepers like to take it at night so that they sleep through the worse of the SEs.  Please let us know what works for you.  I start taking it tomorrow.  ",
      "MessageIndex": 2540,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 8, 2011 01:21PM DebinUtah wrote: Dear AC/triple negative Ladies, You inspire me with your courage and stamina! I hear nothing is worse than the \"red devil.\" God bless. I can't promise not to complain a little, but I will remind myself of your courage during the one week on TCH when I feel like I want to be in a medically induced coma.   Just a couple thoughts:  I take a stool softener EVERY morning and have thus far staved off the C with no unpleasant SEs.  At my onc's suggestion, I also stagger the phenergren and the zofran when I'm really nauseated (zofran first, then phenergren in 4 hours, then another zofran 4 hours later).  I love, love, love SmartWater--it has the salts and electrolytes without all the other stuff in Gatorade.  And the Ativan at night is a god-send: no weird dreams, no grogginess in the AM, just 6-7 hours of really normal sleep.  (Knock on wood; I know sometimes it can stop working.) Peace and strength to everyone, especially those with infusions this week! Deb",
      "MessageIndex": 1420,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 14, 2011 09:54PM - edited Sep 14, 2011 09:57PM by DebinUtah I love your buzz cut, Madismommy!  You've got a great shaped head!  Okay, gals who have been bald for awhile give me some advice: I had a stylist shave my head over three weeks ago.  I had already lost about two-thirds of my hair, and the Apollo \"hair system\" I bought needs to be fitted to a bald head.  The problem is that I haven't lost that last one-third of my hair yet and it's pretty itchy and getting longer every day.  I think my wig would be pretty comfortable (the cap is very thin, breathable rubberish material) and my head would look better bald if it weren't for the stubble!  Will the rest of my hair fall out in subsequent chemo treatments? (I've had two so far.)  Like Summergirl, I'm not a hat or scarf person (except at home); I teach at university and I just can't stand up in front of my students without hair (even if it's not MY hair).  But I still cringe every time I see myself in a mirror--it's not me.  This whole thing is so surreal.  Chrys, here's wishing you a peaceful night and a better day tomorrow   ",
      "MessageIndex": 1563,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 26, 2011 11:45PM DebinUtah wrote: Happy birthday, gorgeous Kasi!  I hope you look at your \"before\" picture everyday and remember that that's who you are--that beautiful, young carefree girl.  This is just a nasty blip on the radar of life. Missey--one of my dearest friends is a top oncologist. I was feeling so guilty that I'd taken bc pills for years and brought this horrible disease on myself.  She assures me that estrogen replacement or bc pills can't CAUSE cancer, although the cancer (once it's going) does feed on the estrogen. I'm reading that Anti-Cancer book someone recommended (whoever it was, thank you!!).  What an eye-opener!  I wish I could afford to buy everyone on this thread a copy--it's worth every penny.  Dear Chrys--my heart is aching for you.  I have a friend who simply could not tolerate her last TX, and her doctor acted as if it wasn't a big deal; he told her that the most good was probably done in the first two treatments anyway. I don't know if that's true, and I'm certainly not encouraging you to skip any treatment that might do you good, but your onc really needs to figure out if the benefit is worth the cure!  I'll be petitioning the universe for peace and strength for all of us! ",
      "MessageIndex": 1826,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 7, 2011 08:45PM DebinUtah wrote: YaYa5--Just had 4th tx of TCH today, and I can already feel a difference: more nausea than I've experienced so early (even though they gave me Emend during my tx), and the muscles in my upper legs feel crazy--like I've done 50 squats in a row. I also had a mild reaction to the Carboplatin today which, apparently, is very rare unless you've had 8 or 9 treatments.  They stopped the drip, gave me only saline for about 30 minutes, and then restarted at a slower drip.  My doctor said only the fatigue should be culmulative, so I wasn't expecting these other SEs.  What next, huh? Please keep me updated on how you're feeling. Serenity and strength to everyone having treatments and dealing with SEs this week! ",
      "MessageIndex": 2031,
      "PostDate": "07/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 8, 2011 01:01PM DebinUtah wrote: vtEllen--so glad you're getting inspired by the Anti-Cancer book!  Me too.  I know I probably don't have the discipline to stick with an entire change of lifestyle, but--like you said in an earlier post--adding a little green tea, more fruit, some tumeric and a little dark chocolate to my life should be a piece of cake.  The book has also made me think about how I typically deal with stress--I obviously need to \"let go and relax\" more than I have.I thought I was being strong, being the woman people wanted me to be by taking on so much and being ultra independent.  Lots to think about!  All I know is I sure as hell don't EVER want to go through this again! YaYa5--feeling better today--less leg stiffness, just a little nausea. Typical SEs are popping up: sore hands and mouth. Sucking on cold grapes today. VERY unhappy about the 10 lbs I've gained since my surgery in July!  Doc says it's probably the steroids, but I'm sure some of it has to do with the fact that I keep thinking I'll feel better if I just eat something else. Best to all my BC sisters",
      "MessageIndex": 2038,
      "PostDate": "08/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 12, 2011 10:53AM DebinUtah wrote: Thanks, Chrys and Ellen, for the radiation info and links to websites.  Somehow I feel more in control when I know the whys and hows of what's happening to me. YaYa5--Hurrah! I'll think of you and celebrate on Monday!  I'm five days behind you--my last treatment is Friday.  Today is my 100th day of chemotherapy, and I am sooooo done with this!  Who else on this thread has to keep going in for Herceptin infusions?  I guess that's no big deal, right? No real SEs? I love the folks at my clinic, but--in truth--I'd love never to see them or their office ever again!  It's getting so bad that I can't watch tv shows or commercials set in hospitals.  That's all I need--one more phobia! Our thread has really dwindled.  Is everybody over on facebook? Vivie, Diana, MizMarie--are you out there and doing okay? Peace and patience. Deb",
      "MessageIndex": 2400,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 12, 2011 10:59AM DebinUtah wrote:",
      "MessageIndex": 2401,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 16, 2011 03:03PM DebinUtah wrote: Thanks for the good wishes YaYa and JMULL!  Was it Ellen who said she thought she'd probably cry all the way through her last infusion? I certainly feel that way: the poisoning is finally coming to an end! Wish I could say I don't mind my port, YaYa!  It's hideous. I have no fat (or muscle) up there so it just sticks out and looks gross! JMULL--I haven't gotten my new wig yet--the shipping confirmation said probably this Friday. Can't wait! Can we wear our wigs to rads? ",
      "MessageIndex": 2457,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 17, 2011 06:42PM DebinUtah wrote: YaYa--I haven't been icing my fingernails (my MO kind of pooh-poohed it) but wish I had.  Haven't really had this kind of pain and trouble until this cycle. It may be too late, but I plan to bring my frozen peas to my LAST INFUSION tomorrow. Congratulations, Terry! You're right: YOU'VE GOT THIS!",
      "MessageIndex": 2469,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 17, 2011 10:04PM DebinUtah wrote: Glad to hear about the nails, MizMarie!  Hope I get a similar message from my onc! Congratulations, Allformy4! I'm so happy for you, and you just gave me a great idea--maybe I'll bring cookies or slices of pumpkin pie (not homemade, of course) for the other patients tomorrow to celebrate my last tx--my treat is being done! Summergirl, I'm so sorry to hear you've been down. I know that two more weeks can feel like an eternity when you're feeling lousy! You'll be in my thoughts. Sincere thanks to EVERYONE for making this nasty chemo trip more bearable!",
      "MessageIndex": 2475,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 19, 2011 11:54AM DebinUtah wrote: All--my last chemo tx went off yesterday without a hitch. TG!  No bell, but lots of hugs, some tears and a big bottle of sparkling cider.  (When I asked if they couldn't get me something a little \"harder,\" they laughed and said \"Hey, it's Utah.)  Of course, they all know that they'll be seeing me every three weeks for my Herceptin infusion until August.  But NO MORE POISON!  I'm scheduled to see my RO in about two weeks--I hope he and his staff are as wonderful as my MO's clinic has been! (Although my MO gave me a carefully worded warning that ROs tend to be a little more \"clinical\" than \"personable.\") JMULL--my new wig was waiting for me when I got home for chemo--nice timing!  I really like it! The cap is more comfortable than I expected, not one bit itchy.  I like it so much I'm thinking of getting another one, maybe a slightly different style, in the creamy toffee color like you got.  I like the gradient butter pecan color I bought, but having one that's a little blonder would also be fun.  Now I'm REALLY regretting the $1000 I spent on my real-hair wig!  The color is not nearly as natural looking, it's really not that much more comfortable, and it's a huge pain to style so I rarely wear it.  I really think I'll feel more like myself if I wear this new wig a lot--even just around the house.  Thanks TONS for the recommendation! Blessings and strength to everyone this week!! Thanks again for all the encouragement and great advice! Deb",
      "MessageIndex": 2482,
      "PostDate": "19/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Dec 2, 2011 05:16PM DebinUtah wrote: YaYa--glad the simulation/stimulation was a breeze!  I'll let you know how mine goes. Hurray to JMULL for being done and MizMarie for being sooooo close!  Thank heaven for internet shopping as we deal with all this through the holidays, right? Good wishes and tiny side effects to all!",
      "MessageIndex": 2520,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Dec 7, 2011 08:46PM DebinUtah wrote: YaYa--My heart hurt when I read your post; I hadn't thought about how lonely radiation will be--no other patients, no husband, no nurses at my beck and call.  But I love Ellen's suggestions--I'm going to wiggle my toes ever so slightly and think of you all.  Sandy--I actually haven't started Tamoxifin yet.  I go in for my first Herceptin W/O chemo treatment on Friday, and my onc said he'd give me a prescription then.  He knows I'm nervous about taking it, but he acted as if taking out my ovaries was a last resort. Please keep us posted about the SEs! Robyn--what's Femera?    MizMarie--GOOD LUCK TOMORROW!  I'll be thinking of you!  And I'll let you know how the Herception Only treatment goes on Friday.  They say it should take less than an hour total.  That sure beats 7 hours of the TCH, huh? Peace and patience.",
      "MessageIndex": 2535,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Dec 12, 2011 08:21PM DebinUtah wrote: Got my tattoos (not as painful as I feared) AND my Coobies today (as comfy as I hoped).  Day 3 of Tamox--had another restless night last night but no hot flashes......yet.  I swear the gabapentin is making me less anxious; I'm unusually calm, and I'm not taking anything new except the gaba and the tamox. I'll enjoy it while it lasts. Ellen--is this your last week of rads? You lucky girl! Tell me about your fatigue level.  A woman in my RO's waiting room today told me to be prepared to be completely exhausted by the last week. She was on oxygen and in a wheelchair, so I'm hoping my experience is different from hers. I'm wishing everyone a strong, happy week!",
      "MessageIndex": 2550,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 13, 2011 02:22PM DebinUtah wrote: Thanks everyone for your posts about sex. Kasi, you're so right; I just need to forget my body and get my head into it.  I need to trust my husband when he ways he loves me and finds me sexy (regardless of my bald head and my scarred boobs). It seems like it's much easier for HIM to dismiss those \"non-essentials\" than it is for me! Grimbol--for me, the emotional rollercoaster has been as bad as the physical effects of chemo.  Some days I feel mentally strong and relatively happy and the next I feel anxious or angry or just so very sad.  Even 3 months after dx, I still grieve so much for my BC (before cancer) days; I grieve for the me of the future who will always have this fear hanging over her head.  I loved my BC life, and now I'm so scared things will never be as good again. Anybody taking anything for the depression or anxiety?  My doc put me on a very low dose of Prozac when she took me off my birthcontrol, but sometimes I wonder if it's helping.   Love and strength to Taylor777 and everyone having infusions in the next few days!",
      "MessageIndex": 1511,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 18, 2011 01:02PM DebinUtah wrote: Hey Vivie, although you definitely need to tell your onc about the blood, I've had bright red blood on my toilet paper quite a bit these days.  My doc said that ALL our mucus membranes (nose, eyes, vagina and rectum) get very dry both from the tx and from a lot of the nausea meds and that the blood is likely from that dryness rather than hemorroids or something worse.  But make sure they know, especially with your family history. Loved the wedding story! You need that on video!",
      "MessageIndex": 1650,
      "PostDate": "18/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 10, 2011 01:47PM DebinUtah wrote: Ellen--I'm so happy for you!! What a great day!  I, too, am incredibly grateful to you for starting this blog--it's been a life saver. YaYa5--how you doing?  This 4th TCH has really kicked my butt; I'm much sicker than rounds 2 and 3. My husband keeps telling me it's because I had a flu shot first, but I don't know.  I'm just so tired and crappy feeling.  Here's hoping for a better day tomorrow.",
      "MessageIndex": 2059,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 13, 2011 07:23PM DebinUtah wrote: Congrats to Robyn!  I hope you treat yourself to something wonderful after all this (a pink Lexus?); you deserve it!  Tanya--I just finished round 4 last week and my mouth has felt exactly as you describe since the first round--raw, sore but weirdly numb like I've burned it on hot food.  But, like Robo47, it hasn't stopped me from eating!  Mine has just become a kind of gnawing inconvenience, but if it's really hurting you, get some of that Magic Mouthwash Michelle mentioned. YaYa5--are you out there? are you doing okay? Today is Day 7 of round 4 for me, and I feel much weaker and shakier than I have on Day 7 of any other round. How 'bout you? Geez, I hate to think what round 5 will be like.  I can't think that far ahead.  One day at a time, right? Love and peace to all.",
      "MessageIndex": 2122,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 21, 2011 07:21PM DebinUtah wrote: Happy birthday, YBrooker1.  And happy new family to Jasper!  Ellen, we could be twins--my eyes are constantly running and puffy and I have red dots on my face.  I'm on day 15 of round 4 and still feeling very weak and very blue--can barely talk to anyone without crying.  Soooooo tired of being ultra emotional.  But I feel a bit better after reading everyone's posts--thanx for being here gals!  ",
      "MessageIndex": 2251,
      "PostDate": "21/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 24, 2011 02:06PM DebinUtah wrote: Congrats, MizMarie!  That's fantastic.  Good luck with your platelets. Allformy4--for research news go to the very very top of this blog page, click on Treatment and Side Effects, click on Radiation Therapy, and then scroll to near the bottom of that list to Research News on Radiation Therapy.  I check all the various topics regularly--I love how breastcancer.org includes the actual medical article but summarizes it in \"normal\" English as well. I have TCH treatment 5 on Friday. I literally can't think about it or I get terribly nauseated.  My DH keeps saying \"only two more, only two more.\"  That sounds great, but all I can think of is SIX more long painful weeks of this hell. I have been so much more tired and weepy this round than others that I'm scared to think what I'll feel like after rounds 5 and 6. Oh well, onwards and upwards.  The one thing keeping my spirts up is that it's beautiful and sunny (72 degrees) here in Utah.  I live in the mountains and the autumn colors are incredible! I wish you could all be here with me to see it!  I've got three guest rooms and several bottles of good wine for anyone who's interested!",
      "MessageIndex": 2265,
      "PostDate": "24/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 11, 2011 07:35PM DebinUtah wrote: Thanks for the wig info, JMULL.  What color did you get? It's so hard to tell what they'll look like from the pictures and swatches.   Wow, Missey and Chrys--I had no idea the \"dry run\" was that complicated! The muscles in my upper arms hurt so much from the taxotere that there's no way I could hold my arms over my head for an hour!  Did you meet with an RO before you did surgery or chemo?  I haven't met with one at all yet.  Okay, this may sound like a stupid question but if my lumpectomy was successful (clear margins) and none of my lymph nodes were affected, what exactly are they radiating? Will they focus on the part of my breast where the tumor was?  I guessed I'd better slow down and focus on getting through my last round of chemo next week. I'm just sooooo anxious to get this over with!",
      "MessageIndex": 2392,
      "PostDate": "11/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 17, 2011 10:45AM DebinUtah wrote: MizMarie--Good luck today!  I've noticed the same think in a few of my nails, and the nail beds on a few of my nails are pretty painful.  Let me know what your MO says.  I've looked online for recommendations for nail pain, and I can't find anything beyond common sense stuff.  I was on one of the other bc.org boards yesterday and many women where saying they'd lost nails or that their nails had lifted while on the TCH regimen.  I really don't need one more reason to hate how I look!",
      "MessageIndex": 2464,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 25, 2011 12:13PM DebinUtah wrote: Robo47--I LOVE your BCO calendar!  Hilarious and right on target!  Seriously, you should market it--we survivors need to laugh at ourselves as well as celebrate these truly important milestones!  Chrys--I've also been on an anti-depressant (Prozac) since my DX, and I had my onc up my dosage a few weeks ago when I was getting really emotional.  No shame and it helps with my hot flashes!  I think Robo's right--we need to all prepare ourselves for Life After BC: cancer survivors have a higher rate of depression than the general public.  I look at my close friends who've had BC and how BC has defined them. Some of them seem to be in total denial--BC was just a blip on the radar of life that they barely want to admit; others seem to gain their whole identities from being a BC survivor. I think we could all use some professional help walking through the post-BC mine fields.   YaYa--I hear you.  I'm still getting a huge mental boost from the reality of NO MORE POISONING, but my body doesn't seem to want to play along: my legs are so weak, my heart races, my eyes run, my nose is stuffed up, my hands and mouth hurt.  My DH has been great (he fixed me a turkey dinner with all the trimmings yesterday even though he hates turkey), but I'm afraid he's going to start getting impatient with me: now that chemo is over I'm supposed to be totally \"normal\" again, right?  Snap out of it, right? I'm afraid this is a long road.  Keep in touch, YaYa. Love, hugs andpeace to all.",
      "MessageIndex": 2503,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 29, 2011 03:24PM DebinUtah wrote: Just had my first appointment with my radiology oncologist.  He seems great, but I'm disappointed that he wants me to wait a full month from my last chemo tx before I start rads--December 19.  I also have THREE separate simulation appointments before I start.  Is that normal?  Then I have 25 full-breast nukes and 8 additional nukes of the tumor site. I was thrilled to hear that I could expect \"only minor lung damage.\"  Lung damage?!  Oh well, I guess I'm lucky my tumor was in my right breast so there's no chance of heart damage.  Ladies already doing rads, please remind me of the kinds of creams you've found to be helpful.  12 days out of chemo and still waiting for my hair, taste buds and energy to show signs of a return, but SOOOOOO happy to be chemo free!  JMULL--I'm gettting tons of compliments on my new Noriko wig.Thanks again! Good days and nights to all!",
      "MessageIndex": 2508,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Dec 14, 2011 01:39PM DebinUtah wrote: YaYa--I'm a bit relieved that you mentioned the awful smelling urine. I've been convinced that I must have UTI or something equally nasty since my first chemo treatment, but I've had no other symptoms. I'm relieved to hear that it's the Herceptin.  My eyes and nose are running off my face today and it's been almost a week since my H infusion.  REALLY don't want to have these SEs until next August!",
      "MessageIndex": 2557,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Dec 21, 2011 11:31PM DebinUtah wrote:  Had my 2nd radiation treatment today. No SEs so far. It took me longer to take my clothes off and put them on than it did to get zapped.  Two down, 31 to go!  Good luck to everyone starting rads or having surgery!   Happy Hanukkah and Winter Solstice to everyone!  Winter Solstice is my favorite day of the year (I must have been a Druid in an earlier life)--the days only get longer (and brighter) from here!",
      "MessageIndex": 2566,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Dec 31, 2011 05:47PM DebinUtah wrote: Happy and Healthy New Year to All! Congratulations, Lucy, on finishing such a long chemo ride!  MizMarie--good luck with your blood values. Do you feel like there are any side effects of the Herceptin only?  I've had two H only infusions and I feel like my nose runs constantly. Oh well, it's a hell of a lot better than poison! I'm 6 weeks PFC, 8 of 33 rads, and my hair is slowly coming in. It's much darker than my pre-BC hair and a little patchy--one half of my head is definitely thicker than the other.  I simply cannot wait to go wigless/hatless! ",
      "MessageIndex": 2575,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 22, 2011 07:31PM DebinUtah wrote: I'm with you, Edyem!  I actually DREAM about coffee--I lie in bed thinking that I can smell it roasting. And what a disappointment when I actually have a cup!  Nonetheless, I keep eating everything and anything just hoping that something will taste good!  At this rate, I'll be as big as a house by December!  The only thing that tastes decent to me in the morning is some highly spiced Chai tea (loaded with sugar, I'm sure) my husband bought me.  Summergirl, it seems even the best of guys \"just don't get it.\"  Last night before bed I looked in the mirror at my scarred boobs, bald head and gray skin, and I burst into tears; I was inconsolable. My poor husband looked at me like I was losing my mind. It doesn't matter that it's been weeks since my hair fell out; it's not something you just \"get over\"!  It's more than just appearances; I feel like something totally essential about me has been stripped away.  And I'm so self-conscious in my wig that I feel like it's changing how I interact with people--I don't want to make eye contact, I don't want to be noticed.  Talk about a humbling experience!  This sh*t really strips you bare.   Crystal, I'm keeping a good thought for you and for everyone having tx this week. Here's to the last day of Summer 2011! May Summer 2012 find us happy, whole and healthy!",
      "MessageIndex": 1756,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 24, 2011 12:34PM DebinUtah wrote: Hey Taylor--every onc seems to be different.  I had a BAD cold before my first infusion, and they still gave it to me.  But I've had friends who've said their docs won't touch them if they're sick.  I can tell you that my cold made that first time much worse than rounds 2 and 3 since so many of my tx SEs feel like cold symptoms to begin with (sore throat, congestion, etc.).  Let us know how you're feeling and what your onc says. I'm sending good metta (my version of prayers) to you.",
      "MessageIndex": 1781,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 28, 2011 10:44PM DebinUtah wrote: Congratulations on the clean MRI, Grimbol!! Glad you're reading the Anti-C book.",
      "MessageIndex": 1877,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Sep 29, 2011 10:46PM DebinUtah wrote: Dear Chyrs--now we know how our \"co-survivors\" feel when they see us in pain: helpless!  I wish there was something I could say or do to help.  All I can say is trust yourself--you know your limits and your body better than anyone else. According to the author of that \"Anti-Cancer\" book, \"feelings of helplessness feed cancer.\" Who knows, maybe by taking control of your own treatment you're doing yourself more good than the chemo would anyway.  I don't know. But I wish you peace and strength. I wish us all peace and strength. Thanks, all, for the advice about the radiation and the Systane (bought it, used it, feel better). ",
      "MessageIndex": 1904,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 3, 2011 05:46PM DebinUtah wrote: Ellen--my understanding is that you need an RX for Magic Mouthwash (it's really called that).  It's basically liquid lidocaine--seriously.  It doesn't necessarily heal your mouth, but it totally numbs it--and I mean TOTALLY--so that you feel better.  My insurance, which has covered everything so far, doesn't cover it for some reasons, but my mouth hurt so much after my first tx that I felt like the $22 was well spent! Hey, get this: my onc (who is a peach!) has an incurable immune deficiency disease and has had absolutely no hair on his body since age 9. I love not being the only hairless in the room! Robyn--I loved the reminder: we're AUGUST girls and it's OCTOBER now!  We are AWESOME!  ",
      "MessageIndex": 1936,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 5, 2011 11:18AM DebinUtah wrote: I am so jealous (in a loving way) of you gals who are almost done with chemo!!  I have tx 4 of 6 on Friday.  I know I'm half way, but it still seems so far away when I think about going through what I've been through in the last 9 weeks AGAIN!  I'm also having radiation afterwards--6 weeks 5x a week.  I can't decide whether to take a break and enjoy Christmas or just plow through.  I've been on half-time sick leave at work, but I hoped I'd be able to go back full time in January. I''ve heard that the radiation makes you really fatigued--anyone know if that's true?",
      "MessageIndex": 1963,
      "PostDate": "05/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 17, 2011 04:24PM DebinUtah wrote: MaryjRN and Istreett--after enjoying a couple months of very good sleep (thanks, I think, to Ativan), I have had terrible insomnia for the last three nights.  I haven't been able to fall asleep until 3:00am; the Ativan isn't helping.  Is this a SE of the chemo or the chemo-induced menapause?  I'm on Day 11 and should be feeling pretty good; instead I'm wiped out because I'm not sleeping. My husband had to sleep in the guest room because even though it's 50 degrees outside, I have the windows wide open and the ceiling fan on.  What's tart cherry juice supposed to do?  Anything else we can take? My onc gave me a flu shot right before my last infusion.  He said it was a good idea as long as the virus was dead or \"mained.\"  I don't think I had any negative side effects from it, but my friend who has weekly infusions had one last week and has run a low-grade temperature ever since.  It makes you wonder how much of this they're just guessing at! ",
      "MessageIndex": 2160,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 18, 2011 01:06PM DebinUtah wrote: Diana--I'm HER2 positive too, so although my other chemo ends Nov. 18 (TG!!!!), I'll be having Herceptin until next August.  I think YaYa5 is with us too.  Although I've been grateful for my port on infusion days (I hate it with a passion every other day), I'm seriously thinking of having it removed next spring.  I'd love to go into summer without this hideous bulg in my chest. They told me it would \"lie down\" within a month or two--NOT!  One more reason to hate looking in the mirror. Ellen--so good to know about the clonazapam!  My Ativan has totally stopped working for me; I'd like to get off it anyway.  Anyone know what the other SEs of tamoxifen are?  So far I've heard about weight gain (sh*t!), hot flashes, insomnia and forgetfulness.  Anything else we have to look forward to?    Another question: for several days mid-cycle (days 11-14), I feel like I've swallowed a giant pill and it hasn't gone all the way down.  You know that feeling?  Is this a form of heartburn/acid reflux?  I'm taking my Prilosec every night, and it has totally helped with the burning in my throat, but this is different.  ",
      "MessageIndex": 2183,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 19, 2011 09:47PM DebinUtah wrote: Taylor--I love your posts. No matter how lousy you're feeling, you give a shout-out to everyone who needs it and remember what's going on in everyone's lives.  Very cool. MizMarie--I know just how you feel.  I was pretty gung-ho for 1 through 3, but 4 was tough.  I have 5 next week, and I can't think about it or I literally start to have a panic attack.  I've just got to keep telling myself that #5 brings me that much closer to #6! Okay, so I spent some time today talking with a BC survivor who's three years out.  She told me that after extensive research on her part, she decided NOT to do tamoxifin, and her GP, who is also a survivor, told her that she (the GP) had made the same decision because of all the ways the tamoxifin screws you up.  What?!   Will we ever be done with this?  Sure, I want to live, but I want a life that's worth living!  Damn! I want ME back. I want a new and improved ME; not a screwed up ME--I want to look HOT (even if it takes plastic surgery), I want muscles, I want to run marathons, I want hair down to my a$$!  I refuse to be a victim of this sh*t for the rest of my life!  Cool--I just vented myself into a better mood.  Thanks for being my audience! Love and courage to all from HotDebinUtah",
      "MessageIndex": 2214,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 19, 2011 09:49PM DebinUtah wrote: Vivie--I posted before I saw your post.  For some reason, I've been thinking about you all day--maybe because I heard a news report about how awful things are in Greece right now.  God bless you and give you peace.  Hugs, Deb",
      "MessageIndex": 2215,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 22, 2011 12:37PM DebinUtah wrote:",
      "MessageIndex": 2256,
      "PostDate": "22/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Oct 26, 2011 04:38PM DebinUtah wrote: Ellen--I'm on day 20 of my 4th round and my eyes have run non-stop for the last week.  I am also using the moisture drops and it doesn't seem to help.  I tried Claritin and some other allergy meds and they didn't help either.  I hate it!  I feel like I'd look more myself if my eyes weren't so swollen and teary. My poor DH can't tell at any given moment if I'm crying (again) or if my eyes are just running. YaYa--congrats on the echo!  I'm in the chair for my 5th TCH on Friday.  I'm looking forward to taking those steroids tomorrow--gotta get my house cleaned :)  When you feel up to it, tell me how round 5 is going. I'm more panicky this time, for some reason, than I've been so far. Love and peace to all. May we stay sane, SE-free and prosper!",
      "MessageIndex": 2288,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 8, 2011 08:22PM DebinUtah wrote: Hey all--I've been \"thread hopping\" a bit, but I'm back.  Despite the sharing of pain/frustration/SEs we do on this thread, it's also very hopeful and positive; everyone is so supportive.  I have to admit that I got really depressed the other night reading through the HER+ thread; so many of the women are absolutely convinced their BC will recur.  I can't think that way or I'll go crazy. The hair thing: I never lost about 10% of my hair.  Now it's about an inch long and, like allformy4's, very light and sticks straight up. Very attractive. I've heard that our hair will grow back a light mousy brown/gray until the cells that control our natural color \"click\" back on. Is that true?  I can't wait till I have hair!  I said to my DH the other day (and I almost meant it) that I'd go through 6 more rounds of chemo if only I could have my hair back.  As soon as my hair is long enough to get an Ellen Degeneres hair-do I'm joining SummerGirl in the wig burning party!  I'm throwing in all my scarves and caps too!  I hate them! (Although I do have a tip for those of you going through chemo-pause with hot flashes--get one of those caps that football players wear under their helmets that wick the moisture away from your head. The one I got is from Under Armour. Great for sleeping. Maybe I won't burn that one.) IslandGirl--glad you're back and on the mend! What a wild ride! Blessings to you! Gals already doing rads--give us the scoop. What does it feel like? Any SEs? May we all be at ease. Deb",
      "MessageIndex": 2373,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 10, 2011 07:04PM DebinUtah wrote: Thanks, Ellen and Robyn for the rads info! I REALLY appreciate the details. What do they do during the cat scan? Is it like an MRI?  I'm worried that the radiation will aggravate the scar from my lumpectomy--it's just barely starting to look a little less Frankenstein-ish.  I want to get another wig; anyone have a recommendation?  The one I have now is very comfortable, but it's unstyled human hair and takes forever to do.  I want something comfy, light, short and quick.  Too much to ask? Peaceful dreams to everyone.",
      "MessageIndex": 2382,
      "PostDate": "10/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 12, 2011 01:58PM DebinUtah wrote:",
      "MessageIndex": 2406,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 14, 2011 11:40AM DebinUtah wrote: Beautiful Taylor--isn't it funny how so many people have the need to share the \"hard\" truth with us? Like we don't know it already! I had dinner with a survivor and her husband the other night.  She's a wonderful woman, and she's been very good to me, but she kept telling me how thin and lifeless my hair would be when it grew in and how crazy the Tamoxifen would make me. Finally, her husband said, \"Hey, I don't think Deb needs to hear this.\" And she said very firmly, \"She needs to know.\" Maybe I need to know FACTS; I certainly don't need to know every negative POSSIBILITY.  If I've learned anything through all this, it's that positive thinking is the only way to survive, and I want only positive people around me. Not having hair has been the absolutely most traumatic part of all this for me.  My husband has been great though; he's been collecting pictures of really short hair cuts that he thinks are cute. He's always loved long, long hair, so to have him excited about my future short hair means a lot to me. Terry71--I see from one of your other posts that your last treatment is the 17th. Congrats!  Mine is the 18th!  Rads and continued Herceptin should be a breeze after the TC, right? Hurrah for us! Vivie--I think you're one of the bravest women I know! I say trust your gut to know what's right for your body and sanity. What do doctors know?  They're poisoning us and radiating us on the CHANCE that there might be some rogue cells floating around.  It's all a giant crap shoot.  Take care of yourself and keep us posted. Terry's right: everybody, keep your chin up and smile. Love and strength to all.",
      "MessageIndex": 2419,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Nov 16, 2011 06:10PM DebinUtah wrote: Yeah, I'm with you, YaYa, I gotta admit that I love my port on infusion day.  I'm thinking about getting it out the end of April (in time for swimsuit season) when I have only 6 Herceptin treatments left.  I guess I'll always have a bad scar there either way, right?  Good luck tomorrow, Terry! Tears of JOY is right!",
      "MessageIndex": 2460,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Dec 3, 2011 03:13PM DebinUtah wrote: Sandy--my onc said exactly what yours did; I'm 49, and they're not sure if I was perimenapausal before all this or not.  I've also been doing some research of my own, and the most recent studies (some on this website) show that a combination of the two drugs over a 5-year span is actually the most effective for women like us: Tamoxifen for 2 years and then Arimidex for another 3 or vice-versa. Unfortunately, the studies also show that a high percentage of post-bc women stop taking the hormone blockers all together after 2 years because they're so tired of the SEs.  Discouraging. My GP said that the low dose of Prozac she's put me on (20 mg) should help with some of the SEs--hot flashes, insomnia, mood swings.  Let's hope!!",
      "MessageIndex": 2524,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "DebinUtah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135607/profile",
      "Content": "Jan 8, 2012 02:31PM DebinUtah wrote: Congratulations to everyone who's finishing up chemo and/or rads!  I'm over 1/3 through with rads.  I'm using the special cream they gave me religiously, but my nipple area is quite sore and my entire breast looks a little sunburned. Aquafor helps some. I can't stand the thoughts of serious burns and dealing with even more scars!  Dear Chyrs--TG you're finished with everything!  Could anything else have gone wrong? Keep us posted about your ovary.  NWArtLady--I still have a lot of blood in my mucus--is that the Herceptin or just a hang over from the chemo?  My most annoying lasting SE so far is definitely the neuropathy in my fingers--my nails are all discolored and my fingers are pretty painful--even with the gabapentin :-(   Most of my eyelashes feel out last week (6 weeks PFC)--kind of a drag.  Regardless, I'm soooooo happy to be done with chemo! I've been on Tamoxifen for over a month now, and I haven't really noticed any changes in my moods or sleeping patterns. Knock on wood!   Peace, joy and  strength to everyone!",
      "MessageIndex": 2581,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    }
  ]
}