{
  "AuthorID": "debman",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
  "Posts": [
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Aug 13, 2007 07:32AM debman wrote:",
      "MessageIndex": 1,
      "PostDate": "13/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/675857",
      "Title": "Lousy Scan Results & Change to Xeloda /Tykerb Anita1969 EstherCA"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "May 28, 2008 05:02AM debman wrote: Deb- You are in my thoughts and prayers. take care. Debbie",
      "MessageIndex": 14,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706151",
      "Title": "Slonedeb sending out prayers! LuAnnH shrink"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Nov 15, 2007 08:09PM debman wrote: Kari- I'm so sorry to hear the news. You might want to check out Dana Farber in Boston - my uncle had stage IV colon cancer to his liver (this was a reoccurance) - they went in one day - froze his liver, put something in it and now, 3 months later, they tumors are gone. I don't know exactly what it's called but I asked my doctor about it and he said yes, we don't have that in DSM so I said...you know if it goes to my liver, I'm going there.  I bet if you called them - they are in Boston though- they could tell you more or if anyone in your area is doing this procedure. My thoughts and prayers are with you.  Keep that hope. :) Deb",
      "MessageIndex": 58,
      "PostDate": "15/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693703",
      "Title": "KariLynn-how are you? Bugs 73gr"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "May 22, 2008 12:31PM debman wrote: I've had 3 rounds of Avastin with my navolbine and it's one of the easy ones. I've had a few times where there was some blood in my nose but that's it and my numbers are going down by lots so I'm fine with a little bit of blood. LOL :)  My blood pressure has gone up some but I had really low blood pressure (90/60) before so it hasn't been a problem. The only thing I'll warn you about is the price. It costs my insurance company about $7500 a week (I get it every three weeks) so please make sure your insurance will cover it.  We actually got them to write a letter becuase I told my doctor if it wasn't covered, I would need to start to decide which one of my children wasn't going to college. LOL :) I hope it works for you.  So far, it's had great success with colon and ovarian and now breast so that's a good sign. :) Deb",
      "MessageIndex": 11,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705622",
      "Title": "Surprise AVASTIN tx today! badboob67 ali_lpn"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "May 22, 2008 07:45AM debman wrote: I have tons of bone mets (think Christmas tree on scans LOL :) ) but they have been there for 4 years so... I will tell you that my bone scan was negative when I was first diagnosed but the MRI done the same day on my right hip showed a 10 cm tumor. I think that different tests work for different people. They now have a PET/Bone scan but my oncologist likes the PET/CT and then a CT of my head each time. I know that other doctors have told me though that I'm in the minority with the bone scans not working.  Deb",
      "MessageIndex": 26,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698330",
      "Title": "PET Scan vs, Bone Scan JoyRebecca nuclear1"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "May 23, 2008 02:38PM debman wrote: I know how stressful these scans are at least for me.  I hope and pray that you got good results. Deb",
      "MessageIndex": 9,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705823",
      "Title": "leaving for another pet scan jerseymaria LumiPojo"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "May 27, 2008 07:53PM debman wrote: I am so sorry to hear your news.  I know how shocked I was when I found out. I was diagnosed in 9 of 03 with stage 2A - 2 cm tumor and 1 out of 28 lymph nodes positive and six months later (5/04), I had a 10 cm tumor in my right hip. I'm also ER+ but only slightly and HER 2 -. Hormones didn't work for me but if you are more ER + they should work for you and there are SO many now. I've been on chemo most of the time. I have to tell you though that in September, it will be five years (they obviously misdiagnosed me the first time since the tumor was so huge in my leg). I have a great life - I go to chemo once a week but I feel great and am still doing lots with my kids (age 8 and 6(twins)). I know this feels so overwhelming to you at this point (at least it did for me) but bone mets is VERY treatable and people have survived for years with it (some 20+).  Dr. Susan Love has a great quote that I live my life by - \"if just one person has beaten the odds, there is nothing standing in your way for being the second\" - or something like that. :) You are in my thoughts. Deb",
      "MessageIndex": 8,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706256",
      "Title": "FRom A 11 to Iv in 30 seconds Dragonfly-4 Gitane"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "May 22, 2008 07:38AM debman wrote: Congratulations. I'm doing the happy dance for you and yes, we want to hear the good news.  Dr. Susan Love has this quote - if just one person survived the odds, there is nothing standing in your way to be the second\". I LIVE by that and I love hearing inspiring stories. :) Deb",
      "MessageIndex": 9,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705914",
      "Title": "3 months of treatment verdict in heatherpalmerton heatherpalmerton"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Oct 29, 2007 07:05AM debman wrote: I've had bone mets since 5/04. Have been on EVERY hormone known to man (I was ER+) but they didn't work. I was on Xeloda from 1/05 until 7/07 and that worked wonders. Started Gemzar on 8/07 - just had PET scan that showed stable mets (no organ involvement) and my CA 27/29 went from 333 down to 221 after two rounds. Hoping to get the CA 27/29 back down to 28 (which it was a year ago this summer). I also don't eat sugar.  Nothing white (potatoes, pasta, etc.) and take a regular vitamin, calcium and 1000 mg of vitamin D a day. Hope that helps. You CAN survive this. Deb",
      "MessageIndex": 52,
      "PostDate": "29/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/691993",
      "Title": "bone mets survivors riverinerabbit mom2acat"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "May 29, 2008 05:33PM debman wrote: I can totally relate to that.  The scans make me insane so much so that my doctor and I have an agreement that I'll get them every three months ONLY if he'll call that night with the results.  I have such a great doctor. I know. LOL :) Nothing like being high maintanence right. Anyways, I had mine on Tuesday and got great results - still bone only disease and bones look better than they had in January. Hope you get positive news as well. I have had the techs ask me weird questions in the past - worried all day and then found out I was fine. I've asked me doctor why they asked those questions adn he had no idea. And....about the extra pictures - the last time they did that to me - they did it because they thought they were new mets but when the senior radiologist read them, he said they were healing bones but he said that these scans are really hard to read for someone who isn't used to looking at cancer scans.  I was FREAKED though when I left because what should have taken 45 minutes took 2.5 hours.  I spent so much time worrying. You think I would have learned after that one but apparently I'm a VERY slow learner because every time I have them, I get myself into a tizzy. LOL :)  It's so hard for me to not think...what if. not sure if any of this helps but sending prayers and good thoughts your way. Deb",
      "MessageIndex": 17,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706107",
      "Title": "Its that time again...Scanxiety Kasey Kasey"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Jun 12, 2008 04:46PM debman wrote: P.S. I know what you mean about just wanting to be with teh kids. When we got the news the second time, my oldest was 4 and the twins were 2, I hung out for DAYS with them in my walk in closet.  I told them that was a \"magic\" place where nothing bad could happen.  We brought in books and snacks, blankets and pillows.  We had a ball and I just remember thinking, I never want to leave this place. LOL :)  I know a bit CRAZY but it worked for me. LOL :)  My kids were so young that there was no way that they could understand.  For the record, they still don't know that I might not make it.  We live happy, normal lives here. They know I have cancer (and will share that info with everyone including the clerk at the grocery store LOL :))  but I haven't had the talk with them and don't plan to until I'm sure I'm not going to make it. :)  I know everyone doesn't do it this way but it works for us.",
      "MessageIndex": 25,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707172",
      "Title": "New Phase in the journey?? Fitztwins wallan"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Jun 12, 2008 08:11PM debman wrote: Janis- My twins were so young when I was diagnosed that they have no memories of Mommy not being sick. Matthew, my oldest does, though.  It totally does suck but I have to tell you that when I get on here and find that someone who was diagnosed after me is no longer here, I remind myself every morning how blessed I am. I do get tired and I have gone through some horrific things (I fractured my neck in November), I always seem to bounce back though.  Dr. Susan Love has a quote that goes something like - if just one person has beaten the odds, there is nothing standing in your way to be the second and I live by that every day. If it is contained to your bones and if you are interested, MDA is doing a stem cell trial. I'm going down on July 9,10, and 11 to redo all my testing (including biopsy) to see if I officially qualify. The cool thing is my insurance company has approved it and I just got a form today saying that they will also pay my travel expenses (I have NEVER had an insurance company do this before - I was in SHOCK when I opened the envelope).  Anyways, the doctors name is Ueno and you can find him on their website.  If I qualify, I'm going for it. There have been so many success stories from the 90's where women my age had the treatment and are still cancer free (the lady who wrote the Red Devil book I think is one of them).  100 days away from my kids makes me cry every time I think about it but I feel like I have to give this a shot. Anyways, you are in my thoughts.  You can do this girl. :)   It's not the life I would have chosen but then again, I've learned to slow down and smell the roses because of it - I was pretty task oriented before this. I said to my kids one day....it must be hard to have a Mommy that is sick and Matthew said....I don't mind Mommy - you cuddle more when you are sick. Amazing how they see things. My kids have done extremely well but there were some problems this last year when I fractured my neck - the brace, the hospital stay, everything freaked them out and they got scared. I had the guidance counselor at school work with them adn I think she really helped them.  I let everyone at school know what's going on at home but I tell them that the kids do not know this is life threatening.  My thought is....if they see a change in behavior - I want to know immediately not have them wait and see. Glad you have those scrapbooks. I find that my journaling is less about the event and more about what i see in them.  I hope to be around when they graduate from COLLEGE but I have learned to hope for the best and plan for the worst.  Although, I just don't have the feeling (at least right now) that I'm going to lose this fight. It could be denial- who knows but that's my story and I'm sticking to it. LOL :) You are in my thoughts.  Hang in there. This part was the worst for me - I think the not knowing is always worse for me than knowing. Once I know, I feel like I can get my action list in gear and start solving. Take care. Deb P.S. Sherri, your son may remember. My oldest, Matthew, was 4 when I was diagnosed adn he often tells his brother and sister - Mommy used to be able to do cartwheels. LOL :)  For some reason, he thought that was REALLY cool. :) It's definately hard on kids though and honestly, they need to figure out what's going on because there are too many of us young moms who are going through this. I still can't figure out why I got it - no family history and a vegetarian - my theory is either all those pesticides or diet soda.  Who knows. You are ALL in my thoughts today. Enjoy the day. :) Deb",
      "MessageIndex": 28,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707172",
      "Title": "New Phase in the journey?? Fitztwins wallan"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Jun 18, 2008 05:43AM debman wrote: Janie- Thanks for passing on Tricia's message. I never would have seen it since I'm HER2-.  WOW...did I need that tonight. Simply amazing. Deb",
      "MessageIndex": 46,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707172",
      "Title": "New Phase in the journey?? Fitztwins wallan"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Oct 8, 2007 12:07PM debman wrote: I am so sorry you got this news. I know I've had those days where my mind goes places it shouldn't. I was diagnosed with stage 2A in 9 of 03 and stage IV (bone mets) in May of 04.  I've been on hormones (which didn't work) and then starting in Jan of 05, I went on Xeloda - it worked amazingly for me for 3 years. I just recently switched to Gemzar and I'll find out on the 24th of this month if it's working. I do take supplements but do check with your doctor as some interfere with treatment -when I'm on hormones, I take CoQ10 but I'm always pulled off of it for chemo. While I'm on chemo this time, I'm taking vitamin D since there has been so much in the news lately about the affect of vitamin D on breast cancer - I also take calcium since I have extensive bone mets (think PET scan looking like Christmas tree).  I also do not eat sugar or anything white. I know there is a not a lot of studies on this but I swear, it's one of the things that has helped my fight.  I stopped eating it after my first PET scan. When the doctor came in explaining the procedure and said they would put glucose in my body to determine where the cancer was - I asked why.  When he said because cancer cells like glucose - I thought to myself - why would I willingly put it in my body? I also avoid alcohol except a margarita about once or twice a summer.  There is also too much info on the affects of alcohol on breast cancer. Bone mets is treatable.  There have been some women that have had it for 20 years. It's hard at times - I've done hormones, radiation and a variety of chemo. We always try to stay one step ahead of it but I'm here and that is what counts.  I just celebrated my four year anniversary as a cancer survivor. Also, the stats since when I was diagnosed and now have changed.  They have gone up 12% in that time period.  My thought is the longer I can make it, the more chances there are of something new coming out. I know getting this news is so hard on your spirit but please know that you CAN do this. I wish you the best of luck with the rest of your results. I know how hard it is to wait. My next PET/CT is on the 22nd and I'm already freaking out. Thinking of you. Debbie",
      "MessageIndex": 14,
      "PostDate": "08/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693344",
      "Title": "scan results..numb beyond belief mjcs7 KariLynn"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Dec 2, 2007 05:18PM debman wrote: Thanks for posting.  It's weird but I never think I won't make it so when I read something like that, it freaks me out. Not sure if it's denial or what. I hope I hear back from DF tomorrow - if not, I'm going to call. I just did a promotional DVD for them (from here). It's a DVD requesting funds for research into cancers that affect people from 15-40 so I'm hoping they'll get me in soon. Thanks again for posting. If anyone else has had this happen or knows someone, please post for me. Thanks. Deb P.S.I'm slowly backing away from the ledge thanks to you guys. LOL :)",
      "MessageIndex": 3,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696308",
      "Title": "Pathological fracture C2, C3 - anyone else heard of this? debman TrudiS"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "May 29, 2008 05:21PM debman wrote: LuAnn- Will you tell us what your doctor thinks. Mine is never that excited about these remedies. I was taking CO-Q10 when I was on hormones but I was told I had to go off of it when I went back to chemo because it protects all cells - good and bad and they were afraid that the chemo would not work on the bad cells if I took it.  Wondering if he'll tell me the same thing about this one. Thanks for posting this.  It's nice to know there might be a more gentle way to add a 40% increase in survival - that's incredible. Deb",
      "MessageIndex": 7,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706382",
      "Title": "Who knows anything about Iscador? LuAnnH debman"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "debman wrote: Hi everyone- I know I've been missing for a few weeks. I went into hte ER on 11/18 for neck pain and was immediately admitted because the CT showed a pathological fracture of C2 and C3.  I'm now out and have my last day of radiation on Tuesday. I'm wearing a collar and waiting to hear back from Dana Farber on a second opinion. Has anyone heard of anyone with this? Or has anyone else had this happen? I went online today and the survival stats for this happening were 13-27 months after the fracture.  I'm in shock right now because I'm planning on surviving this for a long time as it's \"only in my bones\" but now, I'm wondering if this is the start of the end.  That'll teach me to go read stuff online.  I can't figure out when it was written and I'm trying not to freak out but it's not working. Anyone have any thoughts?  The PET/Ct and MRI did NOT show this fracture only the CT scan and the way the radiologist oncologist explained it to me is there is tumors in the front and back of my neck instead of bones but he said they are both little.  The neurosurgeon scared me and said I was one step away from Christopher Reeves but...I have talked to his office since then and they did admit, that they have never seen this before which is why I'm trying to get into Dana Farber. i'm sorry for going on and on. I'm scared.  I have so much more to do and I think this one is scaring me more because I can't drive and it's one of the first times that my freedom has been taken away. Can anyone help me down from the ledge??? You are all in my thought and prayers daily.  Just remember (as I do every day) that EVERY day we survive, they are ONE day closer to finding a CURE for us. :) Take care. Deb Dx 5/27/2004, IDC, 2cm, Stage IV, Grade 2, 1/28 nodes, mets, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696308",
      "Title": "Pathological fracture C2, C3 - anyone else heard of this? debman TrudiS"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Dec 2, 2007 05:57PM debman wrote: Luckywife- I'm going to go look at that website now but I wanted to let you know that I had hip pain like that a year and a half ago and underwent a hip replacement on my right hip.  The pain went immediately away after I got out of surgery and I no longer limp. That was one of the best things I ever did. I was told here in Iowa that they didn't do it but in Boston, they've been doing hip replacement on breast cancer patients for 9 years. I hope it's just arthritis or something but I just wanted you to know there was an option out there for you. I'm off to look at the website now. Thanks. Deb",
      "MessageIndex": 6,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696308",
      "Title": "Pathological fracture C2, C3 - anyone else heard of this? debman TrudiS"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Jun 12, 2008 08:18PM debman wrote: P.S. To those of you out there that were recently diagnosed- I was told in 5/04 that I wouldn't see my twins start kindergarten and on 8/22/07, I walked them both into their classroom. I also got to see my oldest make his First Communion this year.  The doctors have to give you the worst case senario but they don't know YOU. It's just their OPINION.  They give you the statistics. Here is a funny story- about a month after they figured out it was in my bones (after 6 months of me telling them it was there and them telling me I was wrong), the Red Sox were playing the playoffs (I'm originally from Boston). I remember the night they won the first game after being down by 3. My husband (who has one of those financial/statistical minds) said to me...you know they are never going to win, right? I said...why would you say that. He said...statistically, no one has ever come down from 3-0 to win.  I got angry and said....that's like telling me that because no one has beaten breast cancer, that I can't.  That's crazy. Of course, the Red Sox DID win the world series that year and ever since then, I knew this was something I could do. I know...crazy story but that day he said that to me has always stuck out in my mind.  Not sure if anyone will get anything from it but I thought I'd share and now that I'm thinking about it, I think I might scrap that for my kids.  That would be a great story to share with them. Ok...enough online. I need to go FEED these kids. Deb",
      "MessageIndex": 29,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707172",
      "Title": "New Phase in the journey?? Fitztwins wallan"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Oct 29, 2007 10:22AM debman wrote: I was on this drug from 1/05 through 7/07 and it worked WONDERS for me.  As far as the hand/foot, as your mom's oncologist for a script for Biafine - it works amazing.  A few other tips, have her take a Gas X right after eating each meal, it lessens the tummy pains from gas. I always had one really bad night a cycle when I was in the bathroom all night but it was SO worth it as it kept my cancer at bay for so long and I have really young kids. Hope this helps and I really hope it works as well for her as it did for me.  Just so you know, it took two rounds of Xeloda for it to start working  - my numbers always went up after the first round and then really down after the second round. Take care. Deb",
      "MessageIndex": 6,
      "PostDate": "29/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694552",
      "Title": "Xeloda how sever side effects are anitakumar debman"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Jun 7, 2008 12:25AM debman wrote: Bonnie- Bone mets are very difficult to read.  Please make sure that you get a second opinion on the scans.  I have had mets for a long time and in January of 05, I was told that they had doubled in size and amount here locally. I took the SAME films to Dana Farber in Boston and the doctor said...those aren't new spots, they are healing bones. I can't remember exactly what he said but it was something like if they look scelotic, they are actually healing. They are going to show up for a while.  Not sure what type of scans you had but you might want to ask if it's a possibility, expecially since it worked on your liver mets. now, when I have a scan done, we wait until one of the senior radiologists reads it. My doctor felt so bad about this when it happened.  He was going on what the radiologist said and according to him (as well), bone mets are a hard read. HTH and makes sense.  It's late and I should be in bed but I just wanted you to know that this happened to me.Deb",
      "MessageIndex": 2,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706888",
      "Title": "Scans back BonnieVA LuAnnH"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Jun 12, 2008 04:41PM debman wrote: Janis- I've been gone from the boards for a couple of days but was so sorry to read this, this morning. You were one of the first people that emailed me when I joined this after finding it went to my bones in 04. I'm not sure where it is in your body but please keep hope.  It will be five years for me in Sept (dx 5/04 with bone mets but since it was a 10 cm tumor in my right hip- they told me it had been there all along).  Anyways, I have a great quality of life - I'm on Navolbine, Avastin and Zometa at the moment - I get tired but not horrible (I had a dinner party here last night and have done stuff with my kids every day they have been out of school). Man...I'm just so angry you got this news.  As far as people who complain about stuff, I've had a problem with that as well but I try to remind myself that whatever they are complaining about is important to them. For me though, I've gotten so much more laid back which is amazing cause I'm the typical type A. LOL :) Lots of thoughts and prayers coming your way.  I haven't done journals for my kids although I may do those but I do scrapbook as much as possible for them. I also try to create really great memories.  I did realize yesterday that because of what I go through, my kids are learning so much more at an early age.  As I mentioned I had a dinner party yesterday, the 8 year old peeled the carrots, washed the potatoes, etc and the 6 year old twins, cut up the strawberries, cleaned the blueberries, etc.  They were SO proud of themselves and I was so thankful for the help. Anyways....long, long tangent here (must need more coffee) but I just wanted you to know I'm thinking of you and yes, cancer sucks. Deb",
      "MessageIndex": 24,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707172",
      "Title": "New Phase in the journey?? Fitztwins wallan"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Dec 2, 2007 04:33PM debman wrote: CONGRATULATIONS.  Never, never stop sharing good news. We all need to hear about the successes (IMO). So happy for you. What a GREAT Christmas gift. :) Deb",
      "MessageIndex": 18,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696265",
      "Title": "Good news amongst the bad..... mrs_X_Sunneedazee mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "May 29, 2008 05:25PM - edited May 29, 2008 05:25PM by debman I have had this too but I thought it was the chemo. My teeth have become horrible and I know brush a zillion times a day because I'm so self-conscious of them.  I never thought of Zometa though - I always thought it was the chemo. BTW, for anyone who is on Zometa, please know that you need to go OFF Zometa before you have dental surgery(normal cleanings are fine as long as they don't go below the gum line) as it can cause a jaw problem.  I can't remember the exact wording but if you google it, I'm sure you can find it. ",
      "MessageIndex": 6,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706393",
      "Title": "bisphosphonates ozzie2 Kasey"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "debman wrote: Hey everyone- I'm coming to you again for answers. Does anyone who have lung mets remember if one of the first symptoms they had was painful ribs (left side lower and right underneath my arm pit on right side). I do have bone mets and extensive bone mets (ie. every vertabrae in back, bilaterial ribs, bilateral pelvis, etc.) I was on Xeloda for three years with great results (my miracle drug) then the lowered the dosage and it started to stall out - they added Tykerb and it totally didn't work for me - got all the side effects (rash, etc) with no results. On June 20th, I had a PET/CT that showed no organ involvement - the did two more rounds of high dose Xeloda but I'm feeling worse and TM's are going up. So....I'm wondering if these new pains are more bone mets - although I've never had both ribs hurt at once or if I should ask for a chest xray when I go in on Wed. to rule out lung mets. I just thought I'd ask those of you who have gone through this if this was one of your symptoms. If not, did you have other symptoms? I hate how this disease makes you doubt yourself. I try NOT to think of every ache and pain in terms of breast cancer but some days, I just can't. Thanks everyone (in advance). Take care. Deb Dx 5/27/2004, IDC, 2cm, Stage IV, Grade 2, 1/28 nodes, mets, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/670976",
      "Title": "Lung mets symptom? debman RobinWendy"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Aug 6, 2007 05:28AM debman wrote:",
      "MessageIndex": 2,
      "PostDate": "06/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/670976",
      "Title": "Lung mets symptom? debman RobinWendy"
    },
    {
      "AuthorID": "debman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/6348/profile",
      "Content": "Aug 6, 2007 11:03AM debman wrote:",
      "MessageIndex": 5,
      "PostDate": "06/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/670976",
      "Title": "Lung mets symptom? debman RobinWendy"
    }
  ]
}