{
  "AuthorID": "DeborahC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
  "Posts": [
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Oct 15, 2012 02:01AM DeborahC wrote: It all depends on what you decide on type of surgery.  If it is BMX with reconstruction I would recommend getting help with the 4 kids if they are very young.  I had no problem taking care of myself, but it would have been difficult having to take care of kids.  My dog was no problem.  She seemed to know what to do.  I would say the BMX with reconstruction was harder recovering from than C-section.  The pain lingered longer and it is hard to do without your arms.  I remember the doorbell kept ringing and delivery men would place a vase of flowers in my hands and I couldn't even hold it.  Even opening jars was hard.  I seem to be the wimp in this group however. ",
      "MessageIndex": 14,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794924",
      "Title": "scared how much it is going to hurt Mother4Life curveball"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Oct 9, 2012 07:52AM DeborahC wrote: Dulci, TE's look fine and don't need any camo.  You will want button front shirts because it will be hard to raise shirts over your head.  They will fill the TE's a little during surgery so you will not be completely flat.  They will slowly grow as you do the fills.  They are smooth.  They sit high and you will look quite buxom as you get filled.  They are hard and do not \"sit\" in a regular bra.  I bought some cami type bras (Gap has a nice one) and some Danskin sports bras that zip up the front (Walmart) - these are easy to put on and they hold their shape from flat to filled).  I bought these in the size I was pre-BMX. Good luck with all the mastectomies.  I am having my exchange next week. I'm not as nervous as I was for BMX, but still nervous.",
      "MessageIndex": 79,
      "PostDate": "09/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Oct 10, 2012 07:34AM DeborahC wrote: Connie, the PET scan is an easy one.  You follow a low carb diet the day before.  Then on the day of the test you have to sit quietly in a chair and they inject you with this radioactive sugar solution.  You sit still for awhile (an hour or so I think) while it goes through your body.  Then you go in for the scan.  You just have to lie still (face up) on the table while they scan.  If you are a little claustrophobic ask for an eye shade or just keep your eyes closed.  It is not loud like the MRI.  I actually fell asleep. Any areas of rapidly growing cells will light up in the scan.  Don't freak out if they see more on the scan than just your tumor - other things can cause uptake.  My ovaries lit up (ovulation).  ",
      "MessageIndex": 89,
      "PostDate": "10/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Jun 14, 2015 05:25PM DeborahC wrote: Nucynta is what worked for me. Everything else makes me throw up. In the hospital they gave me IV tylenol which was very effective. Good luck!",
      "MessageIndex": 2,
      "PostDate": "14/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/832611",
      "Title": "Pain Meds make me vomit! What do I do? MizMimi JanS1234567890"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Apr 9, 2012 04:47AM DeborahC wrote: HI everyone, I had Stage 2 HD back in 1992 and had laparotomy/splenectomy and extended field radiation (upper abdomen up to my ears).  I was diagnosed with BC in left breast in Feb 2012 (2 cm lump).  They recommended single mastectomy and said double was personal preference.  As MRI showed some suspicious areas in right breast and for peace of mind, I chose double mastectomy.  I chose TE's because I thought the surgery would be shorter and not require any more skin (after previous abdominal surgeries wasn't sure I would recover well).  I had my surgery 2 1/2 weeks ago. I am pretty good during the day, but still having trouble sleeping. It has been more painful than I expected - these expanders are tough. I am trying to wean off the pain pills. The skin looks like it is healing nicely, however.  Pathology was pretty good - only 1 tumor (just over 2cm) and no lymph node involvement.  They may start expansion this week depending on how I am feeling.  I am anxiously awaiting my oncodx score.",
      "MessageIndex": 111,
      "PostDate": "09/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Jun 18, 2012 10:34AM DeborahC wrote: Hi, Michelle.  I was wondering the same thing.  Most of us seem to have IDC - but that could just mirror the general population.  I am now also getting basal cells in the chest area.  It's funny - About 6 months ago I was just starting to do some research and reading about our risk of BC and how some women were even getting prophylactic BMX's.  A few months later I found my own lump.  I hope this doesn't happen when I start looking into all the heart issues I am now hearing about!",
      "MessageIndex": 150,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Mar 30, 2014 05:57AM DeborahC wrote: I found this article (that I also posted on Facebook) for those of us with HL and BC. http://www.ncbi.nlm.nih.gov/pubmed/20975072 \"Women with HL may survive a subsequent diagnosis of BC, only to experience significant excesses of death from other primary cancers and cardiac disease. Greater awareness of screening for cardiac disease and subsequent primary cancers in patients with HL-BC is warranted.\" Nothing we don't know - but the graphs were interesting - our survival rate really plummets after about 15 years. ",
      "MessageIndex": 249,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Jun 9, 2012 06:16AM DeborahC wrote: I had annual mammograms, but they did not pick up my BC.  I found it myself.  Then when I did go for MRI there were lots of other areas they saw - but they all turned out to be nothing.  So I see what they mean by false positives.  Lifelover - I also remember my RO telling that my risk of breast cancer was very very small, but higher than the average persons.  The study they released in Chicago last weeks showed that of the young girls treated for Hodgkin's - 30% have breast cancer by age 50.  I did not think our risk ever declined for this.",
      "MessageIndex": 142,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Aug 22, 2012 08:24AM DeborahC wrote: I had the laparatomy/splenectomy surgery and then radiation (extended field).  The BC appeared about 20 years later.  I have the other usual problems - dead thyroid, mild lung issues.",
      "MessageIndex": 174,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Oct 29, 2012 05:26AM DeborahC wrote: Michelle, Your appointment sounds awful.  Since you seem to have a chemo plan, I assume you got it sorted and saw the consultant who was better informed.  I see the same oncologist that I saw for Hodgkin's follow-up, and even she slipped once and said \"Maybe we'll do radiation.\"  I had to remind her that was not an option.  Can any of you tell me what types of tests you have had to check on your heart and lung function, or how you knew you had a problem?  I have had mild shortness of breath and rapid pulse for the last several months.  I don't know if it's heart, lung, drug related (I've added tamoxifen and warfarin in this time) or these implants squeezing my lungs:)  I had an EKG and a CT angiogram so far.  I don't have the full results yet, but was told they were \"fairly normal\".  As soon as I am recovered from this last surgery I guess it's time to see a cardiologist.",
      "MessageIndex": 211,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Apr 18, 2012 05:49PM DeborahC wrote: Wow mariwyl - a 1975 HD survivor!  I also went the BMX and expander route for similar reasons.  That was almost a month ago.  I had my first fill today that was delightfully easy.  I get to skip chemo (11 oncodx score) and will soon start Tamoxifen.  Every step makes me nervous and I am now dreading the swap surgery.  I am back at the same cancer center and still hate walking back into that place. ",
      "MessageIndex": 123,
      "PostDate": "18/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Jul 18, 2012 02:29PM DeborahC wrote: Michelle, I'm so sorry that you now have BC.  It is so hard to have to go through this again.  I walked around in a fog for awhile.  Once you have a plan you will hopefully feel more in control.  I hope to finish most of my reconstruction in September and am looking forward to having most of this behind me (just the Tamoxifen to take, which has not been a problem).  I am coming to the UK in a few weeks for the Olympics.  I did not want to travel that far with these awful tissue expanders, but the PS felt it would be rushing things to try to do the exchange first. Good luck with your consultations.",
      "MessageIndex": 166,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Oct 4, 2012 07:21AM DeborahC wrote: Hi Traii, Sorry to meet you in this \"club\".  I often wonder if it's harder for us or easier for us having been through this before.  We know we can survive, but we are also worn down.  I had a newborn when I had my Hodgkin's radiation and they did a few things to preserve fertility.  I don't know anything about chemo.  I decided, however, that given my health (I had a clotting disorder that also made pregnancy difficult) one was enough and I was just tired of doctors and decided to enjoy life. I would certainly ask the doctors what can be done just so you have the option of having more children if you want them down the road.",
      "MessageIndex": 200,
      "PostDate": "04/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Jun 22, 2012 11:15AM DeborahC wrote: Hi Gaye,  It is hard knowing exactly what to do with our previously radiated skin.  I was advised not to do skin/nipple sparing as my tumor was close to the nipple.  I worried about the long surgery, my clotting history, and my skin with any kind of flap surgery.  I chose the tissue expanders.  Of course, I then worried about how far my skin would stretch with expanders.  I am now \"filled up\" and the skin looks pretty good.  I will exchange for implants in a few months.  I don't know much about it - but if you could do skin sparing and go straight to implants that would probably not be a long surgery.   You may want to search these boards and read about the center in New Orleans (people seem to love it) if you want to travel and have a tricky reconstruction.  I am 50 and 20 years out from my radiation.",
      "MessageIndex": 154,
      "PostDate": "22/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Aug 21, 2012 06:59PM DeborahC wrote: Hi Michelle, I am also doing the tissue expanders/implants.  The radiated skin seems to be stretching and healing just fine, but I am going to stay on the small side just to be safe.  I was afraid of the longer flap surgeries (and I get blood clots).   I am not doing chemo (low oncotype dx score said that it would not help).  It is scary to think about more recurrances. I am on a long term survivor listserve and it scares the heck out of me when I read all the problems the HD survivors have.   I assume I'll just stop worrying about it after a few years :)  I guess I should go see a cardiologist, however.",
      "MessageIndex": 171,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Aug 23, 2012 06:06PM DeborahC wrote: This study says that while our risks are higher to get BC and we don't usually get radiation again, the prognosis is similar for anyone else with BC http://intl-jco.ascopubs.org/content/18/4/765.full This study (while small) says we do fine with TE's and implants after radiation www.ncbi.nlm.nih.gov/pubmed/11... I don't like seeing that 55% ten year survival for Stage 2.  I guess I didn't realize it was that low.",
      "MessageIndex": 181,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Sep 3, 2012 08:05AM DeborahC wrote: Hi Lori and Hodel, I was also afraid of the AI's so I am starting with tamoxifen even though I have a clotting disorder (also now on coumadin).  I have had no problems with the tamoxifen.  The first few weeks I did feel a little crabbier than usual and worried about depression but now I seem to be fine.  I will probably switch to the AI's at 2 1/2 years and see how that goes.  I agree that I might just take my chance with recurrence if the side effects were that bad. ",
      "MessageIndex": 193,
      "PostDate": "03/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Jun 28, 2014 06:25AM DeborahC wrote: Hi kimag, yes of course you are in the right place.  There are many of us out there in your situation.  This board is not very active.  There are Facebook groups where more people share info  on long term lymphoma problems (unfortunately the one I am in does seem to limit it to Hodgkin's).  We all have the same problems - breast cancer, hypothyroidism & thyroid cancer, lung problems, heart problems, muscle problems, basal cell carcinomas. You are probably cured from lymphoma, but the late effects of radiation continue.   As far as tests - mammograms/MRIs, stress tests (for heart), blood tests (esp thyroid function), a thyroid ultrasound, skin cancer screens are what I get. MSKCC has some resources on their website http://www.mskcc.org/magazine/may-2009/late-effect...",
      "MessageIndex": 252,
      "PostDate": "28/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Jun 28, 2014 10:25AM DeborahC wrote: No I do not get any kind of mammogram or breast MRI anymore.  My hematologist recommended a baseline echo/stress test at about 20 years out from radiation.  I don't know how often I will repeat this - probably only if I am having problems.  Many people in the HL Facebook group have had valve replacements - but they all seemed to have serious symptoms for years.  I was having shortness of breath before one of my surgeries, and they also did a cardiac CT (which was normal).   I wonder why there are more Hodgkin's support groups - most of our problems seem to be from the radiation, and I would imagine NHL had just as much.",
      "MessageIndex": 254,
      "PostDate": "28/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Jun 6, 2012 03:21PM DeborahC wrote: I am taking tamoxifen (just started last month).  I still have the expanders for a few more months.  I keep hearing that 10 year life estimate on the implants and I am just hoping that it will at least make it 20 years, because I am tired of surgery.",
      "MessageIndex": 134,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "May 14, 2012 10:01AM DeborahC wrote: I was pregnant when I had lymphoma and they removed a tumor - just did it under a local.  It sures makes the recovery easier. ",
      "MessageIndex": 13,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/787002",
      "Title": "surgery monday- just found out I'm pregnant. help? caybarbe LAstar"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Jul 12, 2012 05:51PM DeborahC wrote: Annie,  There are lots of us former Hodgkin's patients here.  There is the thread posted above and also http://community.breastcancer.org/forum/27/topic/733882?page=1  Most of us did the bilateral mastectomy.  A few have had additional radiation (different type) and lumpectomy.",
      "MessageIndex": 2,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790463",
      "Title": "DCIS - treatment options following Hodgkins disease Anniet Anniet"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "May 29, 2012 10:21AM DeborahC wrote: Are you on an antibiotic?  It's probably from that.",
      "MessageIndex": 1,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788235",
      "Title": "After Surgery Question Lortiz28 jlmg"
    },
    {
      "AuthorID": "DeborahC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148752/profile",
      "Content": "Jul 6, 2012 01:20PM DeborahC wrote: Ann, This not typical!  Things always move slower than you think, but my surgeon always called by the end of any business day when he had results or if I called.  He coordinated everything with the PS before and after my consult. Same with my MO.  I am surprised that you have already seen an MO and RO.  My BS ran the show until after the surgery (other than PS consult).  I would be very frustrated also.  Good luck with the appointment.",
      "MessageIndex": 1,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790173",
      "Title": "Finally, my follow-up with MO is today, angry going into it _Ann_ christina0001"
    }
  ]
}