{
  "AuthorID": "DebraC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284431/profile",
  "Posts": [
    {
      "AuthorID": "DebraC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284431/profile",
      "Content": "Mar 2, 2019 09:25PM DebraC wrote: I’m fairly early in this journey. Too early for reoccurrence. Diagnosed in January, just got my Oncotype score....63! Anyone else have that high of score? My doctor said I almost broke a record for him, one other at 70. Didn’t want to be breaking that kind of record. Will have second lumpectomy on Wednesday for more clear margins, then start chemo in April. A lot to wrap my head around.",
      "MessageIndex": 20,
      "PostDate": "02/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869287",
      "Title": "Roll call - Oncotype Score, Length of Time and If Recurrence Sadlynew2018 Rwns"
    },
    {
      "AuthorID": "DebraC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284431/profile",
      "Content": "Mar 3, 2019 04:41PM DebraC wrote: Everetta, oncologist kept mentioning “my tumor was large 2.7cm and I’m young” Really,,, I’m 56, post menopause. I’m 100% ER +, Don’t have the actual report yet, this info from his phone call to us. Will meet with him on 3/19.    ",
      "MessageIndex": 23,
      "PostDate": "03/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869287",
      "Title": "Roll call - Oncotype Score, Length of Time and If Recurrence Sadlynew2018 Rwns"
    },
    {
      "AuthorID": "DebraC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284431/profile",
      "Content": "Mar 5, 2019 10:07AM DebraC wrote: Hi Unbreakable, I will be having 4x TC starting the first week of April. So I’ll be following your experiences. Second lumpectomy scheduled for tomorrow, want more clear margins. Kimg and fallschurchgirl - Oncotype was done to determine IF I would need chemo. It came back super high, 63! Doctor was surprised so high, although he felt I would need chemo. I’m E positive, 100%. Best wishes to you all as you go thru this journey, I’m right behind you. Debbie",
      "MessageIndex": 59,
      "PostDate": "05/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "DebraC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284431/profile",
      "Content": "Mar 10, 2019 07:57PM DebraC wrote: Hi ilovermont, looks like we are on the same schedule. I will start TC on April 2. My Oncotype score came back high too ....63! Even my MO was surprised it was that high. We are also heading out of town the weekend before I start to gear up, we are in California, heading to San Simeon to see Hearst Castle. Kinda had a melt down about wigs today, went to a wig shop. I’m blonde and most of the wigs were very black and totally not me. Almost prefer to skip the whole wig thing and just go beanies and scarfs. To all the ladies of the March 2019 chemo club ....Thank you, thank you, thank you for your posts and experiences. It’s helpful to get a preview of what we may be going thru. I don’t post often, but I would be so lost without all of your posts and comments.",
      "MessageIndex": 111,
      "PostDate": "10/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "DebraC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284431/profile",
      "Content": "Mar 11, 2019 10:27PM - edited Mar 11, 2019 10:44PM by DebraC",
      "MessageIndex": 118,
      "PostDate": "11/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "DebraC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284431/profile",
      "Content": "May 15, 2019 06:23PM DebraC wrote: Grateful grandma, I’m so with you just wanting to feel normal. I just had TC #3 yesterday, one more to go the first week of June. That’s amazing your tumor has shrunk so much. Great news. Hang in there, the worst is behind you. I’ve had it pretty easy. Fatigue, underlying nausea for the most part. I know Friday thru Sunday will be laying around from bed to recliner. I just need to go with it and stop fighting it so much. I’m pretty much a get up and do do do kinda person. Mostly positive attitude. Getting stuff done today from the steroids still in my system. I did have a cute visitor at the infusion center yesterday. Enjoyed his visit. Mini golden doodle. Well mini compared to my 80lb Goldens! ",
      "MessageIndex": 423,
      "PostDate": "15/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "DebraC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/284431/profile",
      "Content": "Mar 3, 2019 06:47PM DebraC wrote: Karen, Thanks, I will join a group in April",
      "MessageIndex": 25,
      "PostDate": "03/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869287",
      "Title": "Roll call - Oncotype Score, Length of Time and If Recurrence Sadlynew2018 Rwns"
    }
  ]
}