{
  "AuthorID": "debragohn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66603/profile",
  "Posts": [
    {
      "AuthorID": "debragohn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66603/profile",
      "Content": "Feb 10, 2009 09:04PM debragohn wrote: Tomorrow is my first of 36 tx.  Everyone tells me that after chemo and surgery, radiation is a piece of cake - I hope they're right!  I have my Arm 'n Hammer deod., aloe vera and aquaphor. Do I need anything else? Debbie ",
      "MessageIndex": 138,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "debragohn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66603/profile",
      "Content": "Nov 13, 2008 07:33AM debragohn wrote: Hello, I just finished 6 months of chemo and had a mammo and MRI. The mammo showed the tumor had shrunk a little, the MRI showed about 90% shrinkage! So I will be having a lumpectomy on 11/25 instead of a mastectomy.  Don't be discouraged, chemo (and lots of prayer) works! Debbie ",
      "MessageIndex": 4,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724322",
      "Title": "mammo looks the same post chemo JanDun1 JanDun1"
    },
    {
      "AuthorID": "debragohn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66603/profile",
      "Content": "Oct 30, 2008 02:43PM debragohn wrote: I had 4 rounds of A/C and just finished my 4/4 Taxotere (which I believe is related to Taxol) today.Woo HOO! Taxol is somewhat easier to take. My worst SEs were achy muscles around my upper back, neck and face on days 3,4,5. And my mouth and tongue got coated, like thrush. I don't taste much for a week to 10 days. But no nausea. Sleeping is tough at first,but gets better.  Take the whole regimen your onc prescribes. Trust they know what they are doing. When first diagnosed, I needed a mastectomy. After the chemo, it's small enough for a lumpectomy which I have scheduled for 11/25. I will also start 6 wks. of radiation after the holidays.",
      "MessageIndex": 13,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722706",
      "Title": "4 rounds of AC and want to skip Taxol lucky8 Springtime"
    },
    {
      "AuthorID": "debragohn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66603/profile",
      "Content": "Oct 30, 2008 01:52PM debragohn wrote: My pre-chemo MRI and ultrasound and core biopsy showed cancer in at least 2 nodes. I just finished chemo today and have scheduled a lumpectomy for 11/25. At that time, thew will do a SNB and determine if they all need to come out.  Of course, I'm praying they stay. I also am concerned about lymphodema.    And I am left-handed, but my cancer is on the right side!",
      "MessageIndex": 13,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722833",
      "Title": "Does chemo zap cancer in nodes... Lynette Maryiz"
    }
  ]
}