{
  "AuthorID": "Debstr",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45812/profile",
  "Posts": [
    {
      "AuthorID": "Debstr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45812/profile",
      "Content": "Mar 31, 2007 04:55AM Debstr wrote:",
      "MessageIndex": 5,
      "PostDate": "31/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/573148",
      "Title": "please ladies I need an honest answer terri01 jankay"
    },
    {
      "AuthorID": "Debstr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45812/profile",
      "Content": "Mar 29, 2007 07:11PM Debstr wrote: I also had a sterotatic biopsy earlier this month for two clusters of microcalcifications. The day of the biopsy I was actually pretty calm (probably because my surgeon gave me valium!!) They had to go in twice because the were not close enough to get in one shot. I will be honest it did hurt even after the numbing shot but I am a wimp and I just made sure I did not move so the procedure would go smooth. The waiting for the results was a real emotional roller coaster which was almost unbearable. My results too came back 100% benign and I vowed to continue support sites like this one. Specifically for those who are experiencing this for the first time like me and found very few postings from with the word benign in it. I will never forget the support from folks I never met so please be sure to post back not matter what the results. P.S. One more word of advice the day of your biopsy, where something comfortable like a zip up top and comfy bottoms. It will make it easier to get dressed after the procedure and when you get home you will already be in something comfortable to relax in. Best of luck to you!!",
      "MessageIndex": 12,
      "PostDate": "29/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/570373",
      "Title": "steriotactic biopsy terri01 annie43"
    },
    {
      "AuthorID": "Debstr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45812/profile",
      "Content": "Mar 31, 2007 08:03AM Debstr wrote: I just had a biopsy in Mar07 for two areas of clustered microcalcifications that were new compared to my last mammo. They bx both sites and both came back benign. While I was going through this process all the reading made me think my chances of this being nothing was not very good at all. What I realized is that most of what you find on the internet will really do a number on the mind mainly because postings from those not diagnosed are few and far between. I vowed that I would not be one of those who disappeared with the hope that I could help calm the nerves if even just a little bit. You do need to keep reminding yourself that the odds are with you (I know that is hard!!)and I hope my story helps calm the nerves as you begin this process.",
      "MessageIndex": 1,
      "PostDate": "31/03/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/573194",
      "Title": "Microcalcification with one small linear branch Angielynn Angielynn"
    },
    {
      "AuthorID": "Debstr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45812/profile",
      "Content": "Apr 26, 2007 11:06AM Debstr wrote: I had one in early March in two seperate spots. The numbing shot did not hurt but I will be honest when they started extracting tissue for me it was extremely painful. My friend had one done the next week and she said her's did not really hurt at all. For me I think since the areas they had to get to were deeper in my boob and closer to the chest wall muscles. I was pretty sore afterwards but nothing unmanagble that tylenol wouldn't take care of. My surgeon also gave me the option to take a valium which I highly recommend. Also dress comfortably!! Lounging pants and a top that zips up worked great for me. Don't worry it will all be fine!!",
      "MessageIndex": 8,
      "PostDate": "26/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/594796",
      "Title": "stereotactic biopsy patti_momof5 leaf"
    },
    {
      "AuthorID": "Debstr",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45812/profile",
      "Content": "Apr 28, 2007 11:10AM Debstr wrote:",
      "MessageIndex": 17,
      "PostDate": "28/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/594796",
      "Title": "stereotactic biopsy patti_momof5 leaf"
    }
  ]
}