{
  "AuthorID": "debsdebs",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62762/profile",
  "Posts": [
    {
      "AuthorID": "debsdebs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62762/profile",
      "Content": "Feb 6, 2008 03:38PM debsdebs wrote: Hi girls-my name is Debbie & I'm new to the site. The info about the watery eyes is great. I was diagnosed in August '07, lumpectomy in September, & just had my 4th & last chemo on Jan.17th. I was given 4 sessions of Taxotere & Cytoxan every 3 weeks & have been having the watery eye & nose problem for about 2 weeks now. It's so bad that I can barely see at times. My doctor says it's allergies & to take my allergy pills (which I usually don't take till the Spring), I'll let you know if they work or not ! I'm glad to hear that it's a side effect-which is what I originally thought. I'm not glad, however, that it might last for several months. Other than that, I've been pretty lucky with the other side effects. I had a couple of bouts with welts on the back of the head & body, fatigue, no appetite or taste the 1st week & eating a lot the end of the 2nd & beginning of the 3rd week. My husband said that if it stood still, I'd eat it -- ha, ha. Have any of you ladies had trouble with getting to fall asleep? I don't nap during the day, but come bed-time, I lie awake with my mind racing for quite a long time. The Doc gave me a low dose of Ambien which works great, but I hate to use it every night. Stories of sleep walking and midnight snacking are interesting though :-) Back to the tissues then.  ",
      "MessageIndex": 23,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/698310",
      "Title": "Taxol and runny/stuff nose??? bluewillow MCBaker"
    },
    {
      "AuthorID": "debsdebs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62762/profile",
      "Content": "Feb 14, 2008 08:00AM debsdebs wrote: Still have a runny nose/eye's problem although not as severe, so --- the allergy pills could be working, or, the side effect is waning anyway -- don't know. Maybe I'll wear my motorcycle helmet all day, cause I have no problem on the bike .. Happy Valentine's day to you all",
      "MessageIndex": 25,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/698310",
      "Title": "Taxol and runny/stuff nose??? bluewillow MCBaker"
    }
  ]
}