{
  "AuthorID": "debz101",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63989/profile",
  "Posts": [{
    "AuthorID": "debz101",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63989/profile",
    "Content": "debz101 wrote: Hello Everybody - if you are reading this you are truely really special people who have fought and beat some battle of some description that has something to do with cancer or lymphedema... My name is Debz and I am a survoir of breast cancer and lymph node removal, over the last few months the use of my infected arm has decreased and the pain has been incrediable!! - we don't have a diagonis of LE yet but boy have I been through the works, I have had CT,MRI,Xray,Bone Denstity...all within two days..not a big ask when you look at the big  picture BUT..... When I was first diagonised with Breast Cancer I was a single Mum of one awesome wee boy, a lump that was found in the shower whilst drying turned into a life changing journey. When I seperated from my son's Father I was detirmed to suceed, so I returned to my home town, moved in with my most favorite relatives and set some some goals...I needed a job, a house and a future...I gave myself 5 weeks to achieve these things...I did!! I then two months later met the most awesome,loving,real man that any women could ever meet - I was so lucky!! or blessed!! it was only a few short months later that I discovered the lump...life was about to change BIG TIME!! - What a journey I was about to particapate in -  I asked him to go and leave me with my family and my son..he didn't leave. I married him two years after my surgery - my favourite Uncle was suposed to give me away but he had passed away from cancer three months before our wedding...When I asked my Uncle to give me away (he was well enough then) he laughed so hard and said \"I will throw you away hun...its a bloody honour\" I was 41 when I married my soul mate with out my Uncle but with my Son (6 years) my Aunt and my Brother....plus all the rest of our Family and friends - I told everyome we were having a \"posh frock\" and a BBQ lol. My Mum had passed way then she had been gone 12 years. This is my first marriage.... And there is no history in our family of breast cancer or cancer regardless of two of us having had different forms of cancer, we are only related by marriage (my Aunt is my Mum's sister) not blood or genetics- although some still say that my Uncle and I are tared with then same brush lol. I have led durning this time a very busy,healthy,fun lifestlye although some specialists would say that that wine, good company and good food are not good!! lol but life is for living isn't it!! I have a great family,a busy life,a great career, and have along with two of my closest friends completed a Duathalon,I swim daily and I have huge enjoyment and parciptation of gardens and art...then WHAMOO life STOPS...but it is graduarual, a little bit of discomfort,a wee bit of pain(stay off the power tools lol) sleep becomes disruptive, then the infections start -pumenoima twice,then a little bit of feeling loss, in the surgery side, a trip away camping with  family and friends,an infecton in the finger and the swelling starts..I mentioned the incredible pain - it is and was and still is life sucking...drugs sometimes work and sometimes don't everyday is again a battle (just like the Chemo days) restful sleep is a luxury...You struggle to be a good partner,wife,lover,mum,sister,employee,friend,aunt,to just be you!! It is phenomial....but still I have no firm diagonisis. You say its not all about YOU -but it IS!! I have been measured and fitted for a wrap/sleeve...but no real diagonisis... I have no firm diagonisis yet and its been three weeks - I don't ring any more for my results as I am begining to feel like a stalker of medical centres...I am scared Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "07/03/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/64/topics/701708",
    "Title": "Sometimes things really slow you down debz101 Binney4"
  }]
}