{
  "AuthorID": "deelightful",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192962/profile",
  "Posts": [
    {
      "AuthorID": "deelightful",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192962/profile",
      "Content": "deelightful wrote: Hello everyone, My mother has lost feeling on her breast.  It's on the breast where they removed some of her lymph nodes.  It's not the whole breast.  Just on the outside near the lymph nodes.  Has anyone else experienced this?   Thank you for any of your posts. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/815898",
      "Title": "My mother has lost feeling on the side of her breast deelightful Ariom"
    },
    {
      "AuthorID": "deelightful…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192962/profile",
      "Content": "Dec 19, 2013 01:27PM deelightful wrote: Thank you so much for your replies.  I have to admit that when I heard \"Go see the cancer surgeon\", I almost died right then and there.   I have an appointment with the breast surgeon on January 3rd.  I can't help it, but I'm so scared.  I have my panic attacks, and I know that no one knows.  I try to hide my fear...especially from my mother.  She's going through her own trials with breast cancer. Please continue to keep me in your prayers. ",
      "MessageIndex": 22,
      "PostDate": "19/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815500",
      "Title": "I'm so scared deelightful deelightful"
    },
    {
      "AuthorID": "deelightful",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192962/profile",
      "Content": "deelightful wrote: Hello everyone, My mother was diagnosed with Stage 2A cancer a couple of weeks ago. My heart broke. I'm trying to stay strong for her. I would give anything for this not to have happened to her. I went for my mammogram last week Friday. I haven't been to one in years. They called me to return. They said that they saw a thickening in my breast. I just can't believe this is happening. I haven't told my mother. I have to be supportive of her. Her surgery may be on Wednesday depending on what her doctor says. I have so many fears. I don't know where to begin. I'm scared for my mother. I want her to be healthy. She has such beautiful hair. I don't want her to lose her hair. I know it's going to happen. I have to be strong for her. I just love her so much. I can't believe this is happening. Now, I have to wait until December 16th to find out what is wrong with me. I'm going crazy. I'm scared. Oh well...I just needed to vent. Thank you & God bless Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815500",
      "Title": "I'm so scared deelightful deelightful"
    },
    {
      "AuthorID": "deelightful…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192962/profile",
      "Content": "Dec 18, 2013 11:41AM deelightful wrote: Hello everyone, I went to my appointment, but I didn't find out anything.  The radiologist said that he sees something, but the ultrasound shows movement when the breast is positioned differently.  He says that cancer usually stays put.  He gave me 3 options.  1.  I could wait for 6 months and see what happens on the next mammo, 2.  a biopsy  3.  They are looking for my last mammo to compare what was found then to what has been found now. When I arrived at home, I had a message that they wanted me to see a cancer surgeon.  I was on the phone on and off today, but I could not find out why they changed their minds.   I would prefer just to have a biopsy now.  If you can tell, I'm going a little crazy.  I don't know what to do.   I will continue to keep you all up to date.  Please keep me in your prayers.",
      "MessageIndex": 18,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815500",
      "Title": "I'm so scared deelightful deelightful"
    },
    {
      "AuthorID": "deelightful…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192962/profile",
      "Content": "Dec 12, 2013 05:19AM deelightful wrote: I can't tell you how comforting you all are to me now. I'm at the hospital with my mom now. She's going to have her surgery. Please keep me in your prayers.",
      "MessageIndex": 11,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815500",
      "Title": "I'm so scared deelightful deelightful"
    },
    {
      "AuthorID": "deelightful…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192962/profile",
      "Content": "Dec 9, 2013 01:25PM deelightful wrote: Thank you all so much for your support. I have to make my mother my priority now. I have to wait to find out what I have on December 16th. There's nothing more that I can do for myself until then. I will let you all know how things go. Again...I appreciate your prayers and support.",
      "MessageIndex": 6,
      "PostDate": "09/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815500",
      "Title": "I'm so scared deelightful deelightful"
    },
    {
      "AuthorID": "deelightful…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192962/profile",
      "Content": "Dec 14, 2013 03:40AM deelightful wrote: Hello everyone, I wanted to give you an update. My mother came through her surgery fine. She's at home with me now. Now, she's dealing with the depression and being scared of chemo. I'm trying to comfort her. She had a bad 1st night with chills and a fever. We are waiting for the visiting nurse to come. I'm just trying to be there for her. Now, I have to deal with going to my ultrasound on Tuesday. Thank you all again for your support.",
      "MessageIndex": 14,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815500",
      "Title": "I'm so scared deelightful deelightful"
    },
    {
      "AuthorID": "deelightful…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192962/profile",
      "Content": "Dec 21, 2013 02:44PM deelightful wrote: Hello everyone, My mother almost found out about my situation.  A phone call came for me from the same office she goes too.  I was able to just play it off.  I told her that I still had to get my mammogram, and I thought there was a mix up.  Thankfully, she's so distracted that she wasn't paying attention.   My appointment is still moving forward on January 3rd.  I really don't want to go.  I know I don't have a choice.  I'm dreading this.  I really don't want to celebrate this holiday, but I have to for my mother.   My mother had her appointment today.  They changed her stage from stage 2A to stage 2b.  I can't recall why.  It's still an early stage, and I'm grateful  I can't imagine living in this world without my mother.  I need her here. Thank you all for being so encouraging.  I'm trying to keep the faith, but I'm so scared. ",
      "MessageIndex": 25,
      "PostDate": "21/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815500",
      "Title": "I'm so scared deelightful deelightful"
    }
  ]
}