{
  "AuthorID": "delia-anne",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125601/profile",
  "Posts": [{
    "AuthorID": "delia-anne",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125601/profile",
    "Content": "Mar 11, 2011 01:02AM delia-anne wrote: The first time I got breast cancer I was 38 and wanted a mastectomy; the doctor recommended a lumpectomy and lymph node removal, I had 3 positive nodes so this included intense chemo and radiation.  After one year I had a reoccurance and had a mastectomy.  I wanted both breasts removed but my doctor said I should wait at least a year to decide and he left a lot of skin in case I wanted to reconstruct.  A year later I had my other breast removed.  I was so tired of living with one 40DD breast and one huge fake boob and felt so much freedom after my mastectomy.  I gained quite a bit of weight with my second round of chemo so I have not been very satisfied with how I look for many years.  It is hard to find clothes that fit but Chicos has some nice tops that don't have darts and I always wear tank tops under my tops.  I am now losing the extra weight and am excited to see my new shape take form...I have never regretted my mastectomies and love my battle scars!  It reminds me of the fight I have won and gives me the power to face anything that comes my way.  My husband has loved and supported me through it all -- I am so lucky!  I hate trying to find swimsuits but decided this year finally at age 51 that i am going to enjoy my life and not worry about how I look.  Macy's has a large selection of swimsuits, so I lucked out and found one that works--had to rip out the underwires!  I suffer from lymphedema so I deal with a lot of crap from this disease but I'm alive and well in 2011~~Whether or not to reconstruct is such a personal choice ~~ just wanted to share mine and let you know I have no regrets!",
    "MessageIndex": 187,
    "PostDate": "11/03/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
    "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
  }]
}