{
  "AuthorID": "deltaskye",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166673/profile",
  "Posts": [
    {
      "AuthorID": "deltaskye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166673/profile",
      "Content": "Dec 31, 2012 04:02AM deltaskye wrote: Very good advice from everyone, thank you. I'm old enough to remember when physicians wouldn't tell you anything, choosing instead to tell your husband or father. One long-ago friend went to her death without ever knowing she had cancer (she was college age). Everyone else knew, but she did not. Having had a few days to reflect, I think one reason for my confusion and concern was the behavior of the woman who works for my GP, and who is not authorized to discuss the mammogram findings with me. First she said I have a mass in my left breast, then backtracked and denied she'd said it. During our second conversation she told me that she didn't want to make the call to me, since no one authorized to provide details was available. She knew that would upset me, but others on the staff insisted she make the call. Also, she pushed me to schedule an appointment with my GP so that the GP could give me advice and recommend options (her words). She was overly solicitious, sharing her own cancer story, urging me to stay calm, etc. It was as if she knew something. Now I'm wondering if there is already a cancer finding no one has told me about - otherwise why would they push me to schedule that GP appointment for advice and options before I get the additional imaging?",
      "MessageIndex": 12,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798154",
      "Title": "What info am I owed, and a question about process deltaskye Beesie"
    },
    {
      "AuthorID": "deltaskye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166673/profile",
      "Content": "deltaskye wrote: My annual mammogram, including a 3-D version, was Dec. 19. At that time the technican repeated the imaging of my left breast - she kind of stumbled over an explanation as to why. I asked her if there was any concern and she said she just wanted to be sure she got good images. A week later my GP's office called to say that the radiologist would like to do more images. I pressed for more information and the employee stated she was not authorized to provide more information, and that no one would be available to meet with me and provide that information, along with \"guidance,\" for at least a week. However, during that conversation the employee stated that I had a mass in my left breast, then corrected herself and insisted she was just using that as an example of what the findings might be. Rather than wait a week to find out what is going on, I called the radiology practice and they did state that a mass has appeared in my left breast. I asked about its size and location and the technician said she had no more information. I will have more imaging (at least that's what they are telling me) on Dec. 31. I have the impression they may do a series of more imaging to confirm the findings and perhaps learn more. They told me someone will meet with me to explain everything afterward. About 7 years ago I had calcifications - also in the left breast -- and they did not send me home upon spotting them; they did the additional testing during that first visit. (Later I had a core biopsy and the findings were negative, but the doctor commented that calcifications can be a precursor to breast cancer.) My questions are: if the mammogram technician spotted the mass during the initial mammogram, why didn't they keep me that day and continue the testing? When I spoke again to my GP's employee to update her on the additional imaging, she revealed she is a breast cancer survivor, and she commented that she believes the radiologist dropped the ball by not going forward with the additional imaging that same day. (I realize she probably should not be commenting, but I had the same question already, given how they responded to the calcifications.) My other question is: how ethical is it for my GP's office to call me and indicate the need for additional imaging, but state that no one would be able to provide me more information for at least a week? And if the radiologist's records did indicate the size and position of the mass, are not they required to reveal that to me, even if by telephone? I really hate how this experience has been handled thus far. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798154",
      "Title": "What info am I owed, and a question about process deltaskye Beesie"
    },
    {
      "AuthorID": "deltaskye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166673/profile",
      "Content": "Dec 31, 2012 08:36AM deltaskye wrote: Thank you Bessie and Betsy - both responses are extremely helpful. Regarding GPs: what is their role beyond ordering the routine, annual screening mammogram? I'm still trying to figure out why I was pressured to schedule a follow-up appointment to discuss options with my GP. If I do have cancer, wouldn't I move on to a treatment team (breast specialists, surgeons, etc.)? How does one choose a team, beyond the providers covered by one's insurance? Does the GP make recommendations, or does the radiologist?",
      "MessageIndex": 17,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798154",
      "Title": "What info am I owed, and a question about process deltaskye Beesie"
    },
    {
      "AuthorID": "deltaskye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166673/profile",
      "Content": "Jan 1, 2013 01:20AM deltaskye wrote: UPDATE: Had an ultrasound so the doc could get a better look at what he terms a \"tiny\" nodule (a couple millimeters in size). Only the 3D picked it up, and he had great difficulty finding it via the ultrasound. He decided the margins are clean and the nodule is not a cause for concern or further intervention at this time. He rated it a zero on the BIRAD scale. In six months I will ask my GP for another order for follow-up imaging. If someone had been willing to tell me before today's appointment that the nodule was tiny, had clean margins, and was rated BIRAD 0, I would have not been as worried. Regardless, I am hugely relieved. And lucky. And grateful. Thanks to everyone who patiently answered all my questions. Happy new year and good luck to all.",
      "MessageIndex": 23,
      "PostDate": "01/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798154",
      "Title": "What info am I owed, and a question about process deltaskye Beesie"
    },
    {
      "AuthorID": "deltaskye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166673/profile",
      "Content": "Dec 30, 2012 06:49AM - edited Dec 30, 2012 06:53AM by deltaskye Thank you for your advice, exbrnxgrl. I did push for the earliest possible imaging appointment, and am having to wait \"only\" three days between receiving the news of the mass and the next tests. I am driving well out of my way to make myself available. And, MelissaDallas, the waiting must have been agony. I understand that a wait of days or weeks may not be statistically significant -- I think I waited three weeks for my calcifications core biopsy and removal -- but I'm curious as to whether there are laws or regulations that dictate when we are owed info and at what level of detail. Just because someone is on vacation shouldn't mean we must wait for them to return to receive critical information. ETA: sewingnut, your experience is how they handled my calcifications seven years ago. I was at the radiologist office for about a half-day - first the initial mammogram, then the consultation, then the extra imaging, before they released me.",
      "MessageIndex": 4,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798154",
      "Title": "What info am I owed, and a question about process deltaskye Beesie"
    },
    {
      "AuthorID": "deltaskye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166673/profile",
      "Content": "Dec 30, 2012 08:47AM deltaskye wrote: I didn't request anything specifically because the radiology team simply asked whether I wanted the results delivered via email or snail mail. I figured they'd send it all. By default it was snail mail, since I didn't fill out the extra paperwork required for email. But all they sent me was a letter with a very general comment that the results indicated the need for more tests. No images, no mention of a mass in the letter. I understand the issue of other patients' priorities and schedule challenges. I guess that because they'd reacted so quickly seven years ago, I was surprised at the delay this go-round. I suppose I also assumed I had a negative result, since they didn't have me stick around for more tests the day of the screening mammogram. My bad for making that assumption! It appears they are not waiting for my GP to return from vacation in order to proceed. I will be having the next round of tests without an order from her, and before she is back. I will be interested to learn whether the 2-D or 3-D images revealed the mass (or both). It was not discoverable during my GP's manual exam a couple weeks earlier.",
      "MessageIndex": 10,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798154",
      "Title": "What info am I owed, and a question about process deltaskye Beesie"
    },
    {
      "AuthorID": "deltaskye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166673/profile",
      "Content": "Dec 31, 2012 04:24AM - edited Dec 31, 2012 04:25AM by deltaskye Thank you for the explanation that cancer must be confirmed with a biopsy, and a reminder that a mass can be non-cancerous. At 3am this morning I was wondering whether they ever make a diagnosis simply by virtue of an image.   It's not wise to guess, second-guess, and so on, and I'm managing to distract myself most of the time. But the fear keeps creeping in. 7:30 tomorrow morning cannot come too soon.",
      "MessageIndex": 14,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798154",
      "Title": "What info am I owed, and a question about process deltaskye Beesie"
    }
  ]
}