{
  "AuthorID": "DeniseM808",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86675/profile",
  "Posts": [
    {
      "AuthorID": "DeniseM808",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86675/profile",
      "Content": "Oct 14, 2009 06:20AM DeniseM808 wrote: No, but when my blood pressure was fluctuating from medium high (140's/110+) to very low (80's/50's) and I was experiencing dizziness my oncologist ran a thyroid test. Test was negative. She didn't seem unduly shocked though so maybe it can be a side effect. Unfortunately I did not actually ask if this was a chemo SE. Sorry I don't have more info for you. If I do hear more from my oncologist I'll let you know.",
      "MessageIndex": 1,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/742089",
      "Title": "Anybody get hyperthyroid after chemo? hlya hlya"
    },
    {
      "AuthorID": "DeniseM808",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86675/profile",
      "Content": "Aug 4, 2009 04:12AM DeniseM808 wrote: Michelle - Re: Employment    The lbbc.org (LivingBeyondBreastCancer) had a recent podcast that covered employment concerns quite well. Look under the LBBC News tab for \"Living Beyond Breast Cancer Teleconference Covered Employment Rights After Diagnosis\". The information may help clarify some issues you may be thinking about right now. Love and hugs! DeniseM",
      "MessageIndex": 838,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "DeniseM808",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86675/profile",
      "Content": "Jul 18, 2009 05:06AM DeniseM808 wrote: Hey there! Just found you all and I'm glad I did. My first DD of AC is next Thursday, July 23rd. Just like Hopeful-1 it will be 4 doses every 2 weeks, followed by 4 doses of Taxol every 3 weeks.  I'm having a chemo counseling session on Monday, July 20th with the nurse who will be in charge of administering my doses. I hope that she provides lists and written tips as even without the Chemobrain thing I'm already a little forgetful when my anxiety level goes up. And there's no denying that BC has made my anxiety really high before I can rebalance my mental state. AmyIsStrong & JosyBee - thanks for both your lists. Need to do some shopping now to make sure I've got everything before The Day. Kathy16 - really appreciate the biotene tip because the stress has already given me a few cold sores. Good thing my WBC is still good and treatment will not be delayed. Love & Aloha, DeniseM",
      "MessageIndex": 380,
      "PostDate": "18/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "DeniseM808",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86675/profile",
      "Content": "Aug 12, 2009 07:24AM - edited Aug 12, 2009 07:27AM by DeniseM808 Linda - Pot. There is a pharmiceutical pill form that your oncologist can prescribe. Avoid street drug versions because dealers frequently sell \"enhanced\" pot. Additions to the mix can be anything from meth to lsd to cocaine. Risky.     PT. If at all possible get a referral to a PT specializing in assisting BC survivors. My PT is fab. Helps with range of motion, strength, scar tissue mobilization, etc. Funny, didn't even think there was that much of loss. Certainly not too noticable in most day-to-day activities. HopingForACure - You're such a wonderful daughter. Your mom is blessed! She may be nervous about the BRCA result for additional reasons beyond the stress of yet another test. It's something you should discuss with her though. I also submitted my blood sample for the BRCA on July 20th and still awaiting results. Wishing you and your mom the best. Continue as you've done; you're a great support for her! Update - AC + Avastin/placebo session #2 tomorrow (Wednesday) morning. continuing hair loss since Monday; shaved head on Tuesday. Time to go to sleep.  Wishing each of you wellness and healing hugs! DeniseM",
      "MessageIndex": 986,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "DeniseM808",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86675/profile",
      "Content": "Aug 21, 2009 11:57AM - edited Aug 21, 2009 11:58AM by DeniseM808",
      "MessageIndex": 1083,
      "PostDate": "21/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "DeniseM808",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86675/profile",
      "Content": "Aug 13, 2009 07:56AM - edited Aug 13, 2009 07:57AM by DeniseM808 Michelle - I stopped wearing my contacts to minimize the risk of infection. Oncologist said that I do or not do contacts and left it up to me. Learning to give up many vanity/old normal related things: contacts, hair, underwire bra, tossing out a lot of old makeup, my little too tight wedding ring, long workouts at the gym, non-medical massage, coffee, wine, spicy food, etc. DeniseM",
      "MessageIndex": 1003,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "DeniseM808",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86675/profile",
      "Content": "Aug 2, 2010 05:32AM - edited Aug 2, 2010 05:34AM by DeniseM808",
      "MessageIndex": 1782,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    }
  ]
}