{
  "AuthorID": "denise1962",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
  "Posts": [
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jan 23, 2009 08:33AM denise1962 wrote: Nolagal They supposely last for two months. Somedays are better than others getting them on correctly. Sometimes they stay on for 2 days I have had them on up to 5 days at a time. I use a q-tip to remove the adhesive and then wash in wig shampoo. You can trim them but be very, very very careful as bugs bunny friend would say( can't remember his name)  I have order the strip eyelashes in a brown as the black ones looked like Carol Channing. I am also order the stencils to try. It does take me about 20 mins to attach the human hair so I want to see if the stencils will be quicker. Nolaga loved the stories of you father way too funny.",
      "MessageIndex": 18,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727598",
      "Title": "Eyebrows denise1962 JoyRebecca"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "denise1962 wrote: As a fellow mester I will be on some form of chemo forever. Having lost what  few eyebrows I had I was looking into getting tattos, but instead found human hair eyebrows. You glue them on like you would eyelashes and they stay on for up to two weeks. I have had them on for 5 days and no problem so far. I found them at headcovers.com orig dx 5/7/06 IDC er,pr her2 postive 12/16 nodes pos Dx 7/7/2008, IDC, Stage IV, Grade 3, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727598",
      "Title": "Eyebrows denise1962 JoyRebecca"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jan 19, 2009 01:22PM denise1962 wrote: Well this morning one was falling off a little bit so I removed them before the shower. But I think you could shower with them on. I also find it is easier to apply if I draw some kind of line to follow when you glue them on. As far as eyelash go I did buy the indival(sp) ones but really haven't figured out how to put them on. Half blind and can't see where to glue them to the eyelash. I think I will try the one on a strip next. If and when I find my ubs cord for the camera I will post a picture. Also was thinking about inventing a glue on pu**y patch. Maybe that will direct the steam better instead of running down my leg LOL.",
      "MessageIndex": 5,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727598",
      "Title": "Eyebrows denise1962 JoyRebecca"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Feb 10, 2009 02:05PM denise1962 wrote: labtestsonline.org",
      "MessageIndex": 1,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728832",
      "Title": "Blood report - Break Down Meaning FloridaLady LuAnnH"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "denise1962 wrote: As a fellow mester I will be on some form of chemo forever. Having lost what  few eyebrows I had I was looking into getting tattos, but instead found human hair eyebrows. You glue them on like you would eyelashes and they stay on for up to two weeks. I have had them on for 5 days and no problem so far. I found them at headcovers.com orig dx 5/7/06 IDC er,pr her2 postive 12/16 nodes pos Dx 7/7/2008, IDC, Stage IV, Grade 3, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727598",
      "Title": "Eyebrows denise1962 JoyRebecca"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jan 18, 2009 07:55PM denise1962 wrote: I take baths, but you should be able to shower with them. I think you just have to be careful and not rub on them ...wipe them gently with the wash cloth. I have splashed my face with water with no problems. Tomarrow I will take a shower and let you know.",
      "MessageIndex": 2,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727598",
      "Title": "Eyebrows denise1962 JoyRebecca"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "denise1962 wrote: I posted before about the reaction to carboplatin reaction that I had durning my last infusion which was intense itching palms and sole of feet and peri anal region. then I started vomiitng and passing out. The nurses gave me meds to stop the reaction and slowed down the drip way down... Any way I belive that was cycle 8.  Of course I could't sleep last night and was looking up the side effects. Guess what this is pretty normal in about 10 percent of the cases. The problem is usually after a reaction like this the change to some other chemo. So I go in this thursday for my next infusion and was wondering if someone might know which chemo they will be switching me too. The other chemo is taxotere that I get along with Zometa. I also have another bump growing on my chest, just like the one found in July 07, the took me in for surgery for that one but don't know if they will for this one. My poor chest looks like mincemeat  LOL. So if anyone has any ideas or been there done that please share. Denise orig dx 5/7/06 IDC er,pr her2 postive 12/16 nodes pos Dx 7/7/2008, IDC, Stage IV, Grade 3, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730091",
      "Title": "carboplatin reactions denise1962 denise1962"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 4, 2009 09:24AM denise1962 wrote: Susan I too was pretty shaken up. The funny part is I had just up dated my DNR and Advance Directive and given it to my doc that morning. I have already decided not to contuine on the carboplation. With the new grow on my chest I am thinking it probably is'nt working anyway. I will post something tomarrow night or friday. Have a wonderfu day Denise",
      "MessageIndex": 4,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730091",
      "Title": "carboplatin reactions denise1962 denise1962"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 3, 2009 07:52PM denise1962 wrote: Thank Susan for the info, at least it's a start to discuss with the doc on thursday. Denise",
      "MessageIndex": 2,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730091",
      "Title": "carboplatin reactions denise1962 denise1962"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 5, 2009 01:39PM denise1962 wrote: Well, the doc's office change my infusion to next monday so I had the doc call me today. I let her know that I am a little (alot) concern about staying on the carboplatin, she is pulling up my labs to look at the tumor markers. Also thinking about another scan since the bump has increased in size. Possible changing chemo. Just really don't know what to do at this point. But she will call me this afternoon. Oh by the way doc is 2 hrs away so it's not like I can just run over which if I was closer she would have me do that. I should know more this afternoon.",
      "MessageIndex": 8,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730091",
      "Title": "carboplatin reactions denise1962 denise1962"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 4, 2009 11:30AM denise1962 wrote: Luann Sorry to hear about your allergies to herceptin. Has the doc said if they could slow down the drip? Doc said I got my life time dose of radiation the first time around. They had too go to the chest wall and cover all of the chest area as the tumors went from the sterum all the way over to the armpit.",
      "MessageIndex": 6,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730091",
      "Title": "carboplatin reactions denise1962 denise1962"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jun 15, 2009 06:17PM denise1962 wrote: I think it could go like this: If you have priviate ins or cobra they are your primary. The if you go on medicare they become your secondary. Or you could go on medicare and they become your pirmary, then you could pick up AARP for a secondary. At least this is my understanding. I do beleive that if you do not go on medicare and deciede to go on later it is more expenesive. So if it was me I would keep my private ins, the go on medicare and apply for AARP which is always go to be secondary to medicare or private ins. Hope this helps Denise",
      "MessageIndex": 6,
      "PostDate": "15/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735919",
      "Title": "First SSDI, now MEDICARE questions Analemma Sue-61"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Aug 14, 2009 11:57PM denise1962 wrote: Rosieeneil I too am sorry that you have had a reoccurance. There is alot of support on this board. I do understand about missing the old you. Now I just call it my new normal, which does change from day to day. Are they going to do chemo or rads? Denise",
      "MessageIndex": 3,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/738909",
      "Title": "In the same boat..... rosieniel rosieniel"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Nov 10, 2008 08:38AM denise1962 wrote: Not to scare you, but I would get a scan done. I had chest pain for two months. First I thought I had pulled a muscle as I had just had a scan done which showed nothing. I waited to see if it would get better but it just got worse with pain in my upper back and going all the way around in front of my chest. Did get a xray but it didn't show nothing. After another month of this pain my pcp suggested I see my onoclolgist. I was able to get in the same day. Also had found a bb size lump on my mast scar. Needless to say went in for surgery that day and had a scan. Mets to pelvis, spine, liver, and chest wall.  This all happen in two months first a clean scan and then progression of mets. Please get it check! I will be saying a prayer that all is negative!! Denise",
      "MessageIndex": 5,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724192",
      "Title": "Chest Pain tzane LuAnnH"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 12, 2009 10:52PM denise1962 wrote: Just courious did he rewrite the form? And was he willing to? The other thing maybe your new doc would be willing to redo the form? I know it is a pain to have to deal will all this but stand up for what is yours. My insurance just tried to bill me again for another quarter. I finally saw on another paper they had sent that I was entiled to a waiver. I too have just collected my death benefit, it took me an hour but I finally got the right person and she said it would take care of it and refund the money that I had already sent in.",
      "MessageIndex": 9,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730578",
      "Title": "My onc pissed me off!!! lovinmomma lovinmomma"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 26, 2009 10:45AM denise1962 wrote: Yipee!!!!!!!",
      "MessageIndex": 10,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731388",
      "Title": "No brain mets or cord compression!! waterlily riverinerabbit"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 12, 2009 12:41PM denise1962 wrote: I would make an appt to go in and see him. Let him know that as far as the insurance co is concern it is a best guess and if you live longer than the 12 mos you do not have to pay the money back and they do not go after the doc. This is what my insurance co told me. Also I would send copies of scans, notes, labs for the last 6 mos. I personally asked my doc to mail all of this information to me so I could look over everything and make sure it was in order before I fed-ex it to the insurance co. Go luck Then I would run and find another doc.",
      "MessageIndex": 7,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730578",
      "Title": "My onc pissed me off!!! lovinmomma lovinmomma"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jun 18, 2009 06:05AM denise1962 wrote: Wendy Lots of gentle hugs coming your way. Yumm strawberry jam!!! Denise",
      "MessageIndex": 4,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736081",
      "Title": "WendyV needs our support katie11 heatherpalmerton"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jun 29, 2009 04:17PM denise1962 wrote: I have a great husband who takes good care of me. I have let go of the little stuff, messes house ect,ect. But the way our medical team treats us just seems to get worse the further along in progression of stage V  goes. I went into our clinc today to get rehydration and had to sit outside literaly for an hour I was ok with this as I didn't feel like doing anything. Now this doc has seen me since bov 08 for hydration. I told him I drank 48 oz yesterday and he said not enough. Just when I went to tell him I have a standing order for a cbc he walks off and throws my chart on the counter. So I wait until the nurse comes in and tell her that I want a cbc added. Knowing she can draw the cbc after the IV is in. She replied no she would have to do them seperate. She never did. Luckly I got the lab tech to draw the cbc. But my point is it should have only been one stick. Also the was no charting done by the nurse. I will be courious  to see how she fills in the blanks later. Now these are people who I have spent the last 5 years working with. So I think yes people do treat us differently. And I don't like it.",
      "MessageIndex": 10,
      "PostDate": "29/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736677",
      "Title": "should we be treated different because you are stage IV? Fitztwins Fitztwins"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jun 18, 2009 11:10PM denise1962 wrote: kbug Get well soon. Hope the antibiotics kick in soon. Denise",
      "MessageIndex": 15,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736064",
      "Title": "Im in the hospital kbugmom faithandfifty"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 16, 2008 11:18PM denise1962 wrote: Hi Deb, I have read all of your post since I joined 2 years ago this May. Have you tried increasing your Lexapro, I find some days I only need one and others 1 1/2. When I first started it took about a week for it too really start working. I am sending you lots of hugs and postive thoughts. PS Christmas was just about 3 months ago, the time will fly.",
      "MessageIndex": 8,
      "PostDate": "16/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702351",
      "Title": "3 months sounds like forever.... AlaskaDeb lisaAB"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "May 19, 2009 07:32PM denise1962 wrote:  Robyn I too do more lurking than posting. I also seem  to post in spurts also, Great news !!!!!!!!!!!!!!!!!!!!!!!!!! Denise",
      "MessageIndex": 8,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734458",
      "Title": "Do you ever feel guilty?? RobynK konakat"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "May 4, 2007 05:06PM denise1962 wrote:",
      "MessageIndex": 10,
      "PostDate": "04/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/451214",
      "Title": "blood pressure jinky denise1962"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Apr 15, 2007 10:38AM denise1962 wrote: I was going to donate part of my liver to my twin brother. Had surgery date set for May 17 2006. Never had mammo done before. Age 44 at the time. Doc wanted one before surgery. No history of bc in family. Mammo show 6mm along chest wall.Ultrasound done to confirm. Had biopsy done the same afternoon(fri)because I was getting a liver biopsy done on mon. Got a call sat morning postive for bc. I was still in denial and had the liver biopsy done and was informed unable to donate liver. Have had bi-lateral mast. 4 dd ac 33 rads. Thank god they said to get the mammo.BTW brother is doing great he got a new liver last aug.",
      "MessageIndex": 50,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/563887",
      "Title": "How were you diagnosed? Symptoms/Signs, etc? greenacres nelia48"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "denise1962 wrote: Hi Ladies I have had three rounds of carboplatin, taxotere, and zometa every 3 weeks. The oncologist said I would lose my hair on this treatment. After the first treatment my hair started to thin and I went ahead and shaved it off. But it has not fallen out... I have velcro head. I have decided to not shave it anymore. Has any one had this happen? Second question.. I was her2+, er+, and pr+ last time around, now this time I am triple neg. How is that possible? On a postive note I am renewing my wedding vows this Sat. My DH and I have been married 16 years! Thanks for all your help. Denise orig dx 5/7/06 IDC er,pr her2 postive 12/16 nodes pos Dx 7/7/2008, IDC, Stage IV, Grade 3, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721031",
      "Title": "Hair loss, carboplatin taxotere zometa denise1962 ElaineD"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Sep 19, 2008 10:31PM denise1962 wrote: Hi Ladies Just had my 3rd treatment and brought it up with the dr again about the hair growing back. Her reply was that it would of been mange looking. I would really wait and see how thin it really becomes.  I go every 3 weeks, So some time has passed.  This last Saturday was the day we renewed our vows. So much better than the original (and that was fun) but by this time you know who you are really married too, who your family is and your friends accept you. I will try and post pictures when I get them. Had the scan done yesterday and it show some improvement with the chemo, I'll take it. denise",
      "MessageIndex": 6,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721031",
      "Title": "Hair loss, carboplatin taxotere zometa denise1962 ElaineD"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 21, 2008 08:11PM denise1962 wrote: Hi Sugarpea I did not have a lump per see, but a thicking in my pit. the cancer was in the nodes and against the chest wall. The only reason it was found is I was going to donate a lobe of my liver to my brother and it was found on a chest ct.  So go and get it check out as soon as possible. I will keep my fingers crossed it is B9. Denise",
      "MessageIndex": 5,
      "PostDate": "21/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/702655",
      "Title": "Anyone??? Suspicous lump in armpit that turned out to be BC? sugarpea013 yellowrose"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 26, 2008 04:40PM denise1962 wrote: Hi Sugarpea, I have my fingers and toes crossed that it is B9 on friday. Let us know. denise",
      "MessageIndex": 15,
      "PostDate": "26/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/702655",
      "Title": "Anyone??? Suspicous lump in armpit that turned out to be BC? sugarpea013 yellowrose"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jun 26, 2009 11:46PM denise1962 wrote: DeDe I was told by SSDI that if I went back to work with the ticket to work program that they would reopen my SSDI and denied me because it was less than one year. Denise",
      "MessageIndex": 2,
      "PostDate": "26/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736441",
      "Title": "SSDI work part time? DeDe6065 heatherpalmerton"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Aug 10, 2007 08:59AM denise1962 wrote:",
      "MessageIndex": 1,
      "PostDate": "10/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/673891",
      "Title": "Prostheses/Insurance? GrandpaBambu pnut2"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Apr 6, 2008 01:45PM denise1962 wrote: Shells First I would have your doctor resimt(sp) the info to the insurance company, alot of times it will go to a different doctor and they will approve it. Second, if you don't want to wait call the mri place and ask if they have a cash price if you pay the same day. I know at my place it is 45 to 50 percent off as long as you paid that day. Good luck and let us know how things turn out. Denise",
      "MessageIndex": 6,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/703464",
      "Title": "insurance denied coverage of MRI shells DebzNY"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "denise1962 wrote: Hi Everyone, What a whirl wind this has been. So this is what I was able to get done today. Informed my co-workers and boss that I would be leaving the job. I felt really bad that I couldn't give a proper notice but that time is of the essence. Call the insurance co to find out how to cash out the life policy. ( am waiting too hear back, I can't take it with me but I sure will try and spend some of it before I go). Filled out my State Disablitity forms which the doc can sign tomarrow, because I was able to move the appointment up from Thursday. Last but no least the doc called and said she would order the MRI and get the ok to start chemo tomarrow. Boy ! am I tried now. If anyone else has other suggestions please pass them along. Round two is about to begin. denise orig dx 5/7/06 IDC er,pr her2 postive 12/16 nodes pos Dx 7/7/2008, IDC, Stage IV, Grade 3, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708649",
      "Title": "Off to Chemo Land denise1962 CalGal"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jan 26, 2009 09:33PM denise1962 wrote: I just can't beleive this! So many tears at our loss. Please lord keep your arms wrapped around Deb's family through this time. I don't have in hard cider but I will have a glass or two of wine for another angel. God speed Deb",
      "MessageIndex": 36,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728028",
      "Title": "Alaska Deb is our newest Angel. Traci-----TripNeg 4753"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 6, 2009 09:52PM denise1962 wrote: Luann I had that happen to me once for a gyn appt. The put me in the room and I sat there for an hour + waiting I finelly went out and asked if the doc was off catching a baby. The girl at the front desk said no he was with a patient. I left and went home and wrote a lette to the doc letting him know at least his medical assisant could of come in an offer me the choice to reschdule and I thought it was rude that she was not keeping the other patient up to date. I also said I had just worked a 16 hour shift and had been up all night. My appt was at 9:00. never did hear any thing back but hopefully he had a talk with his staff. I did go back and see him 15 years later when I need my hystorectomy (sp) done for cervical ca. Because he really is a very good doc. I just think his staff needed a taking to. Gald to hear you are healing well!!",
      "MessageIndex": 3,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730279",
      "Title": "Why do doctors think our time is not valuable? LuAnnH bmdaley"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jul 8, 2008 06:21AM denise1962 wrote: Hi Again Just talked with the insurance they said I could have three thousand now, not the rest unitl I died. Jezz I want it now. So my question is has anyone else cash in their policy before hand and how too go about it. I live in northern ca. Thank you all for your support! denise",
      "MessageIndex": 5,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708649",
      "Title": "Off to Chemo Land denise1962 CalGal"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Oct 10, 2008 11:34PM denise1962 wrote: Hi Kelly I had a liver biopsy 2 years ago, when I was going to donate a lobe to my brother. It wasn't really that painful. More like the wind being knocked out of you. They did have to do it twice, but like I said it was't painful. The hardest part was lying on the side where your liver is for 4-5 hrs. They do not want you to move around as that might start the liver to bleed. they will take your blood before the biopsy and at least one more time, but I think it was twice. The following day the nurse will call and see how you are feeling. No exercise or house cleaning for the first 24 hrs. Hope this helps and let us know how your test comes out. Big hugs denise",
      "MessageIndex": 1,
      "PostDate": "10/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722579",
      "Title": "Liver Biopsy - What To Expect KellyC KellyC"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 8, 2009 07:25AM denise1962 wrote: Thanks everyone for the infor. I do have extreme neuropathy now so hopefully it doesn't get much worse.",
      "MessageIndex": 5,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730283",
      "Title": "New Game Plan denise1962 denise1962"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Feb 23, 2009 08:22PM denise1962 wrote: 42 cervicabl cancer every thing removed except ovaries 44 idc bilateral mast tripel postive stage 3c 46 mets to spine liver pelvis triple negative I tell all young women to get a mammo reguardless of their age.",
      "MessageIndex": 128,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Feb 23, 2009 08:29PM denise1962 wrote:  I have not gone though this my self either, Just sorry that you are going through this. Hopefully someone will come along and anwser this. denise",
      "MessageIndex": 2,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729610",
      "Title": "warning:kind of gross question. lol MissyBraddy Traci-----TripNeg"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 22, 2009 12:45AM denise1962 wrote: Rhonda I am sorry for what you and your family is going through. My prayers are with you.",
      "MessageIndex": 1,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731142",
      "Title": "Grandma Update kisersassy Analemma"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jul 8, 2008 10:09AM denise1962 wrote: Hi CalGal I will try this again, I wrote every thing out and the dang server kicked me off. I was diagonised may 2006 with er pr her postive with her expressing at around 90%. I belevie 17 out of 21 nodes postive. Had bilateral mast chemo rads hercerptin and Arimadex. My last  pet/ct scan on 3-31-08 was completely negative. I have been having pressure on my chest which my primary doc did a chest xray for and showed nothing 3 weeks ago. I was thinking maybe a hernia. The when the pressure moved to the other side last week I went back to the primary doc and show her the bb size bump that had showed up along the scar line the side with the cancer. This appeared within a couple of days. She thought I was popping a stitch. but suggested I call my bc surgeon. who was able to get me in within 3 hrs. She took me into surgery that day a did a biopsy all the way to the chest wall. This is last monday. Tuesday it came back postive. went for a pet/ct scan on thursday. Got results back later that day. Postive to clavical. inner ribs. along the spine liver and pelvis bones. Not to mention it showed up in numerous lymph nodes though out these areas. Called the onc this morning and she went and talked to the radiologits who said he had never seen this happen before. I onco doc is starting chemo tomarrow because it appers to be multipling very quickly. I don't think I am being too arlarmed at this point because the reaction of the onco and radiologist think we need to move now. I am going to fight this second round with everything I got, but at the same time I would like all of my ducks in a row. Thank you CalGal I have followed your post and advice since I joined. Denise",
      "MessageIndex": 8,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708649",
      "Title": "Off to Chemo Land denise1962 CalGal"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 29, 2008 10:52AM denise1962 wrote: Have you tried calling the dr office there should be someone on call even though it's the weekend?  If not go to the er. Yes the drain is quite long. I acutally had my dh remove the second one the night before. My dr said I was the first pt to do that. Yep, I should of went to med school. Let us know.",
      "MessageIndex": 7,
      "PostDate": "29/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703036",
      "Title": "Drain tube broke!!! RJ62 RJ62"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Feb 9, 2009 03:09AM denise1962 wrote: Thank you all for your support. Went into a little depression and with the holidays haven't been on too much. I did get the ct/pet approved, Scan showed no improvement and a fx rib which I didn't know about. Had an allergic reaction to the carboplatin thursday. Dropped to my knees and started vomiting durning the infusion, So I don't know if I will stay on carboplatin, Also have a new reocurrance along the scar line. I really thought 09 was going to be better. It will get better,,,, It will get better....... Denise",
      "MessageIndex": 9,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724097",
      "Title": "Many Questions Hair, Scans denise1962 JStar"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "denise1962 wrote: Hi everyone, I was diagnosed with mets in June of 08: pelvis,chest,spine.  I have one more round of chemo left which is carboplatin, taxotere and zometa after this last treatment I will be having chemo every 4 weeks. I have gone bald for the second time. Does anyone know if the hair will grow back on the 4 week cycle? The first time I went through chemo I didn't brother to get a wig, but if I have to continue the type of chemo I am rethinking I might need to get one. The second question is regarding scans. My onco wants to order another ct/pet, but the insurance has denied it saying to get just a ct scan and bone scan and if indicated the will approve the ct/pet. My question is has anyone call the insurance co to speak to the medical review doctors? How accurate is just a ct and bone scan? Do they cover all of the arms and legs? I am really tempted to call the insurance co my self and argueing with them because my brother just passed 10 days ago from kidney ca which had spread to his lungs, brain and stomach, it was also in his hands which they didn't find out until he had done 12 weeks on wbr. It was really hard to watch him go as I know that I will be following the same path some day as a cancer patient. Thank you all for being here a letting me ramble on. denise orig dx 5/7/06 IDC er,pr her2 postive 12/16 nodes pos Dx 7/7/2008, IDC, Stage IV, Grade 3, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724097",
      "Title": "Many Questions Hair, Scans denise1962 JStar"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "denise1962 wrote: Do to the reaction I had with carboplatin and the new reoccurance my doc called and said I will be starting navabline on Mon. I will not have anymore surgery for the new reoccurance. Has anybody done just navabline? I was on taxotere(sp) with the carboplatin. But the navabline will be the only chemo from here on out. And does any one else feel like chemo brain is getting worse with each new chemo? I cannot remember nothng in 2 seconds it is out of the brain........into never never land. orig dx 5/7/06 IDC er,pr her2 postive 12/16 nodes pos Dx 7/7/2008, IDC, Stage IV, Grade 3, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730283",
      "Title": "New Game Plan denise1962 denise1962"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Feb 17, 2009 08:17AM denise1962 wrote: I know so well how this feels. I have been in a funk since Oct when my brother passed from kidney cancer.  Was starting to come out of it in Jan when I noticed another growth on my chest. I do have a dr appt but not for 2 more weeks. Also had a really bad reaction to Carboplatin. This will be my 3rd time of a reoccurance in 2years. I really don't want to go sometimes. I lost it on Valtines Day with my DH. He was going to make me dinner. But he got busy building and I ended up cooking instead. He has been building 10 hrs a day and I never get to see him. I finally told him that I was really going to die from this and he had better start spending some of his time with me. That it is all about me now and after I was gone he could do what he wants. He replyed that he really thought I would beat this. Had to explain that no I would not it is just a matter of time. Sorry to highjack and rant but I know you guys will understand. Denise",
      "MessageIndex": 11,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729204",
      "Title": "I have this pit in my stomach Fitztwins Brendatrue"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Nov 8, 2008 09:16AM denise1962 wrote: Lisa Sorry to hear the sad news. Saying a good vibs to your. Denise",
      "MessageIndex": 1,
      "PostDate": "08/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724122",
      "Title": "Me, too LisaSDCA EGAL"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 25, 2009 09:27PM denise1962 wrote: Susan B9 B9 B9 hope the scan comes back negative. Then you will have the best present. HAPPY BIRTHDAY. B9 B9 B9",
      "MessageIndex": 13,
      "PostDate": "25/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731371",
      "Title": "I'm looking at brain mets, also... SunshineSmiles denise1962"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 27, 2009 04:18AM denise1962 wrote: Susan, Sorry it wasn't  B9 I am here for you along with all the other wonderful women on this site. If you need to vent rant and cry go right ahead. We are holding your hand and sending love your way.",
      "MessageIndex": 43,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731371",
      "Title": "I'm looking at brain mets, also... SunshineSmiles denise1962"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Jul 9, 2009 08:56AM denise1962 wrote: Marybe try this link for omentum.  <a href=\"http://www.merriam-webster.com/medical/omentum\">omentum<\/a>  if it doesn 't work goggle \"omentum\"",
      "MessageIndex": 58,
      "PostDate": "09/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/691865",
      "Title": "Abraxane and Avastin combo weekly b445 mgk63"
    },
    {
      "AuthorID": "denise1962",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31173/profile",
      "Content": "Mar 13, 2008 12:31AM denise1962 wrote: Hi Pamaly, My tumor was on the chest wall at the 6 oclock. I did have chest wall radiation, also went through chemo surgery. It does get better! Hugs to you. denise",
      "MessageIndex": 7,
      "PostDate": "13/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/701730",
      "Title": "anyone have cancer on the chest wall pamaly koshka1"
    }
  ]
}