{
  "AuthorID": "Derby2012",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155527/profile",
  "Posts": [
    {
      "AuthorID": "Derby2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155527/profile",
      "Content": "Jul 7, 2012 10:59PM Derby2012 wrote: Thank you, everyone. I'll watch the cyst and see about getting another sonogram in a couple of months. The redness is still sort of there, but barely. I might see if the GP will give me another round of Cephlex in case it helps. ",
      "MessageIndex": 6,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790188",
      "Title": "SHOULD I be worried? (I'm still freaked out) Derby2012 Derby2012"
    },
    {
      "AuthorID": "Derby2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155527/profile",
      "Content": "Derby2012 wrote: April/May-ish both breasts itch like someone's put itching powder in my bras. They both ache horribly and feel like bowling balls. No redness. No lumps. All of this goes away after a week or so - maybe two-ish but I don't really remember. It just went away.  6/24 My dog scratches my right breast leaving a three inch red mark that doesn't bleed and goes away completely in a couple days.  6/27 I noticed a large red blotch on my right breast from the top of the aerola to about 2 inches beneath it. Yes, same area of the scratch, which is no longer visable. It's a fairly angry red. There's a significant bulge at the 5-6 o'clock position. No heaviness, no itching. I freak. I Google. I freak some more because I learn about IBC and I never knew it existed before.  6/29 I see my GP who agrees it is worrisome and sends me straight away to a local imaging place to have a mammogram and US. Ironically, I'd just been to the GP the week before for yearly blood work, which showed nothing abnormal - no elevated white count. Only a VERY slight elevation in liver enzymes probably because I'd taked some Tylenol for a few days because I'd tweaked my knee in the garden. Anyway, the mammogram shows dense tissue. US shows two small areas of 'slight concern' and some slight skin thickening but the doctor said it's most likely cellulitus although she did add that IBC was 'in the differential.' Says to take 1000 mg of Cephflex 4x daily for ten days. That night, my GP calls and says that they'd like to see me Monday AM (7/2). By 7/2 and the day of the appt, the swelling and redness has subsided about 30%. I'm still worried. GP agrees that it'd be a good idea to rule out IBC so that I'd feel better but she's pretty confident that cellulitus is the accurate diagnosis. She just can't figure out how I got it and that seemed to concern her the most, but finally said that scratch had to be it.   7/5 I go to a breast specialist. I'm there FOUR hours. The only test they did was redo the US, which they claim to have found a smallish cyst and area that seems inflammed, but says that it's Mastitus and that the Keflex should take care of it. WHAT?!? I told her that the other clinic said cellulitis and she just said it's one or othe other, cellulitus or mastitus, but that Keflex should take care of it. I tell her it's cephflex that I'm on. She says I shouldn't worry, to go home and enjoy life, but schedule another US in 3-5 months just to be sure and give them something to compare to. The area of concern? A slight skin thickening and a small cyst. I asked if she could assure me it's NOT IBC. She says, nope - nothing is guaranteed, but she's really sure it's not, although yes, I could have cancer because our cells can turn on us at any time, but she found no reason to do anything as invasive as a biopsy and nothing of concern enough to have her recommend an MRI.  It's now been 7 days of taking the antibiotics. I haven't missed a dose. I set an alarm to wake myself up at 2 am, long enough to take the next dose. While I agree that the breast is better - probably 75-80% better, there's still a slight pinkish area and the bulge, although now greatly reduced, is still there.  7/6 I get a letter from the first screening center telling me that they've diagnosed it as cellutitus, and that although there is an area of concern, it's probably benign and that I should reschedule another US in 6 months.  Am I over reacting? Does it matter which infection or that they don't seem to agree on which infection it is (although the GP says she's really quite sure it's cellulitus), and that they can't seem to say the same thing - area of concern? or cyst? Same thing?  I'm terribly sorry this is so long, but greatly appreciate any words of wisdom or advice.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790188",
      "Title": "SHOULD I be worried? (I'm still freaked out) Derby2012 Derby2012"
    },
    {
      "AuthorID": "Derby2012",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155527/profile",
      "Content": "Jul 6, 2012 10:17PM Derby2012 wrote: I'll keep my fingers crossed for you, Crystie. Please let us know what the mammogram reading says. They should be able to tell you pretty much right away if it turns up anything, but I also agree with Pam and hope they schedule you for a US as well.  So terribly sorry to hear about your parents. ",
      "MessageIndex": 2,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790186",
      "Title": "Diagnostic Mammogram Monday... Not Looking Good Crystie75 pamelahope"
    }
  ]
}