{
  "AuthorID": "dgirl24",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97016/profile",
  "Posts": [{
    "AuthorID": "dgirl24",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97016/profile",
    "Content": "Apr 10, 2010 08:28AM dgirl24 wrote: Hang in there Allison!  You sound like me with the crying and feeling sorry for your son and parents.  It is very helpful to break it down and concentrate on 1 step at a time.  I also started a note book with names and phone numbers of people with cancer experience and any nurses you know personally.  I too didn't cry- it just didn't come out.  BUT it will or not- either way your emotions are you and what ever you fell is ok.  I used to get so nervous about people telling me to be positive- it stressed me out.  Positive is def the way to go but it will come in time. IT DOES GET BETTER.  If you have any survivor friends it helps a lot.  Also don't look up too much on the pc- this site is good- but when I was first diagnosised I couldn't even come on here.  I had to ask my mother-in-law to go on line and get me questions for appointments and any info she thought important. Network of Strength has a 24/7 phone number- where you will talk with a survivor.  I have no insurance knowledge- but just keep asking around.  Call breast cancer organizations and find out what your rights are- BECAUSE you do have rights!  Don't always take what the school insurance company is telling you- get help. I did get to the point where I wasn't eating and finally got a zanac perscription- just for times when my mind wouldn't stop. YOU will be fine....my tumors (2) were bigger than yours and it was also a grade 3 and I'm doing great.  They will cut that out and you will fight and feel so good. I'll be thinking of you Bless you D ",
    "MessageIndex": 4,
    "PostDate": "10/04/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/751082",
    "Title": "Biopsy came back Invasive Ductal Carcinoma grade 3 tumor hopeful34 Cowgirl13"
  }]
}