{
  "AuthorID": "dgmlmax",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133584/profile",
  "Posts": [
    {
      "AuthorID": "dgmlmax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133584/profile",
      "Content": "Aug 3, 2011 01:56PM dgmlmax wrote: My surgery is scheduled for Aug. 12th. I'm scared to death. I don't do well with any medical stuff. I'm a big baby. I haven't been able to sleep as in my mind I've had the surgery over and over again. One night after I'd been told my surgery date, I dreamt that they started surgery then stopped and said oh, we can't finish until Aug. 12th!!! The day I went for my biopsy, I knew... I asked what my bi-rad rating was. The nurse was shocked and said how did you know to ask that, then she said well you have a right to know. After we left the office, we recieved a call on the way home from a dr. saying that they found a mass on my husbands liver! He had gone a lung specialist, as he had pneumonia a couple months back, and was starting to have the same shoulder pain again. They had done a Ct scan on his lungs several weeks earlier. He ended up in the hospital for two weeks with a abscess on his liver that then also spread to his lungs and caused pneumonia again. He is home now with IV anti-biotics. The dr's were stumped by all of this. During that same week, my older brother arrived in Fl (where I live) and was acting very weird, he couldn't speak correctly. After a visit to the emegency room it was determined that he had a baseball size brain tumor, and he was operated on within hours. We were told 6 hours into surgery that he had a massive stroke, and wouldn't surrvive. He did, the dr later said there is no explanation for this, because from what he witnessed but the scans never showed a stroke, just profuse swelling. So I can honestly say that was one of my worst weeks ever!!!",
      "MessageIndex": 37,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "dgmlmax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133584/profile",
      "Content": "Aug 16, 2011 08:10AM dgmlmax wrote: Hi everyone, I guess I can say my surgery went well. I say it like that because I figure they (the Dr's) are never going to say anything otherwise. Within 24 hours I was feeling pretty good. Then the next day, the general anthesia wore off, and I was in quite a bit more pain. I have very hard time laying down, the motion between sitting up and actually laying really hurts across my chest, as I'm sure it does for everyone. My one arm is numb in the armpit area, and stretching across onto my back. This is very incomfortable. I've had some issues with my meds. I was itchy all over, and then have had diarrhea for two days. we switched anti-biotics but that only solved the itching isuue. Then I had percocet (sp?) and vicodin (Sp?) to try and see which worked better, the vicodin definitely made me very emotional so that just added way extra stress to the issues. I went back to the percocet. My husband is going to pick up a presrciption for a muscle relaxer since I've been having several shooting pains across my chest, they are the worst pain ever! One of the biggest issues is with the bra, they gave me a post surgical bra, it is tight not only around the te's but the band around my chest feels like it it crushing me. So I need to figure something else out for that isssue. My belly area right up to the bra area has been as hard as a rock, to the point where I look like I'm full term pregnant. I can't wait for this to resolve itself, hopefully soon. The one really good thing I can say about the surgery is the medicine they gave me, I believe it was versid (sp?) well this was a miracle, I don't remember anything from slighly before the surgery until way after it. Not remembering has really helped me get through all of this. I know I still have more healing and pain to go, but I'm hopeful that the worst is over. My thoughts are with all of you who have their surgergies and those of you awaiting yours. Please keep in mind, I am the biggest baby when it comes to medical stuff, and so far I've managed. I'm trying to not even think about the pathology reports at this point, I'm just taking one day at a time. Dina",
      "MessageIndex": 189,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "dgmlmax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133584/profile",
      "Content": "Nov 18, 2011 10:20AM dgmlmax wrote: I just read several posts of some of you who have had your exchange surgery after an Aug mastectomy. I am so happy for each of you. I was originally told my exchange would be in Nov. Now I'm being told next year. The only complicatios I've had is severe pain (all along). I didn't have chemo or rad. I want to be a full \"C\", that has not changed. I've had 10 fills bringing me to my current 575cc's. My dr had my goal listed at 500cc's on my fill card, which includes the 100 overfill. When I got to that point I knew something was up, I was too small. The problem is with my dr, I don't see him at all from the BM to the next consult for the exchange surgery. That is scheduled for Dec. 5th. I did see him last week as I requested an emergency appt for the pain. He was really irritated and pretty much didn't believe me about the pain. Or at least he made me feel that way. I also asked about a surgery date, size came up he said I'd be a small \"B\". I said no I want to be a \"C\". He said well then surgery won't be until next year since you want to go larger. My husband jumped in and said\" NO\" she has not changed her mind she always said a full \"C\"\".  Because in my real life I tittered between a B & a C and that was tough to buy bras for. Anyway I am really upset, and in pain. I want to change surgeons but there are several issues, first off if I speak to anyone in this area, he is the Dr to go to, he is highly recommened. Second, I did go on another consult this week and he said its very uncomfortable to switch dr's and he felt I should stay where I am. I'm giving my dr one more chance at the Dec appt, if he is at all rude I'll have to fine another dr. Anyway, I want to ask a couple questions... How many CC's did you get in your real implant, what size did that equal for you? I am 5'6\" 120 lbs. my ribs are 32 although I wear a 36 inch bra. I did get some advice from whppitmom. I'm thinking either 550 or 600cc's, and either the allergan 20 or 45's. I want to look natural, some cleavage but no shelf at the top of the foob! As of now, I have to get 5 more 25cc fills. at intervals of at least 2 weeks in between. And then I have to wait 4 weeks for the muscle to fully stretch. Surgery will not be until the end of Feb. The thought of that is pure turture.  Thanks for reading my story.  I'm so glad this group exists.  Dina",
      "MessageIndex": 768,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "dgmlmax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133584/profile",
      "Content": "Aug 12, 2011 06:16AM dgmlmax wrote: Today's the day.., I'm leaving for the hospital in a bit. I have thanked my breasts for serving me well, as they fed my to children. I'm dealing with this the best I can. I'm just praying that the lymph nodes or other areas are not involved. If this is the case I will celebrate! I truly have no idea of what to expect today or for the next few weeks, so that scares me. The only thoughts are the ones I dreamt of each night since my diagnosis, so let's hope things go better than in my dreams. I do feel some strength in knowing I'm not alone, we will get through this. I'm thinking of each of you as I go through this journey. Dina",
      "MessageIndex": 132,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "dgmlmax",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133584/profile",
      "Content": "dgmlmax wrote: I have DCIS, and am scheduled for a bilateral mastectomy on the 12th of Aug. They are also going to biopsy my lymphnodes. My underarms arms are sore and sort of itchy. I am extremely concerned about this. I would like to have an MRI, before surgery so that I know. I do realize that the MRI may not pick it up if it is too small, but I'm just wondering if it is possible in most cases. Dina Dx 6/30/2011, DCIS, Stage 0, Grade 2, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772737",
      "Title": "Can a MRI detect cancer in the lymphnodes? dgmlmax coraleliz"
    }
  ]
}