{
  "AuthorID": "DiagnosisDi…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
  "Posts": [
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "May 22, 2019 05:36PM DiagnosisDisruption wrote: I did Taxotere/Carboplatin (plus Herceptin and Perjeta for the HER2 part) x 6 and cold capped because of the Taxotere. I didn't lose my hair. I thinned and no one knew I was undergoing chemo unless I had told them. I did this because the oncology pharmacist recommended it. I was offered the AC and then Taxol, but it was a longer protocol. For me, I feel I did the right thing. I was stage 2, grade 2, no nodes, lumpectomy.",
      "MessageIndex": 1,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/871680",
      "Title": "How do I choose a chemo plan?!?! TyroneShulaces77 Scrafgal"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Aug 10, 2018 10:06PM DiagnosisDisruption wrote: Wondering how everyone is doing that started rads in July. I had my three weeks of whole breast and, when they mapped me for my five boosters, determined I wasn't a good candidate for boosters! So I was told I would be done with radiation the following day, instead of the following week! I never even considered that! Now that I'm done, I'm just hoping to get everything settled. I was warned my skin and fatigue might actually get worse in the next week or so. Good times.",
      "MessageIndex": 65,
      "PostDate": "10/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Oct 5, 2018 06:18PM DiagnosisDisruption wrote: How is everyone else doing? My radiation ended August 8th after only 16 zaps (no boosts) and am still terribly red and swollen. I had the \"zingers\" from Day 4, but it became constant stabbing pain. The pain in the chest (costochondritis) got so bad a week or so ago that I ended up in the ER. This was six weeks after rads ended! The oncologist says it's not normal. The radiologist office keeps saying I will only \"get pink\" and that radiation \"is the easiest part of treatment.\" BS. Give me back chemo! I've seen two radiologists. One did finally give me steroids which worked on the stabbing pain, but not the swollen part. Is anyone else still two cup sizes larger and bright red? I'm looking for reality, here, not the dribble the radiologists are giving me.",
      "MessageIndex": 95,
      "PostDate": "05/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Jul 17, 2018 05:18PM DiagnosisDisruption wrote: I start radiation tomorrow. I've had the simulation and been tattooed (which itch, by the way) and had at least eight meltdowns on that day alone, five more since then, which was a week ago. For whatever reason I am more freaked out about radiation than chemo. Chemo was a breeze. Well, not a breeze, but I knew what to expect because of the Chemo Teach and everyone expected me to have side effects. With radiation, all the nurses and doctors say \"piece of cake, easiest part\". I feel like they are just brushing any potential side effects aside and that if I do have side effects, I won't be \"doing it right\". Plus I'm just over the whole cancer-thing after months of chemo, a lumpectomy and another lumpectomy because the margins weren't clear.",
      "MessageIndex": 28,
      "PostDate": "17/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Jul 26, 2018 06:04PM DiagnosisDisruption wrote: I am one who is having an emotional meltdown with radiation treatment. I had #7 out of 21 today and was in tears in the changing room. Again. I know better than to let my emotions get me while on the table during radiation because I can't wipe the snot off because I have to lay perfectly still. Here was my lightning bulb moment with radiation, though: After seven months, I've had it with cancer. The rush of the diagnostic appointments, then months of chemo followed by two surgeries, and then this. I'm just tired of it all. I've had a chance to think, to realize I have cancer, to realize this is my life, and I don't want to be doing it anymore. For me it's also this: radiation is completely ALONE. No one gets to stay in the room with me. I'm laid bare in an uncomfortable position, and then everyone leaves. I know it's for less than 10 minutes, but still. I get \"dumped\" on a daily basis. At least with chemo I got to talk to people while being posioned. Not that knowing this makes it any easier. I'm just using it as an excuse/reason why I've lost my ever loving mind.",
      "MessageIndex": 47,
      "PostDate": "26/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Aug 12, 2018 08:38AM DiagnosisDisruption wrote: CENOK2017 - I got pink on Day 1. For me, I might have gotten a little pinker as time wore on, but not terrible. I am hoping I don't jinx it because I hear it gets WORSE after treatment and I am 4 days post. I use hydrocortizone 1% and Ceravu cream 3x a day still. I hated radiation more than chemo, emotionally. I was always pissed off. The last two, I ended up just closing my eyes in the radiation room, waiting for it to be over. It doesn't help that you are all alone in that room. I will tell you, walking out the door on the last radiation is VERY liberating! Eschindler - I took an hour nap every day after I came home from part time work, the drive, and radiation. Plus I was in bed by 9:00. Our bodies are trying to heal what they are doing to us and it makes us tired.",
      "MessageIndex": 69,
      "PostDate": "12/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Jul 20, 2018 12:34PM DiagnosisDisruption wrote: Marymc86 - Congrats on finishing! I've had 3 out of 21. After todays blast, the guy says, \"see you in a couple days\" instead of \"see you tomorrow\" which always brings me to tears. So two days off, then back to the grind. My hospital is an hour away so the drive is what is wearing me out already. I turned pink on Day 1 and got the stabbing pains I was warned about. I breezed through chemo (as much as you can breeze through chemo). This radiation so far sucks the most. I've lost my Polly Positive from the last seven months. I'd like her back!",
      "MessageIndex": 37,
      "PostDate": "20/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Jul 26, 2018 06:07PM DiagnosisDisruption wrote: I realize I'm only 7 in, but I can tell when I haven't had enough water in the day. My energy is completely gone and I'm a crabby-pants. I drink a bottle of water and I'm human again. Could be a placebo, but I'm okay with that.",
      "MessageIndex": 48,
      "PostDate": "26/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Jul 29, 2018 08:30PM DiagnosisDisruption wrote: My nipple hurts and has hurt from Rad 1. It doesn't feel like burn; it feels like tenderness and absolute pain when I'm trying to go to sleep. Ibuprofin does nothing. I'm about ready to go for bigger stuff. Weekend break is over - back to the zappery grind tomorrow.",
      "MessageIndex": 53,
      "PostDate": "29/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Nov 11, 2018 07:36PM DiagnosisDisruption wrote: I finished in August and am just now getting the cording despite yoga two times a day. I see a Lymphedema Specialist and get the lymphatic massage weekly. What a huge difference! I don't want to knock someones head in on an hourly basis from the constant pain. Marymc86 - I am also starting to get a \"dry nipple\" despite twice daily moisturizing. I will be curious to know what your RO says. Mine, I won't even bother going back too because he will only tell me \"radiation is easy\".",
      "MessageIndex": 98,
      "PostDate": "11/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865598",
      "Title": "JULY 2018 Radiation? jerseymom12 Marymc86"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Apr 20, 2019 07:42AM DiagnosisDisruption wrote: I am eight months out of radiation and had a harder time with radiation than I did with chemo (and I did the hard stuff for six months). Surprised everyone that radiation was so hard. They even didn't do the boosts, it was so bad. That being said, 8 months out and it is still hot. I ended up going to a lymphedema massage specialist for physical therapy (lumpectomy, re-excision and two nodes removed, negative) and it was a game changer. Six weeks after rads I wanted my breast removed. I did therapy and it's finally back to being squishy. It is very surprising (even though they tell you), it takes a long time to get over radiation. Longer than chemo, for me. Keep plugging along, drink water like it's your second job, walk a lot, and find a physical therapist that can do lymphatic drainage massage (it will also help with cording that develops and comes out of nowhere 2 months out).",
      "MessageIndex": 14,
      "PostDate": "20/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870346",
      "Title": "After Lumpectomy and Sentinel Node Biopsy morningdove morningdove"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Aug 13, 2018 09:26PM DiagnosisDisruption wrote: Georgia1 - I am kind of glad I hadn't heard about it before. It was a rather nice surprise! Yes, I will keep up with the lotions. Five days post rads, I can feel what people mean by \"leathery\" on the breast. Before, it was just pink. What exercises? I have been doing yoga, but wasn't given anything in particular. I can feel it tight in there.",
      "MessageIndex": 2,
      "PostDate": "13/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/866561",
      "Title": "No boosts? DiagnosisDisruption Georgia1"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Feb 25, 2019 10:52AM DiagnosisDisruption wrote: I also did it with TCHP because of the Taxotere. It was recommended by my oncology pharmacist because of the very small percentage of patience whose hair did not come back. I did thin and it was stressful watching the hair and, what felt like, my money going down the drain. However, I work at an elementary school and none of the kids knew I was undergoing chemotherapy. I do not regret cold capping one single day because my cancer was my business, not everyone else's. As far as the inconvenience of being at the infusion center longer, it was six days out of my life.",
      "MessageIndex": 2,
      "PostDate": "25/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/870023",
      "Title": "Conflicted about starting Paxman cold cap lamb22 Meow13"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Nov 12, 2018 08:26PM DiagnosisDisruption wrote: CaliKelly - Double D! Not accurate (well the radiated one might be well on it's way), but it's sticking!",
      "MessageIndex": 11,
      "PostDate": "12/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868297",
      "Title": "Your One Piece of Advice DiagnosisDisruption santabarbarian"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Nov 13, 2018 09:46AM DiagnosisDisruption wrote: I forgot about the water! Yes, just when you feel extra crappy, go back in time to figure out when you last drank. Most times it was too long ago. Holds true six months out of chemo. I like the positive attitude - BUT allowing yourself to have a crappy attitude on occasion. I did get tired of feeling like a circus performer all the ever loving time. Another one to add would be setting up a CaringBridge account. This put all the info on one page and you wouldn't get phone calls just when you were falling asleep. Or feeling like you were going to toss your cookies. But mostly when you needed some shut eye. I set my journal account up and then made the rule: NO PHONE CALLS.",
      "MessageIndex": 16,
      "PostDate": "13/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868297",
      "Title": "Your One Piece of Advice DiagnosisDisruption santabarbarian"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Oct 24, 2018 09:08PM DiagnosisDisruption wrote: I am both glad and sad to see this. Glad it's not just me. Sad it's not just me. I am only two months out of rads and already am looking into having a mastectomy (I had a lumpectomy and re-excision) because of the extreme pain. I sailed through chemo and both surgeries, only to have radiation become the bane of my existence. It appears radiation is the common thread in all of this. Mad I wasn't warned about the possibility. I was just told I would \"get pink\" three weeks in. I didn't know it would be debilitating pain for the rest of my life.",
      "MessageIndex": 96,
      "PostDate": "24/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Nov 12, 2018 08:26PM DiagnosisDisruption wrote: I love all these! The cheesecake could be ANY food! If you crave it, and it gets you through the day, then who is going to stand in your way? I love the one step at a time. It is so easy to want to be five steps ahead. A little knowledge about that fifth step is okay, but obsessing about it is detrimental. I actually got in trouble from the oncologist by going to the gym. She was more worried about gym germs than the 500 K-5 kids I have every day! I went anyway because it was either that for file for divorce. What's a threat of a cold when there is the prospect of splitting up the possessions?",
      "MessageIndex": 10,
      "PostDate": "12/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868297",
      "Title": "Your One Piece of Advice DiagnosisDisruption santabarbarian"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Jun 1, 2019 08:50AM DiagnosisDisruption wrote: mom2bunky - The post lumpectomy/radiation mammogram had me panicking as well (because it will get more painful with radiation, I'm sorry to say). I actually stalled in scheduling it. When I finally went, I took 3 ibuprofen beforehand and then I told the tech straight out that I was freaked out. She was very gentle and used the manual dial versus the foot dial to \"squish it\". Much more tolerable and I felt like she was in more control. Also, look into lymphatic drainage massage for the breast. After surgery and radiation I had horrible chest lymphadema. The therapist worked wonders. I do still have some pain, ironically in the spot completely away from the surgery site. Oncologist says lymphadema still.",
      "MessageIndex": 119,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Oct 6, 2018 01:15PM DiagnosisDisruption wrote: I am only two months out of radiation (August 2018) and still incredibly swollen and red. Each doctor says to go see the other doctor. I finally went to the ER because I was so frustrated. They said to see my oncologist after reading the CT scan. I said, \"the oncologist didn't do this!\" The oncologist said she would be happy to see me, but didn't know what she could do. \"Go see the radiologist\". Already did. They said I would \"get a little pink\" and that's it. Why bother going back? So, unfortunately, I hear you.",
      "MessageIndex": 1,
      "PostDate": "06/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/867540",
      "Title": "Breast redness and swelling after radiation LMS DiagnosisDisruption"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Nov 15, 2018 09:37PM DiagnosisDisruption wrote: So much poking and prodding. I look back at the last eleven months and wonder how I found time to work with all the imaging and poking and \"hey, look what we think we see. Let's get another scan!\"",
      "MessageIndex": 104,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Nov 15, 2018 08:05AM DiagnosisDisruption wrote: AMLmom51 - Sorry, I misread and thought it was from rads. My guess is going to be nerve pain. The absolute worst pain came from when they injected the dye for the sentinal node biopsy. I didn't feel it because they numbed me, but they knicked a nerve. Holy baskets! I am five months out from lumpectomy and rexicision and still get the occasional surgery pain, but not bad. Yoga and exercises help SOOOOO much! Best wishes!",
      "MessageIndex": 102,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/797780",
      "Title": "Pain in lumpectomy site years later Rachel1 mom2bunky"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Nov 16, 2018 06:36PM DiagnosisDisruption wrote: You lost me on the word \"nicely\". I had one lady start up a story that I knew was going to end in death and I just interrupted and said, \"So I'm gonna die just like that person, is that what you are going to say?\" Then again, this is my personality. When we made the initial announcement of Stage 2 breast cancer on caringbridge, I gave a list of things people could do for me/get me. No shame. I knew people were going to ask. I'd rather give them ideas to actually be helpful then tell them \"oh, we're fine\" and have them do for me/give me crap. Why should I be the one to thwart them from blessing me?",
      "MessageIndex": 11,
      "PostDate": "16/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868384",
      "Title": "How to nicely stop well-meaning advice phlorada phlorada"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Nov 16, 2018 07:42PM DiagnosisDisruption wrote: My educated guess: Margins weren't clear. If her first lumpectomy required a wire localization, the second one won't have to have wire localization. I had to have a second surgery. My surgeon warned me about the slim chance. I think it was because she tried to take out as little as possible and there was still cancer within 1 millimeter of the removed part. We (the surgeon and I) knew there wasn't any more cancer, but we did it again three weeks later and the whole thing was benign. I am also near Seattle, at SCCA Evergreen.",
      "MessageIndex": 6,
      "PostDate": "16/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868377",
      "Title": "Found more cancer right AFTER lumpectomy viewfinder viewfinder"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Nov 4, 2018 11:35PM DiagnosisDisruption wrote: My Doozie Chemo ended May 8th, lumpectomy May 23rd, re-excision mid June and started rads in July. After Hell on Wheels with the rads, ended up doing 16 with no boosts. They said it would cause \"constant and chronic pain\" if they did the boosts. As it was, after 6 weeks landed in the emergency room from absolute pain and Costochondritis and the inability to pull in a full breath. A month later the oncologist mentioned possible breast Lymphedema. This sent me to a specialist to do massage and, what a game changer. After dipping into surgery meds and contemplating a mastectomy because it hurt so badly, this was the answer to my prayers. Chemo was a walk in the park compared to rads, for me. In all of this, I have had Herceptin every three weeks. My last one is December 26th and the port is scheduled to come out December 27th! My daughter says my gift is to \"have the plug pulled\". Ummmm. I will not have my next mammogram until \"six months after radiation.\" This puts my first scan in February. This is good because my Porno Swollen Boob cannot take being mashed right now! I cold capped and kept most of my hair. It got thin and dry and I've had several haircuts since. It has grown in completely curly in the back and straight in the front. It is super thick! No regrets with cold-capping. No one knew I was undergoing chemo unless I told them. I never stopped teaching, but did take a week off after each chemo and a week after each surgery. I even taught summer school during radiation. What a difference a year makes! A year ago this month, I was going in for my first-ever mammogram.",
      "MessageIndex": 1007,
      "PostDate": "04/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Nov 18, 2018 10:58PM DiagnosisDisruption wrote: I don't have ear pain, but I have tinnitus from the Carboplatin. We noticed it on round three, stopped three and four, tried half dose round five and nothing round six. It doesn't hurt - just constant buzzing. Ear, nose throat doc said it's probably permanent along with the hearing loss.",
      "MessageIndex": 1019,
      "PostDate": "18/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "Nov 18, 2018 11:02PM DiagnosisDisruption wrote: Is everyone else getting mammos now? I am not slated to get mine until six months after radiation, which puts it in February 2019. My first (ever) mammogram was November 28th 2017 when the lump was found. I only ask because my chemo ends in December and the port comes out the day after last chemo. I feel like I should have some sort of scan before it comes out? (Although, with the oncologists blessing, I'm the one wanting the port out.)",
      "MessageIndex": 1020,
      "PostDate": "18/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    },
    {
      "AuthorID": "DiagnosisDi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277125/profile",
      "Content": "May 15, 2019 04:41PM DiagnosisDisruption wrote: Hello! I passed my one year out from the Big Chemos May 8th. What a difference a year makes. The only side effect I have left (besides the ringing in the ear from the Carbo and some distance vision loss) is that my hips are incredibly painful. I'm working on getting that taken care of. Otherwise, just happy I don't have to be at the doctor's every week! I don't go back to the oncologist until September!!!!",
      "MessageIndex": 1040,
      "PostDate": "15/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860990",
      "Title": "Starting chemo January 2018 Motherofall6 Amelia01"
    }
  ]
}