{
  "AuthorID": "DiamondGirl…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
  "Posts": [
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Jan 21, 2011 02:44PM DiamondGirl wrote: Very sorry and shocking to hear about Bopeep's passing.  She was in our Oct 2010 Rads.  Rest in peace, no more suffering.  May you find love and tranquility wherever you are.",
      "MessageIndex": 99,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763574",
      "Title": "Bopeep is an angel Leah_S"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Mar 5, 2014 01:26PM DiamondGirl wrote: Stareyed, Yes...  and I highly recommend Dr. John Davis...he's the best surgeon there",
      "MessageIndex": 1,
      "PostDate": "05/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/818768",
      "Title": "General Surgeons - Las Vegas, NV? Stareyed Stareyed"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Aug 22, 2011 12:06AM DiamondGirl wrote: Dear Zeana, I'm so sorry for your loss.  I lost my 88 year old mom this past April to kidney failure and understand the empty feeling that you have right now.  I only stopped crying this month, it will take time but you too will heal.  Thank you for sharing your mother's story and spreading hope for us fighters.   Namaste! ",
      "MessageIndex": 2,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/773478",
      "Title": "My Mother Is Sleeping Now BrokenHeart marieibrahim"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 24, 2011 11:36PM DiamondGirl wrote: Hi, I just went to my onc for my 3 months follow-up.  I finished rads on Dec 1st and my ears have been ringing louder these 2 weeks, had tinnitis for years but not this loud.  I told my onc that there's pain at the top of my head and he asked if it's scalp pain.  I can't tell, it comes and goes and it is usually a quick flash on the same spot.  I didn't need chemo so it's not the hair.  I do take Tamoxifen and wonder if it could be the hormonal thing (or lack of).  Onc also asked if I wanted an MRI and then said we'll watch it.  Arrgggh !",
      "MessageIndex": 2,
      "PostDate": "24/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/763932",
      "Title": "Scalp Pain 4tylove DiamondGirl"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 21, 2011 02:27PM DiamondGirl wrote: I was 48 yrs old at DX, still 48 yrs old. Onco score 15.  My ER & PR are both at 97%.  I asked my onc to give me chemo and he assured me that the damage is far too great for very little benefit. I did NOT have chemo. Julie775, our tumor size and grade are similar, talk to your onc about other factors,look at the ER & PR %, perhaps get a second opinion.  Good luck, I understand it is a tough decision above all the decisions since the DX. Please update us on your decision.  Will be thinking of you. {{{{{HUGS}}}}}}",
      "MessageIndex": 29,
      "PostDate": "21/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/763394",
      "Title": "Oncotype DX test score at 18 - chemo or not? julie775 Bamagirl2016"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 3, 2011 02:30PM DiamondGirl wrote: Sorry you have to join this group but good luck with your surgery.",
      "MessageIndex": 8,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764115",
      "Title": "need help understanding path report sweetjolieblon VSM"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 12, 2010 06:09PM - edited Aug 20, 2013 02:55AM by DiamondGirl Good evening everyone, I had my 1st rad today and 32 more to go.  I was also very nervous and I just kept praying.  All I could see is the big round donut to my left side and I heard about 15 ticks, then it went to my right and another 15 ticks.  Both my arms were sooo numb, and even when I got home, my arms felt shaky and weak.  Did you ladies have a similar situation?  I was laying there for 30 mins and hopefully tomorrow will be shorter duration. I was told not to put any lotion on, can someone verify that with me?  Thanks for exchanging notes. God Bless!",
      "MessageIndex": 170,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 14, 2010 11:03AM - edited Aug 20, 2013 02:56AM by DiamondGirl Welcome gingen424, sorry to meet you here on this type of circumstance.  What does \"lymphvascular invasion\" mean, because your dx said 0/1 (meaning 0 node affected).  We have a pretty similar dx, mine is Gr. 2 instead of Gr. 1.  I didn't need chemo either, onco score was 15 and you are right about getting yourself psyched for the chemo and I too bursted out crying (happy tears). Thanks for reminding me not to think of Radiation as a big deal, because I was not wanting radiation and asked my surgeon if I could skip it.  He said \"no\".  I have to remember to be thankful about not getting chemo and just deal with the rads. On the question about Vit. E, my rad onc say \"NO\" to vit. E.  You may want to check it out with your rad onc (not just the technicians) about what to put.  I was given 3 choices (2 were samples).  Calendula cream (I got it at Whole Foods store), and received Aquafor and Miaderm as samples.   I will be doing my 3rd tx today, 30 more to go!  ",
      "MessageIndex": 203,
      "PostDate": "14/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 18, 2010 12:00PM - edited Aug 20, 2013 02:58AM by DiamondGirl CT124 ~ I've had 4 tx so far and DH bumped my armpit while giving me a hug last Thursday.  Now I've noticed a small bruise-like area at the back side of arm pit.  The underarm appears to be slightly swollen.  My surgery was 7/28 and never needed any pain meds, it is bothering me more now than before.  The swollen feeling is similar to the first week after surgery when it felt bigger.  I too wonder if this is because of the bump of his arm under my armpit or is it radiation? ",
      "MessageIndex": 243,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 21, 2010 09:01AM - edited Aug 20, 2013 02:59AM by DiamondGirl Tina ~ a warn welcome here.  Thanks for reassuring me to report them.  My 2 rad techs are snotty, I bring them goodies every Monday (3 times I've brought them food now) althought I had to have the CT and simulation done twice because of 2 weeks wait time to clear an infection.  It didn't matter what I say, they just don't have too much concern for other people which is really sad.  Yup, I'm so convinced that the squeaky wheel gets oiled. ",
      "MessageIndex": 284,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 10, 2010 09:03AM DiamondGirl wrote: Hi All,  Want to hear something grose? I went to my #19 rads tx this afternoon.  I was greeted by yet another student tech.  I walked in, saw the white bed sheet already on the table, mmmmm, it looked wrinkled.  So I asked the student tech, \"Has this been used by somebody?\".  She replied, \"oh, we turn it over and use the other side.\"  \"Oh Yew!!!\"  I said to her, \"I will not lay on top of this thing, can you please give me a clean sheet!\".   Can you imagine??? I read in my invoice that the rad's office charges my insurance $1700+ per day on my treatment, and I get to lay on \"used sheets\".  OMG!  I can imagine if someone is fully clothed and be laying on a slightly used white sheet (nah, I'm just teasing).  I get to lay on it with my bare skin.  Imagine that.  NOT!!! I don't think I want to be sharing anybody's bodily fluids.   Sorry, I have to let you ladies in on this, it is just grosing me out.  Just wondering, do you all think that the rad oncs are \"not aware of this going on ?\"",
      "MessageIndex": 412,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 10, 2010 10:55AM DiamondGirl wrote: Beanius, Alca ~ I've PM'd you.  please check.",
      "MessageIndex": 415,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 1, 2010 06:00PM - edited Aug 20, 2013 02:51AM by DiamondGirl Hi sistas, Please count me in for October rads too.  I had my simulation done on Sept 7th and rads to start on Sept 15th, I started an infection that just cleared.  So I will have my 2nd simulation done next Monday morning, assuming they will start the rads on Tuesday.  I'll have 33 txs.  Been reading a lot from the July and September thread and am still worried.  I am thin built and am worried that the rays will damage my lungs.   I spoke with my BS last Wednesday because I was having 2nd thoughts about radiation.  He said that lumpectomy and radiation is like peanut butter and jelly so I should not skip it. Got my PET scan result this morning and I am all CLEAR, Yeah! Have a great weekend.",
      "MessageIndex": 70,
      "PostDate": "01/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 7, 2010 02:26PM - edited Aug 20, 2013 02:53AM by DiamondGirl Hi there, I was supposed to start my 1st rad on Tuesday.  Was on the table for over 30 mins, the machine was moving around for a few minutes.  Then I was just laying there, arms going real numb, and then the techs came in twice.  Nothing, they couldn't align me properly.  The reason given was that I gained better range of motion on the L arm and they couldn't align my marks.  Had my 2nd CT yesterday and I'm to wait for the call when they have finished re-calculating everything.  I had worked up all those nerves and it's a strange feeling having to go through all the waiting.  But I know it's smarter to be safe than sorry, and I called it the Higher Power Intervention. It's invaluable for me to keep reading about your notes and what not to do.  I am truly glad that there's so much support here. My CT techs were super nice, rads techs didn't start off that way but I see an improvement already :) Good luck to you all.  I hope to trade notes with you too! God Bless!",
      "MessageIndex": 121,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 12, 2010 08:49PM - edited Aug 20, 2013 02:55AM by DiamondGirl Thanks Marm and Recovery.  I am really surprised when the tech said that (not the rad onc).  I will definitely put some on right now.  Better to be safe than sorry.",
      "MessageIndex": 172,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 20, 2010 06:18PM - edited Aug 20, 2013 02:59AM by DiamondGirl Hi ladies, I had my 6th today, 27 more to go.  I had to skip it yesterday to take my national licensing exam.  I thought it would be a quick and uneventful day today, wrong.  When I walked into the waiting room, my tech already asked me to wait a bit, no explanation given.  There was only 1 other person in the waiting room.  Then I thought that my tech was just chit chatting, so I waited and said nothing.  After 15 mins of wait time, she called me to go in.  I immediately see 3 men walking around and knew they were not the regulars and they are not dressed like the rad techs either.  They were actually the rad machine techs.  As I was waiting to go inside the chamber (dungeon), there's a man talking with one of my techs.  Then he walked away.  By the time I was on the table and I was being aligned, he was back by the controls, the only thing divided the walkway and the control counter was the hospital curtain.  He passed the curtain and was by the controls.  There are 2 surveilance camers pointing at the bed/table.  The monitor is very clear, you can even make out the features on the person's face.  I asked my 1st rad tech, is that guy a doctor, she said \"No\", he's a physicist, he's tweaking the machine, it wasn't working right.  She tried to tell me he's behind the curtain and the 2nd rad tech told her, no, he's right there.  By this time my gown has been pulled down and I'm half naked.  As the machine was zapping me, I was getting more and more furious, how can my rad tech think it's nothing?  The machine tech should not be watching me going thru treatment and I'm laying there half naked.  I am just so furious and when I told her after my tx session, that rad tech is stoic like nothing happened.  I told the 2nd rad tech, same.  No apologies, nothing.  I wonder how they will feel being so vulnerable and someone can just stroll right up to the monitor and other things when one is doing the treatment.  My rad center is one of 6 branches.  I don't think that a doctor is always available.  And honestly, I don't think that they care how I think or feel. If this happens to you, will you report it? To whom?",
      "MessageIndex": 273,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 20, 2010 07:12PM - edited Aug 20, 2013 02:59AM by DiamondGirl Thank you, Alca.  I thought that my rad techs would be my advocate because they are women.  I'm so wrong.  These are the 2 that really couldn't care less.  I told them that my armpit feels swollen, the 2nd tech had the nerve to say it's not infected.  I told her, I felt it.  Sigh, there are so many of them that are insensitive.  If there are no patients, they will not have a job.  And I hate to be treated like cattle. ",
      "MessageIndex": 275,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 23, 2010 09:08AM - edited Aug 20, 2013 03:00AM by DiamondGirl Good morning (from west coast), Joan888 - sorry to hear about your fall, hope you are better now. TMarina, Cindykaw, MPH70, BetsyP, Alca, CT124 and JFV - thanks for backing me up too, I had my regular Thurs meeting with rad onc.  Initially he looked surprised (but the tech #2 told me before my session that she had reported it to the doc), as I was telling him what happened, his nurse kept chiming in.  My doc actually said in verbatim \"they are drs./physicist and it is the norm in the States that they will even follow the doctors inside to check/tweak the machines\".  I let him finish, let the nurse finish chiming in and then look the doc in the eyes and said \"then I propose that I'd be treated differently, if there need to be any tweaking while I'm on the table, I want \"off\" of it.  I do not want to be there while they are tweaking or calibrating the machine.  If they need to get something or walk to the control station where the surveillance monitor is, I need to be informed and be \"immediately covered\".  Then I turned and looked at his nurse and said \"I know I have my right as a patient, right?\".  Funny, the incident that happened the day before, no one had apologized.  This time the rad onc apologized twice and said that \"he forgot how patient feels because he's been treating for such a long time\".   Friday - the techs are not really speaking to me, I can sense the coldness.  While being zapped yesterday, I could feel some pain at the rays was hitting me.  I get 12 zaps coming at an angle from left side, I could feel about 3-4 zaps where is was painful, can't describe it.  Like electricity/static hitting you.  Then 12 zaps coming from an angle from the right.  I fet 2 zaps that was painful.  Now the machine was calibrated/fixed 2 days in a row.  I sense something is not right. Then when doc checked my L axilla, at first he dismissed anything wrong thinking it was my subconscious thinking.  After telling him that it is not, then he felt the lump and said I could be getting an infection.  Will wait and see.",
      "MessageIndex": 297,
      "PostDate": "23/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 23, 2010 06:08PM - edited Aug 20, 2013 03:00AM by DiamondGirl Alca, QCA - thanks. Has anyone ever felt pain during the zaps?",
      "MessageIndex": 300,
      "PostDate": "23/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 25, 2010 12:03PM - edited Aug 20, 2013 03:01AM by DiamondGirl Gingen424 - I totally agree, you feel so alone in there.  Has anyone felt any of the zaps?  I did on my #8 tx.  5 out of the 12 from one angle.  2-3 out of 12 from the other angle.  I'm really concerned.  I never felt it before then. ",
      "MessageIndex": 308,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 11, 2010 11:26AM DiamondGirl wrote: MPH70 and Ct124 ~ thanks for the support. riley702 ~ you are lucky with your rad office. I will update y'all later this evening :)",
      "MessageIndex": 429,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 21, 2010 10:09PM DiamondGirl wrote: Dear All, I have a question about rash, and I cannot recall if anyone mention anything about having a rash?  I have 2 reg. tx and 5 boosts left.  I started this rash last Tues with a couple of really tiny white head looking thing in the lower quadrant.  Didn't think much of it.  Then saw my rad onc on Thursday, and pointed it out to him, it was about 10 little spots by then.  Over the weekend, it got increasingly more itchy and a few more spots.   The doc's assistant said that it is the SE of rad tx, did anyone get rash like me?  I don't have any peeling but the nipple got crusty looking.  The itch is really tough to withstand.  Arrgh! Also on the note about flying and TSA, my family is in Toronto and will need to fly there in December or January.  I am terribly sore on the L breast and axilla and not wanting to go thru the scanners nor being pat down either.  Like DawnKY said, I would probably scream too from the pain.  Very frustrating indeed.",
      "MessageIndex": 501,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 27, 2010 12:01AM DiamondGirl wrote: I have 3 boosts left to go and saw my rad onc today.  My rash is pretty bad and got a prescription for Topicort.  I asked my rad onc about the TSA scanners and he said that they emit very minimal dose of radiation, it is like comparing to sitting in a plane for 2 minutes (you get 0.5 mrem per hour of flight).  See link : http://www.blackcatsystems.com/GM/safe_radiation.html He did say thought he would opt out the kids walking through the scanners and go for the pat down.  Just want to share it with you.",
      "MessageIndex": 526,
      "PostDate": "27/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Dec 1, 2010 07:08PM - edited Aug 20, 2013 03:18AM by DiamondGirl Good evening all, Thanks Linda :) I just want to let you all know that I have finished my 33 rad treatments today!!! Yay, so happy that I don't need to deal with that facility any longer.  In fact, there were student techs yesterday and today and I told them that I do not want any student techs during my treatment.  One of the technician had that snide look on her face and I abruptly turned around and caught her.  LOL.  The other female tech said \"Oh, you don't have to work with student techs\", I replied \"I know, and I don't want to anymore!\".  I tried to be nice before and it didn't work, and since those episodes with them I became a tough cookie.  Sad but true. My skin is covered with rash and tiny blisters (do not pop the blisters) and ask for steroid cream like Topicort.  It worked right away and dried up the rash and took care of the itch.  Nipple is crusty and I applied a thick layer of Miaderm.  The whole breast is pink. I will report back in a couple of days if there's any improvement.  Good luck to you all and thank you so much for your support, it was rough for me but you ladies helped me tremendously, I will never forget :) Feel free to PM me anytime you like.  ",
      "MessageIndex": 534,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Dec 1, 2010 08:38PM DiamondGirl wrote: Tina ~ good luck with the boosts, they are very easy and quick too :) The rest of the ladies, you are close to the finish line.  Good luck!",
      "MessageIndex": 536,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Dec 4, 2010 09:26PM DiamondGirl wrote: Carolyn ~ Wooohoooo, congrats you are done!!! As for me, I went to the urgent care this afternoon due to skin rash appearing on my face and ears and left upper arm and it also spread to the stomach from the left breast.  The dots looks identical to the ones on my radiated breast.  I knew it would be tough for the doctor to diagnose, it could be (1) what I ate on Tuesday night, which was a small bite of Melba toast kind of thing and instantly my lips and tonge was itchy.  Wed morning, my right ear started to itch a little and it just grew like wild fire.  The right ear was red, hot, itchy and swollen.  Then dots was on my cheeks and upper left arm.  Then Friday went below my left rib area and appearing on the upper left arm.  It is just so weird.  (2) it could be a virus, a big maybe b/c my DH is a bit under the weather, and (3) radiation dermatitis.  So the doc is leaning on radiation dermatitis.  I got rx for the rash and the prednisone to deal with it for several days.  Just when I thought I was done and can take a break :( Tina, my platelet count is in the low 200s, and ladies thanks for the clarification.  I wonder why I have to ask the med onco for tests, shouldn't that be prescribed anyway?  ",
      "MessageIndex": 549,
      "PostDate": "04/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Dec 15, 2010 11:34PM DiamondGirl wrote: Tina ~ Congrats to YOU !!! So happy to hear that you are done :) Your rad onc is right-on, and I'm one of those who got the immune system attack and got the rash flare up during the last week of treatment. I went for my first LE physical therapy, they use an electronic machine to lightly massage the area affected, re-directing the lymph fluid to channel away, feels great when they did it although I was forewarned that I may feel weird elsewhere.  Will let you all know tomorrow morning.",
      "MessageIndex": 573,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Jan 21, 2011 02:41PM DiamondGirl wrote: Sorry to announce, Bopeep became an angel.  RIP Bopeep! No more suffering.",
      "MessageIndex": 586,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Dec 4, 2010 09:49PM DiamondGirl wrote: leeinvegas~ I lost your phone number, please PM me :)",
      "MessageIndex": 550,
      "PostDate": "04/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Dec 6, 2010 08:34PM DiamondGirl wrote: Hi Joan (JFV), My med onc does the same thing, except I have to go to a lab to get the blood work done.  I always ask for my copy (not that I wanted to read it and worry over it), but for the fact that I have my own copy and I will fax the same copy to my primary doc.  I don't trust the system so I wanted to make sure that they get a copy and I can follow up with the medical records of my primary doc.   Thank you gals for suggesting to ask for Vit D test.  I will certainly do that :)",
      "MessageIndex": 552,
      "PostDate": "06/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Jan 12, 2011 01:32PM DiamondGirl wrote: Heather (hmh23) ~ I started to have my SNB side having major discomfort since around the 4th week into the rads.  By the time my rads were done, it is flared up beyond discomfort.  The pain radiated from the shoulder towards the elbow and it was like a band of muscle (I can't even describe it properly).  Then there's this pain that is compared to a bruised type of pain and that was in the bak side of my armpit towards the shoulder blade area.  There was no visible bruise or funny color on the skin.  Although I'm right handed I normally use my left arm (SNB side) to hold the phones and stuffs, and I find it impossible to hold and phone for even a few minutes without feeling numbness or discomfort. Is your pain continuous? Does it even let up?  Mine is there all the time.  My armpit also feels like it has a quail egg inside :(  if it doesn't flare up then it is just a small lump, if it flares up then it gives me dull pain. Designermom ~ thanks for the heads up.  I too was thinking about having an elective surgery on the ovaries and tubes but you are right about the other organs shifting.   My Onc naver ordered BRCA test on me at all.  Did you have to ask for it?  ",
      "MessageIndex": 584,
      "PostDate": "12/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 25, 2010 12:24PM - edited Aug 20, 2013 03:01AM by DiamondGirl Deb - I'm still using the miaderm samples.  Have you tried their website?  I'm not sure if it's RX or not. I am now waiting for BS office to call back.  Have swollen axilla, pulling and slight numbness all the way to the elbow, breast slight swollen as well. Nipple got 2 shades darker already.  Inside elbow is a bit swollen. Anyone going through this too?",
      "MessageIndex": 312,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 13, 2010 10:37PM DiamondGirl wrote: A big congrats Joan!!! Woohoo!!!",
      "MessageIndex": 446,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 18, 2010 08:51AM DiamondGirl wrote: Hello all :) I would like to take a survey : 1). Was your rad onc ever inside the vault to check on the alignment as you are laying under the machine? 2).Are there always 2 rad techs aligning you every day for your rads? Your answers are very important to me, thank you gals in advance :)",
      "MessageIndex": 478,
      "PostDate": "18/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 19, 2010 08:46PM DiamondGirl wrote: Good evening ladies, Thank you soo much for taking the time to do the survey.  Like I said, I told my rad onc yesterday that I was not happy that this office was 2.5 weeks under staff.  He again told me that it is the norm to have only 1 tech to align throughout the States.  I quickly told him that I talked to you ladies and it was not true.  They are quick to cover up and tell me anything other than the real truth, that which is sad.  It's not only a breach of my privacy at the beginning, it was again a breach of my well-being when they re-use dirty sheets.  I don't have good feelings about them any more.  It is just a chore for me to finish my few days of regular treatment and then 5 boosts.  I know that my rad onc did not sign up for this as he just moved in town a few months ago.  This center has been around for many years and it is just poorly run by the corporation. How do you ladies feel about the new TSA pat down rule?  I think they should have a BC survivor on the panel.  I just can't foresee myself being pat down, my scar did not heal well and I have LE symptoms, I just can't forsee being touched.  What do y'all think? I should start a thread and talk about it here.  Wonder if there's one like it already?",
      "MessageIndex": 493,
      "PostDate": "19/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Dec 2, 2010 03:25PM DiamondGirl wrote: Kelly ~ I would be very careful about the sun.  My rad onc told me at my very first appointment that I needed to wear clothing to protect the skin all the way near collar bone.  Are you able to call your rad onc and ask whether it'll be ok? Deb ~ I was really zonked this morning and had to climb back to bed.  Yesterday was my last day and I had back-to-back doctor appointment and did grocery after.  The boost area is now bright pink and the rest of the breast is still pink with the rash dried up.  The skin is definitely tight.  My platelet count dropped 40 pts from before the radiation so that maybe a reason for the tiredness.   Has anyone compared blood test results (before and after rads)?",
      "MessageIndex": 542,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Dec 3, 2010 09:35PM - edited Aug 20, 2013 03:19AM by DiamondGirl Joan and CT124, where do I see Vit D on the blood report?  Has anyone looked at their CA 27.29 (it is the tumor marker), anything less than 40 is good.  Mine is now 10 from 13 (before the rads), however, the Segmented Neutrophils has shot up to 79 (high side) and Lymphocytes is 13 (low end).  The platelet count which dropped 42 points is disturbing :( I think I should start taking the Vit D3 now, and I am also to start my Tamoxifen right away. The skin is still red and started to peel and painful because it rubbed against my t-shirt and can't wear a bra yet.  Underarm is still swollen and has a bit of burning.",
      "MessageIndex": 545,
      "PostDate": "03/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Dec 11, 2010 03:01PM DiamondGirl wrote: Good day all :) I got radiation dermatitis 2 days after my rads were done.  It just flared up and my immune system got hay wire and I got an acute skin reaction.  Aside from feeling fatigued now and then (not severe), I must say there are 2 complaints: 1.  rhino nipple, dry scaly, raw and sensitive 2.  back of arm pit and nearby area in the back felt like internal bruising.  There's no visible bruises but when I touch it, it felt like I was punched hard and got a bad bruise.  There are also some phantom pains here and there appeared to be more frequent after radiation. Hope everybody are ready for the Christmas holiday! Wonder how many others are still doing the zapping?  You are not far from the finish line, you go girl !! {{HUGS}}}",
      "MessageIndex": 562,
      "PostDate": "11/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Dec 14, 2010 10:04PM DiamondGirl wrote: I want to share with you that I went to the Lymphetic Physical Therapist yesterday and after the measurements and jotting down my complaints, I was told that I have flare ups underarm, little swelling on the inside elbow and there's LE on my back which radiated from the underarm.  I will start LE treatment tomorrow, I hope it won't hurt too bad.  Nipple is still sore and the skin rash is 95% gone.  I am feeling fatigued now and then, I will have to say it is worse than when I was getting the rad tx.  This too shall pass :)",
      "MessageIndex": 569,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Jan 5, 2011 11:48AM - edited Jan 5, 2011 11:49AM by DiamondGirl Whew! {{{{HUGS}}}}",
      "MessageIndex": 41,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762909",
      "Title": "eek apple MJLToday"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Jan 5, 2011 10:37AM DiamondGirl wrote: Apple ~ I'm thinking of you and your family and prayers goes out to you.  You have a compassionate doctor which is hard to come by these days.  God Bless!",
      "MessageIndex": 33,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762909",
      "Title": "eek apple MJLToday"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Aug 28, 2011 09:44AM - edited Aug 28, 2011 09:45AM by DiamondGirl Congrats and Thank you for sharing. My hot flashes is getting worse but don't ever want to give up my \"one\" cup of coffee in the morning :) God Bless.",
      "MessageIndex": 1,
      "PostDate": "28/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773835",
      "Title": "3 years + AnnR AnacortesGirl"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Dec 4, 2010 10:14PM DiamondGirl wrote: I had 5 because of limited range of motion in the 1st ct.  After 2 weeks, range of motion improved and needed the 2nd ct, hence 2 more tats.",
      "MessageIndex": 10,
      "PostDate": "04/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/761429",
      "Title": "How many Tattoos/marks did you get? Tg5471530 Tg5471530"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 2, 2010 12:55PM - edited Aug 20, 2013 02:51AM by DiamondGirl Hi, Ranafazal ~ My med onc said to stay on Tamoxifen unless rad onc said otherwise.  When I talked to rad onc, initially he said it's alright to stay on it, but he would prefer that I get off it.  So after I told him what my med onc said, he asked me to stop my Tamoxifen.  The reason being that the rad onc needs to make sure that whatever SE that comes along, they can tell right away what caused it.  If Tamoxifen is in the system, then it will be harder to rule things out.  I stopped my Tamoxifen around Sept 12th.   Quiche ~ my rad onc suggested Miaderm (www.miaderm.com) and Aquafor.  I am to start using either one after my first treatment.",
      "MessageIndex": 75,
      "PostDate": "02/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 9, 2010 01:16PM - edited Aug 20, 2013 02:54AM by DiamondGirl Nancy91355 ~ we have very similar DX and I am going to have 33 tx of traditional rads.  I wonder if your doctor's office is conducting some sort of study or are they getting some kind of grants?  Also maybe you may want to call their billing office and see what is the billing code for this Brachy tx?  Then call your medical insurance and see how the rad's office will be paid (and if there's any difference in reimbursement to them).  That's what I'll do if it happens to me. I often wonder if it has to do with their bottom line.",
      "MessageIndex": 148,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 20, 2010 10:22PM - edited Aug 20, 2013 02:59AM by DiamondGirl Thanks Kathy for being supportive.  My own sister didn't think it was that bad and it got me fuming.  Another lady on BCO thought that it is a violation of patient's privacy too. And BTW, has any ladies here (who had SNB) get a sore underarm? I don't mean raw skin, I mean feeling a little swollen in the arm pit?  I'm wondering if this could be normal.  It's weird, I didn't complain much about the arm pit area after surgery, but now it is bothering me.  Will talk to the rad onc tomorrow. Good nite.",
      "MessageIndex": 277,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 13, 2010 01:35PM - edited Aug 20, 2013 02:55AM by DiamondGirl Hi chiefswife and JFV, I'm just one tx slower than you gals.  I'll be getting my 2nd tx today.  After checking out with other gals, I did apply some Aquafor last night.  The site is giving me some phantom pain, not a lot, just a little jolt now and then, the area is a tiny bit warmer than the un-treated side.   I read in a thread earlier about how many angles it aims at you.  I think I'm just getting in 2 angles (not sure of the correct terminology).  Left side and then it rotated to my right side, I'm getting tx on my L breast.",
      "MessageIndex": 185,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 13, 2010 07:41PM - edited Aug 20, 2013 02:56AM by DiamondGirl Hi ladies, When the rad machine is pointing at you (at an angle), do you count the number of zaps (or ticks) that it makes?  If I'm counting correctly, think I get 12 from each direction.  And I get it at 2 angles.  Can you share what you are getting?  Does the area feel warmer?  I had my 2nd tx today and 31 more to go.  I can feel that the inside is a bit heated up (so to speak).  Yes Aquafor is a bit greasy, so I tried a sample of the Miaderm tonight will see how it goes.",
      "MessageIndex": 194,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 24, 2010 09:24AM - edited Aug 20, 2013 03:00AM by DiamondGirl Deb ~ thank you.  I have slight swelling on the breast too, I didn't have recon.",
      "MessageIndex": 303,
      "PostDate": "24/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 22, 2010 02:00PM DiamondGirl wrote: MPH, Linda & Tina ~ thanks for the update :) It sort of looks like the diaper rash, the white head I'm talking about is smaller than the tip of the ball point pen, some have it some don't.  Also have some tiny freckles on the bottom quadrant and skin is pink.   I wonder why it comes about when I'm only less than 10 zaps away?   Linda ~ are you done with your rads?  If not, how many left to go? If my memory is correct, I think MPH and Tina are done with rads right? On, on the TSA issue: I think it would be a great idea if a Rad Onc will step up and explain to us about our exposure to radiation from the Body Scanners at the airport so that we can make an accurate informed decision about going thru it or not. (Right now, a lot of people are just guessing).  Does the FDA have to approve the machines before it is being licensed?  (if not FDA, whatever the agency has jurisdiction), then we should be able to find out from them what amount of radiation is being emitted. I too have my fear about receiving too much radiation already, but I will not be a good candidate to go thru enhanced pat down, because my scar is not healing properly and will eventually need a scar revision.  Sigh!",
      "MessageIndex": 505,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 10, 2010 09:35PM - edited Aug 20, 2013 03:09AM by DiamondGirl Hi everybody, I want to give you an update.  I emailed my rad onc 2 hrs prior to my appointment (thank you beanius for your help).  He has not replied.  When I got to the vault, the student tech was not there today so I spoke with the rad tech.  She flatly denied that it is the practice of that facility and wasn't sure why that student told me that.  (ROFL).  I didn't go there without preparation.  I activated the record feature on my cell phone and recorded the conversation between the rad tech and I today.  My DH was amazed at what was being said today.   I had also exhausted myself all morning calling to different State agencies and none have jurisdiction to the facility.  Apparently, the facility I go to is classified as a doctor's office (when it is not located within a hospital).  Another thing is that if I called the medical examiner's office, I have to file a complaint against the doctor in charge of the facility or who owns the facility.  Secretary of State site indicated that the facility president is in Florida, and is under a foreign corporation. Not only are they not changing the sheets properly, there were many incidents there were just 1 rad tech running the machine, no helpers to align me. Tell me about transmittal diseases, and some of you even thought about bacteria left by previous patients, I have witnessed several people with scabs on their arms and a couple of people were pretty sickly looking.  I didn't think about the arm rests until you mentioned it, \"Yew\"!  I do see my rad onc every Thursday, and I just wonder how he'll dismiss my complaint about cleanliness this time.  Will keep y'all posted. Good night.",
      "MessageIndex": 425,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 12, 2010 05:13PM DiamondGirl wrote: Hi All, Update from seeing rad onc... He didn't reply to my email re dirty sheets but he acknowledged that he spoke with the office administrator that the turning over the dirty sheet was not acceptable.  It was just an isolated incident with the student (NOT), I too think that the student was telling the truth.  Thank you all for the info and support.  I will bring my own sheet from now on :) The machine is down today and I have 12 zaps left.  Chest is tight so breathing is on the shallow end.  I do have this pain below L shoulder blade.  Felt like someone punched me and there's an internal bruise.  Rad Onc again said that there's no infection cuz he can't see it.  No kidding.  I wonder why he can't tell me that it's all the side effects from radiation that something is disrupted inside and causing this.  He instead said that it's because I laid on the hard surface which I can't quite believe it is due to that.  Sigh! I'm pink, no blister or peeling.  Pain under the arm and little bit of numbness on my Left arm. I used Miaderm and not agreeing with Aquafor.",
      "MessageIndex": 439,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 14, 2010 05:49PM DiamondGirl wrote: MichelleC, you are on point on that.  My rad onc even said it to me point blank when I told him about my underarm being swollen and all.  He said that he will blame it to the surgery and it was never the radiation that caused my inflamation.  I told him point blank that I was already 95% healed. I never had any pain under my arm and it was in all my post surgery (recovery) reports, both in 2003 and 2010. And that I never took any pain medicine.  I fine it amazing that I am having swollen armpits and pain now 2 weeks into my rads.  I also told him that I am not looking to point a finger at anyone but the mere fact that I need to know if there will ever be a solution to this discomfort.  Sorry to say that I've lost trust to my rad team :( {{{hugs}}}",
      "MessageIndex": 450,
      "PostDate": "14/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 16, 2010 06:54PM DiamondGirl wrote: Linda and Roberta ~ WOOOHOOO !!!  So happy for you gals. I have 10 more to go myself.  I just can't wait till this rad tx is over.  I'm starting the count down :)",
      "MessageIndex": 468,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 18, 2010 08:59PM DiamondGirl wrote: Good evening ladies, I have 3 more rad tx to go, and 5 boosts.  I see my rad onc every Thursday (this afternoon).  I told him how I'm concerned about my treatment since there's only been 1 rad tech for the past 2.5 weeks.  He again said to me it is the norm across the United States.  I couldn't wait to tell him that I talked to the other breast cancer patients and they have either 2 to maybe even 3 techs aligning them.  He said 2 to 3 is an over kill.  I don't believe him anymore. So thank you for taking the survey, you've armed me with vital information! I appreciate it. I've developed a few bumps of rash at the lower quadrant of the breast, skin tightening and pink.  Maybe a little bit of crusty on the nipple.  I was also told that these are normal SE of rads. Good luck everybody, we are heading towards the finish line (at different pace), but will get there!!! Hugs",
      "MessageIndex": 486,
      "PostDate": "18/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 23, 2010 09:04AM DiamondGirl wrote: Linda ~ thank you for posting your info. Did your rad onc say why we get rash? And did you take Benadryl while you were still receiving treatment? Or did you take Benadryl after treatment was complete?  Sandi ~ WOOHOO!!  Carolyn ~ yes, you are close to the home stretch too.  THink you are about a few tx behind me. Good luck !! Ranafazal ~ so happy for you. My boost stars Wed. so I'm 5 tx behind you.  Congrats! Tina ~ you are a bit more than mid-way thru.  I remember when I was counting at 17, and it didn't seem too long ago.  It goes by fast.  Good luck to you :)  I was joking with someone yesterday about the enhanced pat down, my scar is still painful and I can't even rub the area myself, if they touch me I will scream!!! (LOL) You ladies are awesome and I so appreciate everybody sharing their experiences here.  Thank you for the support and I know the ladies after us will gain insight too.  Thank you BCO board.",
      "MessageIndex": 511,
      "PostDate": "23/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 24, 2010 07:04PM DiamondGirl wrote: Did my 1st boost today, 4 more to go.  About fatigue, I think I felt it bad a few times and glad that was it.  The fatigue happened when I had those nasty incidents and I was stressed by them.  Then I didn't sleep well and it was the domino effects.  Remember you need to be hydrated and eat your protein.  I went beyong hungry one time and it was bad.  My skin is pink and got a bad rash.  Chest feels a little tight but I'm very happy that the full breast rads are done.  At first it seemed to take forever, but after I past #20, it was a breeze.  Ladies, you are almost there too.  I'll be your cheer leader dancing on the sideline :) I am very very grateful for this site and for all of you that supported and encouraged me.  I don't know what would happen if I didn't have you gals listen to my frustrations.  I know I always have a shoulder to lean on here, someone who'll listen and understand, then sympathize with me.  This is priceless.  Thank you thank you!!!    HAPPY THANKSGIVING TO YOU ALL ! XOXO",
      "MessageIndex": 515,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 29, 2010 09:48AM DiamondGirl wrote: Good morning all, I will be flying to Toronto in a couple of months, and will most likely go for the scanner due to the sensitivity to the scar (I can't even touch myself, so forget about enhanced pat down, I will scream bloody murder), and also I did not do recon after the partial mast and no prosthetic either.  It is a huge stress factor for me aside from possible LE.  So I'm also seeing that some ladies are feeling fatigue \"after\" the rads are done?  Oh-no ! Sorry to hear that.  Having a raw burnt skin is bad enough, I hope I will be spared from the fatigue.  Good luck to all ;)",
      "MessageIndex": 532,
      "PostDate": "29/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Jan 23, 2011 07:44PM DiamondGirl wrote: Hmh23, That's real good to hear.  I borrowed books from library, call Lymphedma.  It talks about not doing any strenuous exercises and no hot tubs etc...  I am still waiting for the skin around the aerola to heal.  Still feels tight and pulling at times :(",
      "MessageIndex": 588,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 2, 2011 02:51PM - edited Sep 2, 2011 03:00PM by DiamondGirl Hi Jacqui, I used to live in Toronto, and still have large family there.  The transportation assistance you can get in Toronto is \"Wheels Trans\".  It cost you 1 TTC token each way, your companion (if any, will pay the same fare).  We did that with our late Mom, sometimes it is a small van that carries 12-15 people, sometimes it is a Taxi that carries the wheelchair.  Whatever is assigned to you.  Very convenient and all you need to do is to schedule it a day or two ahead.  When your doctor's visit is over, you call and they will arrange to pick you up.   I tend to agree with other ladies that perhaps Toronto may be better for your kids (your friends can take them out) and the wheels trans service.  I don't know if they have it in Vancouver. Lena - wow, your story has encouraged me to be more independent.  Btw, I PM'd you. Coolbreeze - sorry about Stoli, I lost my dog 1 month after my surgery. I sent you a PM too. Namaste to everyone!",
      "MessageIndex": 14,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774070",
      "Title": "Need advice from \"experienced\" Stage IV' ers thisisme radiant"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 15, 2011 01:27PM DiamondGirl wrote: Martygra, I ditto what everybody said.  Big {{{HUGS}}} to you!  You have found great support here, I know you are just starting this journey, but be rest assured that you are never alone, we are all here to support you. Good luck to you and keep us posted.",
      "MessageIndex": 24,
      "PostDate": "15/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774739",
      "Title": "Off to the doctor today. martygra martygra"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 16, 2011 02:53AM DiamondGirl wrote: Dear Sas, This list you've written is so invaluable to the new patients.  I just found this thread and wished I had known about it when I was dx'd last year.  I do have a binder, I used the Avery Business card holder for all the doctors' business cards.  It is on a 3-ring sheet.  I also put some clear view sheet protectors in the binder as they are handy to tuck in receipts etc. I keep an original copy of notarized medical directives in the binder just in case anything happened and my husband would have a hard time getting through to the doctos/hospital.     If I come across anything else I will come back and add it to this thread. Sas, you are an Angel :) {{{{{HUGS}}}}}",
      "MessageIndex": 82,
      "PostDate": "16/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 23, 2011 02:36AM DiamondGirl wrote:",
      "MessageIndex": 94,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Mar 27, 2011 10:50PM DiamondGirl wrote: Thanks Kira for your info.  I hope you have a great time visiting Binney.  I returned the gauntlet because the edge was unravelling (poorly made).  I might try wrapping the hand.  It'll look strange alright!",
      "MessageIndex": 16,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/766682",
      "Title": "Anybody fly wrapped/TSA question kira Marple"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Aug 20, 2010 10:48AM DiamondGirl wrote: Hi MrsNice, I just found your post today, I too was diagnosed with the identical BC as you (on the L breast), I'm 48 with 18 yr old daughter and 13 yr old son. Had lumpectomy on 7/28, started Tamoxifen 10mg twice a day on 8/11.  I'm awaiting the results of the Oncotype DX test, Onc. doesn't think I need Chemo, and radiation will be 6.5 weeks.  Have you had any radiation yet?   Good luck & God Speed! LVP",
      "MessageIndex": 100,
      "PostDate": "20/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/754638",
      "Title": "just found out i have IDC ! so scared ! jlynnbain1031 dmorgan2"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Aug 29, 2010 04:21PM - edited Aug 29, 2010 04:22PM by DiamondGirl Hi All, I'm still relatively new to this BC thing but I've read quite a few threads on this board.  Just wondering why some BS will take out 1 node and others will take out 8 (when they are all negative?).  I thought that they will take out the 1st one to see if it's clean, then will take out more if necessary.  Can anyone explain this? It's such a great variation in numbers. Thanks.",
      "MessageIndex": 109,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/754638",
      "Title": "just found out i have IDC ! so scared ! jlynnbain1031 dmorgan2"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 10, 2011 01:33PM DiamondGirl wrote: YES!!! Fantastic news Lorraine, when are you heading back to Vgeas? So happy for you.",
      "MessageIndex": 23,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764684",
      "Title": "I am NED lorrhaw Lowrider54"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 14, 2010 06:03AM DiamondGirl wrote: Hi: Sespebadger ~ thanks for your detailed input.  I appreciate it.  In fact thanks to the BCO board that I read about other ladies not taking Tamoxifen while doing rads.  My med. onc wanted me to continue to take it, but now that he's on a month long vacation his partner said the ultimate say is with my rad. onc.  I'm so glad that I got that clarification. Good nite all! ",
      "MessageIndex": 188,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 15, 2010 11:35PM DiamondGirl wrote: Hi sistas, BocaCiegaBabe - thanks for the info re: the lines.  I tried raising my arm up and no it wasn't it.  The lines are drawn straight, then a right angle and then turn right angle, go up and then another angle like someone was having fun making a pattern.  I remember I was told that they don't need to draw any line when I did the simulation.  About your high bp, my rad onc is telling me to start taking Vit. D3, between 1,000 - 2,000 I.U. a day.  When my DH googled it, the D3 helps with blood pressure and better sleep and everything else.   Shelleyj43 - thanks for the cupcake idea.  I will bring them something and see if little \"goodies\" help.  Good luck on your simulation. Dutchgirl16 - ditto on that. Nwshannon - the scar on my breast is not healing well at all.  It's puckered and it is causing the aerola to be swollen and it is very tender.  BS said that the rads will make it worse.  I was told to take either IB profen or Alieve daily as they will take care of infections. Kaydub - you took the words out of my mouth.  The experience is surreal.  How's your day #2 going?  sespebadger - I totally agree. khilde - welcome to this group. Sorry if I'd forgotten anyone, it's my nervous brain at work right now.  Prayers to all.",
      "MessageIndex": 209,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 18, 2010 12:55AM DiamondGirl wrote: Hi there, my rads will be postponed due to an infection unrelated to the surgery so that's worrisome for me.  My BS gave me 10 days worth of antibiotics and the infection has to clear before I'm allowed to start. I'm worried if its new cancer :(",
      "MessageIndex": 265,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 19, 2010 06:50PM DiamondGirl wrote: Joni, I hear ya.  My rads are now postponed due to an infection.  My simulation was done by a guy and I wasn't comfortable (I didn't say a word).  And now I have my concern feeling uncomfortable with my 2 technicians (both women) that are not compassionate and do not communicate.  One has an attitude and makes me feel like I'm in a communist country.  When I ask a question (because I'm not forewarned when they were drawing lines on me), I will get a \"one word\" answer.  I remember reading the same thing over and over with different books (make sure you like your treatment team).  Problem is I have HMO and I'm stuck :( I will try to bribe them the next time though like other ladies suggested here.   Have a blessed week.",
      "MessageIndex": 285,
      "PostDate": "19/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 21, 2010 02:11AM DiamondGirl wrote: Yes, most definitely bubbalu.  You know about my issues also, there's a cloud over it too :( Good luck on your search and researh on your tx.  I won't be satisfied if they can't come up with a decent explanation, anything.  God Bless - I'll say a prayer that you will get to the bottom of it. Paula",
      "MessageIndex": 317,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 24, 2010 08:34AM DiamondGirl wrote: Just wondering, do you gals have the tx same time each day?  I have a daughter that goes to university and needed a ride to the bus stop each day, but it is different start time each day of the week.  So I thought I could have different schedule as long as the time slot was available and I can stick to the same pattern each week.  My rad tech said no, that I need to start at the same time each day (Mon to Friday).  Do you have the same stipulation or my rad tech is just not willing to work with me?",
      "MessageIndex": 347,
      "PostDate": "24/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 9, 2011 07:24AM DiamondGirl wrote: Dawn46, any news yet? Just checking in on you girl! Keep us posted.",
      "MessageIndex": 756,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 10, 2011 12:09AM DiamondGirl wrote: I received a FREE one from Peninsula Medical (see link below): http://www.lymphedema.com/alertband.htm I don't wear it daily but keep it inside my purse, I did however wore it on the day of my Brain MRI, but had to remove it prior to going in.  The technician also pointed out to me that a lot of times, it looks too much like jewelry that the medics/nurses won't identify with it.",
      "MessageIndex": 5,
      "PostDate": "10/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774438",
      "Title": "Medi al alert bracelet or some such thing K-Lo Mantra"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Aug 20, 2010 10:59AM - edited Aug 23, 2010 01:50PM by DiamondGirl",
      "MessageIndex": 101,
      "PostDate": "20/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/754638",
      "Title": "just found out i have IDC ! so scared ! jlynnbain1031 dmorgan2"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 17, 2011 02:16AM DiamondGirl wrote: Rockstar22, I don't have any answers but just want to bump it up so someone can give you an answer! Good luck!! {{{Hugs}}}",
      "MessageIndex": 1,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774580",
      "Title": "fascia not removed, path report: + margins in fascia! rockstar22 coraleliz"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 14, 2010 04:32AM DiamondGirl wrote: I just got a call today and the rad technician wanted me to go in tomorrow to do films.  They did my simulation last Tuesday and I will start my rads (total 33 sessions) on Wed, Sept 15.  They pushed  up one week.  Problem is that I just got my flu/H1N1 combo shot on Saturday and am worried that there may be a SE.  I even told the nurse who gave the shots that I will be going to get rads on Sept 20 and he said I will be fine.  Now I'm not sure if I needed to give the flu shot time to build it up in me or what?  The rad onc also have me stop my Tamoxifen (which I was on for a month). All of a sudden I feel skeptical !",
      "MessageIndex": 184,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 15, 2010 04:11AM DiamondGirl wrote: Thanks jsmiley60.  I didn't want to think that I'm starting to be super sensitive.  I am not that type but  today's \"coldness\" got to me.  Maybe I'm nervous myself, but you know what, I'm too old to not being able to decipher \"warm or cold\".  Thing is, what else can I do?  Big sigh! Paula",
      "MessageIndex": 194,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 26, 2010 03:40AM DiamondGirl wrote: Marmalade, I also asked about the Canadian protocol and I was told (by the doctor's assistant) that I can't get the shorter treatment because of my size.  The dosage is divided into 33 treatments (28 rads and 5 boosts), btw I didn't hear this from my rad onc.  I am also taking my antibiotic to get rid of my infection and the still haven't started rads, I will however be getting my PET scan next Thrusday and am praying for a clean no cancer PET.   Good luck to you all this coming week, HUGS !",
      "MessageIndex": 373,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Jan 22, 2011 09:45AM - edited Jan 22, 2011 09:46AM by DiamondGirl Dawn46 & Marie2 ~ I was originally on the Sept rads but it got postponed to Oct.  Finished rads on Dec 1st and I still feel discomfort under my arm on SNB side.  I'm 5 months post surgery (partial mast).  I feel like there's a small quail egg under my arm at times and the breast is still very tender.  My left arm is only getting about 90% range of motion and every time I raise my L arm up, it pulls everywhere.  Definitely not the same as pre-rads.  Do you ladies still have slight swelling?",
      "MessageIndex": 739,
      "PostDate": "22/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 12, 2011 09:00PM DiamondGirl wrote: Teka, can you please share more on the LE massage experience? I have been to one but it was too soon after rads and it gave me 2 weeks of set back. Thanks for sharing your info with us.",
      "MessageIndex": 768,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Mar 27, 2011 04:37PM DiamondGirl wrote: Kira, I'm flying next Tues (March 29th) to see my mom who is deteriorating (she's 88 years old) and I will also be on a 5 hour flight.  I just picked up my 1st compression arm sleeve, they special ordered it for me due to my small size.  I have a 5 inch wrist and they ordered a Jobst Bella Strong size S.  The box said that it will fit wrist size 5\" to 6 3/4\".  Tried it on and the wrist was way too big.  If I lay it flat and measure it, it is 2.75\" across which is 5.5 inches.  I don't have time to order a replacement. Do any one know if I should still wear the sleeve? I do not have swollen hands or wrist.  My only problem is the forearm and upper arm.  Please give me some advice, thank you!",
      "MessageIndex": 3,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/766682",
      "Title": "Anybody fly wrapped/TSA question kira Marple"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Mar 27, 2011 07:41PM DiamondGirl wrote: Thank you Barbe for representing us. I am saddened by Olga's passing.",
      "MessageIndex": 20,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766686",
      "Title": "Hugs From Yan barbe1958 Chevyboy"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 15, 2011 02:42PM DiamondGirl wrote: Good morning ladies, so glad to find this thread. I'm 75 days out of rads and am just now healing. Had LE evaluation, and one treatment so far. My entire left arm may feel like the blood is not circulating properly and hence a bit numb in that sense. In your experience, does the compression sleeve alleviate that sensation? My armpit is slightly swollen, tender to the touch, breast is still tender, I had partial mast due to 3 more tumors detected right before surgery. My mom is ill and I need to fly to visit her, not sure if I should wait to get a sleeve. I'm petite and they might have to special order. Thanks in advance.",
      "MessageIndex": 73,
      "PostDate": "15/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/764107",
      "Title": "New type of LE Garment Journey purple32"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Mar 27, 2011 06:27PM DiamondGirl wrote: Hi all, very glad I found this thread.  My mom's health condition is weakening and I must fly to see her on Tues, Mar 29th.  I didn't have sufficient time to shop for a compression sleeve but did manage to have one ordered and I just picked it up last Friday. I have a 5 inch wrist and the fitter ordered me a Jobst Bella Strong 20-30 mmHg Size Small.  In their chart it said that the wrist will fit 5\"- 6 3/4\".  Tried it on and everywhere fit well except the wrist, it has loose space.   I laid it flat and measured the wrist of the sleeve and it was 2.75\" across, that in itself is already 5.5\" wide.  I know you ladies have a lot of experience, can some one please tell me if I should still go ahead and wear it on my flight?  Will there be anything that I should watch out for when the wrist area is not tight?  I do not have swelling on the wrist nor hand.  I also had to return the gaunlet because the wrist was large too and the edging was unravelling. I wore the sleeve for 1 hour and it made me feel even more tingly.  My main issue is the forearm and upper arm.  I do have slight swelling in the axilla and slight swelling on the dx breast.  I had a partial mast and SNB.  Any suggestion or tips would be appreciated. Thank you all in advance!",
      "MessageIndex": 131,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/764107",
      "Title": "New type of LE Garment Journey purple32"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Mar 28, 2011 03:38AM - edited Mar 28, 2011 03:39AM by DiamondGirl Binney, thank you for your valuable detailed information.  I have one more question, should I wear it as I go through the scanner or should I put it on after all that.  Since my dx side is so sensitive to touch, I'm afraid I won't be able to be patted down.  It will definitely hurt.  I do have a LE therapist and it is a great idea to let them take a look.  I will keep you guys posted.  Again many thanks!",
      "MessageIndex": 135,
      "PostDate": "28/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/764107",
      "Title": "New type of LE Garment Journey purple32"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 10, 2010 06:50AM DiamondGirl wrote: Good evening ladies, I believe you can get your surgical reports and there will be mention of clips (and how many) intentionally left in you.  I think I read that I have at least one in me still and thought it was odd that I'm reading it.  Now that I found this thread, then it is true.  I never had any surgery pain but I'm now 6 weeks post surgery and am finding sharp pain here and there.  ",
      "MessageIndex": 27,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/747590",
      "Title": "20 plus surgical clips left..does anyone have this? smart23 MariH"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Aug 30, 2011 08:28PM DiamondGirl wrote: Hi Lawgirl, I just saw this thread.  I had the exact same thing happened to me several months back on the last week of my radiation.  It was blistering sooo bad.  I ended up seeing a doctor at an urgent care.  He told me I had \"radiation dermatitis\" and I was given a RX of Hydroxyz HCL 25mg tab one week supply.  I was also given steroids to take for 7 days.  Don't remember if I also took Zyrtec or not.  It took me several weeks to get all that to calm down.  It was so itchy and painful at the same time so I truly sympathize with you.  Out of all the gels and Calendula cremes only Miaderm worked best and at the final week, it didn't do a thing for me. Good luck and God Speed!",
      "MessageIndex": 15,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/773346",
      "Title": "help! Skin starting to blister and open... Lawgirl browniefranks"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Aug 16, 2013 03:28PM DiamondGirl wrote: Yes please Carol. I ditto Linda-n3.  Pat O'Connor, we can't thank you enough, R.I.P.",
      "MessageIndex": 19,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/809352",
      "Title": "Would you join a tribute to an amazing LE advocate? carol57 Marple"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 3, 2011 03:29AM - edited Sep 3, 2011 03:31AM by DiamondGirl I had the exact same thing happened to me after surgery.  I was back at the BS's office 3 days post op.  Told them that the area above the incision was very warm, and I also felt warm fluid running down my axilla on SNB side (I didn't have any drains).  They took a look, it wasn't red or anything but just warmer than my other breast.  I had 4 tumors in the same quadrant and the BS had to go wide.  He said that the breast will take 6 months to 2 years to completely heal.  So all those discomfort was actually normal.  It went on along with a low grade fever for about 2 months.  No visible infection to the surgeons and was told to take IB or Naproxen Sodium.  And I also noticed that if I didn't drink sufficient water, I get low grade fever.  Keep an eye on the area and see if it gets any pinker.  Don't panic though, when in doubt, go to Urgent care and let a doctor take a look.  I agree with LisaAlissa, it's always the weekend when things come up. ",
      "MessageIndex": 4,
      "PostDate": "03/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774138",
      "Title": "Warm area after lumpectomy? NancyJill NancyJill"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 24, 2011 11:08PM DiamondGirl wrote: Happy Birthday to you Lynn and many more to come :)",
      "MessageIndex": 26,
      "PostDate": "24/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765370",
      "Title": "Another year! :) Lynn1 Cynthia1962"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Nov 21, 2010 05:56PM - edited Aug 20, 2013 06:14AM by DiamondGirl Hi, I just stumbled upon this thread and I can't agree with you more Apple.  What a wonderful advice, and really how easily that we are focusing on the body and overlooked the \"little things that will make them happy and satisfied\".  Thank you for touching upon this so very important point and for sharing your experiences.  I also agree with Fitztwins and Claire.  Both also gave really great advice. I truly believe in miracles.",
      "MessageIndex": 8,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761013",
      "Title": "my mom given weeks to live-any advice appreciated nat100 vickib"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 18, 2010 08:14AM DiamondGirl wrote: JSmiley60, congrats on your #7 rad.  About how often does your onc ask you to get a blood test?  So far I've only saw my med onc twice since my surgery and he's asked for 1 blood test.  I won't see him until December 1st.  Meanwhile I'll be getting a PET scan.  Do they inject any dye for PET scans, can someone share their PET scan experience? Thanks.. ",
      "MessageIndex": 272,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 20, 2010 01:30AM DiamondGirl wrote: DMS - thank you for your support, I appreciate it. Alca - I want to welcome you to this thread.  They took pictures of me too and I was not given much notice ahead of time, although I knew about the tatoos which is three pin hole dots on me.  I was given conflicting information regarding more marks being drawn on me, meaning Sharpie pen marks that looked like a computer graphic map.  My techs were women but they are the coldest people I've met during this BC ordeal.  The guy tech that did my CT was more informative. I was talking with Lorraine who's starting rads this coming Thursday, she said that her rad onc popped in to double check the techs' measurements, which to me is very reassuring.  My rad onc was nowhere during my CT or simuilation and I would like to ask if you ladies can give me your experience during the simulation.  I believe some of us have a lot more drawings than needed and my thinking was perhaps my tech was a greenhorn.  During my simulation, the gals opened and shut the big thick door like a dozen times.  While I had to turn my face facing the right, I can see a green line, and there was a tape with 2 lines like a large + sign.  I even asked the tech, is this green line supposed to line up with the lines on this tape? And she said \"No\".   I hope to exchange notes with you ladies so that I'll know what's not being done properly since my techs don't talk.  ",
      "MessageIndex": 294,
      "PostDate": "20/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Jan 25, 2011 02:11AM DiamondGirl wrote: Deborrob and all, I got the tiny blisters all over the radiated breast since the 5th week of rads. Then 2 days out of 33 rads, I was at the urgent care. Dr. Said it was radiation dermatitis, had 1 week of steroids. Waited 2 weeks before they are gone. Yesterday, I notice a tiny oozing of sticky stuff and my skin on aerial is not healed yet. Could be skin yeast because it has a whitish sheen to it. Any suggestion to treat skin yeast ? Thanks.",
      "MessageIndex": 748,
      "PostDate": "25/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 13, 2011 08:00AM DiamondGirl wrote: Thanks Teka.",
      "MessageIndex": 770,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 4, 2011 01:42AM DiamondGirl wrote: Wahoo, very happy for you!!!",
      "MessageIndex": 5,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/764395",
      "Title": "I want to share, GREAT NEWS!!!!! faithfulheart JacquelineG"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Aug 31, 2010 02:08AM DiamondGirl wrote: Hi Sisters, Please add me in too!  Found out I don't need chemo last Friday and I will be going to get my CT on Sept 7th.   When I first met with my Rad. Onc, he said that I will do the 33 rad dosage.  My oncotype score is 15, so I am not sure why he is not prescribing the Canadian protocol.  Was it ever a choice given to you ladies?",
      "MessageIndex": 27,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 15, 2010 03:25AM DiamondGirl wrote: Speaking of bras, I bought Warners wire-free from JCPenneys and they were selling Buy 2 get 1 Free.  They are the most comfortable thing and I'm not big busted.  The seams are very well put together and they are also tag free.  The material is very very soft and they are great to be worn under T-shirts.  I've also tried on the bras at Walmart but they are just a thin cotton layer without much support.  I couldn't even wear the sports bra, I'm still too sore to. I have a question about the lines drawn during the dry-runs....? I had the films done today and there were 2 techs helping me.  Not the nicest of people, one gal is rather cold.  When she was using the sharpie on me, one would be gentle and the other is rough and unfortunately, she was not careful on my scar :( My question is...what do your lines look like?  I thought it was supposed to be a rectangle box and that was it.  Mine was more like a computer graphic with right angles here and there.  I also felt that the gal (the not so caring one) was doing it in haste.   I normally have great rapport with people right away but this time I'm not sure if I even like to be around these 2 gals for 6.5 weeks.  What an awful feeling :(",
      "MessageIndex": 192,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 21, 2010 12:15AM DiamondGirl wrote: Bubbalu - real sorry to hear about your issue.  No, you shouldn't have to deal with yet another problem, just want to give you a gentle {{{hug}}}.  I was thinking if it would be an idea to call some other cancer treatment centers like Mayo Clinic or some Radiology teaching hospital and pick the professors' brain?  For some reason, I think that if you were to ask around in your own group of rad oncologist, they are not likely to point out something went wrong (it could become a liability if they talked too much)?  So call around the Nation (use 411.com) and find rad onc and see if they will talk to you?  I know it is a long shot, but worth a try just to get to the bottom of it. About the Aquafor, do you use anything to cover the breast since it is so greasy? I don't want to ruin my t-shirts.  I had to purchase new t-shirts because of the map that they drew on me.  I look like Ms. Frankenstein. Sespebadger - regarding the blue tat that you have in the middle of chest.  My m-i-l had her eye brows tattooed and was not happy that it was way too thick.  Another salon that she went to was able to tatoo the flesh color on her brow to do the correction, and you can't even tell the flaw now.  So that's food for thought :) Do you ladies have your Rad. Onc supervise any of the simulation or dry runs?  Mine never showed up and felt like one of my tech was a pure \"Greenhorn\" ! - need your input please.  ",
      "MessageIndex": 311,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 21, 2010 01:55AM - edited Aug 20, 2013 11:46AM by DiamondGirl Thanks ladies, huh, my rad onc goes to different offices in a day and I was sure he was not physically there that day.  It's worrisome that this medical group is running their practice that way, they just acquired this facility not long ago.  Also, about Jasmine tea, I go to Asian Groceries, they have them in tea bags (box of 100 tea bags) and they taste great (I give them away to my clients and they love them).  The brand that I get is called : Asian Taste, they also make Green tea and it taste great also.  These are the Jasmine tea from China or Hong Kong. I've also tried the Japanese green tea and I couldn't drink it, it tasted like grass. I started a thread sometime ago called \"Starving Cancer\", it is about Anti-Angiogenesis  http://www.ted.com/talks/lang/eng/william_li.html",
      "MessageIndex": 316,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 26, 2010 09:24AM DiamondGirl wrote: marmalade, my sister lives in Brampton (she moved there since 1980 and my mom and other sisters are in Greater Toronto, I lived in T.O. for  5 years myself.   I intend to visit T.O. once my rads are done.  I'll PM all the Toronto/Brampton/Mississauga sistas and meet up with you gals.  Yes, Vegas is a fun place indeed.  But locals don't gamble, we just enjoy the world class cuisine and shows whenever possible :)",
      "MessageIndex": 376,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 10, 2011 07:18AM DiamondGirl wrote: Dawn46, good luck with the mammo and u.s. I'll be thinking of you on Friday. Deborrob, so sorry to hear about your new issue. I'm 70 days out of radiation and my skin still hasn't healed completely. And 2 days ago, a few of the tiny blisters came back. I hope it's from my night sweats and Tamoxifen SE. Please dont feel bad about your choice of tx, i tried to talk my BS out of referring me for rads. He said it's like peanut butter and jelly. Good luck to you on the tx, God Bless.",
      "MessageIndex": 764,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 10, 2011 02:11AM DiamondGirl wrote: Pejkug3 and trail2, I was diagnosed last summer, surgery within a month after dx. At first i was afraid to read my pathology report or go online to research anything. But then I thought, I am a control freak and I wouldn't want to be ignorant when it comes to my choice of care, so I braced myself and started researching. It is very tiring, my energy isn't back 100% yet but do know that the ladies here on BCO are all very caring and helpful. You can do this and you are never alone! Good luck with your treatment, keep us posted.",
      "MessageIndex": 3,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/764670",
      "Title": "Tired...I want off this ride... pejkug3 NSWTD"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 18, 2010 11:36AM DiamondGirl wrote: Hi, I'd like to share my feelings here too.  I would say that I am a strong person (emotionally), but I'd tell ya that I have never experienced this UP and DOWNS like I had since my dx in June 2010.  The fear that this BC has caused, the uncertainty and there are many of these moments.  At one point while awaiting for my results, I couldn't even stand my kids humming a song.  Or literally dread taking a phone call because I didn't want to explain my dx and results anymore.  Now that I have a new infection, I'm paranoid that it may be new cancer - sigh!",
      "MessageIndex": 15,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757530",
      "Title": "Feelings during therapy Cupcake001 phxsunshine"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Oct 9, 2011 04:18AM DiamondGirl wrote: I am very sorry for your loss.  I know how you feel, I lost my mom 6 months ago.  My sincere condolences.",
      "MessageIndex": 48,
      "PostDate": "09/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776066",
      "Title": "JoyRebecca is an angel tjgraham Danie"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 21, 2010 10:50AM DiamondGirl wrote: Amen to that.  God speed GrannyD, we are praying for you!!",
      "MessageIndex": 3687,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Jul 28, 2011 01:54AM DiamondGirl wrote: I have the same thing, I had partial mx, 1 SNB and rads.  My underarm hurts intermittently and my breast area is still sore although I am one year out.  Take a look at a Lymphedema website : www.stepup-speakout.org",
      "MessageIndex": 6,
      "PostDate": "28/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/772216",
      "Title": "Breast pain months after mastectomy? pp729 Marl5900"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 16, 2010 12:28AM DiamondGirl wrote: BocaCiega ~ yes, your'e absolutely right about nerves.  I keep replaying what to do in my sleep, hence I had a bad night :( SweetMarci + BocaCiega ~ you gals are so lucky.  Although I've gotta say that I loved my BS and his nurses and people at the office.  Med. Onc was good, people at his office are ok.  I like my Rad Onc too and his assistant but I didn't see that gal.  During this whole BC journey, I've met so many wonderful people.  In fact I was shopping at Auto Zone yesterday trying to get a sheep skin seat belt wrap.  The lady and I talked and I told her I will be needing it because of radiation.  She said she's been there, had to have both breasts zapped and she came out of the counter to give me a hug and told me that she'll pray for me.  I'm hoping that the one gal was just having a bad day.  ",
      "MessageIndex": 216,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 17, 2010 08:01AM DiamondGirl wrote: I'm just now catching up on the posts from today.  I have 3 tats in black ink.  They are supposed to be insect sting, but 2 of them hurted. Initially during the CT, I was told the 3 dots were \"it\".  Not true, when I went for simulation, one of the techs had a field day with the black sharpie.  I ended up having to zip up my hoodie to hide the drawings.  Felt like Ms. Frankenstein.  I do have 1 circle tape. But the large broken up lines drawn on me is what made me feel uncomfortable and with this hot weather here in Vegas, it is hard to cover it up :(",
      "MessageIndex": 247,
      "PostDate": "17/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 22, 2010 02:42AM DiamondGirl wrote: Bubbalu ~ Mayo Clinic 24 Hr. Nurse Hotline is  1-877-351-9900.  Just found it online.  Try it out, good luck!!! Paula",
      "MessageIndex": 331,
      "PostDate": "22/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Mar 27, 2011 07:36PM DiamondGirl wrote: Bump",
      "MessageIndex": 133,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/764107",
      "Title": "New type of LE Garment Journey purple32"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "May 31, 2013 06:55PM DiamondGirl wrote: Hang in there Patti, you are in the right place.  We all know what you are going through, know that you are not alone.  {{{Hugs}}}",
      "MessageIndex": 8,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805513",
      "Title": "just found out today im scared chattipatti chattipatti"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 10, 2011 09:36PM - edited Feb 10, 2011 09:38PM by DiamondGirl I don't have any answers but agree with SherrySt that it is most likely stress. Are you taking Tamoxifen? Hope you get some answers soon. (((((hugs)))))",
      "MessageIndex": 2,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764719",
      "Title": "3-months post-surgery and... my hair is breaking. Anyone else? sunshinegal NJMarilyn"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Feb 6, 2011 06:49PM DiamondGirl wrote: I totally agree with Monica and pinkrose, trust your own gut feeling and find another doctor.  Good luck and keep us posted.",
      "MessageIndex": 5,
      "PostDate": "06/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764506",
      "Title": "Dr made me feel I wasted her time. leeronnie barbe1958"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 4, 2011 04:42PM DiamondGirl wrote: Hi CindyT, I was dx in late June 2010, did lumpectomy, rads and on Tamoxifen.  My ER+/PR+ are high like yours.  I know what you are going on right now and sympathize with what you are going through.  First take a deep breath and try not to think about the \"ifs\" right now (I know easier said than done), I agree with others that without knowing the HER status it is too early to worry and decide anything on treatments.  Having high ER/PR numbers means the tumor is a slow growing type.  There are many helpful members on this site and have you looked around Stage 2 threads?   We all know what you are going through, please stay calm and be strong, you can do it. Sending {{{{HUGS}}}} to you!",
      "MessageIndex": 5,
      "PostDate": "04/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774194",
      "Title": "Fear CindyT jazz3000"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Sep 17, 2011 02:13AM DiamondGirl wrote: I developed radiation dermititis and 2 days after I finished my 33rd rads I had to be seen by a doctor at the urgent care.  He gave me a week worth of steriods, hydroxyz hcl and zyrtec.  The rash lasted more than 3 weeks.  Like what Sherryc said, it continued on and off.  I'm 9 months out and I also have to change my detergent and fabric softner.  They are both fragrance free, if I use the fragranced softner, the rash breaks out again. I hope you get better soon.",
      "MessageIndex": 9,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/774768",
      "Title": "rash and redness under breast pat01 pat01"
    },
    {
      "AuthorID": "DiamondGirl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107163/profile",
      "Content": "Jul 28, 2014 12:11AM DiamondGirl wrote: Hi Kathleen 1966, Many congrats to you on your 4th Anniversary!!!  I will also be celebrating 4th year tomorrow (7/28/14) that was my surgery date.  My cancer was confirmed on June 2010.   Congrats again!!! Woohoot! {{{{{{{{{HUGS}}}}}}}}}",
      "MessageIndex": 7,
      "PostDate": "28/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/823139",
      "Title": "4 years today for me! kathleen1966 Alloway"
    }
  ]
}