{
  "AuthorID": "Diane1960",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111605/profile",
  "Posts": [
    {
      "AuthorID": "Diane1960",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111605/profile",
      "Content": "Dec 16, 2010 06:19PM - edited Aug 20, 2013 03:25AM by Diane1960 Boobsinabox, Kira and Binney; Thank you all for your responses and kind words.  Thank you for the link Boobsinabox (love the name)!  I will definitely check it after I leave here.  Kira, the oncologist didn't mention a seroma. She really didn't have much to say about it other than acknowledging the swelling and hardness. After she checked mom's underarm, she set up the appointment with the lymphedema clinic.  Mom has an appointment there after Christmas. Mom hasn't had an easy time of it with all of the surgeries and a stay in the hospital due to complications from her port surgery.  I was really hoping she wouldn't have anything else to worry about for a while. ",
      "MessageIndex": 16,
      "PostDate": "16/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/762083",
      "Title": "I think I have LE saturn saturn"
    },
    {
      "AuthorID": "Diane1960",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111605/profile",
      "Content": "Dec 16, 2010 03:34PM - edited Aug 20, 2013 03:25AM by Diane1960 Hello everyone,  I don't know if I'm posting this in the right place. I apologize if I'm not. I'm here trying to get information of my mom.  Over a 3-week period in September, she had a lumpectomy with SNB, re-excision and then a mastectomy.  Last week she noticed painful swelling under her arm.  Yesterday her underarm felt very hard.  We had her oncologist look at it yesterday during her chemo session.  The oncologist referred her to the lymphedema clinic.  Did any of you experience pain under your arm with your lympedema?  I haven't had time to do any research about lymphedema and I would appreciate any information you ladies can give me.",
      "MessageIndex": 11,
      "PostDate": "16/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/762083",
      "Title": "I think I have LE saturn saturn"
    },
    {
      "AuthorID": "Diane1960",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111605/profile",
      "Content": "Nov 30, 2010 02:55PM - edited Aug 20, 2013 06:17AM by Diane1960  My mom started chemo (taxotere, carboplatin and herceptin) on Nov 4.  She started losing some hair last Wednesday, the same day as her 2nd treatment.  She's 68 and has always had very thick hair.  When I saw her on Sunday her hair was thinning, especially at her part area, but she still had a full head of hair.   Is it normal to have so much hair almost a month after starting chemo?  She thought she'd be bald by now.",
      "MessageIndex": 6745,
      "PostDate": "30/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Diane1960",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111605/profile",
      "Content": "Dec 1, 2010 09:25PM - edited Aug 20, 2013 06:18AM by Diane1960 KimLovesDachshunds-  Congratulations on completing your treatment and your new hair growth!  My mom started shedding on day 21, the day of her 2nd treatment.  We had planned to shave her head over Thanksgiving while I there visiting.  By Sunday her hair was thinner, but she still had a full head of hair and wasn't quite ready to part with it.  I won't be visiting again until her next treatment so my dad will have to shave her head when the time comes. The hair loss has been harder for my mom than the mastectomy was.  I wish we could fast forward to a year from now and life will be somewhat normal again. Love and hugs to you! ",
      "MessageIndex": 6790,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    }
  ]
}