{
  "AuthorID": "dianabee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/285826/profile",
  "Posts": [
    {
      "AuthorID": "dianabee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/285826/profile",
      "Content": "Feb 28, 2019 09:43PM dianabee wrote: I went to a chemo info session today. It was just general information, but such a full room of people. It really struck me just how many are affected by different cancers. Afterwards, I realized that the woman who did my mortgage was there. She's a new Mom with a 5 month old baby and just found out 2 weeks ago that she has lymphoma. It was a strange afternoon and I'm still processing why I feel it was strange. I've also got some consultations lined up for wigs, started with Latisse for lashes and have an appointment for microblading the brows. Another week of work, beach holiday, then a few days after and I'll be starting this next phase. Still debating cold caps. For now, I'm treating myself to some silver highlights and a trim, the last time for a long time LOL.",
      "MessageIndex": 28,
      "PostDate": "28/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "dianabee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/285826/profile",
      "Content": "Feb 21, 2019 07:47AM dianabee wrote: I start March 18, taxol and herceptin for 12 weeks, then herceptin shots for 9 months. I was dx with DCIS and a 1.2 mm lesion with micro-invasion in Dec. and had a left breast mastectomy Jan.17. The pathology found the cancer to be multi-focal and 15 areas of micro-invasion. I'm ER/PR- and HER2+ so even with super small tumour and no node involvement, chemo is the safe bet. This all started out as a lumpectomy and radiation 8 weeks ago, so I'm still in shock.",
      "MessageIndex": 9,
      "PostDate": "21/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "dianabee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/285826/profile",
      "Content": "Mar 20, 2019 09:46PM dianabee wrote: Hi ladies, well I was supposed to start this week, but I've been bumped so next week it is. Perhaps I should have signed up the April group. Anyways, I'm ready to roll: had my brows microbladed (and I love them) my cold caps are waiting, got a deal on ice, using Latisse on my lashes and taking my B supplements, silica and glutamine. I've been working on getting my lungs in a good place and controlling COPD breathing issues better, surgery really knocked me out in that respect. Spent a week in Mexico to help clear anxiety (for me and husband) last week. I'm as ready for this as I'm gonna be!",
      "MessageIndex": 203,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    }
  ]
}