{
  "AuthorID": "didigro",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130649/profile",
  "Posts": [
    {
      "AuthorID": "didigro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130649/profile",
      "Content": "Jun 16, 2011 09:26AM didigro wrote: thanks for the input-i am a bit more relieved.....what happens to us, just happens and  we have no choice but to fight for our lives.",
      "MessageIndex": 3,
      "PostDate": "16/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/770321",
      "Title": "tired of fighting didigro sanbar8771"
    },
    {
      "AuthorID": "didigro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130649/profile",
      "Content": "Jun 16, 2011 09:27AM didigro wrote: whats bumping up??? thanx...havent been here in a while, the site has been upgraded a lot...heh heh",
      "MessageIndex": 4,
      "PostDate": "16/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/770321",
      "Title": "tired of fighting didigro sanbar8771"
    },
    {
      "AuthorID": "didigro",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/130649/profile",
      "Content": "didigro wrote: Hi....I had a double mastectomy in 2006.....had the expanders and then silicone implants put in-I got a terrible infection from a root canal in 2009 and needed an implant excahnge which almost cost me my life!!! I developed pneumonia, cellulitis and STAF infection. I was in the hospital for 2 weeks and they sent me home with a PICC line (an IV that goes directly to ur heart for antibiotics)-I had the PICC line for an additional 3 months and was on the last resort antibiotic,VANCOMIACIN-it was a nightmare! Last month I started having EXCRUCIATING pain in my left breast-its capsular contracture-AGAIN! I need to have ANOTHER SURGERY(my 6th) to remove the scar tissue-my doc also wants to switch me to saline implants. Im not thrilled about this, as the implants I have now are the closest I can get to a natural looking breast(yeah right,lol)...I dont want saline, ripples, water bubbles in my chest. Does anyone have the saline? how do they look? how do they feel? mine are hard as rocks!!!! My ex would push me away cause my \"boobs\" would hurt him!!! any replies would be helpful...Im going thru a rough time, panic attacks,agoraphobia, I havent left my house in over a week. Im tired of fighting already....HELP? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/770321",
      "Title": "tired of fighting didigro sanbar8771"
    }
  ]
}