{
  "AuthorID": "DiZZyMom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
  "Posts": [
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Feb 22, 2013 08:16AM DiZZyMom wrote: Thanks, Victoria. I have my second round today and will ask for the referral when I'm there. Have a good day everybody!",
      "MessageIndex": 18858,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Feb 22, 2013 08:33PM DiZZyMom wrote: Thanks Lago. that's about how mine look now. I have an appointment with a therapist on Monday.",
      "MessageIndex": 18860,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 23, 2013 07:08PM DiZZyMom wrote: Hey ladies, I have a couple questions about hair color. I never colored my hair before BC. Well one time, but I hated it. I am 9 weeks PFC and have close to a half ince of dark looking hair. I can't really tell what color it is. For those of you that colored your hair very soon after it came in, is there benefit other than aesthetics to doing that? I also read some of you coloring it very frequently after that. Again, just to keep up with roots? Or is there another reason to color that often? I try to stay as chemical free as possible and avoid the harsh chemicals in hair dye. But if this hair comes in grey, I will definitely be open to coloring it. I can't afford professional hair color every three weeks. So from somebody new to hair re-growth and very ignorant on hair color in general, thanks for sharing your experience and wisdom!",
      "MessageIndex": 19388,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 23, 2013 10:06PM DiZZyMom wrote: Thanks Lago. I said earlier in this experience that I didn't care what color my hair came back so long as it came back. But I'm just not ready to go grey! I've had enough of looking like an old man.",
      "MessageIndex": 19390,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Feb 21, 2013 06:38PM DiZZyMom wrote: Friar Tuck  is exactly what my husband said when we were looking at the catalogs. He said \"you just better hope your hat doesn't come off!\" I thought there's no way I'd get one of those, but now I'm thinking I might.",
      "MessageIndex": 18847,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Feb 21, 2013 07:44PM DiZZyMom wrote: When did you seek treatment for the lymphedema? My left wrist/hand are slightly swollen. Sometimes more than slightly, but mostly just a little. It was barely perceptible when my MO looked at it and she said sometimes it just resolves and sometimes it gets worse. If mine gets worse, she'll refer me to a therapist. But now, it's like I'm in limbo. I'm afraid to do too much with that arm. I'm not doing any resistance exercising or my pilates class that I loved to do before surgery. I think I'm just going to ask for the referral and see the therapist just so I really know my limitations instead of just winging it. And I know this is the hair thread, sorry!",
      "MessageIndex": 18854,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jun 20, 2013 05:13PM DiZZyMom wrote: Hey ladies, you all look great. Thanks so much for sharing your pictures and experiences. I have a question about swim caps for those of you who have used them. I am 5 weeks PFC and have no hair re-growth to speak of. I live in Texas and have small kids so avoiding the pool this summer just because I have one boob and no hair is not an option. My question is there any difference between regular swim caps and those marketed as chemo caps or hair loss caps....other than the price? I think in most cases, I'll just wear a baseball type cap. It's not like I'm swimming laps or anything, just keeping my kids from drowning. But I do want to get a cap for the water park at least. Thanks so much for any advice you all have.",
      "MessageIndex": 19342,
      "PostDate": "20/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Feb 21, 2013 05:23PM DiZZyMom wrote: I love that halo LeeA. When I saw your picture change on the other thread, I thought you still had that much hair, it looks really cute. It's so awesome to be able to come on here and learn from everybody's experience. I made it to 4p today with my wig on. It wasn't as itchy as I was afraid it would be. I think because I didn't shave my hair down completely, the mashing down of my little 1/4 inch hair against the growth pattern was really quite painful and annoying. I gave myself 5 extra minutes before my shower yesterday to shave my head and didn't realize it would take so much longer than than. My friend is coming into town tonight to got to chemo with me tomorrow and is going to finish shaving it properly. Do you all still use regular shampoo/conditioner once the hair is as gone as it's going to be? I haven't been buying shampoo and have been using up all my travel size bottles thinking I won't need any for some time, but now I'm wondering if I should still use shampoo?",
      "MessageIndex": 18842,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Feb 21, 2013 06:58PM DiZZyMom wrote: Yeah, when he saw me post shave, he said \"Sinead O'conner in da house\". ",
      "MessageIndex": 18850,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jan 8, 2016 06:03PM DiZZyMom wrote: Hello ladies- Happy New Year!I have not been on this site in years. Which means life has not been revolving around cancer for some time now :-) However, it seems my eyebrows are never coming back and I am horrible at drawing them on. Can anybody give personal recommendation or advise against the permanent makeup procedures of tattooing and embroidery? Thanks so much!!!",
      "MessageIndex": 22954,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jun 14, 2013 03:03AM DiZZyMom wrote: Hey ladies, I finish my first week of rads tomorrow. I've been loading on the aloe immediately after treatment and then putting Aquaphor on 3 X a day and before bedtime. For those of your further into the treatment than me, do you continue this type of regimen (or whatever yours is) on the weekends? I know it's very early in my treatment, but I do not have any change in my skin and I want to do everything possible to prevent burning. Thanks so much girls!",
      "MessageIndex": 405,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jun 14, 2013 01:28PM DiZZyMom wrote: Thanks a lot IamNancy. My RO says only aloe and aquaphor, I don't know why. I've heard so many good results with the emu oil and if I have any problems, I'm talking to him about using it. Awesome to have only seven left, you are nearly done! Have a good weekend!",
      "MessageIndex": 411,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jun 19, 2013 02:30AM DiZZyMom wrote: cmbernardi, I've been using Tom's of Maine forever because I believed the aluminum in regular deoderant was tied to BC....go figure. It isn't an anti-perspirant and since we live in North Texas, it's not going to stop you sweating, but it does keep you from stinking  Hopefully your RO allows it. Congrats on being 2/3 of the way through!",
      "MessageIndex": 486,
      "PostDate": "19/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 4, 2013 11:57AM DiZZyMom wrote: Congrats, IamNancy! Love the Mardi Gras phrase, GWTF I am 18 of 30 treatments through. My skin looks like I've spent too much time in the sun. And in the last couple days, I've developed itchy rashy bumps over part of the treated area. I am mixing hydrocotisone with the aquaphor and hoping things don't get significantly worse as I head into the home stretch of this chapter. Good luck to everybody starting and Happy 4th to all",
      "MessageIndex": 771,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 11, 2013 10:33PM DiZZyMom wrote: I'm not through yet McKatherine, but I didn't have any rads induced fatigue that I noticed. I hope the same for you! Did you get your drains out?",
      "MessageIndex": 886,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 21, 2013 10:30AM DiZZyMom wrote: That's great you three are all local and hooked up on here. Thanks everybody. My poor skin is really falling apart. Yesterday I only used aloe all day and then the SSD cream twice as prescribed. The aquaphor under a tank top causes the tank top to become pasted to me and I'm pulling it away all day which I believe is irritating things even more. But I do want the moisturization. If I didn't have kids, walking around topless would be ideal but not an option. I also have now developed an itchy rash on my upper back and shoulder of the treated side. Has anybody else experienced this? Two more, two more, two more....and then PLEASE some healing I hope you all are getting relief with your skin, throat and other SEs that none of us deserve!",
      "MessageIndex": 1071,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 24, 2013 04:50PM DiZZyMom wrote:    Thanks all for the well wishes",
      "MessageIndex": 1124,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Aug 7, 2013 08:42AM DiZZyMom wrote: Good luck, Mum. I'm not so good with the advice as I tend to overdo it myself! Eat well, get rest when you need it. And I actually find that getting some sort of exercise increases my energy level. Unless you really don't feel up to it, then rest on those days. As far as immune boosting supplements, there are all kinds of claims and recommendations. Check with your Dr. before using any of those. I wish the best for you!",
      "MessageIndex": 1249,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Sep 3, 2013 10:11AM DiZZyMom wrote: Welcome ndgrrl and sorry you have to be here. It's my understanding they can only do the internal rads with lumpectomies so I was not eligible. I've heard about it and was very interested until I found out it was not appropriate for me. I don't know if anybody on this thread so far has had it. If not, you might search for other forums more specific if you have not already. Best of luck to you, I hope the SEs are not so bad.",
      "MessageIndex": 1451,
      "PostDate": "03/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "May 1, 2013 09:24AM DiZZyMom wrote: Funny, I've been using Tom's of Maine for as long as I can remember. I had heard the aluminum in normal deoderant caused breast cancer! Irony.....",
      "MessageIndex": 52,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "May 1, 2013 05:48PM DiZZyMom wrote: Good luck Heart. It can be very frustrating not to have a real team approach to the whole thing. I wish all of the doctors would check their egos and just work together with a common goal.....getting the patient better!",
      "MessageIndex": 56,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "May 17, 2013 06:02PM DiZZyMom wrote: Tinkerbellz I had my expander placed at same time as my mastectomy and all fills finished before chemo. PS will not see me again until after rads. Nancy: I've heard from other ladies to wear a cotton tank top under the bra so you can use the aquafor as mush as you want. I was a bit surprised that the paperwork from my new RO says to not use anything except aquafor or aloe. If some of the products that have been recommended have helped these ladies save their skin, I'd sure like to try them. Here in the infusion room getting my LAST round! Have been coughing my head off. I think my immune system is trying to say enough!",
      "MessageIndex": 98,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jun 4, 2013 01:53AM DiZZyMom wrote: Congrats on quitting smoking, TMM60. That's an awesome thing you did for yourself and I know it wasn't easy!",
      "MessageIndex": 247,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jun 18, 2013 06:41PM DiZZyMom wrote: Schoolmom, thanks for the info on Aloe Force. I asked my RO about it and he said it's a good product and has no problem with using it. I was about to order some and read the ingredients. I was surprised to see both silver and parabens in there. Did your doctor have any feedback on those ingredients? I see Whole Foods sells it so I may just go there and see if there is anything similar without heavy metals or parabens.",
      "MessageIndex": 478,
      "PostDate": "18/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 9, 2013 03:12AM DiZZyMom wrote: Yay for you, Annie. Best wishes to you as you heal and MOVE ON!",
      "MessageIndex": 834,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 11, 2013 02:50PM DiZZyMom wrote: Well girls, I have 4 regular and then 5 boosts left. I am feeling remarkably good. Prior to BC, I was running 15-20 miles/week and doing pilates 3 x/week. During chemo, I worked out when I could on \"good\" days and actually did a 5k in April. But for the past 6 weeks or so, I've done very little intentional exercising mostly due to the fact that I moved June 10 and between packing, cleaning, unpacking, cleaning there wasn't a lot of spare energy there. The last time I attempted to run, I couldn't go for more than a minute or two without taking a walk break. Well yesterday I ran a (slow) 1.5 miles on the treadmill and walked another mile. I know I am long way from my former fitness level, but for the first time since starting treatment I do feel like I am heading back in that direction instead of getting further and further from it. For those of you still suffering with fatigue and low energy I really hope you get over that hump soon. It's truly like a fog lifted. The muscle ache in my quads is also much better. There is light at the end of this tunnel! Hugs and warm wishes to all of you",
      "MessageIndex": 881,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 12, 2013 04:52PM DiZZyMom wrote: Yay Corky. Great way to start the weekend. Enjoy!",
      "MessageIndex": 918,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 17, 2013 04:09PM DiZZyMom wrote: Congrats MFML & Lenn13ka! First boost today. I really hope the rest of this mess starts to heal soon. Unlike those of you whose docs are saying your reactions are \"not unusual\", my RO says the way my skin is burning is very unusual. He said irritation usually occurs in the crease and there is no damage there, but I am getting huge blisters from mid-way on my breast down. He even said maybe I'm reacting to something outside of the rads. Hmmmm, I don't recall doing any topless flamethrowing, so I'm thinking it's the rads! Best wishes to those of you just starting, just finishing and in the middle!!",
      "MessageIndex": 990,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Aug 8, 2013 12:08AM DiZZyMom wrote: Yay Sciencegal!",
      "MessageIndex": 1264,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Aug 13, 2013 05:45PM DiZZyMom wrote: Congrats Paula!",
      "MessageIndex": 1304,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Mar 5, 2013 03:59PM DiZZyMom wrote: So, how do I wash dishes in this thing?",
      "MessageIndex": 475,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Mar 5, 2013 09:20PM DiZZyMom wrote: Rubber glove, duh! I don't know why I didn't think of that! Thank you ladies. The sleeve is such a pain to get into and out of, I don't think I want to mess with that too much. Do you all machine wash/dry yours daily like recommended?",
      "MessageIndex": 479,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Mar 6, 2013 05:42PM DiZZyMom wrote: I feel so ignorant. What \"fittings\" are you all talking about? My therapist sent me to a medical \"boutique\". The woman there measured my arm and sold me a sleeve off the rack. For the glove, she had me try on two different sizes (small and medium) and asked me which felt better. From reading your posts, it seems there's much more to it?",
      "MessageIndex": 486,
      "PostDate": "06/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Mar 14, 2013 06:47PM DiZZyMom wrote: Thank you, I put aquafer (sp) on this morning before I put it on and it doesn't feel like it's pinching like it has the last couple days. I'll put it on again when I take it off. I swear this lymphedema thing really pisses me off. Just feel like I've been a good sport about the surgery, chemo, etc. without any self pity. But for some reason, this just feels like insult to injury and I want to call \"Uncle\" already!",
      "MessageIndex": 523,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jun 3, 2013 10:57PM DiZZyMom wrote: Hey cmbernardi, I'll be starting rads next Tueday in Plano. I had my mapping/planning last Friday but my RO is on vacation this week so I don't start until next week. I am also nervous about lungs, heart, sternum in the crosshairs. Blasting a cancer patient with cancer causing radiation is yet another one of the things that goes against the way I've always viewed health and healing.....chemicals, pharmaceuticals, radiation. Will be happy when I no longer have to allow those things into my body! I hope those of you starting this week have minimal SEs and are feeling well!",
      "MessageIndex": 244,
      "PostDate": "03/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 23, 2013 05:09PM DiZZyMom wrote: Had the last one today! Took the kids to the mall and treated myself to an Irish Cream truffle from Godiva  My RO said I can absolutely go in the water on my vacation so that is good. I just hope it doesn't irritate my skin more and that it starts to heal soon. It seriously looks like I should be in the burn ward. Screaming red, raw, scorched looking with fluid filled blisters or \"deflated\" blisters that are oozing. Not looking forward to having blood and other fluids seep all over my clothes and hotel room sheets during the trip, but really it's more of a pain in the ass than actual pain. I do believe I have a high threshold for pain and combined with the nerve damage/loss from my surgeries, I really don't have a lot of pain. Which is a good thing because I do not tolerate pain medication at all. patricia as long as your doctors are OK with that regimen and it is working for you, it's probably fine. I had a bumpy, itchy rash about two weeks in too and I used hydrocortisone with aquaphor for relief. Don't use the hydrocortisone alone because it is drying to the skin. But make sure your RO is OK with anything you use. Best wishes to all of you sweet ladies!",
      "MessageIndex": 1102,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Aug 30, 2013 06:31PM DiZZyMom wrote: LiLi-Ri it is not too early to start skin maintenance. I put aloe on before getting dressed after every treatment and then aquaphor at least 3x daily starting with my first treatment. I don't think you want to wait until you have damage to do something. If you can prevent it from occurring, that would be ideal. Have a good weekend! ",
      "MessageIndex": 1438,
      "PostDate": "30/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 16, 2013 10:26AM DiZZyMom wrote: Good morning, ladies. I have one more regular treatment and then five boosts. I was hoping to get through with little skin issues, but over the weekend things went crazy. I have bad burns under my arm and a huge blister on my lower breast that just \"deflated\" overnight. My RO gave me script for Silver sulphur cream for the burns. He also is discontinuing the use of the bolus--which there was only one more treatment that way anyhow. Cozzoli, the bolus is a rubbery pad thing they put on (in my case every other treatment) that is supposed to bring the treatment closer to the skin. I am just hoping it doesn't get any worse. Thankfully there is no pain. The burns under my arm look like they should hurt like crazy. But that area has been numb since my surgery. So nerve damage, at least I've got that going for me  But I am notice a rough feeling to all of the treated skin. Those of you who are finished, once the boosts begin do things continue to worsen in the fields from the regular treatment? Also still happy that my energy level does not seem to be suffering and feel bad for those of you who are experiencing the rads induced fatigue. The YMCA here has program with Livestrong that gives me and my family a free 12 week membership and enrollment for me in a Livestrong program that includes two classes/week. I can't start until I finish rads because the class times are the same time as my treatment. But I am still getting some cardio at least three x/week and that is nice. I hope you all have a great day and minimal SEs.",
      "MessageIndex": 968,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 16, 2013 10:27AM DiZZyMom wrote: Curlysue, I had lymphedema before starting rads but it has made it worse unfortunately.",
      "MessageIndex": 969,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 18, 2013 09:15AM DiZZyMom wrote: LW0919, I know how you feel about bra-less in public and about multiple layers in the hot summer. I have one tissue expander and one DD \"floppy\". Until my surgery, I never thought I'd leave the house bra-less. I typically wear a cotton tank top under a baggy t-shirt. And I am soooo tired of wearing baggy t-shirts. But anything more fitted would be obscene. If I do want to wear something more fitted, I'll wear one of those cotton camisoles with the shelf bra built in. And I wear a regular (bigger) non-underewire bra over the tank top when I work out. You will want to wear something between yourself and your bra/clothes if you are using aloe, aquaphor or anything your RO provides during rads. I have a whole collection of grease stained tank tops now! Good luck and I hope your treatments are easy on you.",
      "MessageIndex": 1022,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Aug 29, 2013 05:52PM DiZZyMom wrote: Hey ladies. I have not been on in a while. I had my follow up with RO yesterday (last boost was July 23) and he said I \"look like a million bucks\". I have what looks like a scar where I had a huge blister and still pretty tan, but everything is healed. I'm still putting aloe on after my shower and aquaphor at night. Considering I felt like I had leprosy a couple weeks ago, I never thought it would be this normal again. For those of you getting near the end and having pretty bad skin issues, it really does heal pretty quickly after you're done. Hope you all have a great three day weekend!",
      "MessageIndex": 1433,
      "PostDate": "29/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Sep 15, 2013 05:49PM DiZZyMom wrote: Congrats Tangles! I know you're happy to be done. I had no noticeable fatigue with rads. My skin completely fell apart the last two weeks and was open, oozing blister-like mess. By two weeks out, it was much improved. I also went on vacation two days after finishing and was in a swimsuit and water  for a week so that probably did not help the healing process. Good luck and it is so nice to be done and feel like a normal life again.",
      "MessageIndex": 1517,
      "PostDate": "15/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Sep 16, 2013 01:08PM DiZZyMom wrote: Sorry you're feeling run down Jenn. I hope it improves as you get further away from rads. I love your avatar BTW",
      "MessageIndex": 1524,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Apr 26, 2013 08:23AM DiZZyMom wrote: Welcome DanaM, sorry you have to be here. But you will find great info and sweet ladies on these boards. Hope your surgery recovery is going well. You're going straight to rads with no chemo? Lucky you ",
      "MessageIndex": 40,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "May 18, 2013 04:15AM DiZZyMom wrote: OK, no I have not started rads yet. I had my last round of chemo today. I start rads in 3 weeks. So I have no experience with the tank top thing. I have just heard from some of the ladies in another thread that they did that while they were getting rads to keep cotton only against their skin (you could wear a cotton bra) and so using the aquafor didn't get all over their clothes. I don't know how many CCs I had. I know they were 50 each, I just can't remember how many. I think 6, but maybe only 5. I only had a single mastectomy so only one expander and no complications. Just a whole different kind of pain after the fills, but now no pain at all. Sorry if my earlier post was misleading. Have a good night everybody!",
      "MessageIndex": 108,
      "PostDate": "18/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Mar 3, 2013 09:48PM DiZZyMom wrote: Thank you! I've always been a good water drinker, but since starting chemo, I've definitely taken it up a notch!",
      "MessageIndex": 466,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Mar 13, 2013 09:49PM DiZZyMom wrote: Hey ladies, I sure appreciate all your advice. I've been wearing my sleeve with glove during the day for about two weeks now. While I don't enjoy it, I have not had any real discomfort. The last two days after I remove it, there are indentions on my upper arm from the silicone bumps and it itches like mad. The swelling in my arm is reducing so I don't understand why it would be fitting tighter? I found that I must have been scratching it in my sleep last night and it's even more irritated. I'm so afriad of any kind of skin irritation on that arm because I've heard the slightest scratch can cause it to blow up. I think I'm going to put cortisone on it tonight before I go to bed to hopefully keep the itchiness at bay. I have really sensitive skin. Has this happened to any of you and do you have any other suggestion? Thanks!",
      "MessageIndex": 518,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Dec 22, 2013 05:33PM DiZZyMom wrote: The itchy rash is definitely from the bandages. I have super sensitive skin. I can get a rash like this from a tag in a shirt. I changed the bandages this morning and before putting on the clean set, I put on Hydrocortisone, aquaphor and then some oatmeal/shea butter lotion. The itching isn't as bad right now. I really notice it at night when I wind down and not distracted by other things. I bought some Benadryl today and if it's bad again tonight, I'll take it. I don't want to get in the habit of taking meds though. I see the therapist tomorrow and we'll see what she says.",
      "MessageIndex": 1179,
      "PostDate": "22/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Mar 4, 2013 05:53PM DiZZyMom wrote: Well, as expected. I go to get a glove tomorrow. My hand is almost back to normal since taking the sleeve off. Thanks again for your great advice.",
      "MessageIndex": 468,
      "PostDate": "04/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Mar 3, 2013 05:30PM DiZZyMom wrote: Hello ladies. I just received a lymphedema sleeve Friday. Both the woman at the medical supply place and my LE-PT said the sleeve might make my hand swell and in that case, I'd need a glove as well. My hand is swelling considerably. I see him tomorrow, but I'm thinking I should not wear this thing anymore until then? Thanks for your help!",
      "MessageIndex": 461,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Dec 21, 2013 10:12PM DiZZyMom wrote: Thanks Binney. My therapist used a different stockinette when she changed the bandages yesterday because my arm was so red and itchy. I don't notice any difference with the kind she used. I'm going to change them myself tomorrow and only have the kind that came with the rest of it. I will slather on hydrocortisone and lotion. As you say, if I keep busy and try not to dwell on it, I'm less likely to scratch my eyes out :-) Hope you all have a great holiday season and no more swelling!!",
      "MessageIndex": 1176,
      "PostDate": "21/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Apr 22, 2013 06:19PM DiZZyMom wrote: Thanks Wildlyshel for starting this. I'm going to attempt linking to the post in the Triple Positive Group that outlines a skincare regimen many of those ladies used during rads.....with good results. Skincare   I hope this works (the link). I'm going to try to follow it as much as I can. Wearing tank tops under my bra in the Texas summer heat sounds miserable, but if it will help save my skin, I'll give it a go. Hope you are all doing well!",
      "MessageIndex": 30,
      "PostDate": "22/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "May 1, 2013 11:02AM DiZZyMom wrote: It's good for odor, not wetness. It's a deoderant, not anti-perspirant. I think the aluminum is what controls wetness. I'm ok with sweating so long as I don't stink",
      "MessageIndex": 54,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 4, 2013 04:46PM DiZZyMom wrote: I have used pure Aloe immediately following treatment and then Aquaphor at least 3 x/day and at bedtime proactively. I am over 1/2 way through and am just now getting an itchy rash like reaction, but no \"breaking down\" as others have described. I know I am far from out of the woods, so I am just hoping to get through the rest of the treatments without experiencing anything severe. I don't see how using these products proactively could cause any harm. Worst case scenario is you'd have softer skin. BUT I am not a doctor, that is just my opinion. Best of luck to you!",
      "MessageIndex": 774,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 19, 2013 10:26PM DiZZyMom wrote: Seeing light at the end of the tunnel. Only two more to go. Last boost on Tuesday and then I leave for vacation Thursday. Going to the beach and I'm afraid I'm going to have to stay out of the water since I have these lovely deflated blisters oozing non-stop. I guess I can just lay on the beach in my major cover-up, scarf and sombrero.........with my toes in the water and drink something with a little umbrella in it. While my husband wrangles the kids in the water Have a nice weekend everybody, no treatments for two days!!",
      "MessageIndex": 1047,
      "PostDate": "19/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Jul 23, 2013 11:38PM DiZZyMom wrote: What a great attitude you have SophiaAnne-Marie. You just might be riding your bike....I didn't have any major SEs until the very last week then my skin just completely fell apart. But thankfully, I don't have much pain. Everybody is different and what works for one might not help another. I hope you get through it without a lot of issues and can get on with your life.",
      "MessageIndex": 1112,
      "PostDate": "23/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Aug 5, 2013 10:26PM DiZZyMom wrote: Hey ladies. Haven't been on in a while either while on vacation. I hope everybody is hanging in there and that your skin does hold out. I don't know if wearing a swimsuit (under an SPF50 rash guard) and being in ocean and pool water was the smartest thing to do for the first week after finishing rads, but it didn't seem to do much damage. I also was covering the huge oozing open blister I have with gauze and surgical tape so my clothes would last a little longer. I think those things slowed my healing, but I am happy to say that it IS healing. The area under my arm that was all open and screaming red is almost completely healed. The huge oozing blister is finally starting to heal. And the skin over the rest of the treated area has all peeled away and is replaced with pretty healthy (a little pink) skin. So for those of you who think your skin will never heal, it will! I'm only two weeks out from my last treatment and I did a lot to prevent healing and I am healing. So.....it will get better for all of you too! Best wishes to all of you.",
      "MessageIndex": 1238,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Mar 3, 2013 05:56PM DiZZyMom wrote: Thanks so much, Binney. So frustrating. I just started working with the therapist last week and my arm went down 3 cm over three days with just massage and exercises. Now my hand looks like a balloon! Guess I'll be sporting the Michael Jackson look from now on",
      "MessageIndex": 463,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Mar 14, 2013 08:32AM DiZZyMom wrote: I don't wear it to bed, no. Just during the day. I'll try the eucerin. I don't think it's an allergy because it's only in one area not the entire band around.  Thank you.",
      "MessageIndex": 520,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "DiZZyMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166724/profile",
      "Content": "Dec 21, 2013 09:58AM DiZZyMom wrote: Hello ladies. I haven't been on these boards in a long time. I am in round 2 of LE treatment because the first therapist was not LE specialist. I am now in bandages for the first time and miserable! The itching is almost unbearable. Do any of you have any advice? I might try taking Benadryl but I don't like taking OTC meds. However, jamming a pencil under the bandages to scratch is certainly not what I should be doing! I hate to complain, but oh how I wish I would have gotten through this phase the first time. Thank you lovely ladies for whatever help you can offer!",
      "MessageIndex": 1174,
      "PostDate": "21/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    }
  ]
}