{
  "AuthorID": "dizzybuff38…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38567/profile",
  "Posts": [
    {
      "AuthorID": "dizzybuff38…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38567/profile",
      "Content": "Jun 15, 2008 10:38AM dizzybuff38 wrote: Susan and Member of the Club - many thanks for your advice. I guess my mind is working overtime as it was difficult to take in all that the gastro said last Wednesday - it was a 40 min consultation and he does rather blind me with science at times. Told me I have \"empirical problems\" - hadn't a clue what he meant and was ashamed to show my ignorance. Hubby (a scientist) afterwards said it just means he doesn't know what to do and is flying by the seat of his pants. At least the gastro has a sense of humour - we were looking at the print out of my latest blood tests for methotrexate side effects, and he mentioned the C-reactive protein level - I said it is 10, what does that mean? He answered: \"one less than 11, one more than 9!\" We all cracked up laughing and it did diffuse a rather tense situation. The only time I have had these particular symptoms, particularly nausea, loss of appetite and significant weight loss was when I had FEC chemo in 2003.Then, I was totally faecally incontinent and had to wear pads.  This time, if I eat so much as a piece of toast, my abdomen swells and it is difficult to pass faeces - when I do they are pale, greasy and float. Sorry to be so gross.  The Crohn's flared as the Oncologist said he would only treat me if I stopped the methotrexate, and of course, I had a bad flare. Got a new Onc and she prescribed daily dexamethasone for the 4 months of chemo, and had the hospital send me a huge box of Fortijuice, sipped 3 cartons a day, each of 300 cals and was the only thing that kept me alive, besides gallons of non-alcoholic ginger ale.  I had no solid food for the whole of chemo but bounced back after recommencing methotrexate. I guess that is why I am concerned now as these symptoms just appeared out of the blue and if the mtx was causing them, it would have happenedlong ago as  I have been on it for 7 yrs. The gastro has prescribed domperidone and omeprazole but still nauseous and no appetite. The CT scan order stated: \"Complex Crohn's and bc - pelvis,abdomen,liver and pancreas.\" Gastro didn't mention liver and pancreas at the consultation, which is why I guess I panicked. He did say every time he has scoped me, the small intestine and colon are full of inflamed ulcers and crypt abscesses, but he has never, in the 5 yrs I have been under his care, ordered a CT scan. This doesn't feel like a Crohn's flare, my temp is not raised and I have no rectal bleeding. I have had many flares in the past 38 yrs, requiring in-patient treatment of IV steroids and transfusions. I have never had pancreatitis so don't know the symptoms, but guess it probably is that or the strictures. Thank you for letting me vent - it seems so much better now that I have been able to write down my symptoms and get focused. My 79 yr old husband is not well and I hate to bother him. He has suspected CIDP (Chronic Inflammatory Demyelinating Polyneuropathy), not been able to walk more than 50 yds for the past 6 yrs, feet and lower legs numb with no sensation. He has seen many specialists, cardiologist (got a blocked artery but doc said this is not causing the problem as smaller arteries have taken over), vascular surgeon (reduced circulation in his legs, had a stent put in right leg), neurosurgeon for highly suspected spinal canal stenosis, MRI's showed some scs, but not enough to cause the problem,then to current Neurologist who ordered nerve conduction tests.  Got a partial diagnosis of \"sensory/motor, predominantly sensory axonal peripheral neuropathy\" but this doc said this is not the whole picture. I have now located a world renowned Professor of Neurology, whose speciality is multiple sclerosis, which CIDP is allied with, although very rare. He is at the new University medical school in nearest city and we are hoping to get a private appt with him next week for further testing. It has been a nightmare, as we are restricted to only going to stores,restaurants,etc. where we can park within 50 yds. Hopefully the next few weeks will see both of us with definitive diagnoses, have appropriate treatment and get our normal lives back together. If it is okay, I'll post when I have the scan and scope results. Thanks again to all who responded - much appreciated. Liz in Cornwall,England.",
      "MessageIndex": 7,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707284",
      "Title": "Liver/pancreas mets? dizzybuff38 dizzybuff38"
    },
    {
      "AuthorID": "dizzybuff38",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38567/profile",
      "Content": "dizzybuff38 wrote: Hi all, apologies for the length of this , but I really do need some help. Short history; dx ibc, 2 cm stage and grade 2, with associated DCIS Jan 2003. The number 2  is definitely not my luck number! WLE and total axillary removal, 6 x FEC chem and 25 rads. Had 5 yrly review Feb 2008 with bc surgeon..blissfully NED (Onc, now retired, discharged me after rads 4 yrs ago and never seen another one since, but do see my bc surgeon annually)and waiting to see a new one as I have stopped Arimidex for severe bone problems..   Suddenly 4 weeks ago I developed severe nausea, total loss of appetite, bloating, dyspepsia and steatorrhea, weight loss of some 14 lbs...can barely manage a fruit yoghurt and a banana each day. Big change in bowel movements from 4-6 diarrhea to almost constipation. As I have had Crohn's for some 38 yrs thought this may be the recently diagnosed strictures in my small intestines, but asymptomatic then on MRI.....big problem now and last Tuesday rang my specialist IBD nurse - she talked to my gastro within the hour and got me an urgent appt in his clinic next day. Wednesday, 45 mins appt (socialised medicine in the Uk, so grateful for the attention as you normally get a 10 minute slot.) He has ordered a CT scan of my abdomen \"due to complex Crohn's\", dx weight loss, dyspepsia, bloating , steatorrheia. I was aghast this morning when the CT scan admin gal rang to say they want to look at my liver and pancreas. I have monthly blood tests as I self inject methotrexate for Crohn's and my liver blood panels are in range, but my MCV and MCH bone marrow levels are high. Could anyone advise me what are the symptoms of liver/pancreas mets? Appreciate any input as to symptoms of liver/pancreatic mets with bc..althouth I have never heard of the latter with bc, but had a lovely friend in San Francisco that had Crohn's and died last year at 37 yrs, with pancreatic cancer. So tired tonight. struggling with concurrent disease. Any input/advice/experience gratefully received. Liz in Cornwall, England. He has ordered a Catscasn of my pelvis, abdomen, liver and pancreas, and an endoscopy of my GI upper tract under sedation in the next few weeks. I am concerned about bc mets, rather than my Crohn's problems, as I know my current problems are not due to inflammatory problems - have weekly methotrexate for Crohn's, stopped Arimidex 6 weeks ago due to severe bone problems in hips, feet and hands,and waiting for a referral to a new Oncologist for alternative AI's. Apologoies for this mess of an email...so desperately tired and worried. Any advice welcomed. Liz, Cornwall, England/ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707284",
      "Title": "Liver/pancreas mets? dizzybuff38 dizzybuff38"
    },
    {
      "AuthorID": "dizzybuff38…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38567/profile",
      "Content": "Jun 15, 2008 02:41AM dizzybuff38 wrote: So appreciative of your responses - apologies for the delay in getting back, had to do a changeover at our rented holiday apt today and then had two lovely teenagers here at parent's second home all evening. Slonedeb....methotrexate, a complicate cytotoxic drug that is an immuno-suppressant. It is still not licensed in England for Crohn's, but available off licence by a consultant gastro. As far as I understand it, the most serious side effects can be toxicity to the liver, and bone marrow.  Unbelievably, even though I drink white wine, and should definitely not, my monthly liver function tests are within normal range. My own problem is with elevated MCV and MCH, which are to do with the red cells emanating from the bone marrow. My red cells are grossly enlarged, but since taking daily folic acid, they have reduced somewhat, although not normal. My gastro is not concerned. I was on weekly 25 mg tablets for some 5 years but my Crohn's problems did not subside so 2 yrs ago my gastro prescribed weekly 12.5 mg of injections, as this way we know exactly what I am getting, without the problem of metabolising it with ulcerated/abscessed intestines.  Doing fine really, so know these latest problems are not a flare of Crohn's. Think it is the strictures in my small intestine, but of course, mets for bc cannot at the moment be ruled out. Michelle - deeply appreciated your lovely, heartfelt post. Taken it all on board and have calmed down tonight.  Thanks for being there for me. So pleased your Mum is doing okay at present. I am having my CT scan 26 June and endoscopy 9 July...will post back when I get some results. Thank you all for caring and sharing..... Liz.",
      "MessageIndex": 5,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707284",
      "Title": "Liver/pancreas mets? dizzybuff38 dizzybuff38"
    }
  ]
}