{
  "AuthorID": "Dizziee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45316/profile",
  "Posts": [
    {
      "AuthorID": "Dizziee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45316/profile",
      "Content": "Dizziee wrote: I'm 21yrs old and a newlywed and I recently noticed differences in my breasts. Several women in my family were diagnosed when they were 22-25yrs old. About 3mos ago a strange and painful bump was on my right breast and my husband said it looked like an ingrown hair which I thought was weird, but I put on a bandaid and didn't think too much into it. It is 5am and I haven't slept because around midnight I felt the differences in my breasts and I'm not sure what a lump feels like, but my right breast feels very hard in three places, and my left breast does not feel like this at all. I don't know what to do. I don't have health insurence anymore. I don't want to scare my husband or family and I'm only 21- not one of my friends or classmates knows what I'm talking about because we're just too young! I just feel like everything is being taken from me at such a young age and I'm fearful as to what will happen to my life. I have no one to talk to (my family members who were diagnosed I'm not too close to or they don't live in CA) and I don't know what to do. I came here hoping for some help, info, and just helpful words. Thank you. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/528496",
      "Title": "Scared Dizziee Dizziee"
    },
    {
      "AuthorID": "Dizziee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45316/profile",
      "Content": "Feb 9, 2007 09:49AM Dizziee wrote: Thank you very much ladies for the replies. It feels great to hear support and advice from people who understand. The other reason I haven't told my husband was we're going through a lot of changes right now- new jobs, moving out of our first home, school, financial issues, family. He has so much on his shoulders I don't want to add stress to him; he works a fulltime job that treats him horribly so I could quit my job. I know part of me is scared to go to the doctor but also I no longer have health insurence since i quit my job, and I cannot be added to my husbands until April, so I'm not sure what I do or where I go because I'm sure anything the doctor will do will cost what we cannot afford. I do want to thank you ladies for your loving words and honestly this is the first time in my life I've heard its ok to be scared. Thank you.",
      "MessageIndex": 3,
      "PostDate": "09/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/528496",
      "Title": "Scared Dizziee Dizziee"
    },
    {
      "AuthorID": "Dizziee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/45316/profile",
      "Content": "Feb 9, 2007 08:49PM Dizziee wrote:",
      "MessageIndex": 8,
      "PostDate": "09/02/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/528496",
      "Title": "Scared Dizziee Dizziee"
    }
  ]
}