{
  "AuthorID": "djones37",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
  "Posts": [
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 10, 2012 05:35PM djones37 wrote: thank you Sparkybrat...wish people would give advise who have been there...i forgot i had another mammogram 5 months after the 2006 one it stated biopsy if needed per area i was never told that...",
      "MessageIndex": 2,
      "PostDate": "10/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787271",
      "Title": "report BI-RADS 2..please advise second opinion?. djones37 djones37"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 11, 2012 03:20PM djones37 wrote: Thank you sommer43 for your advise as well what you have been thru I wish you the best with your next appt in september and pray for the best for all the women on the site. Im use to reading brain tumors reports about my son....they werent as hard for me as the breast ones...guess i got well educated the past three years with his issues trying to get educated with these issues now....wish you the best and thank you for the advise",
      "MessageIndex": 4,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787271",
      "Title": "report BI-RADS 2..please advise second opinion?. djones37 djones37"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "djones37 wrote: Findings: Scattered fibroglandular tissue in both breasts with an interval decrease in density of both . breasts. interval oval mass with poorly defined margins in the superior aspect of the right breast. Interval small rounded mass with smooth margins in the anterior left breast. no abnormalities at the locations of the masses felt by patient, marked with metallic markers. on physical exam no masses are palpable in either breast. A tiny amount of dark gray discharge was elicated from 3 orifices on the left nipple. the multi orifice discharge is compatible with benign process. Ultrasound performed, showing 11x7x3 mm bilobed cyst in the 12 o'clock position of the right breast, 12 cm from the nipple. This corresponds to the mammographic mass. In the 11:30 o'clock position of the left breast, 3cm from the nipple, an 8x6x2mm cluster of microcysts is demonstrated, corresponding to the mammographic mass. Normal appearing breast is demonstrated at the locations of the 3 masses felt by patient in the left breast. Also noted is a elongated cyst in the 1 o'clock position of the left breast 9cm from the nipple, measuring 1.3cm i max diameter. Two smaall cyst are demonstrated in the 12 o'clock position of the left breast, 2 cm from the nipple. Multiple dilated subareolar ducts are demonstrated on the left wih no intraductall mass visualized. Impression: Bilateral breast cyst. No evidense of malignancy. Annual mammography is recommended at 40. Ive consulted my nurses at my PD regarding my concern with the shooting pain from the 1.3cm cyst to my nipple as well as the constant burning and stinging in this breast as well as the breast swelling Ive also been having rashes that come and go on the left breast...i know my breast and u can see a huge difference from the left and the right breast as well my left nipple seems to stay flat which is something it has never done before as well firmer. any advice would be helpful.....as well i use to be a D cup in the last two years im at a E cup..  Diane Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787271",
      "Title": "report BI-RADS 2..please advise second opinion?. djones37 djones37"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 11, 2012 03:24PM djones37 wrote: Thank you sommer43 for your advise as well what you have been thru I wish you the best with your next appt in september and pray for the best for all the women on the site. Im use to reading brain tumors reports about my son....they werent as hard for me as the breast ones...guess i got well educated the past three years with his issues trying to get educated with these issues now....wish you the best and thank you for the advise",
      "MessageIndex": 5,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787271",
      "Title": "report BI-RADS 2..please advise second opinion?. djones37 djones37"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 11, 2012 04:18PM djones37 wrote: Oh i know I shouldnt research to much did that with my son had me tore up but as well i was educated when some neroolgist and nerosurgeons kept saying that b9 isnt causing his issues but they were with them I had to keep on them he still has symptoms but not as much i kept pushing them for answers and they came to find out he had spinal tears along his spine which was causing his spinal fluid to leak into his body and by that time he had no CSF fuild in his brain hes had alot of spinal taps and blood patches the past two years...they will keep an eye on his spine as well as the large b9 mass in his brain....but yeah ill research and not worry so much but just educate myself with the breast...",
      "MessageIndex": 7,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787271",
      "Title": "report BI-RADS 2..please advise second opinion?. djones37 djones37"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 5, 2012 02:16PM djones37 wrote: Go to page 4 on this forurm its says breast cancer symptoms by diane essa",
      "MessageIndex": 6,
      "PostDate": "05/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786945",
      "Title": "I have tons of questions! Cherelle85 djones37"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "djones37 wrote: Cant reply back to some of my new friends that have found me and sent me PM Im at my limit for the day I guess..but i will reply back as soon as the system allows me to...(: Hope all are having a great weekend are at least the best we all can have...Im not hurting as bad today with my ovaries problems so Im gonna take advantage of it and go plant some flowers...thinking of you all...(: Diane Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787358",
      "Title": "At my Limit for PM today): djones37 djones37"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 5, 2012 01:56PM djones37 wrote: For me Ive been told what I thought was a cyst for months now that its a mass...I go for a bilateral diagnostic mammogram & ultrasound next wednesday...my symptoms have been complete exhaustion for months now, breast soreness and sharp pains from the area of the mass which is in my lympth nodes to the nipple as well as burning & stinging,swelling & nipple discharge. Like you Im scared but trying to cope & wait till I know forsure, doesnt help when the drs ive seen seem really concerned. Theres a forum on here trying to remember which one but diane essa started a forurm regarding people that have had symptoms to list them before as well as after they were dianosed. It may scare you more it did me cause i have some of the odd symptoms they have had...but regardless i know its hard believe me i stayed in the bed the first three days this week flipped out but I am coming to terms that i need to focus on doing things to get my mind off this till its confirmed. Ill keep you in my prayers and try not to worry which is hard to do, get to your gyn asap have it checked and go from there. I wish you the best keep us posted",
      "MessageIndex": 5,
      "PostDate": "05/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786945",
      "Title": "I have tons of questions! Cherelle85 djones37"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 7, 2012 11:29PM djones37 wrote: If its been this long and you havent heard from the doctor you can go to the place where you had the mammogram and request a copy of the report as well a copy of the cd...i wish you the best of luck  know where your coming from.... I go wednesday for my diganostic mammogram and ultrasound the waiting is unbearable...& happy sweet 16 to your daughter my son just turned 16 a few months back..",
      "MessageIndex": 208,
      "PostDate": "07/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786391",
      "Title": "so worried I have breast cancer leelee101 leelee101"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 11, 2012 06:35PM djones37 wrote: Thank you all for the info im not use to these kind of forums the one i was o for my son was different...and im sorry if i offended anyone really wasnt trying to just asking about the topics and now i know thank you all so much..and wish you all the best with your treatments.",
      "MessageIndex": 14,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787324",
      "Title": "Alot of us in this topic forum dont get answers back? djones37 dogeyed"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 11, 2012 05:53PM djones37 wrote:  wasnt trying to offended anyone like I stated on the topic..like I said my hormones have been out of whack for weeks now and servere mood swings dealing with my breast issuses a radiologist that tells me to deal with it..as well as having ovarian cyst busting as soon as i get over one then get another one...so i wasnt trying to offended anyone and if i did then im sorry...and wish you all the best in your treatments and recovery...",
      "MessageIndex": 10,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787324",
      "Title": "Alot of us in this topic forum dont get answers back? djones37 dogeyed"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 11, 2012 07:04PM djones37 wrote: Thank you two hobbies i think ill delete this thread wasnt trying to offend anyone but i have so if i delete it i will not offend any else....truly didnt mean too just stay in alot of pain and guess i worded the whole thing the wrong way i do that sometimes and thank you again for the info",
      "MessageIndex": 16,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787324",
      "Title": "Alot of us in this topic forum dont get answers back? djones37 dogeyed"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 11, 2012 08:22PM djones37 wrote: Largo that is great news Im glad you have made it thru this and beat it....I know since my cusion past from IBC treatment and survior rates have increased so much...she in her early 40's when she found out and thats been maybe 15 years ago..my memory isnt so good these past few years guess the stress of my sons condition...Athena Im sorry if I offended you or anyone else and i do agree with the 80% and 20% doesnt matter just like the statement they tell us breast masses dont hurt but per reading so many other stories it does and really just depends on the person none of us are alike, our bodies are different. I wasnt trying to whine and I know theres many cancer patients on here that are going thru so much like I said b4 i just worded the whole thing wrong and thats my mistake between the mood swings and my memory and focusing on saying the right thing doesnt always happen....I wasnt out for pity i have enough health problems ive never been a pity or needing person Ive raised two kids single for the past 15 years and helping raise my grandson ive always been independent always will...Ive sat beside many of my family members on there death bed for other medical problems I understand what your familys go thru, yet i have no idea what all you have to go thru because Im not there yet and may never be there...but I do pray that you get thru your cancer and beat this disease...I can say I did make it thru cervical cancer at age 19..but it was caught early much thanks to having kids earlier is why they found it so fast and was able to get it in time...and i know cervical and breast cancer are two different types of diseases..I do wish everyone the best like ive said numerous times since i posted this as well as i never meant to offend anyone..",
      "MessageIndex": 22,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787324",
      "Title": "Alot of us in this topic forum dont get answers back? djones37 dogeyed"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "djones37 wrote: This Post was deleted by djones37. Diane Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787324",
      "Title": "Alot of us in this topic forum dont get answers back? djones37 dogeyed"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 9, 2012 12:14AM djones37 wrote: Yes just turned 37 right before everything came crashing down...but with the complete pain of the cyst rupture i can say it kept my mind off of the whole issue with my breast..Ive done my best to keep positive because my kids were staying upset as well worrying isnt gonna change anything that was my new outlook on life this year...today I worked my butt off cleaning the house, and cooking for my kids trying not to think about the test ended up having a bad anixety attack...but thank my dr for my valuims...Im ready to get this over with yet at the sametime scared due to my symptoms..but its in Gods hands...Im a fighter Ive had to be being a single parent with two kids and a grandson with medical problems..i will keep you posted once i find out my results...Im a pushy gal so Ill be pushy about get my results..lol...keeping you all in my prayers...",
      "MessageIndex": 8,
      "PostDate": "09/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787094",
      "Title": "A lump, and other \"lady issues\" ElleBee ElleBee"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 10, 2012 11:22AM djones37 wrote: Yes they were firm with me about that but I had no choice i have a rare uterus its two uteruses together , I didnt find this out until after i had my 1st baby, after her i got prego about 1 year later at about 5 months started hemmorgaing bad went to hospital thats when they discovered the rare uterus i had at that point i was told my fetus wasnt in my uterus it was attached to the outside of the uterus and emergency surgery was required that the baby had deceased 2 weeks prior and my chances of surving surgery was 50% but thank the good lord i came thru I did allow them to take my fetus to UNC for research..i then had my son a year later with bed rest and complications even though was told not to have anymore, 4th prego miscarried she had a heart defect after that i said ok im ready for the tubal.I love kids but at that point they said ur lucky to have the two children you have if you want to be around to raise them tubal is your only option..",
      "MessageIndex": 11,
      "PostDate": "10/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787094",
      "Title": "A lump, and other \"lady issues\" ElleBee ElleBee"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 11, 2012 05:37PM djones37 wrote: i am in the process with my PD to get refered to a breast surgeon for another opinion like us all we dont want breast cancer but just answers that we really dont get from the radiologist...or at least mine he told me deal with the pain....prayers out to you all who are fighting this battle..and i understand yaw being busy believe me..i watched my papa slowly pass with colon cancer as well as others its extremely hard for everyone...god bless you all",
      "MessageIndex": 8,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787324",
      "Title": "Alot of us in this topic forum dont get answers back? djones37 dogeyed"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 11, 2012 07:41PM djones37 wrote: thank u janice & lago for the advice...I try to read the topics some i reply to others i cant...just getting educated now about breast...i know my mom had mass removed and our cusion had IBC our family is that close so its hard to know everything when doctors ask...the only thing Ive learned thru my sons issues were get copies of everything and keep them...i didnt do that this last january with my ovarian US and have paid dearly for it because a dr read it wrong...so i get to deal with these cyst rupaturing until i can get to the GYN...i think my pain from that alone is making me awful at times..but ive spent the majority of the past 2 weeks in bed because of the rupatures...it was taking my mind off the whole breast thing think today i just had a bad moment and worded everything wrong...i seem to have problems thinking right these days...but thank u both for the input it has been helpful.  wish you all the best in ur treatments recovery and beating this disease..",
      "MessageIndex": 19,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787324",
      "Title": "Alot of us in this topic forum dont get answers back? djones37 dogeyed"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 9, 2012 12:27AM djones37 wrote: Also I had my tubes tied at 21 due to complications they told me then I would go thru menopause early.. i started having hot flashes 5 years after & the night sweats about 6 years ago Id wake up soaking wet..along with so many other symptoms of premenopause, wondering if thats put of my breast issues but guess Ill find out soon...but if thats the case I guess im nearing menopause since Im looking at symptoms for about 10 years now...dr said last wednesday i could be one of the women who have constant periods before they stop...lucky me they already keep me bedridden the first 3 days when i start then last up to 9 days then off for a week and a half and back on...i truly regret not having the hystericomty i was advised to have 9 years ago now...",
      "MessageIndex": 9,
      "PostDate": "09/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787094",
      "Title": "A lump, and other \"lady issues\" ElleBee ElleBee"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 8, 2012 12:05AM djones37 wrote: I found a lump about 6 months ago ignored it as a cyst till i started seeing changes in my left breast the size, hardness, & then suddleny drainage and extreme shooting from where the lump is to my nipple and burning & stinging that was it called my PD he confirmed mass & referred me asap to the breast cancer program..the second dr state she believes its a mass but i have high denisty in the left breast and is concerned with how the area around my nipple feels as well as the drainage...with the breast cancer program they had a two month wait for an appt they had me in there on two days...i as well have had severe irregular periods for months now..I had a cyst rupture in my left ovary in december went for a ultrasound took me a month of calling to get my results which which they stated i only had one cyst...ive been in pain for months now after being completely examined last week i was told  needed to get to a obgyn asap...so i leave there and go get a copy of my radiology report on my ovaries clearly states several cyst on each ovary as well as a large one on the right...I had another cyst rupture last week which f u have ever had them they are awful..ive been in bed for the most part for the past week..m tryig to get thru my breast mammogram and ultrasound before I do anything about the cyst...but just shows we all need to get copies of our reports..i shouldnt have to be dealing with all this at one time because people dont know how to read reports..I hope things get better for you and we both find out wth is going on with us..",
      "MessageIndex": 5,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787094",
      "Title": "A lump, and other \"lady issues\" ElleBee ElleBee"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 12, 2012 12:01PM djones37 wrote: Keep me posted about what the dermatolgist says..cant Pm you back right now Im at my limit for the day...keeping you in my prayers and try to enjoy the weekend..i will Pm ou back as soon as the system will allow me to(:",
      "MessageIndex": 4,
      "PostDate": "12/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787235",
      "Title": "Freaking out about multiple health issues while waiting tealorca11 Blessings2011"
    },
    {
      "AuthorID": "djones37",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/150573/profile",
      "Content": "May 7, 2012 10:42PM djones37 wrote: Sorry to hear that and some doctors are like that..my son has a beigen brain tumor at his cellerbellum & brain stem the 1st hospital Wake Forest pretty much rushed us out of the room said it was small..so I had our pd refer him to Duke what a saint they have been the past three years and clearly stated its the size of a lemon in a small place thats not a small tumor..i can say my pr has been great with me as well as the 2nd doctor that examined me through both agreeded that i needed a diagnostic mammogram & the second dr also ordered a ultrasound..I myself at 31 was suppose to have mammograms every year but was told no due to my age which i now know i shouldve never been told no after my radiologoist report stated 6 years ago to have them every year..My second dr was pissed that I was told that and stated women can get breast cancer at any age....I wish you the best i go for my test wednesday",
      "MessageIndex": 8,
      "PostDate": "07/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787124",
      "Title": "Doctors not taking you seriously... tealorca11 CuterWCurves"
    }
  ]
}