{
  "AuthorID": "DJS1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104191/profile",
  "Posts": [
    {
      "AuthorID": "DJS1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104191/profile",
      "Content": "DJS1 wrote: Hello, My wife was diagnosed with DCIS about two months ago.  After getting a second opinion and much research she opted for skin sparring bilateral with immediate reconstruction.  The surgery was yesterday (24 JUN 10) and all went well.  Doc removed 1 node on the right and five on the left.  Prelim show all negative.  I know the next fews weeks/months will be critical in her recovery both physical and mental and I was hoping I could get some advice on how I can make her recovery go as best as it can.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754568",
      "Title": "Husband seeking advice DJS1 Summer38"
    },
    {
      "AuthorID": "DJS1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104191/profile",
      "Content": "Jun 29, 2010 06:07AM DJS1 wrote: Thanks for everyones input.  She is home and doing very well.  Matter of fact, I have to remind her to slow down.  JP drains are slowing and we are hopeful the right will be removed tomorrow. ",
      "MessageIndex": 9,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754568",
      "Title": "Husband seeking advice DJS1 Summer38"
    },
    {
      "AuthorID": "DJS1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104191/profile",
      "Content": "Jun 25, 2010 05:02PM DJS1 wrote: Thanks for all the input!  I just got back from the hospital.  She is off the Morphine and the pain is back up but I know it will begin to slow.  I will get the book  Marc Sliver's book Breast Cancer Husband .  I went to the book store some weeks ago looking for some books for her.  I never would have thought to look for one for me.   This is really going to help me because I can be a pain.  I am military and after 20 plus years of service, I am one of those \"move out and draw fire\" kind of guys.  Another words, patience is not my best quality.  All the stuff I have been through has never scared me like this has.  She is the strongest person I have ever know but this has damn near brought her to her knees.  She desperately wanted to save her nipples but was not able and I know that will have a major impact.  Anyway, it has been a difficult few day.  I am going to try to recharge the batteries tonight so I am ready for what tomorrow will bring. Thanks for all the input.  I will be re-reading often............. ",
      "MessageIndex": 5,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754568",
      "Title": "Husband seeking advice DJS1 Summer38"
    }
  ]
}