{
  "AuthorID": "Djt",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
  "Posts": [
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 11, 2018 09:18AM Djt wrote: Thanks, Dee and Ingerp. Yes, that post I read threw me a big curve ball. I must do this, and succeed. My sister had radiation in the past, and recalls the extreme tiredness, but not burning. She told me to be very aware, and to self advocate and speak up. (She is a nurse) Another thought, I'm underwrire bra devoted, and am wondering what to get that may be better for radiation. Anyone else bra shopping? I'm on The large side, and so use to underwires, no clue what to look for! Also shopping for skin creams to help, anyone else yet?",
      "MessageIndex": 16,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 5, 2018 11:45AM Djt wrote: Kidogo, thanks for the idea of a specialist store, i believe there actually is one in a nearby city I can try. So far the underwire bras are ok, surprisingly. My m.o. Dr. Told me it's more of trying to shelf up the breast with cool compresses, than compress in on the breast. I have started to notice a bit of firmness and swelling as they have said may happen, but nothing horrible. Best to all here👍👍👍",
      "MessageIndex": 100,
      "PostDate": "05/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 6, 2018 09:40AM Djt wrote: astyanayx66, i asked for no tattoos. They have been using permanent marker covered with a small circle of waterproof plastic. It has been working fine. I had my 10th radiation therapy today. It was x ray day, they check positioning every 5 days to be sure any breast swelling or shape changes are accounted for, so they have moved the markers a bit over time. I would want to know, if tatts, how do they move to accommodate any breast shape changes? Mine do not come off in shower, but I don't scrub them either. Best to you with whatever you choose.",
      "MessageIndex": 109,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 6, 2018 06:38PM Djt wrote: Hi Dee, i really empathize with you on the choices issue. I have noticed all over every door and wall in my clinic are big signs saying SPEAK UP. then the sign goes into how the whole team is committed to the patient, quality of care, compassion oriented staff, etc. At first I was a compliant nice person ... Who has transformed into the patient they all know about. I had it OUT with my radiation oncologist. And several others. There were several issues I came across that I was very unhappy with, and it took me really SPEAKING UP to be \"heard, Are you sure you know the patients rights where you are treated? possibly speak to the social worker there, or the staff leader. Express your concerns about choices. You should have input on your treatment. Tell them you are not a number on a list but a real unhappy human patient who needs them to listen. Best hopes for you on the tattoos . They were about to do that with me, when I said emphatically NO, THERE MUST BE ANOTHER WAY. Funny there was! I know each facility had different structured procedures, and rules, but make a point to read their patient bill of rights and make your feelings known. In no uncertain terms. Chin up girl, it's moving along. I had my 10th radiation today, but they called me at 7 am, the machine was down ,they sent me to a nearby hospital for it, and my usual rad tec went there to meet me for the treatment!!! Wow, impressed!!! Machine needed a fuse, tomorrow I go in to the alternative place again. So glad I'm not skipping a day. I have to wonder if the tec would have gone to this off site if I had not had a mega meaningful chat with her . So ...today I walked my mile. Went home. Felt e xtra wiped out. Just sat for hours, felt odd. Had to pee several times in a row, sudden and acute agonizing pelvic pain, couldn't empty bladder, or so it felt. Then I see (sorry if tmi) I'm peeing pink and blood clots. Off to urgent care, could barerly walk. Turns out severe UTI and. Dehydrated. Off to drug stpre, its letting up a bit after a mega antibiotics pill a nd 3 ibuprofen. I know it seems to go on and on, but we will get through it.",
      "MessageIndex": 114,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 7, 2018 07:22AM Djt wrote: Thanks, Moth and Monithor, iv taken 3 of the antibiotics so far, and it is getting much better. You are so right it was the quickest onset of anything I have ever Had! As far as the insistence in the treatments and how we react, i know the staff are good, but they are human, i had one chemo session where they brought a new nurse in, she was from another facility with used different equipment. She did not know how to do the iv connection to the tubing, and as she ran to get someone, and figure it out, my vein just bled out all over the place. She said \" don't look over here.\" That was after she really hurt me good with the the needle going in. She was the only time I had bruises from the chemo IV. I believe they treat so very many of us, it becomes routine, if not mundane.and if we don't remind them, hey, we ARE skin, bones, nerves, and people here, they become somewhat desensitized . But i had to laught at your comment how yoqu got mad at yourself, ...i feel ya.",
      "MessageIndex": 118,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 7, 2018 10:43AM Djt wrote: Thanks, Dee. I know each day seems to bring new issues, and different levels of tolerance, as well as moods. As I was sitting in the waiting room for my radiation therapy this am, every other person looked so so awful, and I AGAIN, realize how fortunate I am. You may be low on the oomph right now, but it's going to revisit you soon, i hope. Bad days are going to happen, man, i tell my self on my worse days ( when I look in the mirror and see Cruella DeVille).....\"remember you dont want to go to jail, what would you tell your grandson\".",
      "MessageIndex": 120,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 20, 2018 04:10PM Djt wrote: Sometimes I get this ....not quite dizzy, but an overall confusion, and have trouble concentrating on what I'm doing. This surfaces when in public, the Drs. The clinic, waiting rooms, finding my way from the rad room back to the dressing room and the waiting room. Shoppi g, parking lots, crowded restaurant, etc. Maybe it is left over chemo fog, idk, but it's definitely a thing.",
      "MessageIndex": 171,
      "PostDate": "20/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 6, 2018 05:02PM - edited Sep 6, 2018 05:08PM by Djt Hello my friends, So my last radiation treatment was a week ago today, and iv had the increased redness and irritation. In fact the skin is so fragile, where the nurses peeled off the stickers left scabs and sores. I couldn't figure out why I had increased pain over the last few days, then looked very closely at nipple area, well. It looks like iv been nursing a five year old with a full set of teeth. Rough .no skin left on nipple. I will say iv tried all the different potions and lotions and found the most serious and beneficial one is First Aid brand, intensive moisture cream. On another note as the beat up breast started to calm, my underarm area and lymph node scar are turning a very deep ugly red and pain was extraordinary. I got up yesterday and could not touch it with the cream, multiplex, or anything. Through the day I had chills and felt very sick. Called and explained to nurse at mo office. She said will call me back, after she explained to my dr. So, the call back is to come in and be seen which I did a few hours ago. Lymph node scar and surrounding tissue is infected. Picked up my 10 day supply of antibiotic...hopefully will kick in soon, cause this is SOME painful pain.",
      "MessageIndex": 219,
      "PostDate": "06/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 23, 2018 01:09PM - edited Jul 23, 2018 01:12PM by Djt hi all. Had the \"dry run\" today. First rads tomorrow. Not feeling happy about this, hope my mood picks up soon. I saw my endocrinologist a few days ago, he said to be sure they cover the thyroid area as I have a goiter and hypothyroidism.. my oncologist Dr. said seeing as it's already underactive, not to even worry. This sounds very disconcerting to me, i hear so much conflicting info. Also, when I met with my radiation oncologist, i ran by her a thread i read on here regarding a woman who posted about se ere blisters, black peeling skin, blood oozing, and so on. A very a larming post on a different thread from a few years back. My dr. Actually toldc me, that some cancers close to tbe skin surface require this kind of INTENTIONAL burning to rid the Cancer. So, for what its worth, or if you read that as well, I'm thankful its was deeper tissue located. And hope none of us need this type.",
      "MessageIndex": 28,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 23, 2018 01:16PM Djt wrote: So, the bra issue. I have bought and returned 3 bras, not having much success with finding soft, cotton, and support for a d cup. Im an underwire wearer, and just dont know what else to try. Does anyone actually have a brand name , style, or info that fits a bigger woman like me, and offers support? Im getting really desperate for a bra to get me through radiation therapy. Thank you if you can help.",
      "MessageIndex": 29,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 25, 2018 03:21PM Djt wrote: Hi, Moni i am having 28 treatments. Nothing was ever mentioned about \"boosts . Never heard the word. I hope they don't spring somthing on me at the end, i don't do doctor surprises well. What is a boost? An extra rad session? A stronger session? Who gets them and why? Lotions=I was told no lotions for one hour after session. I use some ice packs when I get back in my vehicle to just cool it down, i saw on radiation thread another woman who recommended this. then when the hour is up, i slather on whatever. At day 2 for me, I'm using pure aloe. Again at night, and then corn starch powder when it is absorbed. Now I'm wondering if my twisted mental state got it wrong, and it's no lotions 1 hour before treatment....Or maybe it's both before and after. My time is early am, so I don't anyway.",
      "MessageIndex": 37,
      "PostDate": "25/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 27, 2018 09:19AM Djt wrote: Monithor, maybe use ice packs directly after treatment, that could get you the hour into drive time, then the lotions, best, djt",
      "MessageIndex": 42,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 27, 2018 09:20AM Djt wrote: Ingerp, thanks for the boost info!",
      "MessageIndex": 43,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 1, 2018 01:54PM Djt wrote: Wow!! All this Disney talk is exciting!! Glad to know many have a plan for Fun at the end of the radiation road. I love October and fall, we actually have October plans for a Maine cottage on the ocean, can't wait. For those going to see the Mouse, im excited for you, i have never gone. So today was my7th radiation treatment, and I finish on August 30th. I believe I read that the body size has something to do with how many days, and how they divide up the strength of the prescribed individual dose of radiation. I'm fortunate to be a 12 minute drive from my treatment center, so it already has become kind of routine, ( after last week's panics I had) they set me up with an ID card that I scan when I come into the waiting room, they call me in within 3 minutes and I leave 10 minutes later, i get coffee, and this week have picked up my walks again. My center has the onco Dr seeing me once a week, and after every 5 treatments, they take an x ray to be sure the original markings are still accurate as any swelling, etc, can alter the angles and precision of the treatment. So far, still using the ice packs for an hour immediate after treatment, then aloe, cornstarch powder to stay dry. I can now just start to detect a bit of achyness, and swelling, but its not bad.",
      "MessageIndex": 73,
      "PostDate": "01/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 5, 2018 11:48AM - edited Aug 7, 2018 07:08AM by Djt",
      "MessageIndex": 101,
      "PostDate": "05/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 19, 2018 04:59PM Djt wrote: Hi all ..Ingerp, good luck with getting started this week. I am suppose to be done on the 30th. I saw my dr. At my rad treatment Friday, and she said I was starting to burn, under breast, and lymph node surgery area was very irritated. I had about an extra hour as she let me have the rad treatment Friday but sent me back in to see the nurse. She set me up with compression foam adhesive bandages. I'm using the burn gel they gave me, and cornstarch to absorb moisture. I have to see Dr. Tomorrow, for skin check, hope I can continue my treatment plan. I see many are having stomach issues. I learned that radiation really depletes your fluids, hydrating is huge. Also during radiation, we burn more calories. I was amazed that I have been losing about 2 pounds a week. I still rely on Imodium a lot as I did during chemo. My energy level is not bad tho, I'm thankful for that, today, i did laundry, cut lawn, roded motorcycle, and drove back to my hometown 60 miles away, then dinner. Each day, if I push myself, do okay, but very done by early evening.",
      "MessageIndex": 167,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 10, 2018 05:23PM Djt wrote: Hi Group, so if been reading another thread on this site re radiation, and came across some very disturbing incidences of skin side effects i.e. burning of skin. Up to now, i have not been too alarmed or even concerned about radiation therapy as I figured how bad can it. Be after chemo. BUT. this thread I am referring to alarmed the heck out of me. One patient in particular referred to severe burns, and blisters requiring skin crafts, etc. I won't go further, as we are all worried enough. But has any one expriended bad burning or heard of it? I'm consulting with my rad onc next week to sign the consent form, which I will now Go over with a fine tooth comb. I guess I didn't think it would be bad, as she used the term tanned breast to me, but im quite fair, and don't tan!",
      "MessageIndex": 13,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 12, 2018 09:43AM Djt wrote: Ingerp, ok, I get it now, use something as often as possible. Will do. I will get some aquaphor aand some aveeno to start. I think some aloe as well.",
      "MessageIndex": 20,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 27, 2018 12:05PM Djt wrote:",
      "MessageIndex": 191,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 12, 2018 05:37AM Djt wrote: moth-🔔🔔🔔CONGRATS!! Do something special today! Ingerp, sounds like you are doing well, prayers the worst of the storm misses you!",
      "MessageIndex": 235,
      "PostDate": "12/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 27, 2018 04:09PM - edited Sep 28, 2018 05:49AM by Djt Ingerp, so glad you are finishing up. Hope y ou are doing well, the hair will take care of itself sooner or later. Madkitteh, i feel your pain. I had no trouble at all during treatments, but at boots and at end, by Aug 30, I developed a lot of pain, infection, skin breakdown and like you, even moving much was agonizing. I'm pretty healed now, but still get zips of pain in armpit, and where The scar tissue in breast where lumpectomy was preformed. Males me nervous. Hope you heal soon. Lots of rest. Hi to everyone here, and thinking of you all as you work your way through this. Deb, meltdowns are forgivable. I expected my radiation oncologist to kick me out a few times. Yeah, I had a lot of emotional issues with it all.",
      "MessageIndex": 263,
      "PostDate": "27/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 8, 2018 06:29AM Djt wrote: Colleen, that's great, and very encouraging for you, your team sounds fantastic.",
      "MessageIndex": 129,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 27, 2018 04:30PM Djt wrote: thank you, Ingerp! How did your first full week go, how are you feeling?",
      "MessageIndex": 193,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 29, 2018 03:05PM Djt wrote: Hi all, Robin, I'm very fair as well and was really worried about some horrendous burns, but my last session is tomorrow, and I'm reddish but no painful burns at all. I know it will continue to 'cook' for about 2 weeks, but I really rely on ice aloe and cornstarch. Ingerp, hope it's going fast and easy. Funny convo of daquaris and margaritas, because after my last treatment I'm going to have one or the other at a nice lunch with my honey who has gotten me to each appointment! The boosts have been A bit different, today was 3, with the machine moving to a different spot for each, and a different noise than regular zaps. The first boost they put wires with some kind of meter on my skin. Little by little the big blue x marks are coming off. After last zap tomorrow, i see the Dr. And hope no more to come. You know the weird thing....When I'm done, where does the mind go? Do I just forget it all and live my life, and if so, how? After daily appoints, zaps, pills, infusion s and multiple surgeries for the past 8 months, what gear do I put myself IN? Huge changes, transition period. Blessings all.",
      "MessageIndex": 201,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 10, 2018 01:00PM Djt wrote: lg10, we are all unique, of course, but i think with time.....it will be as before...as far as skin condition. Im 11 days past end of rads, and the breast itself is a different color, but i can see it is calming down. The lymph node scar and surrounding areas are still fire red for me, and the peeling of the scar skin is painful. But even with that, i think it will eventually be as before. I hope so anyway.",
      "MessageIndex": 229,
      "PostDate": "10/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 28, 2018 05:54AM Djt wrote: Hi Life, in sorry you dealing with pain now. That armpit , lymph node area is tricky. Have you had your surgeon take a look? As nerves are affected with that lymph node surgical procedure it does seem to create a lot of issues. Hang in there, I hope it improves very soon.",
      "MessageIndex": 267,
      "PostDate": "28/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 27, 2018 09:17AM Djt wrote: duffysmom, thank you for the info on bras, i like Haynes, will check it out! Thanks!",
      "MessageIndex": 41,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 27, 2018 11:12AM Djt wrote: So, iv had radiation this week, Tues thru Fri. So far, other than the repetition of the same thing every morning, i have no issues. Saw the rad onco Dr and WILL see her once a week to check breast skin condition....She said I was doing great, and they expect by next week still will be ok. Im doing... icing, aloe, cornstarch several times a day. On the down side, i asked her about boosts. All of a sudden my schedule went out the window, as on my way out the door they gave me a new one. Dr. Had forgotten to figure in the boost days! So I am suddenly looking at from July 24 to Sept. 10!! I called and told them , actually repeated, what I had asked for a month ago. To be done by Sept. They had assured me at that time, I would be, 28 days of treatment was from 7.24 to 8.31, so I guess they are going to alter up the actual rad prescription to fit it all in, depending on how my skin tolerates it as the plan progresses. I think my onco clinic is top notch, but wow, i have had to question everything along the way. I guess that's not a bad thing.",
      "MessageIndex": 45,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 5, 2018 12:06PM Djt wrote: it's hard for me to grasp who all said what here, but I think it is Monithor who offered the hydrating importance, thanks for that reminder. As far as the holding your breath idea to protect your heart, is this for those of you with the breast affected on the left side? I was never informed of anything about it, but have right breast involved only. And the Mepitel Film, i have never heard of this either, was it suggested by your radiation team? What exactly is it? My radiation team gave me a tube of Skintegrity. It's a hydrogel, and the tube says for up to 3 days use with 1 application, and for full thickness wounds, 1st and 2nd degree burns. I have not used it yet, as I have no burns. I have finished 9 treatments so far. Just using ice, aloe and cornstarch. I'm sure hoping that the after affects don't go into 3 weeks, i expected a few days or a week of continued skin issues after the last treatment, but not weeks. Oh boy. Hoping for the best!!",
      "MessageIndex": 102,
      "PostDate": "05/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 5, 2018 03:01PM Djt wrote: Thanks, Ingerp, it all becomes confusing!",
      "MessageIndex": 104,
      "PostDate": "05/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 9, 2018 09:06AM Djt wrote: Hi Dee, et all. Yes, me too for August radiation. I actually begin on July 23rd for what they are callng a dry run, x ray, and then the next day, the 24th is my first rad. I set it up for 9 am and here, it's Monday through Friday. I went a week ago for the CAT scan, tattooing, etc. Where they tak measurements and get you prescribed for dosages. Mine is 28 days, so my last day is Aug. 30, barring any issues. I'm very fortunate I'm about a 10 minute drive from the clinic. I've been on the phone for days trying to find out my share of the cost, with little results. I can't seem to get an answer, it has to do with codes, and co pays. I'm thinking it looks like 20.00 each time, but hope that is the most I'm looking at. I hope we can all power through this part, as we have done with the chemo.... Without very much in the way of issues. My sister had it 10 years ago...Her main complaint was fatigue. Re the tattooing. When that part came up, all I heard was the word needle, and I put my foot down. Don't get me wrong, I have tattoos, plenty. I just feel the invasive thing and asked why? I don't want black dot tatts on me, like a concentration camp survivor. They DO have an alternative method. I got marker with waterproof stickers over them. It's holding up fine. Also, expect a big high tec camera taking boob shoots up close.",
      "MessageIndex": 2,
      "PostDate": "09/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 9, 2018 09:38AM Djt wrote: Dee, no contrast or IV for the preliminary CAT scan, at least here. It just a measuring type of situation. It took maybe 20 minutes, hands above head, can't move. No issues with it, but I wish they had warned me of the close up camera shots. That's difficult driving! Are you sure there are no other satellite areas? The daily visits will be tiring for sure.",
      "MessageIndex": 3,
      "PostDate": "09/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 9, 2018 11:52AM - edited Jul 9, 2018 01:00PM by Djt Hi Ingerp. Yes, so looking forward to lovely autumn! Hope you feeling pretty good these days. Dee, that sounds like a great alternative plan to shorten your trips, it will pass much quicker if you stay a day or 2, and do work like that.",
      "MessageIndex": 9,
      "PostDate": "09/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 12, 2018 07:31AM - edited Jul 12, 2018 07:37AM by Djt Thanks, Ingerp. I just picked up 3 different ones, hoping for the best. Im also womdering about emu oil, i have seen some referencing it as a good radiation skin care oil. I want to be as prepared as possible.",
      "MessageIndex": 18,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 25, 2018 09:58AM Djt wrote: I joined this group for August radiation because I will have it the whole month, and know a lot of you ladies from the April chemo thread. But I started yesterday, today was my 2nd rad session. So far, it's ok. I'm in and out in 15 to 20 minutes from the walk in the door to the walk out. Never very crowded, so far. It's strange, but I feel like they got it figured out, and I'm just going to go day by day. No redness, no pain. Using aloe and corn starch. They gave me a tube of cream that is for 1st and 2nd degree burns , so we'll see down the road, hopefully wont need but good to have",
      "MessageIndex": 34,
      "PostDate": "25/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 7, 2018 04:35PM Djt wrote: Ingerp and moth...🥂🥂🥂",
      "MessageIndex": 224,
      "PostDate": "07/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 12, 2018 03:55PM Djt wrote: is any one post radiation that has had a bad issue with arm pit, lymph nodes scar area, but not the breast? Im really not knowing what else to do with this dang mess. I spoke to a nurse again today, she says its slow to heal. Its raw, peeling, and such an awkward spot to bandage. Can't even use a washcloth it's so painful. Any experienced This?",
      "MessageIndex": 238,
      "PostDate": "12/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 30, 2018 05:54PM Djt wrote: Moth and Mono, i had mine done on 7.23 and was totally ignorant of the fact that anything else was being viewed or could have shown up. Nothing did, I'm thankful, the onco Dr. Mentioned she could view liver, rib bones, etc. So it's a good thing more insurance all is clear, I'm sure you would have been notified very soon if not clear. Breath deep, we got this.",
      "MessageIndex": 56,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 14, 2018 12:54PM Djt wrote: Kidogo, thank you for taking the time to let me know about this spray. I may check it out. I think I'm almost to a turning point, a bit less red and sore today. It just such an awkwardly bad place for skin to peel and heal. Thanks again!!",
      "MessageIndex": 245,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 17, 2018 05:24PM Djt wrote: LIFE, hope you are not in for node scar trouble. That had been my biggest issue with 28 rad sessions. Just finished 10 days of mega antibiotics and it's still red and raw, but new skin forming. Ice, first aid cream, and keep arm away from body had helped. Best to all with whatever stage you may be in with radiation",
      "MessageIndex": 253,
      "PostDate": "17/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 9, 2018 07:19AM Djt wrote: Robin, that's difficult timing, but how proud you must be of your twins, wait till parents weekend, and other events you can share in, it will be great. I got very very upset an d emotional at the beginning of my radiation therapy. Somehow. If was the worse part yet! I got really miserable. After my routine was established, it has gotten better, and i almost had quit at the beginning. It IS daunting. It's okay to feel like you do, day by day celebrate the little victories, even if its just walking out to your ride home without crying !. It will get better. I had my 12th one today, and so far, no issues, no burns no redness. A slight feeling of heaviness and swelling in the breast like before period, or experienced during pregnancy. I sure hope itf stays this simple. I think the icing immediate after treatment helps, also the aloe, and cornstarch powder.",
      "MessageIndex": 137,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 20, 2018 04:12PM Djt wrote: Ingerp, how did day 1 go?",
      "MessageIndex": 172,
      "PostDate": "20/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 30, 2018 03:17PM Djt wrote: Ingerp, thank you, maybe I just needed to hear that. Yes, a long weekend in mid Sept in 1000 islands with motorcycles is coming. And I want to bring my grandson to school on the first day, next week.",
      "MessageIndex": 207,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 18, 2018 09:06AM Djt wrote: ingerp,...you're getting there, yeah!! Keep on slathering up with the moisturizer. ",
      "MessageIndex": 255,
      "PostDate": "18/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Oct 5, 2018 12:08PM Djt wrote: ingerp....CONGRATS",
      "MessageIndex": 280,
      "PostDate": "05/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/865750",
      "Title": "August 2018 Starting Radiation astyanax66 Insideout2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 26, 2018 07:06AM Djt wrote: hi clareco... i also had my surgery, well, re excision, on march 15. First lumpectomy was 2.14.18. Started same chemo 4.24.18. Im in 3 days, was a wreck untill it took place, and you know what? Im ok! You will be too. Then it's 1 DOWN 3 TO GO! Our thought process crucifies us, reality is not as bad. I walk a mile and more every day, just got back from the diner from early breakfast, it's going to be ok. My next hurdle is donning my wig for my grandsons, kind of worried, but I think a big smile will go a long way. I have crappy hair anyway, so I'm going to like my new look, I just hope no one else is too shocked by it. I'm not one to go into big explains to people. And am not a people person really. The nurses will be so good to u when you go in. I was astounded by them, they gave me a cap, a quilt, food, tv... ice packs! Very kind, and they offered a calmative in the IV, which I gladly took. The IV....I dreaded it hurting, but it did not hardly a bit. Hang in there girl. It's ok. Let me know how u are.",
      "MessageIndex": 1,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 2, 2018 05:56PM Djt wrote: Mainola, I agree, that's me too. I keep wondering about how, why, and WTH?? my significant has often told me this whole thing is a mental fight, struggle. We must grasp it, and control our decisions and not let out emotional , run us! Yeah, easy to say, right? We are woman, we work out of our hearts! But our mind can crucify us if we let it. I think is extremely important to remember- We are still the same person. We did not do anything to make th is happen And this too, shall pass. It's okay to have bad days and do nothing, and say No to everyone. It's okay to have our moment, to weep, cry, yell, and hate this. It passes We are not defined as a person by our hair, lack of, or by our cancer. God bless, and hope for each day to be a good one.",
      "MessageIndex": 33,
      "PostDate": "02/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 5, 2018 08:39AM Djt wrote: dawn...was hair thin before treatments? I hope it keeps coming in for you you have some good length. I bet a hair topper could work for you.",
      "MessageIndex": 26285,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 20, 2018 04:03AM Djt wrote: Twills and Deb...fabulous. Thanks for sharing. I love the long locks on you both...found I can't do the long. But it's okay.",
      "MessageIndex": 5,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 20, 2018 07:48AM - edited May 20, 2018 07:52AM by Djt meg, my longish one was a pricy lace front mono wig, the shorty no, but i wanted to try bangs so went with a less expensive one. I want one more i believe, a mid length. Iv been using the grip bands from Godiva that are made of crushed velvet, and velcro at nape, they work nice.ive had no itchy or problems at all, I was mainly worried about heat, but even on warm days I wear about 12 hours with no issue",
      "MessageIndex": 13,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 20, 2018 11:58AM - edited May 20, 2018 11:58AM by Djt coconut, until your own magnificent mane arrives....try a spray of dry shampoo on your fringe, pony, or piece, it dulls the wig type shine. I have been using a hair band to kind of flatten some of the volume prob, I like the sturdy ones at www.sqhairbands.com. wigs can be trained a bit to what you want.",
      "MessageIndex": 17,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 8, 2018 05:11AM Djt wrote: Hello anyone who may still be following or interested in wig talk. I'm a month past my last chemo, and have just a tiny shadow of hair regrowth. Wigs are my every day go to. As it's been so hot I wear my shortest lightest one, which I have really come to love. It's part of every days get ready routine. This one is called Freedom, i got it through Godiva secret wigs. I'm starting to also realize what a quick alternative to hair worry a wig will be for travel , of course after I'm completely done with radiation. Yeah, wish I had a great head of hair, but also with taking anastrazole I'm not so sure that will ever happen. Anyone get a new wig, and want to share? Have a favorite, or a not so good experience? I'm very obsessed with watching wig YouTube videos ....the reviews especially by Taz. She has one out showcasing a wig called Peagan by Sepia, its a Vogue wig. I love it and want to try it. What i cant believe is the price, its like 60.00!! But Taz give good straight forward reviews, and she says this one is not bad for the price point. I think I may go for it. Please share here if you wish👍👍😊😊",
      "MessageIndex": 23,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 31, 2018 08:32AM Djt wrote: I have 3 now, and never have worn them without a gripper band. It makes the wig feel very secure and more fitted to the head. I got mine at godivasecretwigs.com. I think thay are 18.00 but worth it. They are like a crushed velvet, and worn as instructed, the wig is against the nap of the fabric and creates a bit of resistance. It is worn like a headband and Velcro in back. As far as product. I did buy a wig hair spray from them too. I want to try some gel, or wig styling cream, that kind of product may smooth your fizzles. I also just use water in a spray bottle to scrunch with, and tame flyaways. Keep working with it, moth, it definitely takes some time, experience and playing around to make it your own, but still, WOW. LOVE IT ON YOU.",
      "MessageIndex": 32,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 31, 2018 11:33PM Djt wrote: Hi, yellow. You. Look great in January!! Extraordinary color match to your eyebrows and looks very natural. I love how you are wearing it with the forehead exposed ...the lace front is perfect!! I looked at January myself and thought the beach waves were really nice. Nice pick. But went with Zara, also beach waves and lace front. CBK, thanks for the input on human hair wigs, i do think the synthetic are easier to upkeep. I just ordered a new one, yes, it's addicting!",
      "MessageIndex": 38,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 9, 2018 07:53AM Djt wrote: pcranky....Perfect! The color is very YOU. I can't imagine the price tho. Big decision!",
      "MessageIndex": 71,
      "PostDate": "09/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 10, 2018 03:51PM Djt wrote: I so agree, this is pur time to be indulged!! Enjoy. I'm waiting on one i ordered Now!!",
      "MessageIndex": 76,
      "PostDate": "10/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 14, 2018 06:51PM Djt wrote: Dee, THANK YOU FOR your kind response! So is a port a surgical procedure separate from an infusion appointment? Completely new to this world and this forum, so glad it's here.",
      "MessageIndex": 52,
      "PostDate": "14/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 14, 2018 07:45PM Djt wrote: gawarrior, can I just say you are amazing. I don't think I have drawn in a full breath in the past 3 days till now. One of my concerns, silly, maybe.....I'm very close to my 11 year old grandson and he has had a hellish life. I just don't want to scare him with the \"C\" word. He will guess the minute he sees me not looking like his gram. I have crappy hair any way and did made an appointment with a alternative hair shop nearby. The website seemed cery compassionate a diet looked somewhat affordable, since then fro, read I mg here, I went to the TLCcancer.org site and am encouraged by what they have and the prices. So, with bringing in all the gear, the hand foot stuff, ice, water, etc, are the nurses tolerant of it? I don't Ok now how this works yet, and my oncologist has said nothing about preliminary as his, dogs, or other prep type things. I hate the surprises they spring. Im a tell l me up front person. I asked 4 ti es would i meed chemo, the answer was NO. Thursday the bad word reared its ugly head, it blew us away. I guess I can. Refuse it, but he says it would bring me from a 28 to about a 14 percent for re occurance.",
      "MessageIndex": 55,
      "PostDate": "14/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 15, 2018 01:08PM Djt wrote: Weeeeddie. I am going to try to adapt your motto of cancer not defining the year, we had travel plans and they will be altered, but not ended, I hope. I am now on the 3rd day of learning I need CHEMO, after being assured I did not. I'm disgusted with Myself that I'm still so shaken and anxious. I can barely drink a glass of water, for the stress. I have to adapt to this and move through it. Its hard to get through the night , and then to get up I.n the am. . Did anyone here have this reaction. Maybe ya all are stronger than me, I'm impressed at your strength. When you all post how your feeling and dealing it's so great to read.",
      "MessageIndex": 59,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 24, 2018 09:15AM Djt wrote: GAWarrior, how did you do how are you? I go for 1st tomorrow.",
      "MessageIndex": 139,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 28, 2018 12:33AM Djt wrote: Eliz, it's got to diminish soon, I pray for you. The taste issue got to me last night and I had a terrible wretched spell, couldn't keep claritin down so bone pain all night. Up today feeling better with gingersnaps. And a shower.",
      "MessageIndex": 177,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 2, 2018 08:34AM Djt wrote: Maggie, I understand...you should pull out of it soon, it does improve. I wondered as well, if each infusion is similar, intensifies or what, but it's prob different for each of us. I hope this day is a bit better for you. Ride it out on the sofa, with water, tv, and whatever you enjoy reading. Hi to everyone and may this day be kind to you.",
      "MessageIndex": 219,
      "PostDate": "02/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 8, 2018 08:41AM Djt wrote: GAWarrior, glad to see you back, that is wonderful you had a great time! Do I understand you right, that even the sugar free hard candies give the teeth an acid bath? Yikes. FD I had back spasms one morning, that was it. Moving around seemed to cut it, with the claritin. Enjoy a good if not, great day all.",
      "MessageIndex": 297,
      "PostDate": "08/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 17, 2018 06:56AM Djt wrote: Any of you who have some experience with the Neulasta causing the bone type pains....have you taken the Claritin once a day only? Have you paired the CLARITIN WITH ANY OTHER PAIN RELIEF SUCH AS Tylenol or Ibuprofen? Just trying to tweak up my second time around on this to be as pain free as possible. Thanks in advance.",
      "MessageIndex": 367,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 18, 2018 08:49AM Djt wrote: thanks, all for the in site on taking claritin sooner rather than later. On day 3, and my main issue is complete weakness or fatigue, I guess. I can stand up for about 3 minutes and it's the couch. Trying to get the water down, but not much is passing these lips today.",
      "MessageIndex": 379,
      "PostDate": "18/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 22, 2018 04:06PM Djt wrote: duffysmom, so glad both you and you r Duffy are improving. What a sweetheart he is. Glad you shared his little face. I think we all love him now.",
      "MessageIndex": 433,
      "PostDate": "22/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 2, 2018 07:41AM Djt wrote: Engine, glad to hear your wife's bleeding dissipated. Hope you enjoy a wonderful celebration too. Has anyone else got nosebleeds? That's been my only bleeding, but rather heavy duty ones.",
      "MessageIndex": 524,
      "PostDate": "02/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 14, 2018 06:30PM Djt wrote: Robin, you dont dont know how much your response means to me... THANK you, I feel my oncologist did not tell me enough, the port scares me, heck everything scares me. For Instance. Is TC the type of CHEMO the causes permanent hair loss or just temp?. He knows I have occasional heart arrythmya, and I'm not sure if the infusion can affect this or not. , i did read all the tips and wonder what ro bring the first time, the cold feet gloves idea, what can accommodate this and where do i get it? This is a new world to me. I'm trying but terrified.",
      "MessageIndex": 50,
      "PostDate": "14/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 5, 2018 11:43PM Djt wrote: Dear Frog, of course you're tired of all this. Your old 'you' is still in there, she's pushing you forward so she can re surface down the road. And she will. I think none of us know how we got through any of this. Ha, by now i think i have multiple personalities! One step, one day, one moment at a time. You will do it. One thing that helps me, is find one thing, even tiny, each day to focus on , the kind of thing that makes you smile, do things for yourself. And, ya know, it's OKAY to be down for a bit, to cry, to be mad. It's okay. I hope your medical team addresses the neuropathy, and you get help with it. Keep on them. This WILL TURN AROUND. Hugs. Deborah ",
      "MessageIndex": 785,
      "PostDate": "05/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 6, 2018 12:37AM Djt wrote: GAW, thank you, and I'm sure you are right, PTSD, is a common thread. Wishing you a smooth T#3 . Hope the dry cough improves. I have had nosebleeds almost daily through all of chemo, and d a dry mouth, throat. Our poor bodies!! Thank god for drug stores full of remedies we can try. Deborah",
      "MessageIndex": 786,
      "PostDate": "06/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 15, 2018 04:48PM Djt wrote: hi Deb, wow you are inspiring me. Can I ask where you got your wig? I'm starting Same very soon",
      "MessageIndex": 67,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 12, 2018 10:29AM Djt wrote: Hello, Bobby and Naesha, i hope you find great support and answers here, as i have. As far as the steroids, i told my dr. They kept me awake and he eliminated them, other than the dose in the actual infusion.",
      "MessageIndex": 854,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 13, 2018 12:24PM Djt wrote: GAW...OMG, YOU REALLY MADE ME laugh with whip the wig off,.....haha yep, that would have done it for sure!! in the past I would have flipped on him, but now well....I just move on, my energy goes only for things very necessary, and I know we all understand that concept! Enjoy your weekend!",
      "MessageIndex": 872,
      "PostDate": "13/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 25, 2018 10:06PM Djt wrote: hi everyone, and welcome Maggie. Duffys mom, hope your infusion yesterday went as best it could. Mine was actually a great relief. Not painful, amazing caring team, tons of info, got me ice for icing feet and hands, offered us both ,me and my boyfriend, snacks, soda. Gave me an full sized handmade quilt!! And knotted cap. They even gave me a digital thermometer a d hand sanitizer. I am So relieved this is rolling on, 1 down , 3 to go. I got the Neulasta pump but on my arm, instead of going back today. Taking claritain to ward off bone pain, the nurses were very pro claritan. Got a second wig lined up, and planning on my walk later today. Not gonna lie, i was beat last night after that first long day. Hope you guys are having a good day, prayers to all.",
      "MessageIndex": 154,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 27, 2018 07:40AM Djt wrote: Hi all, well this is my 3rd day after 1st TC chemo, and my only issue is metal mouth. Boy oh boy, it s like a magnet mixed with rotten eggs in your mouth !, makes it hard to drink the water needed to flush. But if it's my only issue, I thank God. No nausea, no pain. Hope each day is like that for all of us. I did my walk 1.5 miles, I did find sugar free Ricola cough drops in the honey licorice type help. Best, all☀️ check in I care.",
      "MessageIndex": 172,
      "PostDate": "27/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 28, 2018 12:30AM Djt wrote: GAWarrior, enjoy every minute, and every morsel! Lucky you.",
      "MessageIndex": 175,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 20, 2018 05:33PM Djt wrote: Erincoop and Bobby, hello, and best to you both, you sound like strong woman, and fighters. I'm hoping this journey for you both is quick and successful!!!",
      "MessageIndex": 924,
      "PostDate": "20/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 29, 2018 08:32AM Djt wrote: urdrago, thanks....actually, I did have to take the steroids 3 day span, before during and day after infusion. I'm now in day 6 ,...it's a new issue daily. Of course, today I wake up with white tongue and diahrrea. ON TO MORE ACTIVIA. Just got to cope the best I can, the best we all can. Eliz.... Dee, and all...,, hope..., Sunday can be a good day for you ALL. DUFFYSMOM, SO glad you got to your sons graduation, congrats, I just keep telling myself, One day closer to the end of this treatment. One day closer. And NOTHING STOPS TIME. THE end of this WILL come.",
      "MessageIndex": 198,
      "PostDate": "29/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 1, 2018 07:44AM Djt wrote: good morning, Frog, Eliz, Dee, duffysmom.....And all..... Imodium is a godsend, and the nystatin is working pretty good for the thrush. But a generalized question for you ALL. Do you have trouble feeling like YOU? I mean.. it hard for me to move through the day with my normal energy, verve, and a feeling of embracing my normal tasks. Maybe cause I'm prob older than you guys. Idk. But sometimes it's like I telll myself..... ok, get up....MOVE, EAT, GO OUTSIDE. !! if even let my walks go for 3 days. I hope it goes away.",
      "MessageIndex": 208,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 23, 2018 03:55PM Djt wrote: LIFE, glad your port is out, you must be feeling good about that. DEBAL, I'm actually not sure if I got new hair or just old hair that stuck around through all the chemo, but I have baby fine thin strands, not anything that covers the bald look, and nothing to get me excited yet. I had my \"dry run\" for radiation today, and start the hormone pill and first round of radiation tomorrow. For some reason, (What the Hell is wrong with me) i felt in a huge depression going in there this morning, and all but ran out the door. I cant bring myself to do the small talk chat, or be friendly. I cant stand them positioning me, touching me. I feel like a freak, an oddball. I cried my eyes out today, and im not a cryer. Was i fooling myself into think i was done after tne last chemo? This next stretch ...that of radiation feels like an assualt on my mind, body, and my mood. Engine, with Imodium, 2 usually works wonders, and doesn't make you go the other way to be constipated, but Janice may notice she is thirsty more after taking it. The reason it works is that it dries up the excess fluids in the intestinal tract. Hope she contines moving forward without further setbacks. Frog, ...good thoughts, hug and best wishes to you. Hi to everyone else, I'm not keeping up well on here right now, but praying for all.",
      "MessageIndex": 948,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 3, 2018 04:55PM Djt wrote: FF... the hair issue is looming for me as well. I've have shoulder length blond hair for years, but am not going to watch it be left all over my pillow and home. So, at the first sign of it going, I'm just having a sizzor fest my own self. I am prepared as much as any of us can be. Just the thought of looking in the mirror at a bald head freaks me out. I bought a nice wig I'm happy with, some caps, and a sleep cap that I really like from tic very soft and pretty. I just can't see myself walkIng around with that kind of vulnerability. Have been watching YouTube vids on how to do eyebrows too. .im thinking the best way to avoid curious stares is hold your head high, wear it like you own it, shoot, I do, that wig was pricy! And make the best of make up, jewelry, and of course, lipstick. I'm trying to decide tho...if anyone dare ask me....did I get a drastic cut, or is it a wig, do i want to just tell them or do i say duh.",
      "MessageIndex": 241,
      "PostDate": "03/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 11, 2018 02:13PM Djt wrote: DEE , that sounds like a nightmare....So many things to watch out for and be aware of. I hope you have gotten past it. DUFFYSMOM, I'm on schedule for Tuesday as you are. They do my bloodwork first, so I hope I can proceed. This week has been so very much better, with distance from the first treatment it gets better each day. I hope this can repeat itself after infusion # 2. That there IS hope on day 7 or 8 to taste food and have some measure of energy. We just did some pre treatment shopping for crackers, soups, sugar free hard candy, and last time I got a big box of gingersnaps hard cookies. They helped too. Positive thoughts, and best wishes to all here, and hope for a terrific weekend. Deborah",
      "MessageIndex": 314,
      "PostDate": "11/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 9, 2018 12:19PM Djt wrote: FDwithfurkids thanks for helping us understand your scan pictures, you are just amazing ! Im astounded by such dramatic results, VERY excited for you. Engine, i feel so bad for your wife having such SEs at every turn, the protein shakes sound like a great nutritional idea. I got thrush with every chemo, and it was awful. Hopefully, whatever RX she was prescribed will work quickly.",
      "MessageIndex": 1083,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 20, 2018 04:45AM - edited May 20, 2018 05:03AM by Djt Hi friends, please visit the new thread. Wig talk, if you want to join in that subject as well. It's under chemo side effects as this one is. Thanks",
      "MessageIndex": 394,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 12, 2018 06:59PM Djt wrote: Hi everyone, I'm having a hard time commenting on each post here, but read them all. My heart sinks when I read of new and worsening side effects. And I Cheer on all who are progressing bit by bit too. I feel we are ALL a team with the same goal, and you are all part of my day. Although through with the chemo step, and on to hormone therapy and radiation I still want to know how all are doing, it's something none of use will ever forget. I have drawn so much help and comfort from all here.",
      "MessageIndex": 1111,
      "PostDate": "12/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 19, 2018 07:20PM Djt wrote: urdrago, interesting. I have Biofreeze also, got it on Amazon. My chiropractor has used it for years, i may try it on left foot, also. Thanks",
      "MessageIndex": 1184,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 20, 2018 02:49PM Djt wrote: Thanks to ALL FOR the best wishes, you guys are the best. I'm hoping this week is a good one for all, enjoy every moment you can .",
      "MessageIndex": 1194,
      "PostDate": "20/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 20, 2018 07:04PM Djt wrote: Thanks Frog. That was a rough deal, Dr. With a scalpel!! So sorry. I hope that heals fast. Addressing overall health sounds like a very good idea. And one to get back on track. I think ibuprofen can help a lot. Feel better soon.",
      "MessageIndex": 1196,
      "PostDate": "20/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 27, 2018 11:18AM Djt wrote: Dee and Onna, I find it very interesting about your comments on privacy, and 'handling. \" I also, am very private, introverted and unable to say much to others re my medical stuff. I lost my tolerance to be a \"good patient\" at a young age after years and years of heart issues, surgeries, and related hospital stays.from childhood on it became a big issue for me to even go to the Dr. For anything. I remember being in cardiac ICU one time, and with no warning, the entire group of approx 22 interns and a couple Dr.s come strolling to my bed discussing my STATS like I was a non existing piece of warped furniture. Never addressed me as a human being. That twisted me up. I could related 10 more stories, but suffice it to say, I hate Dr, visits, exams and anyone even touching me. I got to the point that one time in ICU, I removed my own IV, and called a cab and left, as I could get no one to get me a (allowed ) drink of water. Wow, that got big attention. At a stress test on the treadmill, I told them when I had to stop, (I was told to let them know!) And they kept go in and sped the thing up. I pushed the Dr. Out of the way to jump off. I was told I had a panic attack. Uh, no. I'm the patient here, and you did not listen to me, THE PATIENT! So the cancer thing, well, I'm older and wiser, and I have a good team, but damn. I want to be left alone. No, thanks I don't want the shadowing new face of each intern to grop my mutilated tit every time im in for a visit. I have told no one but my sisters, and 2 children of my dx, I just don't want the fallout, because I won't be nice.",
      "MessageIndex": 483,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 5, 2018 05:32PM Djt wrote: Urdrago, wow you sure did not need shingles. I'm so sorry. Hopefully the rx your Dr. Has given you will lesson the effects. Iv had them, it's painful, something you sure don't need. Sometimes they are mild, j hope so for you. Best wishes, Deborah",
      "MessageIndex": 547,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 7, 2018 01:58AM - edited Jun 7, 2018 03:05AM by Djt Dee, thanks for the info, and review on the new study. You are right, it is weighty matters. My breast surgeon who is head of her her teaching department, had a week long conference right after my first surgery on Feb 14, this year. When we met afterwards, she told me there is so much new information, and changes in how it's being treated that there was like 5 new discoveries a month. One she reviewed at her Florida conference, I believe was this new Tailor X. She was very thrilled at the new advancements in the breast cancer field. As she alluded to the study would decrease the number of woman receiving chemo. Duffysmom, glad #3 is over for you! Try to flush steroids out with lots of water, I know I hate them too. try Tylenol PM, I think it's as good as Xanax. I just put polish on a few days ago, and I swear my bit. B12 sublinguak with other B.s. really keep my nails going strong. I did wake up today with hives all over my arms, and chills, but no fever. One day at a time I guess🌸🥀🌷🥀🌺🏵💐",
      "MessageIndex": 567,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 6, 2018 11:06PM Djt wrote: GAW You look great CONGRATULATIONS GIRL! So glad for you. I love the short hair on you. That part can be put away as you move on. Batata and Debal, glad to see you are the upswing! Prissy, glad for the calm on this long road, that I see you have traveled twice. Hugs and best wishes. Have a great day ALL !",
      "MessageIndex": 1308,
      "PostDate": "06/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 8, 2018 07:24AM Djt wrote: Frog, thinking of you as you go through this step. I hope you mend up quickly and get the rest you need. I remember the wire part, and sitting in the chair as you described. It was immediately following the cat scan intravenous dye for nodes, which did not go well for me, somehow the dye did not travel into breast as it should have. So back to wire, i said what do you put on me, a local? Nurse said. -\"most people tolerate it ok.\" So, as they got me lined up, i asked again , and got the same exact answer \"..most people tolerate it ok.\" so, they did no kind of anesthesia or numbing at all. I too, look down at wire in boob, after they did it. Thern the tec running the controls says NOPE, WRONG SPOT. and they did it over. Yep that was a bad day. Makes me I'll thinking about it.",
      "MessageIndex": 1316,
      "PostDate": "08/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 8, 2018 01:37AM Djt wrote: what a group here...so many going through so much. And everyone trying so bravely to put a smile and a kind word in for everyone else, such a gracious strong group, i admire you all, and am thankful for the board ...its a refuge, a safe understanding place to come when needed. Blessings and thanks to all here this day.",
      "MessageIndex": 580,
      "PostDate": "08/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 12, 2018 02:52PM Djt wrote: INNAB🥂🥂🥂 huge CONGRATS to you today🔔🔔🔔",
      "MessageIndex": 1371,
      "PostDate": "12/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 26, 2018 11:13PM Djt wrote: you all are sumthin else! Brave AND beautiful. I just today, told my sister I have a little brush cut coming in. And that I look like Eddie Munster, only old. I got a little peak on top!! I use the infant hairbrush I save from my grandsons baby locks, I knew it was for something!! Is there Hope? I tell my partner his beard grows faster than my hair!!. ",
      "MessageIndex": 1479,
      "PostDate": "26/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 2, 2018 11:44AM Djt wrote: Hi all. Urdrago and Duffysmom, so sorry to hear about your set backs, hoping and praying for you both that these issues clear up soon. So many, going through so much. I finished chemo, and had a radiation consult appointment 48 hours later. That last chemo did. Me in. I had a complete meltdown at appointment at radiation. I was just drained and wondered if it was all worth it, will IT COME BACK. i got so disoriented by the end of the cat scan, (that I didn't know was coming,) pictures of breasts, and male tecs, and the overall weakness of just trying not to fall on the floor, by the time i was done i could barely see, didnt know where i was, didn't recognize the waiting room or see my guy waiting. I saw my truck out the window and wandered out to it. He found me a half-hour later. Bad week. Bad bad week. Good news is should finish radiation by Aug 30. I know we all have our fears, and scary moments, I'm glad you all have shared your s with each of us. Many of you guys are winding down your treatments CONGRATS and hope for us all. 💐🏵🌸💐🏵🌸💐🏵🌸 Deborah",
      "MessageIndex": 764,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 6, 2018 09:19AM Djt wrote: Dee, and. LIFE yeah for spy movies, we have been watching all kinds of crazy movies and series in this heat also. Yeah, the stinking thrush is very annoying. I, about through it I hope. Life, for sleeping, have you ever tried Tylenol PM? taking even one helps knock me out.yes, i get shaky, and I hate that feeling. I loved your stories, and. HeY , we earned being crazy ladies. Not an issue!!! You do what you can do. Will it matter in 6 months? Nah... As the Cheshire cat says \"\"WE'RE ALL MAD HERE.\"",
      "MessageIndex": 790,
      "PostDate": "06/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Oct 2, 2018 03:40PM - edited Oct 2, 2018 03:57PM by Djt Hello to all my friends here, New and old!! LOVE seeing you all. Engine with Janice, frog, frog, i got weirdo toenails, blackish, and wavy. About 3 eyelashes, but i do see my eyebrows now are pretty good. Day by day. GAW love that smile.life, you are funny, enjoy the trip! I laugh every time I see my head, going wigless in house is a start. Me and my partner were play boxing and, I said to him, \" you know I'll win ,\"which is, of course a joke, and he counters with \" what are you going to do, stab me with your pointy head?\" I'm still laughing, and that was yesterday. But i do have a point top on the half inch of hair I have! You all are braver than Me! But I did post a face pic with wig in the #wig talk# group here. Ingerp, DEB, innab,urdrago, life, red, Linda, thinking of you all, and love reading your updates. Hoping all are doing comparatively well, and enjoying fall.",
      "MessageIndex": 1513,
      "PostDate": "02/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 7, 2018 12:30AM Djt wrote: A couple other Netflix Original I really found engrossing are- Bloodline ( not real long) Revenge. ( 4 seasons, set in the Hamptons) not the French movie ) Red Road ( Joson Mamoa, what not to like)",
      "MessageIndex": 797,
      "PostDate": "07/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 15, 2018 11:27AM Djt wrote: InnaB that is so good, wow what a great discovery! Excellent!! Life, thanks, i know, people.....The best part is, i rarely use the hc spots, only when I'm hurting. Frog , duffysmom, INGERP, GAW, Engine, and all hope the weekend is treating you well, and the heat is bareable. Here in NY it's a drought, not to worry about grass mowing, it's dead!",
      "MessageIndex": 881,
      "PostDate": "15/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 16, 2018 03:41PM Djt wrote: Duffysmom, good wishes and warm thoughts for you during tomorrow's treatment, you're getting there! I hope the clot and port s situation improves soon. You will be right behind me in the radiation schedule for August hoping for the best! Engine ...hope the wife is gaining some strength and energy soon, i knows it was very cumulative for me, I'm still very weak from my last chemo, and it's 3 weeks tomorrow. My s.o. keeps telling me to eat and drink, but it is hard to take in good nutrition when taste and appetite is so far from normal. It's a little by little process. Iv been trying each day to gain a little more momentum. Hoping for a great week for us all. Deborah",
      "MessageIndex": 887,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 28, 2018 07:34AM Djt wrote: Inna, I can't imagine your frustration and disappointment over the veins not cooperating and being sent home. I really hope next week it turns around for you. The drinking water is important for sure, sounds like you got that covered. Hugs",
      "MessageIndex": 995,
      "PostDate": "28/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 7, 2018 09:01PM Djt wrote: Frog, keep going forward, one more! Praying it's easier.",
      "MessageIndex": 1068,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 30, 2018 10:48AM Djt wrote: Howdy all. Sorry, i just re read back a ways... hello to Carol, and Linda, glad to read your news. So the last couple of days i was dissapointed in my mascara, thinking i need a new tube. Then it hit me. Yep, not the mascara, it's my lack of lashes. Wow, a bit slow you say?? I have just got a small amount of brow, but color them in nicely, hoped and prayed my lashes were going to stay. But I'm thrilled a have a few at least. I hear they are very slow to grow in. What a twisted world! I just finished my last radiation treatment, this morning and got paperwork for insurance...reading the diagnosis of...inflitrative carcinoma.... brings me to a. Very scary place mentally, even though IV heard the words,\" you HAD cancer, now you dont\". And I'm worried about eyelashes!!! The doctor s have all said it takes a year before you stop thinking every twinge and ache and pain is cancer related. This is so scary. GAW, Dr checked cyst and lymph nodes, said all was fine, irritation and burn from radiation and prob hair follicles, use antibiotic cream. Best to all here, we share a commonality only understood by those who walk this road.",
      "MessageIndex": 1273,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 10, 2018 04:40PM - edited Sep 10, 2018 05:45PM by Djt HELLO ALL!!! Engine, so glad Janice is on a 3 month break and you can plan on seeing family for thanksgiving..you guys sure deserve it. LIFE, you're awesome, hair is for sure coming in. I think that 4 wheeling and mountain air did wonders for you by that smile. Yes, a reassment of job, lifestyle, everything is a positive step to take. I'm making different choices as well. Love your doggies, so fun to enjoy their company outside. The rads went pretty good. (I post in the radiation August. thead in more detail) but I have an infection in armpit o n The lymph node scar I'm dealing with now. Innab hahaha love it. That's me too, except that cutie has more on sides than I do. Ingerp ....YEAH THE HAIR issue is so unfair. I have always had thin hair, and had no hope on it coming back at all, especially with the anastrazole hormone therapy. ALL these drugs cause or can cause thinning. But, i got a little (very little) brush cut going on!!! It's weird, because I also have some long stray hairs here and there too, maybe they were with the pre chemo me, and never left, idk!!! And yes, the hot weather makes it difficult for sure. Have faith, it will happen. I really rely on my wigs, and like to switch them out. But, we all want our hair back, darn It!! Batata, hope things are improving for you, and your Taxol gets done very soon. I hope you can continue to take walks, i try that also, it's empowering, and helps keep energy up, mood up, and weight down. Don't beat yourself up over a little gain. Urdrago, i think every part of us heals slower than \"normal\" people as our bodies have to cope with so very much. Thinking good thoughts for you on your tests. GAW, i hope your powering through that last chemo, and on your way to feeling much better. Frog, hope your healing up, and feeling better each day. Libby..i had leg issues as you described and figured it was that i needed exercise or rest. One or the other...so i resumed walking and legs were much better. That was as just me tho, i hope you feel better soon. I also, have trouble remembering each name here, and related state of conditions, but I think of you all as friends, and part of my life now. Also happy Jewish New Year to those who observe it, L'Shana Tova.and best to all. 👨👩👧👦👨👩👧👧👨👦👦👨👧👧👬👪💑",
      "MessageIndex": 1348,
      "PostDate": "10/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Oct 4, 2018 04:59PM Djt wrote: Ingerp, absolutely wonderful picture. Keep smiling as this remains behind you. Congratulations",
      "MessageIndex": 1542,
      "PostDate": "04/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 6, 2018 09:26AM - edited Sep 6, 2018 08:17PM by Djt yellow b...Rae rocks on you. Extraordinary color flatters you, and I love the natural beachy wave touseled look. And I can tell you love it by your smile! Stubborndog... I bet you look Great! I think the key is to wear that hair like you own it completely!! Keep your head up and look life in the eye with the confidence that wearing a great \"do gives us!! Hope all here are feeling well, and doing better!! 💟💟",
      "MessageIndex": 64,
      "PostDate": "06/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Oct 3, 2018 04:17PM Djt wrote: Hi yellow! I'm so glad you remembered to post about your new wig on here. That looks great. It has that, what I call, the un perfect look, that makes a wig look so natural. The soft waves are very flattering and the color is fabulous. Very warm, and soft looking. Is it a lace front? Can I ask where you got it, if online? I just returned one, yet again, but have the credit, so I need to reorder. The lenght you have on seems to be my best options also. A mid length.",
      "MessageIndex": 78,
      "PostDate": "03/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Oct 5, 2018 03:04PM Djt wrote: Hi Moth. I think if you feel better, confidant with the wig, definitely wear one. I see many mid length ones out there, but i do think its tricky to pull back for a pony tail. It's a matter of much online shopping and watching you tube reviews for sure, that being said, I have found the shorter ones are so comfortable, and care free I go with that. Also, bangs cover a multitude of sins! I have cut bangs into 2 of mine, and it makes the look more 'me'. What about a whole head cover scarf for your clinical? I hope you find something you like. Have you checked out the TCL headcover site? https://www.tlcdirect.org They have lots of good wigs, scarfs, and great prices. ",
      "MessageIndex": 81,
      "PostDate": "05/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 16, 2018 06:13AM Djt wrote: I also will be getting a 4 round of CHEMO over 9 weeks. My Dr. Said specifically an IV. A PORT was not mentioned. Does the port have do do with the state your veins are in or current health? If veins are accessible and it's do able can the port be avoided?",
      "MessageIndex": 5,
      "PostDate": "16/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863991",
      "Title": "Chemo Port-O-Caths: Did you get one? What was is like? buttercup1 exbrnxgrl"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 18, 2018 09:15PM Djt wrote: duffysmom, I got onto the tic site and ordered several caps, etc. I thought the soft seamless night wraps looked good to try. Thanks and blessings. Trying my first wig too.",
      "MessageIndex": 92,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 24, 2018 09:26AM Djt wrote: GAW...Just saw youR new reply, good, glad you got through it...feel better soon. ..I cling to this board and all you friends, it helps, I am hoping some of my dread and depression leaves after treatment 1 tomorrow. Fear of the IV, pain and fear of the unknown. I use to think I was a brave sort, having heart surgery, bad divorce, natural childbirth several times, and riding my own Harley, raising 3 teenagers alone, and working as a laborer. NAH, I'M NOT BRAVE, NOT AT ALL.",
      "MessageIndex": 140,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 24, 2018 09:40AM Djt wrote: astyant66, fabulous post, thank you so much for your clear detaied info post, i did not know that the Neulasta is optional, heck, wth do i know!! 1 infusion tomorrow, 24th.",
      "MessageIndex": 141,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 24, 2018 09:44AM Djt wrote: duffysmom, 24th, tomorrow! Thank you friend. I appreciate that. I am very much on it with the teeth, mouth thing..got biotine, a, new water flosser, so on. Wow, I'm nervous.",
      "MessageIndex": 142,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 26, 2018 01:13AM Djt wrote: lei, have not seen you on here, thinking of you, how are you doing?",
      "MessageIndex": 161,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 28, 2018 12:37AM Djt wrote: asxtanyx66. So sorry, that stinks. Maybe the claritin and extra strength Tylenol combo can ease it. Mine started last night as well, pelvic area and hips to knees. More like a constant sharp pickling with no let up. Just enough to keep me jolting awake. Bad night, hope it gets better . Hang in there.",
      "MessageIndex": 178,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 28, 2018 09:15PM Djt wrote: I am stuck with the drinking water issue now with metal mouth. It's become a huge issue. Drinking water is impossible. Yesterday, I resorted to peppermint tea, with stevia, that was doable, and a small cup of chicken noodle soup for the hot broth. Ginger ale is not doable either. I'm at a loss, does time diminish the metal taste? Even when not drinking or eating, I'm sucking on sugar free peppermint or cinimmon drops. Also even with taking a Xanax, I can't sleep much, any one else?",
      "MessageIndex": 185,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 28, 2018 09:34AM Djt wrote: duffysmom, hows it going? Are you able to drink the water. Do you find that you sleep very lightly, or not af all.? Im hoping this is going to pass..,,",
      "MessageIndex": 188,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 1, 2018 04:09PM Djt wrote: eliz....duffys mom. Thank you your words mean a whole lot right now. Yes, it is life altering, profound, and at times, unbearable. But somehow it will pass and we too, will be one of those survivors who we didn't know were fign't ing this fight. Last night was so bad my significant other was about ready to call an ambulance, but he got me through the night. Today, I did my walk, sat in the sun, ran errands, and ate a hamburger. I thank God for every good day. I had read on a woman's blog that she loved DAY 8. Maybe that is the magic turn around number. I hope you guys have more good than bad, for sure.",
      "MessageIndex": 211,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 3, 2018 09:12AM Djt wrote: urdrago...I got the mouth tablets on Amazon. Check out the whole line of Biotine tho. Duffysmom, what brand of ginger tea do you have, where did you find it? I have been looking and not found any yet. Hope the imodium kicks im forr you sooner rather than later. I'm back on it religiously now as well. At least it's cheap at dollar store.",
      "MessageIndex": 234,
      "PostDate": "03/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 4, 2018 04:25PM Djt wrote: frog, I hope you are at or nearing your turn around point from your infusion, I can't believe the day 8 thing. I have been shopping, vacuumed, and out to lunch with a friend. IT feels so good to be feeling like me for the past couple days. I kind of pretended to eat at lunch however...I'm not getting along with food yet, and my immodium is a daily given. But I just feel pretty good. I hope this for you ALL as well, have a decent weekend.",
      "MessageIndex": 254,
      "PostDate": "04/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 8, 2018 06:47PM Djt wrote: Linda, good for you! I'm on my 2nd full wig all day wear, so far, so good, but I still have some bio hair under it, so I don't know how different it will be over my bald head. Have you ever watched Taz on YouTube. ? Her wig reviews are fabulous, hints, tips, and encouragement. I have learned so much watching her reviews.",
      "MessageIndex": 300,
      "PostDate": "08/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 21, 2018 12:30AM Djt wrote: Hi all. Hope Sunday is a peaceful and kind day for all of us. I'm starting to get a coated tongue with thrush, just liked last time, but am on it quick now. My onco Dr. Gave me a different RX as a just in case it reoccuranc this time, it's a dissolving pill. I took it last night, no where near as bad as the liquid nystatin I had to swish and swallow. I think I caught it quickly this time. At the Dr, appt. When I told him how bad the nystatin tasted, the Dr. Just said \"oh dear\" and looked at me. I told him I would save him a swig, so he could taste it.....and he quickly came up with the dissolving pill option. My guy with me said I was kind of hard on the doc🤔🤔. Hard on HIM???? I have learned to speak up for sure.",
      "MessageIndex": 398,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 21, 2018 04:14PM - edited May 21, 2018 04:16PM by Djt GAWarrior, thanks for the reminder about Activia I was eating it pretty regular, and feel the same way, that chemo knocks our system out of balance and alters our good bacteria terribly. Pro and pre biotics, yes! I will try it again, but the odd deal for me is, the very items I enjoyed and tolerated well on round one, I can't even think about for round 2. Its been meats, ice cream, and maybe eggs this time, but still, I can't complain, I'm no where near as ill feeling. Of course today is day 7, so it's getting much better. Hope this for you ALL as well. Thanks to all for the well wishes for the Maine trip. It's not till Oct, but I love having some goal ahead, especially with my Harley parked and covered right now. That's a hard pill to swallow. Keep on moving forward ladies!!!",
      "MessageIndex": 412,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 23, 2018 05:52AM Djt wrote: Falcon62, I'm so sorry you are in this distress, it's bad enough to be fighting cancer, taking chemo, but any kind of vaginal infection is miserable. I can tell you I have been fighting a mouth version of it, it's called thrush, and is caused by out of whack gut flora, changes of ph and yeast in the body by the effects of chemo. , its the oral version of a vaginal yeast infection. I have been given nystatin liquid and also a same type of lozenge, to kill the yeast infection. It's very stubborn, gives me a sore throat, and hideous taste in mouth, kills appitite and water even taste bad. im also associating stomach cramps and diahrrea with it. Speak up .loud and clear to your oncologist and tell him Your symptom,s, it may be a yeast infection for which you can be given a simple RX . I hope you can gain a measure of comfort soon. It does get better. It is rough, absolutely, but your team should be aiding you with your se.",
      "MessageIndex": 435,
      "PostDate": "23/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 2, 2018 02:38AM - edited Jun 2, 2018 02:47AM by Djt Hi all, trying to catch up with everyone's news, glad to see most of it is fairly good. GA warrior, the thrush battle is best fought as quick as you think you have it, I have had it after each infusion treatment. The lozenges do work quickly. Weedie, hope you are still on the upward swing of feeling better. Dee, my eyebrows are also thinning, andc I'm worried . But I have found several kits ..inexpensive, to darken and etch, before they are totally gone. I figure it helps to give me a feel for how to draw on when they are completely gone. There are stencils available to assist in drawing on brows. Wow this is work!! ya know! Frog, taking ibuprofen for the bone pain actually helped me more than claritin, or both together completely eliminated it . Hope it improves. Duffysmom, hope all is well as we move towards the 3rd round on Tuesday. This week has been better tummy wise, but I've been quite tired. Dee, I did go back to the activia, but it doesn't appeal to me now! Good thing they are small portions. Linda , Astyan, and engine.....hope the weekend is a good one. hang in there, and everyone else. Best to all, I've been so moody, just feel like hibernation with my books, and trying to get in some of the grandkids end of school year events.",
      "MessageIndex": 519,
      "PostDate": "02/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 4, 2018 02:23AM Djt wrote: Dee, so happy for your sons wonderful graduation and your enjoyment. You are so right, it doesn't get better than that. I so remember my son loving Weird Al!! His prom memory will be a life time smile, ...for all of you!! That's just great. Maggie, I am familiar with the Ayr products, i think I may still have some sampled gels here somewhere, I used them during winter dryness, it may help. My nose bleeds are nothing short of dramatic, length and exhausting. Thanks for the reminder. I feel it is a combo of dried out nasal passages, blood counts, and too many darn meds. Duffys mom, hope your gastric problems end soon , with no ulcer!! I get pepsid in my pre meds and taske Omperosole every few days at home, that stuff works for me. We are getting through this! I actually weeded my little flower patch this morning, and then painted my nails. Yippee for normal moments☀️☀️☀️",
      "MessageIndex": 535,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 6, 2018 11:48AM Djt wrote: Llife, as others have suggedted the nulasta type pain in bones is greatly reduced by taking regular Claritin. I also take 2 ibuprofen. In about 5 days, it's all over with. I also think walking moving helps. Almost totally 0's out bone pain. The Xanax is a controlled substance to reduce anxiety and to assist with sleep. As your on Dr. There is also over the counter Tylenol PM. HI DEE, so glad today is over. I think I make her nervous, I hate to think she would make an IV painful delibratly. I im just not a social butterfly kind of person, and i do my best, but iv been told as i come across as sort of tough, i guess i would say. Maybe resting bitch face syndrome. Idk. I'm glad you could reduce your steroids, I only get the IV dose at infusion, they let me drop the 2 on day before and day after. Big difference. Plus my glucose levels are lower without them . My onco Dr. Told me the only real purpose the steroids serve is to keep swelling down. I hope you get your 40 hours fmla, bring documentation and Drs. PRESCRIPTION drugs don't quit ...you about got this.",
      "MessageIndex": 563,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 9, 2018 02:50AM Djt wrote: duffysmom..My sincere condolences in your loss. My little buddy, Daisy, left me a good 6 years ago. And I'll tell you, yesterday I had a real real bad day for quite a few reasons. The only thing I could think of was how I missed Daisy, feeling her little soft head as she would push her way under my arm close to me when she saw me in distress, I don't say this to further your grief, but to share it with you and appreciate how awful it is to lose our little fur friends. I hope you are doing as well as you can. Same for all here, and that SEs are doable. I'm on day 4 after my 3rd treatment from Tuesday, and had a rip roaring upset with my significant other last night, then overnight the stabbing crazy bone pain was very bad. I had to get away, and drove the hour and a half to my house, and cut the lawn. I must have super powers. I don't know about anyone else, but in my life experiences, it's always when you need someone the most , they have some reason to look at me with a blank stare and not seem to find it necessary to step up. But the sun is out and it's a very pretty day.",
      "MessageIndex": 592,
      "PostDate": "09/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 2, 2018 04:27PM Djt wrote: Inn a, thank you. I needed that, it made my day. 🌺",
      "MessageIndex": 766,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 6, 2018 09:08AM Djt wrote: Inna, i don't know how you walk in that heat, we have been on the high 90s and I just can't do it with the humidity factored in. I am going to check it the dirty dozen, clean 15. Sounds very informative, thanks for, mentioning it. Iv not seen sneaky Pete, but wanted to mention a Netflix origina to all.....lts called Longmire. Its kind of a modern day cowboy, very interesting, and I got so so involved, we were standing in line at Arbys, and I said to my guy, omg, there's Ferg!!! A guy in front of us looked exactly like one of the deputies in the show. We watch it every night, long series. Feel better from SEs soon.",
      "MessageIndex": 789,
      "PostDate": "06/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 8, 2018 09:14AM - edited Jul 8, 2018 09:15AM by Djt LIFE, i had to chime in in your delema re getting out and socializing, and Sturgis. You can only do what you can do, not wise to push beyond your energy or travel limits. The Sturgis thing resonates with me, in a big way. Went last year. We rented a bike, as living in N.Y., and my S.O. has one leg, riding with a prosthesis that far is not an option. This year we were going to trailer his ( which he has been building for months) and mine . So we could both ride our own. It's a major undertaking, wd really wanted to go. Not do-able. We stopped talking about it on April 12, when I found out chemo and radiation were coming after 3 surgeries. So, yeah. If you have gone in the past, you have an idea of what you would be involved in. Big differences lie in factoring in where you camp or stay. Also the walking. The noise, and the available food. If you stay in one of the calmer camp grounds, and didn't venture far, it may be okay for you. But riding while fighting diahrrea or bone pain, is not fun. Just think it through. I have not gone very far this year, sometimes Wal-Mart is barely a something I want to manage. You and he need to have a realistic heart to heart. Depending on the location proximity maybe a day or two for just him? Trust me, i get it. It stinks. It hurts. My Harley is getting cobwebs and I hate it, but safety first. Last year we rode Needles Highway, and all the crazy curved mountainous switchbacks snd rode past buffalo I could touch. You must be at the top of your game, and then some to ride or even passenger in almost half a million motorcycles of every type, skill level, and descriptions. Saw accidents almost daily there and on the way there. It was thrilling, yes, but risk factors exist and you dont want to start the trip with built in ones against you. Iv had a cloud over my head with the date rapidly approaching, but other smaller jaunts seem more wise. Just my 2 cents. I hope for next year for Sturgis. I hope the same for you. Safety and health first. Planning for a fun time also helps keep your spirits up.",
      "MessageIndex": 813,
      "PostDate": "08/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 9, 2018 09:30AM Djt wrote: LIFE: ♥️",
      "MessageIndex": 817,
      "PostDate": "09/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 13, 2018 11:39AM Djt wrote: Hi ladies, so nice of you all to reply....Yes it's a bit better day by day, but wow, at times, it's like someone pulled the plug on my energy all at once. I love bedtime!, and I mean like 8 or 9 pm! No swollen ankles or feet, but my feet get sore easily. Took my grandson to camp this am, and I normally don't always use my handicap hangtag. Today I did as no spots were open near the trail where i walk him dow n. Omg, some dude dropping off his wife for work starts blowing his horn yelling at me out his window ...that its HIS spot. To get out, so on . I got out and calmly told him i have a hc hangtag. He kept on yelling, but was very able to pull up in a spot By the door to deliver his wife. She works there, i recognized her, she uses a wheelchair. But he actually was closer than my spot was. So when my grandson and I start walking down to the sign in pavilion, this creep is screaming at me that there is nothing wrong with me, that he videoed me walking, and got my plate number. ! I said Mr. Not everything is visible to the eye you dont know everything. Wow, it's all I can do tho just get my boy back asnd forth.",
      "MessageIndex": 867,
      "PostDate": "13/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 17, 2018 09:59AM Djt wrote: LIFE, sounds like great progress. I also start the anastrozole, as hormone pill in a few days. Hope no major SE from it. Did they talk about the possibility of hot flashes?",
      "MessageIndex": 893,
      "PostDate": "17/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 31, 2018 08:46AM Djt wrote: innab, I'm so glad for you! I hope you can get in a good rest time. Such a relief!",
      "MessageIndex": 1012,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 1, 2018 03:31PM Djt wrote: Hi Group and thanks to you ALL. I'm hoping this week is a good one for all of us, it's so crazy how fast the weeks can go but how slow the sise effects's go away, and how slow hair grows! I'm so impressed at everyone's strength, and all the ways everyone has to cope, deal, treat, and minimize all these hurdles. Lots of ideas and coping mechanisms here from you all!!!👍",
      "MessageIndex": 1033,
      "PostDate": "01/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 30, 2018 10:55AM Djt wrote: to all re HAIR. I have begun to use Rogaine as I read so much on thin hair while on Anastrazole..I have taken the hormone blocking pill for a month now, and my hair is trying to come in, but so dang slow! I am so excited to see the quarter inch fuzzy growing in, up close but then from a normal distance, i still see bald. I feel that as long as there is SOME alternative, i can deal. I have become accoustmed to my wigs, that they give me a feeling of security and normalcy. I can't discount how wonderfully made and affordable they are, don't fear the wig! 👍👍",
      "MessageIndex": 1274,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Oct 2, 2018 05:27PM Djt wrote: omg!! Innab....lmbo🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
      "MessageIndex": 1516,
      "PostDate": "02/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Oct 5, 2018 05:03PM Djt wrote: urdrago, sending get well, and heal quick wishes your way. I'm hoping the pain level is not bad, and you can look back on this step soon. Hugs girlfriend.",
      "MessageIndex": 1552,
      "PostDate": "05/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Djt wrote: I have only noticed posts that are several years old regarding wigs. So as it's my daily obsession right now, I thought we can share favorite wig sources, brands ideas, and so on. I cut my own hair off after my first chemo infusion, and I am now past my 2nd infusion. I have bought 2 wigs, well 4 actually, and returned 2 out of 4. I actually am having fun shopping for wigs, and realizing it doesn't have to break the bank. I have shopped at mainly Godiva secret wigs.com, and Tic, and hardcover. Please let me know how you are doing with your hair loss solutions. If you rock it bald, I envy you! I would cause great fear, accidents, and get bit by dogs and children if I went out bald. ♥️Deborah Dx 2/12/2018, DCIS/IDC, Right, 1cm, Stage IA, Grade 3, 0/4 nodes, ER+ Surgery 2/14/2018 Lumpectomy: Right; Lymph node removal: Right, Sentinel, Underarm/Axillary Chemotherapy 4/24/2018 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 20, 2018 04:02AM - edited May 20, 2018 04:40AM by Djt",
      "MessageIndex": 4,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 20, 2018 07:44AM - edited May 20, 2018 07:44AM by Djt Runcrb...thanks so much. FABULOUS pictures. You are so fortunate your hair grew back in completely...love the short new hair as it regrowth started. Yes, please post any and all thoughts and ideas. Thanks for the encouragement 😗♥",
      "MessageIndex": 12,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 31, 2018 07:41AM - edited Aug 31, 2018 07:42AM by Djt Moth.. GORGEOUS IS ALL I CAN SAY!!! good for you, fit you so well! Do you like RIP, or have tried others? Wow, stunning and so natural. I'm just now this week considering a Gabor wig similar in curl pattern but a bit shorter, called radiant beauty. I want blond also, but not sure which shade. What is this color you have....? Is it the marshmallow?",
      "MessageIndex": 28,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 7, 2018 07:19PM Djt wrote: Hi guys, moth, i had to laugh (in a good way) at your post. I agree with yellowb on a wig cap. Bet you can't possibly look 100, or even 50!!. Big difference. I prefer my headband type liner, makes the whole wig thing manageable. But try a few different types, it does away with itchy. Have you tried a low half ponytail while leaving side tendrils out? Taz does that in a lot of her longer styles. It does take a lot of practice to get the wig tailored to exactly your personality and best comfort level. IV been wearing a lace front mid length which always falls in forward in my face, i took to using small side clips and I kind of liked it. Then I got brave and cut bangs in it. Now I love It! Totally different and seems natural with the lace front. As far as I know, a lot of lace fronts come over wide, and have to be cut. It should be ok to trim, lots of you tube videos on this subject. I have been going to order the glue stuff, but have not yet, this band keeps the lace front in place pretty good.",
      "MessageIndex": 67,
      "PostDate": "07/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Oct 7, 2018 06:43PM Djt wrote: Moth, nice decision!! I watched Tax do that review and it looks beautiful. I hope it works for you, and you love it!",
      "MessageIndex": 83,
      "PostDate": "07/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 20, 2018 04:39AM Djt wrote: looks great, deb, I dread people asking me if it's a wig, but considering no one should ever have that statement come out of their mouth I guess I would have to consider the source as being challenged. I mainly am needing to get past my grandsons approval. 8 and 11.",
      "MessageIndex": 7,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 20, 2018 07:40AM Djt wrote: meg, thanks for sharing! I prefer synthetic also, and will look at Wilshire. Another thing to chec k thoroughly is a shop's return policy, especially the restocking fee. Godiva is kind in this regard. And talk about quick delivery. Cystereigs charges 40.00 to return. I hear you about youtube.com videos. There are hundreds. I particularly like the ones by Taz. She does a wide variety of wig brands, is very talanted, tons of ideas, and her mom also, is now a bc patient. Taz is donating time and wigs to bc patirnts. I like the ones by Danielle of Godiva also.",
      "MessageIndex": 11,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 8, 2018 10:25AM Djt wrote: Hi moth, yes i have watched Pattyspearls too, she is great. Im sorry you are having bad luck ordering, that is frustrating for sure. I am familiar with ROP Evanna! It is very youthful looking and pretty. Rose gold is my usual go to color too. Especially if its rooted. I hope you can find a suitable wig by the time your ID for school is taken. Have you ever checked out the American cancer society TIC shop? /www.tlcdirect.org. It looks like they ship outside of the US for a 10.00 fee plus their regular shipping. They offer tons of great stuff, plus low priced wigs. I have ordered several things from them with no issues andc quick delivery. Let me know how it goes.",
      "MessageIndex": 25,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 2, 2018 02:36AM Djt wrote: yellow, thats too bad that its a bit small. It looks really nice. Have you You tubed how to adjust straps and /or cut to make larger? I feel your pain as i measure at 23 and have to really research on line to find the right fit.",
      "MessageIndex": 48,
      "PostDate": "02/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Djt wrote: I have only noticed posts that are several years old regarding wigs. So as it's my daily obsession right now, I thought we can share favorite wig sources, brands ideas, and so on. I cut my own hair off after my first chemo infusion, and I am now past my 2nd infusion. I have bought 2 wigs, well 4 actually, and returned 2 out of 4. I actually am having fun shopping for wigs, and realizing it doesn't have to break the bank. I have shopped at mainly Godiva secret wigs.com, and Tic, and hardcover. Please let me know how you are doing with your hair loss solutions. If you rock it bald, I envy you! I would cause great fear, accidents, and get bit by dogs and children if I went out bald. ♥️Deborah Dx 2/12/2018, DCIS/IDC, Right, 1cm, Stage IA, Grade 3, 0/4 nodes, ER+ Surgery 2/14/2018 Lumpectomy: Right; Lymph node removal: Right, Sentinel, Underarm/Axillary Chemotherapy 4/24/2018 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "19/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 13, 2018 02:51PM - edited Apr 14, 2018 06:23PM by Djt also.. my mo only told me about having an iv. Nothing about a port as I'm reading here. Does everyone get one? I'm so confused about everything",
      "MessageIndex": 42,
      "PostDate": "13/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 15, 2018 01:21PM Djt wrote: lei, did your team, leave the port decision up to you, or ? Also have you just had the one treatment so far, they probably pick a new vein each TIME!",
      "MessageIndex": 61,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 18, 2018 09:04PM Djt wrote: duffysmom, me too, first is Tuesday the 24th. I'm sitting here tonight practicing wearing my new wig, I kind of like it....trying to figure out the icing issue. Meanwhile, tomorrow I go in for aspirations on affected breast, surgeon feels a blood clot has formed. I think it's helpful to know another person starting same day....So thank you for that",
      "MessageIndex": 90,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 24, 2018 09:10AM Djt wrote: duffysmom Thanks for the encouragement. May the force be with us tomorrow. I went with the 20 tips, packed a bag, got sweats and a tee shirt layed out, and ice bottles in the freezer for bottoms of feet ( nuropathy) dread it. I was not sure about how to chip the ice...So the ice maker sounds interesting.i may try blender in the a.m. I actually had an idea today.. I washed some grapes, and halved them, put in a container to freeze them. They may work in place of small ice chips, blueberries too. I'm to arrive at 12 30, infusion at 2 00...So hoping my cooler hold things frozen that long. My significant other is telling me I'm overthinking it, and the center will have ice. But I have to be proactive. Took the RX 2 times today of the steroids, and walked my 2 miles. I have lots of biotene, and found some mouth lozenges to keep in mouth as you fall asleep, called Oracoat Zylimelts. Especially for dry CHEMO mouth. A lip butter highly recommended by another site called Korres (Amazon), and some hand cream by FirstAidReady, called ultra repair cream, antacids, Kleenex, Imodium, etc. I'm going to do this , We are doing this. And, This to, shall pass. Please let me know how you do.",
      "MessageIndex": 138,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 26, 2018 01:09AM Djt wrote: duffysmom, on your tummy.!....Mine is on my arm. Goes in at 7 tonight, goin out for my walk shortly. Nice you have your doggy, mine died about 5 years ago, sure miss her.. yes im aiming for my water in 21 ounce jugs, one morning, afternoon, and evening. Eliz the nurse said it's the taxols to ice for, but I started a bit early, and continued, also sucked on shaved ice, and frozen grapes, used biotene at home often. Best to you and Maggie.",
      "MessageIndex": 160,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 28, 2018 09:03PM Djt wrote: hi encore, welcome and thanks to you about jolly ranchers, I may try them. I ate some toasted cinimmon raisin bread with butter tonight, and it was the food of the gods!",
      "MessageIndex": 194,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 2, 2018 07:51PM Djt wrote: FD..WELCOME WELCOME. I wish it were under different circumstances. I also had my first chemo on April 24. This thread is a lifeline of encouragement, the ladies here are so genuine and kind. The teeth issue. I bought a pack of toothbrushes at the dollar store, pk of 5 soft. I bought a new water pick set up with all the attachments, including tongue brushes. I bought Biotine [store brand is fine]. And a new box of toothpaste. I also bought tablets that are able to hydrate, even in mouth as you fall asleep. They are called Zylimelts made by Oracoat. Keeping mouth hydrated is key to keeping teeth healthy. Trade out brush weekly, try Biotene toothpaste too. Great stuff. GO gently, and rinse with baking soda and salt with very warm water as often as possible. Of course, your dentist is your go to professional, but these are what helps me. I rinse with a small mouthful of Biotine every time I visit the bathroom. Best, Deborah",
      "MessageIndex": 227,
      "PostDate": "02/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 4, 2018 08:51AM Djt wrote: duffymom....so sorry this has been so very rough for you. If you are off Imodium, do they feel the new RX for possible cdiff will curb it? I found. YoGI ginger tea, but, mmmmehh, it's ok, not great.. Hope all have a decent day. Engine, hope the wife is doing ok.",
      "MessageIndex": 252,
      "PostDate": "04/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 7, 2018 05:44PM Djt wrote: hello Linda, hi group, we seem to be in various stages of moods, and how we feel....but we are all a day further through this journey. Frog, so glad you are getting past the D. Today has been an amazing day for me, got in a good walk, ate lunch at Chili's with my guy, and feel almost normal. It is the first day i wore my wig out. I think its okay!! Hi even got some sqhair bands to go with it. I have found www.cysterwigs.com a great site. I cut off my hair last night. So not bald yet, but 2 inch hair. Maybe little by little is best. Linda, cry, grieve, and just be you. Sooner or later, I think it gets a bit better.somehow we mentally adjust. I pray so for you too. I have my 2nd treatment a week from tomorrow. I dread it, and look forward to crossing it off the countdown at the same time. I still find water tastes bad somehow, but I don't feel as scared when I go to bed .",
      "MessageIndex": 288,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 10, 2018 01:03PM Djt wrote: duffysmom, adorable. Love it. I'm already wearing a sleep cap to bEd, soft and comforting. I cut my own hair down to a boy cut, and the rest is exiting rapidly. I'm obsessed with YouTube wig reviews, and sqhair bands and Godivasecret wigs. I'm amazed, and excited that one can purchase a very well made, lace front, mono part wig for a decent price! Good luck tonight, it will be OKAY.",
      "MessageIndex": 309,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 13, 2018 02:57PM Djt wrote: Lleli, duffysm, engines wife, Dee....hope all of you can enjoy mom's day the best we can. I know we all are different phases of this journey, and all are go to push through to a better tomorrow. Carpe diem. I heard from 2 out of 3 kids, so I'm happy for that. My other half wanted to go out to breakfast ....mornings are not stable for my stomach..but we went. Omg, the restaurant was beyond packed with mom celebratory going on, we were shoved into a tiny corner, I started to feel hot and ill, got down a piece of toast and half cup of coffee before off to the bathroom. Back home, and I did manage a 1.25 mile walk. So it's a successful day. Hugs to Engines wife, and to all ...Blessings. Deborah.",
      "MessageIndex": 320,
      "PostDate": "13/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 14, 2018 07:25PM - edited May 14, 2018 07:27PM by Djt FD, Deb, I agree, I don't want the sad looks, the glances at my breasts, and hair. I have told my immediate family . period, for this reason. Yes, as you and Duffysmom mentioned, the activia with probiotics helps. It just always seems up to about noon, my guts are cramping, rolling, and im 5 feet from the bathroom. That should prove a challenge in the am, as my 2nd treatment starts at 9 00 am. Yikes. Imodium, I guess. My honey and I are planning on a slow week after tomorrow, it helps to have some idea of how the first infusion went. I have a couple of good books and magazines on hand, teas, sugar free hard candy, soups, ice, and my fav cosmetic creams for dry skin. I love Cera've hydrating cream. I plan on forgoing my pricy wig while im vegging out on sofa, so i have some soft bamboo knit caps for the worse days. I read bamboo material has antibacterial properties for chemo patients bald heads. Best to tomorrow treatment ladies ..FD duffysmom. Dee And I hope I'm not forgetting anyone. Frog, keep on keeping on. Avoid crowds, and my onco nurse stressed hand washing like crazy. I am in the habit of scrubbing each time I go anywhere. What about flu shot? Hope forr us all to be strong, have nurses who get the job done on first try, and sunshine. ☀️♥️☀️♥️☀️♥️Deborah",
      "MessageIndex": 330,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 16, 2018 11:39AM Djt wrote: hi everyone, and new names here today. Had 2nd infusion this am, went well except the IV blead all over, something happened, jnurse told me not to look! After all was cleaned, it went smoothly, iced feet, hands, and ate ice shavings, it helped the first time, hope this time two. Told Dr. I had not slept all night sue to steroids, so his is dropping them off my pre meds. Yeah. Got some tablets to avoid get to mg thrush this time. Hope all others who had treatment today got though it okay. Deborah.",
      "MessageIndex": 351,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 20, 2018 01:43AM Djt wrote: Hello to all, and welcome (but also sorry) to the new posters. Hope Saturday is a good day for everyone. I have found that Claritin with 2 ibuprofen makes the Neulasta bone pain diminish to about 0. I take b12 and b4 daily, and believe it can't hurt, and can maybe help. Dee, have you tried carbs, like toast, crackers, etc. With butter? That is about the only thing that taste real and good to me. I have just accepted that for those first 8 to 10 days, food is a minimal enjoyment, but if does improve. The foods I liked the first round, I can't bear to even think about now. But a cup of coffee is going down good, for that I'm thankful! MARIE, nail beds, have you iced your nails during infusions? I think that is a preventative to nail problems, best to you. I am doing the hands and feet icing for that, and for neuropathy prevention, and so far, so good. I take a Xanax to sleep through the night, so helpful. But last night I woke up drenched in sweat, a new one for me. I tend to think at day 5, its my body ridding itself of chemicals. Who knows tho. Hoping everyone's blahs and issues are minimal today, hugs and positive thoughts to ALL☀️☀️☀️🎀🎀🎀 Deborah",
      "MessageIndex": 392,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 21, 2018 04:06PM Djt wrote: Duffy, so awfully sorry your little guy has become so ill! I know first hand how much they mean to us, and how our hearts hurt when they do. Prayers.",
      "MessageIndex": 411,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 24, 2018 12:47PM Djt wrote: wife of Engine...so sorry. Thats is sxary. I have an appointment in the morning with my breast surgeon as follow up to having 2 aspirations on lumpectomy breast. I feel like something is goin on again, sore under arm, breast tender, when it wasn't . Will th is be needle drainage number 3? Will it ever all drain? Having a sore throat again. Duffys mom, I hear you on the gut issues, Me too. Never know what the day will bring. Kind of glad I'm incognito mode in the wigs, as I never know where or when I may have a massive gas explosion, or worse. ( sorry if TMI) But I'm still kind of laughing, or maybe it's crying..not quite sure.",
      "MessageIndex": 447,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 27, 2018 06:16AM - edited May 27, 2018 06:17AM by Djt Dee and Inna, I find it very interesting about your comments on privacy, and 'handling. \" I also, am very private, introverted and unable to say much to others re my medical stuff. I lost my tolerance to be a \"good patient\" at a young age after years and years of heart issues, surgeries, and related hospital stays.from childhood on it became a big issue for me to even go to the Dr. For anything. I remember being in cardiac ICU one time, and with no warning, the entire group of approx 22 interns and a couple Dr.s come strolling to my bed discussing my STATS like I was a non existing piece of warped furniture. Never addressed me as a human being. That twisted me up. I could related 10 more stories, but suffice it to say, I hate Dr, visits, exams and anyone even touching me. I got to the point that one time in ICU, I removed my own IV, and called a cab and left, as I could get no one to get me a (allowed ) drink of water. Wow, that got big attention. At a stress test on the treadmill, I told them when I had to stop, (I was told to let them know!) And they kept go in and sped the thing up. I pushed the Dr. Out of the way to jump off. I was told I had a panic attack. Uh, no. I'm the patient here, and you did not listen to me, THE PATIENT! So the cancer thing, well, I'm older and wiser, and I have a good team, but damn. I want to be left alone. No, thanks I don't want the shadowing new face of each intern to grop my mutilated tit every time im in for a visit. I have told no one but my sisters, and 2 children of my dx, I just don't want the fallout, because I won't be nice.",
      "MessageIndex": 477,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 5, 2018 10:37PM Djt wrote: ok, here we go...today, TC infusion #3. No sleep, something about the night before twists me up so bad. Ah, and this two shall pass. Best to all others heading in today as well. Deborah",
      "MessageIndex": 550,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 6, 2018 09:44AM Djt wrote: I feel the new test, TAILORx is still inconclusive, with a big gap in the middle still not explained and not very straight forward. My onco number was 28, so j guess I would have still needed chemo regardless. But my onco Dr. Told me with the 4 dose TC my number would then be like 14. Significantly lower. So does this change with this new study? I find it alarming and confusing that with this just out my clinic is not bringing it up, or offering new stats. And related information. So hope all went well for others in treatment today....Duffysmom? Frog, I still haved one to go on June 26, today was fine, blood labs good, glucose good, the IV was problematic, hurt like a mother, first time that happened. The nurse seemed displeased that I was quiet and reserved. I had been up most of the night before and I'm not one to put a pretty face on a sows ear if you get my drift. I just cant pretend im sitting at the state fair eating cotton candy watching a circus. I'm polite, but withdrawn. Maybe she just rammed it in . We ate a sandwich lunch, and i had No reactions to meds, , got a refill on my Xanax, so I can. Sleep. Neulasta pump boarded and loaded for tomorrow. Hope you ALL are well, tasting, eating, smiling and pain free. Deborah",
      "MessageIndex": 560,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 11, 2018 05:51AM Djt wrote: Dee, I'm so glad for you that your FLMA is moving ahead. I hope I understand correctly you will only have to work 1 or 2 days a week. That's fabulous. Engine, sounds like the cake with your mom was a wonderful decision, hope wife is continuing to improve. GA Warrior, Life and Frog...are you taking any B vitamins for nails also? I just started to nail polish with dark colors, but have been astounded my nails have not been affected (yet) and they are growing good too. I swear that sublingual 10,000 mcg of b12 does it. I also ice hands and feet every chemo. Eating is so so, but drinking is a problem for me. Cold icy water sounds so good, but taste so bad. I don't li ke soda, but even resorted to try that. Mimics rust corrosion. Orange juice is ok, but has so much sugar, I'm limited ....idk. cheeseburgers are my go to for protein, and fudgescicles fill in the rest. Hope everyone's Sunday had some good moments, and some sunshine.",
      "MessageIndex": 603,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 25, 2018 04:16PM Djt wrote: Hi friends, one and all...it's been a while for me on here. So very distressing to see all your wife and you have endured Engine. I hope now you can get the rest and relief you both need ....your wife has endured so much. And that it's uphill now for her. Hope everyone had a decent weekend and continuing to put one foot in front of the other the best way possible. Looking for those little rays of sunny moments in each day. Saturday, I took my grandson to see the new Dispicible2 movie, for just a few minutes he lays his 11 year old head on my shoulder, just us, just a quick snuggle. Wow, what a sunny moment that gave me. It's the little things......  So my last chemo is tomorrow morning. I pray my blood counts are okay to go through it. My other Dr. In my team, called already to set me up for my radiation itinerarie on this Thurstay, talk about not missing a beat! Pushing ahead, but I think they said a month off before first radiation. Still have to find out about the hormone blocking pill for 5 or 10 years, it has yet to be discussed. To all of my cohorts from April's starting point, hang in there, praying and good wishes for you ALL. Deborah",
      "MessageIndex": 709,
      "PostDate": "25/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 27, 2018 09:43AM Djt wrote: GAwarrior, Duffysmom, thanks for the kind words, it means a lot. I appreciate and identify with you all. But my cloudy mind has a hard time following and remembering who wrote what, not that that takes away from how much all your posts help and illuminate my days. You are all important to me. This is an amazing group. Engine, i don't know if this may help, but a few years ago, not related to camcer, but I had a horrific spell of constipation..so bad it led to hemmoriods, and severe pain. I finally tried prune juice, warmed up good in the microwave. A good 8 to 10 oz. A couple times a day. , And a small walk after each dose. Also eat real oatmeal same day. Pure fiber. This procedure helped me a lot. Prayers, hugs, and, much sincere appreciation to all here.🎀🎀🌸🌸🎀🎀 Deborah",
      "MessageIndex": 721,
      "PostDate": "27/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 4, 2018 09:13AM Djt wrote: Now that I'm a week past my last chemo, I'm wondering if others have had the basic repeated SE each time, or a smorgasbord of variety? The 1 thing that messed me up for all sessions was thrush. Each time within 3 days I got it. It would be simple enough to have just the nasty mouth, but it always dripped into throat, then caused gastritis, then diahrrea. Taking the 2 different forms of nystatin works after a week but one of nystatin's SE is also diahrrea. I can't wait to have some kind of normal taste buds again, and live more than 5 feet from the toilet! Hoping this group is having something nice to do on the 4th, and can enjoy the DAY Deborah",
      "MessageIndex": 778,
      "PostDate": "04/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 10, 2018 06:58AM Djt wrote: since finishing my last chemo, TC, my vision has been quite blurry, and my eyes water constantly. I look like I'm crying. I sure hope this passes, has any one else had similar? Today I felt I shouldnt even be driving, it was really bad. Idk.",
      "MessageIndex": 830,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 12, 2018 11:13AM Djt wrote: How are others dealing with or experiencing general tiredness, if done with chemo? I'm 2 weeks past last infusion, still very limited on energy. I'm able to get my grandson back and forth to da y camp, pack his lunch, etc, snd do a load of laundry. Other than that and maybe a store or 2, I'm beat. maybe that's normal, idk? I push myself by early evening to move enough to prep dinner, and do ordinary stuff, by 8pm, I'm done!",
      "MessageIndex": 855,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 12, 2018 03:21PM Djt wrote: Thanks, Dee and Ingerp.....yes i tend to push, rather than listen to my body. I want to find the old me, so I keep trying harder. But, yes i think i will give in to naps and rest time. I do believe I have been getting a bit more able, each day. Slow, very slow, but sure. Dee, i understand the catch your breath thing, that's me after any stairs, from doing laundry. But, if I look back to days on the sofa, this is definitely better. 🏵🏵🏵",
      "MessageIndex": 859,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 13, 2018 12:07PM Djt wrote: Thanks, Engine. I so agree, the climate of confrontation is a dangerous climb to violence. The main thing here, is that it's a children's camp, no place for acting a fool. My significant other has one leg. He uses his prosthesis well, but some days are better than others. You would not believe the dirty stares he gets, until he gets out and then people can actually visually see the leg. If only people could assume with kindness, not judge with anger. Hope you both have a SE FREE weekend.",
      "MessageIndex": 870,
      "PostDate": "13/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 20, 2018 05:49PM Djt wrote: LIFE and DEBAL, well that's 3 of us on anesterzol, i was told nothing of zomeda, not soy products! They did not say if it's 5 or 10 years either. I get really tired of tbed downplaying, and the springing of surprises, I have had a few heavy duty night sweats a c hot flashes from chemo itself, but only a few times. Deb, I'm so glad to hear your report that it's going well. I'm not looking forward to more issues with the pill after all this other stuff is done. My oncologist neverf mentioned bone pain either. I asn scheduled for a bone scan next week to determine if I have healthy bones now at th e beginning of this hormone pill. Life, i also take a morning thyroid pill, so taking it at night sounds like a plan for men too,. I start it next week. My sister told me that thatf drug causes thinning hair!!! So yeah, how about i have no hair going to thin hair!, i wonder if that is due to the actual pill, or the intentional decrease in estrogen? ",
      "MessageIndex": 925,
      "PostDate": "20/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 24, 2018 07:44PM Djt wrote: FDwithfurkids, glad your on vaca!! Rough day with the irrigation fix, but amidst your discomfort, i read lots of smiling satisfaction in a job well done, especially with your mom . Hope the rest of your time is calmer and fun! Best on those test results.",
      "MessageIndex": 963,
      "PostDate": "24/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 24, 2018 08:05PM - edited Jul 24, 2018 08:42PM by Djt Deb, Ingerp,GAW, and Engine...thankyou all for you kind words, and suggestions. Very helpful. All, I wanted to say I looked waaay back, at us all, Remember? April group. We have all come so far. I like engines motto about looking at all the way we have traveled, and its a long way indeed. We came through bouts of diahrrea, not being able to sip water, and what pill does what, calling in our problems to our mo's, and fighting our way from one day to the next....our weaknesses have started to turn around! To you ladies still facing surgery, i can't imaging how scary it must seem. That's what has consistently scared me the most...all the \"firsts\". I know you can and WILL do it, and do it famously. A good friend of. Mine found she had cancer in both breasts, she found out, as she had spotted blood, as she breast fed her newborn daughter. She was 28. Having a new born and a 5 year old, also as a single mom who just got her own business off the ground! She had a double mastectomy, intense chemo 2xs and radiation. She never lost her smile, or her push forward. I remember bringing her family a meal when she was released after her mastectomy, and she was puttering around the kitchen! Drains, and newborn and all on her own. This girl is now 5 years past that eventful day, cancer free and loving every day of her life. I think of her daily, as I don't think I had half her strength through my lesser battle, at twice her age. anyway, we all somehow, someway, get through the daily challenges of this bump in our road. Just sharing. Have a good rest of this week. ",
      "MessageIndex": 964,
      "PostDate": "24/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 8, 2018 10:02PM Djt wrote: FDwithfurkids, i can't read xrays, but the 2nd scan looks very cleaned up of anything bad that was in the first one, that was not supposed to be there. That is such very very good news for you!! Wow, your treatments worked AMAZINGLY!!! Congrats on getting to this better place. 👍👍",
      "MessageIndex": 1079,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 17, 2018 11:27AM - edited Aug 17, 2018 02:16PM by Djt So glad for you ladies with new hair growth! Life you are a brave chic. IV got about a quarter of an inch of silvery whiteish blond fuzz coming through. I can see it clearly, but still feel very bald, as I can still see shiny head too, GAW, go to know you 're on a positive roll! Urdrago, looking good, i got that on top, but not sides yet. Congrats on getting to one more to go, that's awesome. Duffys mom, enjoy that coffee, i know just what you mean! Engine, i just have been on antibiotics for Uti, not fun, glad Janice is mending a bit more. Hang in there, janice is so fortunate to have you in her corner. Innab, hoping the itching has calmed down, and your pain RXis helping. Frog, hope each new day improves for you too. I'm more than half way through radiation, posting on that page with some of you also. ♥️♥️♥️ to all.",
      "MessageIndex": 1164,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 27, 2018 05:26PM Djt wrote: Deb al, i just saw your picture!!! Holy Moly girl that's amazing. I have just an overall whitish duck fuzz, and can still clearly see scalp! Are you taking any supplement for It? but wish I had your growth!! That's amazing!",
      "MessageIndex": 1253,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 27, 2018 05:28PM Djt wrote: Wweede!! Congratulations!! That's just Great!!👍👍👍never heard of that trial. What is it for?",
      "MessageIndex": 1254,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 12, 2018 02:54PM Djt wrote: LIFE, did I get it right that TODAY IS YOUR BIRTHDAY? I can't hug you from here, but big cyberspace hugs and best wishes!!! Hope the day is as special as you are!🎂🎂🎂",
      "MessageIndex": 1372,
      "PostDate": "12/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 14, 2018 08:18PM Djt wrote: Linda, that is great news for you. Heal well, i hope your discomfort fades soon. It's amazing what just a few days can change thngs too.",
      "MessageIndex": 1394,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 26, 2018 05:09PM Djt wrote: I wanted to drop in and say hello to everyone. I'm trying to catch up on this thread, and a few others. I feel like I've been away from home! I think of everyone here, and pray for all daily. I know we fight the fight daily, and some days are better than others. I hope this fall season is relaxing and healing to all here🎃🎃🎃",
      "MessageIndex": 1470,
      "PostDate": "26/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 27, 2018 07:19PM - edited Sep 27, 2018 07:23PM by Djt engine, I hope Janice gets to the bottom of this constant draining issue soon. It must be so worrisome for you both. Prayers for you both. Hope IT improves soon. Duffy, so glad you are getting to the end soon. Hang in. There! I read a lot on hair growth online, but i think other than biotin and Rogaine, not much else can really work. But each day new stuff surfaces, so we can hope. Hi to all !! This hair deal is just crazy stuff. I remember a movie from a million years ago, it was a war movie, with Sophia Loren. For some unremembered reason she and other women had their heads shaved as a mark of dissapproval of some kimd. I must have been a small kid, but remember the horror i felt. We as women are just born with a love of our locks!! Im glad for my little brush cut, rather have that than cancer, but its hard on us!! The whole world expects all women to have hair, beautiful hair. But we here are ALIVE. SO IT IS WHAT IS, AT least for today amd tomorrow. And it's ok. It's ok.",
      "MessageIndex": 1487,
      "PostDate": "27/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Oct 2, 2018 08:05PM Djt wrote: oh my goodness, how crazy is it to come here to laugh!!!! Thanks all. Duffy wow, you are done tomorrow? Great!!!",
      "MessageIndex": 1521,
      "PostDate": "02/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Oct 2, 2018 08:10PM Djt wrote: notered I didn't see your post being referred to here, but im sorry your feeling bad. When it was pretty bad at one point during radiation treatment my dr. Suggested putting me in touch with their social dept for counseling, and some helpful referrals. maybe yours offers help?",
      "MessageIndex": 1522,
      "PostDate": "02/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 13, 2018 02:44PM - edited Apr 14, 2018 07:18PM by Djt hi and thank you all for your incite, bravery, and sharing. So I had a spot on my mammo screening on 1.25.18...and so it went. Biopsy,, lumpectomy, on 2.14.18 and then a second re excision for clear margins on 3.12.18, surgeon said yes, clear margins, and she removed all cancer. I expected radiation and the hormonal pill , but got the wind knocked out of me yesterday. My ONCOl score is 28, so CHEMO was recommended. I'm 64. Scared to heaven and back. Dr. Said it's low dose, short term. Does anything make it sound better? So I'm having a nine week course of TC 4 infusions one every 3 weeks. I have made an appointment for a wig consultation, don't want to scare my grandsons. Not sure of first appointment date. You know what I AM very concerned about out t, is my teeth. If spent a fortune through the years on them. Does anyone know if I run the risk of losing teeth or if these are affected? I am still in shock at the CHEMO, surgeon did not think I would need it. But I guess I have to do this....thank you all for embracing me into our journey and I. Hope the best for all.",
      "MessageIndex": 41,
      "PostDate": "13/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 14, 2018 06:35PM - edited Apr 14, 2018 06:52PM by Djt Weeeeddie, your post has given me some in site and hope. Thank you. Sounds like you managed well. To hear you say it's do able it means a lot, but you are prob younger than me. What are you doin about hair loss? If u care to share it. ♡♡",
      "MessageIndex": 51,
      "PostDate": "14/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 14, 2018 07:33PM Djt wrote: hi Leli, thanks for connecting. My oncologist only said IV, not port, so for a 4 time situation, I hope to not have it, like you. Are you going with a wig, or? Blessings sister. Hope your not getting too ill, stay in touch plz.",
      "MessageIndex": 54,
      "PostDate": "14/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 15, 2018 01:12PM Djt wrote: leli, that is amazing you are back to the gym, and sound positive, THANK you for sharing that. I'm a walker, and enjoy outdoor walk in, also on treadmill at gym. I want to continue that, if its about all I can do.  K Susan, thanks for this info, I feel there is a lot of facts not shared at the start of this journey when signing into it. By Drs. Of course, I'm the type that has to know about every little thimg...",
      "MessageIndex": 60,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 15, 2018 01:37PM Djt wrote: Susan, how have your side effects been so far?",
      "MessageIndex": 64,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 19, 2018 10:46AM Djt wrote: So everyone..,.tell me the routine for the baking soda rinse plz...how much, how long, when? Is it with warm water and salt?",
      "MessageIndex": 94,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 24, 2018 09:52AM Djt wrote: duffysmom, 24th, tomorrow! Thank you friend. I appreciate that. I am very much on it with the teeth, mouth thing..got biotine, a, new water flosser, so on. Wow, I'm nervous.",
      "MessageIndex": 143,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 26, 2018 03:43AM - edited Apr 26, 2018 11:18PM by Djt lei and Maggie, I just posted this under 60 and over on here last night! About the yogurt. Yes, yes and yes. It Ts a great boost to overall gut health. I make it a meal with sunflower seeds and about a small handful of blueberries. Just finished it in fact. Adds protein calcium and is low sugar. Another note....I found a couple of items I wanted to share, for the dryness CHEMO creates in the skin, I'm using - Neutrogena ultra gentle hydrating cleaner. CreaVe skin renewing Cream Serum Simple hydrating gel cream and Korres lip butter. All very affordable, and I got thru Amazon. Also, if interested, I ordered E. I. f. Eyebrow kit and pencil. Looks promising, her inexpensive, hope it works.",
      "MessageIndex": 165,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 26, 2018 11:16PM - edited Apr 26, 2018 11:42PM by Djt weeedie, 1/2 through is fabulous, I'm 1 down 3 to go. Exhausted is ok, sleep it off, my se are also MINIMAL, metallic taste and restless is about it... I'm on day 3. Hope your up and about soon.  Happy Thursday to all you friends here, we can and WILL do this. ☀️☀️☀️",
      "MessageIndex": 171,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 28, 2018 08:32AM - edited Apr 28, 2018 09:31AM by Djt astyan...yes, thank you. My only solid food yesterday was a half an English muffin with peanut butter. I hope to God this awful tastes fades. I made my other half meatballs and sauce and tasted it....,,holy moly.... my Italian cooking skills are on hold for sure",
      "MessageIndex": 187,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 30, 2018 05:00PM Djt wrote: hi all....hoping that today...day 7 may turn o ut a bit better. But I woke up to total white tongue, sore throat and diahrrea. Nurses said it's thrush, liquid nystatin, and swallow after swishing. Again taste. ,,....wow horrible. At least sleeping whole night ..Best ladies.",
      "MessageIndex": 203,
      "PostDate": "30/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 1, 2018 08:16PM Djt wrote: duffysmom, I'm glad for you that Duffy is back home with you, I'm sure it's a great comfort to have him by your side. So awful about diarrhea...,it got to improve sometime...have you. tried the BRAT diet? Bananas, rice, apples. Toast ? I know, I don't like to go out much any more either.",
      "MessageIndex": 215,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 2, 2018 07:36PM Djt wrote: duffysmom, wow so sorry. I got the diahrrea back a bit, but not quite that bad. Today I had a follow up appointment on my lumpectomy breast, as it had to be drained of a hematoma 2 weeks ago. ...So we actually went out to breakfast early this am, and I delibratly took Imodium early am. Ate a half way normal breakfast. ALL HELL STARTS TO BREAK LOOSE ....big time stomach cramps and diahrrea... it like my guts were saying, \"ok you think your smart taking Imodium , hey, I'll show you!!!\" an hour later, almost late leaving house for surgeon appointment. Can't get off toilet......I run to grasp purse to leave, phone rings...Drs. office, \" are you on your way, because we can move up your appointment slot, as we just had a cancellation...\"?? Oh yeah, I'm hurrying...my other half drives like a bat out of hell.... gets me there in record time.... I have to run to bathroom while he signs me in..... I open Drs. Door back up to re enter, and nurse is calling my name..all heads turn..omg. I go in ....i lost 5 pounds since 24th. Get in exam room, whoops, run to the, bathroom, AGAIN,. I think im going to die of this stress and stomach was crampimg like a baby wanting out!!! I run back to exam room, get in gown figuring ....quick visit, no biggie. RIGHT. Dr. Says I need to do another Aspiration on breast. And she has an intern with her. A big great big guy, I didn't know.... him, dr., and nurse in tiny treatment room for a mini surgery... Lay down stomach sounding and acting like mount Vesuvius.....needle, aspiration. Done. Check out at counter. Grab Mike's arm... Get me out of here... oh wait, I got to go to the bathroom.",
      "MessageIndex": 226,
      "PostDate": "02/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 17, 2018 04:45AM - edited May 17, 2018 04:46AM by Djt Hi all, glad to read it's all mainly positive for everyone At least TODAY! As we all know it's a daily battle, but, we are further ahead today than yesterday. Duffys mom, do you keep a steady ice chip intake during entire infusion? That , imo, helps keep down mouth ssores. They are so annoyimg. My Neulasta pump will be going off in a few hours, and I'm going to take claritin at that time. Yes, I agree with you ALL, keeping ahead of it is key. Took my walk today, and downing the water as day after infusion. I'm even kind of use to the wig. Carpe Diem all, and best. DEBORAH",
      "MessageIndex": 365,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 17, 2018 07:55AM Djt wrote: thanks, Maggie. My Neulasta patch just activated and I took my first claritin, I may use a Xanax this time too! Or call onco for other. Good info thanks. Thanks Deb and Duffysmom for joining in. Maybe the extra hydrating is key, , I do walk daily as well, it does help the whole picture. I have some harder pain meds from the 2 lumpectomy s, but feel like my drug line up is just getting to intense! We'll see I guess by tomorrow. Thanks guys",
      "MessageIndex": 371,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 21, 2018 05:07AM - edited May 21, 2018 05:09AM by Djt GAWarrior, wishing you the very best for upcoming Tuesdays treatment. Thinking past it, to better times a waiting can help. I just booked us a little fall vaca in a cottage on the water in mid coast Maine, in October when the waves will be wild, the air clean, the trees scarlet, and the crowds gone. It has a fireplace, a screened in porch, and the tide comes into the very steps. Can't wait. I don't drink too much coffee, but, yes, the acid can affect bady functions, I agree. The mouth thing isn't sores, I've been blessed with no sores, but a film, of coating that can creep down the throat making it sore, and even progressing to stomicitis. It a form of yeast infection. I think it's under control I hope. I have not called my triage nurse line once this time! Time is moving on, and this too, shall pass",
      "MessageIndex": 400,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 27, 2018 05:55AM Djt wrote: wow, everyone, i had to read a lot to catch up..... so much going on with everyone. Thanks to all for your concern, I don't have anything to complain about, especially in comparison to many of you. My Dr. Appointment revealed a lot of scar tissue growing in breast, toward the lymph nodes, and dr. said no nothing to worry about. There is still some fluid build up in breast, but she wants to wait to see if it reabsorbs into the body by the time I do radiation. All in all not a bad few days, I even cut the lawn, and did other housework. Engine, I hope you guys have seen the last of the ER for a long while. Best to your wife for some long awaited smooth sailing. I really wish a lovely weekend for all here.",
      "MessageIndex": 476,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 7, 2018 02:58AM Djt wrote: thanks, Leil, I can try that. I put a call in to the nurse as I never got this before. It's only on my arms, and I don't know it's it really hives,...it's red blotchy marks. Hydrocortisone did not help.",
      "MessageIndex": 569,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 11, 2018 10:11PM Djt wrote: thank you, got to work on the hydrating big time today, nose bleeds from dryness. Some flat soda does work, i may go back to tea also.  Hope all have a positive week.",
      "MessageIndex": 609,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jun 27, 2018 09:23AM Djt wrote: Di356...I also was prescribed the steroids the day before and the day after my chemo, 2x a day. On the day of, it was given intravenously. After 2 times of being so wired up and. No sleep before my treatment , my dr. Took me right off them, other than tne dose in the IV for day of, pre meds. Much better.",
      "MessageIndex": 720,
      "PostDate": "27/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 2, 2018 11:24AM Djt wrote: Frog, so very happy the results was benign, so sorry you had to revisit that kind of terror and anguish. You are strong,hope you are looking forward to good days with your family fun gymnastics, kids,... enjoy and relax. Deborah",
      "MessageIndex": 763,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 2, 2018 08:24PM Djt wrote: thanks and hello ladies, and Engine. A quick share on eyebrow makeup as long as it's being discussed....I had bought the very inexpensive ELF brow kit, (contains a pomade ,dip type dense creame, and a lighter setting powder) and found the idea and concept good, but the little applier wand ineffective. So I tried using an eyebroW brush (the long kind with one side a little brush, and the other a tiny comb, also by ELF, 1.00) i rubbed the brush across the brow pomade and just lightly combed over my very lightly existing brow. Then use the setting powder with the original little wand in the kit. Perfect, very real and great color, no rub off. Total cost $4.00. Best to all.",
      "MessageIndex": 770,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 10, 2018 05:29AM - edited Jul 10, 2018 07:02AM by Djt Hi Molly. I got your 2nd choice, although it was what was singularly offered. I was concerned regarding heart issues, as I have been on heart meds for years and have had heart surgery myself. My oncologist told me the TC was not going to affect or exacerbate heart issues or cause any. I just finished my 4th TC, with no heart issues. Would going to another onco for a 2nd opinion help you? I agree that some cardio helps immensely. Best to you. Deborah",
      "MessageIndex": 829,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 10, 2018 09:14AM - edited Jul 10, 2018 09:53AM by Djt thanks Engine and GAW on the info on eyes, i just hope it goes away soon. I dont have post nasal drip, more like dried out nasal passages. But good to know there are drops if it continues, it's like I can't focus my eyes, hate that. Wow, on another note, was having a great night. Pizza and movie with my grandson, phone rings, i see Drs. Office number, so grab it up, wish I didn't. Nurse navigation...\".do i need a counselor, a support group.? Is there anything I ca n do\" I knows it's their job, and all ..but what I need is to forget this filth for a little bit!,, to feel like a normal human being, to be GRANDMA again, not a patient, not a sick person!,, she ruined my mood. Sorry, rant ranted.",
      "MessageIndex": 834,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Jul 30, 2018 01:39AM Djt wrote: Hi Group, I'm hoping the weekend is going as well as possible for you all, sorry Engine, you do have your hands full, and I'm hoping Janice continue to get through this without more setbacks, and the dog is better too. Innab and Dee, hope you have a much better week coming up, rest and it WILL get moving in thed rightf direction, hugs. Life, i hope the neuropathy is temporary. I had none during chemo, but now have a sense of numbness in my left foot at times. Duffy, you are getting there!!! Ingerp, and GAW hope your weekend had been positive and reviving, it's beautiful weather here in N.Y. right now. I had a major (to me on a personal level) accomplishment this weekend. After it being parked and unused all this year ,I got out on my Harley yesterday. I was nervous about my level of strength, but I rode an amazing 17 miles, my s.o. rode his behind me for a back up, but it went so well, felt like I was me again, just for a while I could forget all the other stuff. I know most all here may not like, believe in, or care about motorcycle riding, and that's OKAY, but it was a big day for me and I wanted to share with my group. Happy Sunday and a good Sunday to you all. Deborah",
      "MessageIndex": 1001,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 6, 2018 10:45PM Djt wrote: Debal, thinking of you as I know your surgery is in a day or so. Stay strong and best wis hes. Maggis,you as well, hope to hear how youboth are soon after. GAW, you are sounding strong, glad for you, nice that you some friend sharing time. Hi Life, hang in there! We have all connected, and you all have been a lifeline for me, I'm always checking on here and I do really care.  FDwith kids that is such great news!,! So so great it's shrinking. Engine, hope Janice is improving, and you both must be so relieved at 4 treatments instead of 6 . Inn a, Hoping you find relief for pain soon. Much hope, care and concern for all",
      "MessageIndex": 1063,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 16, 2018 04:48PM Djt wrote: duffysmom and frog, congrats. So glad you are done with t he chemo step. Engine, of course you must be stressed to the max, and with your school starting back up and All you have been through, ....I hope it improves for Janice and yourself very soon. Innb, so sorry you have had this difficult road to travel. I hope your treatment and pain relief is on the better road to recovery very soon. To all, day by day, treatment by treatment....slow but sure, praying for us all to get there soon. Thinking of everyone here. ♥️♥️♥️👍👍👍",
      "MessageIndex": 1153,
      "PostDate": "16/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 19, 2018 07:39PM Djt wrote: Hello, Batata. Nice to meet you. I hope you can continue to gather a lot of support here, it's an amazing group. Thinking of you during your Taxol, and hope your trip goes well, you should rest every chance you get. Frog, and Ingerp, and Inna,hang on, it will hopefully improve. When it's bad, it's really bad. I hope it improves very soon. For all of you dealing with exchange surgery and grafting I can't even imagine. I sure hope you got pain meds, and heal quickly. ♥️♥️♥️ GAW, I hope your energy picks up soon, tiredness hits me suddenly, early evening. It gets better daily. Leli, are you still following here? You are the originator of this great April thread, and I'm hoping you are doing okay. Best wishes and warm hugs to all here. (I'm so blessed to have a birthday today, and took a bike ride, so blessed)",
      "MessageIndex": 1185,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 27, 2018 05:22PM Djt wrote: Hi guys, urdrago, sounds like a rough few days with the Doppler for lymph node issues. Glad all is going better as of now. You will have more peace after your discussion after path report. I know, it's rough. Very rough.. I also am having Something going on in armpit by lymph surgery scar, but found a filled cyst there, idk, having Dr, check it Thursday.. As far as ringing a bell at last chemo, no one ever mentioned that here, and I never heard anyone else do it. Idk, i just was so so glad, a prayer of thanks did it for me. Innab, hang on, you'll get through it. Acupuncture sounds like a smart move. Engine...👍👍👍 GAW, i feel you on the neuropathy, it stinks. My left foot bottom is my problem area, it's very odd and sometimes the sharp pain radiates to the top. I used ice diligently during chemo, so it is what it is, i guess. Maybe in time it fades. My radiation oncologist spoke about taking turmeric as well, but im not sure what for. Frog, good info on plant based diet and nutritional info. Glad thumb is on the mend, too Hi DEBAL and Life, 😘😘😘 As far as eczema and such, i have thought that chemo drives impurities out of the skin, but, i only read that. I k ow since radiation, the chest area above my breast, has broken outg bad . .",
      "MessageIndex": 1252,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 29, 2018 09:53AM Djt wrote: Duffy, HAPPY PORT REMOVAL DAY🥂🥂🥂",
      "MessageIndex": 1262,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 29, 2018 05:51PM Djt wrote: Innab glad you got a good surprise, every little improvement is so huge in our world, hope tingles go away too.",
      "MessageIndex": 1267,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 11, 2018 10:10AM Djt wrote: urdrago, yes, my radiation oncologist got me in to see what was go in on. She prescribed a strong course of antibiotics for 10 days. It's so raw right now I don't know what to do.hard to wear any kind of bra or shirt. I see my surgeon next Tuesday. And, yes, i have a 4 inch lumpectomy scar, but that is fine. I dont know why, but the radiation somehow triggered the lymph node scar infection. The ro said something about treatment killing good cells with bad, so that is why so easy to become infected. But it's taking a long time to improve.",
      "MessageIndex": 1360,
      "PostDate": "11/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 19, 2018 04:46PM - edited Sep 19, 2018 04:48PM by Djt Innab, i don't want to miss this opportunity to also wish you a wonderful birthday and hope you are having a wonderful day. 🎂🎂🥂🥂🎂🎂🥂🥂",
      "MessageIndex": 1430,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863471",
      "Title": "Chemo starting April 2018 leli LIFE1963"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 20, 2018 02:36AM - edited May 20, 2018 02:41AM by Djt  so im going to step out of my comfort zone here and post 2 different styles of my wigs. Please share yours. Im open for critque and ideas. I hope we can help one another ",
      "MessageIndex": 1,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 20, 2018 10:48AM Djt wrote: frog, i could never get just like my bio hair, as it was a thin washed out blond went to ..no color, so i envy you. But. When all else fails, red lipstick reigns supreme. Indulge. So a small story....When I was young and carefree, I always told my bff....if having a bad guy breakup, a down time of feeling depressed for whatever, the cure was buy a pricy new red delicious red lip stick, the most glitzy glamorous one you can find and even if you wear it once and toss it. It does a girl wonders. Funny, that came back to me with your comment.",
      "MessageIndex": 15,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "May 21, 2018 12:12AM - edited May 21, 2018 12:13AM by Djt welcome Mameme and Amelia...Thanks for your input as well. My normal hair was an older washed out orphaned Annie that I occasionally got to look nice ....a little. I understand that perfection conundrum. So I know the perfect wig hair is not my real look, also, but I am seeing a lot of Bob cuts, med length wigs with a beach wave, those I love. FROG, a beret sounds fun, and that's why I love the Sqhair bands for a hair band, the arms fold and the shape is just like the sunglasses look. Cocoon, I do the hoodie thing often.....lol. as to our love of lipstick, there are so many shades of red, by experiments we can find the perfect shade. Mine is a deep red with brown, and I love lip liners too! Hoped everyone's Sunday is as peaceful and pleasant as possible.🐒🦄☀️🦄🐶",
      "MessageIndex": 22,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Djt wrote: I have only noticed posts that are several years old regarding wigs. So as it's my daily obsession right now, I thought we can share favorite wig sources, brands ideas, and so on. I cut my own hair off after my first chemo infusion, and I am now past my 2nd infusion. I have bought 2 wigs, well 4 actually, and returned 2 out of 4. I actually am having fun shopping for wigs, and realizing it doesn't have to break the bank. I have shopped at mainly Godiva secret wigs.com, and Tic, and hardcover. Please let me know how you are doing with your hair loss solutions. If you rock it bald, I envy you! I would cause great fear, accidents, and get bit by dogs and children if I went out bald. ♥️Deborah Dx 2/12/2018, DCIS/IDC, Right, 1cm, Stage IA, Grade 3, 0/4 nodes, ER+ Surgery 2/14/2018 Lumpectomy: Right; Lymph node removal: Right, Sentinel, Underarm/Axillary Chemotherapy 4/24/2018 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Aug 31, 2018 09:11AM Djt wrote: Hi, yellow, i agree, it can be fun, and transforming. Giving back a measure of control as well.😎😎",
      "MessageIndex": 35,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 2, 2018 02:33AM Djt wrote: PCranky, pic 1 no one will ever think thisx is NOT YOUR REAL HAIR!! Pic 2, i love the rich color and texture. I think if you trimmed the bang a bit, it would look perfect. Also, yes! Red would look great on you.",
      "MessageIndex": 47,
      "PostDate": "02/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Sep 4, 2018 03:16AM Djt wrote: yellow, isn't that the truth tho?? These days, no one seems to notice much! I don't know if thats good or bad! Well you can be sure you look just fine at work. I know I feel kind of strange with just a few eyelashes, but im sure the only one to notice is me.",
      "MessageIndex": 58,
      "PostDate": "04/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864705",
      "Title": "Wig talk Djt Hybrids"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Djt wrote: So starting chemo soon....I got the wig shopping underway, what is this I hear about nails?.. will my fingernails fall out? Dx 2/12/2018, DCIS/IDC, Right, 1cm, Stage IA, Grade 3, 0/4 nodes, ER+ Surgery 2/14/2018 Lumpectomy: Right; Lymph node removal: Right, Sentinel, Underarm/Axillary Chemotherapy 4/24/2018 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/863999",
      "Title": "Fingernails and toenails? Djt mustlovepoodles"
    },
    {
      "AuthorID": "Djt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272388/profile",
      "Content": "Apr 15, 2018 04:06PM Djt wrote: Blair, my stasts are almost identical to yours, onco 28, right breast 2 lumpectomy, same kind of CHEMO will be starting soon. You must be done...how did it go? Any advice on coping? I feel in a real funk and scared every twinge I feel is further cancer. Surgeries, well that was one thing...CHEMO, not so much, it just has me crazy",
      "MessageIndex": 1671,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    }
  ]
}