{
  "AuthorID": "djwilson358…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215896/profile",
  "Posts": [
    {
      "AuthorID": "djwilson358…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215896/profile",
      "Content": "May 20, 2015 04:55PM djwilson358 wrote: If you do decided to do the mastectomy, I would recommend that you do the nipple sparing for the reconstruction.",
      "MessageIndex": 9,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/831562",
      "Title": "Just diagnosed - lumpectomy or mastectomy?? Please help! joanie63 ruthbru"
    },
    {
      "AuthorID": "djwilson358…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215896/profile",
      "Content": "May 20, 2015 04:27PM djwilson358 wrote: I'm so sorry that you have to go through this, it is a very personal decision, but your doing the right thing to research and ask questions. I don't want to scare you, but I have had a difficult time for the last 3 1/2 years after having a lumpectomry, chemo and radation.  I had stage 1, triple negative, only thing they found was that my vitimin D was 19% and was too low.  I was told that this was the most agressive type of Breast Cancer, sadly could have been prevented, if my doctor check my vitimin D level yearly with my phyiscal.  I found out that they don't do that unless you ask or they have some other reason to check.  Anyways, my stage 1 breast cancer was at the back of my chest wall and they had to go about 4 inches deep and about 1 1/2 inches in diamator to remove the cancer. They removed 2 lump nodes, also.   I choose to do a lumpectomy, hoping to safe most of my breast.  Ironically, 3 1/2 years later, I've had a double mastecotomy becase of the problems I've had the last 3 1/2 years. I have had nothing but problem since then, I did a trial treatment of radiation for 1 week, twice a day.  Then I did 4 cycles of chemo.  I had phneomina after my 2nd  chemo treatment. which at the same time I had side effect from the radation that was like a bad burn on my chest and back, that lasted about 1 month.  They thought it was singles, but it did not wrap around my side, so they figured out it was from the radation. Then I had lumpodema in my left breast shortly after my 3 chemo treatment, this problem lasted about 1 month.  The doctors said, that I was just one of those people that got the rare problems, and not everyone had these problems. About 1 month after my last chemo treatment I developed a secroma in my left breast, they said, it was like balloon of fluid.  They told me that normally the body would absurb the fluid and that it was normally not painfull.  Again I was the rare person, it was extermely painful and my breast would swell up to the point I could not stand the pain.  Over the last 3 1/2 years, I've had my breast drained from the chronic secroma, I've had multiple drain tubes, etc.  It has just been a huge mess.  Both the pain management specialist, a second breast surgeon and my Plastic Surgeon (for breast reconstruction), all said, the secroma is a result of the radiation.  My orginal breast surgeon, oncologist both for chemo and radation, all said the secroma was not as a result of what the treatment that had performed.  I felt like they all pointed fingers at each other.  In the documenation for side effects, I  did not see anything about secroma's either, nor was I told that this could happen. My Plastic Surgeon, has told me over the last 4 or 5 months of treatment, that the secroma is caused by the radaition and that my original breast surgeon should have performed a mastectomy, because the whole that was left in my chest from the lumpectomy was so big and deep that it was like a parking garage in my chest.  That there was no way that it would heal and that was why I was getting the chronic secroma's, because the tissue that was left could not close up on it's own to heal.  So my body, just keeps making fluid to fill the huge hole in my chess. So my advise to you, would to get a better understanding as to where the cancer is, if near the surface, then the Lumpetomy might be the correct path, but if the cancer is deep like mine was, then I would recommend going with the mastectomy. After 3 years of dealing with the chronic secroma's, I found a plastic surgeon and another breast surgeon that felt that having a mastectomy would resolve my problem and get rid of the secroma.   In Dec 2014, we tried to do a surgery to remove the secroma and scar tissue and was going to try to reconstructe my left breast and then also reduce my right breast to make thing more semectric.  The right breast come out okay, but the left breast where I had the cancer, did not work so well, that was when the plastic surgeon found how deep the hole in my chest was and it could not be reconstructed as planned.  He did remove a lot of scar tissue and the secroma, but within 1 month the secroma came back about 3 times larger.  Then my plastic surgeon recommended a mastecomy and had me see another breast surgeon, who agree that was the way to go.  She said, they referred to people like me as a whipper, where my body just keeps whipping fluid.  So I decided to have a double mastectomy and have the temperary implants (spacer), then have perment implant put in. I'm so burnt out on all of the problems I've had that I wanted both breast done, I don't want to have to go though this again in my right breast. So, I had this procedure done March 2015 and things seem to be working out great.  Sadly enough, a week after having the drain tubes removed, I developed another secroma, which they said, would be very, very rare.  I had to go into the hospital this last weekend and have the temperary spacer removed from the left side and drain tubes put back in my chest for now.  It turned out there was no infection, like they first thought, it was just a huge secroma. Now, I find myself, just wanting to cry, which I have, but I'm in the same spot as you now, trying to determine what is the right next step for me. They are suggesting another major surgery, to remove muscel from my back to replace the pectorial muscel in my chest, which they said, is badly damaged from the radation and they feel is causing the secroma's.  I'm going to check out this website to see if anyone has gone through this mess, or had the surgery they are suggesting.  I'm scared and concerned if I do another major surgery and end up with the same secroma's, then what?  I'm also, thinking of just going forward with the implants and continue to just have the secroma's drain as needed the rest of my life, if that's what it takes and not do any more major surgery. I'm am one of the rare people with all these side effects and again I don't want to scare you, but really talk to your doctor about how large and where the cancer is located.  I mastectomy might end up being your best bet.  Also, my plastic surgeon, has told me, over and over again, it is easier to do reconstructive surgery after a mastectomy then it is with a lumpectomy.  He said, it's very difficult to reconstruct after a lumpectomy. So tha tis something to consider also.  Having the mastectomy, you won't have to worry, like I have the last three years, worring if the cancer has or will return.  Good luck to you.  I will pray for you.",
      "MessageIndex": 8,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/831562",
      "Title": "Just diagnosed - lumpectomy or mastectomy?? Please help! joanie63 ruthbru"
    }
  ]
}