{
  "AuthorID": "DL75",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/190959/profile",
  "Posts": [{
    "AuthorID": "DL75",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/190959/profile",
    "Content": "Oct 29, 2013 06:09PM - edited Oct 29, 2013 06:10PM by DL75 Hi Grk1732 I had a double mastectomy in August and I am so happy I made that decision! I was diagnosed with high grade DCIS and at the same time tested positive to BRCA2. The biopsy showed my mass as 9mm, when it was removed three weeks later it was 60mm so had I opted for a lumpectomy I would have been back in for repeat surgeries before they were confident they got it all. For the last ten years I have been getting checked due to a family history so in many ways my mind was made up a long time ago but there was still a lot I did not know until a few months ago. The biggest thing I had not really considered is that radiation can reduce the chances of successful reconstruction and if you have a lumpectomy (which would definitely require radiation therapy) and then require a mastectomy later your breast may not heal as well as they would this first time round. At your age, reconstruction is an important consideration. It's very much a personal decision and mine was not invasive so our situations are not the same, but despite everyone telling me how brave I was to make the decision, I don't feel brave at all - I feel I took the option that could reduce my stress over the coming years and significantly increase my chances of living a very long time. I am still in tissue expansion mode with my reconstruction and I am so happy with the results. Having both done at the same time means you will get better symmetry and only have to go through it once and the best thing is you don't have to decide on a size straight away so you can experiment what it's like to be a little bigger (if you want?!). Ok, they are very hard and a little uncomfortable but they look great - I call them my 'silver lining' and my friends are actually a little jealous!!! I had only been seeing my boyfriend for a few months when all this happened and although they are different (no nipple or sensation) I certainly don't feel I need to hide them away or feel self conscious. Although the first month was hard I will admit, it's now only 3 months later and I feel great! Next year I get the silicon implants put in which apparently will make them feel a bit softer and more normal and with that surgery I would expect another month of 'enforced holiday' followed by a month of taking it easy, then back to normal again. It's not an easy decision and I wish you all the best!!!",
    "MessageIndex": 3,
    "PostDate": "29/10/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813768",
    "Title": "Lumpectomy vs masectomy Grk1732 Beesie"
  }]
}