{
  "AuthorID": "dlcw",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
  "Posts": [
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "Nov 28, 2010 11:01PM dlcw wrote: Hi All - I am new to this site, just diagnosed on the 20th of November.  Had a 'normal' mammogram last year.  Gyn found a 'thickening' this year at my annual exam - this year's mammo was about 370 days from my last one and they found a large (approx. 4 cm) tumor and one large (1 cm) positive node - the radiologist was fairly sure it was cancer when I had the mammogram; biopsy confirmed it's IDC.  I don't yet have receptor status or grade or anything else.  I have an appointment with the surgeon on Monday and I will (hopefully) get those details from the pathology report?  The surgeon mentioned that I would have an MRI of my breasts (they found what they think is a cyst in the right breast) and a PET scan to look at my entire body.  Did any of you have a PET?  Based on what I've read, it seems like mine might be growing faster than 'normal' - anyone else have a 'good' mammo followed a year later by a bad one?  I'm a bit overwhelmed right now and have a couple more questions: Did anyone choose neoadjuvant chemo?  The surgeon says there's no difference in overall survival so I will have a choice - can't find much info on pros/cons except that if it shrinks it might allow for a lumpectomy rather than mx - is that an option if you have lymph node involvement?  Are the chemo regimens based on specific tumor characteristics?  the only person I know that went through chemo was positive for the gene and triple negative so she had a pretty tough protocol.  I am trying to figure out what I will do with work - I commute to SF from the East Bay (2 hrs/day commute) and am not sure if I'll feel well enough to do it or not.  Sounds like some of you have worked, and exercised, through chemo - is that typical?  Maybe I'm imagining this as worse than it will be (or is that wishful thinking?) Mostly I'm freaking out due to lack of information - knowing that it's in there, maybe spreading, and I'm just waiting for appointments is making me crazy - sure hope to move things forward in the next couple of weeks!  Also - I'm 47, have a 13-yr old daughter and a 9-yr old son.  My son is a cancer survivor (he had a rare kidney cancer when he was 3 and is almost 6 years out and still NED).  I hope to join him in the survivor category!! Glad to have found you guys - I'm sure I'll have more questions once I have more details. Donna",
      "MessageIndex": 742,
      "PostDate": "28/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "Nov 29, 2010 09:15PM dlcw wrote: Well - so much for my optimism.  Today, unfortunately, sucked.  I met with the surgeon and got the pathology report - I am triple negative.  She said she wasn't surprised given the size of my tumor and how quickly it had grown.  For some reason that little tidbit of info has hit me way harder than anything else - frankly it feels like I've been given a death sentence - I realize that's not completely rationale but can't seem to get a grip.  I feel a bit frantic, and am having little mini anxiety attacks where my heart starts to race.  Perhaps time to ask for a prescription? I have my MRI tomorrow and the PET scan on Wednesday morning - so hopefully by the end of the week I'll have a complete picture of how far it's gotten and can make a plan.  I still don't have an oncology appointment but am hoping to get them on the phone tomorrow - my surgeon was going to call the oncologist and ask her to fit me in asap.  Planning to feed the kids, get them in bed, and begin educating myself on treatment protocols for triple negative.  Now I just hope it's still only local (breast and lymph nodes).  That would finally be a bit of good news! ladyinbama - Huntsville is a nice town - I have relatives there.  I'm sure YOU are not an obnoxious fan like my cousins!  Their obnoxiousness stems mostly from the emails they send gloating when Alabama loses.  I hope Auburn makes it to the national champ game - would be nice to have it stay in the state, even if it's not Bama.  melania - thanks for the info - I am up north so still looking for the final onc and treatment center.  Going to see the local onc asap but am also checking into Stanford and UCSF.  I think if my surgeon had ordered more than the breast MRI and base-of-skull to knee PET scan I wouldn't have been able to get out of her office without breaking down. Lisamomoffour - so you were NOT triple negative and yours still came on quickly.  Maybe that means I'm putting too much emphasis on the relative aggressiveness of triple negative - did your doc give you any insight into how often that happens?  Right now I feel like being positive for something that would offer more drug options would be a blessing (funny what you find yourself wishing for isn't it?). Anyway - thanks again to everyone for responding - off to research. Donna",
      "MessageIndex": 753,
      "PostDate": "29/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "May 12, 2011 09:13PM dlcw wrote: Thanks - maybe if it continues I will call the doc tomorrow - not scheduled to see him again until the 19th but maybe can get in earlier. dlcw",
      "MessageIndex": 3,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/768897",
      "Title": "How soon can LE show up? dlcw kira"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "May 13, 2011 12:28PM dlcw wrote: Thanks kira - perhaps I am trying to do too much as I've been trying to stretch my arm quite a bit.  I have more swelling today in the area where my shoulder meets my trunk - and my forearm is more painful today than yesterday....have a call in to the surgeon's nurse for advice.  My drains are not doing much so I wonder if they are clogged and maybe that's why there's more swelling?  Hopefully she will have some advice. dlcw",
      "MessageIndex": 5,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/768897",
      "Title": "How soon can LE show up? dlcw kira"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "Nov 30, 2010 10:39PM dlcw wrote: Hi All - thanks for the info re: medications.  I am calmer today - had my MRI and will have the PET tomorrow.  Got an appointment with the onc here for Friday and am arranging a referral for a second opinion at the UCSF Cancer Center.  So, trying to focus on just moving forward and at least it feels like I'm DOING something by getting the scans out of the way.  Hoping for good PET results and then will be ready to finalize a plan - leaning towards neoadjuvant but waiting to see what the oncs say. Best to you all - Donna",
      "MessageIndex": 759,
      "PostDate": "30/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "Nov 29, 2010 12:49AM dlcw wrote: Hi Melania - thanks for the reply - I feel like I am leaning towards chemo before surgery as I just want to get started, but I like the idea of getting mastectomy even if it shrinks as I am no longer so fond of my breast tissue.....although I haven't really talked to an oncologist yet (hopefully Tuesday).  Do you mind if I ask where you are being treated?  I am in the Bay Area - have so far just seen a surgeon here in the East Bay but am sure there are experts at UCSF and/or Stanford - just not sure how to find them other than internet searches...is that how it usually works?   Three-year olds are so fun!!  My daughter (at 13) is becoming a teenager and although she's a great kid, I miss how much she used to chat and snuggle.   Hope you had a good Thanksgiving! ",
      "MessageIndex": 745,
      "PostDate": "29/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "Nov 29, 2010 11:05AM dlcw wrote: Hi All - ok - it's a big relief to know I'm not the only one that had a clear mammo and then a bad one the next year - I was feeling like that was a very ominous sign (although I feel like every twinge or pain I have these days must be an ominous sign of other tumors....).  Will be much better I'm sure after the PET scan and knowing for sure how far it's gotten.  LadyinBama - I grew up there in NW AL (small community with one 4-way stop called Natural Bridge), went to undergrad at Tuscaloosa - Auburn is having a good year (I don't really follow football that much but have some obnoxious cousins that went to Auburn and keep me apprised via email). I am feeling optimistic today, mostly I think becuase I see the surgeon and get the full pathology report - looking forward to some concrete information and planning the next steps. Thanks all, Donna",
      "MessageIndex": 749,
      "PostDate": "29/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "dlcw wrote: Hi - hoping to get some advice on a symptom I have...had a MX on Monday of this week with full axillary dissection and still have my drains in.  I have a tremendous amount of pain and soreness on the underside of my forearm extending up to my elbow - nowhere near the incision in my arm pit.  Not sure if it could have been injured during the surgery or if this could be a sign of LE?  How would I know for sure if it was LE?  Thanks for any advice! dlcw dx 11/22/10, IDC, tumor 4.5 x 2.5 at dx, one node positive, 3 suspicious, ER-/PR-/HER2-, After Neoajduvant: 2 cm tumor, 3/18 nodes, ER+(30%)PR-, HER-, On to Adjuvant chemo! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/768897",
      "Title": "How soon can LE show up? dlcw kira"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "Mar 30, 2011 11:59AM dlcw wrote: I know this thread hasn't been posted to in a while but just saw it.  I am doing a neoadjuvant trial with carb/gemzar/inaparib and my liver numbers were climbing steadily for the first 3 or 4 doses, but then they dropped back down and have been ok for chemo since.  I was taking Tylenol for headaches caused by the anti-nausea meds so I switched to Kytril and stopped taking Tylenol - don't know if that was a factor not.  Hope your numbers are down and you have been able to continue and am happy to hear that you got such a great initial response. dlcw",
      "MessageIndex": 6,
      "PostDate": "30/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763514",
      "Title": "Liver values skyrocketing on Carbo/Gemzar...help! nmiller1978 dlcw"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "Jun 15, 2011 08:45PM dlcw wrote: Cyborg - hope the meds are there and you are able to keep them down - I know antibiotics can be hard on an empty stomach - hang in there and I hope you feel better soon and the cellulitis is knocked out quickly.  I had my first Taxol today - 11 to go!  I opted to do the 12 weekly and start with the Taxol.  I was surprised at how much the benadryl impacted me - had an incredibly hard time staying awake in the chair - then I started to feel really restless and had to stand up and pace around the little cube I was in...wierd.  Came home and took a really long nap and now am feeling great.  I've read that Day 3-4 can be no fun so will wait and see.  I'm really happy to be back on treatment and moving towards finishing up and putting this year behind me!  I have an appointment with a nutritionist on Friday and am focusing on eating right and exercising (a bit and need to do more).  I read the book 'Anti-Cancer, A New Way of Life' and figure it can't hurt to do everything I can to fight this in addition to the drugs and radiation. Blondelawyer - hope the A/C starts to shrink the tumor right away and you get the emotional boost of that - I know when I was on the trial and my tumor measurements were going down it was an amazing positive feeling. Hang in there everyone! dlcw",
      "MessageIndex": 1153,
      "PostDate": "15/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "May 14, 2011 02:56PM dlcw wrote: Hi All - I have been lurking here for a few days as I am not sure I will get my chemo started again in May and maybe won't be part of the start in may group....I just finished a neoadjuvant trial with Gemcitabine/Carboplatin/PARP inhibitor (I am triple negative) and had my surgery this past Monday.  I will get my results from the pathology and start adjuvant chemo as soon as I am healed (hopefully within 2 weeks, but maybe 3). A couple of things I wanted to share from my experiences with the trial - first, taking the Claritin before and a couple of days after the Neulasta really helped me.  I didn't take it the first time I had the shot and starting about 2 days after I felt like I had been run over by a train.  Ached all over with bone pain, especially in my shoulders and sternum.  From then on I did Claritin and although I had some aches, it was not nearly as bad.  I did not have Neupogen so not sure how that one feels. Second, my doc gave me Ativan right at the beginning.  It helps with the nausea and it also helps with the anxiety.  If you didn't get something I wouldn't hesitate to ask if you think you need it as it can really help with the emotional roller coaster we are all on. Finally - my initial mix of antinausea meds didn't work well and I waited a few weeks before I asked for a different approach - should have asked sooner.  They started me on a combination of Decadron, Emend (a 3 day pack), Compazine, and Zofran.  I had horrible headaches from the Zofran and the Compazine made me feel drugged and out of it.  THey switched me to Decadron/Emend/Kytril and it was SOOO much better.  So, there are multiple drugs they can try and if you're feeling awful you might discuss it with your onc (insurance might also be an issue but I was able to get the Kytril covered). I think my adjuvant chemo will be DD A/C +  12 Taxol.  Is anyone doing that with the Taxol first?  Just curious as it seems some oncs are doing that based on an MD Anderson protocol. Candice - I had a false alarm with my PET and spent a weekend waiting to find out the status of a spot on my spine - mine turned out to be an overgrowth of blood vessels - I will be hoping and praying that yours is a false alarm too. mccrimson - definitely shop around - I got 3 opinions before starting the trial and have multiple appointments set up for discussions of next steps after I get the path report back - I think you have to find someone you trust completely and you feel answers all your questions and gives you the time you need to ask them. Everyone else - hang in there - I know there are days when it is so hard to stay positive as I've had many of them myself (and more than a few since surgery).   dlcw",
      "MessageIndex": 307,
      "PostDate": "14/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "Jun 28, 2011 11:44PM dlcw wrote: I'm doing the taxol x12 - thanks for the input on timing of hair loss...I definitely see an increase in the amount in my brush and on the counter....it started thinning on the trial drugs but is accelerating now so I am preparing for it.... Beaglesgirl - glad you are done with the AC - I haven't done that yet but I can tell you that so far the Taxol is very tolerable so I hope you start to feel better soon and that it continues through the taxol. I too had been told I had dense tissue - I didn't have any idea that dense tissue meant the mammograms were less able to detect cancer....that would have been nice info to have 2 years ago so I could have pushed for an ultrasound in addition to the mammogram - my sister is now doing that since my diagnosis.   Hope everyone has a good week! dlcw",
      "MessageIndex": 1369,
      "PostDate": "28/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "May 16, 2011 12:54PM dlcw wrote: HI All - wow, this is a busy forum...lots to catch up on since my last login.  For the constipation SE, I found that diet just wasn't enough and used Miralax and colace - I concur with everyone that says don't let it get bad - start some form of treatment as soon as you think you need it...the Miralax takes a couple of days to work. bkj66 - my last dose of the trial chemo was on April 14 and I had surgery May 9, so 3 weeks and 4 days.  They checked my counts to make sure platelets and whites were ok prior to.  I wanted it asap so was pushing for it as early as possible in the post-trial surgery window - could have waited a couple more weeks if I had wanted to. Hope everyone has a good day with minimal SE's. dlcw",
      "MessageIndex": 362,
      "PostDate": "16/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "May 14, 2011 07:33PM - edited May 14, 2011 07:33PM by dlcw",
      "MessageIndex": 312,
      "PostDate": "14/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "Jun 18, 2011 01:26AM dlcw wrote: Hi All - took a couple of days off from the board and wow - lots to catch up on.  So sorry to hear about the SE's some of you are dealing with - hoping for improvement for all of you.  I am on Day 3 after the first Taxol and today felt it a little bit.  Mostly a backache and I was so happy to read that MamaV had that symptom also - I tend to always think 'bone mets' anytime I have a back pain - not rational but I can't seem to help it. I met with a nutritionist today that is affiliated with my oncologist's office.  Got some good info on vitamins and supplements that I can take during the Taxol.  She indicated I would have to stop some of them during the A/C - what are you guys getting in terms of recommendations for supplements during the A/C part of AC/T?  Just curious.... bkj66 - I am so happy for you!!!  That response sounds phenomenol.  I am having a bit of regret about not doing the AC/T first rather than the PARP trial, especially now that the news coming out of ASCO doesn't seem like the PARP is going to be the breakthrough they initially thought it would be.  But, I know several women in the trial that have gotten a complete response so who knows - it may turn out to be better for early stage than for metastatic disease.... neecee - love your wig story.  I have one ordered - hope it's as convincing as yours! Take care all. dlcw",
      "MessageIndex": 1204,
      "PostDate": "18/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "Jun 22, 2011 11:17PM dlcw wrote: Hi Ladies - again, I was off line for a couple of days and wow - this thread moves fast!  So sorry to hear about the side effects some of you are feeling.  Cyborg - what are you taking for the nausea?  I hate to hear that you are having such an awful time.  I was having some issues on the Gem/Carb/PARP and my onc was very quick to start changing the anti-nausea meds until we found something that worked.  I ended up with the 3-day pack of Emend, plus decadron and Kytril - dumped the Zofran and Compazine and felt remarkably better.  They also had Aloxi as another option if the Kytril didn't work. blondelawyer - I am so sorry - you have more to deal with than one person should ever have to bear...I hope your tumor starts to noticeably respond soon!  I found that to be the best feeling when I was on the trial.  I hope your dog is improving too - I just read 'The Art of Racing in the Rain' and it was such a great book for dog lovers.  We have a 10-year old golden that's a sweetheart but she's starting to slow down and it's hard to see. MamaV and Patriotic - thanks for the list of your Taxol SE's.  I had dose 2 of 12 today and so far it's been really manageable.  Some back pain and achiness on days 3 and 4.  Face really red and flushed on Day 2 also but nothing else that I've noticed so far.  No hair loss yet but my onc says it may start later this week (end of week 2).  My red counts have actually improved a bit since I started (they were still low from the Gemzar).  No need to have Neulasta yet - the onc keeps reminding me that the A/C will likely be worse so I have that coming, but for now am thankful that so far it's better than I expected.  I'm going to start the L-glutamine this week just in case it can help ward off or reduce neuropathy and I'm starting several supplements that a local nutritionist recommended. bkj66 - I have a friend that had a 4 cm TN tumor with internal mammary node involvment and she was considered Stage III.  She had radiation to that area after AC/T and double MX.  She's coming up on 3 years clear. Patriotic - I have a friend that had the DIEP at CPMC with Dr. Kind.  She had a fabulous outcome and loves him (I know 2 other people using him for other procedures and they all rave about him).  I plan to see him after chemo to discuss but also am thinking of going to New Orleans for a consult.  I am pretty sure that's the option I want but the surgeon at Stanford said I was a little short on abdominal tissue (i.e., FAT) and I find that hard to believe as it seems like there's quite a bit there!  Just want to get some other opinions.  I wasn't too excited about getting tissue from thighs, back, or buttocks so am not sure yet what I'll do... I also read the book 'Anti-Cancer' that someone else mentioned and really found it informative.  Trying to modify my diet to be much more plant-based and I think that is helping me feel better too - if for no other reason than it feels like I'm fighting on every front available to me and that helps my mindset. Hope everyone has a good day tomorrow - good luck to anyone that's in the chair! dlcw",
      "MessageIndex": 1301,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "Jun 27, 2011 10:01PM dlcw wrote: Hi all - checking in after a few days off.  Had dose #2 of Taxol last week and am doing well.  Days 3 and 4 are the worst - body aches, headache, general crappy feeling.....so far no significant hair loss - question for any of you that did Taxol first how long did it take before your hair was gone?  My onc thought it would be this past week but nothing so far. bk66 - saw your question several posts back about rads - yes, I will do them so will have had neoadjuvant/adjuvant/rads when this is over.  I had 3 of 18 nodes positive - 2 sentinel and 1 axillary and that was AFTER 6 cycles of the trial drugs (Gemcitabine/Carboplatin/PARP).  Of the women I've met on the trial, all of them that had disease left at surgery (even minimal disease) are doing follow-on adjuvant chemo - even those that had clean nodes.  Good luck to everyone getting chemo this week and I hope SE's are minimal.  I get dose #3 on Thursday. dlcw",
      "MessageIndex": 1356,
      "PostDate": "27/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "May 14, 2011 07:32PM dlcw wrote: Laureen - Kytril is an oral anti-nausea that is an older drug - Zofran is a newer generation but I couldn't tolerate the headaches (plus I guess it really contributes to the constipation).  It comes in pill form and I took it every 6 to 8 hours I think, along with an ativan.  It worked great for me, and because it was an older drug, it had a smaller copay with my insurance so that was a plus. Had the Kytril not worked for me they also had mentioned Aloxi (not sure about the spelling) but that was the thing I would have tried next.  I am in Walnut Creek - did the trial at Stanford, and will be deciding between a local oncologist vs. Stanford for my adjuvant - I love the doc at Stanford but the commute can be ugly.... dlcw",
      "MessageIndex": 311,
      "PostDate": "14/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "dlcw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113915/profile",
      "Content": "May 14, 2011 09:01PM dlcw wrote: bkj66 - yes - I will still do more chemo even if my path report is clean, although I don't expect it to be.  I had an MRI at the mid-point of the trial and saw significant shrinkage and change in 'architecture'.  THen I had a scan at the end of the trial (after 6 cycles) and there was still significant shrinkage so there was still something there alive and able to shrink....but, hopefully most of it was gone.  Couldn't convince the oncologist to let me have a couple more rounds as the trial protocol was only 6....But, back to your question - there are no long-term survival data with the Gem/Carb/PARP combo so I started the trial planning to do more standard chemo afterwards even if I had a complete response.   I am glad to see your onc is planning to give you carbo along with the taxane - my oncologist has said that she thinks carbo is very active in TNBC and I was glad to get it as part of the trial.  A good friend of mine had internal mammary nodes with TNBC and she had your protocol (w/out carbo) plus rads - she's now 2+ years out and doing great.   Laureen - hope one of those will work better for you!  I found that getting rid of the  nausea made my whole outlook more positive.  Good luck on Monday. dlcw",
      "MessageIndex": 315,
      "PostDate": "14/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    }
  ]
}