{
  "AuthorID": "Dlpaquette",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
  "Posts": [
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "Apr 20, 2018 10:43PM Dlpaquette wrote: Feline mom, I am so sorry to hear this news. I hope you have a good team standing behind you to give you the best possible care.",
      "MessageIndex": 454,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "Apr 29, 2018 12:51AM Dlpaquette wrote: Nancy, it looks like we are both due to finish on Tuesday, I am also having lots of skin issues and in quite a bit of pain, I did all the skin care, even set alarms to remind me to apply the aloe throughout the day. Under the arm is horrible, under the breast is also sore but more when I move certain ways. The skin breakdown gets worse by the day, the size of a baseball under the arm, 1/2 inch by 4 inches under the breast and a large area in the center where my nipple used to be. My RO told me that it would be like a mild sunburn, I wish! I wish I could take a couple days off from work but used all my time off for surgery I know it will start getting better soon, but I can totally relate. I amjust tired of the pain. Dawn",
      "MessageIndex": 492,
      "PostDate": "29/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "May 3, 2018 06:51PM Dlpaquette wrote: Thanks everyone! Two days of working 8 hours then going hime has been great, the 8 hours plus rads (about an hour als a half with travel) was exhausting. I did not get a special arms off like Nancy, but I did get a huge surprise at work. I was checking a patient out and could not figure out why the respiratory therapists all seemed to be just hanging around, as soon as the patient left I all of my co-workers, even my manager singing a made up song to the tune of happy birthday about finishing radiation, then gave me a card and a gift card to the salon. I was not expecting it at all. They sent flowers and bought gift cards for restaurants after the surgery and now this, they are amazing! I could have taken time off unpaid but I felt too guilty as it is a small office and we can barely keep up with all of us there, when I came back after surgery it took weeks to catch up. I am pretty sure that every bit of radiated skin is going up peel off, has anyone else had all of their skin peel. I will run out of the silvadine before this is over I am spreading it on such a huge area right now.",
      "MessageIndex": 521,
      "PostDate": "03/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "Apr 22, 2018 09:55PM Dlpaquette wrote: Thank you veeder and doublebloom, the nurse did look at it Friday and gave me silver sulfadiazine cream and Telfa pads, the Telfa is useless as it just crumples up, the mepilex sounds like what I am looking for. I will be checking Amazon right away. I do see the RO tomorrow, as I see him on Mondays. I think having it be my dominant arm and using it constantly at work does not help, then Saturday I spent shopping som day with my daughter. Carrying bags and a heavy purse all day (she lives out of state so it was a 13 hour day in all, celebrating her birthday:). I wish I had dinner vacation time as i would take a couple days off work to not have the constant running for a little stretch. Happy anniversary doublebloom! I hope you have a great trip!",
      "MessageIndex": 459,
      "PostDate": "22/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "Apr 15, 2018 06:12PM Dlpaquette wrote: Has anyone had pain from radiation not related to redness. I have had pain in the upper chest and although I do have some redness this area looks better than other areas and the pain feels deeper than a skin issue. It is not horrible but had been a few days with no improvement. I am not even sure if it is radiation related.",
      "MessageIndex": 394,
      "PostDate": "15/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "Apr 21, 2018 11:47PM Dlpaquette wrote: Does anyone have any advice on how to keep open areas from getting worse/ larger? I have 7 treatments to go (21 down) and in 2 days it has quadrupled in size. I am trying to think of some way to prevent the rubbing but so far unsuccessful.",
      "MessageIndex": 456,
      "PostDate": "21/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "Dlpaquette wrote: This Post was deleted by Dlpaquette. Dx 12/12/2017, DCIS/IDC, Right, 1cm, Stage IIA, Grade 2, 1/1 nodes, ER+/PR+, HER2- Surgery 1/23/2018 Mastectomy: Left, Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860961",
      "Title": "Introduction Dlpaquette Dlpaquette"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "Mar 2, 2018 12:14AM - edited Mar 2, 2018 12:15AM by Dlpaquette I just got a call today, my simulation is March 15th, I then will go back to start treatment on March 21st if I am healed from my BMX. I will be having my incisions surgically closed on Tuesday with hopes to speed up the healing. I was lucky that the 4:15 time slot was open so I can go into work early and get 8 hours in before leaving for radiation. I usually work 50 hours a week so 40 hour weeks will be a welcome change. Dawn",
      "MessageIndex": 11,
      "PostDate": "02/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "Mar 20, 2018 10:05PM Dlpaquette wrote: I have been reading everyone's posts and it is very helpful. Tomorrow I go in for the shorter SIM and if the RO feels my incision is healed enough I will start radiation I Thursday, it is at a point I think it could go either way, I am hoping that we can just get started, I want this to be done by the time the weather is nice, I spent last summer on crutches, I am looking forward to a better one this year. It is interesting how the amount of days varies so much, mine is 28 days, somewhere in the middle is what I have seen others post. If all goes well I could finish on April 30th. The first SIM was a bit painful as I had fallen on slippery steps the day before and hurt my shoulder, but I managed to get through it, tomorrow should be a piece of cake as my shoulder is feeling much better than a week ago.",
      "MessageIndex": 146,
      "PostDate": "20/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "Apr 12, 2018 09:33PM Dlpaquette wrote: I had 16 of 28 today and after catching up here I see I am not the only one who is starting to have skin reactions. On Monday when I saw the nurse and RO I was told I had folliculitis but other than mild itching felt fine. Yesterday I starting feeling sore and pinking up, today the soreness has increased. I had a BMX due to wide spread DCIS plus the tumor and was told no radiation as my lymph nodes appeared fine. Unfortunately the pathology came back as node positive. So I don't have to get boosts, but I have so much area that needs radiation they can't do the higher doses for fewer days :(. I decided to go braless today, was a bit self conscious about it but my saline filled bags don't sag as much as my cancer boobs :). Is anyone else exhausted? I am working from 6:45 am to 3:15 PM then radiation, between travel and treatment I get home at around 5pm, sometimes later. I make supper and ready to crash. Of course I have already started the tamoxifen so that contributes to the exhaustion. I may be able to help with the billing, I used to work for an insurance company and radiation billing is strange, so the fact that it does not equal out should not be alarming, I know when I was reviewing these claims they would have to stretch over a certain amount if days so one bill may be for 3 days and another for 4 days, of course add the nurse and or doctors visits and x-rays etc. The SIM had a body but making is a separate cost and they are not allowed to bill the mailing on the same day as the SIM so you doll get that one bill for a day you were never there. I know for the month of March the insurance approved over $14,000, thank goodness I have hit my pit of pocket. I am still battling with my oncotype bill as they have it as our if network and the are no in network options. Without the test I would have needed chemo which would have cost them tons more.",
      "MessageIndex": 370,
      "PostDate": "12/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "May 10, 2018 08:15PM Dlpaquette wrote: I still wonder why we have to follow up with so many cancer specialists, between the MO, SO and RO it feels like over kill. If they were being treated etc I would understand but if I am just seeing them all to just say \"Hi, how are you doing. \" it is a huge waste of time and money. I guess I will find out soon enough as I have my first MO follow up on Wednesday.",
      "MessageIndex": 551,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "Mar 24, 2018 01:20AM Dlpaquette wrote: I had my second of 28 treatments today, I don't know if I missed it but I didn't remember hearing anything s not not shaving before so I was surprised when i was told i couldn't shave. I am wondering if it is ok to shave on the weekends when I am not getting treatment. It is sad how something as simple as shaving feels like a big deal to me but I never skip a day and suddenly I habe to skip 6 weeks...ugh.",
      "MessageIndex": 180,
      "PostDate": "24/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "May 1, 2018 07:21PM Dlpaquette wrote: Nancy, Congrats we are done!!! So glad to know we will no longer be adding fire to the burns. I was told the Silvadine is supposed to prevent the burns from getting worse, but that hasn't worked. I think I may be allergic to it as I am very allergic to Sulfa and stings going. I am just so glad there is an end in sight:). I am also excited that I get to sleep in an hour as I get to work my normal hours, going in an hour early so could leave early for radiation had been exhausting. Meetoo, enjoy England, you deserve it!",
      "MessageIndex": 509,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    },
    {
      "AuthorID": "Dlpaquette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/265147/profile",
      "Content": "May 9, 2018 06:56PM Dlpaquette wrote: I am glad to see everyone living on to the next phase. I am surprised u ws never even made a follow up appointment although I was told they wanted to see me in 3 months. No instructions in how lling to use the aquafor or any pay radiation instructions... I did get to the bottom of my pain, I just figured the amount of pain I have had is normal but I have not been sleeping, advil and extra strength tylenol were not even touching it, I finally broke down and took pain meds which took the edge off but still considerable pain (I cannot take heavy duty pain meds). Finally last night I decided to just stop the silvadine and use just aquaphor, today I am a whole new person, I am sore, it doesn't feel great but it also does not feel like someone is holding a hot branding iron to my breast and armpit 24/7. I wish I would have figured it out weeks ago because I have been so miserable. Today I think I have said about 20 \"I can't believe how much better I feel!\" I have spent weeks walking around with my arm hugged to my chest because any movement was causing unbearable pain. I just feel so relieved that the worst is now behind me!",
      "MessageIndex": 544,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/862824",
      "Title": "MARCH 2018 starting RADIATION Veeder14 Beaverntx"
    }
  ]
}