{
  "AuthorID": "dlr430",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73347/profile",
  "Posts": [
    {
      "AuthorID": "dlr430",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73347/profile",
      "Content": "dlr430 wrote: Hi All.  First I will tell you I am a Kidney Cancer Survivor - Stage 1 - had 1/3 of my L Kidney removed in June - and all is going well -- no chemo or radiation was given as they \"got it all\" and said chemo and radiation do not work on kidney cancer anyhow....  so now my question... I have a mammo scheduled in mid - December (not my first) but as I was doing self breast exam I \"think\" i feel small lump on R side... I only \"think\" becasue I am not a good one to do self exams, have only recently started since my kidney cancer  - and my breasts are large so its difficult  -- so my real ?? is  - is it ok to wait till mid Dec for mammo?  How quickly does this go forward if it is cancer? will couple more months hurt? - I feel like I am paranoid because of the kidney cancer and dont want to over-react and have told NOONE that I think I found lump.   I had bone scan and chest xray done in June prior to my surgery - so am thinking something would have shown then ---right??? any words of wisdom would help -- i am prob being paranoid, but its hard not to worry this cancer is coming back and maybe in differnet form ... my grandmother had breast cancer in her 50's...  thanks... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/722495",
      "Title": "Little Worried dlr430 dlr430"
    },
    {
      "AuthorID": "dlr430",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73347/profile",
      "Content": "Oct 9, 2008 11:42AM dlr430 wrote: Thank you all for your answers and support - It is a long time to sit and worry - and you are all right - why prolong it- and hopefully i just get good news and put it all to rest...  thanks for taking the time to reply and for the support. Dawn",
      "MessageIndex": 5,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/722495",
      "Title": "Little Worried dlr430 dlr430"
    }
  ]
}