{
  "AuthorID": "dmarie71",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138634/profile",
  "Posts": [
    {
      "AuthorID": "dmarie71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138634/profile",
      "Content": "dmarie71 wrote: It will soon be 5 weeks since my PBMX and reconstruction. I am SOOOOO TIRED! When will I start to feel a bit more energized? Anything I can do to help this along? I will be returning to work next week...I don't know how I'm going to get through the day without a nap! Surgery 1/20/2015 Prophylactic mastectomy: Left, Right; Reconstruction (left); Reconstruction (right) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/828809",
      "Title": "How long after surgery till your energy returned? dmarie71 Jennie93"
    },
    {
      "AuthorID": "dmarie71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138634/profile",
      "Content": "Apr 20, 2012 04:18PM dmarie71 wrote: Hi everyone!  I'll be having a NSBMX on May 30th...oh that stinks!!!!  I'll be the last one:(   I've known since October that I have ALH and LCIS and I have been consumed with worry ever since then.  I had too many SE from tamoxifen, so I either watch and wait (no thank you) or I do something as aggressive and radical as a BMX.  I just can't live with the fact that I have incredibly dense and fibrocystic breasts with funky cells hanging out in them.  I've been told at my breast center that my mammograms and MRIs are almost impossible to read.  So how the heck is anyone ever going to find anything early in that mess?  I've got a 10 and 12 year old at home...I just want to move on with living and enjoy my life again.  Then I start reading all of the terrible stories of what can happen with TE reconstruction and I think, \"What the heck am I doing this for?\"  I'm happy the May thread has started.  I am terrified for what is to come but I think the most helpful thing for me has been reading the posts from those on the March and April MX boards.  I guess I'm in for a crappy summer.  I will have no chest for about a month...that will look just lovely in a bathing suit and then ba da boom....August I'll be bustin out!  This is so crazy...I just can't wrap my head around it!  I'm so thankful to have found two amazing doctors who have so much experience.  I doctor-shopped and hit the jackpot on my third choice!  I'm still praying someone cancels and I can move up my date.  Not great to be here....but I'm so happy we found each other! Dawn ",
      "MessageIndex": 10,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "dmarie71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138634/profile",
      "Content": "May 29, 2012 03:15PM dmarie71 wrote: Well everyone...I haven't posted in weeks because my body has decided to throw me another curve ball and I have to postpone my surgery that was scheduled for tomorrow.  I've been a total mess!!!!  At the beginning of April, I suddenly developed severe dry eyes (couldn't wear my contacts, sore eyes and blurry morning vision).  My eye doctor thought it was from taking ativan for the past several months (due to the stress I was under).  She told me to immediately stop taking it.  Well...no one ever told me that you can not stop that med cold turkey after taking it for several months.  It threw me into full blown withdrawal....pure hell!!!! I've been tapering the medication for the past 4 weeks but I'm still having some symptoms which my GP now thinks I should see a neurologist for.  Some of my symptoms seem to be multipple sclerosis or Sjorgens Syndrome related.  I'm freaking out!  I can't deal with another health crisis on top of this breast scare.  Luckily, I do not have a cancer diagnosis. I have ALH.  My breast surgeon did another MRI to make sure everything was still ok and said that since this surgery is preventative and not an emergency, I should focus on feeling better before I go through a major surgery.  I'm a mess today because my surgery could have been behind me tomorrow...now I'm here sitting worrying about what else could be wrong with me and wondering how much longer I can possibly continue worrying about this surgery.  I've lived with this diagnosis since October.  I feel like I'm going to crumble!  Sorry for rambling...I'm just so frustrated!  Good luck to those still waiting!!! Dawn ",
      "MessageIndex": 459,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    },
    {
      "AuthorID": "dmarie71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138634/profile",
      "Content": "dmarie71 wrote: I had to cancel my mastectomy and reconstruction surgery to undergo further testing to see if I have Sjorgen's Syndrome.  I was wondering if anyone else here had this condition and how it impacted your choice to do breast reconstruction with tissue expanders and silicone implants.  I can't even believe I'm dealing with another major health problem in the midst of this breast issue....argggg!  Thanks to anyone who can shed some light on this or offer a bit of advice! Dawn  Surgery 1/20/2015 Prophylactic mastectomy: Left, Right; Reconstruction (left); Reconstruction (right) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788489",
      "Title": "Sjorgen's Syndrome and Implant Reconstruction dmarie71 steelersluver"
    },
    {
      "AuthorID": "dmarie71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138634/profile",
      "Content": "Jan 28, 2015 11:07PM dmarie71 wrote: I was diagnosed with ALH/LCIS 3 years ago at age 40. I have no family history of breast cancer. I have extremely dense breasts which makes my imagery (mammos and MRIs) very difficult to read. I tried tamoxifen but had unpleasant side-effects. I decided to do the \"watch and wait\" game. Over the past 3 years, I've had 5 biopsies, 4 enormous cysts aspirated, dozens of new lumps ultrasounded (which all turned out to be cysts, 3 lumpectomies, my latest MRI showed 3 new masses that needed to be biopsied and then my most recent mammo showed dozens of new layered calcifications on my\"good breast\". I finally said \"Enough is enough!\" I had my PBMX and immediate reconstruction one week ago. The \"good\" thing about and ADH or ALH diagnosis is you have time!! Don't go into panic mode. I suggest seeing several top notch doctors at breast centers and talk to lots of other women BUT in the meantime try the conservative route and see what the next few months/years bring. In my case, I seemed to be moving closer and closer in a bad direction and the stress of constant surveillance and biopsies was too stressful. Praying my pathology report comes back just fine and I can be done with mammograms FOREVER!!!!!! Good luck!!!!",
      "MessageIndex": 6,
      "PostDate": "28/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/827486",
      "Title": "To all of you pre-menopausal woman with ALH Shelly1974 dmarie71"
    },
    {
      "AuthorID": "dmarie71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138634/profile",
      "Content": "dmarie71 wrote: I had 2 very small masses show up on my MRI.  I am high risk due to ALH/LCIS.  I will be having biopsies on both masses.  I am just curious...can DCIS show up as small masses on MRI?  My surgeon said \"If this is malignant, we most likely have caught it very early due to the small sizes (3mm and 5mm).  I'm just wondering if MRI masses that turn out to be malignant are typically invasive or if there is a chance it could be very early DCIS???????? Surgery 1/20/2015 Prophylactic mastectomy: Left, Right; Reconstruction (left); Reconstruction (right) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823254",
      "Title": "Can MRI mass be DCIS? dmarie71 NancyHB"
    },
    {
      "AuthorID": "dmarie71",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138634/profile",
      "Content": "Mar 1, 2012 10:47PM dmarie71 wrote: Maybe others had a positive experience at Johns Hopkins but I was incredibly disappointed in the BS and PS.  I saw Dr.Tsangaris and Dr. Rossen.  Dr Tsangaris spent a total of 10 minutes with me.  He did not even look at my cd which contained my mammograms, ultrasounds and MRI.  I felt like my LCIS diagnosis was a joke to him.  He gave me NO information and was very arrogant.  The PS was even more of a joke. He took my pre-op photos with his cellphone.  I felt as though I was a waste of their time because I didn't really have BC.  ",
      "MessageIndex": 8,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783445",
      "Title": "Recommendations for high risk docs/ oncology centers? yolo TiredProf"
    }
  ]
}