{
  "AuthorID": "dmoh",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84096/profile",
  "Posts": [
    {
      "AuthorID": "dmoh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84096/profile",
      "Content": "Aug 30, 2009 01:01PM dmoh wrote: Hi Francine, I am in Westchester also.  I too often feel like I'm \"the only one.\"  This is my second go-around with the Big C.  Finished my chemo in June and am in the midst of my reconstruction woes.  I know, I know, it's a process!  Good luck and keep in touch.  Feel free to PM me.  Diana",
      "MessageIndex": 5,
      "PostDate": "30/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/739614",
      "Title": "Weschester and Rockland Ladies crusader1 Jisman"
    },
    {
      "AuthorID": "dmoh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84096/profile",
      "Content": "dmoh wrote: Hi, just wondering if anyone has had to skip their final chemo and what, if anything, did you do afterwards?  My story in a (long & large) nutshell -- Dx Feb. 09 with a local recurrence after 9 years with NED. TX in 2000 included lumpectomy, axillary dissection (0/22 nodes!) and radiation.  I chose to have a bilateral mx on 2/20/09 with TEs placed at time of surgery.  60cc fills began 3/5/09 & TC chemo started 3/13/09.  Everything was basically fine with the exception of the two allergic reactions I'd had to the TC, the extreme fatigue & bone pain associated with the TC, and the constant discomfort of the TEs stabbing me in the ribs, not to mention the \"steel cage feeling\" across my chest!  OK, I guess not fine, but I was getting through it.... In any case, after my 3rd TC on 4/24/09 I experienced a worse than normal reaction to the TC -- more fatigue than usual, worse bone pain, and pain in my right breast (the one previously irradiated, yes, I knew the risks of implants in previously irradiated skin, but I chose that route anyway seeing as my body would be changing in so many ways, I wanted to at least try for symmetry -- vain perhaps, but whatever.) Saw PS on 5/8, didn't have a fill, and was admitted to the hospital for a week of IV antibiotics (vancomycin every 12 hrs) to treat an infection in the right breast which was red, tender, and inflamed at that point.  Due to a pre-existing penicillin allergy, afterwards I was given Zyvox (linezolid) oral antibiotics (2x/day every 12 hrs) for 10 days.  Well, after just 3 doses, I developed a nasty and unbearable rash all over my back, belly, arms, legs, and privates!  Most people tolerate this drug well, but not me!!  Was switched to levoflaxacin and then to ciproflaxacin and so far so good, but the breast still has one small pink area right on the incision line, so I haven't been cleared yet for my final chemo (#4) which was originally scheduled for 5/15/09. Fast forward to 5/22/09 -- oncologist says if there isn't significant improvement by 6/5/09, we will likely bag the final chemo.  She says to focus on the fact that I've had 3 good doses of TC and not the 1 I may miss, but I can't help thinking that if I skip the last one then I haven't done absolutely everything I can do at this time to take care of my cancer.  All I keep thinking is that 9 years ago I did 4 AC, 4 Taxol, 35 Rads and the monster STILL came back!   Anyone else face a similar situation?  I could really use some encouragement from the \"experts\" out there. Thanks, dmoh Dx 11/13/2009, IDC, 2cm, 2/0 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734743",
      "Title": "Anyone skip their final TC chemo? (long, sorry...) dmoh scoutmm56"
    },
    {
      "AuthorID": "dmoh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84096/profile",
      "Content": "dmoh wrote: I've learned so much from these boards & though I'm only a very occasional poster, I was hoping someone could give me some advice on flying & lymphedema. I am midway through my rads, last one will be July 1st, and I'd like to plan a family vacation to escape this BC business for a bit.  I was diagnosed in Feb. 09 with recurrent IDC (after 9 years being cancer free) and chose to have a BMX.  Reconstruction was a nightmare from the start & I had another (?) recurrence in Sept. 09 -- truthfully, I think the original BS missed a lymph node.  Long story short, I did Xeloda & Avastin this past fall & winter and, as mentioned, am nearing the end of rads (28 total).  So far, no signs of lymphedema, but I am terrified of getting i.  So, my question to you ladies is: How soon is too soon to fly after rads treatment to the chest, axilla, & supraclav?  I have a custom sleeve that I got after my first go around with BC in 2001, so I could definitely use that, but I'm just wondering if I'm tempting fate by even considering getting on a plane (NYC - Orlando, RT) this soon after rads? Thanks to you all.  I will check back later as I have to get ready for my rads #15 later this morning.  Dx 11/13/2009, IDC, 2cm, 2/0 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/754082",
      "Title": "Lymphedema & Flying dmoh kira"
    },
    {
      "AuthorID": "dmoh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84096/profile",
      "Content": "Jun 14, 2010 02:59PM dmoh wrote: Thanks Kira.  Binney & anyone else who'd like to comment, I would more than appreciate it.  dmoh",
      "MessageIndex": 2,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/754082",
      "Title": "Lymphedema & Flying dmoh kira"
    },
    {
      "AuthorID": "dmoh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84096/profile",
      "Content": "Jun 14, 2010 09:44PM dmoh wrote:",
      "MessageIndex": 5,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/754082",
      "Title": "Lymphedema & Flying dmoh kira"
    }
  ]
}