{
  "AuthorID": "dn7prh12",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166605/profile",
  "Posts": [
    {
      "AuthorID": "dn7prh12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166605/profile",
      "Content": "Jan 4, 2013 09:43AM dn7prh12 wrote: Thank you for the reply. Its a relief to know that someone else has been in my situation and it turned out to be fine. I had a breast ultrasound on wed of this week, don't know the results yet. But from what I could see myself, I saw some simple cysts in there which, to be honest, I expected to see...because my breasts feel cystic. So I'm not too concerned about the two I saw on the screen, I've noticed them since breastfeeding. Once I get further information, I will post more. They still have me set to see a breast surgeon next thursday, so we'll see what she has to say.",
      "MessageIndex": 2,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798104",
      "Title": "Nipple discharge or colostrum? dn7prh12 dn7prh12"
    },
    {
      "AuthorID": "dn7prh12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166605/profile",
      "Content": "dn7prh12 wrote: At my annual exam it was noticed by my dr. that I have some kind of discharge coming from my right breast from only one duct. This alarmed her, I on the otherhand have written it off as just colostrum for the past two years. She tested it for blood and there was none, but apparently she is still worried about it. I will get a ultrasound done next wed. I breastfeed my daughter for three years, ended in 2010. Is it possible that this one duct just continued to produce colostrum? I'm only 25. Had my daughter when I was 19. Breast cancer does not run in my family. :( am just worried. Has anyone ever had discharge coming from one breast one duct without it being cancer? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798104",
      "Title": "Nipple discharge or colostrum? dn7prh12 dn7prh12"
    }
  ]
}