{
  "AuthorID": "dobbins_mar…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67232/profile",
  "Posts": [
    {
      "AuthorID": "dobbins_mar…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67232/profile",
      "Content": "Jan 5, 2011 02:21AM dobbins_margie wrote: Hi SheilaE; I don't know; it is all a bit confusing for me; if this helps with your 'figuring out'. I was diagnosed with Stage IIIA Invasive Ductal Carcinoma, my tumor was 7.5! in diameter (which my onc said was equivalent to small grapefruit) After TAC Chemo/Surgery#1 to remove the tumor that chemo had shrunk to about the size of the tip of a pen(my surgeon removed 4 lymph nodes I think, and they tested negative for cancer; so it had not spread into the lymph nodes/Surgery #2 to remove additional calcifications/cancerous tissue found in previous/More TAC Chemo/Radiation/Now Arimidex. I felt that I was very lucky to have found out in the 'nick' of time since Stage IIIB is, from what I learned, not much can be done; the cancer has spread to the chest wall and other areas of body. (So you don't know if you are stage II or III? Has your onc not told you or done the staging process?) God Bless you!! Take care now!",
      "MessageIndex": 16,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "dobbins_mar…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67232/profile",
      "Content": "Jan 5, 2011 02:42AM dobbins_margie wrote: ...and a PET/CT Scan was ordered immediately by my onc, during my staging process. I have since had a couple more tests (I think it was the Nuclear Bone Test, don't remember, but I do remember fasting and drinking a contrast before the test/and having to hold my bladder! ha) The tests are worth the un-significant 'hassle' because they give us re-assurance when we get good results!",
      "MessageIndex": 18,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "dobbins_mar…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67232/profile",
      "Content": "Jan 5, 2011 04:50PM dobbins_margie wrote: My apologies to everyone for my previous post here. I spoke without knowledge; and didn't make what I wanted to say understandable at all. I just read back and realize that I got too wrapped up in details and/or reading. Yes, I agree that there are survivors of ALL breast cancers; and I truly care about all of you. Please accept my sincere apology and know that my tone and mood when I enter this discussion forum is one of caring and sincerity. God Bless!!! dobbins_margie",
      "MessageIndex": 34,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "dobbins_mar…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67232/profile",
      "Content": "Jul 16, 2012 05:58AM dobbins_margie wrote: Hello Kerry Mac. I have not visited this site in some time. Just coming back and found your post. I apologize for not responding back then. I see that you misunderstood my wording. I never said that Stage 3 of any type was un-curable. I had stated that I felt 'beyond stage 3's' which would be Stage IV only. However, I had immediately apologized to the members for my wording, and I had explained that I do not give up hope or belief that ANY cancer of Any stage can be cured. That is, and will always be my wish for all of us. My original comment was basically referencing 'statistic' and other 'crap' if you will, that I had read. Again, I stick to the theory that none of us are born with an expiration date stamped on the bottom of our foot. God will not take us until he is ready for us, cancer or not. My best wishes for you, and I keep you in my prayers. Margie",
      "MessageIndex": 63,
      "PostDate": "16/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    },
    {
      "AuthorID": "dobbins_mar…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67232/profile",
      "Content": "May 23, 2008 12:00PM dobbins_margie wrote: Hi Emma; My name is Margie and I just joined this site so I could comment on your topic. First I would like to say that you are the first case I've come across that I can relate to. That is one where the tumor needed to be shrunk BEFORE surgery. In April 2008 I was diagnosed with bc and had a tumor that was 8cm(onc said it was about the size of an orange) and I would need chemo to reduce it before I could have surgery. On May 1st I did my first round of \"TAC\" chemo. Three weeks later on May 21st I visited my onc and the tumor had already shrunk to about half it's initial size; to about 4cm(about size of a plum). I still had to do my second round that day; but I hope and I think that maybe I won't have to do the 6 rounds as planned. I've not had serious side effects from the TAC either. I tell you this in hopes that it helps you. Maybe you can inquire about this with your onc. I wish you BEST of LUCK!!",
      "MessageIndex": 26,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704241",
      "Title": "neoadjuvant chemo - but tumor not shrinking? Emma56 carpediempenny"
    },
    {
      "AuthorID": "dobbins_mar…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67232/profile",
      "Content": "May 23, 2008 11:50AM - edited May 23, 2008 12:07PM by dobbins_margie",
      "MessageIndex": 25,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704241",
      "Title": "neoadjuvant chemo - but tumor not shrinking? Emma56 carpediempenny"
    },
    {
      "AuthorID": "dobbins_mar…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67232/profile",
      "Content": "May 23, 2008 12:06PM dobbins_margie wrote: Hi Annie; I hope this message finds you well. I wanted to comment that I think there may be a possibility that instead of 'upping' your dose of chemo on the third round; the side effects just became more intense. My onc explained to me that my side effects would mimic previous ones, only they would be more intense because they'd already 'hit me hard' on previous ones. I wish you BEST of LUCK!! Hang in there. You are a real trooper!",
      "MessageIndex": 27,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704241",
      "Title": "neoadjuvant chemo - but tumor not shrinking? Emma56 carpediempenny"
    },
    {
      "AuthorID": "dobbins_mar…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67232/profile",
      "Content": "Jan 6, 2011 12:35AM dobbins_margie wrote: Thank you for accepting my apologies. I shall be very careful in my wording in the future. I still do not know how to correct what I said in the offensive post; I can say what was on my mind when I posted however. I had been reading all posts about staging and how they differ in so many ways. And I will say that when I did some reading back in 2008 during my diagnosis; according to what I read; and the older Staging Charts used prior to 2008; I would have been Stage IV instead of Stage IIIA which I was diagnosed. So the POSITIVE to my personal story is that Stages III and IV are very curable in my own personal opinion. (My negative comment was just verbalizing what I had read...and believe me; when I was researching in 2008...and at my vulnerable state of mind...I probably focused more on the negative things I read rather than the positive). I must say that I have spoken with many women and have heard NUMEROUS success stories; and I feel very positive for each and every one of you!! Thanks to God, Modern Technology, Constant Research, and Good Doctors!!   I hope this helps!",
      "MessageIndex": 42,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762874",
      "Title": "T3N1M0 is locally advanced or early stage? Nevo84 kathleen1966"
    }
  ]
}