{
  "AuthorID": "Dogmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
  "Posts": [
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 11, 2011 04:16PM Dogmom wrote: First TCH yesterday. LONG Day but no issues at all! Kind of tired today but think it's more the tireness from stress of worrying before it started!",
      "MessageIndex": 497,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 27, 2011 12:50PM Dogmom wrote: Ashevegas, I would happily trade! Asheville has so much more going on and right now I would like to fit in with the abnormals.  Normally small town is nice but I hate having to explain things all the time. I would like to ignore this chemo thing as much as I can! Taylor777, my port has been in for 3 wks and it's still a little sore for me too. I hate it. Something about this big lump really bothers me. Plus there is something going on with the neck incision, so I have a lttle lump there too. Seeing the doctor on Monday and going to ask about that. I know it's better than getting stuck in my veins as it usually takes some time to get it right but still.....  Hope everyone in the path of Irene stays safe! Everyone hang in there, we will get through this!",
      "MessageIndex": 1109,
      "PostDate": "27/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 30, 2011 10:34PM Dogmom wrote: YAY Madismommy! Only 5 more to go!!!!!!  Even at my most tired after the first one, I was able to do some stuff including a walk to enjoy the weather.  It's more a mind over body thing I think but I always felt better after I did something! Happy Anniversary, Grimbol! Tried on the wigs and decided they needed some help before I wear them, so put on one of my hats. I got a lot of compliments! Don't know if it was because they felt sorry for me or not but LOL I'll take what I can get. I know that at least one person did not know I was doing chemo so maybe it was the hat!  Don't think Scarves are gonna be my thing but I do like the idea of a gyspy for Halloween so maybe. haha Hope everyone is hanging in there! Chris ",
      "MessageIndex": 1217,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 7, 2011 09:02PM Dogmom wrote: Hi, I'm finally posting. Been lurking for awhile now. Part of me doesn't want to admit I am about to go through this although I've already had a lumpectomy and got my port on Friday. Already bought some hats and one wig. I start chemo on Wednesday, August 10th. I'm scared to death. I keep trying to stay postive and I know I'm a tough woman but this has really knocked me down. Got lots of support but I'm independent and not use to depending on anyone! I've got months of this to look forward to. I'm so grateful for this group, hope you'll will have me!  ",
      "MessageIndex": 327,
      "PostDate": "07/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 15, 2011 03:51PM Dogmom wrote: Fostering is a great way to save lives! It's hard to let them go, some more than others, but when you see them with their new families it makes it all worthwhile. AND nothing wrong with being a foster failure either, if you have the time for more dogs.  VtEllen, dogs do make us stop our whining don't they? LOL  Before I was diagnosed, I was losing my mastiff mix to cancer, he was always happy even when he didn't feel good and he was his dogself until the end. Funny thing about that, he is the reason I discovered my lump. I was helping him walk at the end, felt the lump, assumed it was just muscle strain. When he passed, the lump was still there and decided to have it checked out, something I probably would have ignored, otherwise. That lump came up sooooo fast. Part of me feels like Hercules wanted to make sure I noticed that damn thing. When it was removed my margins were clear. If I hadn't noticed it during that time, I could be dealing with a lot worse than I am.",
      "MessageIndex": 650,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 18, 2011 10:47AM Dogmom wrote: Good afternoon, everyone. I too am not getting the neulasta shot. The nurse was kind of surprised about that. I haven't had any major side effects from my first TCH and also not from my Herceptin, yesterday.  Tiredness has been the biggest issue and not been that bad.  I've been feeling pretty good for the last couple of days. The only training I was given was a silly DVD. I had already read the info so it was nothing I didn't already know. I cut my hair short preparing for this, but haven't started losing any hair yet. Only 8 days in so expecting a lot of changes. I had clear margins but my Doctor gave me the stats and said because of my age would recommend this regiment. It went for almost 50 percent chance down to less than 20 percent. When  asked what he would want his wife to do, he told me, this! So here I am. He was my mother's Ocon 10yrs ago when she was diagnosed. She is still doing great and cancerfree. I hope everyone is hanging in there. We are gonna get through this and move on to bigger and better things!",
      "MessageIndex": 792,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 12, 2011 11:01AM Dogmom wrote: Hard to keep up with all the posts but wishing everyone good luck! Tired but getting some things done so feel ok. I am so grateful to have this to run to...it helps so much, even if I can't keep up! I hope everyone is hanging in there and has a good day. We're gonna get through this! Chris (aka DogMom) ",
      "MessageIndex": 539,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 30, 2011 08:04AM Dogmom wrote: Madismommy and Taylor777, ((HUGS)) you are both going to get through this just fine! My thoughts are with you, Husband shaved my hair last night and now he is calling me GI Chris. Not the end of the world that I was imagining. I look in the mirror and laugh. The only stress was right after it was done all my dogs started barking at me. LOL They didn't recognize me for a minute. But now all is fine! Tomorrow is number 2. After that only 4 more to go.Woot! Hope every one has a good day! Chris ",
      "MessageIndex": 1191,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 31, 2011 12:28PM Dogmom wrote: Good luck to everyone getting treatment today! I'm heading there in an hour. Only 4 more after this. Count down to a new life after chemo! Although still have radiation and Heperceptin to look forward to but THE HAIR will start growing back.   Robyn, Had the same issues with my port. Sore throat everything. It got better after my first treatment 6 days later, Srill got a lump on my neck and I thought it was infected but dr. says no. It's just red, not hurting anymore! Now that my head is shaved, really not too bothered by it. It's kind of growing on me... in a weird sort of GI way! LOL We are fighting a battle so why not use those kinds of terms! I have my moments but the hats I bought are really comfortable and I don't look too awful in them. The bald head is very white....that I need to fix before flaunting it to everyone! haha Do dog rescue so thinking I will be paintng some lovely things on my head about adopting a shelter dog etc. We are gonna get through this! HUGS TO ALL OF YOU! Chris ",
      "MessageIndex": 1232,
      "PostDate": "31/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 10, 2011 11:36AM Dogmom wrote: LOL Ybrooker I did the same thing. Diagnosed at the end of  May  had some major denial, had surgery to remove the lump, back in denial and said OK give it to me AFTER a small vacation at the end of July.I am gonna fight it like a girl too! Heading for my first treatment in an hour. Oh boy...here it comes!  Think I'm gonna be just fine and so is everyone else on this thread! We're all gonna kick some cancer ass!!!!!!",
      "MessageIndex": 410,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 15, 2011 09:04AM Dogmom wrote: Good morning! YaYa5 I'm also doing TCH. Days 3 and 4 I felt pretty yucky but still managed to get to the store and even pick out paint for the living room.  One of the positives of this whole thing is that my husband is FINALLY getting a lot of projects done he had put off and NO not because of me being diagnosed. Some of those projects were suppose to have been done in January. I'm feeling much better today which is good and really glad to hear that there are good days, I was worried yesterday. I got my hair cut last week, it was pretty traumatic but now kind of like the short hair. Dreading when I lose it but like Chrys said, it will grow back. I've always had straight hair so curious to see if I get a little curl when it comes back. Now that would be AWESOME! My dogs and my foster dogs keep me laughing and make it very hard for me to sit around feeling sorry for myself for long, but there have been a couple of times they've had quite the job when this all started. Now that I'm in it, I know I can do this and will survive. ALL OF US WILL! I am so happy to be able to come here and know I'm not alone. Hope everyone has a great day!",
      "MessageIndex": 635,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 15, 2011 01:27PM Dogmom wrote: Kasi, love your description, I felt like a zombie with the flu, too!   I have 10 dogs at the house right now. (yeah I know, I'm nuts) 5 of them are looking for homes. All are rescues. Rescuing is going  to keep me sane during this whole chemo thing. It keeps me focused on something besides what is going on with me. Dogs are the best!",
      "MessageIndex": 641,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 26, 2011 08:27PM Dogmom wrote: Wow...a lot to catch up on. I was feeling a little guilty because I was feeling pretty good with really no major s/e and the hair was holding up. Well it is official, it's coming out like crazy now. UGH I thought I was ready to deal with it. Got pretty emotional over it all today. Thinking shaving it off in the next day or two. Ashvegas, I'm about 45 mins down the mtn from you in Landrum SC. I was in up there last night. I think Asheville is a great place to be bald. They expect things like that there! I love Asheville! Chrys23. glad your furkids are back home and doing better!  Mine are keeping me sane and helping me be focused on something besides myself! Rescued a new one this week that is incredible.   I go for my next TCH on Wednesday...hoping it goes as easily as the first. Hope everyone is hanging in there!  It's only hair, it's only hair, it's only hair...it will grow back.....  ",
      "MessageIndex": 1088,
      "PostDate": "26/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    },
    {
      "AuthorID": "Dogmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132694/profile",
      "Content": "Aug 29, 2011 08:21AM Dogmom wrote: Jendon, my hair started coming out on day 15 after also having TCH. I still have some but it is getting harder and harder to ignore. Think I am going to follow Doodlebug's example and shave it and get it over with. Thank you for the laugh about it all, Doodlebug!  I hope I'll be as brave! Some of my dogs barked when I put on a ballcap....can't wait to see their reaction to baldy! Dr appt and lab today and another round of TCH on Wednesday.  Hope everyone's S/Es are minimal! Chris",
      "MessageIndex": 1163,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771492",
      "Title": "August 2011 chemo, anyone w/ me?! vtellen MizMarie"
    }
  ]
}