{
  "AuthorID": "doingbetter…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
  "Posts": [
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Oct 9, 2010 12:00PM doingbetter wrote: There was something on the local news here in NY about that last week, and the patient was very happy that she had seen significant improvement.  You might be able to find the story at www.7online.com.  I absolutely hate shots of any kind, but tried accupuncture for something else a few years ago after running out of options and have to say that it was not bad at all.  Depending on your insurance plan, it may even be covered - I know mine was.  But, judging from this news story, it might be worth a try.",
      "MessageIndex": 5,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/759098",
      "Title": "Question mittmott Julie50"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Aug 17, 2010 09:32AM doingbetter wrote: Mine also was not working properly.  Fortunately, there was lots of gauze around where the drains came out of the body, so they absorbed the leakage.  I ended up running to my dr.'s office several times over the next 10 days or so.  They told me it was because of clotting getting stuck and would clean it up and send me on my way - always keeping plenty of gauze over the site.  Finally, they were happy enough with the amount of swelling and figured the drain wasn't doing it's job right anyway, so pulled the drains out.  Even though some swelling remained, that fluid gets reabsorbed by the body and things go down after a while.  I really had no other problems.",
      "MessageIndex": 3,
      "PostDate": "17/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/756833",
      "Title": "Leaky drain!! CheriD Marly"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Mar 4, 2011 06:00PM doingbetter wrote: There are many beautiful wedding gowns out there.  While many are strapless, there are many other choices that will work just fine with a prosthesis.  We have been to several weddings where the bride has worn a very nice dress with sleeves and high enough front that a prosthesis would not be an issues.  Even though it's been a while and before my mastectomy, I could wear the exact same wedding dress today with prostheses with no problem.  So, I would not worry about it.  There are so many choices out there in dresses that you should be able to find something very nice after your surgery.  Just as an aside, I have been to many formal events since the surgeries and have always been able to find something nice that works with prostheses.",
      "MessageIndex": 2,
      "PostDate": "04/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/765758",
      "Title": "Wedding Dress Shopping bimmer2011 MiniMacsMom"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Aug 3, 2011 07:40PM doingbetter wrote: I'm not sure why, if people are concerned about prostheses setting off the scanner, they just don't opt out.  Not that the pat down is pleasant, but it certainly beats the scanner + explanations + pat down ultimately in most cases anyway.  Personally we have cut down significantly on air travel because of these ridiculous procedures, but when we have to fly and are faced with the scanner just \"opt out.\"  I don't believe for one minute that these machines are \"safe\" and no one in my family will subject themselves to them.  I have been able to keep my private matters private and the prostheses have never been an issue going through a metal detector and getting patted down.  As I said, I would never go through a scanner because of safety concerns, but feel that if I did with a prosthesis I would just be crying out for the extra attention since they can cearly see this anomaly on their screens.",
      "MessageIndex": 8,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/771466",
      "Title": "Breast prosthesis & airport security 15yrscounting mthomp2020"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Oct 16, 2010 03:08PM doingbetter wrote: I consulted with a few oncologists after my diagnosis (all in NYC, but different hospitals) and one did say he would do chemo no matter what, even though sentinel node was negative.  He didn't believe in the Oncotype test and said if it was up to him, he wouldn't even order it. The others all went by the test, which thankfully was low.",
      "MessageIndex": 1,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/759452",
      "Title": "Use of Oncotype lola12 kira1234"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Aug 6, 2011 05:27PM doingbetter wrote: Up in northern NJ, I have used the shops at Valley Hospital and Hackensack Medical Center.  Don't always love the fitters, but they had large selections and I would just try different ones myself.  In NYC, I like the shop at NYU Medical Center.",
      "MessageIndex": 1,
      "PostDate": "06/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/772774",
      "Title": "fitters in NJ/NY/PA??? caaclark NJMarilyn"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jan 16, 2012 03:01AM doingbetter wrote: So long as I am feeling well and seeing my doctors reguarly for follow up (physical exams, blood work), and recommended screenings, I would rather live with the belief that I am fine and not go looking for things. While there is always going to be that \"worry' that something else might be looming, there is no real benefit to finding mets before you start having symptoms. And no reason to think you do at this point. If you really want a PET scan, then I don't see why you couldn't get one if you insist on it. The only issue might be with your insurance company, but a doctor should be able to justify it.",
      "MessageIndex": 1,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/781085",
      "Title": "Has anyone insisted on a PET scan? perky perky"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Oct 12, 2010 06:34PM doingbetter wrote: Sly - I agree with so much of what you are saying.  Even though I've never taken any kind of estrogen drug, breast fed two kids, hardly drink, exercise and have always been at a healthy weight - STILL got breast cancer.  But - I do agree with your thinking and feel that much of the public effort and information is misdirected.",
      "MessageIndex": 1,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759237",
      "Title": "Lowering Breast Cancer Risks sly doingbetter"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jul 1, 2010 10:24AM doingbetter wrote: I believe the drains are to remove the fluid that builds up after surgery.  I had a mastectomy (no reconstruction) several years ago, and luckily did not need a drain (no node removal) and felt pretty normal by the second day after surgery.  Avoided driving and strenuous activity and got tired a little more easily, but otherwise felt pretty good - there was actually less pain than after the previous lumpectomies.  I will need a drain for the next one, and from what it sounds like that makes the whole thing a lot more annoying. ",
      "MessageIndex": 1,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754808",
      "Title": "Drains notsure Gabrielledr"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "May 2, 2012 12:01AM doingbetter wrote: I fretted about this too and had gone back to the surgeon for the umpteenth time because the drain kept clogging. I didn't think it was ready to come out and she didn't say anything, I felt a little tugging (thought she was cleaning it as before) and next thnig I knew it was out. It felt great! And I am a big baby...but no problem at all with no pain medication,",
      "MessageIndex": 7,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786782",
      "Title": "Drain removal with no pain meds?! Stormynyte SerendipiTea"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Nov 16, 2010 11:47PM doingbetter wrote: I also never had a problem with the prosthesis with the \"old\" screening methods.  Obviously they will show up as a foreign object on x-ray machines. But, the even greater concern is the radiation exposure.  At least two airlines are instructing their pilots and employees not to go through them because of the health risk and I've read in several places that there is concern about increased risk for skin cancer and eye damage from the exposure.   I wonder if during a full body pat down they can tell the difference between real breasts and prostheses. Which of course makes one wonder how much these pat downs can really reveal since people may have various kinds of \"items\" on their body for medical or hygeine purposes and real terrorists can figure out ways to hide things.  Meanwhile, I've heard from a couple of people we know how uncomfortable they felt by having a stranger rubbing her hands all over the body.  I've also been told that you are better off being screened in front of others with witnesses since some people have complained that in private the agents can be more abusive as there is no one there to see what is happening. The whole thing really stinks - bad enough for the average person, but especially problematic if you have a medical condition that you don't really feel like explaining or justifying to the whole world.  We used to travel quite a bit, but are definitely cutting back on the optional trips.",
      "MessageIndex": 34,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Nov 29, 2011 02:16PM doingbetter wrote: I don't think much has changed either. And we have also chosen to drive instead of fly when practical. Otherwise it's still pretty much dumb luck. I always opt out of the scanner, (no matter which type, I have serious concerns about their safety) and do not mention anything about prostheses. Based on what I've heard from others I know in similar situations, I am certain that more often than not the scanner will pick up the prostheses as an anomaly, possibly subjecting one to the patdown anyway. In those cases, the women have been subject to much more invasive patdowns and scrutiny of that area. By opting out of the scanner and not saying anything, aside from the generally uncomfortable nature of the patdown, there has been no additional invasion of privacy or scrutiny - I don't think they are feeling you hard enough in that area (at least they haven't been yet) to notice the difference between real breasts and prostheses. Just wear a good bra and top...My big concern is if we ever get to the point where you are no longer given the option to opt out. Aside from the privacy concerns, those machines are just way too new with absolutely no regulation for anyone to be saying they are safe.  Even the millimeter wave machine is basically the same technology as a microwave oven. Would you stick any part of your body into your microwave and turn it on?",
      "MessageIndex": 140,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Oct 13, 2010 05:10AM doingbetter wrote: It's a shame that TSA isn't better educated to deal with this issue.  In addition to the invasion of privacy, I'm surprised more people aren't concerned about the radiation issue. I know that we are all told it's a minimal amount and \"safe,\" but these things do break down and malfunction and by the time that's discovered the damage is done to the poor people who have been exposed to it. There was just an article in the NY Times on 9/12 about this. And it's no secret the number of radiation overexposure cases around the country at major hospitals.  While it's one thing to have to deal with radiation and take the risks when one is being treated for an illness, it's quite another to treat this risks so casually when it comes to traveling.",
      "MessageIndex": 23,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Nov 17, 2010 02:17PM doingbetter wrote: I'm wondering if Sherri's friend hadn't told them about the prostheses and simply opted out of the scan whether or not they would have known the difference between real breasts and prosthetics.  The whole situation is just so creepy and bothersome.  And I'm really losing my patience with people who shrug it off in the name of security.  kmmd hit this right - it's amazing what people in this country will fight for yet act like lemmings for the really important stuff. If anyone thinks about it for half a second they would know that neither the scanners nor the patdowns are going to find something a real terrorist wants to hide.  There are still other ways.  Another point to the ridiculous was a piece in the Bus. section (Itineraries) of Today's NYT where they even talked about sanitary napkins being detected in the xray machine and the TSA Administrator instructing his agents to use their discretion in exploring further.   We used to love to travel, but have decided to cut back dramatically. Already gave up the after Christmas  and Pres. bday trips this year and just planned our 4th of July vacation to someplace we can drive to as opposed to the further distances we typically go.  Now just have to see if I can stomach the March trip we have planned out West which is already booked.  Hopefully things will settle down by then, but if I keep hearing these humiliating stories - not just here, but have been all over the news - I wouldn't hesitate to cancel.",
      "MessageIndex": 54,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jan 1, 2011 11:13AM doingbetter wrote: I was 48 at time of diagnosis and at first, chemo was a bit of a question mark.  One onc said no matter the oncotype score he would recommend it because of my age.  But every other dr. thought it was overkill.  BUT, the big depends was the oncotype score.  With my path results they did not think it would be high enough to warrant chemo, but we had to wait and see as sometimes the oncotype score is not what they think it would be - that was a very long waiting period...Luckily, it was low enough (11) that all the other opinions I received felt chemo would not offer much additional benefit over the tamoxifen. Whom you choose to tell and in how much detail is a very personal thing.  Especially as a parent, I completely understand your concerns.  I myself am a very private person and don't like to worry anyone (also lost a couple of family members to cancer) and also felt that the surgery and hormone treatment would be easy enough to handle without making a big deal out of, but chemo would be a lot harder to keep \"quiet\" about.  And even if you're not that sick, the chemo more often than not, makes you seem much sicker to people.  My kids were older so I did tell them a little more about the cancer, but even with a mastectomy, it was a fairly easy surgery for me and they never saw me not well enough to function fairly normally which I think kids find reassuring. I'll keep my fingers crossed for you that you get a low enough oncotype score to avoid chemo - and at this point, you might as well believe that you will since that is more likely than not...On the flip side, there are many women who are able to get through chemo fairly well without too many issues so you may still be able to spare the kids too many details.",
      "MessageIndex": 5,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762764",
      "Title": "If you were stage I, did you get chemo??? mdg SusansGarden"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Oct 1, 2011 05:46PM doingbetter wrote: Barbara,  Great picture. And you are correct. I think it is a very well balanced article. Thanks for the link.",
      "MessageIndex": 5,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/775807",
      "Title": "Chicago Tribune article about post-mastectomy options Erica Tina337"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jun 30, 2010 07:09PM doingbetter wrote: Gutsy, My world was turned upside down only two days ago and here I'm already trying to be encouraging - hopefully you take that as a good sign that you're not going to constantly feel as awful as you are now.  Getting the news at first is the most horrible feeling. And it's amazing how one moment you feel in control and that things will be fine, then another you can't stop crying.  This really is an awful time.  I'm a fairly even-keeled person who has never had any issues with moods or depression and have been on the most sickening emotional roller coaster ride for the past couple of weeks.  I had already been through this with DCIS a number of years back, so even from the time they saw something on ultrasound, already knew it could be happening again and that it didn't look like \"only\" DCIS this time.  The only bright side for me is that I can't eat when I'm nervous and have already lost several pounds.  Although I doubt that bodes well for good health...I have found that as I'm gathering information and meeting with doctors - I just set my surgery date - I do feel a little better in that I'm on my way to doing something about it.  We are all thinking of you and you are not alone.  Hang in there!  Ann",
      "MessageIndex": 4,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/754793",
      "Title": "Just Diagnosed and starting to get blurry and imobelized gutsy Kodapants"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Mar 7, 2011 05:20PM doingbetter wrote:",
      "MessageIndex": 6782,
      "PostDate": "07/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Nov 4, 2010 05:14PM doingbetter wrote: oakley, while I was treated at a different hospital in NY, I have only heard wonderful things about Dr. Heerdt from many sources. I was a little wary about having my follow up at MSK. But a consult certainly wouldn't hurt. I've been through this twice, and have gotten as many as three surgical opinions each time.  I've also learned that if you love a particular surgeon at one hospital, it does not mean you need to be treated by an oncologist there also.  Especially in NYC, there are many good choices.",
      "MessageIndex": 4245,
      "PostDate": "04/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Dec 2, 2010 10:28PM doingbetter wrote: jp3 - From personal experience, I like the simpler approach.  I can say that the simple mastectomy was really simple.  I was back to normal very quickly.  Even under the best case, with no complications, reconstruction takes time, effort and some pain.  I felt that rather than rush into it, I would see how I felt after the mastectomy, then if I really wanted it could go back for reconstruction and because I really wanted it, not mind as much if I suffered the hassles and possible complications.  I had my first mastectomy 10 years ago after a couple of bouts of DCIS and never felt like I wanted reconstruction.  With my more recent experience and mastectomy on other side, I thought about it some and while I can't say for sure that I'll never do it, so far I'm fine the way things are.  Under any circumstance it's a very personal decision, but so long as you're comfortable with what you decide for yourself you should be fine either way.",
      "MessageIndex": 4936,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jan 22, 2011 12:07AM doingbetter wrote: Meece, Is that Armenian you're typing? Where did you get the font?",
      "MessageIndex": 6081,
      "PostDate": "22/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jun 29, 2010 06:16PM doingbetter wrote: Hi - just wanted to introduce myself as I will most likely be having surgery in July.  Will be seeing surgeon tomorrow to set date.  Been through this once 10 years ago on the right side for DCIS and honestly, the simple mastectomy wasn't too bad. But I had no reconstruction and no nodes taken back then.  So, it really was \"simple.\"  Now it's time for the left with a finding of IDC (won't have complete diagnosis until after surgery) and will do SNB.  I may reconsider reconstruction now that it is both sides, but will not do it at the same time as mx under any circumstance.  I've been fine with just the one, so want to see how I'll feel about it before committing. And my husband's been totally nonplussed about the whole thing - just glad when we're all healthy and enjoying life.  I'm 48 now with two teenagers. This may sound terrible, but with cancer I really wish I was older.  The worst part about this is the thought of what it might do to my kids.  I really feel for you ladies with younger children.  Mine were quite young with the DCIS, but fortunately, it was a relatively easy surgery at the time with no further treatment required.  Let's see what happens this time... Ann",
      "MessageIndex": 51,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jun 30, 2010 02:14PM doingbetter wrote: So now it's really real. My surgery is scheduled for July 7.  Shawn, Wow, can I relate to the comment about time and vacations.  This time just seems interminable and we were just on a vacation not long ago that flew by...I like you will revist reconstruction at a later time. I'm wishing everyone here a good month (under the circumstances).  It should feel good to have this phase of the treatment over with. sespebadger - I understand the worry about your daughter. Mine is now 17 and I have a 15 year old son, and more than myself I worry about the impact on them.  But everyone tells me that kids are resilient.  I think we can do a lot to put their minds at ease through our own behavior.  Of course I worry about my daughter in terms of her own risk for this dreadful disease, and at her age, she is pretty cognizant of it.  I guess on the bright side, maybe she can start leading a healthier lifestyle at a younger age. Who knows what role that really plays, and not like most of us are \"unhealthy\" but it can't hurt to try.",
      "MessageIndex": 58,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jul 7, 2010 06:07AM doingbetter wrote: Melissa - you're so good about keeping all this straight!  Anyway, thanks for the good wishes. And best to everyone else who is up soon.  I'll be glad when this part is over with!",
      "MessageIndex": 143,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jul 16, 2010 11:27AM doingbetter wrote: calamtykel - I also felt wrapped a bit like a mummy with all the the tape.  And the doctor told me I could take the dressing off myself a 3-4 days after surgery.  That would have been last weekend, but I had to go in on Friday because of an issue with the drain.  While I was there, he and the nurse took everything off and cleaned up.  I have no idea how they thought I could ever do that myself!  There was so much tape wrapped around and stuck on.  But, it was not painful.  Might feel a little weird because the sensation of the skin in that area has changed (at least for me), but especially in the hands of the \"professionals,\" I would not worry about it being painful.",
      "MessageIndex": 258,
      "PostDate": "16/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jul 15, 2010 03:00PM doingbetter wrote: Got the drains out today (8th day after surgery).  What a relief!  I think the pantyhose in the shower suggestion was great.  Seemed to be the least obtrusive way of holding bulb while showering.  My favorite cami ended up being the Softee Two from Ladies First.  I had to cut the pocket a little bigger to fit the bulb - ended up safety pinning it in, but it was an extra layer of nice soft cotton between the plastic and the skin.  A very soft cami overall with pockets to add \"fluff\" to even out breasts.  I had also bought microbead breast forms from the American Cancer Society tlc website which are very light and easy to use just after surgery.  Being that I had one side done several years ago, with the swelling on the \"new\" side, I'm a bit uneven right now, so used the breast form on one side and the fill that comes with the camis to even out on the other.  But as soon as one wants, the microbead form is  safe and lightweight enough to use until ready for a real prosthesis.  I can also say from experience (for those of you opting out of reconstruction), that aside from being flat, things do smooth out and get even over time.  Nothing especially unattractive about the mastectomy site - which I know is hard to believe right now...And I did find the loose, button down shirts important this past week to cover the drains/tubing and unevenness of everything. Question: For those of you already through this - I've seen some talk of the numbness and weird  feeling in upper arm.  I only had two nodes removed, so am suprised by how much I'm feeling this.  It comes and goes, but feels like a rug burn just below the armpit into the arm.  And the back of my arm feeels numb.  Anyone else know how best to deal with this or what to expect long-term?  With my rt mx years back, no lymph nodes were taken so this was not an issue.",
      "MessageIndex": 250,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "May 2, 2012 05:57AM doingbetter wrote: I was 48 when diagnosed with an oncotype of 11, saw three oncologists, two were quick to say no to chemo and one said why not - the usual, you're young and healthy and hit it with everything we've got. But the relative percentage benefit was extremely small. While everyone talks about getting through chemo okay, people fail to remember that even if you make it through fine, there is a very real risk of a secondary cancer such as leukemia developing later because of the chemo and that type of leukemia is not easily treatable. While the risk is small, if it is greater than the benefit one might get from adding chemo into the mix, then for these early stage cases with low oncotype scores, I don't think it's as simple as saying hit it with everything you've got since you could be setting yourself up for something worse down the road. I think people really need to think about all the benefits and risks very carefully - not just the immediate side effects. In my case I would have been more worried about the higher likelihood of a more problematic cancer than the small benefit chemo might have offered. Bottom line is none of us, especially in these borderline cases, will ever know if the chemo helped keep the cancer at bay or if we didn't choose chemo and cancer came back would the chemo have made any difference. You just have to really think through all the possibilities and work with trusted medical professionals to reach the decision that is right for you. ",
      "MessageIndex": 45,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786563",
      "Title": "In your 40's with low Oncotype score, what was your decision? gracebead p22nut5"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Nov 17, 2010 11:38PM doingbetter wrote: KerryMac It's still somewhat random who gets picked to go through the scanners and get the enhanced patdowns, so while not a great deal of comfort, we can all keep our fingers crossed that we won't be the one.  Also, make sure to dress very carefully so as not to set off the metal detector  since it seems like it's usually the people who set those off (aside from the body scanner opt outs) that get the more invasive searches and pat downs.  There's also some hope (although with TSA it's probably very slim hope) that with all the opposition maybe they will tone things down a bit over time.",
      "MessageIndex": 57,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/757010",
      "Title": "Full body scanners and foobs OLBinNJ Leah_S"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jun 30, 2010 09:53PM doingbetter wrote: Good luck tomorrow, Ducki. And Orchid Girl/Melissa - while I wish I didn't have to be here, thanks for the welcome and it's wondeful that through this ordeal people can be so supportive of each other.  Maybe as a second job, you should become an online nutritionist while you're at it.  I've been trying to get us all to eat better and be more careful of things, but now it's become a top priority and I'd love to have someone guide me along.  Have a good night everyone.",
      "MessageIndex": 70,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jul 8, 2010 01:44PM doingbetter wrote: Thanks to everyone for the positive thoughts. Had my surgery late yesterday and was home this morning.  Overall, not too bad (but no reconstruction - just mastectomy and sentinel/few nodes). It's definitely nice to be in my own home and bed and doing things at my own pace - even got a small load of laundry going.  While uncomfortable, after the first few hours , pain has been manageable - used percocet last night, and maybe will tonight but nothing during the day yet today and will probably try Tylenol first if I feel the need.  The drain is an annoyance, but getting by with a loose button down shirt over it and it's not noticeable.  If it wasn't so humid out, I'd even be up to venturing out on foot.  Car rides may be a little tricky for a while.  We are just a short taxi ride from the hospital and I held tight to the door handle to avoid any bumps...As everyone else has said, the aniticipation is much worse and it feels great to have the \"thing\" out of us.  So, good luck to all who follow.  You'll get through it and feel much better soon afterwards!",
      "MessageIndex": 165,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Aug 6, 2010 12:46PM doingbetter wrote: Thanks for the info.  I did try using an electric razor.  It feels so weird with the semi-numbness under the arm which still comes and goes, and I can't get the whole area done at one time... Calamtykel:  I also have not been noticing any perspiration on the operated side.   My surgeon said that is normal and should come eventually.  I had read about Crystal somewhere else also, so might as well be ready when the need arises.",
      "MessageIndex": 414,
      "PostDate": "06/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jul 1, 2010 01:25PM doingbetter wrote:",
      "MessageIndex": 74,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jun 29, 2010 04:50PM doingbetter wrote: You absolutely must do what you think is best for you.  As someone who has just been diagnosed a second time in the other breast, I can only say the best thing is to have no second guessing yourself.  Might always wonder if you could've/should've done something different, but at least you know you did what you thought was best at the time.  I will tell you my personal experience. I was first diagnosed with DCIS by surgical biopsy 11 years ago. Then had a lumpectomy. It was very small with clear margins so no radiation was recommended at the time. A year later, more DCIS in the same breast. At that time, the choice was either lumpectomy and radiation or simple mastectomy. I'm also quite small and was tired of dealing with it and much more concerned about the radiation than the mastectomy. While no surgery is pleasant, once it's done, it's done and no side effects to speak of - I actually felt better after my mastectomy than my lumpectomies. I also chose no reconstruction, and must say that my woman surgeon was quite dumbfounded. She said none of her young patients would forego reconstruction when given the choice. My children were quite young at the time (I was 38) and I just wanted the simplest treatment so that I could get on with my life and I figured if and when the time came to deal with the second breast, I'd revisit the idea then. Other than the minor inconvenience when getting dressed, it has never bothered me or my husband, for that matter. Now I am dealing with IDC in my other breast and while the tumor is quite small, will again opt for the mastectomy. It is easier to decide that having been through it once before, but again, I prefer the more straightforward treatment. I know mortality may be the same, but personally, I can't deal with the angst of the 6 month mammos/sonos, etc. and suspicions and worries. I've also revisited the reconstruction issue and one thing that is clear is that if it is not an \"emotional\" issue for you, other than the fact that there will be an additional surgical procedure, it can be done at a later date. I remeber reading somewhere on these boards that you should be sure you really want it before you go ahead - it's easier to go back and reconstruct later than to go back and deconstruct if you're not happy.  So, I figure I need to really want it before I decide to go forward. Then I'll be more willing to put up with any pain, complications, etc. rather than wondering why I put myself through it. At the end of the day, it really has to be your decision which form of treatment your want and are most comfortable with so that you can live with the decision.",
      "MessageIndex": 11,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754729",
      "Title": "Why won't my surgeon work with me? calamtykel calamtykel"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jul 5, 2010 12:45PM doingbetter wrote: Good luck tomorrow, photobug.  The anticipation/anxiety is really tough - and I've been through this once already!  However, being DCIS there was no node removal involved at the time and I was told repeatedly that the surgery would take care of everything.  And I guess it did for that breast, but now time for the other - a little more involoved.  I wish I could split the difference with those of you who eat too much when anxious.  I'm the exact opposite - a few bites of food and my stomach shuts downs when I'm so nervous.  I've already lost 7 pounds since this whole mess started in June.  We should all feel good though once the surgery is done and we know the \"bad stuff\" is out of us.",
      "MessageIndex": 116,
      "PostDate": "05/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jul 15, 2010 06:41PM - edited Jul 15, 2010 06:42PM by doingbetter Melissa - Don't want to scare anyone about the drains.  They're not terrible - just annoying and awkward.  It's probably a good idea to have some button down shirts to wear right after this kind of surgery anyway.  And while it's understandable to be nervous about any surgery, you are also so right to be looking forward to it.  Especially with DCIS, it's nice to know that after the surgery you're virtually cured. I know I was so happy about that the first time I dealt with this that any other discomfort I felt was easily forgotten.  And, 1marmalade - thanks for the reassurance about the arm.  That's bugging me more now than anything else...",
      "MessageIndex": 254,
      "PostDate": "15/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Aug 5, 2010 04:32PM doingbetter wrote: Have any of you been given any restrictions about shaving under the affected arm or using deodorant?  and if so, for how long?  I've been hearing different things. Thanks",
      "MessageIndex": 410,
      "PostDate": "05/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Nov 17, 2010 09:49PM doingbetter wrote: boatergrl- Our diagnoses sound similar, and I know exactly the feelings you're describing. I felt like each time I got one result, I had to wait for another with the oncotype being the last piece.  Basically from the time of initial diagnosis to final treatment plan (about 6 weeks in my case) it felt very surreal to me and I did not feel like I was living my life at all.  I got a few different opinions from oncologists and felt overwhelmed by all the opinions and possibilities.  BUT, finally the pieces all came together and when I found the dr. I felt most comfortable with and my treatment became clear, I finally started to feel somewhat normal again. I think we all have our own ways to get through this time.  I know some will use some kind of medication.  In my case, I was quite nervous, but just kind of plodded through.  It did help to talk to a few people who had been through it a while back and were doing fine.  But I also did not tell many people so when I was going about my usual daily business I was able to get caught up in the usual routine of things without my condition being the focus.  I can tell you, as I'm sure you have heard from others on these boards, that the diagnosis and waiting stage is emotionally the hardest part.  Sounds like you're almost done with that, so just hang on to that thought.  I can tell you now, while I'm still not thrilled with the situation, I'm pretty much back to normal.  There is always a nagging worry in the back of my mind if something will recur at some point, but as I'm reminded by others something bad could happen to anyone at any time.  And, I have also used this wake up call to adopt an even healthier lifestyle. Not that it's any guarantee of anything, but I sure do feel better.",
      "MessageIndex": 4573,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Nov 16, 2010 10:58AM doingbetter wrote: I don't think anyone can say for sure that the cancer recurred because they did or didn't do chemo.  Many people who've gotten chemo still have the cancer recur, and it's a known fact that chemo benefits a very small percentage of patients who take it.  That's why it's nice to have the oncotype test - while no guarantee, at least it's another piece to factor into the decision.  Doing chemo carries a whole host of risks aside from just the unpleasant immediate side effects, and the notion of hitting the cancer with all they've got seems a bit overkill if you are in a low risk group when you consider the potential long term harm that chemo can cause.  But, it's a very personal decision that needs to be weighed carefully taking all risks into careful consideration.  Personally, I can't look at chemo as just insurance - if there's strong evidence that one may clearly gain a benefit then I would never say no, but otherwise you are putting yourself at risk for other issues.  Luckily my oncotype score was low enough to have a clear answer, BUT...no one ever knows for sure what's enough so you just have to make a decision that you are comfortable enough to live with.",
      "MessageIndex": 4537,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Jun 1, 2011 07:22PM doingbetter wrote: Shippy  I know some people are very happy with the microbeads, but I did not like them at all.  I used them for a short time after surgery, then got silicone prostheses as soon as I could.  I had a single mastectomy several years ago so was already used to using a prosthesis, but then had to get another mastectomy last year.  I can't speak for how you will adjust to the prostheses, but aside from it being a little bit of a hassle and adding a few more minutes to my dressing time, the \"real\" ones (silicone) don't bother me at all.  They look much more real than the microbeads, and once dressed no one would know the difference that they are not \"real\".  The microbead was not the same - they kept shifting around and looking uneven.  There is a short time after surgery that you may not be able to wear silicone prostheses and the microbeads are an okay stand in, but you do not have to use them forever.  And I actually preffered the \"pouffy\" type prosthetic (some kind of a fiberfill) over the microbead during the transition time.",
      "MessageIndex": 205,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "doingbetter…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104171/profile",
      "Content": "Feb 25, 2011 01:47PM doingbetter wrote: Personally, I liked getting it the same day of surgery. The first surgeon I saw wanted it done the day before, but the doctor I ended up using just scheduled it a couple of hours before surgery time.  The wole BC experience is bad enough without having to stretch things out over a couple of days as far as I'm concerned.  And it did hurt - not awful like some people on these boards describe, but I was sore for a while so would not have wanted to go home and try to go about my business feeling like that.  I figured I was going to the hospital for surgery anyway and that day was kind of shot, so why take time out of my prior day for a medical procedure also.",
      "MessageIndex": 1,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765445",
      "Title": "Question about timing of injection for SNB GabbyCal GabbyCal"
    }
  ]
}