{
  "AuthorID": "Dola",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110903/profile",
  "Posts": [
    {
      "AuthorID": "Dola",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110903/profile",
      "Content": "Dola wrote: My friend has been diagnosed with stage 4 breast cancer but has no cancer in her breast. How is this possible? She has the markers and her spine has fractures. She has no risk factors other than being a woman. I will be going to visit in a few weeks and would like to have a basic understanding of this before I go to see her. Again I just do not understand how she has breast cancer that has metasticised to the bone if there is none in her breast! Please overlook my ignorence and spelling I'm just so upset for her! And me! Thanks for any input ya'll can give. ;-D Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759159",
      "Title": "Confused -Frien w/st 4 breast cancer, but not in breast Dola mari55"
    },
    {
      "AuthorID": "Dola",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110903/profile",
      "Content": "Oct 10, 2010 08:52AM Dola wrote: No, she has never had cancer. Always healthy, never drank, never smoked, great diet. The long and short of it...Happy and healthy. She had been caring for her dad and thought she had hurt her back. We had discussed caring for an injured back..I've done massage, Reiki and hypnosis for many years and have helped many people thru injuries and surgeries. I'm planning my wedding and sent her an invitation only to find out she can't come because she is so sick. I have been known to walk past people at Wal-mart and felt their cancer, stopped to visit. One of my friends was worried about her pregnancy, the Dr.s said she was fine, I felt the disturbance in her, she lost the baby the next week, I'm known for this. I felt my brother's cancer, my mother-in-law's, my step mom's. But, I still do not feel it in her! In the past when my clients or friends are worried we do a meditation and I ask them to go inside and feel their bodies. Then I ask \" Yes or No, first thought , Do you have cancer?' If the answer is No, It jumps form their mouth \"NO!\" if the answer is yes they hem and haw around the answer. They don't want to say yes, but can't say no. We did this and \"NO!\" jumped from her. She didn't say anything about bone biopsy, so I'm not sure about that. She said the diagnosis is based on the markers. My strength as a friend, that I bring to the table is my own health history. When I was 24 I was so sick my Immunologist, who taught Immunology, told me to go home, get my affairs in order and call my family for their last visit. He wasn't sure what was wrong with me, but my body was shutting down. I had been pregnant 8 times w/no babies. I had fever for 5 years, UT infections for 5years, congestive heart failure and my kidneys were shutting down, my bones felt like the were going to explode, etc, etc,etc. I walked out made my bucket list and began mourning my death. Then I began looking for a different answer. I found a DR. that helped me rebuild my immune system. Now I'm 51 with a very healthy happy 8 year old girl blessing. Turns out I had HEP-C from a blood transfusion after an unnecessary tonsillectomy when I was 10 yrs. old. They did'nt even have a test for what I had at the time. I have helped my uncle after a fall from a ladder, head and spine injury, the Dr.s said it was hopeless and put him in a nursing home. I flew to him and 10 1/2 weeks later he went home w/out even the use of a cane and went back to living on his own.   I am going to her right after my wedding and I'm determined to find an answer for her! So I'm sending out a call for any avenues I can explore. Thanks for any help and blessings ya'll can send our way. Dola",
      "MessageIndex": 4,
      "PostDate": "10/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759159",
      "Title": "Confused -Frien w/st 4 breast cancer, but not in breast Dola mari55"
    }
  ]
}