{
  "AuthorID": "Dom7Mom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272999/profile",
  "Posts": [
    {
      "AuthorID": "Dom7Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272999/profile",
      "Content": "May 16, 2018 01:32AM Dom7Mom wrote: Just wanted to update this post with results in case anyone with a similar experience can benefit. Finally got my biopsy results back yesterday and unfortunately they were not great. Diagnosed with invasive melanoma, surgery on Thursday, lymph node biopsy, and then we will go from there I guess. The crazy thing is the melanoma is on my back, same side as the breast I described above, close to my armpit. The breast biopsy had to be sent back for further staining and hopefully we will have the final pathology report by Thursday before my surgery. This just goes to show that if you feel like something isn’t quite right, trust your gut and find answers. If I had gone off the mammogram clearance and not gone to the dermatologist this would have probably been missed. From what I’m being told and learning, invasive melanoma is can become deadly within a year to 18 months if not caught early. Praying that final staging is positive after this surgery!!! I hope this helps anyone that may have a similar issue going on. Thank you ladies for your help and advice!!!",
      "MessageIndex": 5,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864184",
      "Title": "Worried and need advice! Dom7Mom Dom7Mom"
    },
    {
      "AuthorID": "Dom7Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272999/profile",
      "Content": "May 17, 2018 02:07AM Dom7Mom wrote: It really did come out of left field - I was shocked 😳 Got the breast biopsy back today on the mole type things that grew so fast on the left breast, and the derm oncologist is taking those out as well - it’s so bizarre how this all presented - I was sure it was breast cancer so when I heard Melanoma I was so shocked that I didn’t even know where to start with questions - I called them today because I honestly started panicking, and they are having me come in early before the surgery tomorrow so they can answer all my questions - hopefully that will provide a little more comfort as I start down this journey. Really appreciate this forum and you ladies helping with questions! Thank you so much! Keeping all if you in my prayers!",
      "MessageIndex": 10,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864184",
      "Title": "Worried and need advice! Dom7Mom Dom7Mom"
    },
    {
      "AuthorID": "Dom7Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272999/profile",
      "Content": "Dom7Mom wrote: Hi all! I am wondering if anyone has had a similar experience and can give me advice on what to do. I’m a 38 year old Mom of two, breastfeed both of my kiddos. Three weeks ago, I noticed my left breast was hurting - I kinda ignored it until at work one day when one of my coworkers said jokingly \"stop grabbing your boob!\" I remembered having a passing thought that it was strange how much it was throbbing and being a little embarrassed that I didn't realize how much I was grabbing at it due to the discomfort. A couple days later, I happened to be gettting dresssed for bed in front of the bathroom mirror and when I pulled off my shirt and looked in the mirror my heart sank. There was a red rash / bruise like spot to the side of my areola and two rather large mole looking spots directly beneath the areola. These were not there a month ago. In addition I now have pain that feels like I'm letting down milk. It's the same feeling I had when breastfeeding, but my youngest \"baby\" is 9 now. I have been to the OBGYN who is wonderful, he was very honest with me that I was doing something but he wasn't sure what. He could feel no lump. He gave me antibiotics although he did say it would be highly unlikely that I would have mastitis but he wanted to try the antibiotics to rule it out. Then he ordered a diagnostic mammogram and ultrasound. I went home - took the antibiotics - they did nothing for the red spot, or for the pain. The diagnostic 3D mammogram came up clean but on the ultrasound the radiologist did see a small amount of blackness under the two new mole like spots. She said she was going to clear me tho for two years and recommended I see a dermatologist for the spots. My OBGYN however, is not convinced and is sending me to a dermatologist and a breast specialist. My left breast still hurts, more and more everyday, and the let down feeling is coming every 5-10 min now. It is also substantially bigger than the right side. I don't feel a lump, but the red/bruise like spot is still there and the two mole like spots seem bigger and when I press down on those areas, it is very painful. In addition to this, my nipple has started itching. My questions are: 1) Did any of you have no palpable lump and a clean mammogram, but still have BC? 2) Should I ask/push for a breast MRI or can I be confident that the mammogram would have showed something if it was there? 3) Has anyone had these symptoms and gotten a diagnosis for something besides BC? 4) I keep hearing that breast cancer is not painful, did anyone who has been diagnosed have pain or a let down feeling? Thank you for any advice you can give! I know this probably sounds crazy, but I have a sinking feeling about this. . . Even after the clear mammogram result, I still feel like something is wrong. I like to think I'm really in tune with my body, and something just doesn't feel right Thank you again for any advice / help / recommendations you can give! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864184",
      "Title": "Worried and need advice! Dom7Mom Dom7Mom"
    },
    {
      "AuthorID": "Dom7Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272999/profile",
      "Content": "Apr 25, 2018 04:46AM - edited Apr 25, 2018 04:46AM by Dom7Mom Thank you Egads007! You are so right about the mind going to the worst explanation and it doesn't help that I have so many close girlfriends that have breast cancer (four to be exact, all my age 😢 and one coworker). They have been wonderful answering questions but I am trying not to bother them to much as obviously they have enough going on, so really appreciate the advice- thank you! 😊",
      "MessageIndex": 4,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864184",
      "Title": "Worried and need advice! Dom7Mom Dom7Mom"
    },
    {
      "AuthorID": "Dom7Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272999/profile",
      "Content": "May 17, 2018 01:59AM Dom7Mom wrote: Thank you so much!!!",
      "MessageIndex": 9,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864184",
      "Title": "Worried and need advice! Dom7Mom Dom7Mom"
    },
    {
      "AuthorID": "Dom7Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272999/profile",
      "Content": "Apr 24, 2018 08:35PM Dom7Mom wrote: Thank you mustlovepoodles, that actually just helps to hear that you think I should go see the other docs 😊 Those appointments are next week so I’m hoping they will have some answers or recommendations at least!",
      "MessageIndex": 2,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864184",
      "Title": "Worried and need advice! Dom7Mom Dom7Mom"
    }
  ]
}