{
  "AuthorID": "Domispirit",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231240/profile",
  "Posts": [
    {
      "AuthorID": "Domispirit",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231240/profile",
      "Content": "Apr 4, 2016 11:45PM Domispirit wrote: Thanks all for the support. I was sad to wake up to see what I had lost but pleased that cancer was cut off. To tell you the truth I haven't read much about chemo--just from what I have seen first hand--I think of weight loss not gain--my dad the former shell of himself. My girlfriend had a double mastectomy and said if she had to do chemo again she'd rather die---Wow strong statement. I find everything just crazy right now. So much information pulling me in all directions Beth--I do not have any preliminary results yet---I'm sure I'll know more this week Thank-you for your concern about anorexia. I assure you that's not the case. I am 5'9 and was about 130 before I had my daughter 9 years ago. Even 130 wasn't the best. I am too active I think. I work in a factory --(physical labor) so I am not a couch potato. Also a huge factor is I work rotating shifts --midnights, afternoons, days Each week is different My sister in law was working with me on healthy choices to help weight gain until this all happened. I was asked during my second surgery if they could do anything for me--I said a prime rib dinner from the Keg would be nice --true story obviously I need to take in more calories. I do love food night ",
      "MessageIndex": 4,
      "PostDate": "04/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/842775",
      "Title": "Fellow sisters Domispirit Domispirit"
    },
    {
      "AuthorID": "Domispirit",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231240/profile",
      "Content": "Domispirit wrote: Hello all. Nice to find this web site with lots of support. So my story goes I found a lump in my right breast about 7 weeks ago----I have been diagnosed with -- Ductal carcinoma in situ - nuclear grade 2 present and Ductal carcinoma invasive stage 1. On March 30 I had a right breast mastectomy and am currently at home healing My surgeon also took out 7 lymph nodes for testing----I will find out results this Wednesday. Really freaking out---I don't think I can do chemo. I am only 103 pounds and fear what that will do to me. I watched my father a man of 160 pounds fade away to nothing before my eyes. A needless to say I'm terrified! I'm using my nutri- bullet making smoothies and green drinks. Exercise---well no considering i,m only 100 pounds---I have got heavily into yoga --helps calm my mind and my soul Thanks for listening--will keep you up-dated Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/842775",
      "Title": "Fellow sisters Domispirit Domispirit"
    }
  ]
}