{
  "AuthorID": "donnajrn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
  "Posts": [
    {
      "AuthorID": "donnajrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
      "Content": "Aug 21, 2008 02:52PM donnajrn wrote: I know this decision is very confusing.  Every doc seems to have a different idea about the necessity of doing radiation.  My radiation oncologist told me that the good candidates to skip rads were:     1. small size       2. good margins       3. not grade 3         and 4. not really young (she initially said  old---til I gave her the look)(I am 61)................so, although I had 4 out of 4............she  gave  me a grade of  2.5 cause of necrosis  and  felt I was closer to 3).....which endup up at 3 out of 4.............the tumor board at the hospital said I should have radiation, so I did.  I agree with Sandy.  I wanted to do everything I could to get rid of this.  I have also finished my treatments and had no big problems, just little ones easily managed.   (redness, fatigue). Good luck on your decision. Donna",
      "MessageIndex": 3,
      "PostDate": "21/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719584",
      "Title": "Rads for low-grade DCIS redheadace1 fullofquestions"
    },
    {
      "AuthorID": "donnajrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
      "Content": "Jul 21, 2008 07:17AM donnajrn wrote: Good luck with making the right decision for you.  I know what you are going through and it is so hard to sort all the information  you have and will be given.  Whatever the decision, you will know it is the right one for you.  As for smoking.......I feel your pain, I did quit but it was so hard........as a matter of fact I quit many many times.  They do say it is harder than  quitting hard drugs.  Good luck on your journey.  Donna",
      "MessageIndex": 6,
      "PostDate": "21/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/709251",
      "Title": "Thinking of not doing rads!!! nobleanna007 nobleanna007"
    },
    {
      "AuthorID": "donnajrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
      "Content": "Jul 16, 2008 01:16PM donnajrn wrote: I had a lumpectomy in May and did not use a different bra.  I had a nice one that was not underwire that I wore for the first several days.(day and night)  It was nice cause it supported  the ice pack.  I used the ice pack the hospital gave me with the stereotactic biopsy (kept it), but found a baggie filled with peas worked great. Just kept changing them out. I am still wearing the same bras I wore preop.  I did not have a node taken out, but my friend who is following in my footsteps did, and she wore the same bras.  One thing her surgeon suggested for her, she mentioned it hurt to shower---guess pulling on the node incision.  He suggested wearing a bra when  you shower.  If you want an all cotton bra with a front closure....go to WalMart, they have some that are reasonable and would probably work nicely for you. Although some of your tissue is removed a \"seroma\" will form that is just fluid.  I had that for about 5 weeks--so I did not look any different.  It disappeared after 5 weeks, and I look just the same as preop.  It all depends on your breast size---the smaller you are, the more you will notice it.  Also, I did not have a dressing on my incision, just a surgical glue. Good luck with your surgery. Donna",
      "MessageIndex": 3,
      "PostDate": "16/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709122",
      "Title": "Post-Lumpectomy bra? oldlady Nico1012"
    },
    {
      "AuthorID": "donnajrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
      "Content": "Aug 4, 2008 06:59AM donnajrn wrote: I have missed several treatments, one for the 4th of July holiday, and 2 when the machine was down...(not only that, the machine was down on a Monday after July 4.....so I got 4 days off!).so should be no problem. Donna",
      "MessageIndex": 5,
      "PostDate": "04/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/718981",
      "Title": "Radiation question Nanda Nanda"
    },
    {
      "AuthorID": "donnajrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
      "Content": "Jan 8, 2012 04:27AM donnajrn wrote: Carolyn, sorry I just read your note.  My first surgery for DCIS, a mastectomy wasn't even mentioned.(it was very small)  I am still not sure what will happen to me this time.  I have my surgery tomorrow for LCIS and depending on the path report...............will go the 6 month check-up route or BMX..........Even if they say 6 month check-up............it scares me since this is the second time I have \"something\"  I was told I would be eligible for tissue sparing, nipple sparing surgery if I need a BMX...does that help???? not sure.  Guess for me it is a wait and see.............just do not want to say...why did I not do it??  Good luck with your decision.........what ever you decide..........will be the best for you. Donna",
      "MessageIndex": 657,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "donnajrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
      "Content": "Jul 18, 2008 06:57AM donnajrn wrote: Hi, Like you I think I got callouses on my fingers for googling everything when I found out I had DCIS.  I think I almost did too much.  I had my surgery in May and right now am halfway through radiation.  I think you might benefit from Dr Susan Love's book  The Breast Book, a coworker and fellow survivor recommended it to me and it has become my major resource.  Another coworker had her surgery for LCIS last week.  Our surgeon recommended she shower with a bra on because she was complaining about discomfort then.  Think a person could buy some of the cotton bras from WalMart for that.  The internet is a great resource for us.  I found the Johns Hopkins site for some questions.  I read about curcumin that someone said looks like the Asian aspirin.  There are studies going on at some major cancer centers, it is a major antioxident and looks like it does some great things.  I bought some online and will restart it after I finish my radiation. (my radiation oncologist recommended I not take it during my treatment. Looks like I will start Tamoxifin next month.  Am not looking forward to it at all because of the potential hot flashes, but I will do whatever it takes. Take care, Donna",
      "MessageIndex": 1,
      "PostDate": "18/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709220",
      "Title": "Thoughts Post Surgery/Lumpectomy sonset donnajrn"
    },
    {
      "AuthorID": "donnajrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
      "Content": "Dec 18, 2011 04:23AM donnajrn wrote: Hi ladies, what an awesome group.  I have been a nurse since....forever...and still working full time.  I was diagnosed with DCIS 3 1/2 years ago had lumpectomy and radiation.  I have been on tamoxifen for 3 years and was ready to try a trial off of it because of side effects....then I had my routine mammogram!  This (after mammo, biopsy and MRI) showed LCIS..which is, not cancer..but then I say, why does it have cancer in the name!  This just means I am at a higher risk for developing invasive cancer in the future.  I said to someone, a lot of good the tamoxifen did me...but she said: maybe it did work...makes me think.  I also did research when I had my first surgery and read about curcumin....and been taking that for about 3 years also.  So..I am scheduled for surgery next month (excisional biopsy--not lumpectomy cause this is not cancer-but same type of surgery) and depending upon that result.............will either have close follow-ups or go the BMX route.......Here I go again! Donna",
      "MessageIndex": 643,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "donnajrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
      "Content": "Jan 9, 2012 03:21AM donnajrn wrote: Carolyn,  Thanks for your thoughts. My oncologist told me she had a patient that had nipple sparing/skin sparing mastectomy and she asked her when the surgery was scheduled........not realizing it had been done...said it was hard to tell she had surgery.  Makes me feel a bit better. Donna",
      "MessageIndex": 660,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "donnajrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
      "Content": "Feb 2, 2012 05:32AM donnajrn wrote: Carolyn, Good luck with your surgery.  I understand the nervousness..funny, our whole career we have been sending pts to th e OR, very hard when we are on the other side. By the way, I am a peds nurse also, working in NICU at the present time. Donna",
      "MessageIndex": 667,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "donnajrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
      "Content": "Feb 14, 2012 05:47AM donnajrn wrote: Hi Carolyn, glad you are doing so well.  I was a pediatric nurse for years before going to the NICU.........think a maternal-child nurse has a different personality than an ICU or Med-surg nurse.........all good nurses, no doubt, but different.  Funny, adult nurses say, there is no way I could work with kids...and ped nurses say, ther is no way I could work with adults! I have decided not to do surgery and will do the other option for the time being.......that is, 6 month follow-ups of mammos and MRI's.  My BRAC testing was negative.",
      "MessageIndex": 679,
      "PostDate": "14/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "donnajrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65446/profile",
      "Content": "Feb 14, 2012 09:39AM donnajrn wrote: Janie, good luck with the next step of your surgery. Will be thinking of you. Donna",
      "MessageIndex": 683,
      "PostDate": "14/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    }
  ]
}