{
  "AuthorID": "donna045",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78396/profile",
  "Posts": [
    {
      "AuthorID": "donna045",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78396/profile",
      "Content": "Mar 28, 2009 12:06PM donna045 wrote: Hello Everyone.  Congrats to everyone who has finished. I finished last week. Had a rough one they told me about 4-6 weeks before i am back to myself. I saw my onco who then took the bracca test up to 1 month for results only 2 weeks on monday my patience is wearing thin. I see the radiation oncologist may then if all is good every 6 months i believe for 5 years. Also I am supposed to folloow up with the surgeon (not needed now in my opinion) Seeing my gyn Dr on Monday. My skin has healed quite a bit but not completely It was so bad they did the boost to give me break  and then went back to the final last 5 treatments to give the skin a chance to heal up under the breast. Under then the itcheness under the breast still where they did the boost is hurting me now  I cannot lay comfortable at night without discomfort. I feel a hard lump in that site and also when i push on my boob in other spots i feel pain Has anyone had this also I do get the stabbing pains periodically that last only seconds but intense. I heard that will happen always since they msessed with the nerves during surgery. Anyone have the bracca test out there. I know there reccomendation if positive , hard decision considering i do not want to ever go through this again. Anyone know the odds of getting it back or in the other breast. I will not be going on tamoxfin or anything else still get my monthly period and i am sucepable to clotting so my dr is deciding to do nothing at this point. thanks and again congrats!!! DONNA",
      "MessageIndex": 695,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "donna045",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78396/profile",
      "Content": "Feb 5, 2009 05:33PM donna045 wrote: Hello, I started 5 days ago my treatment (rads) I have dcis in right breast started yesterday feeling quite tender my whole breast I have 33 treatments  to do. I bought the Tom's deorderant Apricot works pretty good. I use a cream made from naturals and also have a aloe vera gel clear which have not used yet. The treatments are very quick when they take me on time. I went yesterday to a breast health center store in the hospital who gave me 2 sports bras that the breast coalition pays for which was very nice. Any one have swollen arms? Is breast get swollen and so tender. Any hints i can do to make it better  that you all do or heard of. I also have begun getting tired by mid afternoon anyone else getting that and are there other symtons nausea or anything? I saw my oncologist today who spoke of putting me on tamofin when treatment is over not a big fan from what i read . He said this is the only meds for me since i still menstrate 47 yrs old and I am to start coumadin monday due to a blood disorder so the side affects of this that make you clot will be okay since i will be on coumadin anyway. But i think i read other side effects he mentioned something about a thicker wall on the uterus but i know i read something about uterine cancer anyone hear anything about this med? Thanks & good luck & god bless  to you all.",
      "MessageIndex": 63,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "donna045",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78396/profile",
      "Content": "Feb 28, 2009 07:02PM - edited Feb 28, 2009 07:02PM by donna045 Hello  I was diagnosed with DCIS right breast back in December. I am 47. I  had a lumpectomy and now on day 21 of Radiation. I have been dealing with it pretty well till now because I have been getting more red ( extreme sunburn )  by the day and itchy ,espicially under my boob, they said this weekend they think my skin is going to break open and then they will have me see the Dr. on Monday to see if they are going to put me on break or continue on. It is so uncomfortable feels very heavy achy sore. I use aloe gel and cream as much as I can . They do not want me wearing a bra any longer and boobs are heavy to begin with. I read a lot of the posts with people with DCIS and see that many have gotten masectomy's.  I was never spoken to about that. Is there special stages to determine radiation, lumpectomy verses mascetomy?  Are there chances of this coming back in the same boob .  I am not happy with my oncologst. Even saw another one  last week liked her even less. Does not seem to informative.  Cause I know they mentioned Tamofin after treatment , but heard about a lot of side effects on that. Has anyone been tested for a cancer gene.  Was anyone ordered for a pet scan or bone test after treatment? Also what is boost? Thanks Donna",
      "MessageIndex": 457,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "donna045",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78396/profile",
      "Content": "Jan 29, 2009 08:31PM donna045 wrote:  I personaly would not do it again, but I have heard people who have done well with it and was written below your post they would do it again. I wish you luck with whichever way you decide.",
      "MessageIndex": 5,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/727974",
      "Title": "Dcis/Mamosite donna045 donna045"
    },
    {
      "AuthorID": "donna045",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78396/profile",
      "Content": "donna045 wrote: Hello  Oct 17 i had my mamo  Oct 23  had sono done told me something was seen they wanted to do a stereotactic biopsy scheduled it for November  They could not do it cause they could not get a clear picture. They decided to refer me to a surgeon.    I saw the surgeon wanted to do a needle wire localization and biopsy, scheduled for 12/17 meanwhile going for medical clearance mri and  pre surgical had the biopsy and a lumpectomy ,  then low and behold dr goes on vaca got them to finally give me my results 12/24 from another dr  of the group. Diagnosed with DCIS Saw my Dr that Monday  said i may be a canidate for mamosite wanted me to see a oncologist and radiation/oncology dept at our local hospital .  They said the cavity looked good so he said all was good to do it. I liked the idea 5 days over 33 days of treatment. I feel I did not think it through and do research. Espically some medical profesionals seemed skeptical when i said i still get my period 47 yrs old.  Since so much time transpired since i was first given the mamo and diagosed time was of the essence before the cavity closed and it seemed like every one was taking there sweet time with everything had a final sono at surgeons office he said it was okay then had mamosite put in on 1/12/09 in his office was a bit painfull and i thought very uncomfortable felt like my boob weighed a thousand lbs already being big  having to go to oncolgy dept everyday to get  dressing changed  that friday cat scan and had to wait for results after having it in for 5 days the dr said it was not in write the symentry  just wasnt write got surgeon on phone to see if can be manueverd he said no we can take it out and put another one in the next week i said no just get it out. they took it out write then was not painful at all. was actually a reflief. Have to wait at least a week to heal from the opening which they had to recut me they could not go in where the slice was from the lumpectomy now have to go through the other process tattos pt test cat scan sims, how frustrating.  was taken out last friday 1/16/09  meanwhile i am still sore have red marks all over  i assume from the bandages . I went ffor sims 1/23/09 now 1/26/09 going for cat scan wed trial run with more pictures and start treatment on 1/29/08 very scared, also not sure if these marks are from bandages or from infection or both. when i go for cat scan tomorrow will stop at radiation/oncology dept have a nurse look at this.  I can't believe this has all happened and seems like so long ago since first diagnosed that we are actually going to start treatment. Any advice Thanks Donna Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/727974",
      "Title": "Dcis/Mamosite donna045 donna045"
    }
  ]
}