{
  "AuthorID": "dood",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85814/profile",
  "Posts": [
    {
      "AuthorID": "dood",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85814/profile",
      "Content": "Jun 16, 2018 07:43PM - edited Jul 30, 2018 08:21PM by dood Hi Everyminute, I occasionally look you up to see how you are doing, I was also stage 3 and am 9 years out on July 31st, 2018. I was also stage 3-A, grade 2. er and pr positive, her 2 negative.I had reconstruction too and am not too happy with it. I am doing well and live in Utah. I don't write in too much, don't like to think about it too much, but, am still on generic for Aromasin (Exemestane) My oncologist says I could get off of it at 10 years but I am struggling with that. Just about 3 years ago he encouraged me to stay on the drug because he said that many of their stage 3rs were getting the cancer back within 2 years of stopping it. I am assuming you are still on it. Hope that your bone density is ok, I am in the middle (osteopenia). Just struggling with getting off of the drug. Anyway, glad to see you are well.",
      "MessageIndex": 407,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/815407",
      "Title": "Stage III Cancer Survivors .... 10+ Years and Out AlwaysHope karen1956"
    },
    {
      "AuthorID": "dood",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85814/profile",
      "Content": "Mar 27, 2017 08:19AM - edited Mar 27, 2017 08:21AM by dood Hi All, I will be out 8 years 7-31-2017. I can't believe it. I must be doing something right maybe?? Sometimes I wonder, because it seems like everything you eat is wrong and I can not believe the FDA allows the horrible food dyes that are out there!!! Congratulations to all of you that have made it this far!!",
      "MessageIndex": 327,
      "PostDate": "27/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/815407",
      "Title": "Stage III Cancer Survivors .... 10+ Years and Out AlwaysHope karen1956"
    },
    {
      "AuthorID": "dood",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85814/profile",
      "Content": "Nov 26, 2011 08:59PM dood wrote: Hi Everyminute, Glad to know you are doing well.  I have not posted anything since I was diagnosed.  I was a stage III-A, Grade 2, 2.2 centimeters.  I have gained alot of weight and am always tired.  I admire you for staying in shape, that is what I need to do!!  I walked the treadmill tonight for just 1 mile and I am worn out, but I am going to keep it up because I know that this weight is not a good thing.  I had reconstruction twice on the left and am feeling a lump, will see my surgeon on Tuesday, the 29th.  The pectoral muscle is over the implant and it is on the left side.  I will keep you posted, will not really know till it is taken out, she operates on Fri and Monday so hopefully will know soon.  I was two years out on 7-31-2011.  It is certainly a worry, but maybe it is scar tissue because I have had to have the reconstruction done twice, the 2nd time was in March of 2011.  I think about you now and then because our stage, etc.. was the same.   You take care and will let you know as soon as I know.  Dood",
      "MessageIndex": 9,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778576",
      "Title": "Happy Thanksgiving everyminute dood"
    }
  ]
}