{
  "AuthorID": "dorfar",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69336/profile",
  "Posts": [
    {
      "AuthorID": "dorfar",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69336/profile",
      "Content": "dorfar wrote: Hi Ladies, Well I'm just at the week mark of my wbr and I am having a tough time. I really feel so crappy. My doctors feel its probably has a lot to do with the steroids. Its awful, I'm finding it really difficult to function. I just feel so uncomfortable all the time and I feel like I'm in a fog. Its so hard to rest I just feel so uncomfortable in my own body. I feel rather loopy like I could cry on the drop of a hat. Has anyone experienced anything like this? Please tell me this is temporary. Dorothy Dx 4/29/2008, IBC, 3cm, Stage IIIB, 1/13 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754736",
      "Title": "Please tell me this will get easier (wbr) dorfar pee"
    },
    {
      "AuthorID": "dorfar",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69336/profile",
      "Content": "Jun 29, 2010 11:00AM dorfar wrote: Thank you so much for the replies. I'm glad I'm not alone. I just keep holding on to the thought that this will get better as i get closer to finishing the treatment. I still have 9 more wbr treatments but I'm getting closer. I've started to take zofran for all the nausea and I plan on taking an ambien tonight to help me get some sleep. I feel like its been days since I have really rested. I'm really hoping not to put on weight while on these steroids I feel like I have been through enough without not being able to fit into my clothes too! Oh yeah one last cute side effect, I now have thrush in my mouth too. I got the special mouthwash today to help. I tell you, the fun just doesn't end :)",
      "MessageIndex": 7,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754736",
      "Title": "Please tell me this will get easier (wbr) dorfar pee"
    }
  ]
}