{
  "AuthorID": "dorimak",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
  "Posts": [
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Jan 7, 2019 07:40PM dorimak wrote: This is a really good topic for discussion. I echo what ShetlandPony says in that I do think it's so individual especially with tumor grade and extent of mets (and maybe location). There are so many variables. Long story but I have had three MOs since I started three years ago who differed on approach to scans and TMs and I'm still not sure where I personally land on this issue. It's unfortunate that the TMs aren't a good predictor for all of us. Mine have tended to jump around a few points above or below normal. I had been stable on Femara/IBRANCE and my disease was limited to an area under my sternum and a small area on my lung so second MO was more inclined to go six months. He had some concern about the amount of radiation exposure. He also explained that the treatments were like ammo in the barrel of the gun in that you burn through them over time. I have to admit it was nice to go the six months without a scan especially when the one last April showed progression. Current MO does every three months and I've since been on Faslodex and now on Afinnitor and Aromosin over the last eight months. Second MO who had started me on Faslodex said he's had women on it for years and yet after if failed me on second three month scan my current MO said it's typical to just get a short run with it. It bothers me how MOs can differ so much but on NP admitted that it's a bit of trial and error with MBC. For all the fundraising that goes on for BC, there is little or nothing that goes into MBC. It's disturbing that they simply don't know why it behaves the way it does and why it can go decades and rear it's ugly head sometimes very agressively. There needs to be much more research in this area.",
      "MessageIndex": 21,
      "PostDate": "07/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869169",
      "Title": "An Interesting Perspective on MBC Progression Monitoring Bestbird Heidihill"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "dorimak wrote: There's a similar board to this for those at all stages in their disease, but I feel like it would be good have a place to share our struggles and fears since this is a long term game for us. There's great support on the individual boards such as by med like IBRANCE but then people move on as their treatment changes. I think it would be good for us to have a place where we can vent or express our fears or concerns and encourage each other no matter where we are in the journey I am just not in a good place right now. I was diagnosed Stage IV in Jan 2016. At the time it was limited to a couple of nodes under my sternum and suspicious metabolic activity on nodes in my right lung too small to biopsy. I am 95% ER+, 5% PR+, HER2-. Hopes were high for me. I started on Femara for three months and the next scan showed progression. IBRANCE was added and I was stable for two years. After initial DX I learned to co-exist with the disease and led a fairly normal life other than significant fatigue from the meds. However it appears that my estrogen receptors seem oblivious to the AIs so it's the targeted therapies that have kept me somewhat stable but not enough. Since then I have done Faslodex, Afinnitor/Aromosin and have now started Xeloda. In November I met with radiation oncologist to look at possibly radiating the two areas \"to kill them off\". He did a PET scan and mets were found on my brain. I have been reeling ever since. He treated them with targeted radiation. The Afinnitor/Aromosin didn't seem to do much so last month I started Xeloda but had to take a break with side effects. I've kept a positive attitude all along and felt reasonably optimistic but am really struggling at the moment. It feels like since Nov that it's been one thing after another. Fasodex not working, mets on the brain, A/A not working. Now Xeloda. I felt really ill last month on it. Scared of the side effects. Only thing that keeps me going is seeing all these wonderful woman and their encouraging stories. but I'm finding it really really hard now because I'm afraid to make plans in case I am not doing well on the meds like what happened a couple of weeks ago. I live alone and my family live across the other side of the world. I realize my challenges aren't near what some ladies on here are dealing with but I'm just feeling major anxiety and fear for what's next. Coping is just getting harder Maybe this can be a board that we can share our fears. . Dx 10/2001, IDC, Right, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Dx 10/2005, IDC, Right, 2cm, Stage IIIB, Grade 2, ER+/PR+, HER2- Dx 1/2016, IDC, Stage IV, metastasized to lungs/other, Grade 2, ER+/PR+, HER2- Targeted Therapy 4/1/2016 Ibrance (palbociclib) Hormonal Therapy 4/1/2016 Femara (letrozole) Hormonal Therapy 4/1/2018 Faslodex (fulvestrant) Targeted Therapy 11/1/2018 Afinitor (everolimus) Hormonal Therapy 11/1/2018 Aromasin (exemestane) Dx 1/2019, Stage IV, metastasized to brain/lungs/other, Grade 2, ER+/PR+, HER2- Radiation Therapy External: Brain Surgery Mastectomy: Right Radiation Therapy Chemotherapy AC Surgery Lumpectomy: Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870929",
      "Title": "Stage IV - Emotional Toll, Anxiety, Struggles,Sadness, Coping dorimak dorimak"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Apr 17, 2019 08:47PM dorimak wrote: Yes, sometimes we may even underestimate the emotional toll it takes. I know there are some who have kids at home, jobs etc. and it's a tough balance to try and live as normal a life as possible but the flip side is we carry that cloud. I chose to keep my DX fairly private only sharing with family and a few friends because I don't want to be talking about cancer all the time.",
      "MessageIndex": 13,
      "PostDate": "17/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870929",
      "Title": "Stage IV - Emotional Toll, Anxiety, Struggles,Sadness, Coping dorimak dorimak"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Apr 16, 2019 08:58PM dorimak wrote: Hi everyone, I posted this a week ago but somehow didn't get it added to favorite topics. Didn't know that anyone had responded. Thank you all for your kind words. DivineMrsM - I'm really sorry to hear of your recent progression. I found I had really come to terms with my DX and was coexisting with it, but have to say when we get unpleasant news from our scans, it shows us how precarious our situations are. Looks like you are starting IBRANCE. I found it quite tolerable with fatigue being my main issue. I did have low white blood cells but they lowered the dose. Hopefully get a good run at it and can feel back on track. I figure every year we get means a shot at something new so may you get several years. candy_678 - I agree that we should be able to express our fears and feelings Really only those with MBC have a true understanding what we are going through. If someone seemed upset, at what you posted perhaps they're just in a bad place themselves and it's not personal. Sometimes I get upset when I see the toll it's taking on others and wonder will that be my path. I think overall everyone seems understanding and try to respect each other.  Elderberry, yes I'm sure it's really a challenge trying to keep life normal for family members while taking care of yourself. I read somewhere that breast cancer patients tend to be natural givers at their own expense. Hopefully you can take time out to fill yourself up so you have energy for them too. I can see how the wait to start chemo can make you crazy. I feel the anticipation can sometimes by worse than the actual experience. Take it one day at a time. I've had to stop treatment over the years for one reason or another and they say a few weeks dosn't make a big difference. I understand though that you want to get going. Thank you all for sharing. it's nice toh ave a community who understands what we're dealing with. ",
      "MessageIndex": 6,
      "PostDate": "16/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870929",
      "Title": "Stage IV - Emotional Toll, Anxiety, Struggles,Sadness, Coping dorimak dorimak"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Apr 17, 2019 07:37PM dorimak wrote: Gosh candy and 50sgirl, I thought it was just me that wanted to keep on driving and avoid the scans or just not show up for t he appointment and run off to a beach somewhere.. It's a cruel and constant reminder 0 this disease that we have to be monitored for something lurking in our own bodies. And candy hearing about somethin somethin when you're a MBC patient can be torture. 50sgirl gave some sound advice. Sending positive vibes and prayers (for whatever worrks for you) that we hear from you that it's nothin nothin. I got two years out of IBRANCE. My main issue was fatigue and low white counts so was on the lowest dose and at times had to be taken off it. There are lots who seem to get quite a run with it.",
      "MessageIndex": 11,
      "PostDate": "17/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870929",
      "Title": "Stage IV - Emotional Toll, Anxiety, Struggles,Sadness, Coping dorimak dorimak"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Dec 12, 2018 10:14PM dorimak wrote: Sandilee, that is very encouraging. I'm also happy to see that it's been over seven years since your diagnosis. I do understand that we are all unique. Your Foundation One testing is interesting. I had never heard of it. I am attending a cancer center in the Midwest who have a strategic partnership with MD Anderson so am going to ask about it. I was disappointed that Faslodex didn't last long for me. It was very tolerable for me other than fatigue and I loved not having to think about taking pills every day. Thanks for your response and I wish you continued success and healing.",
      "MessageIndex": 2,
      "PostDate": "12/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868704",
      "Title": "Any have some hormonals fail then get long success with another? dorimak JoE777"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "dorimak wrote: I started and got two years on Ibrance & Femara. Scan in April showed progression and switched to Faslodex. Last scan showed progression and I've switched to Affinitor and Aromosin. I had hoped to get longer from Faslodex as I'd heard some were on it a long time, but MO said Faslodex doesn't last that long. I wondered now that I'm on my third protocol can I hope for just months or could i possiblyget a longer run with this combo. Dx 10/2001, IDC, Right, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Dx 10/2005, IDC, Right, 2cm, Stage IIIB, Grade 2, ER+/PR+, HER2- Dx 1/2016, IDC, Stage IV, metastasized to lungs/other, Grade 2, ER+/PR+, HER2- Targeted Therapy 4/1/2016 Ibrance (palbociclib) Hormonal Therapy 4/1/2016 Femara (letrozole) Hormonal Therapy 4/1/2018 Faslodex (fulvestrant) Targeted Therapy 11/1/2018 Afinitor (everolimus) Hormonal Therapy 11/1/2018 Aromasin (exemestane) Dx 1/2019, Stage IV, metastasized to brain/lungs/other, Grade 2, ER+/PR+, HER2- Radiation Therapy External: Brain Surgery Mastectomy: Right Radiation Therapy Chemotherapy AC Surgery Lumpectomy: Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868704",
      "Title": "Any have some hormonals fail then get long success with another? dorimak JoE777"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Dec 16, 2018 11:06PM dorimak wrote: Cure-ious, can I ask about the comment to SandiLee re good job on managing to avoid Aromasin-Affinitor? Is it because the side effects are so difficult? I tried to wade through the lengthy amount of info. on that thread but couldn't get a good sense. I started about two weeks ago and then got seriously ill with diarrhea and a high fever. Had to get IV fluids twice during the week. I was only on it five days and I'm off it for a week and just recovering with some cramping still on day 8 of being sick. The thing is I'm not sure if it was actually a stomach flu as there's one doing the rounds. The fever seemed like it might be an indicator. I see my MO on Tuesday. Just curious what you had to say about that combo.",
      "MessageIndex": 7,
      "PostDate": "16/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868704",
      "Title": "Any have some hormonals fail then get long success with another? dorimak JoE777"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "dorimak wrote: When you look up stats for stage IV they’re dismal, yet I continue to see lots of longer term survivors on this site. Some were given a year or two. Would love to hear how many are there and how life’s is for you. I’m coming up on three years and just failed with letrozole. MO says plenty options sti Dx 10/2001, IDC, Right, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Dx 10/2005, IDC, Right, 2cm, Stage IIIB, Grade 2, ER+/PR+, HER2- Dx 1/2016, IDC, Stage IV, metastasized to lungs/other, Grade 2, ER+/PR+, HER2- Targeted Therapy 4/1/2016 Ibrance (palbociclib) Hormonal Therapy 4/1/2016 Femara (letrozole) Hormonal Therapy 4/1/2018 Faslodex (fulvestrant) Targeted Therapy 11/1/2018 Afinitor (everolimus) Hormonal Therapy 11/1/2018 Aromasin (exemestane) Dx 1/2019, Stage IV, metastasized to brain/lungs/other, Grade 2, ER+/PR+, HER2- Radiation Therapy External: Brain Surgery Mastectomy: Right Radiation Therapy Chemotherapy AC Surgery Lumpectomy: Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868930",
      "Title": "Any stage IV surviving 5+ years ? dorimak Yvette1952"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "dorimak wrote: When you look up stats for stage IV they’re dismal, yet I continue to see lots of longer term survivors on this site. Some were given a year or two. Would love to hear how many are there and how life’s is for you. I’m coming up on three years and just failed with letrozole. MO says plenty options sti Dx 10/2001, IDC, Right, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Dx 10/2005, IDC, Right, 2cm, Stage IIIB, Grade 2, ER+/PR+, HER2- Dx 1/2016, IDC, Stage IV, metastasized to lungs/other, Grade 2, ER+/PR+, HER2- Targeted Therapy 4/1/2016 Ibrance (palbociclib) Hormonal Therapy 4/1/2016 Femara (letrozole) Hormonal Therapy 4/1/2018 Faslodex (fulvestrant) Targeted Therapy 11/1/2018 Afinitor (everolimus) Hormonal Therapy 11/1/2018 Aromasin (exemestane) Dx 1/2019, Stage IV, metastasized to brain/lungs/other, Grade 2, ER+/PR+, HER2- Radiation Therapy External: Brain Surgery Mastectomy: Right Radiation Therapy Chemotherapy AC Surgery Lumpectomy: Right Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "20/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868930",
      "Title": "Any stage IV surviving 5+ years ? dorimak Yvette1952"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "dorimak wrote: When you look up stats for stage IV they’re dismal, yet I continue to see lots of longer term survivors on this site. Some were given a year or two. Would love to hear how many are there and how life’s is for you. I’m coming up on three years and just failed with letrozole. MO says plenty options sti Dx 10/2001, IDC, Right, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Dx 10/2005, IDC, Right, 2cm, Stage IIIB, Grade 2, ER+/PR+, HER2- Dx 1/2016, IDC, Stage IV, metastasized to lungs/other, Grade 2, ER+/PR+, HER2- Targeted Therapy 4/1/2016 Ibrance (palbociclib) Hormonal Therapy 4/1/2016 Femara (letrozole) Hormonal Therapy 4/1/2018 Faslodex (fulvestrant) Targeted Therapy 11/1/2018 Afinitor (everolimus) Hormonal Therapy 11/1/2018 Aromasin (exemestane) Dx 1/2019, Stage IV, metastasized to brain/lungs/other, Grade 2, ER+/PR+, HER2- Radiation Therapy External: Brain Surgery Mastectomy: Right Radiation Therapy Chemotherapy AC Surgery Lumpectomy: Right Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "20/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868930",
      "Title": "Any stage IV surviving 5+ years ? dorimak Yvette1952"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Mar 23, 2019 11:53AM dorimak wrote: Candy-678 sorry my bad. I should have said it was effective from the day I stopped working. I corrected it above. So I stopped working at the end of Aug 17 and filed my application. I got my approval pretty quickly but there's a five month wait before payments begin. I began receiving payments Feb 2018. You can see the estimated amount by getting your latest social security statement but it's about the amount of what you would be paid at full retirement age. You can also earn up to $1,180 with some part-time work and still collect if you need the income. The cancer center had a resource who helped with the application as they know how to correctly fill out the form to avoid any delays. Generally it can take a couple of years to get approved for disability and even then many have to get an attorney but there's an expedited process for metastatic disease. I have to say I enjoyed my job and miss it on some level but I had no energy left to do much else.",
      "MessageIndex": 61,
      "PostDate": "23/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868930",
      "Title": "Any stage IV surviving 5+ years ? dorimak Yvette1952"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Apr 1, 2019 06:40AM dorimak wrote: Hi Lily55, I too have no family in this country and due to a divorce five years ago, I lost some of my closest friends and live alone so understand your fear. it sounds like you definitely need a second opinion. Do not go straight to chemo without this. . I obviously don't know your complete information but First of all it looks like you are ER+/PR+ and the first lines of treatment are usually hormonal. For various reasons I changed oncologists three times in the first frew years. Each were consistent with the first lines of treatment which is a hormonal and maybe a targeted treatment. You will generally see most of the ER+/PR+ individuals on this group go through various hormonal and targeted options. Eventually each becomes resistant and you get switched on to the next one. There several others to follow and many get years on their first. Some seem to get to no evidence of active disease on their meds. Some have different side effects but definitely possible to lead normal lives. Many are working full-time. My biggest issue was fatigue and I was close to retirement anyway and I went on disability (which you can expedited approval with a metastatic diagnosis).  I am three years in and I have kept my diagnosis private. I have lived a normal life,was working full-time, have been on vacations, go out and socialize, play golf, am involved in various other activities and nobody has a clue what I have going on. Also, new treatments come all the time so one of the drugs that I was on for almost two years had only come out the year or two before. I soon almost forgot about it except for some of the side effects and only time I'd get really anxious was when it was time for my three month scans. I have had a recent setback that's put me in turmoil at the moment but hoping that I'm getting back on track. My main suggestion to you is to get a second opinion and definitely with an oncologist who is not associated with the same practice as the one you've seen. If you have a cancer center or a university hospital even better.",
      "MessageIndex": 67,
      "PostDate": "01/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868930",
      "Title": "Any stage IV surviving 5+ years ? dorimak Yvette1952"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Dec 27, 2018 01:43PM dorimak wrote: Great to see so many living life and really great for those who are NED. May we all continue to hit milestones like 10, 15, 20 years with good quality of life! Blessings to all.",
      "MessageIndex": 36,
      "PostDate": "27/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868930",
      "Title": "Any stage IV surviving 5+ years ? dorimak Yvette1952"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Dec 23, 2018 12:29PM dorimak wrote: Thank you all for responding! So encouraging for those of us in the earlier stages. My MO says \"you're going to be fine...we have a lot of options\" but I get discouraged when something fails me. My previous MO also said that they're coming out with new treatments all the time. I wish you all peace love and healing for the holidays and for 20019!",
      "MessageIndex": 20,
      "PostDate": "23/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868930",
      "Title": "Any stage IV surviving 5+ years ? dorimak Yvette1952"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Mar 4, 2019 04:14PM dorimak wrote: Pippy1963, this is a very difficult time with the uncertainty. Like waiting for a possible execution. But you will find so many women on these forums doing very well for years and living fairly normal lives. Each year brings new and often kinder treatments. There’s is reason for hope.",
      "MessageIndex": 52,
      "PostDate": "04/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868930",
      "Title": "Any stage IV surviving 5+ years ? dorimak Yvette1952"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Mar 20, 2019 11:13AM dorimak wrote: KSkier, congratulations on this milestone! Long may you enjoy your \"baby :)",
      "MessageIndex": 56,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868930",
      "Title": "Any stage IV surviving 5+ years ? dorimak Yvette1952"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Apr 1, 2019 02:36PM dorimak wrote: Lilly55 I'm sorry I didn't realize the extent of the disease. It sounded from your post that you were just diagnosed and were somewhat early in the process (or maybe you are but are just now finding out). I do think that the initial shock is the worst. While the journey isn't easy, we seem to develop resilience and do what we need to do. There will be ups and downs but I hope you get to where you can find things you enjoy. Keep us posted on your progress. Hugs.",
      "MessageIndex": 70,
      "PostDate": "01/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868930",
      "Title": "Any stage IV surviving 5+ years ? dorimak Yvette1952"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "dorimak wrote: I started this combo last week. One day four (Saturday night) I began to have nausea and diarrhea that kept getting worse and fever that went to 102 and then down to 100 and normal on Tue. I stopped taking on Monday and happened to have doc's appointment on Tue and my heart rate was 140 so I ended up getting IV fluids and anti nausea that causes constipation and I'm off meds until next week. I still feel really rough and weak with stomach cramps and finding it tough to eat. No appetite. Anyone get this severity of side effects or is it possibly stomach flu? Doc wasn't sure. Dx 10/2001, IDC, Right, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Dx 10/2005, IDC, Right, 2cm, Stage IIIB, Grade 2, ER+/PR+, HER2- Dx 1/2016, IDC, Stage IV, metastasized to lungs/other, Grade 2, ER+/PR+, HER2- Targeted Therapy 4/1/2016 Ibrance (palbociclib) Hormonal Therapy 4/1/2016 Femara (letrozole) Hormonal Therapy 4/1/2018 Faslodex (fulvestrant) Targeted Therapy 11/1/2018 Afinitor (everolimus) Hormonal Therapy 11/1/2018 Aromasin (exemestane) Dx 1/2019, Stage IV, metastasized to brain/lungs/other, Grade 2, ER+/PR+, HER2- Radiation Therapy External: Brain Surgery Mastectomy: Right Radiation Therapy Chemotherapy AC Surgery Lumpectomy: Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868820",
      "Title": "Afinitor/Aromosin - severe diarrhea and fever? dorimak dorimak"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Mar 23, 2019 11:09PM dorimak wrote: My heath insurance offers up to four sessions with one of their phone counselors 24x7 I was really struggling emotionally this morning and called one and explained that I had MBC. She asked \"so have they set you up with hospice?\".",
      "MessageIndex": 22,
      "PostDate": "23/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870522",
      "Title": "Myths/Misconceptions about MBC- please share with us! Moderators Sparkles2_2"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Mar 23, 2019 01:13AM dorimak wrote: Peanutsjapan there is a pretty active xeloda thread you might like to check out. I’m just started xeloda so can’t offer much yet. https://community.breastcancer.org/forum/8/topics/772113?page=321#idx_9616",
      "MessageIndex": 61,
      "PostDate": "23/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869100",
      "Title": "Traveling After Stage IV - Questions, Concerns and Conversation Parrynd1 helenlouise"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Mar 20, 2019 02:11PM - edited Mar 23, 2019 11:35AM by dorimak Andi67 I worked for a couple of years after my DX but at 60 I found the fatigue really hard to deal with. I worked a mile from my house and mostly had to go home at lunch and take a nap. Since I was able to access my retirement funds, I decided to quit. Also worth noting is that if you have metastatic disease you are eligible for an expedited approval for disability with social security. It took three months I think to approve and was effective from the day I left work and payments started 5-6 months. I do find things to do and appreciate not having to work full-time but I do miss my job which I really loved. Everyone is busy at their jobs and I feel out of touch a bit.I do appreciate being able to sleep in or rest as I need. It's a definite dilemma for sure.",
      "MessageIndex": 59,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868930",
      "Title": "Any stage IV surviving 5+ years ? dorimak Yvette1952"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "dorimak wrote: I've seen comments on these boards about patients losing weight on this combo. Wondering if the weight loss came from loss of appetite? I hadn't weighed myself say for month of August and was disturbed in Sept to find I'd lost about six pounds and I'm quite slender. Since then I've dropped another 3-4 pounds. I've had no appetite problems for the last three years on IBRANCE/Femara and then Letrozole. I started AA in November so the weight loss and appetite loss don't quite line up. Wondered if it's a delayed side effect or something else. I feel like my saliva is not normal and nothing sounds good so having to force myself to eat. Wondering if anyone else experienced that either with or without this protocol. Dx 10/2001, IDC, Right, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Dx 10/2005, IDC, Right, 2cm, Stage IIIB, Grade 2, ER+/PR+, HER2- Dx 1/2016, IDC, Stage IV, metastasized to lungs/other, Grade 2, ER+/PR+, HER2- Targeted Therapy 4/1/2016 Ibrance (palbociclib) Hormonal Therapy 4/1/2016 Femara (letrozole) Hormonal Therapy 4/1/2018 Faslodex (fulvestrant) Targeted Therapy 11/1/2018 Afinitor (everolimus) Hormonal Therapy 11/1/2018 Aromasin (exemestane) Dx 1/2019, Stage IV, metastasized to brain/lungs/other, Grade 2, ER+/PR+, HER2- Radiation Therapy External: Brain Surgery Mastectomy: Right Radiation Therapy Chemotherapy AC Surgery Lumpectomy: Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869879",
      "Title": "Loss of appetite and/or weight loss with Afinitor/Aromosin combo dorimak Grannax2"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Feb 18, 2019 11:36PM - edited Feb 18, 2019 11:50PM by dorimak Thanks pajim for your response and helpful advice. I've been trying to follow the various tips on getting food into me. My bigger worry is it the cancer that's causing the weight loss. I talked to my MO today and mentioned it and she said she didn't want to see me losing weight. I'm due another PET scan in a couple of weeks so she wants to see how that goes and maybe send me to a nutritionist. She did suggest that anxiety and depression can cause both appetite loss and weight loss which actually made sense. It reminded me of a couple of times when I'd had major stress and depression and the weight fell off. Your situation is interesting in that you seem to have bouts of either not feeling like eating or can't eat. While I'm sure it is the meds, it's interesting that it's not consistent. Hopefully you can take advantage when you're up to chowing down. Blessings to you. You seem to have had a great run with Faslodex. I was on and really appreciated the fact that it was only a once a month thing. Unfortunately I only got about six months out of it. All the best.",
      "MessageIndex": 2,
      "PostDate": "18/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869879",
      "Title": "Loss of appetite and/or weight loss with Afinitor/Aromosin combo dorimak Grannax2"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Mar 17, 2019 03:39AM dorimak wrote: Just came across this thread. My original DX Stage II was in 2001. The reaction of people around me took more out of me than the actual treatments (surgery, radio, chemo) and for years...like years...I'd be out enjoying a night and someone would ask was I still okay...am I sure...There were the people who were encouraging and then the others who had stories of women who went 10, 15, 20 years and then got a recurrence and were gone in a few months. I had a friend who passed away last month after a ten year journey with ovarian cancer. What broke her heart was she was just seen as her disease. People mean well but often all she was asked how she was doing medicalaly and what treatments she was on etc. Her kids are now 21 and 17 and it used to make her feel like a disease because the normal conversations about kids, vacations were overshadowed by having to explain her latest treatment. She had had this great career in New York and there were many people who never knew that about her. She was just the woman on disability and doing clinical trials and chemo. Her husband couldn't go out for an evening without having to explain what her latest treatment, health status was. For that reason I have kept my DX to a small circle and family. It leaked after my original Stage IV dx (ironically from that friend with ovarian cancer who I had asked that she keep it quiet) a few years ago but most assume that it's been taken care of. While I struggle at times, it's less exhausting to enjoy and live as much a normal life as possible instead of people speculating how long I have or talking about the disease that has taken enough from me already. Sorry ,that's my RANT.",
      "MessageIndex": 38,
      "PostDate": "17/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867178",
      "Title": "Vent about long term treatment Larkin Crazeejane"
    },
    {
      "AuthorID": "dorimak",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/239353/profile",
      "Content": "Dec 13, 2018 05:25AM dorimak wrote: Congratulations! So encouraging and I'm sure with less treatments back then they weren't nearly as optimistic. You go girl and look forward to seeing your continued major milestones!",
      "MessageIndex": 27,
      "PostDate": "13/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/866431",
      "Title": "Ten years-whooopeeee! Celebrate_Life dorimak"
    }
  ]
}