{
  "AuthorID": "Dotter95",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
  "Posts": [
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Feb 14, 2017 05:47AM Dotter95 wrote: I'm also starting tamoxifen for 5 years. Fighting girl - almost done! Hang in there! Kroop73 - glad you have joined the group. Keep us posted on how it goes! Happy Valentines Day to all of you!",
      "MessageIndex": 86,
      "PostDate": "14/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Feb 5, 2017 08:40PM Dotter95 wrote: Hi all - I'm so glad to have found this site. I have been trying to find out how easily this type of radiation is tolerated. I decided on brachytherapy for a couple of reasons - the short treatment time, minimal burning and the fact that you can have radiation again if (God forbid) you have BC again. I live in Ontario, Canada, and there is a Brachytherapy specialist at the breast cancer center. He does interstitial brachytherapy, where small flexible tubes are inserted into the breast one at a time under a general anesthetic. The end result is much like a SAVI, but all the tubes can be tailored to fit your particular tumor confirmation. I will have the tubes placed tomorrow morning, then 9 treatments beginning tomorrow afternoon and ending on Friday. I am pretty nervous (don't feel much like sleeping😕 But will be really glad to be FINISHED on Friday!  Thanks, Pyrrh, for all your posts. It's so helpful to hear of other people's experiences. I will post too. Fighting girl, we start so close together! Hope you have an uneventful time! Looking forward to reading your posts! ",
      "MessageIndex": 58,
      "PostDate": "05/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Feb 13, 2017 05:49AM Dotter95 wrote: hi all - well, I'm all finished - EVERYTHING! So I was doing the happy dance this past weekend! My last Day of brachytherapy was uneventful - the best kind! When the tubes were removed, there was no pain - actually couldn't even feel it. There was just a sense of relief as the pressure caused by the squishing of the breast was released. Now, three days later, there is minimal swelling of the breast, and the entrance and exit points have healed and are small round red spots. No redness around or signs of infection. During my treatment, I didn't wear a surgical bra, just a stretchy tank top with a Guaze pad between it and my breast. I can't tolerate tape of any kind. This worked even as I slept, and I certainly recommend it as it was comfy. Guess it would only work if you have smallish breasts, though. Each treatment, the radiation techs applied polysporin around each button to prevent infection and to keep the tubes lubricated and loose so removal would be easy. I have found brachytherapy to be a great choice for me and I am really thankful I fit into the criteria. The surgery aspect was a bit scary, but in retrospect not so bad. The short treatment time and no skin issues plus the benefit of still having rads in my arsenal should I ever develop BC again has far outweighed the surgery issue. I would do this again in a heartbeat.! Fighting girl - you will be finished tomorrow I think. Hope all goes well for you - please let me know! Pyrrh, so you are able to sleep on your stomach again?! I'm not quite there yet but it sure will be nice to be normal again!",
      "MessageIndex": 77,
      "PostDate": "13/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Feb 6, 2017 06:12PM Dotter95 wrote: Well, brachytherapy surgery day went well. There aren't many women who choose brachytherapy here, so I was very well treated with lots of attention - a bit of an anomaly I guess! The only glitch is that I couldn't get started on the radiation today for some reason, so treatments go until late Friday aftrnoon ( and I was wrong - only 8 treatments, not 9). Anyway, breast is feeling swollen a bit and not too happy, but the pain meds (tylenol3) are doing the trick. I think the hard part is past - I am feeling great about choosing this route. I just have a dressing held in place by a stretchy tank top as my skin does not deal well with tape. The surgery lasted about 2 hours, then I had a CT to make sure the tubes were all in the right location. I have 11 tubes in 3 rows. The physicists were making the treatment plan this afternoon, so the RO said that if any of the tubes were not really necessary, they would be removed tomorrow. They did a simulation of the radiation treatment. When the radiation is done, little \"hoses\" are connected to each of the tubes in my breast. They screw on - it's like I am a human meccano set! (This dates me btw) and it wasn't painful at all. Apparently the radioactive seeds are almost at the end of their useable life ( being replaced next week) so my treatments will be a long time comparatively - about 20 minutes (5 min or so for fresh ones). Oh well, I'll sing to myself or something! I asked my RO why the SAVI device was not used, and he said it was not available in Canada as it has not received approval from Health Canada. Interesting",
      "MessageIndex": 61,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Feb 9, 2017 08:04PM Dotter95 wrote: hi - the SAVI device is not approved for use in Canada, so I guess I didn't have as much choice as those of you in the States! Anyway, I have completed 6 of 8 treatments and am doing really well. Minimal swelling and bruising, and no pain to speak of. I have the last two treatments tomorrow and then tubes out, and all my treatments completed. Hooray!! Now if only my hair would grow faster!",
      "MessageIndex": 71,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Feb 13, 2017 08:03AM Dotter95 wrote: hi - I was really sorry to hear that you did have infection. Thank goodness for antibiotics! Hooray on you being half done now, and 6/10 by the end of the day! Wednesday will be a great day - you should plan your party! Joan",
      "MessageIndex": 80,
      "PostDate": "13/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Feb 25, 2017 01:30AM Dotter95 wrote: hi Kroop73 - just wondering how your brachytherapy went. You should be all finished today! Hooray! Fightinggirl, how are you doing now? Hope you are well on the way to being back to normal!",
      "MessageIndex": 94,
      "PostDate": "25/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Apr 3, 2017 09:44PM Dotter95 wrote: hi KB870 - glad to hear you are over the hard part. The rest is just so easy! I finished brachytherapy March 10, and the catheter insertion spots are almost entirely gone. I had no issues with the radiation, and the removal of the catheters was painless. I was able to sleep on my stomach about a week after the removal. I am so glad I chose this route. I would still be getting the daily radiation if I had chosen whole breast radiation! Let us know how you are doing! Joan",
      "MessageIndex": 101,
      "PostDate": "03/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Feb 7, 2017 12:45PM Dotter95 wrote: Hi - my affected breast is the left one and the buttons are on the side closest to my midline. The open part of the tubes are on the side closest to my arm. The breast looks kind of squished, but really there isn't a lot of discomfort. Absolutely no pain when they did the first treatment this morning ( I am waiting for the second treatment now). They also decided two of the tubes were unnecessary so they were removed. I was worried it would hurt, but didn't at all! I dint have any bruising yet according to the technicians, and where the two tubes were taken out are only little red marks - nothing really. I had no problem sleeping last night, and find taking a tylenol3 occasionally is all I need for pain management. So far so good! Hope your treatment today goes well. Let me know!",
      "MessageIndex": 64,
      "PostDate": "07/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Jan 2, 2017 07:25AM Dotter95 wrote: hi - l rarely post, but keep up with this site. I started Chemo in November - TC. I found that I had pretty severe SE the first round, and now take Claritin 24 hour for the first two weeks or so of each cycle, and find I feel much better. Figured I would try it as I felt so miserable and had bought a package (I thought I would be on a trial for Neupogen too). It has proved to be magic for me. I get my final round next week - will be glad to be done that phase!",
      "MessageIndex": 1100,
      "PostDate": "02/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Jan 7, 2017 01:09PM Dotter95 wrote: Hi Leslie and Dianarose - if you go to the discussion group for people on TC you will find a lot of info on using Claritin 24 hour to minimize the bone pain from Neupogen and Neulasta. I found that it also minimized the body aches and sinus headaches from the TC. For me, it has been a magic pill! I have now finished chemo and will meet with my RO next week. Hooray! Joan",
      "MessageIndex": 1132,
      "PostDate": "07/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Dotter95",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242094/profile",
      "Content": "Nov 30, 2016 07:55AM Dotter95 wrote: hi Aldea13 - this is my first posting here- I am also on TC and just had my second infusion. I don't get the Neulasta or Neupogen shots - but I take an antibiotic from day 5 for 2 weeks (Cipro). My bloods came back fine, and I didn't have any infections ( mouth sores though!). Anyway, didn't have to battle the joint pains! Are you getting 4 infusions? If so you will be half done next infusion😊 Joan",
      "MessageIndex": 759,
      "PostDate": "30/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    }
  ]
}