{
  "AuthorID": "Dotwithkitt…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210125/profile",
  "Posts": [
    {
      "AuthorID": "Dotwithkitt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210125/profile",
      "Content": "Feb 12, 2015 06:05PM Dotwithkitties wrote: hi ladies, I have to thank you all for sharing. I am going for my initial scan tomorrow and I feel so much better knowing what to expect after reading all your detailed descriptions. I am not looking forward to this journey but am glad to have found all of you here! I found these boards right after my surgery and have learned so much - wish I had found them sooner ...",
      "MessageIndex": 1652,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Dotwithkitt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210125/profile",
      "Content": "Feb 24, 2015 03:37PM Dotwithkitties wrote: Farmerma, I also just bought the Bali comfort bra! I got another one that Amazon suggested, the Marilyn Monroe sports bra - don't laugh, it's comfortable and stays in place! Someone else suggested a fruit of the loom but I found the cups too snug. I had # 2 of 30 today. I don't know if it's my imagination, but the axillary incision feels like it is a little tight.",
      "MessageIndex": 1896,
      "PostDate": "24/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Dotwithkitt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210125/profile",
      "Content": "Mar 15, 2015 05:16PM Dotwithkitties wrote: ladies, I have not been here for over a week and can't believe how long it took me to catch up. I completed 15 of 30 on Friday. Thanks to all rhe advice received here, I have done well thus far. I am trying to drink the recommended 64 ounces of water each day but usually fall short, though consumption has increased considerably. The recommended calendula lotion is like a miracle cream! After week 1 I had some minor peeling around my nipple, but nothing since I started with the calendula. I slather aloe on right after treatment, then use calendula and aveeno after I shower and again in the am. I decided to add aveeno because I didn't know how moisturizing calendula alone would be. I have never used aveeno before but have found it to be a wonderful moisturizer. With regard to insurance, I have been online keeping a close watch of everything as it bills. What insurance says is not covered has not automatically billed to me. For example, insurance said the MRI prior to surgery was covered, but the radiologist interpreting the test was not covered. Really?? They also covered the mamo the day of surgery but not the wire localization needed for surgery. My final bill for radiology was 175, much less than what was originally shown online. For rads, one week of billing including setup was originally $55000. I am very fortunate to have good insurance through my employer with an annual out of pocket at 2500. Gemmafromlondon, what is your standard for screening? Are you entitled to a mamo and sono annually? Coyotenv, thank you for keeping track of everyone's progress. I am thrilled as I see each member complete treatment. I am not one to post frequently but see familiar names - kayfry- I had my surgery on 1/6 but found this site later, recognized you from Jan surgery sisters! Justjean, sleeping on rad side has not been an issue, though I have reverted to sleeping in the lovely bra they sent me home from surgery in. My skin has been ok, I have had some internal discomfort that sleeping in the bra seems to alleviate. Random shooting pains that come and go. My. View is, if this is all I have...",
      "MessageIndex": 2405,
      "PostDate": "15/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Dotwithkitt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210125/profile",
      "Content": "Feb 23, 2015 02:40PM Dotwithkitties wrote: Hey Farmerma and SunntSideUp, we all had our first treatment today. Uneventful for me, I did follow everyone's advice and slathered up with aloe before getting dressed. Does anyone know why they had signs up warning you to tell the therapist If you had left the country recently? what would traveling have to do with radiation? I will have to ask tomorrow. Bippy, party hard tonight, you deserve it!",
      "MessageIndex": 1851,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Dotwithkitt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210125/profile",
      "Content": "Mar 2, 2015 06:40PM Dotwithkitties wrote: hey Farmerma, I had number 6 today, saw the nurse and she recommended 1% hydrocortisone for a few days, my nipple is getting flaky even though I have been using aloe and aveeno 4x a day. I also didn't realize my whole breast would get sore, it feels like pms, not too bad I just wasn't expecting it.",
      "MessageIndex": 2094,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Dotwithkitt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210125/profile",
      "Content": "Apr 10, 2015 08:47AM Dotwithkitties wrote: hi ladies - I finished on Monday! I have a few really rough patches and am extremely tired but all things considered, held up pretty well. Coyote, I'm tired from reading what you did on a slow day! Would you us some pictures of the jewelry? It sounds lovely. And it sounds so peaceful where you live... I am starting tamoxifen next week. I am a rare case, 58 and premenopausal so the MO wanted more blood work, specifically to check for any indication of clotting. Gyno also wants a baseline sonogram before I start. This thread has been so informative, I can't thank you all enough. Someone early on posted about using a little stuffed animal under the seatbelt- I have been using a teddy bear for three weeks and I can't believe the difference it has made.",
      "MessageIndex": 2740,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Dotwithkitt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210125/profile",
      "Content": "Apr 10, 2015 06:02PM Dotwithkitties wrote: beachbum, I refer to my teddy bear as Toots, and he's been a constant companion. I get in the car and say, let's go toots! I'm wondering if people are looking at me at lights.",
      "MessageIndex": 2752,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Dotwithkitt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210125/profile",
      "Content": "Feb 16, 2015 10:11AM Dotwithkitties wrote: Hi Ladies - I went for my CT scan on Friday, have my simulation on 2/20 and will have the first of 30 treatments on 2/23. I have the sharpie marks covered with stickers now - I can't believe they are staying put. I am stressing over how I am going to get through this and work over these six weeks. I'm taking every bit of advice I see here seriously, since you have all been in my shoes. I can't tell you how many hours I have spent trying on uncomfortable wireless bras that don't stay in place. I have several sports bras that I have been living in since my lumpectomy, but won't those feel too tight on the burned skin?",
      "MessageIndex": 1704,
      "PostDate": "16/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    }
  ]
}