{
  "AuthorID": "DoulaMom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144986/profile",
  "Posts": [{
    "AuthorID": "DoulaMom",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144986/profile",
    "Content": "DoulaMom wrote: Hi. I'm Jen. After a routine mammogram showed calcifications, I had a second mammogram, then a stereotactic biopsy, and it came back positive for DCIS on Feb 8th.  I am waiting for my initial appt at Seattle Cancer Care Alliance on the 28th.The only doc i've talked to is my family practice primary who told me the rusults then basically told me not to worry to much cuz it was the best kind, and i'd be fine, and i should talk to a surgeon next. (????)  All the info I have, i've gotten from this site. On one hand i can't wait for my appointment, on the other hand, it's going to make everything very real. My grandmother had breast cancer twice. She lost both breasts, but she's my hero, and is a very active 87 year old. From what i've read, they could probobly treat it with a lumpectomy and radiation, but I don't like the thought of radiation, and I really don't want to do this all over again if it comes back in the other breast. I'm not good with medical stuff and would rather get it over with, then worry and get biopsies every time there's something suspicious. Wanted a reduction anyway. Has anyone had mastectomys because of DCIS? I know i may be getting ahead of myself, but I'm just wondering.  If anyone else out there is being treated at SCCA I would love to hear from you. Thanks. The strength and wisdom and beauty within of a tribe of women is a force powerful enough to change the world. Dx 2/8/2012, DCIS, 5cm, Stage 0, Grade 1, ER+/PR+ Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "23/02/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/783101",
    "Title": "DCIS in Seattle.. Need a buddy. DoulaMom Tatina123"
  }]
}