{
  "AuthorID": "doxie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
  "Posts": [
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jul 19, 2013 04:39PM doxie wrote: Is there a Saturday clinic where your PCP is?  Or maybe you could go to a walk in clinic to have a nurse look at it.  You could also call the on call number for your surgeon's practice.   Sorry, but I don't have the medical experience to help otherwise.",
      "MessageIndex": 1,
      "PostDate": "19/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807987",
      "Title": "One month later - infected subcutaneous stitches beeve Jennt28"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Sep 3, 2016 05:47AM doxie wrote: Seraphima, Please consider seeing a plastic surgeon who specializes in breast reconstruction. She can walk you through the options and help with what insurance will cover. There is no rush. I had reconstruction almost 2 years after my first BC surgery. I wanted to give time for the radiated breast to heal. I didn't mind the shape of my breast after surgery as much as the loss of the nipple and areola. Every time I saw that breast in the mirror, I had a reminder of BC. Now that the tattooed areola has faded to match my natural one, I don't notice the BC side and my thoughts don't turn to BC. One of the best things I did for myself.",
      "MessageIndex": 19,
      "PostDate": "03/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846937",
      "Title": "Body Image after surgery Blueorange Seraphima"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Sep 2, 2016 05:00AM doxie wrote: Seraphima, Because you lost your nipple and areola, you got a partial mastectomy, not an LX. I had a partial too because my tumor was beside the nipple under the areola, but not Pagets. You should be covered for reconstruction with this surgery, where it may not be so with LX. Hopefully your surgery was correctly coded for insurance. I had a BS reconstruct a nipple and tattoo an areola. Because I didn't request a fat injection, my breast is still shaped like a small mesa. But, that was my choice as I didn't want more scar tissue hiding a recurrence. Just my paranoia. Overall, my breast looks good for the reconstruction I had.",
      "MessageIndex": 11,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846937",
      "Title": "Body Image after surgery Blueorange Seraphima"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jan 10, 2017 03:57AM doxie wrote: My hair came back the same. I've noticed that some get six rounds of TC and others get four. I wonder if the women whose hair has not returned were more likely to have gotten 6 rounds. I had four rounds.",
      "MessageIndex": 123,
      "PostDate": "10/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761295",
      "Title": "Did anyone had her hair back after taxotere??? melania janet11"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Nov 8, 2012 06:14PM doxie wrote: Bluesky5 - If you go to Illinois Ladies in the Help Get through Treatment forum, there are a lot of women with Chicago doctors.  They will help you with names.  What insurance do you have and do you want an MO or GP? ",
      "MessageIndex": 1,
      "PostDate": "08/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/796081",
      "Title": "Anyone know a really good Chicago doctor BlueSky5 lago"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Mar 30, 2012 04:24AM doxie wrote: kem510,   A decision for a lumpectomy or MX is difficult to make for many.  I didn't blink on my decision.   I had a partial mastectomy, a lumpectomy that takes the nipple and areola.  Because of the odd presentation, three docs thought it was not IDC, 2 thought possibly paget's or a skin cancer metasticised to the breast. The tumor was pushing up through the areola beside the nipple, pushing it aside.  Excisional biopsy removed the tumor, second surgery all of my nipple and most of my areola for better margins.  Also took a cyst and fibroadenoma and did SLN.   I've not lost any feeling in the remaining areola or the rest of my breast. The scar is healing well.  No pain related to surgery except a few healing twinges no worse than usual breast twinges.  My breast was reduced a cup size, but now nicely matches the smaller of the two, which was an A.  The shape is normal.  After a new nipple and tattoo, only when nude will anyone be able to tell I had a partial mastectomy.  My BS takes pride in making the job of the PS less complex.   Finished chemo in early January and radiation a week ago.  Radiation was uneventful except for a few blisters now on my areola.  If they pop, I'll wish I didn't have feeling in it.  Only expect to do diagnostic mammograms in the future for both breasts at 6 months intervals for now.   So far the partial mastectomy has been the right choice for me.   Whatever you choose, feel good with it.  Go with your gut after weighing all the options.",
      "MessageIndex": 9,
      "PostDate": "30/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784730",
      "Title": "Help! Lumpectomy taking the nipple. kem510 Worriedsickinpa"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Aug 7, 2016 03:58PM doxie wrote: That's good.",
      "MessageIndex": 1,
      "PostDate": "07/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/846715",
      "Title": "It's O-LYMPH-ICS time again! Binney4 MinusTwo"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Sep 3, 2016 02:35PM doxie wrote: I don't think you hijacked the thread at all.",
      "MessageIndex": 21,
      "PostDate": "03/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846937",
      "Title": "Body Image after surgery Blueorange Seraphima"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 23, 2012 02:46AM doxie wrote: My brain wasn't functioning well in my last posting so am adding that even if you are HER2 -, any HER2 activity will raise your oncotype score over someone with none.  HER2 1+ and some HER2 2+ are not considered HER2 positive (yes it can be confusing), but this will raise your oncotype score.  A low %PR will also raise it.  ",
      "MessageIndex": 26,
      "PostDate": "23/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 28, 2012 05:09AM doxie wrote: anndh, That's what I had to do TC x 4, then rads.  Out of curiosity, do you know the staining on your ER and PR?  Highly, moderately, or weakly?  ",
      "MessageIndex": 61,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 28, 2012 07:58AM doxie wrote: mary71, I agree that a low PR+ will likely tip the scales to a higher oncotype score.  I've understood that the degree of staining is of some importance and have wondered if it is taken into consideration on the oncotype.  My ER and PR are lower than anndh's and Ki 67 higher, yet she had an oncotype score 4 pts higher than mine.  My ER/PR were highly stained.  I've not found this issue addressed in research papers trying to find a cheap way to approximate the oncotype score, probably because it is too difficult to get the data and very subjective.   Anyone else want to weigh in one this you your stats?   ",
      "MessageIndex": 64,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 17, 2013 06:09AM doxie wrote: lisa2012,   A lot of people find the Oncotype ER and PR scores confusing when compared with the IHC %.  One problem is that the Oncotype doesn't use %, but different ranges of numbers.  Even more confusing is that these aren't even the same amongst the ER, PR and HER2 scores.  Then they add whether the score is in a positive or negative range.  A negative in the Oncotype range doesn't mean you have 0% ER, it means that your ER is low enough that Tamoxifen may not be as effective as on tumors with higher scores.  So it is a \"negative\" on your overall Oncotype score making that higher than if your ER had fallen in the \"positive\" range.  This all gets more confusing when a HER2 score of \"positive\" causes a higher Oncotype score overall than if it had fallen into a \"negative\" range.  These numbers and more all plug into a formula to get your overall score. One way to visualize this is to stretch out the ER chart from 0 - 12.5.  Look at where the arrow falls for your score.  Is it at about the 30% point?  When I do this for my ER, PR and HER2, my ER seems lower, my PR and HER2 higher than my pathology reports, but not enough of a difference to effect what my treatment was or needs to be.  And that's really the point of all this, right?  Giving you and your team the information to make the right treatment choices?   The problem with those of us on AIs, is that the Oncotype takes into account Tamoxifen, not AIs.  Also CMF, not TC, ACT, and other stronger chemos.  There are some plums to pluots comparisons here, not quite apples to oranges.  ",
      "MessageIndex": 185,
      "PostDate": "17/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 22, 2012 07:09PM doxie wrote: So much is involved in what the oncotype is.  It's not just % of ER or PR.  90% ER+ strongly stained is different than 90% weakly stained.  Proliferation indicators like Ki 67 weigh heavily on the score.  ",
      "MessageIndex": 22,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 26, 2012 05:16AM doxie wrote: Thank you Otter!  I was hoping someone would post with clearer info for those who had yet to get the details to understand the relationships between ER, PR, HER2, and Ki 67 and the Oncotype score.  I'm always surprised when members report that their MO thinks their score will be low and their pathology reports seem to indicate otherwise.  Is this just to keep a patient calm?  After doing this research, I knew my score would very likely be mid to high intermediate and it was 1 point from high risk.   My PR (5%), HER2 (+1)  and Ki 67 (40%) highly impacted the score.   ",
      "MessageIndex": 45,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786288",
      "Title": "Another Oncotype question mary71 Scarlet2"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 7, 2015 08:29PM doxie wrote: BUNKIE10, That's unfortunate you are still having difficulties. I'd suggest getting an evaluation for lymphedema. Some of the symptoms you have are similar to mine in my breast and underarm area. This is called truncal lymphedema and it is not often diagnosed or noted by your doctors. With DCIS you would not have been prescribed chemo and with negative ER- / PR- your cancer was not hormone driven, so anti-hormonal meds would not have helped to prevent a recurrence of your type of DCIS. ",
      "MessageIndex": 69,
      "PostDate": "07/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/816658",
      "Title": "Long Term Radiation Side Effects 10+ years After? Barbarella60 Raebrewster1971"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 29, 2015 04:06AM doxie wrote: Actually, damage from rads can occur many years from treatment, in breast, lungs or heart. My RO was very clear on this. That's one of main reasons I return by-yearly to him. The other is that he gives the best breast exam of any doctor or nurse I've ever had. Another is that he is a character, like an older brother and grandfather rolled in one. We have long chatty appointments, if he can, and I run by all kinds of esoteric stuff by him. My other doctors now are in and out, bam!",
      "MessageIndex": 15,
      "PostDate": "29/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/832938",
      "Title": "Lung damage nearly 3 years after radiation finished? Lily55 Martini"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 28, 2015 04:00AM doxie wrote: Lily55, Have you considered going back to your RO for help? Mine is very generous in blaming anything odd on rads. I had a small amount of lung damage that showed up on a CT scan and a rumbling he noticed at my last check up, but I'm sure the latter was from a recent chest cold.",
      "MessageIndex": 2,
      "PostDate": "28/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/832938",
      "Title": "Lung damage nearly 3 years after radiation finished? Lily55 Martini"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 14, 2016 04:54AM doxie wrote: Ltam16, Expect it to take at least 6 months to a year for your breast to recover from rads. Your tissue is healingand needs more lymph fluid to do so. And your RO may be correct that it is LE. Nearly four years out from rads, I have fluid retention in my breast along with mild LE in my axilla and upper arm. Still my RO blames the fluid in the breast on rads. Not a big issue because the is little discomfort and it is barely visible.",
      "MessageIndex": 4,
      "PostDate": "14/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/841273",
      "Title": "How long does post radiation swelling/lumpiness last? Ltam16 ChiSandy"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Mar 31, 2013 09:34PM doxie wrote: Annie,  Usually if there is something of concern, the radiologist requests a followup ultrasound.  In my clinic it is immediately after the mammo.  Did you have a regular or diagnostic mammo?  But I agree with Athena that you should call your doctor to fine out.",
      "MessageIndex": 3,
      "PostDate": "31/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802564",
      "Title": "mammogram image ANNIE654 ANNIE654"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Aug 31, 2013 08:00AM - edited Sep 3, 2013 03:46AM by doxie I didn't want anyone to think the weight lifting should be avoided. I started very slowly doing free weights and kettle bells.  My problem was when I zoned out on the number of reps.  I may have done 30 instead of the 10 I was supposed to.  I remember to count now.  I'm not planning to stop weight lifting.  I see it as preventative against osteoporosis, back pain, and worse LE.  It also keeps my core strong enough I can manage hauling a kayak by myself. It's the nipple reconstruction that has really caused the problem for me.  Trying to get by until the nipple is healed, but I may buy a compression shirt anyway and cut out a hole for the nipple.  Too tender yet for any pressure.   Edited to add:  I was giving LE a bad rep.  Turned out I had an infection afterall.  Thought this all was going along too well for radiated skin.",
      "MessageIndex": 5,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/808113",
      "Title": "Breast swelling after lumpectomy - caused by weight lifting?? bodynatzi bodynatzi"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Aug 31, 2013 05:23AM doxie wrote: bodinatzi, My weight lifting has triggered mild breast lymphedema.  It comes and goes, so I delayed going to an LE specialist.  Since it moved into my underarm and upperarm after nipple recontruction, I wish I had gone sooner.  I strongly suggest seeing someone now.   At least your dr recognizes the likelihood of breast LE.  I was visually asymtematic when I saw my LE specialist and she was hesitant to agree with me even though I was describing a feeling of fullness and heaviness in those areas.   This week I see my PS and will see how she reacts to the LE flare up I'm having wearing nipple guards after reconstruction surgery.  Looks like a serious infection or inflamatory breast cancer, but it goes away in a day or two, so I know it is LE.  ",
      "MessageIndex": 3,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/808113",
      "Title": "Breast swelling after lumpectomy - caused by weight lifting?? bodynatzi bodynatzi"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 30, 2013 06:28PM doxie wrote: Lots of good suggestions.  My experience was a little different.  I wasn't bandaged, maybe because I have small breasts.  I put on a regular bra to go home.  Also didn't have drains.   The SLN surgery was the worst part for me.  Cut nerves caused loss of feeling.  Also had pulled muscles throughout the underarm area.  Be very patient with this part of the healing. Bring a button front shirt.  Nothing slip on for days.  Bring a pillow to keep the seat belt out of the way.  ",
      "MessageIndex": 2,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/804030",
      "Title": "Lumpectomy: Your tips for preparation & recovery? CassDugan carol57"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 12, 2013 04:33PM doxie wrote: SJW725,  Surgeons sometimes have no clue as to what you do and how you need to use your arms.  I think you need more time off because you may not be able to lift your arm as high as you need and may not be able to put as much pressure on it as you need.  If you overuse your arm too soon, you run the risks of lymphodema (LE).  No one wants to trigger this, if it can be prevented.  It would make doing your work much more complicated.   I'd suggest before surgery seeking out a lymphodema specialist and ask what you need to do to prevent it.  How soon you could go back to work, or be evaluated for readiness, before returning.  Your surgeon should help with directing you to one, or go to the Lymphodema Forum for help.   My surgeon said, no problem with returning to work even knowing I needed chemo and rads.  He had no idea what my work entailed, so I made arrangements for FMLA and gave myself time to properly heal.   Hope you can get the help you need before going into surgery.",
      "MessageIndex": 17,
      "PostDate": "12/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/804030",
      "Title": "Lumpectomy: Your tips for preparation & recovery? CassDugan carol57"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jan 22, 2012 09:58AM - edited Feb 27, 2012 04:02AM by doxie smva - Deciding whether or not to do chemo is a difficult decision when you have stats like yours. For someone older, 10 years looks different from someone in their 40s.  I was considered a young \"older\" but have relatives consistantly living into their mid-nineties.  My oncotype was 30, so with possibly another 40 years to live, I followed my MOs advice and did TC, a stronger chemo than CMF.  Still have radiation and AIs to follow. I'm not sure where your MO is getting the recurrance rate data.  Because your score is so close to mine, I checked my oncotype patient report and with tamoxifen alone (you would likely get AI which is better) your distance recurrance rate in 10 years would be 14%.  With CMF it would drop to 7%.  Taking an AI will lower than a little more.  You can go to the Genomic Health website and look at the sample report available there and see the same graph I have in my report.  Or ask for your own report.  Your MO should be looking at the data for your score, not the intermediate average. I know someone doing CMF at the same time as my chemo.  Her side effects have been very mild in comparison to mine, which, excluding a severe allergic reaction to Neulasta, weren't particularly bad for TC.   Good luck on your decision. ",
      "MessageIndex": 24,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/780827",
      "Title": "Oncotype DX testing bethhoul MimiNC"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jan 28, 2012 05:22PM - edited Feb 27, 2012 04:03AM by doxie smva- I'm glad you've settled on what you feel comfortable doing and that I could help a little.  A friend of my sister's had the same oncotype score as you did, and had 4 rounds of TC.  She is 65.  She handled it better than I did.  Good luck with CMF.  I hope all goes well.  ",
      "MessageIndex": 45,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/780827",
      "Title": "Oncotype DX testing bethhoul MimiNC"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 3, 2015 04:53AM doxie wrote: I'd suggest getting a second opinion from another RO. It does seem an unusual suggestion to do radiation under the circumstances described, with the BMX, smaller size and no lymph node involvement. Radiation may cause problems for breast reconstruction, so getting it for a very small % of benefit may not equal the risk involved, and it is not risk or pain free.",
      "MessageIndex": 5,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/828129",
      "Title": "My doctor changed is mind about radiation jd44 bride"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jan 10, 2016 05:23PM doxie wrote: You won't be able to go back to work on the same day. You'll have anesthesia, which will require someone to take your home. It somewhat depends on whether you have twilight or general. I don't bounce back very well from general, but I was back at work in three days. Had surgery on Friday and was back to work on Monday because I had to. Had to take naps to get through the day for a week, which were 10 hour days. When I had twilight, it didn't effect me to that degree. I was ok the next day.",
      "MessageIndex": 4,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/839786",
      "Title": "Regular Biopsy vs Excisional Biopsy? Plain English? breastquest kaylynn"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jan 10, 2016 11:52AM doxie wrote: I had an excisional biopsy because of the location of my lump, right under the skin of my areola. So location is part of why you might get one over the other. The MD at the breast center wouldn't do the core-needle biopsy because he said it would cause too much pain and he couldn't get at it from another angle. Areoles are quite sensitive tissue as we all know. The doctors also wanted to do the excision instead of an incision because they didn't think it was BC, but were concerned it might be melanoma or some other skin cancer. They wanted to send the entire tumor for testing because it was so atypical. Because it was BC, (certainly better than melanoma in the breast!) and by my nipple, the BS went back in on a 2nd surgery, removed the nipple, more tissue and did the SLN biopsy. Somewhat a pain to do two surgeries in two weeks.",
      "MessageIndex": 2,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/839786",
      "Title": "Regular Biopsy vs Excisional Biopsy? Plain English? breastquest kaylynn"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Aug 20, 2013 05:59AM doxie wrote: chaya6, I found this via google.   \"Lumpectomy is removing a sphere of breast tissue with the tumor centered in the sphere and 1 cm margins would be ideal.  Segmentectomy removes a lobe, shaped like an orange segment,  from the breast which encompasses the tumor and the draining duct system. Segmentectomy will remove in addition to the presenting tumor, other not so obvious small tumors along the duct, i.e. multifocal disease.   Quadrantectomy usually encompass 2 or 3 segments and is reserved for large tumors or tumors at the edge or periphery of the ductal system.\" Itching is part of the healing process.  It may go on for a while.    ",
      "MessageIndex": 1,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809584",
      "Title": "Just had a Segmendectomy Cdx Cdx"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Sep 21, 2014 04:35AM doxie wrote: I wore my shirt twice while exercising.  One day a walk with weights, the next on a run.  I was having a mild LE truncal flare because I'd not worked out much the week before.  It is now back under control.  On my run yesterday, I stripped down to just the shirt, something I never did with the Sassybax (wore it inside out) and the UA tops (too ugly and poor fit) . It looks like a nice workout top and it did not ride up. May I suggest that we have someone take  photos of us in the shirts to show fit and help illustrate where things are fitting or not.  I'll have my daughter do mine later this week.  I think a front, back and side shot might be what is needed. I too would buy one.  Best so far for my LE.  ",
      "MessageIndex": 235,
      "PostDate": "21/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Sep 27, 2014 03:43PM doxie wrote: I'll be sending photos and comments soon.  My daughter took the shots an hour ago.  I put her in the shirt to show how it fits a smaller \"small.\"  Took photos of these too.",
      "MessageIndex": 257,
      "PostDate": "27/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 1, 2015 05:09PM doxie wrote: My breast is considerably smaller than my hips. I'm one of the testers and neither shirt I tried rolls up. I tuck it in and have no problems. Much better than other compression shirts.",
      "MessageIndex": 338,
      "PostDate": "01/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 2, 2015 01:39PM doxie wrote: If this helps, my chest is 34\" and hips 38.\" The small test shirts fits me really well. They give very good compression where I need it on top with good control in the belly and side handle area. There is a lot of give to the fabric, so I'd think someone + or - 2\" over the stated size measurements would be comfortable. I'm on the large side of a small and the two test shirts were very comfortable, one larger on top and one smaller. ",
      "MessageIndex": 345,
      "PostDate": "02/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 25, 2014 04:17AM doxie wrote: Carol, Just a thought about the shirt design.  I prefer exercising in a raglan sleeve instead of the regular set in sleeve of most T-shirts and other clothes.  I also think for LE that it is better to not have a tight seam running between the shoulder and upper arm.  Not sure how others feel about this.  ",
      "MessageIndex": 193,
      "PostDate": "25/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 9, 2015 06:05AM doxie wrote: Jennie, Most of us who tested the shirts have not likely purchased the new version. But from the two smalls I tested, I'd say the small run true to size for a compression shirt. The shaping keeps the bottom from slipping up like the male compression shirts and some other compression wear that I've tried geared towards younger athletic women. I'm a solid 6 and the sample shirts gave me very good compression for my truncal LE, better than a male UnderArmour small. I'd not order a small if you were an 8 or if you needed more compression and were on the small side of a 4. Hope this helps. ",
      "MessageIndex": 322,
      "PostDate": "09/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 20, 2017 01:25PM doxie wrote: I had a general for my excisional biopsy. I would think twilight might work. I had a port put in with that and it was a much more invasive procedure. I could tell what the surgeon was doing but was drifting into pleasant thoughts of leaves in a breeze dappled with light. Came out of it with few issues both times.",
      "MessageIndex": 2,
      "PostDate": "20/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855301",
      "Title": "Excisional Biopsy-Local (MAC) or General Anesthesia adw7374"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 28, 2013 05:51PM doxie wrote: If you are on an AI or going through menopause, then the drop in estrogen may be triggering posterior vitreous detachment (PVD) of which floaters and flashes of light are symptoms.  This is not an unusual part of aging, particularly for women.  It's also benign except that PVDs can rarely cause a retinal detachment which can cause vision loss. So you should see an ophthalmologist for a thorough exam.  I've recently had PVDs in both eyes. My dr said if I saw a curtain of darkness fall over my vision, it was a medical emergency.  Otherwise it's just the having to deal with the annoying floaters.   ",
      "MessageIndex": 3,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/803955",
      "Title": "Cataracts and eye floaters post treatment Stacie doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 24, 2014 06:17PM doxie wrote: I agree with Binney, black then beige.  I signed up to be a shirt tester/sizer.  Haven't found something small enough for exercising.  ",
      "MessageIndex": 191,
      "PostDate": "24/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Sep 19, 2014 02:56AM doxie wrote: I got the small test shirt in the mail yesterday.  Wore it a bit in the evening.  I have to say it is 10x better than the UA shirts I have and much cooler than the Sassybax shirt.  The fabric is firmer and even appears dressy.  How nice to have something effeminate instead of an ill fitting male shirt.   I'll see how it works on a run this morning. Thank you, Carol!",
      "MessageIndex": 223,
      "PostDate": "19/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Dec 6, 2014 06:00PM doxie wrote: Carol, I've tested the new GO LE shirt and it's about perfect for me. I'm a largish small and they got the fit right. Nice and firm, but not too contracting. Works really well for truncal LE with armpit involvement. Anyone else test theirs out?",
      "MessageIndex": 278,
      "PostDate": "06/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Dec 7, 2014 10:05AM doxie wrote: Possibly. I think GO is considering XS shirts.",
      "MessageIndex": 284,
      "PostDate": "07/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Dec 8, 2014 07:10PM doxie wrote: And we also have to thank Carol for working so hard on this project.",
      "MessageIndex": 288,
      "PostDate": "08/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 14, 2015 04:11AM doxie wrote: Barb, I think that the only option is to pull it on over your head. The neckline is small.",
      "MessageIndex": 333,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 6, 2015 05:36PM doxie wrote: Look at the sizing options! XS to XXL",
      "MessageIndex": 315,
      "PostDate": "06/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 3, 2015 04:48AM doxie wrote: The shirt is very hour-glass shaped to accommodate both hips and breasts, nothing like men's compression garments. I don't have implants, but now very squishy breasts after 3 years on AIs, so can't help you there.",
      "MessageIndex": 347,
      "PostDate": "03/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 30, 2015 06:25PM doxie wrote: Great! I could use a white one.",
      "MessageIndex": 359,
      "PostDate": "30/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Dec 7, 2014 08:20AM doxie wrote: Binney4, Yes, the sleeves could be a touch wider. I have chunky arms (and legs) relative to my trunk, so tailor my comments with that in mind. I also have a very slight LE flair up in my upper arm, but it is not related to the shirt. Almost never have that, but I had to stop running and cut most walking this week due to bursitis in my hip. Running controls my LE like magic as long as I wear some truncal and armpit compression. Time to go into LE remediation. bhd1, I have the small.",
      "MessageIndex": 282,
      "PostDate": "07/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jan 24, 2015 12:22PM doxie wrote: purple32, I have the short sleeved \"Armed and Dangerous\" and it fits well in the truncal area, but the sleeves are too tight for me. Not adding in LE, I have chunky arms for someone who wears a small. It works well when my armpit area is acting up, but not the arm.",
      "MessageIndex": 305,
      "PostDate": "24/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797778",
      "Title": "Shirt design for Lymphedema Journey McButterfly"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jan 27, 2015 05:50PM doxie wrote: Maybe you should got to the onco earlier? Or to your PCP? It might clarify what the problem is.",
      "MessageIndex": 1,
      "PostDate": "27/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/827941",
      "Title": "Bad node news at mammo cookiegal cookiegal"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 22, 2014 09:23AM doxie wrote: Men's small UA garments are too large for me.  I've checked the UA website and I cannot find boys compression shirts.  Has someone found them somewhere?  I suppose I could try is a boys medium in a less compressive shirt maybe that would work.",
      "MessageIndex": 6,
      "PostDate": "22/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/818284",
      "Title": "compression tank top recommendations alrz1980 jsquipu"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 12, 2012 02:31AM doxie wrote: NancyHB - You aren't that far from Ann Arbor and U of M.  Maybe you should find an there MO to see you at least each 6 mo to start, do blood work and follow you through Tamoxifen.  I finished chemo in January and rads in March.  Right now seeing my BS each 6 months, he orders mammos.  RO in 4 months and MO each 3 months right now overseeing Arimidex and its effects on bone density.",
      "MessageIndex": 11,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/787529",
      "Title": "5 year survival question dsub burge"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Dec 16, 2014 04:55PM doxie wrote: I don't have your history with a mom with stage IV BC. It was my grandmother, but post meno -not the same. I found a fribroadonoma when 17 yrs old. Didn't have it biopsied and it stayed with me until removed in surgery for BC nearly 40 years later. It never became malignant. Was never of concern in the 15 years of mammograms starting at 40. If you have surgery, you will have scarring that may obscure another problem. Still surgery may give you peace of mind.",
      "MessageIndex": 1,
      "PostDate": "16/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/827021",
      "Title": "Fibroadenoma- stay or go? ehastings1 Lolis"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Sep 7, 2016 04:47AM doxie wrote: Not sure this is related to the BMX, TEs , or SLN biopsies. It's hard to imagine symmetrical nerve damage from surgery. It seems like nerve damage and, because it is symmetrical, may be a delayed SE to Taxol. Have you hurt your back lately, pinching a nerve there? I'm sure someone else will PO in with more knowledge of BMX and TE SEs.",
      "MessageIndex": 1,
      "PostDate": "07/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847798",
      "Title": "Numbness in hands after SNB? TampaWhit doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jul 17, 2015 03:54AM doxie wrote: Do you know your percentages ER and PR +. Have you had your tumor send for Oncotype testing? This information is important in a decision as well as lymph node involvement and size of tumor.",
      "MessageIndex": 2,
      "PostDate": "17/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/833474",
      "Title": "Efficacy of chemotherapy for er+/PR+/her-ve/ki67-12% InvPapCarcinoma obsolete"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 25, 2015 10:04AM doxie wrote: I'm actually experimenting with the opposite, a compression tee first, then the sports bra. It's cold now, so I can wear something else over both. I may go with a Yummie bra instead of the sports bra since it may be causing LE flare in my arm pit. Not sure what is going on. I'm small and mainly need support to my still tender radiated breast.",
      "MessageIndex": 2,
      "PostDate": "25/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/836086",
      "Title": "Best Sports Bra/Truncal Lymphedema knittingPT tessu"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 25, 2015 05:27PM doxie wrote: It's a clothing company that sells mostly undergarments. I bought several bras at Nordstroms. You can get them from the company online or other stores. I have this one http://www.yummielife.com/mallory-racer-back-bra and this one http://www.yummielife.com/tanya-scoop-neck There is a new one that combines the first with a scoop back like the 2nd. These are very comfortable, but not terribly supportive. Not an issue with me as I'm small. On the first bras, I did have to stitch together the front where it crossed or my breast would fall out. A very minor adjustment.",
      "MessageIndex": 8,
      "PostDate": "25/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/836086",
      "Title": "Best Sports Bra/Truncal Lymphedema knittingPT tessu"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Nov 26, 2015 12:34PM doxie wrote: I'm small breasted, so I wasn't expecting problems. My more elderly MO would only let me use cornstarch. Right before boosts my axilla was very tender, but never pealed, and a week after the boost my tiny bit of areola left became one blister. Don't know if moisturizers would have made a difference. I started rads three weeks after chemo. I napped for an hour every evening and still slept like a rock each night. Clearly, I was still recovering from chemo and a very low RBC. Only wore camisoles and went braless much of the time. At 32B, not much of a problem.",
      "MessageIndex": 10,
      "PostDate": "26/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836994",
      "Title": "Any Women Who Had No Problems During Radiation? ChiSandy Grammy4"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jul 8, 2016 04:04PM doxie wrote: It should not take that long for results for theOncotype score. It took that long for me because the MO or lab didn't follow through. I called Genomics and found out they had not yet been sent.",
      "MessageIndex": 29,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842209",
      "Title": "Oncotype DX results are in... Nachout818 Lisey"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 1, 2015 03:36AM doxie wrote: Cheesequake, I like that name! Yes, numbness and tingling are normal and can last for years, but usually gets better within a year. When your nerves that were cut start regenerating, you'll likely feel mild electrical shocks in the area from the incision through your upper arm.",
      "MessageIndex": 1,
      "PostDate": "01/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830925",
      "Title": "Sentinel Node Biopsy numbness Cheesequake doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Dec 2, 2014 04:38AM doxie wrote: Rose, It is worth getting the Oncotype score on your tumor before starting chemo. It provides information that is useful throughout treatment into taking AI drugs. If ordered now, you may have the results before chemo is currently scheduled. Delaying chemo for one week to wait if necessary should not be a problem. I was on the cusp of needing chemo and the score made it clear I should have it. ",
      "MessageIndex": 141,
      "PostDate": "02/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 26, 2014 04:48AM doxie wrote: Anyone know why our tumors are not tested for invasion factors uPA/PAI-1 or if we are not routinely given this information.   uPA/PAI-1 for risk evaluation There is an increasing focus on new biological factors to further assess risk of recurrence in patients with grade 2 breast cancers in order to avoid unnecessary chemotherapy. The \"uPA/PAI-1-algorithm\" gives promising results 2-4]. The capacity of breast cancer for invasion and early hematogenic metastasis is closely related to the action of receptor-bound, tumor-associated proteases and a central role of the serine protease uPA (urokinase-type plasminogen activator). In independent studies, several groups have shown that the uPA antigen content in tumor tissue is a strong and independent prognostic factor in primary breast cancer 5]. Particularly within the node-negative group, the relative risk of relapse and decreased survival was highest in patients with elevated uPA-levels. In addition, the plasminogen activator inhibitor-type 1 (PAI-1) content in tumour tissue is also related to an increased risk of relapse and decreased survival which becomes visible by PAI-1 being a strong and independent prognostic factor in multivariate analysis. Combining the two invasion factors, uPA and PAI-1, by sequential selection (regression tree analysis) in node-negative breast cancer patients, a high-risk group can be identified comprising about 45% of all node-negative patients. Moreover, the remaining 55% of node-negative patients have an extremely low risk of relapse (93% disease-free survival after 3 years without any adjuvant therapy), so that adjuvant chemotherapy does not seem to be indicated 5,6,2]. http://www.biomedcentral.com/1471-2407/11/140",
      "MessageIndex": 104,
      "PostDate": "26/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 5, 2016 04:47PM doxie wrote: If you had a biopsy before surgery and the Ki67 data is from your surgical tumor, it may reflect cell growth repairing the tissue damaged during the biopsy. This would be growth unrelated to your cancer. Also, Ki67 test results often differ from lab to lab for the same tissue.  ",
      "MessageIndex": 156,
      "PostDate": "05/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Dec 2, 2014 06:38PM doxie wrote: Rose, A 9 lines up with your high Ki67. Seems pretty clear the Oncotype may not be necessary. It's confirmation that results are in agreement that is important for treatment decisions. The good thing is that chemo is effective against aggressive rumors and that appears to be what yours is.",
      "MessageIndex": 144,
      "PostDate": "02/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/799127",
      "Title": "Ki-67 score vs. Oncotype neugirl Jewel259"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Aug 11, 2013 08:15AM doxie wrote: I second what Ruth and the Moderators have written.  It seems that getting a second opinion is a good idea.   It's important to remember that while your mother-in-law means well, she is not an expert on cancer treatment, even if she is well versed in natural remedies.  Some women here get treatment from their doctors and complement it with natural medicine, supported by their cancer drs.  Doesn't exercise, eating a healthy diet, being a healthy BMI, living a healty lifestyle fit into this? A 52 is a high risk oncotype score. I'm sure your Grade is also indicative of needing chemo.  You don't list the size of the tumor, if you had lymph node involvement, if you are HER2+, or your Ki67 %.  Also how ER+ or PR+ your tumor was.  All of these are considered when deciding on chemo.   And Ruth is right, except for very limited situations, radiation must follow a lumpectomy.  My BS only performed a lumpectomy it if I agreed to radiation.",
      "MessageIndex": 3,
      "PostDate": "11/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809154",
      "Title": "Where do I go next? kayyblaine doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jul 31, 2016 05:14AM doxie wrote: That's probably relative to where you live. If you live on the coast and fly into Denver, that might be high enough to trigger LE. If you live in Denver, then it might take a trip up to nearby Pikes Peak to do it. I've heard of concern about taking the elevator up to the top of a very high building, such as the Willis Tower (formerly Sears Tower).",
      "MessageIndex": 16,
      "PostDate": "31/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/842450",
      "Title": "When to wear sleeve? aggiemegs doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Sep 8, 2016 04:59AM doxie wrote: CandyHB, So sorry you have to deal with this. Chemo is tough, but after a while you get used to the SEs and look forward to the 3rd week when you again feel more normal. There is an ebb and flow to chemo SEs. I see that you've joined the August 2016 Chemo group. It helps greatly to share your experience with others going through chemo at the same time. Do you have friends or family who can help with cooking, cleaning, and any other chores? This really helps. Don't be afraid to ask for help. I worked throughout chemo, but took the time off I needed to recover from each infusion. I took naps at work as needed. In the 3rd week when I was feeling normal, I cooked, froze meals and stocked the kitchen so I could rest the week of infusion. Another thing really important is to exercise, even if only for walks around the block. Exercise helps with mood and other chemo SEs. Hang in there.",
      "MessageIndex": 80,
      "PostDate": "08/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842209",
      "Title": "Oncotype DX results are in... Nachout818 Lisey"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 5, 2016 05:05AM doxie wrote: This confirms that your IDC tumor is Stage 1, Grade 1, HER2 negative, ER +, and PR+. The Ki 67 is 26% with ER at 100% and PR 49%. You also have DCIS and LCIS.",
      "MessageIndex": 1,
      "PostDate": "05/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/842782",
      "Title": "Pathology report Nachout818 SpecialK"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Nov 28, 2014 07:50AM doxie wrote: I had IDC not tubular. Not sure how that would have made a difference. My tumor was immediately below the skin right beside my nipple. They would not do a needle punch biopsy, they said, because of the pain it would cause. Hyper sensitive area. I had a surgical biopsy. If cancer my BS said he would then have to go back and take the nipple even if margins were clear. I now have a reconstructed nipple. Not perfect, but cancer free so far. I had the option of mastectomy, but preferred to keep my breast. The concern over not removing the nipple is that loose cancer cells could migrate to internal lymph nodes via the nipple.",
      "MessageIndex": 3,
      "PostDate": "28/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826577",
      "Title": "Tubular but close to nipple - Quadrantectomy or Mastectomy? katcar0001 katcar0001"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 24, 2014 06:47AM doxie wrote: Purple32, This is all so difficult, because the reason I think I still have a problem in the back armpit area is because of the compression I use for my trunk and arm.  Neither is effective in that area, though very effective otherwise.  ",
      "MessageIndex": 10,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820455",
      "Title": "GARMENT for truncal purple32 Binney4"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 12, 2012 09:26PM doxie wrote: bedo - I went to the RO one month after rads, next appointment 5 month.  His nurse measures for indications of LE, at baseline and followup appointments, maybe because it's more likely for me to get LE from rads than my surgery.  No one else on my team does this and I've not heard of this from anyone else here.  He also considers me still under his care because the breast is still healing from rads.  I was told if anyone insisted on palpating that breast or sending me for a mammo or US, to have them talk to him first. He has to clear me first and won't release me to my BS for mammos until I'm ready.   ",
      "MessageIndex": 5,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/788971",
      "Title": "Any real reason to keep that RO appt for follow up? bedo Fitz33"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 8, 2016 02:29PM doxie wrote: This all sounds like reasonable reactions to radiation. Don't be surprised if your breast gets worse in the next week even though you are finished. My areola became one large blister in the week after rads.",
      "MessageIndex": 1,
      "PostDate": "08/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/844102",
      "Title": "Last week of rads questions? rosierosie BC2015"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Aug 5, 2015 09:13PM doxie wrote: Bouncing on exercise balls is a great idea! And sounds like fun. Too bad my cat popped mine. I too did fine on a trip to higher elevation. I went hiking in Glacier National Park for two weeks. Was up and down in elevation by both car and hikes. Got achey on the longer plane flights, but arrived home without issues. I only wore compression on the plane. But wore a yummie bra when hiking since I primarily have truncal LE.",
      "MessageIndex": 10,
      "PostDate": "05/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/833615",
      "Title": "Need help managing lymphedema in high altitude scvmom65"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 5, 2014 07:49AM doxie wrote: Absolutely demand that your tissue be sent for an Oncotype.  It is informative beyond whether or not to have chemo.  It may help you decide on whether or not to stay on anti hormonal meds if you have severe SE.   The decision to have chemo, or not, and what type of chemo regimen is your decision, not the MO's.  ",
      "MessageIndex": 2,
      "PostDate": "05/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/825115",
      "Title": "can i demand Oncotype Dx testing zha-an kris1114"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 22, 2015 07:37AM doxie wrote: Did the surgeon explain why he wanted you to get the excisional over needle biopsy? I had an excisional, but it was only ordered after the radiologist actually saw the location of the lump when I was being prepped for the needle biopsy. He refused to do it because it was immediately under the skin of my areola right by the nipple and would have been too painful. I had a second surgery to remove more tissue and SLN after it was determined to be cancer. I think your surgeon is rushing you and a second opinion is a good idea.",
      "MessageIndex": 13,
      "PostDate": "22/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/835924",
      "Title": "Open biopsy vs Core Needle biopsy?? JM29 JM29"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jul 1, 2013 10:01AM doxie wrote: I understand that keeping the tattoos visible is important if you ever need additional radiation, either the other breast or some other problem.  It helps delineate the prior field of radiation.  I only have two and one is very visible in lower cut necklines.  I dab concealer on it.  I've wondered if it could be tatooed to look more lke a brown mole than a black felt pen mark.  It's the color that bothers me the most.  Getting my nipple done soon, so I may ask about this.",
      "MessageIndex": 3,
      "PostDate": "01/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/806982",
      "Title": "Getting rid of radiation tattoos? DLL66 macb04"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 8, 2013 12:12AM - edited Oct 8, 2013 12:18AM by doxie Musical, Thanks for your response. I wasn't aware of a break in stage. The red dots are now less bright, and slowly fading. Elbow pit swelling went down, but it was bruised. I had a sleeve special ordered, but it was too long. Questioned the fitter when he chose the longer length as I am a petite and have short arms. This one didn't fit because of the arm length and he pulled one off the shelf for me. I was confused because the first one was special ordered, or so I was told. I was not impressed with the fitter's attitude. Seemed to be bored with his job. I've called and am waiting for his reply about the situation.",
      "MessageIndex": 2,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/812396",
      "Title": "Tight sleeve or allergic reaction? doxie doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 11, 2012 05:53AM - edited May 11, 2012 05:57AM by doxie Has truncal LE been ruled out?  Sounds like a possibility.  I'd suggest reposting on the Lymphedema forum.  I don't have LE so cannot offer much more help with this.  ",
      "MessageIndex": 1,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/787281",
      "Title": "Pain all over radiation site healthy133 evergreen9"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jan 17, 2012 10:10AM - edited Feb 27, 2012 10:29PM by doxie Patrithia - I need to learn patience from you.   I had horrible hives that came and went over a 5 week period.  First we attributed them to anti-nausea medication, then I got them again one day after my 3rd TC infusion and hours after the Neulasta shot.  At the urging of another dr, I called the oncology pharmacist who suggested it was the Neulasta.  My MO was still concerned it could have been the taxotere, so he gave me the option of not doing the 4th round.  Went ahead w/o the shot.  Still have the hives 4 weeks after the Neulasta shot, but they are tolerable.  Only one week out from the infusion, still looks like it was the shot.   But with the length of time taxol stays in the body, I wonder what the half life is on Neulasta in comparison.  I'm concerned how soon these will leave, or if I'll get another crop even from the taxotere.  At the worst taking steroids and Benadryl simultaneously couldn't keep me comfortable.   Has an experienced oncology pharmacist been consulted?  They see more patients than an MO or a derm or allergist.   One option is to take a chance with Herceptin and see if it gets worse.  Hopefully it will only be the T.  T is quite possibly the problem.  Can't speak for H since I didn't need it and haven't done any research there.   I wish I could help you more. ",
      "MessageIndex": 1,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/781088",
      "Title": "HER2+ Rash with T/H Patrithia Patrithia"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 11, 2012 07:40AM doxie wrote: scaredycatwoman - First off, are you ER+ and HER2-?  If both, then the oncotype test can help you. If ER+ and HER2-, I'm guessing that one MO is dismissing the need for the oncotype test because you are grade 3 and have node and lympho-vascular involvement.  If your onco came out low intermediate or mid intermediate, the node and lympho- involement would likely push the scale towards chemo.  Since you are grade 3, it is very unusual for the scores to fall into the low-intermediate or low range.  Very likely the MO sees chemo as necessary and the onco score wouldn't change that.  That MO might also be considering what % your ER and PR are and how effective homone receptive tx will be, as well as other results in the pathology report.   The other MO might want to see the range in which the onco falls to help guide the type and number of rounds of chemo you might receive, and maybe hope the score will be low enough wouldn't need it.    Even though grade 2, I could have skipped the onco because my PR was very low and Ki67 very high.  It was pretty clear it would score at least mid- high intermediate.  Did it anyway and is one point below high risk.  Because I know how high my recurrance risk is, it's always in the back of my mind helping push through all other treatment and other activities that will help prevent a recurrence.  It's a useful piece of information to guide you for the rest of your life, not just to decide on chemo. I'd definitely push for it.  It's another valuable piece of information you can use to make decisions.   ",
      "MessageIndex": 11,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786838",
      "Title": "use of oncotype dx test on node positive idc scaredycatwoman worried15"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 24, 2016 11:03PM doxie wrote: My RO was old school. He only allowed the use of corn starch and scent free Dove soap during rads. I had residents roll their eyes when he checked that I wasn't using anything else. My axilla became very tender towards the end, but I didn't blister until after the boosts were completed. So it got through it without either oil or water based lotions. Some ROs allow products immediately after rads, but nothing up to several hours before treatment. I'm sure someone else will reply with their experience soon.",
      "MessageIndex": 3,
      "PostDate": "24/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/841588",
      "Title": "Radiation question for my mom TwinklyToes Moderators"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Nov 30, 2014 08:48AM doxie wrote: I was allergic to Neulasta upon the first infusion. First reaction was only mildly tender spleen and short lived, though intense, left shoulder pain. Got hives after 2nd infusion, but we didn't pinpoint that on Neulasta. After 3rd infusion I had hives raging all over my body head to toe. Took Benedryl and steroids for two weeks to get it under control. Had the hives for 3 months before clearing up.",
      "MessageIndex": 17,
      "PostDate": "30/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769465",
      "Title": "Itchy rash/hives from Taxotere??? mdg doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 14, 2016 11:41AM doxie wrote: Bouncing exercise like light jogging and using a small trampoline really helped me. When I didn't do these at least 3x per week, then I had more troubles. I think the bouncing along with deep breathing really helped move lymph fluid through the body.",
      "MessageIndex": 51,
      "PostDate": "14/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/844665",
      "Title": "Not an acceptable side effect Ropes-End juneping"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 24, 2014 07:28PM doxie wrote: It could also be from Neulasta if you are also getting that.  I was allergic to it and had hives for months after stopping it after the 3rd infusion.  Very hard to tease the cause out.  ",
      "MessageIndex": 13,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769465",
      "Title": "Itchy rash/hives from Taxotere??? mdg doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 25, 2015 07:44AM doxie wrote: Kayboxer, I feel your itch. I was allergic to Neulasta and it took 3 infusions to pin point that. Call your ONC ASAP. I also called the clinic pharmacist who was dispensing the chemo. She helped more than the MO did. It could be one of several things and can be hard to figure out which. I did steroids a benedryl 24/7 to get it under control. Took another 3 months for the hives to completely go away. You are in a tough spot because you are early in your treatment and really need it due to triple neg BC.",
      "MessageIndex": 34,
      "PostDate": "25/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769465",
      "Title": "Itchy rash/hives from Taxotere??? mdg doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Nov 1, 2016 08:57AM doxie wrote: I became horribly allergic to Neulasta. First shot I had such a mild reaction I didn't pin it only anything in particular. After 2nd shot I got hives that I blamed on an anti-nausea drug I started taking. After the third shot the onco pharmacist and I had figured out it was the Neulasta. I skipped the 4th as it would have put me in the hospital, though neutrapenia almost did. Almost had to go after 3rd. I had moving swaths of red and inflamed hives all over my head and neck, as well as various sections of my body. Took constant Benedryl and steroids to calm it down.",
      "MessageIndex": 45,
      "PostDate": "01/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769465",
      "Title": "Itchy rash/hives from Taxotere??? mdg doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 24, 2014 08:52PM doxie wrote: I hated to be on steroids.  Took both steroids and benedryl at the same time to tame the hives.  Still had sheets of red moving around the gody",
      "MessageIndex": 15,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769465",
      "Title": "Itchy rash/hives from Taxotere??? mdg doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 18, 2016 01:02PM doxie wrote: If you've not yet done so, post this on the Illinois Ladies Facing BC thread. Many who visit there can help you with north side doctors of all specializations of which there are many. I live further south so can't help there. It's not uncommon in some practices for the surgeon to take the lead until after surgery. I didn't see an oncologist until a month after surgery. If your tumor is small and ER + and HER2 - with no apparent node involvement, chemo is not common before surgery. What I think important is to have a full understanding of the genetic test results before going into surgery. You should be counseled by a specialist if the results are positive.",
      "MessageIndex": 3,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844368",
      "Title": "Just diagnosed on 5/13/16. I live in Evanston and have questions peaches1 peaches1"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 9, 2015 06:53AM doxie wrote: I skipped right to an excisional biopsy, because the tumor was right under the areola and the dr doing the needle punch refused to do it. He thought it would be too painful. Surgery was minor and I had no associated pain. Unfortunately it was IDC and I had to have more surgery and sentinal node biopsy which is more invasive and painful to recover from.",
      "MessageIndex": 2,
      "PostDate": "09/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/830268",
      "Title": "Fibroadenoma Lumpectomy - What should I expect? NikkiDee377 SummerAngel"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 5, 2016 07:50AM doxie wrote: I hope you find the help you need. I wish I could otherwise help you with finding a solution. My only suggestion is to try move the fluid to outer lymph nodes manually. This has helped my breast LE.",
      "MessageIndex": 14,
      "PostDate": "05/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/841124",
      "Title": "Truncal LE spreading to other side. paintThesky Binney4"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Nov 15, 2016 10:52PM doxie wrote: The risk is there, but I'd think it low if you have no active LE and have not had radiation. I had truncal/breast LE and have had two surgeries on the BC side. I'm almost symptom free now. I had a partial MX and lost my nipple/areola tissue. I had a nipple constructed and the areola tattooed in the same surgery. I already had mild LE and this aggravated it a little. All calmed down after about 6 months. Keep in mind that this was surgery on a radiated breast and it is not surprising that it took longer to heal, so promoted additional LE.",
      "MessageIndex": 1,
      "PostDate": "15/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/850141",
      "Title": "mastectomy tattoo and lymphedema risk? gypsyrambles hugz4u"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 11, 2014 07:22AM doxie wrote: steelerose, So sorry you are experiencing this on top of having mets.  Yes, it is time for an LE referral. Wearing a compression garment, even an athletic shirt has helped many of us.  Depending on your size, Underarmor men's compression garments work well. You will need to go down a size to get enough compression.  Some of us use Sassybax camisoles or shirts.  People also buy camisoles from SPANX or other similar cheaper brand at Target or outlet stores.  It takes lots of trial and error.   Doing manual lymph node massage also can help.  It's more challenging for the truncal areas, especially the back.  I'm sure you'll get more comments soon.",
      "MessageIndex": 1,
      "PostDate": "11/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820981",
      "Title": "Tired of hurting! Breast/Truncal Lymphedema??? steelrose glennie19"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 24, 2015 02:37PM doxie wrote: Have you filed an appeal to the ins co? It seems that even though delaying until your infection is cleared up is an option, but not a good one because it looks like your chemo has been delayed. Neupogen certainly is another option to check on. I had TC each 3 weeks and still got a Neulasta shot, except for the last round. I had a serious allergic reaction to it. It was good I managed 3 shots because after the 4th round I barely escaped the hospital and had a WBC so low I had to wear a surgical mask. My next round would have had to be delayed. So even those of us on TC over 3 weeks often need one of these drugs to continue.",
      "MessageIndex": 1,
      "PostDate": "24/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/836043",
      "Title": "Neulasta vs Neupogen (sp?)- Insurance issues!! Artista928 aquamarine77"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jul 16, 2016 07:11PM - edited Jul 16, 2016 07:12PM by doxie The answer is #3. The risk of LE is real and most of your doctors will minimize it. Mine is more truncal than in my arm. It has gone dormant as my breast and axilla have healed from radiation and surgery. My RO was willing to accept the blame. I'm a klutz and seem to get cuts, scrapes, burns, and cat scratches all the time. I also had surgery for trigger thumb. Except for an infection around the stitches, which I also had after nipple reconstruction, I've not had any problems with my mishaps. I count myself lucky that I've a strong immune system. I'm slow to or forget to apply antibiotic ointment. I know others have not been so lucky.",
      "MessageIndex": 1,
      "PostDate": "16/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/846024",
      "Title": "Question on lymphedema risks Leydi Cinnamon68"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 5, 2014 10:31AM doxie wrote: Divecat, Zha-an stated that she was ER/PR+, so she qualifies with and w/o a positive node.   The following comments are based on my experience as someone whose tumor was tested through Oncotype DX and who has used the results to base treatment decisions, from chemo and beyond.   The Oncotype provides an analysis of the tumor giving useful data.  Results show risk of recurrence both with Tamoxifen and without.  Yes, surgical removal of the tumor is understood, but if anything else is assumed, it is that the med, if taken, is Tam, not an AI.  Whether or not to have chemo is not the only decision women in active treatment use the Oncotype results for.   Some women choose to not take an anti hormonal if their recurrence risk is very low without them.  I guess this might be called \"off label\" application. Women who have very serious SE from Tamoxifen or AIs can use the Onco results to help them decide whether or not they want to stay on meds based on their risk.  I know I have, as have others.  In one woman's case her Onco score, and subsequently recurrence score, was so low that if she stopped taking the AI, it would have only raised her risk 1-2%.  For QOL she stopped.  When I had to make such a decision, my risk would have jumped to 30% even having taken chemo.  Even though my MO would have supported my decision, I felt the risk was too high and I fought through the serious SE.   This is why I think everyone with ER+ BC should fight for the Oncotype.  Even with positive nodes, this is another set of information that can help you make treatment decisions down the road.  Yes, it was initially designed with determining the value of chemo, but I have found it useful beyond. ",
      "MessageIndex": 8,
      "PostDate": "05/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/825115",
      "Title": "can i demand Oncotype Dx testing zha-an kris1114"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 5, 2016 07:16AM doxie wrote: Hopefully you won't get LE. Many at high risk don't. I have mild truncal LE that is now well controlled. I drink a little. No matter how hard I try not to, I now always wake up and find myself to have slept on my BC side, my preferred side most of my life. Earlier my breast was still tender from rads and that usually stopped me. So even though I already have LE, neither of these seem to aggravate it.",
      "MessageIndex": 1,
      "PostDate": "05/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/844885",
      "Title": "Lymph edema Risk and Drinking/Travel/Sleeping on side Jojobird amanda6"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Aug 26, 2013 06:34AM doxie wrote: erydall, I had a great deal of numbness from the SLN incission to the elbow.  It took about two months to get most of the feeling back.  In the meantime there were the electrical charged pain that were the nerves repairing. My numbness didn't extend to my hands.  My NP suggested Vit B supplements.  You should check with your BS before taking any though.  ",
      "MessageIndex": 6,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767836",
      "Title": "post-lumpectomy -how long should it be sore? Melmes doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Nov 17, 2015 11:43AM doxie wrote: Carol, It's so sad that she was taken by another cancer, but good you and your family could be with her in the end. My thoughts are with you.",
      "MessageIndex": 1795,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 20, 2016 08:23PM doxie wrote: I had diagnostic the first two years, the screening there after. Regardless, the techs decided twice to do additional exams following screening exams. I haven't much faith in mammograms since I found my lump in plain sight, right under my skin, a few months after one. It grew from nothing in such a short time.",
      "MessageIndex": 5,
      "PostDate": "20/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/845294",
      "Title": "Screening vs Diagnostic Mammogram JuniperCat JuniperCat"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 23, 2014 08:57PM doxie wrote: Thanks!  This may work for me as a substitute for a (too large) small men's compression garment.  http://www.abriefaffair.com/Sassybax-Armed-and-Da...   My LE is truncal and in the upper arm.  Very pricy, but perhaps worth it.  May have to wear it inside out though.  ",
      "MessageIndex": 4,
      "PostDate": "23/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820455",
      "Title": "GARMENT for truncal purple32 Binney4"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 1, 2014 09:34PM doxie wrote: Reporting in.  I just got this in the mail.  http://www.abriefaffair.com/Sassybax-Armed-and-Da...  UnderArmour men's small tops are too large, so I was hoping this would work.  I got it in a small.  Right now it feels great!  I'm wearing it inside out.  I finally have compression in my back armpit area.  The sleeves are a little tight at the bottom, so I may cut them to fit better over my LE sleeve.   My LE is very well controlled, but we know how that can go.  I need a garment to wear when I exercise and when I feel LE acting up.   Hopefully this will work until Carol get our perfected garment on the rack.",
      "MessageIndex": 19,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820455",
      "Title": "GARMENT for truncal purple32 Binney4"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jan 22, 2012 01:08PM doxie wrote: My memory may be wrong (I did have chemo), but I think I read somewhere that the tumor sample sent out for oncotype testing has to be at least 5mm.  They test the tissue 3 x for accuracy.  Your original pathology testing uses up tissue also, before it would be sent out for oncotype testing.",
      "MessageIndex": 11,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/781225",
      "Title": "oncotype testing for very small IDC dancetrancer doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jan 22, 2012 03:26PM doxie wrote: kira1234 - Thanks for correcting me.  I don't know why I should think I would correctly remember something like that from September when I did my oncotype research.  ",
      "MessageIndex": 16,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/781225",
      "Title": "oncotype testing for very small IDC dancetrancer doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Mar 12, 2012 10:33PM doxie wrote: Florida55, I am so sorry your score is high.  I'm sure it's frightening to be shocked like that.  I had done enough research to know that with my very low PR and high Ki67 that I would score well into intermediate on the oncotype.   I was still shocked when it came in at 30.   A high score means that chemo will be effective at fighting the cancer.  My MO said a higher score wouldn't have changed the chemo I was given, TC X 4 at 3 weeks each.  Yours has been caught early, it's small and you don't have lymph node involvement.  Chemo and radiation will bring your recurrence down considerably.  Tam or AIs even further.    Good luck on your appointment with the MO. ",
      "MessageIndex": 11962,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 27, 2012 07:34AM doxie wrote: Topic: NSABP B-47 Herceptin for HER2-Low Invasive Breast Cancer Your MO is trying to give you something more than what those with triple negative get.  Since you are essentially triple neg, you might find help in that forum.   Good luck.",
      "MessageIndex": 2,
      "PostDate": "27/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/788061",
      "Title": "Newly diagnosed maa764 maa764"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 1, 2016 03:07PM doxie wrote: Wholenewworld, There is hope. Your LE may calm down as your breast heals from rads. I struggled with truncal and upper arm LE for 4 years. My RO accepted most of the blame for it, though I also had seven nodes removed. His nurse measures for it. SO was somewhat sheepish when I ask why so many nodes were removed and said, \"two lit up and the others were clumped together.\" In the last 6 months I've not noticed active swelling. Still some aches and pains when overexerting.",
      "MessageIndex": 49,
      "PostDate": "01/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/844665",
      "Title": "Not an acceptable side effect Ropes-End juneping"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Aug 3, 2013 07:58AM doxie wrote: zcbm1357,   It takes me a good two weeks to fully recover from anesthesia and surgery.  I think the former is the problem.  I'm otherwise healthy and fit, work out during this period, but I still feel very tired at times.   It's really great you are supporting your mom by going online here.  ",
      "MessageIndex": 1,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808751",
      "Title": "Why my mom still feel fatigue? zcbm1357 LJDH"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Dec 18, 2015 06:33PM doxie wrote: Great!!",
      "MessageIndex": 3,
      "PostDate": "18/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838608",
      "Title": "For anyone having an excision biopsy nervous321 TnMimi"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 20, 2015 06:02PM doxie wrote: I love Kathy Bates. What an actress!",
      "MessageIndex": 2,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/828681",
      "Title": "Kathy Bates discussing LE Luvmydobies glennie19"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 24, 2014 06:17AM doxie wrote: Binney,  You are correct for those who wear sleeves.  I only wear compression when I exercise, fly or the underarmor top when I feel my armpit area grow heavy.  That's where I need the compression more often, but my sleeve and a compression tank don't hit there.  Th UA top is not small enough.  My LE is mild and very well controlled.  ",
      "MessageIndex": 8,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820455",
      "Title": "GARMENT for truncal purple32 Binney4"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 21, 2013 12:11AM doxie wrote: Went kayaking yesterday and my arm is fine afterwards. Last week I went back for a refitting. They said the sleeve was properly fitted, but they ordered the larger size without the silicon dots. Still OTC but no swelling, bruising or any other problem after two good hours of paddling. I know I still need to track down a place that takes my insurance and will do a better fitting and order a custom sleeve, if I find this new sleeve still doesn't work over time.",
      "MessageIndex": 5,
      "PostDate": "21/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/812396",
      "Title": "Tight sleeve or allergic reaction? doxie doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 14, 2016 09:16PM doxie wrote: Mine is a Rebounder. It has a training bar to help stabilize yourself. You can bounce without lifting you feet or jump or jog in place. Whatever you feel comfortable with. I found it challenging at first but was getting rads and getting over chemo at the time.",
      "MessageIndex": 53,
      "PostDate": "14/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/844665",
      "Title": "Not an acceptable side effect Ropes-End juneping"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 15, 2016 06:05AM doxie wrote: I guess we don't love our MO s in Chicago. While I like my guy, he's unlikely to be a good match for you. Still if no one chimes in, I could PM you his name.",
      "MessageIndex": 1,
      "PostDate": "15/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845177",
      "Title": "Do you love your Chicago oncologist? Tell me more. DancingVeggie doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 15, 2016 06:54PM doxie wrote: I'll PM you, but you might post this on Illinois Ladies with BC.",
      "MessageIndex": 3,
      "PostDate": "15/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845177",
      "Title": "Do you love your Chicago oncologist? Tell me more. DancingVeggie doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Mar 19, 2015 08:07AM doxie wrote: GrammyR, I was surprised to find I was allergic to the silicone that is used to keep the sleeve up. The first time I wore it for any length of time, I had little dot impressions on my arm for a week. Red and itchy. Got a new sleeve w/o the tacky band. Stays on my upper arm fine. Good thing I opted for an LX instead of MX with silicone implants. That would have been an ugly journey with an allergic reaction to implants. I too have lots of allergies, some rather strange.",
      "MessageIndex": 1533,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Nov 6, 2015 02:18AM doxie wrote: carol57, So sorry about your mom. I'll be thinking of you.",
      "MessageIndex": 1762,
      "PostDate": "06/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 2, 2014 07:40PM - edited May 2, 2014 07:41PM by doxie I only wear my sleeve when I exercise, clean house, fly, or feel heaviness in my arm.  I'm putting the top on when I get home from work.  I've not yet cut the sleeve in half.  Only then will I try it with my sleeve.  The UA top was so loose that it didn't have any impact on my sleeve.   I may try wearing it to bed over at work.  I think my LE is slowly escalating.  ",
      "MessageIndex": 22,
      "PostDate": "02/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820455",
      "Title": "GARMENT for truncal purple32 Binney4"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jan 28, 2016 07:04AM doxie wrote: Mine are mole size and blue black. When I wear a low cut top, I dab a bit of eye concealer on the one visible. Otherwise they aren't an issue for me. It's better now that they are fading.",
      "MessageIndex": 16,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/840725",
      "Title": "Permanent tattoo markings for radiation LM070917 LM070917"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Aug 20, 2015 07:35AM doxie wrote: ",
      "MessageIndex": 26,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/834247",
      "Title": "Appointment with surgeon - more questions than answers solfeo ShetlandPony"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Nov 1, 2013 06:31AM doxie wrote: I have very mild LE both truncal and and upper arm. As it has gradually gotten more active, my shoulder now hurts with flares. I too have a regular sleeve and wonder if one that comes over the shoulder would be more effective. With LE in both trunk and arm, why would the shoulder not be affected? Seems logical to me. It's in between the two LE areas.",
      "MessageIndex": 2,
      "PostDate": "01/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/813861",
      "Title": "shoulder mobility PersonalTrainer PersonalTrainer"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 4, 2015 08:19PM doxie wrote: Emilyc, I'm doing fine two weeks after trigger thumb release surgery. My only swelling is what would be expected from any surgery. My LE is truncal and upper arm only and usually very well controlled, so I felt the relief from pain and regained function was worth the risk. The surgery was done in a surgicenter with full antibiotic prep the night before and morning of. If I was getting surgery in a doctor's office, I'd definitely ask for antibiotics. I didn't because I already have antibiotic allergies and I need to save them for an actual infection. My mom has become allergic to almost every antibiotic around. Thankfully I seem to have a very strong immune system (except for BC if that was why I got it). I think SpecialK's suggestion to use the creme to see if it will work for you is a very good idea.",
      "MessageIndex": 10,
      "PostDate": "04/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832312",
      "Title": "Removal of possible basal cell on arm? Emilyc SpecialK"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "doxie wrote: I have very mild truncal and upper arm LE, nothing below my elbow. For two weeks now, I've been using a sleeve and under armor men's T during runs, weight lifting, walking and any strenuous chores. It's been working well for me. This weekend I took a three hour kayak trip down a river and wore the sleeve and shirt. I've kayaked this summer w/o much trouble triggering LE, but knew this trip would really stress my arm so wore the sleeve. One thing happened that made me think my sleeve may be too tight. My elbow pit was red, hot, tender, and slightly swollen later when I took off the sleeve. My hand was also slightly redder than the non BC hand - no swelling though. Really odd was that the silicon dotted binding on my sleeve left red, hot, tender and slight elevated dots exactly reflecting silicon dots on the sleeve. The dots are still visible over 24 hours later. Is the sleeve too light? Am I allergic to something in the sleeve? I am allergic to food dyes, chocolate, antibiotics, neulasta, etc. Otherwise the sleeve and shirt performed their job and my arm and trunk are just fine . Any ideas? Dx 8/2011, IDC, 1cm, Stage IA, Grade 2, 0/7 nodes, ER+/PR+, HER2- Surgery 9/2/2011 Lumpectomy: Right Hormonal Therapy Aromasin (exemestane) Radiation Therapy Chemotherapy Cytoxan (cyclophosphamide), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/812396",
      "Title": "Tight sleeve or allergic reaction? doxie doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Dec 25, 2015 05:17PM doxie wrote: Your husband won't help you pay for treatment? Doesn't he realize that if your bills are in collections, this affects his credit rating too? These are hardly optional expenses. So sorry you have to deal with in addition to BC.",
      "MessageIndex": 7,
      "PostDate": "25/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/838935",
      "Title": "Aching pain Left arm for past month, on bc side, worried. macb04 macb04"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jul 31, 2016 12:17PM - edited Jul 31, 2016 12:41PM by doxie My LE is milder than yours, so you will likely need to continue all you are doing now to control LE. I hiked for two weeks at Glacier National Park last summer. I wore compression when flying, including a compression shirt, since my LE is mostly truncal. I hiked without compression, though I was prepared to use it. Deep breathing has always helped control my LE, so that likely really helped counter altitude problems. Not sure it even would have been a factor. I did not use a back pack. Instead used a fanny pack. I had to limit swinging my LE arm, pumped my arm fairly often, and used only one walking pole with my non-LE arm. If I'd conditioned with walking poles before arriving, I might have been able to use both. In the end, I managed just fine. I also kept well hydrated. It's a dry environment most days, at least when I was there. I hope you have an equally successful trip.",
      "MessageIndex": 1,
      "PostDate": "31/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/846514",
      "Title": "Flying with Lymphedema? debbis pjparsons"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jul 8, 2016 01:00AM doxie wrote: I'm now dealing with a rib fracture from coughing caused by a severe cold. Two weeks into the injury, I've held off getting x-rays because they seldom show rib fractures of this type until they start healing or are healed. So this is in line with what your PET shows and the fact that the rib fractures didn't show up when you were in pain. I wonder what your Onc will say. Since treatment is home care with restricted movement and NSAIDs, my PCP is fine with coming in only if the pain doesn't subside. We are looking at 4-6 weeks to heal. My question is why my ribs couldn't handle the stress of coughing. Bone density? Mets to ribs? It was on the side opposite to BC, so I cannot blame it on radiation. Hoping this heals so I don't have to follow up with my MO to check on mets.",
      "MessageIndex": 4,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/845576",
      "Title": "Bone vs. PET scan results awnie1301 doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 31, 2015 08:44AM doxie wrote: Thanks, Carol. I came to the conclusion that surgery was less risky than the cat scratches I get from time to time. And the tourniquet probably not unlike spending a day cleaning out a garage, painting a room, or helping someone move. All things that could aggravate LE. The end result of the surgery would allow me to return to activities I've had to avoid or curtail. I think in the end you just go with your gut as to whether or not it will work out ok.",
      "MessageIndex": 2,
      "PostDate": "31/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832188",
      "Title": "Trigger thumb surgery on LE side doxie ChiSandy"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 1, 2015 09:04PM doxie wrote: SpecialK, It is so difficult to know what to do in these cases. Removing two 1\" cubes of skin from an LE arm seems much more invasive than the 2\" incision I had. I hope the treatment works for you. My truncal LE flared with nipple reconstruction, once after walking too long with weights, and when helping my daughter pack and move. I've been lucky otherwise. No lower arm involvement except for my thumb swelling related to the pain and inflammation of trigger thumb. Unfortunately splinting didn't work for me. I'd have preferred that. I've had the same generic exemestane since starting the med, Roxanne. Only last year was there another option for a generic from another manufacturer, Alvogen, and it barely has a foothold in the US. Mostly Eastern Europe and Asia. I think I'll pass. I think my problem is lack of estrogen that can only be resolved when off AIs. This was slow in coming.",
      "MessageIndex": 11,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832188",
      "Title": "Trigger thumb surgery on LE side doxie ChiSandy"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Mar 11, 2017 08:29AM doxie wrote: maria, That's a hard call. My LE is in remission, but was like yours and also in the upper arm. About 4 years out from radiation, my LE calmed down. But during active LE, I had two surgeries and a cortisone shot on that side. On the LE arm I had a cortisone shot in my thumb for trigger relief, then a year later had hand surgery for the trigger thumb. Before each, my thumb was inflamed from the pain. Not sure if this was LE or something else, because it remained only there. At any rate within two months of each I was both pain free and had no swelling in the thumb. The only infection was what I got from my two recent surgeries, localized at the stitches. Interestingly the other was nipple reconstruction on my LE breast. That swelling took six months to go down. It stretched from the breast through the upper arm, but still mild. It's true there is no guarantee the cortisone shot will work, nor last. Mine did for a year until the pain and triggering came back. Being pain free and regaining an areola, to me were worth the risk even though I had mild LE.",
      "MessageIndex": 2,
      "PostDate": "11/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/853373",
      "Title": "steroid injection for shoulder burstitis and LE risk maria26 JO-5"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 30, 2014 07:21AM doxie wrote: It's now been two weeks since getting a cortisone shot  for trigger thumb on my LE side.  I no longer have pain, which had gotten pretty much unbearable.  There is still a little triggering, but the swelling is almost totally gone. The best is that the shot didn't result in an infection or LE elsewhere.  ",
      "MessageIndex": 23,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/816905",
      "Title": "Can I get a cortisone shot in affected arm? BayouBabe crystalphm"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 15, 2016 07:12PM doxie wrote: I had a cortisone shot for trigger thumb, then a year later surgery. Major pain relieved both times. Each time I had some swelling due to the pain, which could only have been LE. I have mild truncal and upper arm LE. I also had swelling after surgery. I've since healed without any problems. As with my thumb, the shoulder pain could trigger LE.",
      "MessageIndex": 32,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/816905",
      "Title": "Can I get a cortisone shot in affected arm? BayouBabe crystalphm"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 15, 2015 12:56PM doxie wrote: JenilsStrong, You are too young for this! On the IDC Forum there is a thread for pre-menopausal women. That may be helpful for you. I'm post, so someone else may have other threads that could help. Jackbirdie, My oncotype was 30 and I did TC x 4. I was younger than you and had been post meno for some time. The tumor was very low PR and very high ER with a high Ki67 of 40%. MO wanted me to do chemo and, since people in my family live to the mid-nineties, I too thought I should. Also I have a lot of odd allergies so was worried I might not be able to tolerate AIs or Tamoxifen. Turns out I was allergic to Neulasta, a shot you get a day after chemo to boost white blood cell counts. I was told the reduction for chemo was 7%. Now they have found that ER+ is more likely to recur after 5 years and the oncotype is not as good predicting beyond 5 years. It would be interesting to know how chemo affects this.",
      "MessageIndex": 19,
      "PostDate": "15/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828377",
      "Title": "Decision time- Oncotype dx 30 Jackbirdie Jackbirdie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Mar 9, 2015 11:43AM - edited Mar 9, 2015 11:44AM by doxie Kittydog, It may take weeks for a bad allergic reaction to clear up. It took me three months for hives to disappear after having a terrible head to toe reaction to Neulasta. Steroids and benedryl simultaneously over two weeks slowed it down, so I could tolerate it. I have a lot of food/dye allergies and these can linger for several weeks. ",
      "MessageIndex": 1509,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Oct 13, 2015 07:56PM doxie wrote: You'd scare a bugerler away!",
      "MessageIndex": 1642,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Nov 17, 2014 06:27AM doxie wrote: I had nipple reconstruction including a tattooed areola on a radiated breast, all done at the same time by my PS. Before the surgery I thought I might have Stage 0 truncal LE, but was not dx. After I definitely had it. Though mild, it took 6 months to bring it under control. My PS was meticulous with antibiotics and bandaging, but it didn't stop my body from reacting to the stitches and ink. Still I cannot imagine seeing a scar and no nipple/areola the rest of my life on that breast. I knew I was taking a risk. I'd now like a touch up, but may pass due to the initial reaction.",
      "MessageIndex": 6,
      "PostDate": "17/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/826321",
      "Title": "Tattoos after sentinel node biopsy? ahahto doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 31, 2015 06:07AM doxie wrote: maria26, Your doctors are correct in that patients with ER + HER2- tumors seldom have cancer go to the brain. HER2+ tumors are more likely to spread to the brain. It's much more likely you have something arthritis related. AIs such as arimidex seem to aggravate latent arthritis, or maybe even cause it after a while. Pain can easily radiate to other sites in your body from the site of swelling or degeneration in your neck. Since on AIs I now have lower back pain and hip joint pain. The pain radiates to my lower legs at time. Both are related to arthritis and age related degeneration issues. X-rays to both areas show no mets. I have no idea if the pain would have shown up regardless of BC treatment. It is so easy to let fear take over your life. I have done it myself. Maybe it would be helpful to ask one of your trusted doctors to help you find someone who could work with you on controlling fear. Regardless of whether or not cancer has spread, it seems that fear has taken over your life - a type of deadly cancer in and of itself. It is destroying your quality of life. Maybe this coupled with an X-Ray of your neck would help bring some peace. ",
      "MessageIndex": 1,
      "PostDate": "31/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/832194",
      "Title": "headache maria26 sandylo"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 8, 2013 07:07AM doxie wrote: Sorry you have to undergo this.  Hopefully this will be a benign finding.   I have had both, general twice for BC surgery and twilight for port surgery.  I'm not aware that I had a breathing tube inserted for the generals.  At least I had no side effects afterwards.  I would run this by your surgeon.  My surgical biopsy took well under an hour.  Depending on where yours is located, it may be quick surgery too.  ",
      "MessageIndex": 1,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/804375",
      "Title": "surgical biopsy FRIDAY general or twilight anesthesia? teesa2you leaf"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 9, 2013 06:30AM doxie wrote: When I had twilight I was aware of what was going on.  For the port placement, since it took longer, I was more under.  When it was taken out I remember thinking more of leaves glittering in the light than the surgery.  You could say I was in a nice place.   Hope everything is B9 also.",
      "MessageIndex": 5,
      "PostDate": "09/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/804375",
      "Title": "surgical biopsy FRIDAY general or twilight anesthesia? teesa2you leaf"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 3, 2012 06:27AM - edited May 3, 2012 07:53AM by doxie scaredycatwoman - Grade 2 tumors are usually in the gray zone for chemo.  This is why getting the tumor tested by Genomic Health is really important.  It's like getting a 2nd opinion on the pathology of it.  Always a great idea.  Grade, % of ER/PR/HER2, and staining are subjective.   If your ER and/or PR are low % and/or low staining, your HER2 at 1 or 2 +, and/or have a high Ki67, then your oncotype will likely be in the intermediate to high intermediate indicating chemo may be an effective treatment.  If these are the opposite, then chemo may not be indicated.  Your MO is likely suggesting chemo because of the size of the tumor.  That's the norm as a understand it.  Absolutely insist on the oncotype testing, though.  You need as much info as possible to make all your treatment decisions.",
      "MessageIndex": 21,
      "PostDate": "03/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/786551",
      "Title": "Chemo or no Chemo? Help! Jayme33 Jayme33"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Apr 17, 2014 09:10PM doxie wrote: Yesterday I got a cortisone shot in the base of my thumb.  I have severe trigger thumb on my BC side, probably from AI meds for two years and/or taxol.  Was also having pain in my other thumb.  I waited five months to see if it would go away.  Not. I have very mild LE and it was surfacing in my thumb and broader area even though it had never been below my elbow.  I was also in a lot of pain and had lost most of the function in the thumb.  So I took a chance on infection and expanding LE and had the shot.  Wow!  Instant relief with the injected pain medication and today pain is so much better.  Still triggering though.  Amazing how willing we are to tolerate severe pain in this journey.   ",
      "MessageIndex": 21,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/816905",
      "Title": "Can I get a cortisone shot in affected arm? BayouBabe crystalphm"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "doxie wrote: I'm over a week out from trigger thumb release surgery on my LE side. It was a very difficult decision because I already have truncal LE (well controlled). The pain and reduced function of my hand pushed me to take the risk. Pain and loss of function would only have gotten worse and another cortisone shot wasn't going to fix it. It's my dominant hand, also. Thankfully, I had only the minor swelling in my thumb and index finger that would be expected with the surgery. No infection or other problem related to use of the tourniquet for about 20 minutes. It was done at a surgicenter. I had to do the antibiotic washes the night and morning of the surgery as with all the other BC related surgeries there. So a very sterol situation. My surgeon had thoroughly researched the same surgery with another patient who was fearful of LE, but didn't have it at the time of surgery and had no problems afterwards. He agreed, though, that if I needed it on my other hand I should have the IV put in my foot and not my LE side. Dx 8/2011, IDC, 1cm, Stage IA, Grade 2, 0/7 nodes, ER+/PR+, HER2- Surgery 9/2/2011 Lumpectomy: Right Hormonal Therapy Aromasin (exemestane) Radiation Therapy Chemotherapy Cytoxan (cyclophosphamide), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832188",
      "Title": "Trigger thumb surgery on LE side doxie ChiSandy"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 1, 2015 07:00AM doxie wrote: Yes, I've read that trigger finger/thumb is a possible SE with Taxotere and Taxol. Clearly it's a late developing SE. Being a woman, diabetic, and/or having rheumatoid arthritis also up the chances. Well, I'm definitely a woman. The blood test for RA came out negative, but isn't always reliable in identifying whether one has RA or not. Not pursuing that more at the present. Not diabetic. I suspect those of us who have had T and are on AIs are more prone to trigger digits, but I've also read of women who've not had T but are on AIs who get it. AIs may tip many of us over the edge.",
      "MessageIndex": 7,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832188",
      "Title": "Trigger thumb surgery on LE side doxie ChiSandy"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 26, 2016 07:15AM doxie wrote: I agree. You should contact your surgeon. When I had nipple reconstruction with tattooing, the entire are became hot and red. This was after a preemptive course of antibiotics. Turned out my body was fighting the stitches. It subdued after a few days and I didn't need another round antibiotics. Had something similar to the incision area with recent hand surgery. Looks like I react to something.",
      "MessageIndex": 2,
      "PostDate": "26/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/841657",
      "Title": "Did anyone have breast edness in after partial mastectomy? phaila doxie"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 1, 2015 07:09AM doxie wrote: sandcastle, I posted in part because some of us will have to decide on whether or not to have surgery on our BC/LE side. I've seen other women struggle with this over shoulder surgery and cortisone shots. While one person's successful surgery won't mean that another person will also avoid LE related SEs, at least it should be out there that LE flairs aren't a given with surgery. I'm not totally out of the woods yet as I still have stitches to remove and am not completely healed, but am hopeful.",
      "MessageIndex": 8,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832188",
      "Title": "Trigger thumb surgery on LE side doxie ChiSandy"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 2, 2015 08:09PM doxie wrote: I've also had a lot of small moles of varying types appear after chemo. I'm watching them. Nothing that seems like skin cancer, but I'm a little concerned.",
      "MessageIndex": 13,
      "PostDate": "02/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832188",
      "Title": "Trigger thumb surgery on LE side doxie ChiSandy"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "May 31, 2015 09:36AM doxie wrote: Your dh sounds like he wants to help you also. It sounds like your therapist is a little clueless. If the young girl you are going to cannot understand where you are coming from, then look for someone older with more life experience. I usually prefer doctors around my age or older. The younger ones feel like my students and I have a hard time working with many of them for a number of reasons.",
      "MessageIndex": 3,
      "PostDate": "31/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/832194",
      "Title": "headache maria26 sandylo"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Jun 3, 2015 10:38PM doxie wrote: vinrph, You are probably correct that I need to see a dermatologist. I lived and worked in the sun in my youth on a farm. I was outside much of the time. Luckily I tanned well and have dark eyes and hair. Still I got way more sun that was healthy.",
      "MessageIndex": 16,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832188",
      "Title": "Trigger thumb surgery on LE side doxie ChiSandy"
    },
    {
      "AuthorID": "doxie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143085/profile",
      "Content": "Feb 16, 2015 02:25PM doxie wrote: I had very mild truncal and upper arm LE before nipple reconstruction. The radiated tissue became mildly infected. Afterwards I had a six month flare I was able to control and resolve. Having troubles again with a flare 1.5 years after that surgery. Hard to know if this latest one has at all been made worse by the reconstruction. ",
      "MessageIndex": 3,
      "PostDate": "16/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/828514",
      "Title": "Reconstruction after developing lymphedema? chipmunk57 chipmunk57"
    }
  ]
}