{
  "AuthorID": "dp4peace",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
  "Posts": [
    {
      "AuthorID": "dp4peace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
      "Content": "Mar 20, 2012 12:30AM dp4peace wrote: Hi Beesie, I appreciate your comments and questions. I found myself not able to spend much time on this site or any others intially because I didn't find the support I was needing. Yes, there were/are many stories of women who start out with DCIS and go on to have recurrence or invasive cancer, but that's not the support I was looking for. (I was already hearing that from my doctors). Considering I had low grade DCIS and did not feel right about the treatment options initially presented to me, I wanted to find others NOT doing \"standard of care\" but were choosing active surveillance/holistic health and natural risk reduction. Due to the nature of DCIS, the varying degrees, the uncertainty and depsite the debate even amongst well known breast cancer experts, surgeons and oncologists, very few women feel emboldened to take the path I have taken. I found one woman, who thankfully posted a link to her website here at BC.org -- and that was a HUGE help/support -- which gave me even more support for my difficult decisions.  I have seen a lot of your postings and they offer invaluable insight into what the \"standard of care\" says -- and it is great because most women leave their doctor's office spinning with questions, confusion and fear, fear, fear. You offer them solid information based on years of research and personal insights from your experience. What I am offerring is exactly what you stated -- a different perspective and additional/different information, and maybe some new information that you/others may not be aware of. My website offers my personal story/perspective with both conventional treatment (I did have 1 core needle biopsy and 3 surgeries) AND a holistic, integrative approach to risk reduction and active surveillance. I also offer health tips that I know will help anyone going through the ordeal of a DCIS or breast cancer diagnosis as well as those that are interested in reducing risk and preventing recurrence. My advice to someone who has high grade DCIS would be to first get a 2nd opinion on the pathology -- and I offer a specific resource for that. I would also never tell anyone that they should not do what their doctor is recommending. I just want women to have access to the controversial information and take the time to question, research and make a truly informed decision, not just a decision based out of what one doctor says, statistics or fear. I was fortunate to have a lot of counseling around the fear that is associated with cancer and I almost made decisions based from that fear. So, I know how that can be. We all go through it. But I was able to come to a place of peace with my unconventional decisions....and I'd like to be able to offer that sense of peace to others -- and not just hear more of the same concern, fear, statistics, stories of recurrence and \"what if....\" that we are already hearing from our doctors and others who are following the \"standard of care.\" Maybe there are 2 or 3 women out of 100 who are like me -- just searching for support for what they feel so strongly about, yet they feel so alone. Those are the women my website is really for. I think this is a healthy dialogue and one that is long overdue. Thank you Beesie. We need more converstaion and more dialogue around the topic of DCIS and individualized treatment. From recent articles and the latest research, I feel we are moving in that direction.  Thanks for all your valuable input and for helping women gain more understanding. Blessings of peace and health, Donna",
      "MessageIndex": 6,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    },
    {
      "AuthorID": "dp4peace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
      "Content": "Mar 21, 2012 06:19AM dp4peace wrote: Thanks for your reply Beesie & Alex. I had written a very long reply back but when I went to hit submit, it vanished! So it was not meant to be. I very much appreciate this healthy exchange. I created my website/blog because I felt there was a real lack of support around the kind of information I was discovering -- the information that empowered me to be strong in my beliefs and choices, despite the statistics and rush to treat DCIS so aggressively. I know other women want and need this information and I hope to make it easy for all women to find my site. That was my intention for posting it here. Most women have never even heard of DCIS -- until they or someone they know get the diagnosis. This is something I feel needs to change. I spent the last two years researching articles on DCIS, cancer prevention and posted everything I could find on a Facebook Group called \"Donna's Choice: Global Healing From The Inside Out.\"  I created DCIS 411 to share my investigation, personal story and gather the resources and articles in a cohesive fashion focusing solely on helping women diagnosed with DCIS. The \"standard of care\" info is pretty much a given with a DCIS diagnosis. Beesie, I feel you are saying pretty much the same things my oncologists or surgeons have said. Nothing different or new. The good thing is you take the time to explain it in a way that women can understand and digest and you offer your personal insights. You definitley know your facts and I appreciate what you offer here. But with all that you offer, it did not give me the support I was looking for...and I know there are others like me that are looking for more support. I also want to say that it is not really fair to say that I am going against my doctor's recommendation. I simply found a doctor whose recommendation I was more in alignment with. There are all kinds of conventional doctors recommending different things. This is what I want women to know. Just because one doctor recommends a treatment plan, that does not mean that is the right or best treatment plan for your particular situation. It took me 4 doctors to find one that I aligned with. I am doing the treatment plan she suggests. I am waiting on results of the Oncotype DX Test before determining my next step. I am researching and evaluating if tamoxifen is a wise treatment choice. I am in no rush. I had a follow up RODEO MRI 3 months post surgery and it was clear. My surgeon had never heard of a RODEO MRI and I had to drive 1.5 hours away to UC Irvine where they had this special dedicated breast MRI. This is another important conventional resource I list on my site.  I know 2 years is not a long time in the DCIS world from a recurrence standpoint, but from my perspective, it has been a long journey of constant investigation, decisions, biopsies, surgeries, results, follow-up as well as coming to a place of total health and peace of mind with it all. I did not have much support for the first year, but then I found Sandie Walters who created a website called \"DCIS without Rads\" (she thankfully had posted it on this site and others). It was exactly the information I was searching for. We have since become good friends and have shared many exchanges and resources. We are considering starting a DCIS-specific nonprofit organization. Several DCIS friends we have met who feel similar in our approach and perspective are encouraging us. And we couldn't agree more, we must find better, saner ways of treating and preventing DCIS & breast cancer. ",
      "MessageIndex": 9,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    },
    {
      "AuthorID": "dp4peace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
      "Content": "Mar 23, 2012 06:43PM dp4peace wrote:",
      "MessageIndex": 20,
      "PostDate": "23/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    },
    {
      "AuthorID": "dp4peace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
      "Content": "dp4peace wrote: I recently created a website/blog (www.dcis411.com) to share my 2+ year journey with (low grade) DCIS. Following 2 recent surgeries (lumpectomy + re-excision) and several conflicting opinions regarding treatment due to a VNPI score of 8 and a \"close\" margin, I have chosen NO RADIATION, NO TAMOXIFEN, and NO RE-EXCISION or MASTECTOMY.  I had a clear \"RODEO\" MRI in January and I am taking an \"active surveillance\" holistic approach. I would like to offer my two years of research and insights to anyone who is out there searching (as I was) for the least invasive, most health-promoting way to reduce risk and prevent breast cancer. ~ Donna ~  www.dcis411.com   Donna Pinto Dx DCIS, Right, 3cm, Stage 0, Grade 1, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    },
    {
      "AuthorID": "dp4peace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
      "Content": "Mar 22, 2012 05:49PM dp4peace wrote:",
      "MessageIndex": 10,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    },
    {
      "AuthorID": "dp4peace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
      "Content": "Mar 22, 2012 08:02PM dp4peace wrote: Oh this is getting heated! Thank you for your comments \"thennewme!\" The credible breast cancer experts I am referring to are the quotes on the home page as well as Dr. Lagios, Dr. Silverstein and other conventional Drs. I specifically do not quote the resources you are referring to on the home page. Those resources are definitely more alternative and yes, I believe it is important to gather information from \"alternative\" sources as well. I'm terribly sorry, but when it comes to DCIS there seems to be very little factual, accurate and evidence-based information. The experts can not agree. I went to 4 conventional doctors and they all told me something different. This is the important point of why women with a DCIS diagnosis need to gather all the information and not just blindly follow one Dr following the \"standard of care.\"  Many women & men will benefit from my site and from the info found from the sources you are bashing. It is obviously not for you and I'm sure there are many other women on this site who feel the same (why I did not share my views for a long time). Like I have said, there will be 2-3 women out of 100 who resonate with my site -- and those are the women it is for. By the way, I am reading Suzanne Somers book \"Breakthrough\" and I absolutely resonate with the doctors in her book and most of what she says! I wonder whose profiting from the antiquated cancer industry and the billions of $ for the cure??? No $ in it for me...just karma points! Peace and blessings of good health to you! ~ Donna   ",
      "MessageIndex": 13,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    },
    {
      "AuthorID": "dp4peace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
      "Content": "Mar 22, 2012 08:07PM dp4peace wrote: It's funny kad2kar, I always tell my best friend, if she got my same diagnosis, she would have a mastectomy in a heartbeat. She is a worrier and could not live with the constant uncertainty and thinking the worst. That would be the right path for her. You have got it right. I am simply sharing my story. Those that resonate will find some solace. Thanks for sharing your thoughts and experience. ~ Donna",
      "MessageIndex": 14,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    },
    {
      "AuthorID": "dp4peace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
      "Content": "Mar 24, 2012 07:14AM dp4peace wrote: Received Oncotype DX Test results tonight....LOW RISK for invasive cancer!!! ",
      "MessageIndex": 21,
      "PostDate": "24/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    },
    {
      "AuthorID": "dp4peace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
      "Content": "Mar 17, 2012 02:11AM dp4peace wrote: mawhinney, If you were stage 1b that would mean there was an invasive component and then we are not talking about low grade DCIS. I think we all come to our decisions based on an inuitive knowing that is our driving force. Happiness with decisions is truly great and I am happy that you are happy!!!  I have met/corresponded with many women with low grade DCIS who are looking for support to take an \"active surveillance\" path and I think we are few and far between (about 3% I have read). These are really tough choices and my hope is that women make their choices not out of fear, statistics based on one size fits all and \"standard of care,\" but with ALL the information based on individual case, multiple opinions and peace. Thanks for your comment and I wish you continued happiness and health!  ",
      "MessageIndex": 2,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    },
    {
      "AuthorID": "dp4peace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
      "Content": "Mar 19, 2012 06:16PM dp4peace wrote: Thanks for your comment alexandria58. There really needs to be more studies on women like me who are doing A LOT of natural risk reduction and health promotion, but unfortunately there is no $ in it. I was told similar statistics, but there is a lot that is not taken into account with those statistics.  We all do what we feel is in our best interests and we all have our reasons for our choices. Every woman must make their own decision based on ALL the information. I am fortunate to have learned about health and healing from the inside out and I know there are many many women out there who are searching for support and resources from someone like me (I hear from them every day). There is great controversay on the overtreatment of low grade DCIS and it is only fair that women have all the information and resources before making such important life-changing treatment decisions. There are also many people with invasive cancer taking an \"alternative\" healing path and many stories of successful healing that the cancer industry does not want to be studied, promoted or known. I know my way is not the popular way and I'm sure your concerns are felt by many, especially on this site, but I know that I will resonate with a minority of women....and my experience, insights and resources will be a guiding light. Blessings of peace and health, Donna ",
      "MessageIndex": 4,
      "PostDate": "19/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    },
    {
      "AuthorID": "dp4peace",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110553/profile",
      "Content": "Mar 23, 2012 03:16AM - edited Mar 23, 2012 03:20AM by dp4peace I have already stated that I know my site will resonate with only 2-3%. I mainly follow the advice of an excellent naturopathic doctor and an orthomolecular nutritionist. I simply resonate more with their ways of risk reduction and prevention for my situation. Both have experience treating and helping cancer patients -- whether or not their patients do conventional treatments as well, their advice is scientifically based. I have learned so much about true health & healing. The articles on my site are mostly part of the on-going debate/controversy around low grade DCIS & mammograms and they come from all different sources -- both conventional doctors & alternative/integrative. It's very easy to call people quacks, but if you understand what they are saying, it truly makes sense from a health-promoting perspective (even Suzanne Somers and her doctors). I actually didn't read any books my first year after diagnosis except one: \"Patient Heal Thyself\" by Jordan S. Rubin. I only started reading books on balancing hormones and others like AntiCancer listed on my site because Sandie Walters recommended them on her site. I am just now reading Breakthrough by Suzanne Somers and I think it is excellent. I also think the message boards at BC.org are great. I just felt very overwhelmed reading all the stories and didn't find much support for the path I was choosing at the time. I was reluctant to share my choices because I didn't want to hear more statistics, \"concern\" and fear from others as I am hearing now. I am very confident in my decisions now and can take it much better than I could have initially. I am already being knocked down on this thread and have been told not to promote my site by the moderators (so much for support). I just want to share my journey and research I discovered that I found helpful. Others may or may not find it helpful. It is just there for those that want it. I'm sure anyone diagnosed with DCIS is not going to base their treatment decision solely on my website -- and yes, Beesie, I would send them here, and specifically to you for information should they have high grade DCIS. Anyone doing any research will find breastcancer.org just by doing a google search and asking a question. By sharing my website, I am not intending to take anyone away from this site. I'm just offerring to share my on-going journey and insights.    I had to tell my oncologist about the Oncotype DCIS test -- and this was mid February after her nurse told me in January that the test didn't apply to my case (she was only aware of the Oncotype for invasive cancer). The point is there is new information and testing that one Dr. may not be aware of. Yes, I did see that the news of it came out on this message board immediately. And yes, I have also seen Dr. Lagios and Dr. Silverstein mentioned here. This is also where I found Sandie so I am eternally grateful to this site.  Lots of women create blogs to share their experiences with DCIS or breast cancer. Some are strictly alternative; others are just sharing their experiences of conventional treatment. I am no different. I am sharing my experience and bringing the controversy around DCIS and mammograms to light. I don't claim to be anything but a normal person going through a challenging diagnosis just like everyone else here. But, I am traveling a path less traveled and I haven't found many like me. Hoping to find others on the same wavelength. Everyone's entitled to their opinion/perspective. Thanks to all for chiming in! Peace and good health, Donna",
      "MessageIndex": 19,
      "PostDate": "23/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/783343",
      "Title": "DCIS: Support, Options, Sanity dp4peace HopefulFuture"
    }
  ]
}