{
  "AuthorID": "dpms",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184566/profile",
  "Posts": [
    {
      "AuthorID": "dpms",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184566/profile",
      "Content": "Aug 24, 2013 06:31PM dpms wrote: Hi Bayoubabe!  Thank you so much for sharing your experience! I'm glad it ended up giving you some relief. How long after radiation did you have the fat grafting done?",
      "MessageIndex": 2,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809888",
      "Title": "FAT GRAFTING post mastectomy radiation for scar tissue tightness dpms mgdsmc"
    },
    {
      "AuthorID": "dpms",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184566/profile",
      "Content": "Aug 24, 2013 08:01PM - edited Aug 24, 2013 08:26PM by dpms Thank you!  Do you guys have any doctors/surgeons you would recommend for fat grafting? Also @bayou - thanks for sharing the time info. We have been a bit confused, because so far the one surgeon we met at ucsf said my mom could even have the procedure done now - though its only been one month since radiation was completed (she had 28 sessions)",
      "MessageIndex": 5,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809888",
      "Title": "FAT GRAFTING post mastectomy radiation for scar tissue tightness dpms mgdsmc"
    },
    {
      "AuthorID": "dpms",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184566/profile",
      "Content": "dpms wrote: My mom had a modified radical mastectomy on her right breast on December 10, 2012. She had stage 3A breast cancer.  She has now completed her Chemotherapy which consisted of the ACT regiment, and just last month finished her radiation.  Since even before her radiation she had started to experience EXTREME tightness on her chestwall which of course only got much much worse during radiation. She said it feels like she is wearing an iron bra that is 3 sizes too small and just pulling at her chest. She also feels her ribs poking into her underarm (it seems the skin and tissue have thinned out significantly and the arm/shoulder is being pulled down by the scars onto her ribs) One plastic surgeon at UCSF recently recommended FAT GRAFTING, as a noninvasive procedure that can be done before a full reconstruction. We are told this can break scar tissue with needles and inject fat from the abdomen into the chest wall to create a buffer so it feels like the skin/tissue is not stuck to the wall. The procedure is suppose to last one hour, no incisions or cuts - just the use of needles, in and out of the hospital on the same day, one week full recovery.  Since a tissue transfer reconstruction cannot happen from 6months - 1 year post radiation, this is the first procedure we have heard that may provide some kind of relief - WE HOPE.  Has anyone heard of FAT GRAFTING? Has anyone had it done? If so, what was your experience and the subsequent results of the procedure? Were there any side effects?  Just trying to get all the information that we can! Hope you can help!  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809888",
      "Title": "FAT GRAFTING post mastectomy radiation for scar tissue tightness dpms mgdsmc"
    },
    {
      "AuthorID": "dpms",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184566/profile",
      "Content": "Aug 24, 2013 08:55PM dpms wrote: @Sundermom - I am so sorry to hear about your capsular contracture, and that the incision opened up at disney world! I cant even imagine! But I am so happy to hear that fat grafting help your condition! Did they have to make incisions for you during the procedure or just used needles? We have currently been told it would be needles, and the fat would come from my mom's abodmen, as she has some excess there.  @Bayou - Thank you for telling me about whippetmom! Just sent her a private message. This sharing of info has been so helpful, and is making life much easier.",
      "MessageIndex": 8,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809888",
      "Title": "FAT GRAFTING post mastectomy radiation for scar tissue tightness dpms mgdsmc"
    },
    {
      "AuthorID": "dpms",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184566/profile",
      "Content": "dpms wrote: My mother finished going through her complete breast cancer treatment as of July 18, 2013. This included a Mastectomy with 10 lymphnodes removed, chemo (ACT), and 6 weeks of radiation. Around the middle of her radiation she started to feel extreme tightness on her chestwall and as the radiation completed, and following it, and additional symptom of feeling her rib bones rubbing against her under arm, or a sensation of them poking started. Both of these symptoms have gotten worse. After seeing many doctors, surgeons, and pain management clinics, we have concluded that the tightness is and the \"bone poking\" is from scar tissue, and fibrotic tissues that have formed post her mastectomy and post radiation effects. She also says it feels like her armhole is shorter and tighter - feels like the bones are clasping around her armhole, and that everything is just pressed up against her chestwall and stuck. Doctors say the pull force is the scaring and fibrotic tissues which have contracted her pec and other surrounding muscles, causing her shoulder to be pulled down, and hence the feeling of her ribs poking and rubbing against her underarm These issues have just gotten exponentially worse over the last 9 months. She has also been in Physical Therapy throughout this whole duration. (she already had full range of motion - that was never a problem). They have tried breaking the scar tissue through massage, and strengthening excercises, but this has also not helped.  We have met with two great plastic surgeons just recently. One at Stanford and one at Mayo Clinic. The stanford one has suggested reconstructive surgery, and that it should help her problem issues. The mayo one has suggested Fat Grafting. We are told this procedure has been used for breast cancer patients in only the last 5 years.  **My question today is if anyone has gotten Fat grafting done to resolve issues similar to my mothers.  Does it in fact help with tightness and pulling in the chest wall?  Does it create a padding on the chestwall?  Do you feel like it has revascularized the area? giving is blood circulation?  Can you feel a difference? An improvement? How long after the procedure did you start to see the affect of fat grafting? Did it break up scar tissues?  If you got it done, who was your surgeon and from which hospital?  What was your recovery from it like, and how many sessions did it require? We are not looking to get a complete reconstruction done through fat grafting. Just for it to help with her problem issues.  Thank you so much for your responses and any help you can offer. We are really struggling trying to figure out what to do, as doctors are giving different approaches and opinions that are so different. We hope other patients like ourselves will be able to shed some light on this.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/820424",
      "Title": "Fat Grafting for radiation fibrosis and scarring! dpms dpms"
    },
    {
      "AuthorID": "dpms",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184566/profile",
      "Content": "dpms wrote: My mom had a modified radical mastectomy on her right breast on December 10, 2012. She had stage 3A breast cancer.  She has now completed her Chemotherapy which consisted of the ACT regiment, and just last month finished her radiation.  Since even before her radiation she had started to experience EXTREME tightness on her chestwall which of course only got much much worse during radiation. She said it feels like she is wearing an iron bra that is 3 sizes too small and just pulling at her chest. She also feels her ribs poking into her underarm (it seems the skin and tissue have thinned out significantly and the arm/shoulder is being pulled down by the scars onto her ribs) One plastic surgeon at UCSF recently recommended FAT GRAFTING, as a noninvasive procedure that can be done before a full reconstruction. We are told this can break scar tissue with needles and inject fat from the abdomen into the chest wall to create a buffer so it feels like the skin/tissue is not stuck to the wall. The procedure is suppose to last one hour, no incisions or cuts - just the use of needles, in and out of the hospital on the same day, one week full recovery.  Since a tissue transfer reconstruction cannot happen from 6months - 1 year post radiation, this is the first procedure we have heard that may provide some kind of relief - WE HOPE.  Has anyone heard of FAT GRAFTING? Has anyone had it done? If so, what was your experience and the subsequent results of the procedure? Were there any side effects?  Just trying to get all the information that we can! Hope you can help!  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809887",
      "Title": "FAT GRAFTING post mastectomy radiation for scar tissue tightness dpms dpms"
    }
  ]
}