{
  "AuthorID": "dragonfrog1…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140973/profile",
  "Posts": [
    {
      "AuthorID": "dragonfrog1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140973/profile",
      "Content": "Dec 13, 2011 08:57PM dragonfrog1951 wrote: Thank you. It sounds like a lot but, one day at a time, one thing at a time is what I say. How are you feeling now? Any leftover side effects?",
      "MessageIndex": 15,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779373",
      "Title": "Diagnosed & headed for surgery dragonfrog1951 Gingerbrew"
    },
    {
      "AuthorID": "dragonfrog1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140973/profile",
      "Content": "Dec 14, 2011 09:48AM dragonfrog1951 wrote: Hi Yorkie Mom, Thank you so much for your response. Do they always put in a wire to guide the surgeon? My tumor is on the top of the breast at 12:00 oclock and it can be felt easily although I did not know it was a lump. I noticed a change in the shape of that breast in August but have been dieting and attributed the change to weight loss and age. I am glad your arm is feeling better that is a concern of mine because I take care of a lovely 94 year old lady and I am worried about her being without help while I am healing. I have begged her to take on someone else but she is being stubborn. I love your Yorkie! What school did yoiur husband go to? I was a Sacred Heart girl but finished high school at Tolman on exchange street.",
      "MessageIndex": 19,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779373",
      "Title": "Diagnosed & headed for surgery dragonfrog1951 Gingerbrew"
    },
    {
      "AuthorID": "dragonfrog1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140973/profile",
      "Content": "Dec 11, 2011 11:59PM dragonfrog1951 wrote: Thank you so much for your information and kind words! You have given me what I need, a first hand account from someone who knows. I will have 6 weeks of radiation but no chemo is planned unless the cancer has spread. The tumor is hormone receptive so I will take a hormone blocking med for 5 years. That is the plan so far. Does the injection in the breast before surgery involve much pain? I am just wondering what to expect. I handle pain well as a rule. Thanks, Mary",
      "MessageIndex": 3,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779373",
      "Title": "Diagnosed & headed for surgery dragonfrog1951 Gingerbrew"
    },
    {
      "AuthorID": "dragonfrog1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140973/profile",
      "Content": "Dec 13, 2011 03:46PM dragonfrog1951 wrote: Thank you for sharing your experience with me. I really appreciate the input. My surgeon did mention that the underarm area can be more uncomfortable than the breast incision. I hope your discomfort passes quickly. I don't know about that SNB injection. I had a core needle biopsy and the surgeon used lidocaine but I still felt it when she went in and got the tissue from the tumor. I guess I'll find out on Monday. I let you know. Take good care of yourself! Mary:)",
      "MessageIndex": 13,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779373",
      "Title": "Diagnosed & headed for surgery dragonfrog1951 Gingerbrew"
    },
    {
      "AuthorID": "dragonfrog1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140973/profile",
      "Content": "Dec 17, 2011 03:02PM dragonfrog1951 wrote: I would love company while I wait! I am having a lumpectomy with snb on Monday, December 19. I have read all the information and I guess I am ready but getting nervous now. My heart and prayers are with all of us here for a speedy recovery and good news!",
      "MessageIndex": 471,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "dragonfrog1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140973/profile",
      "Content": "Dec 13, 2011 08:27AM dragonfrog1951 wrote: Thank you to everyone for sharing your experiences with me. I feel better knowing what to expect. Knowledge is power. I feel better prepared to deal with the injection now and the possibility of a drain. I am going to get myself some kind of little pillow too. We have 2 cats and they do like to climb on me in bed. I feel pretty confident about the care I am and will receive. I am having surgery at Women & Infant's Breast Care Center in Providence RI. They have a tumor board of different specialists and they discuss your case and together design a plan of treatment to suit your individual case. My surgeon is a lovely young women and is down to earth besides she brings her little dog to work with her on Saturday and anyone who loves animals is good in my book!",
      "MessageIndex": 8,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779373",
      "Title": "Diagnosed & headed for surgery dragonfrog1951 Gingerbrew"
    },
    {
      "AuthorID": "dragonfrog1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140973/profile",
      "Content": "Dec 13, 2011 03:41PM dragonfrog1951 wrote: Thank you! I will let you know. Good luck to you also and keep us up to date! Mary:)",
      "MessageIndex": 12,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/779373",
      "Title": "Diagnosed & headed for surgery dragonfrog1951 Gingerbrew"
    },
    {
      "AuthorID": "dragonfrog1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140973/profile",
      "Content": "Dec 17, 2011 05:28PM dragonfrog1951 wrote: Thank you, Kaara, you sound like it was not too bad. Any pain afterward?  I hope you continue to feel great! Thanks again for the positive info!  Have a happy holiday season and let's all hope for a happy healthier New Year. Mary",
      "MessageIndex": 475,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "dragonfrog1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140973/profile",
      "Content": "Dec 17, 2011 07:51PM dragonfrog1951 wrote: Terry it is okay to feel the way you do. You are grieving, but you will work through this. My niece is a minister and I always keep her philosophy in my mind: \" You are perfect just the way you are and you are right where you are supposed to be and doing what you are supposed to be doing. You fit into God's plan like piece in a puzzle and by being there you are touching the other pieces in a unique way.\" We all of us need each other! You are beautiful! Don't you for get that! Hang in there. \" This too shall pass.\" Mary",
      "MessageIndex": 477,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "dragonfrog1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140973/profile",
      "Content": "Jan 31, 2012 11:58AM dragonfrog1951 wrote:  I had my visit with the Radiation Oncologist yesterday, January 30. Ready to start on February 8. The Rad Oncologist told me this will not be a treatment just a dry run then real treatments start on February 9. My first appointment lasted 1 hour and 45 minutes. First had a chat with the Rn about my meds and other medical conditions. she took my weight and blood pressure, then had me change into a gown. The doctor came in and we talked and she examined me and made marks on my skin where the tatoos would be. Then I went into the room where the catscan is done and the tech positioned me on the table. The catscan result was not quite right so we had to do it again with a wedge behind my back to lift me up some. That was perfect. The tatoos were done and that was it. The worst part was laying on the hard table in one position for 20 minutes and it was so cold in there! Not that bad!",
      "MessageIndex": 405,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/779930",
      "Title": "January 2012 rads Kate60 edoyrest"
    }
  ]
}