{
  "AuthorID": "dragonsnake",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
  "Posts": [
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Jul 22, 2016 12:56AM dragonsnake wrote: I hear you, Kali44. We are asked to make decisions that we are not qualified to make, and we are not given all info that we need to in order to do it. If I would have had a localized tumor, I would probably look into proton radiation if it was offered to me. Radiation is for local control only, thus it does not make sense to me to irradiate more than the tumor bed and some tissues around it. I wrote my post on rads upon someone's request to look at rads from my professional standpoint. The gist is that  with photon radiation you cannot avoid scattering and thus the exposure of body parts other than the breast itself and auxillary lymph nodes. The radiation dose received  by the  heart, lungs, parts of the digestive tract, thyroid,  and neck may be quite significant. This can  lead to side effects other than radiation burns and fatigue.",
      "MessageIndex": 9,
      "PostDate": "22/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/846111",
      "Title": "Proton vs Photon Radiation Kali44 Kali44"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Jul 20, 2016 12:49AM - edited Jul 20, 2016 12:53AM by dragonsnake I'm sorry, resolution is not high enough for me to read from the photo. If you have a localized tumor in the breast, they usually surgically remove it, then irradiate the whole breast with x-rays. Are you in a trial when they shrink the tumor, and then irradiate the site? Did they surgically remove the tumor before offering photon vs. proton beam irradiation? Are you close to Berkeley, Livermore, Jet labs on East coast, Chicago, or  Michigan, where there are nuclear research facilities with big accelerators?  If you think it's appropriate, please share more info on your case, because the choice that you face is not trivial.",
      "MessageIndex": 3,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/846111",
      "Title": "Proton vs Photon Radiation Kali44 Kali44"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Jul 20, 2016 12:59AM dragonsnake wrote: Targeted proton beam  irradiation may cause less damage to the healthy tissues away from the irradiation site, but more localized damage. Photon irradiation damages approximately one quarter of the torso uniformly. I have a detailed analysis of the photon beam irradiation in the thread titled \"my take on rads\": https://community.breastcancer.org/forum/70/topics/845654?page=1#idx_6",
      "MessageIndex": 5,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/846111",
      "Title": "Proton vs Photon Radiation Kali44 Kali44"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Jul 26, 2016 04:00AM - edited Jul 28, 2016 09:36AM by dragonsnake We may want to advocate for you health, but doctors follow protocols: it's either a package or nothing. You cannot voluntarily lower your dose or alter a protocol in any other sense. There are some different protocols for photon irradiation, and you may want to discuss them with your RO, but my feeling is that they do what they  know, and that's it. Regarding protons vs. photons, you need special equipment for  the proton therapy. I think, you have to have a proton source, and an accelerator to achieve a certain energy  for the proton beam.  I think that some select facilities   may have small accelerators, but some have to be in the vicinity of big nuclear labs that have particle accelerators. A choice between proton and photon therapy is not given to patients routinely. It was offered as a part  of a clinical trial to Kali44. There may be some other ladies that have this option, though. It would be great to hear from them.",
      "MessageIndex": 16,
      "PostDate": "26/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/846111",
      "Title": "Proton vs Photon Radiation Kali44 Kali44"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Jul 20, 2016 12:12AM dragonsnake wrote: Are you sure that they may use a proton beam to treat your condition? Usage of proton radiation is rare, it requires special equipment (as far as I know, access to accelerators). Proton beam can be easily focused, so it is used for treatment of localized cancers. Protons also are effectively absorbed by tissues, and thus energy is deposited locally, but the tissue damage is much greater than that one caused by high-energy photons. Please verify with your radiologist if that's the options offered to you, because usually they radiate a big area of the breast, and they usually use high-energy x-rays (photons) for that. There may be some clinical trials  in which they use a proton beam to target a tumor itself.  ",
      "MessageIndex": 1,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/846111",
      "Title": "Proton vs Photon Radiation Kali44 Kali44"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Aug 25, 2016 11:24PM dragonsnake wrote: Seraphima, I had the shakiness like that after  antibiotics. If you had a lingering digestive issues, like I had, antibiotics could have exacerbated them. Shaking was really bad in my case, and it lasted for a long period after I stopped antibiotics.  Xanax did not help, antidepressants made them worse, klonepin (strong sedative)  put me into depression.  Long story;  no medical professional believed me, but I cured it with diet. PM me if you suspect this may be applicable to your case.",
      "MessageIndex": 4,
      "PostDate": "25/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847364",
      "Title": "Shakiness after surgery? Seraphima Seraphima"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Aug 25, 2016 03:54AM dragonsnake wrote: Barbe1958,  calculating the given and received dose in radiation physics is very confusing. There are number of units to characterize different aspects of the radiation sources and the beams, but even more confusing is how to determine the absorbed dose. Methods depend on the nature of the particles used for radiation, and the reaction of the tissues to this particular type of radiation. I would love to talk to radiation physicists who develop software for calculation of the received doses for radiation oncologists, but I do not know such people, and for me it would be irresponsible to post more detailed information  than I already posted  in \"my take on rads\" thread. I pulled the numbers from some publications, NIST, and Wikipedia to do these crude calculations. https://en.wikipedia.org/wiki/Radiation_therapy",
      "MessageIndex": 3706,
      "PostDate": "25/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Aug 24, 2016 05:36AM dragonsnake wrote: Barbe1958, I  just noticed your post on radiation treatment today, otherwise I would have responded earlier. The standard dose is  about 50 Grays in 2 Gray fractions delivered to an upper quadrant of the body. You may have had a slightly higher dose but certainly not 9 500 Gray. For comparison, a dose of 2 to 10 Gray over the whole body delivered in a couple of hours is lethal. For those interested in radiation doses used in breast cancer treatment, here is the link: https://community.breastcancer.org/forum/70/topics/845654?page=1#idx_6   ",
      "MessageIndex": 3704,
      "PostDate": "24/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Jul 13, 2016 11:57PM dragonsnake wrote: 49, almost 50",
      "MessageIndex": 633,
      "PostDate": "13/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Jun 8, 2016 01:35AM dragonsnake wrote: xxyzed, thank you for responding to my cry and  sharing your experience.  I wish you an easy and uneventful recovery. Please take good care of yourself.  I decided to do an MRI and try to figure out how much junk is in my other breast, and postpone a surgery for now.  ",
      "MessageIndex": 2,
      "PostDate": "08/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/844940",
      "Title": "Bilateral mastectomy short / long term side effects and QOL dragonsnake dragonsnake"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Jul 26, 2016 03:40PM dragonsnake wrote:  Here is the update on my condition. After many consultations and many  considerations taken into account, after two lumpectomies that failed to achieve clean margins, and an MRI that showed more suspicious spots in the DCIS breast and high- background signal in the contralateral breast,  I proceeded with  a double mastectomy, no reconstruction. I had a SNB on the cancerous side only; two lymph nodes were removed during the surgery.  I requested to be given a toradol/ketorolac pre-incision.  I was given ketorolac as a pain-killer after the surgery  (every 6 hours for the first 24 hours) . I did not take opioids, only extra strength Tylenol afterwards. I had my drains removed on the 7th day. I have a reasonable range of motion, within 90 deg, but cannot dress myself independently. My left hand hurts and feels weak, my shoulder is sore,  but no apparent swelling. My chest swells by the end of the day, though. I do a modified bikram yoga for the muscles in my back and legs, without moving my arms beyond 90 deg.  I also went for a walk several times. .  I still do not have my pathology report because they are waiting for my previous pathology slides to be returned from UCSF where I had my second opinion. I really wouldn't be able to go through all this the guidance and support of wonderful ladies on this board . THANK YOU for being there for me, for your wisdom and kindness, for your hard work educating other members, and your relentless following of all relevant research. ",
      "MessageIndex": 9,
      "PostDate": "26/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/844940",
      "Title": "Bilateral mastectomy short / long term side effects and QOL dragonsnake dragonsnake"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Jun 23, 2016 05:05PM dragonsnake wrote: Thank you very much for your thoughtful and kind responses. I'm still in limbo. MRI did not see my DCIS around the lumpectomy cavity even though we know it's there because I have no clean margins. There are two additional very small nodules that may or may not be cancerous 1 cm from the cavity - they do not show characteristic signatures for cancer, but malignancy cannot be ruled out. The other breast shows some cysts. I talked to the radiologist, and she said that nothing can be ruled out due to the fact that my DCIS does not show up on mammo or MRI. MO suggested UMX because they already removed almost 1/2 of the breast, but was against BMX because of no medical necessity. The radiologist who did the MRI understands my desire for BMX. Sassa, I'm very grateful for you sincere and honest message, I understand how difficult for you is to loose some of the cognitive abilities. I had an episode three years ago when I temporarily lost my abilities to solve complex problems: I was able to  solve low-division math and physics problems, but could not do problems for my upper-division classes. I need to be able to solve differential equations, take integrals, understand advanced  topics, do original research, etc. A loss of these abilities means a loss of employment for me. As I see it now, I may choose life and sacrifice who I am, or risk metastatic cancer. Although they are not mutually exclusive.",
      "MessageIndex": 8,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/844940",
      "Title": "Bilateral mastectomy short / long term side effects and QOL dragonsnake dragonsnake"
    },
    {
      "AuthorID": "dragonsnake",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "dragonsnake wrote: I need help to decide on treatment. I was originally diagnosed with 3 cm DCIS, high  grade, comedo necrosis. I did a left breast lumpectomy, The original extracted piece had two involved margins and 4cm DCIS. Surgeon cut around the piece , the originally bad margins were cut out, but the margin on the good side showed more DCIS. I did a second lumpectomy, the newer  4.5 cm DCIS was found and excised. I'm waiting for details about margins;  report is confusing. I was thinking on doing a left mastectomy or  a bilateral one after learning that my DCIS is multifocal, and was not picked up as such on the mammo. My surgeon did not want to do MRI because it's not very conclusive, according to him. I always had pain and burning in both of my breasts.  I do not want radiation due to my previous expose and long-term side effects. I cannot do hormonal treatment due to a big uterine fibroid + many small ones,  although I might consider a total hysterectomy. My question is: what are the long-term side-effects of a simple BMX without any reconstruction in terms of pain , neurological symptoms, numbness, inability to use hands, lymphedema, etc. ? How to prevent PMPS AND LYMPHEDEMA?I really do not care about the looks, but I'm very concerned about my quality of life: I do not want to be in pain, with  lymphedema, mentally and physically non-functional. I have a very demanding job, I cannot afford not being able to concentrate. I need to be able to do advanced math and physics at high level. As I see it now, I can keep cutting pieces of my breasts as they become cancerous, or cut out everything at ones in a hope that that's will be it. Any advise on this matter will be very helpful. Thank you Diagnosed @49 over a routine 3D mammogram;15/4/2016 DCIS 3cm med to high grade, comedo necrosis; ER+/PR+ , two lumpectomies failed to achieve clean margins, about 9 cm DCIS removed; 7/13/2016 BMX, SNB left 0/2 Dx 5/23/2016, DCIS, Left, 6cm+, Stage 0, Grade 3, ER+/PR+ Surgery 5/23/2016 Lumpectomy Surgery 6/2/2016 Lumpectomy Surgery 7/13/2016 Lymph node removal: Sentinel; Mastectomy: Left, Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/844940",
      "Title": "Bilateral mastectomy short / long term side effects and QOL dragonsnake dragonsnake"
    },
    {
      "AuthorID": "dragonsnake…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233294/profile",
      "Content": "Aug 27, 2016 12:22AM - edited Aug 28, 2016 07:46PM by dragonsnake Dear Anush, I'm so glad that you started treatment. It's just amazing that someone kind and generous stepped in to help you. As a fellow survivor of the Soviet Union collapse myself, I can relate to your anger and frustration over the struggling economy and the ways our countries are run after gaining independence (not that it was good before that). I know that the burning question for you is the disease-free survival statistics in the absence of chemo treatment or with an incomplete treatment. I really do not know if such statistics exists because most women here receive chemo. The place to look for it might be Russia, but I doubt that there are registries there that keep tracking of bc patients. In any case, something may have been published in Russian medical journals, but I think that you already thought of that. Sending you healing thoughts.",
      "MessageIndex": 26,
      "PostDate": "27/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/846532",
      "Title": "Her2 Positive - life without chemo Anush dragonsnake"
    }
  ]
}