{
  "AuthorID": "Drained6513",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
  "Posts": [
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Apr 26, 2017 05:42PM Drained6513 wrote: Hi, I'm new to this site.  I finished my last weekly Taxol March 22/17.  I'm 5 weeks past the last one today actually.  I'm using Nioxin shampoo and conditioner with scalp treatment.  I used this throughout my Taxol and am still using it.  I think my hair is growing...lol but of course not as fast as I'd like.  Just wondering, does anyone go to the gym for a workout while waiting to for their hair to grow in slowly?  If so, I bought a hat wig, I'm going to wear under a baseball cap to the gym.  Would this hinder hair growth by having to cover up the scalp, and sweating etc to an already delicate situation?  Meaning to the hair follicles?  Sounds like a dumb question, but is any question dumb under these circumstances? lol  Thank you.",
      "MessageIndex": 25272,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jun 4, 2017 04:43PM - edited Jun 4, 2017 04:56PM by Drained6513 Ok...so I am 10 1/2 weeks post last weekly taxol. I am on Herceptin for a year. I've posted on here before... I am just kinda panic stricken about my hair. Its still not very thick..and the front sides and front top you can see my scalp... it looks so wierd. I have some hair on the crown which is thicker...then it gets sparser getting nearer the top front. I could cry. I am really tired of all of this. Seq..I've been following these posts and I understand your distress and your hairs alot fuller than mine. I know you have 9 more weeks on me. I am so afraid mine is not going to be thick and full... this is worse than all the surgeries I had. I take vitamins...try and drink my vegetable juicing daily...and try to eat right. Did the Nioxin..and Rogaine. Tired of the hats and wigs. Went for my Herceptin treatment last week with nothing on my head. And even had looks from some nurses and the other ppl there. This is soo horrible. Any encouragement or words of wisdom or advice on this? Also, not to mention the huge chipmunk cheeks you get, I'm guessing is from the steroids they give you with the Taxol treatments. Friggin nightmare.",
      "MessageIndex": 25407,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jul 3, 2017 01:14AM Drained6513 wrote: Thanks for the inspiring words.  I'm just tired of the whole thing.  It's been a horrible terrifying journey.  Surgeries, blood work, appts, then the chemo which is the worst part of it all, if you ask me.  Why can't they have something to combat the worst symptom of all, hairloss.  The most debilitating symptom of the whole process.  It really does take from you who you are.  I did just take to my bed, just got up and keep forgetting when I look in the mirror, it shocks me every time.  I was in great shape before all this happened.  Working out and fit and my hair styled and coloured and never ever a thought you would ever be without it.  I was just going to transfer employment when all this happened, and had to turn down that job opportunity.  Became unemployed and sick.  Now a year later, most of the difficult stuff is done, except for the hair growth now.  A  year of dealing with all this.  I don't have all the time in the world, like when you are in your 20's or even 30's.  HapB, I have had the hair salon in the back of my mind for quite a while.  I just want it to be long enough for them to do anything with it and also I have to sit in the salon for everyone to see.  I'd say I have low self esteem right now. Docmama, your hair looks great.  Nice and thick.  That short style really suites you!",
      "MessageIndex": 25502,
      "PostDate": "03/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Sep 10, 2017 01:50AM Drained6513 wrote: Hello, haven't been on here lately.  Your hair looks really nice Seq... saw that photo.  I am 5 1/2 months post chemo.  My hair is a really short Pixie.  Of course, Pixie cuts are normally short. .lol  I go out freely now.  No more hiding at home til my hair grows properly.  It is so nice to get back to just living life.  I went for my first Salon colouring about 3 weeks ago.  It was supposedly almost a platinum blonde.  That is what it looked like when I left the salon.  Now, 3 weeks later it has turned a silver grey.  Never has it done that before.  Will the next colouring coming up help to keep it blonde?  Anyone have this problem.  My hairstylist, who is wonderful, said it was hard to get it to the colour she really wanted, and next time it should take better.   Congrats to all the brave women on here too.... hair does come back.  I stopped using the Nioxin and Rogaine just before the salon visit, as well.  I use Aveda colour conserve products and my hair is soft and nice, except for the grey. ",
      "MessageIndex": 25680,
      "PostDate": "10/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Apr 29, 2017 05:54PM Drained6513 wrote: Ok... so my oncologist told me I wouldn't lost my lashes or eyebrows with this Taxol chemo.  My hair took a beating and I kept my eyebrows throughout the Taxol chemo, but it's been 5 weeks post Taxol and I have hardly any eyebrows left now.  I'm expecting those may probably go too.  Good lord, wearing a wig is hard enough.  I have lashes still, they are shorter than before and I sure hope they don't go too.  I am going to be mad at the Oncologist when I go back in August.  I started an I.V. Vitamin drip hoping this will heal my body and hair follicles.  I don't know... this is really discouraging.  You try to be positive but it's hard at times.  Crying isn't going to change this.  I do get panic stricken at times.  I don't leave the house much, cause I feel like ppl can tell I'm wearing a wig.  I've become a recluse. ",
      "MessageIndex": 25276,
      "PostDate": "29/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jul 3, 2017 06:30PM Drained6513 wrote: I too just stopped using my Rogaine.  I had started using it not long after I finished chemo 14 1/2 weeks ago.  I used that and I used the Nioxin 1 system throughout my chemo and am still using it.  I can't say for sure, but I think the Rogaine probably did help.  I do think the Nioxin did help as well.  The Nioxin keeps a certain hormone or something like that, which can apparently slow hair growth down or stop it, on your scalp.  I mean I can't say for sure any of it helped, but I think so.  The Rogaine keeps the hair frizzy, so I decided to stop and just keep with the Nioxin daily.  My hair is softer and looks more normal without the Rogaine.  Even though I've been crying about my hair, I do believe it wouldn't even be where it is now, if I hadn't used it.  So that being said, I was just wondering anyone that did not use Rogaine, how your hair grew in?  Did it grow in thick?  Did it take a long time to grow in?  Should I continue on with Rogaine?  And thank you Mystyeyes, HapB and Heidibird, I needed that pep talk.  No one wants to ever go through this, that's for sure.  I have been strong and positive throughout most of this ordeal.  But lately I've just been down.  I am going to get the nerve to go see my hairdresser.  My daughter says not to do anything to my hair, or it won't grow properly.  I mean it's been over 3 months since last chemo, just Herceptin now.  I did colour it myself about 2 weeks ago... what was suppose to be blonde, turned into a reddish colour. lol  So I was thinking getting the salon to colour it properly.  Has anyone gone blonde at 3 months and it's ok for the hair?  I'm sure my hairdresser will know, just wondering.   A little blonde with a cut that looks like a short style would be nice.  ",
      "MessageIndex": 25507,
      "PostDate": "03/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jul 14, 2017 03:36PM - edited Jul 14, 2017 09:00PM by Drained6513 Somewhere I read on here, someone saying that colouring your hair prevents proper hair growth?  Does anyone have any input on this.  I'm finding it hard waiting for the hair to grow.  4 months out and it is really short and still thin on the sides.  It is not growing anywhere as quick as before chemo.  I am so sick of this.  I was thinking of getting my regular hair stylist to properly colour what I do have there.  I just don't want it stunting my growth any more than it already is.  I already have bottle coloured it twice, once at about 4-6 weeks post with dark brown and about 3 weeks ago, with a lighter blonde, that didn't turn blonde at all.  I think I did notice my hair not growing as fast as before the first colouring.  Or I am making too much of that?  Not sure.   And yes, I am taking biotin post chemo.  And I can't say whether or not it is helping. I'm sure it isn't hurting it though. ",
      "MessageIndex": 25539,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Nov 26, 2017 03:29AM - edited Nov 26, 2017 03:31AM by Drained6513 Well I haven't been on here in a long time. I see posts here of what I've already been through and want to give some encouragement. I am 8 months post chemo. Did 12 weeks of Taxol and 3 week intervals of Herceptin, which I am still on, but my last one is in 2 weeks. It can be done. I have thick short hair. I've had it coloured at least 4 times and trimmed. It looks like a normal short pixie cut. The thing is it isn't growing very fast. I use to get my hair trimmed or cut every 6 weeks before chemo and it would grown out quickly if I wanted to change my hair style. Can anyone on here tell me is this how fast it is going to grow forever? I only get it trimmed on my hair colouring days.... so it has some style... when or will it start to grow at a normal rate. And why does it do that? I'd like to at least get to the length of a Bob.",
      "MessageIndex": 25942,
      "PostDate": "26/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Dec 7, 2017 08:37PM - edited Dec 7, 2017 11:57PM by Drained6513 Ok..so I want to give some encouragement to the ladies in the thick of things still. I am 8 months post last chemo...and just had my last Herceptin yesterday. My hair grows slow...but it is thick and tends to stick up if I don't use heavy duty conditioner. I think it may grow faster now that I'm done Herceptin. My skin is looking better too... steam rooms..drink water and eat well with exercise. Also, a good face cream at night. Started taking biotin after Taxol was finished with multi vits and other vitamins. I just put a photo up on my avatar..post chemo....don't know how to post a photo on here otherwise. Stay strong.",
      "MessageIndex": 26029,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jul 2, 2017 05:24PM - edited Jul 2, 2017 05:27PM by Drained6513 I am 14 1/2 weeks post chemo and it's thicker on the top than on the sides.  It was the other way around before.  Omg... this is so horrible.  I haven't posted any photos on here yet.  Will do coming up.  I am wearing a baseball cap out most of the time... I did go topless a week ago.  Met a friend for coffee.  I thought it looked ok... just really short.  But just took some side shots just now and no wonder I had ppl looking at me.  It's soooo embarrassing.  I've stopped meeting up with friends.  I am losing all my friends, from not going out.  Not to mention the 20 extra lbs I gained, that I'm desperately trying to lose. But then again, who cares if your thin if you have no hair? The sides have a skimming of hair, and not a lot, so you can see my scalp.  And the crown has more hair, the back has the same as the crown, it does seem to cover my head, but no where what it was before chemo.  The front top is thicker than before but if you look closely you can see through to my scalp.  This is soooo horrible.  My whole life is a drudgery... I don't want to go on without proper hair.  I had really fine hair before chemo, but a lot.  It was fine and a good thickness.  I feel like going to bed and not getting up.  Anyways,  Seq your hair looks great.  Nice and shiny and full.   The hair photos look great.  Whose to say mine isn't going to remain thin.  Anyways, venting... it's sooo embarrassing.  I might as well be 90 years old... or an old man... that's what I look like.",
      "MessageIndex": 25500,
      "PostDate": "02/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jul 6, 2017 03:45AM Drained6513 wrote: Well, I have been crying on here lately about my hair being too thin on the sides still and thicker on the top.  I am 15 weeks today post chemo.  I went and had my hair cleaned up, as the hairdresser said, at the back and around the ears.  It was just overgrown wispy hair at the back of the neck, which we all have even before chemo.  The hairdresser guy, who I think owned the place, I don't usually go to this place for my hair, but it was close to home and all I needed was it done at the back.  Took like 2 minutes, if that.  I told the hairdresser, I don't  usually have my hair this short, as I sat down, after taking off my ball cap.  He said why did you cut it so short then, and I said I didn't, this is just the result of chemo.  He was very nice, said it will grow back, and when I left he said no charge, which was really nice.  It now looks neater and looks like I had it styled, cut like this, and not just hair that has just grown back.  When I say styled, I mean like a man's haircut, when they go to the barbers.  I am still putting Rogaine on it at night, and then showering in the morning with Nioxin 1 system.  This way my hair isn't frizzy during the day.  ",
      "MessageIndex": 25524,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Sep 12, 2017 02:11AM Drained6513 wrote: I just left the gym... i looked in the mirror to see what my hair was like. Holy...its whitish grey...thick and fluffy... it doesn't look real. lol It looks like fur you see on the snow hats I use to wear as a kid in the cold weather..I wet it a bit and brushed it... I used a straightener on it today...to give it some height at the back... I am going to have to dye it down to a dirty blonde with a few streaks...til it gets more normal. So I don't look like the white fur girl. Ppl were looking at me when I was leaving. Its so embarrassing. I've read on here that hair goes back to normal textured hair at some point. Does anyone on here know first hand. Everyone is diff. Some don't is what Ive read? How long does it take...if it does?",
      "MessageIndex": 25687,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jan 3, 2018 10:22PM - edited Jan 3, 2018 10:24PM by Drained6513 I had both my ovaries and tubes removed last week. It was a very easy surgery, laporoscopy. So thank you for all your responses again. I did go through a lot of the posts on here and read the ones regarding this particular surgery. It was also very helpful. Because ovarian cancer doesn't usually become symptomatic until it is at a late stage, I just felt it was the safe way to go. I am posting this, because it may help someone else worried about the same thing. Being post menopausal, I have not experienced any difference without them. There was one unique development though. As my gynecologist was in the surgery, they discovered my appendix was enlarged, which is right by the right ovary. So they removed it too. lol I mean I don't know why I am laughing, except you have to have a sense of humour in all of this and also just glad it was caught. My GP said it was chronic appendicitis, and you can have that with little to no symptoms. It can mimic bladder infections etc.. which I get alot of, so it can be hard to diagnose. Apparently, it can come and go for weeks, months, and even years and is suppose to be rare. Just another shocking moment in my life. lol Has anyone ever had a similar experience?",
      "MessageIndex": 5,
      "PostDate": "03/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860696",
      "Title": "Ovarian surgery in 2 weeks Drained6513 Wonderwoman386"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jun 19, 2017 08:18PM - edited Jun 19, 2017 08:19PM by Drained6513 Hello.... great site.  I am also a Stage 1, 0/3 nodes and get comfort from such warm ladies on here.  Just finished my 12 weekly Taxols.  On Herceptin til December now.  Mine was mostly a large DCIS but had some focal invasion, the largest being 7mm.  Nice to meet you all!  Everyone enjoy your summer!",
      "MessageIndex": 15338,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jun 20, 2017 09:32AM Drained6513 wrote: Ok, so I called my Cancer Center today and talked with the nurse in Triage.  I told her about the cyst and that I was nervous to wait 3 months to see how it is progressing, smaller or larger?  She relayed it onto my Oncologist.  They've been great at this center since the day I started there.  The nurse got back to me really quickly, said she understands why I would be worried and said the doctor (Oncologist) looked at my ultrasound results, which are online for all physicians re: the cyst and he stated it looks very much like just a cyst.  He doesn't see anything suspicious and also stated I am very low risk of any recurrence anywhere.  And following-up in 3 months with another ultrasound, as my GP advised was ok. So, I am relieved.  I can relax now. lol  Thank you all for responding.  This site is very helpful and I'm sure I will have other queries on other subjects coming up. ",
      "MessageIndex": 6,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856191",
      "Title": "BC and Ovarian Cancer link? Drained6513 Drained6513"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Apr 26, 2017 09:52PM - edited Apr 26, 2017 09:54PM by Drained6513 Thanks for all of the comments and your own experiences!  We are all troupers, that's for sure.  Much luck to everyone on here.   I am done my Taxol treatments.  5 weeks past the last one.  Sorry to say my hair lasted til the 8th treatment and it really hadn't fallen out.. all of it that is.  It was just a knotted matted mess though.  To comb it out, would have pulled it out.. as I did that around the 6th treatment.  So, I had it shaved down.  It was the only way to get rid of the mess.  I'm now waiting patiently for it to grow in.  It has grown in a bit, but still not as much at the front top and sides. I get anxious and impatient and am constantly looking at it and snapping selfies to see it at every angle. I am doing the Nioxin shampoo and conditioner and scalp treatment which I started just before treatment.  I don't know if that helped all that much.  It may have kept the follicles open more.  My hair is long in some areas, but thin. I've seen some women's hair photos on here and they all look great.  I just wonder how they kept their skin looking so supple and nice?  I used a lot of cream at night on my skin and drank a lot of water but I still look like a person that has major sun damage, when I had such young looking skin before.  I am having an IV vitamin c and other vitamins drip tmrw at my local Naturopath.  And going to be doing this for a bit.  I have to do it one week after my Herceptin treatment, once a week, for two weeks, then stop a week before the Herceptin, and keep repeating. I heard this will help my body heal and help with the hair regrowth and skin etc.  ",
      "MessageIndex": 7,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/852662",
      "Title": "12 Weekly Taxol with Herceptin every 3 weeks Drained6513 JanetMara"
    },
    {
      "AuthorID": "Drained6513",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Drained6513 wrote: Hi, I'm new to this site.  I just finished my 6th Taxol treatement on Wednesday.  Six more to go!  I was told by my Oncologist that I had a 20% chance of cancer coming back and it would not be curable then. Meaning it was low to come back. But, the way he worded it, such as if it did, he has seen it take 30 years off of someone's life.  Of course, that plays big with me.  The Biopsy said DCIS.  After left mastectomy surgery in November 2016 the pathology report came back with focal invasions... largest being 7mm.  So, the surgeon that did my mastectomy said if I do a mastectomy, I won't have to have radiation... and I thought it being DCIS, as the surgeon did too from the biopsy, probably hormone treatment etc.  So now, because of what the Oncologist suggested I'm doing the chemo.  I hope I'm making sense, I'm all chemo'd out! lol  My query is: I'm still struggling to do these chemo treatments, because it is low recurrence and most likely will not recur, so why am I putting myself thru this?   I'm HER+.  It's the long waiting btwn treatments that is hard to live with.  My hair started to shed on the 4th treatment. It's getting worse.  I am not coping well with this now that I can see my hair looks dead and lifeless.  What will I look like when it's all done? My skin looks tanned too, but its not.  I went from a healthy fit woman, I'm 55 years young, to this.  Will I go back to what I once looked like?    DX: Stage1A, Grade 2, Centinode 0/3 negative. With Pagets. Left side Mastectomy Nov. 4/16 with reconstruction. Suffered infection and expander removed Dec. 2016. Weekly Taxol x12 with Herceptin every 3 weeks for 17 weeks. ER- PR-, HER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/852662",
      "Title": "12 Weekly Taxol with Herceptin every 3 weeks Drained6513 JanetMara"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Feb 11, 2017 07:08PM Drained6513 wrote: By the way my lymphnodes were negative.  All clear.  Thank goodness. Thank you.",
      "MessageIndex": 1,
      "PostDate": "11/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/852662",
      "Title": "12 Weekly Taxol with Herceptin every 3 weeks Drained6513 JanetMara"
    },
    {
      "AuthorID": "Drained6513",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Drained6513 wrote: I am 56 years old and have been in menopause since the age of 48 basically. I have 2 cysts on my right ovary, one is fairly large. Left ovary is fine. I've opted for just remove the right ovary. Should I do both? The peace of mind to doing both keeps me hesitating here. The doctor said at my age the ovaries do nothing now. So I won't have like a second set of menopausal symtoms, as I am past most if not all my menopausal stuff. After some reading, I've seen that you can get back to an even lower level of menopause from them being removed, so I opted to keep one of them. Anyone able to give me advice on this? Did any post menopausal women on here have medical issues or any issues from getting rid of them, or should I keep the left one? DX: Stage1A, Grade 2, Centinode 0/3 negative. With Pagets. Left side Mastectomy Nov. 4/16 with reconstruction. Suffered infection and expander removed Dec. 2016. Weekly Taxol x12 with Herceptin every 3 weeks for 17 weeks. ER- PR-, HER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860696",
      "Title": "Ovarian surgery in 2 weeks Drained6513 Wonderwoman386"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "May 5, 2017 09:49PM Drained6513 wrote: Ok... gonna vent.  You try to be gracious about the hair loss.... and patient.  I'm in a bad mood.... throwing things around the house... lol  Don't want to go anywhere... just another stinking thing to have happen to me.  Yes... feeling sorry for myself... damn well pissed off.  I started using the Nioxin shampoo, conditioner and scalp treatment just before chemo (taxol) started and used it throughout chemo.  I am still using it and I've added Rogaine now, been using it for about 4 days, morning and night. Wash with the Nioxin and then when it's dry put the Rogaine on.   I thought it was doing good for six weeks, but some of the photos on here of women's hair at this time looks fuller.  It was low dense Taxol, 12 treatments....how bad can it get? It looks like long sparse strings of hair on the side of my head... I take a string of vitamins, multi, B complex, etc... biotin (which I just added after chemo) Omega.  I'm getting IV Vit C and other vitamins from the Naturopath weekly, which I just started.  What if this doesn't come back full and some what thick?  And how long is the question.  I hate going out in a wig, they don't look real.  This is all consuming, sick of it.  12 weeks of horrible chemo, and now enduring this.  Sorry, just friggin mad.",
      "MessageIndex": 5,
      "PostDate": "05/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854849",
      "Title": "Hair Drained6513 Drained6513"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "May 5, 2017 11:30PM - edited May 5, 2017 11:38PM by Drained6513 Thank you for that response mustlovepoodles.  So within 3 months your hair looked fairly good, good enough for a haircut.  I guess I will grasp onto that.  Just havin a bad night.  When I was  getting a test done before chemo, a nurse at our local hospital comes up to me while I'm literally getting a chest x-ray and tells me her mother, which was the same age as me, had chemo as well for breast cancer about 2 years ago.  And then tells me her mother's hair never grew back properly, but mine looked thicker so probably would do better.  I mean what a thing to say... and I was under the impression I was not going to do chemo anyways, as it was just thought I had DCIS at the time, and found out after surgery that it was a bit more than DCIS.... so it then was upgraded to Stage 1A with Pagets.  By the way I like your username.  My guess is you like poodles, I have 2 and love them too! lol  Also, what is maddening too, is a spec was caught on my mammogram in 2012 and I was sent for a biopsy then to another Radiology Center.  The doctor there, didn't bother to do it, said he looked at the mammogram they sent to him and it was fine and benign and did no other tests. So negligent.  Thus the next year they saw it again obviously, and assumed it was ok, from what the doctor said it being fine.  It was only a calcification and there was never any lump.  So, I had no idea there was a problem.  I too thought I was fine.  I didn't go back for 2  years for the next one, as I just had a few things in life going on and thought it doesn't run in the family, no one has ever had breast cancer in my family ever.  Again, I just thought I was fine. Such is life it seems.",
      "MessageIndex": 7,
      "PostDate": "05/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854849",
      "Title": "Hair Drained6513 Drained6513"
    },
    {
      "AuthorID": "Drained6513",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Drained6513 wrote: Hi... I just got finished my weekly Taxol in March and am still on Herceptin every three weeks.  Today I went to my G.P. for my \"annual physical\" results.  I had a pelvic and bladder ultrasound done along with it.  The pelvic ultrasound showed a large cyst on my right ovary.  I am worried now this could be cancer?  My lymphnodes were clear, so I'm thinking this couldn't possibly be mestastic BC to the Ovary?  My G.P. suggested another ultrasound in 3 months, if it's still there or hasn't gotten smaller, then he will send me to the Gyneologist for further testing to see if it is more than a cyst.  I am not happy with my GP as it is, and waiting 3 months to even just look with another ultrasound after having BC doesn't sound like a good idea to me?  So I was going to switch GPs anyways, this is just going to speed it up.  I want to be referred to a specialist as quick as possible to get this looked at properly because of already having BC.  Being HER2+ I'm wondering if that could be the defining factor here? What would be the odds this could be Ovarian cancer if my breast cancer didn't hit my lymphnodes?  DX: Stage1A, Grade 2, Centinode 0/3 negative. With Pagets. Left side Mastectomy Nov. 4/16 with reconstruction. Suffered infection and expander removed Dec. 2016. Weekly Taxol x12 with Herceptin every 3 weeks for 17 weeks. ER- PR-, HER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856191",
      "Title": "BC and Ovarian Cancer link? Drained6513 Drained6513"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jun 17, 2017 01:18PM Drained6513 wrote: Thank you for your responses.  To Wrenn, I know what you are saying.  I'm still doing the Herceptin, so still in the thick of it.  But, even with 0 nodes affected, it worries me.  Every pain from now on is going to worry me.  Has it come back somewhere else.  Hearing I have a large cyst on my ovary after going through what I have, of course scares me.  I never thought I'd get BC.  I'm still a bit worried.  I read ovarian cysts are more common in younger women.  I'm 56 and post menopausal.  To MelissaDall, I don't even know if I have the BRCA gene?  I am seeing a new GP on Monday.  Hopefully, she is good?  I will fill her in and hopefully, get her to refer me to a gynecologist.  I may also bring this up with the Oncologist?  Cause I don't think waiting 3 months for another ultrasound is a great idea.  Will the Oncologist order some tests to see or will he say talk to your GP first?",
      "MessageIndex": 4,
      "PostDate": "17/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856191",
      "Title": "BC and Ovarian Cancer link? Drained6513 Drained6513"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "May 5, 2017 07:31PM Drained6513 wrote: Thanks for your stories.  Cive, what do you mean it probably won't come back the way it was before.  I've seen some photos on here and in time their hair looks pretty normal.  It really is just thick fuzz that is coming in.  I know a lot of women has said it does come in as fuzz and then goes eventually back to normal looking hair?  Will my hair always look like chemo hair? From the photos I've seen it looks normal after about 4 to 6 months? ",
      "MessageIndex": 4,
      "PostDate": "05/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854849",
      "Title": "Hair Drained6513 Drained6513"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "May 13, 2017 09:20PM - edited May 13, 2017 09:22PM by Drained6513 Cive...why do you think your hair could not be as long as it was before, at some point? Is it not growing enough?  And Mustlovepoodles, it is good to know your hair did come back pretty much the same way. It's the waiting game and the wig wearing that is awful. It is really slow growing...as you know. And any length you get right now does not have thickness involved. I can still see my scalp in certain areas and certain lighting. It's embarrassing and frustrating. Oh well. It's also that everyone's hair comes back differently. Will mine come back ok? My guess is it will... but it does stay in the back of your mind. It is such a slow process..that you just can't help but wonder how it is going to come in. Do you mind me asking what shampoos you used? Im using Nioxin and then rogaine twice a day. I am also juicing it with as many vegies and fruit I can.",
      "MessageIndex": 10,
      "PostDate": "13/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854849",
      "Title": "Hair Drained6513 Drained6513"
    },
    {
      "AuthorID": "Drained6513",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Drained6513 wrote: Ok, I posting another hair topic.  I know there is one on here, but it's really long and I'm not sure anyone is really answering on that one, as it is sooo long.  A lot of good info on there tho. I am six weeks post Taxol chemo.  My hair is coming in full on the back and the back sides, but it is sparse on the top front and the front sides.  It looks so ridiculous... it worries me if it doesn't start improving.  What a nightmare.  Any comments on this.  The worst side effect of this whole ordeal, hands down.  I don't look at all like myself, that's for sure.  It's so embarrassing.  Every day I get up, I just dread looking in the mirror.  You take pride in staying fit and trying to look sort of good.... who ever thinks they won't ever have hair. DX: Stage1A, Grade 2, Centinode 0/3 negative. With Pagets. Left side Mastectomy Nov. 4/16 with reconstruction. Suffered infection and expander removed Dec. 2016. Weekly Taxol x12 with Herceptin every 3 weeks for 17 weeks. ER- PR-, HER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854849",
      "Title": "Hair Drained6513 Drained6513"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jun 8, 2017 02:49PM Drained6513 wrote: Thanks for replying KB870.  My long lashes dropped out well about May 12th etc.  And still I have some, but they are really short.  I've always had really long lashes.  This is not good.  You take for granted how it makes your face look with long lashes verses short ones.  I always used an eyelash curler to curl my long lashes.  I'm using it still, but honestly it really doesn't add anything to them.  Curly and short.  Might as well not be there.... that is what it looks like anyways.  So, if they haven't come back by now, are we saying they probably won't? ",
      "MessageIndex": 1,
      "PostDate": "08/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855085",
      "Title": "Eyebrows and Eyelashes Drained6513 BG46TN"
    },
    {
      "AuthorID": "Drained6513",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Drained6513 wrote: Anyone on here heard of having heart damage from low dose Taxol x12 not long after treatment or years later?  DX: Stage1A, Grade 2, Centinode 0/3 negative. With Pagets. Left side Mastectomy Nov. 4/16 with reconstruction. Suffered infection and expander removed Dec. 2016. Weekly Taxol x12 with Herceptin every 3 weeks for 17 weeks. ER- PR-, HER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854857",
      "Title": "Taxol and Heart Drained6513 Kicks"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Dec 7, 2017 07:44PM Drained6513 wrote: Pre menopausal at 54... so you were really late in getting into menopause? And of course...yours was brought on by this surgery. I would imagine you saw a big difference after the surgery, being in pre menopause and not post. I am just wondering if I will have any major issues since I don't think I have much estrogen etc coming from them any longer. I can't do HRT any longer to combat any issues like I did before. I am worried if this will effect my bones more etc?",
      "MessageIndex": 2,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860696",
      "Title": "Ovarian surgery in 2 weeks Drained6513 Wonderwoman386"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Dec 9, 2017 11:05PM - edited Dec 9, 2017 11:06PM by Drained6513 Thanks for your responses. I started peri menopause in my late 30's and had alot of hot flashes and other symptoms and it was not pleasant. By the time I did hit menopause I got onto BHRT for about 5 years. And of course, getting BC had to get off of them. The BHRT got me thru the worst of menopause. Since I've been off them I feel fine. No menopausal symtoms anymore. So, it makes sense what the dr says, they arent useful for hormone production anymore. I don't trust doctors, and of course, I want to stay healthy and functional for as long as possible. So hopefully, being in Post Menopause there really is no benefit still from them which could keep me safe guarded from ill health? As in keeping one of them",
      "MessageIndex": 4,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860696",
      "Title": "Ovarian surgery in 2 weeks Drained6513 Wonderwoman386"
    },
    {
      "AuthorID": "Drained6513",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Drained6513 wrote: Hi...just wanted to know do you ever get back to feeling like your relaxed calm limber healthy self again after chemo? I am nine weeks post Taxol and I know I'm trying to lose the 20 extra lbs. I gained during the whole thing...plus getting the hair back. But I feel old, tense and stiff. Not my old pre chemo days. Even after three surgeries before the chemo...after I healed I felt my old youthful self. I was told I would be as healthy after the 12 Taxols as I was before it. I have wrinkles where I didn't before. I just don't feel youthful anymore. I'm not sure this was worth it. DX: Stage1A, Grade 2, Centinode 0/3 negative. With Pagets. Left side Mastectomy Nov. 4/16 with reconstruction. Suffered infection and expander removed Dec. 2016. Weekly Taxol x12 with Herceptin every 3 weeks for 17 weeks. ER- PR-, HER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855482",
      "Title": "Health Drained6513 Aloha1978"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jul 4, 2017 12:29PM Drained6513 wrote: Ok, so my GP did get me in to see the gynecologist anyways.  She also concurred with my GP and my Oncologist that she didn't see anything that would say this is anything but a cyst.  She also said not many women post menopausal get them...about 10%.  She said because I've had BC it would not be an unreasonable request to get my ovaries and tubes out.  She said they are not being used for anything anymore, meaning they don't work now.  Hearing that was swaying me to get this done, just to significantly lower any risk of ovarian cancer in the future. It is only day surgery.  But of course, I am gonna do some research on this, and read some articles that your ovaries still offer some benefit after menopause, and getting them removed can bring you to an even lower level of menopause.  Like right to the basement floor, so to speak.  I got through my initial menopause with the help of BHRT.  I cannot do that anymore, so if I had to deal with a secondary menopause, I wouldn't be able to take anything to relieve it. Does anyone have any input on this?  Anyone had theirs out post menopause and if so, any side effects? ",
      "MessageIndex": 7,
      "PostDate": "04/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/856191",
      "Title": "BC and Ovarian Cancer link? Drained6513 Drained6513"
    },
    {
      "AuthorID": "Drained6513",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Drained6513 wrote: Hi... my eyebrows fell out just recently...about 6 weeks after Taxol finished... It looks like there is some already grown back...but they are a charcoal colour. A light charcoal...prob grey. Will they get dark again ..like they were before chemo? And same with my eye lashes... I didn't lose them til about 6 weeks post...as the eyebrows. I have a few lashes on top and it looks like none on the bottom. How does it take for them to grow back? DX: Stage1A, Grade 2, Centinode 0/3 negative. With Pagets. Left side Mastectomy Nov. 4/16 with reconstruction. Suffered infection and expander removed Dec. 2016. Weekly Taxol x12 with Herceptin every 3 weeks for 17 weeks. ER- PR-, HER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855085",
      "Title": "Eyebrows and Eyelashes Drained6513 BG46TN"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Sep 26, 2017 02:17AM - edited Sep 26, 2017 02:18AM by Drained6513 Well I could just add to this list. Negligence of radiologists.... I had a spot in 2010 and they had nothing to compare it with, it was my first mammogram, so when I went back in 2012 it was a bit larger. It was a calcification, which is scar tissue. This time they sent me for a biopsy and the radiologist that was suppose to do it, said I didn't need it... that the other place didn't roll the film properly or something like that. So he just decided not to do the biopsy. I didn't even know it was for biopsy, I was just told I needed to go see them. I too had no idea there was even a problem. There was no lump. My GP didn't even think maybe to send me to a breast clinic to make sure it was ok. I really had no idea. They send letters back and forth these doctors and don't fill the patient in. I was called to go get a mammogram in 2013 as a follow up, but I didn't know it was for follow up, I thought it was just a routine mammogram. Women's lives are on the line with this sort of negligence. I am now looking for another GP as well. I waited 3 years later to get my next mammogram, because I didn't think there was an urgency. It didn't run in my family either, so I thought I was ok. I don't know how some of these doctors sleep at night. It's disgusting.",
      "MessageIndex": 74,
      "PostDate": "26/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/634136",
      "Title": "Cancer missed by mammogram? joanne_elizabeth HoneyBeaw"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jun 20, 2017 01:12AM Drained6513 wrote: 55 years old.  Spent my 56th birthday having chemo, as well. ",
      "MessageIndex": 741,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Drained6513…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/243226/profile",
      "Content": "Jun 20, 2017 01:13AM - edited Jun 20, 2017 01:13AM by Drained6513",
      "MessageIndex": 742,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    }
  ]
}