{
  "AuthorID": "Drim",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
  "Posts": [
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Dec 30, 2010 10:10PM Drim wrote: Add me to the list. I turned 44 during my 4 rounds of TC (5/2010 - 7/2010). Got my period back at the beginning of November. It was a pretty normal period minus the cramps (they weren't that bad before). Got another period 31 days later but this one was very light. Lasted the normal amount of time but only had 1 or 2 days of medium bleeding. Now waiting to see if it will continue every month. There is another thread about this that I will bump for you right now.",
      "MessageIndex": 6,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762701",
      "Title": "Return of menses LtotheK slanderson"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 6, 2010 11:12PM Drim wrote: Hi KGBinDC - very interesting post. When I first found out I was going to be on TCx4 I did find the Taxotere and Cytoxan thread and it kinda scared me. I have to say, although I wouldn't describe it as a day at the beach (and I know you're just kidding about that) I'm actually not having a bad time with it at all (I've only been through 2 cycles so far so hopefully this continues). I read a lot about how to combat the side effects and I drank tons of water days before and after (and really tried to continue that as much as possible throughout). I tried to move around when I felt fatigued, took claritin for neulasta side effects, rinsed with Biotene, stuck my fingers and toes in peas for the neuropathy/nail issues and sucked on ice cubes. Also, I'm using cold caps to save my hair. All of this seems to be working because during the 1st cycle I was fatigued for 2-3 days and got a cold sore. During cycle 2 I was fatigued for 1 day but my tongue felt like it was burned and I had some issues with taste for a few days which was not great for my water drinking. Note that I didn't do a good job sucking on ice cubes during round 2 (not sure if that's just a coincidence or not as I know these treatments have a cumulative effect). I know everyone is different but it is nice to have a thread with some positive news out there for those who will be doing this treatment for the most important reason of all - to save their lives and keep this sucker from ever coming back!",
      "MessageIndex": 4,
      "PostDate": "06/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753507",
      "Title": "TC Chemo really not bad so far KGBinDC KGBinDC"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 19, 2010 09:44AM Drim wrote: Hi JBW! So far I've had 2 treatments of TC. I'm on day 19 of the 2nd one and my hair is doing great. The only place I can tell that looks a little thinner than I remember it is the left sideburn. Otherwise it's all there. There is a wonderful thread on here for Cold Cap Users: Past and Present to Save Hair. If you haven't seen it I highly recommend you read through it for all kinds of tips. Good luck!!!",
      "MessageIndex": 6,
      "PostDate": "19/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753507",
      "Title": "TC Chemo really not bad so far KGBinDC KGBinDC"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 30, 2010 10:22AM Drim wrote: KGBinDC - I'm glad that you are still doing well on TC. You look great in that picture. I am continuing to have a mostly positive experience as well. I had my 3rd Tx on 6/22. One more to go! Char2010 - Congratulations on being done!!!  I wanted to mention a couple of things. In this last treatment I was much more diligent about the ice cubes during T and my tongue did not get 'burnt' this time so it really does work. I also feel like I was not as good with the water drinking which seemed to drag out the fatigue an extra day. It does get harder to keep up with the water because it tastes 'boring' and it makes me feel a little bloated but if you can do something to flavor - like lemon drops - it does help. Continued good luck to all!",
      "MessageIndex": 15,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753507",
      "Title": "TC Chemo really not bad so far KGBinDC KGBinDC"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 12, 2010 10:17PM Drim wrote: Congratulations on almost being done KGBinDC! Sorry for your little hiccup. Hopefully the sinus infection will clear up soon. I go in tomorrow for my last one. I know I'm not going to really sleep tonight as those steriods keep me up. It's better than not being able to get up in the morning from being to tired as I have to get up at 6:30am. So far so good except a little weight gain. My hiccup is that I just got my period. What?!?!? I thought I was supposed to be in chemopause.",
      "MessageIndex": 39,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753507",
      "Title": "TC Chemo really not bad so far KGBinDC KGBinDC"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Dec 30, 2010 10:17PM Drim wrote: Lynn - Chances are you will be fine but absolutely you did the right thing by making an appt. with your doctor. They say only 20% of those that develop BC have a genetic link. Your chances of getting it do increase if you have a close family member. Definitely better safe than sorry. Good luck and hope you get some good news in the new year! So glad to here your mom is doing well too.",
      "MessageIndex": 2,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762717",
      "Title": "Not sure if this is serious or not? Lynn97 Sherryc"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jan 10, 2011 03:05PM Drim wrote: loving_mother - if you are having a lumpectomy and SNB you may not have drains at all. It will depend on what they see when they remove the SN. If its free of cancer you will most likely not need a drain. If they have to take a bunch more nodes you might. I only had one node removed so I can only speak about my experience. I did not find it to be very painful. The one thing I would recommend is to keep the ice on the area as directed even if you feel perfectly fine. I was feeling so good and didn't do the best job with the ice so I was sore for a couple extra days. When I had the re excision I learned my lesson and had very little pain. I did not need anything more than Advil for the pain either time except initially when I woke up from the anesthesia. I didn't have much of an issue with range of motion so I can't advice on exercise. I'm pulling for you!!",
      "MessageIndex": 97,
      "PostDate": "10/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762500",
      "Title": "Just Diagnosed :( loving_mother nwest125"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 3, 2010 01:11PM Drim wrote:",
      "MessageIndex": 21,
      "PostDate": "03/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753507",
      "Title": "TC Chemo really not bad so far KGBinDC KGBinDC"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 29, 2010 11:05AM Drim wrote: My HER2 status was somewhat in question with some conflicting results (which at the end of the day turned out to be positive because I had a heterogeneous tumor with some areas positive and some negative). Until the results were clarified, I was able to qualify for Oncotype Dx testing. Before I got my Oncotype results the Onc. was going to go with TCHx6 which is one of the regimens in a very big clinical trial. After getting my Oncotype score of 19, which is very low intermediate she decided to switch to TCytoxan x 4 with the H added in. I'm also ER+/PR+ so she felt like the real benefit for me would be the herceptin and tamox and not really the chemo. LisainVA - thanks for the information on the Research Study. I had not heard of any studies that cut the Taxotere/Carbo down to 4 treatments. Good to know.",
      "MessageIndex": 6,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723639",
      "Title": "Question on TCH 4 cycles versus 6?? GointoCarolina jackifp"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Dec 28, 2010 11:34PM Drim wrote: loving_mother - i had a lumpectomy and a re-excision as well. I am a small C and it's amazing how much they can take out and it hardly makes a difference cosmetically. My BS told me she moved some tissue around a bit for better cosmetic results but did not fill it in with anything. I know everyone keeps mentioning re-excision so I guess it's pretty common. What they do is take out the tumor and surrounding tissue (think cube). Then they stain the 6 sides of the 'cube' and microscopically test to see if any cancer cells are found in the stained area. Your path report will tell you how close to the edges cancer cells were found. If they are too close to the edges (close margins) or on the edges (dirty margins) they will go in and re-excise. In my case I had 4 close margins so for each margin that is not clear they need to take out a chunk of tissue. Luckily my re-excision showed no residual cancer at all. So I had a 1.9cm lump plus all that extra tissue and you can't really even tell. If anything, the cancer side looks a little better since it has a better 'lift' than the other one.",
      "MessageIndex": 42,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762500",
      "Title": "Just Diagnosed :( loving_mother nwest125"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 12, 2010 09:47PM Drim wrote: Hi everyone - just popping in to say hi. I feel like it's been a while. Leanna - I love your picture. That goes for you too x-raygirl. I've been meaning to tell you that. Nanaof2- I guess your doctor decided you should have the 6 TC's. Good luck with the neulasta. I'm hoping you don't have too much pain. Day - you can write a book with all that you've experienced. Also, I found the thread you started a while back about dumb things said to/about you. You can write a book with that one too. So much funny/crazy/sad/shocking stuff. I'll probably be spending lots of time reading it this week. Paxton - hang in there. I'm sending you big (((((hugs))). I've said it before and I'll say it again. I can't imagine going through this with kids. Speaking of kids - Packjen - WOW just WOW!  Redbarb - congrats on being almost done! Sounds like you've done really well so I pray this continues. njbwhgirl, summer and irishtess- of course you can count me in on any get together in the area. I can't wait to meet you all. njbwhgirl - I hope you feel better soon. As for me, I have my last TC tomorrow. I'm on my steriod high now so don't expect to be sleeping any time soon. I'm bringing Crumps cupcakes to celebrate and thank the fabulous staff. I still have to go there for a year for my herceptin but tomorrow is the last day for the cold caps which I know is a little extra work for the staff even though they don't show it.  All has gone well for me too. Still have the hair. My eyebrows are starting to thin and I have some patches on the right side. Nothing a little pencil can't cover. I'm going to LGFB class on Thursday. I'll let you know how my experience is. I have been feeling a little bloated lately and guess what came back. Yes - my period again. What happened to chemopause. The last period was very weird so hopefully this one isn't going to be but I'm not holding my breath since I got no cramps or anything so is this another fake an-ovular one? Still having insurance issues with rads. Not happy about that. Have a good sleep everyone. Next time I talk to you all I'll be done done done!!! Woo Hoo!!!",
      "MessageIndex": 969,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 18, 2010 10:16AM Drim wrote:",
      "MessageIndex": 1018,
      "PostDate": "18/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 25, 2010 08:40PM Drim wrote: Hi everyone - once again it feels like I haven't posted in ages but I have been keeping up with you all during the week. I had such a fabulous weekend. I spent all day yesterday in Central Park in 90+ degree heat with my friends. It's an annual picnic we have to honor the passing of one of my best friend's mother who died  6 years ago. It's really such a nice tradition that brings us all together for fun, laughter, eating drinking and honoring our families. I feel pretty much back to normal now. The only thing going on with me is that my eyebrows are really starting to thin. I'm not stressing this - just filling them in with pencil (probably not doing a great job because I'm clueless). Eyelashes are still there as is all of the hair on my arms and the part of my legs that I didn't shave. The part I do shave grows back really slowly and thin. Chin hairs are starting to re-appear slowly. I was very interested in the discussions about mortality. It made me realize that I'm sort of in denial about this whole thing still. I guess I'm trying not to think about this coming back again. I think I will be really nervous when I go for my first mammo/ultrasound. I also really appreciate the discussion and information on nutrition. I know this is really my downfall and I'd better get serious about improving what I eat. I know this is supposed to be my wake-up call so I better wake up. Unfortunately I don't like to cook but I'm still going to get Cancer Fighting Kitchen and I'm sure there must be some things in there that are easy to prepare. So tomorrow is my rads simulation. I'm not nervous at all (I only get nervous when I'm waiting for test results - like really nervous). I'm going to bite the insurance bullet and just pay whatever and hope for the best. I really love my doctor and I hear she is one of the best so I don't want to mess around and look for someone else - not to mention it is more convenient for me to stay with her. I don't want any more delays (I feel like I really delayed chemo) so I would like to for once start something on time. I will most like start on August 11th - a couple days after I get back from PR. And like GolferGirl I want to stay with the group although I did go check out the August rads group because it's good to hear about what others are doing for pain/redness. Summer - it was nice to hear that you too had a wonderful time with your girlfriends. It is important to do things that make you feel normal and not have to discuss cancer. patricia - I hope you are starting to feel better. My grandmother used to make me dresses and I still have some of them. fotopet - congratulations on finishing up your treatments. I hope you had a decent weekend and that you are starting to feel good by now. LauraM - good to hear from you! I hope you are feeling better with the taxol. njbhwgirl - so terrible that you ended up in the hospital but how great that your friends and family showed you how important you are to them. That's really amazing that they would be such a huge help with such a large party. I can't imagine me organizing a party like that let alone any of my friends taking over for me. Good luck at the PS this Wednesday and happy b'day to your granddaughter. Also, congrats for getting selected for Casting for Recovery. Packjen - that was hysterical about possibly having to share a bed - yikes! So glad you don't have to. x-raygirl - I hope you get selected for this program as well. Day - You're amazing. It's just fascinating to read your posts. Leanna - Happy Anniversary!! GolferGirl - You and I are really traveling this road together. I'm right behind you once again with the rads so I'll count on you to pave the way. You seem to get a lot of good information from your doctors. Hopefully I get on the nutrition bandwagon like you have. Happy belated Birthday. I hope you enjoyed it. I'm sure you did!! (((((HUGS))))) Drim",
      "MessageIndex": 1097,
      "PostDate": "25/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Sep 26, 2010 12:35AM Drim wrote: Hi my sisters! Sorry I haven't posted in so long. I do keep up with everyone and I'm thinking good thoughts for all of you. Big hugs!! I'm so glad that everyone is either done or so close to being done with chemo. Patricia - what an amazing piano story - 11 years old! WOW. Sacphotomom - so sorry you are in the hospital! Get well soon. Tess - Funny you should mention swallowing the pills. I never had any trouble swallowing pills and a few weeks ago (during rads) I almost choked on one. It has been a little harder to swallow the bigger pills but my throat doesn't feel funny at all. As for me I am now DONE with rads. I had my last tx on Friday but I have been working like a lunatic. In fact I am working now (yes 7:30pm on a saturday). I have a deadline on Monday which is why I've hardly been on here. Rads went really well. I did not get fatigued except for one week at the beginning. Good thing because I had no time for that. My skin held up great up until the very end. Now I have one red spot in the boost area. Leanna, most people get a series of regular treatments - that is radiation to the entire breast, and then get a few treatments (I had 7) directly to the scar area where the tumor was. The boosts aren't more radiation than the regular treatment (in fact I think it is less radiation) but the treatment is more cutaneous than subcutaneous which is why your skin feels worse with the boosts. The boosts are weird because they need to mark the treatment area and for me they did that with sharpies and I had to make sure not to wash it off so I went around for 1-1/2 weeks with sharpie markers on my boob. For those of you doing rads or moving on to rads - good luck!!! njbhwgirl - I can't remember when you said our gathering was going to be or if you are even having it anymore but the only week I cannot do is the week of Oct 9th and that may very well be when you were going to have it. I really hope we can all get together soon once we are completely done with treatment and everyone is feeling back to (new) normal. HUGS!!!",
      "MessageIndex": 1634,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Nov 22, 2010 03:11AM Drim wrote: Good evening my sisters!! It's been forever so I'm giving you the long post warning.... Day:  I am so sorry to hear about your friend. That is just awful news. Just sending you big hugs! Your hair looks fantastic. I love have everyone's been comparing their hair length to yours on the various days. Leanna:  You have been gone forever. I missed you and was definitely hoping that the TE fills were going well. It is completely understandable that you would be in some pain and would want to stay away from the computer. Jenn: So happy to hear that your surgery went well and that you sound so great. How is your son doing?  I just love to hear stories about him and how perceptive he is even at his young age. Jean: Thinking about you and hoping all is going well with your mom and son and that you are handling your new living conditions okay. Jen: I hope you're on a sunny beach in Hawaii having the time of your life. Can't wait to hear how it went when you get back! patricia: Welcome back from Paris (I know it's been a while already). Sounds like you had a great trip. How exciting that your sweetie will soon be moving in with you. It sounds like he has been extremely supportive throughout this whole process. Hope that rads is going well. How many times do you have to go? Also, that's very exciting news about another grandchild. It's nice when they are close in age. Glad your thyroid issue is just a goiter which I hope like the others said can be treated without surgery. Too funny the things we are now thankful for. paxton: Sounds like you are making a really good effort to exercise and eat better. I wish I could say the same for myself. The Y is great! YAY for WHOOPIE (hee hee). That word makes me think of the Dating Game. magda - I'm so glad you joined this group. It's been really interesting to read about your journey all the way from the Czech Republic. That bone marrow biopsy information is very interesting. In all my readings I had not heard of this becoming part of the staging in the future. I'm so happy that your surgery went well and hopefully you will be able to escape rads. latte - congratulations on being done with surgery! Sounds like everything went well. Denise: I have been following your posts all along. I'm so happy rads is finally coming to an end for you!!....and yay for eyelashes!! I know you've been waiting patiently! WOO HOO!! Daiva: Oh man....that's crazy about your puncture. Hopefully the ‘fix' for this won't be too terrible. Thank goodness you're almost done with rads. I did great during chemo but definitely had energy issues during rads - somewhat around the middle of rads and then more so after it was over so all of that is totally normal. I am really sorry to hear about the BRCA+. That's a terrible blow. I know they recommend an ooph so it's good that you will be getting that done soon. LauraM:  Nice to hear from you and what a great picture. Glad you are moving on from treatment. Very interesting about the lymph nodes. Thanks goodness your doctor noticed the other ‘bad' areas. I wonder if all of our surgeons/labs are testing everything they should. It's amazing how much information I learn all the time from reading others' stories on this site. golfergirl: Hope all is well with you. I'm sure you are reading when you can so know that I'm thinking of you and hoping you're settling back in to ‘normal' life. Irishtess: How are you doing? Haven't heard from you in quite some time. I hope you are fully recovered from rads and not suffering from too much fatigue. Summer: Miss you too. I understand you are posting on facebook and that you are doing that crazy traveling to rads so it makes sense you are not posting on here anymore. Speaking of FB, I changed my security settings so you can search for me and friend me now if you'd like. I don't get on that often especially since I can't access it from work. wellsey6, nanaof2, KimLoves, redbarb, JennyB and fotopet: Just giving you all a shout out and hope you are doing well!! As for me, I'm doing okay. Work is not as busy as it was before. When it's not busy I get concerned that I won't have enough work. Our company just went through layoffs last week and there will be another one in January so some scary times. I went for my first post treatment mammo. They said everything was fine. Then I get this letter in the mail that says they saw something on the film they believe to be benign, which they put in big bold letters. My heart skipped a beat anyway. Then I was thinking - which breast did they see something in. Then I remembered that they only took films of the right one. I know there is something in there that is benign already so hopefully they are referring to that same spot (that supposedly has a clip on it). I'm going for another full mammo in February so they'll have another opportunity to go in there. I'm wondering if this is all too much radiation for such a short period of time. I'm on tamoxifen yet I got my period anyway and I have not had a single hotflash in over 2 months so I'm seriously concerned that this stuff is not working on me. I'm going in for herceptin on Tuesday so I will of course mention this to my onc. My eyelashes have stopped growing so I just placed my order for RapidLash. I'm going to try it and see if it lengthens my lashes without giving me any irritation. I've missed you all. I'm glad so many of us are still coming back here! Hugs and Happy Thanksgiving to all!! Ditah",
      "MessageIndex": 1916,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Apr 24, 2010 02:47AM Drim wrote: adb1971: I actually do think this is going to be a lot of work. I cried about it at first because I'm not used to asking for help but my family has been so amazing. They say they'll do anything for me. I totally planned on doing the cooler/transport thing but now Frank Fronda, the inventor/owner is saying he is interesting in putting a freezer in my facility so who knows but that would be wonderful! I will definitely keep you posted. Beanius: I am so sorry to welcome you to the group but you have definitely landed in the right place. I think you are doing great. You have made it to this point pretty quickly. No wonder you're still in shock. I had so many different tests and it seemed like they were all taking forever. For sure the waiting is the WORST! Don't let your mind wander too much. I don't know your husband but I'm sure he will be by your side wanting to do whatever he can. Please don't feel like you are a burden. You will most definitely get through this!!!",
      "MessageIndex": 13,
      "PostDate": "24/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 7, 2010 08:24PM Drim wrote: Hi all, I finally have the final details of my chemo treatment. I will definitely be starting on Tuesday May 11th. I will be doing the TC x 4. I think the Herceptin will start concurrently but not until the 2nd treatment. I will be doing herceptin for a year from when it starts. I will also be doing the cold caps and I will need to have those on my head for 8 hours (hopefully 7 hrs starting with treatment #2). This should be a real adventure which I will share with you. I'm of course so nervous but it sounds like you guys are doing well so that's encouraging for sure!",
      "MessageIndex": 153,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 28, 2010 07:35AM Drim wrote: Day and GolferGirl - Thinking about you and good luck! To all - have a wonderful Memorial Day Weekend!!",
      "MessageIndex": 489,
      "PostDate": "28/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 5, 2010 04:03PM Drim wrote: GolferGirl - I hope you're doing better today. I'm sure it's the hormones so I'm hoping that will pass. I'm sorry - you really made me burst out in laughter with 'haystack'. I've been calling my hair birds nest as in - no I cannot leave the house today because my hair looks like a birds nest. But really I am thankful. Day- I've had the same sleep and taste issues you had. I'm on Day 5 of 2nd TC right now. The steroids kept me up for 4 days (I really need to take something next time to make me sleep) and my taste buds are not good. I was describing something similar to you. My tongue feels like I burned it. It doesn't look red or anything but that's just the best way to describe the feeling. Things don't taste that great including water so I have put some lemon drops in my water but it's becoming increasingly difficult to drink enough and now I am a bit constipated. Day 4 was definitely my worst day as I just felt 'heavy' all day. But I'm happy to report I finally got some sleep last night and I'm feeling much better. Now I just need to get my taste back. I'm hoping you all have a wonderful weekend!",
      "MessageIndex": 579,
      "PostDate": "05/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 19, 2010 12:03PM Drim wrote: Hi my sisters! It seems like forever since I last posted. I've been working late a lot and have had no energy at the end of the day to post. I'm doing well except for the past 2 weeks I had my bout with my an-ovular period which start 3 weeks after my last real period. The first week it was very light. Week 2 it started to pick up a bit and by mid week - holy cow - the flood gates opened! On Thurs. night I couldn't even sleep. This went on all day Friday but thank goodness it has slowed down. Also, I have been so bloated these past couple of weeks but I think that's getting better now too! First of all I would like to give a big shout out to all you mothers (and grandmothers) out there who have the added responsibility of taking care of your kids and the issues that come along with that. There are so many of you and I am just sending you all a big hug! LauraM and GolferGirl - love the stories about your daughter and niece. These kids are so insightful. Sacphotomom and LauraM- congrats on 4th AC. What a relief to be done/almost done with that part of your treatment. YAY!!! Leanna - I love your story about shaving your head if the Celtics had won. Can you imagine the look on your friends' faces? They would have thought you are the biggest Celtics fan ever! Also, really cool about your son and the Jr. Olympics. LibraryJenn - happy B'day to your son. We share the same birthday! Also, I love the boob art story. It's great that you have so much support around you. Nanaof2 - must be such a relief to have the school year done (almost done). Hopefully you can focus on just you now and finish up this treatment! LisaNJ - I am your friend's sister. I'm so happy you decided to join. I'm sure you have already realized what a great group we have going here. I hope this makes you feel better about how you're doing with your treatment and I hope you have a great weekend! Summer38- I seemed to be having some weird eye issues yesterday. No tearing but I couldn't see distance very well. Kind of like I had a light shining in my eyes and it was causing a cloudy film. I was ready to make an eye doctor appt. and get glasses. Note that I just turned 44 and refuse to admit that I may perhaps need reading glasses but never before did I think I needed them for distance. Today seems to be better but I still feel like staring at the computer screen all day is probably not great.  Sorry about that long post but that's what happens when you stay away for a week . May you all have a SE free weekend!!",
      "MessageIndex": 754,
      "PostDate": "19/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 4, 2010 11:14AM Drim wrote: nanaof2 - I have been taking acidophilus. I'm not a good 'health food' person so I can't give you information on alternatives but it's just a pill once a day. wellsey66 - welcome! I'm glad our group has helped you out. It sounds like you are doing pretty well. Thanks for the inspiration about organic. I REALLY need to do that as well. I'm ER+/PR+ and my eating habits prior to BC were not great. It doesn't help that I don't cook but I need to make a much better effort to go to Whole Foods and by organic stuff. It's really awful what they inject our food with now of days.",
      "MessageIndex": 873,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 19, 2010 12:00PM Drim wrote: MHP70 - With regard to the peas, what I did was to buy bags of frozen peas as they stay cold for a long time. I placed a bag on top of my toes. For the fingers I put surgical gloves on my hands and literally stuck them in the peas which I put in a ziploc. I gave them a little rest if they were getting cold because I certainly don't want frost bite. I have seen other people saying things like - I had no issues with my nails because the infusion room was so cold and I wore sandals. So I think the idea is just to slow down the circulation to the extremities. I only did this during the Taxotere part (a few min. before to make sure they were cold at the start and a little while after just in case.) Best of luck with your treatment.",
      "MessageIndex": 8,
      "PostDate": "19/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/753507",
      "Title": "TC Chemo really not bad so far KGBinDC KGBinDC"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 9, 2010 10:09PM Drim wrote:",
      "MessageIndex": 177,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 15, 2010 11:28AM Drim wrote:",
      "MessageIndex": 276,
      "PostDate": "15/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 18, 2010 06:50PM Drim wrote: Hi all - I figured I'd post an update. Day 8 and I'm actually feeling just fine. I had a tiny dip down yesterday. My body started to feel really heavy and I got some tingling everywhere. I realized that I probably needed to eat. I guess I've been eating often (since I was home all last week) and now I'm at work so I lost track of time. Once I ate I was fine and remained fine for the rest of the day. Note that I did have a neulasta shot the day after and I got no adverse reactions so neulasta can be your friend. Note also that I am a regular Claritin user for bad seasonal allergies. Javahog - that is so great of you to help your mom with the computer. Please wish her the best. You guys have come to the right place. packjen and nanaof2 - I'm so sorry to hear about your hospital stay. I hope you're both doing well today. fotopet - thinking about you today... MommyTo4GreatKiddos - Welcome. How old are you kids? God bless all of you moms out there.",
      "MessageIndex": 330,
      "PostDate": "18/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 19, 2010 08:13PM Drim wrote: countryfra - you are definitely drinking enough water. I think they say 8 - 12 (8 oz) glasses around the infusion time. Probably closer to 8 once you're out a few days. Prune juice is great too. I've been drinking that and eating dried prunes and I've had very little constipation issues. CTherese- I got my period yesterday too. It seems a little bit heavier than usual and it came a couple days earlier than usual. It will be interesting to see how this affects me the next couple of days. I also thought I was getting a UTI which I never get. I had some burning in the area (TMI) and I did feel like I needed to urinate quite a lot, which I think means I need to do a better job with the wipies those first few days as to not irritate the skin. Luckily the probably seems to be pretty much gone now which I'm surprised at. I guess healing of any kind surprises me now. Last night I went out for dinner with a bunch of friends and had what amounted to a glass of wine. I'm not sure that was the smartest thing to do as I did get a headache and did not sleep very well. I feel pretty okay today but feel like I can't wait to get home from work. I'm starting to get nervous about my hair. Nothing at all is happening yet anywhere (Day 9) and I'm doing the cold caps so the anticipation of the results is killing me. Good luck to all of you receiving treatment this week!!!",
      "MessageIndex": 354,
      "PostDate": "19/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 3, 2010 11:54AM Drim wrote: Hi all, Day - so sorry to hear that your infusion took so long. I don't blame you for being pooped and not feeling like you can respond to everyone. Patricia - that is kinda funny that your son spoke for your daughter. I'm sure it would be traumatic for you to see your daughter with a shaved head. Somehow for boys it doesn't seem like that big a deal (I guess depending on what kind of hairstyle they currently have). nanaof 2 and sacphotomom - so sorry to hear about your port issues. Hopefully that doesn't happen anymore. Glad they finally got it straightened out for both of you. Tricia - the wig story made me cry. That must have made you feel like a million bucks to hear that wig compliment. Irishtess - I noticed that you said you are coming to NYC for your treatment.Where do you go? I live in NYC. Do you need any help with anything? Summer - I'm sorry you could not be with your daughter. I do not have any kids and I can't imagine going through all this while having to worry about kids too. God bless all you parents out there!! Hair stuff: I am doing the penguin cold caps so I'm not losing the hair on my head. The only other hair I seem to be losing (Day 24 of TCx4) is the hair down there. It fell out a bunch around day 15/16 something like that and then it stopped so perhaps in a couple of weeks it will all be gone. I haven't noticed any other hair loss but it does seem like the hair is growing in slower like under my arms and legs. I also got the irritation down there about a week after my first treatment. I thought it may be a yeast or bladder infection but I just think it was the cytoxan irritating the area and then it went away completely in about a week. This time I'm making sure to always wipe with wet wipes so it doesn't happen again. Also - drink drink drink water. I've finally had to resort to lemon flavoring in the water because the water is starting to get boring after 4 weeks of massive drinking. Hope you are all well!",
      "MessageIndex": 557,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 7, 2010 03:28PM Drim wrote: Irishtess - so glad your treatment went better this time in terms of nausea. It's great when we figure things out. I'm glad you're up to a get-together. Would love to meet you and njbhwgirl! Also, I saw your jewelry website and there are some beautiful pieces but there is one I'm particularly interested in so I will need to PM you. Not sure you're up to making jewelry at the moment. Interesting about the hip pain. I had hip 'issues', not so much pain but it felt like the hip joints were out of line (which I do get normally sometimes anyway) and this went on for a few days starting about a week after the neulasta shot. Now I'm starting to feel them again and it's been 5 days since neulasta. That's the only affect I get from the neulasta so not bad and good to know that it means regeneration!",
      "MessageIndex": 596,
      "PostDate": "07/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 3, 2010 02:52PM Drim wrote: Hi nanaof2 - I am only having 4 rounds of TC so I'll be done on July 13th. Hopefully you will be done after 4 as well. I wonder why they wanted to do 6 in the first place for you? You should ask what benefit they expect to get out of the add'l 2 treatments. I've gained about 7 or 8 pounds so far since chemo started (but I had lost 15 from the stress of waiting for results) so I'm okay with how I am now - although I would not mind dropping another 5. I wonder how much is water weight as I do feel bloated at times. As long as I take probiotics I feel better. Hopefully I will not always need to take probiotics to feel better. I am also starving all the time. I feel like I could just eat and eat. Nothing in particular - just everything. JennyB - CONGRATULATIONS on being done. I know this was a really rough time for you but it should be all uphill from now on. I will be starting rads mid-August. I am supposed to go in for my rad simulation on Tuesday but I am having insurance issues (Aetna is having a difficult time with my health care provider or vice versa) so the coverage that was previously in-network is now being considered out of network unless I can get Continuity of Care which should not be a problem, however until it is resolved I will not schedule anything and find I am not covered. I still have time so even if I don't get my simulation on Tuesday I should still be on schedule for a mid-August start. x-raygirl - welcome to our group! Leanna9 - thinking about you and hoping your hair was able to hold out for you! To all of you guys on your next phase of chemo - good luck!!! And here's hoping for less side effects this time. Happy 4th!!",
      "MessageIndex": 869,
      "PostDate": "03/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 8, 2010 09:27AM Drim wrote: Summer - each time I go for chemo (actually not the 1st time because they already had a baseline which I did not get come to think of it) they do a blood draw before I start, to check my counts. The first time they did this they gave me the print out. The 2nd time I had to ask for it. They are checking for WBC, RBC, etc. As far as markers, I don't get that I'm guessing since I'm stage 1. nanaof2 - that's a beautiful story about your father. I'm sure he's up there taking care of you.",
      "MessageIndex": 911,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 13, 2010 08:42PM Drim wrote: Redbarb - I had my last chemo today and before I went in I was in with the doctor. Interestingly, for the first time she checked my ankles and calves for swelling. I didn't have any swelling today but told her that my feet do swell up a bit when it's really humid. She said this was not a problem. Unfortunately I did not ask her what she was checking for but it sounds like fluid retention. I think you are going on Thursday so maybe you can wait until then to ask your doctor. If you are really worried you should call tomorrow and report this. Thanks all for your good wishes. It feels good to be done. Everything went smoothly today so we'll have to see how the rest of the week goes. Now onto radiation. I will absolutely stay connected with you all. You are my new sisters.",
      "MessageIndex": 981,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 29, 2010 10:35PM Drim wrote: Leanna - I wish I had the amount of energy you have. I'm working full time (which is like 10 hrs. a day) but when I get home I'm exhausted and I can barely get up in the morning. As far as the rads, once you get a time you do stick to it for the whole 6-7 weeks. The appt itself is supposed to be pretty short - get undressed, get positioned into machine, get zapped, get dressed and leave. Once a week you're supposed to spend some time with the doctor. While writing this post I got a call that they were able to give me a better time/date/location - woo hoo!!! So I will start rads at 8:30am on August 10th. I get back from PR on Aug. 9th but thankfully I won't be home too late. I have herceptin right after rads on that day which is nowhere near the radiation place. Then off to work - boy I'm exhausted just thinking about that....but so happy I got a better time for rads. njbhwgirl - I hope your lungs will be all better in time for your next treatment. It does sound like it's a virus and not from the Taxol. As far as my hair, it's all there but it's really gray and dry too. But I'm still thankful to have it! My eyelashes, although no great shakes, have held up. The brows are funny - not quite sure what's going on with them but I've been filling the missing spots with pencil and to me they look fine. The left brow is really sprouting hairs. The right brow, not so much.",
      "MessageIndex": 1136,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 29, 2010 10:42PM - edited Jul 30, 2010 12:51AM by Drim",
      "MessageIndex": 1137,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 31, 2010 04:52PM Drim wrote: Golfergirl- naturopath doctor - that sounds very interesting! I'm right behind you with the rads. I found out that I will be starting on August 10th, the day after I get back from PR. I was able to get an 8:30am appt. at a convenient location (i.e. subway accessible) so I'm very happy about that. Now I will have to be disciplined at getting up on time in the morning. I'm so horrible for work - I show up late all the time but I stay really late so no one cares. It's funny because I absolutely hate being late for things (like appts. or meeting people). I always make sure I am on time, but for work I somehow have a whole different attitude - like no one is really waiting for me so what's the difference. JennyB - glad you've been cleared to start rads as well. Hopefully the worst is behind you. So sorry for that awful CT experience. That is just not right. Some people just don't get it. We are human beings! Daiva- that's so beautiful about your tattoo. You are a very lucky woman to be surrounded by such love. Re: my hair - I did something called Penguin Cold Caps (GolferGirl did this as well) whereby you place freezing cold (-20F) gel filled caps on your head on the infusion day - for about 7 hours - and it keeps the chemo from reaching your hair follicles. It's really a lot of work because you need one or 2 helpers to constantly replace the caps as they warm up. As a result of doing this I've been able to keep my hair but that is a chore as well because it's kind of dry now and you can't do much to style it because it and the follicles are still fragile. Even though I'm only 44 I have a ton of gray hair so it's a real challenge to cover up the gray without using real hair dye. With all that said I think I made the right decision for me to go forward with this. I don't think I would look nearly as good bald as you do. Re: Oncotype testing. You should google it. It's very interesting. In a nutshell, you end up with a recurrence score that tells you the likelihood of a distance recurrence within 10 years assuming you are ER+ positive and will be taking tamoxifen. It sounds like the scores are similar to Ki-67 which is definitely one of the indicators they test. I got a 19 which is considered low intermediate. What this means is that they are not sure if I would get a benefit from chemo or not. There is a large clinical trial going on called TailorX to try to figure out more about the intermediate scores. The test is really for early stage breast cancer. At the end of the day I am HER2+ so by today's standard of care I had to do chemo in order to receive herceptin. I would absolutely love to have the opportunity to meet you all. Have a great weekend everyone!!",
      "MessageIndex": 1152,
      "PostDate": "31/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Aug 28, 2010 07:59PM Drim wrote: Wow - I have lots of catching up to do! I know I haven't posted in a long time but I have been trying to keep up as best as I can. I started rads 3 weeks ago and all is going well with that. There are no signs of redness or burning to speak of yet but I am definitely feeling tired. Last night I went to sleep at around 10pm and usually i'm up until at least midnight or sometime 1am. It is true that I worked about 50 hours this week plus the additional 45 min/day added on for rads could have contributed but I still think it's mostly the rads. I spoke to my rad onc and she said she had no problem if I started tamoxifen during rads so I will speak with my med onc on Tuesday when I go for my herceptin. I've been reading about tests they can do to see if you will respond to the tamox so I'm going to ask her about that too. I don't want to take it if my body isn't going to process it. I just starting getting hot flashes (fun), but they are not too bad. I mostly feel it in my back - weird. I'm sure they will get a lot worse once I start the tamox (I heard that you know it's working if you get the hot flashes). Golfergirl - thinking about you and hoping you're doing well through rads. njbhwgirl- CONGRATULATIONS!!! I'm so happy for you that you are done with chemo. It is very emotional to be done. Like everything you've just been through has come to a head. You know I'm praying for you to get clean scans which I know you will. About our September get together at your place - I am definitely in. Just let me know when. I have a queen size aerobed so you don't need to worry about me. I'll also be happy to bring the ingredients for those biscontinis. I can't wait to try those. Irishtess - CONGRATULATIONS to you too!! I'm sure you will not miss those long trips into the city for your treatment. I'm sure you can't wait for vacation. I know how you love Ireland so that will be terrific! Summer- CONGRATULATIONS - you're done too!!! Thanks for the biscotini information. I am definitely going to be making those. I'm so sorry that you have to drive so far for rads. Hopefully you don't mind driving and enjoy being in the car. I love being in the car and singing (sure - this coming from the city girl who doesn't even own a car). Funny - I thought your name actually was Summer. Packjen- what a lovely story about your CFR experience....and congrats on winning the rod. You deserve it for driving all those people. I hope you (and everyone else) can make the trip to the Jersey Shore. Patricia - I always enjoy reading your posts. It's sounds like you have a great guy and he has a great gal. I highly recommend going on vacation between chemo and rads - Paris sounds just perfect. Leanna - I'm so sorry you are struggling with this treatment but you are almost done! I know you can do it. I was picturing your 'new' bathroom and it sounds great. I love changing things up in the bathroom. Sacphotomom, Kim, Daiva and Day - thinking about you too and hoping you are doing well!  Everyone have a great weekend!!!",
      "MessageIndex": 1393,
      "PostDate": "28/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Sep 12, 2010 11:48PM - edited Sep 12, 2010 11:49PM by Drim",
      "MessageIndex": 1524,
      "PostDate": "12/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Oct 3, 2010 12:23PM Drim wrote: Patricia - congratulations on being done. You have been such an inspiration throughout! Daiva - I don't take any sleep aids. I've always been a pretty good sleeper but not as good anymore. I'm gonna be starting tamox in about a week. Let's see what that does to my sleep. Jen - you look awesome. Loving the short hair look on you!! Hang in there with your twins. Of course you're tired. Tess - I caught myself saying I HAD cancer the other day and then had to pause and think about what that really means. I guess I felt free to say that because now I'm a week out of rads so I have to hope that if there truly was anything left after surgery it is now gone and all the stuff I have to do for the rest of my life (herceptin until May and then pills pills pills) truly will be preventative. njbhwgirl - sending you lots of love and hope things will be okay with your mom. I'm still very much looking forward to meeting you and all of the wonderful women I was lucky enough to meet on this journey. Denise - how are you feeling? I hope you are better now!!! Day, Golfergirl, Leanna, Jenn, Paxton, Kim, Barb, Summer, Wellsey and Magda - Big hugs to all of you!!! So I've decided enough is enough with the gray hair so I made an appt. at a salon that specializes in organic products to get my hair colored. I am pretty nervous after what I went through with the cold caps but I feel like my hair can handle it now. I have to leave in an hour! I'll let you know how it went! Happy Sunday!",
      "MessageIndex": 1677,
      "PostDate": "03/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Oct 20, 2010 03:04AM Drim wrote: Jenn - I just loved your story! It did bring tears to my eyes. What a sweet son you have. Beth - I'm not sure how they are going to assess the tamox effectiveness. I'm going to ask my onc when I see her in 2 weeks. I too was thinking that the hot flashes stopped because it's not hot here anymore. No clue. Leanna - I hope you're resting for your early appt. tomorrow! I hope you'll be as pain free and comfortable as possible. Can't wait to hear from you. Hugs - Ditah (who knew there were that many others...haa)",
      "MessageIndex": 1763,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Oct 26, 2010 04:28AM Drim wrote: I just realized I forgot to tell you that I won't be on TV tomorrow morning. They have postponed the GMA segment until Thursday Oct 28th also at 8am I believe. Hopefully you read this before you watch the show and wonder what the heck happened. Apparently now that there is more time, the producers are scrambling to get a bunch of pics of people with the caps on during treatment but I have none.  Denise - it's so nice to hear you doing so well. I can almost hear the relief in your voice that things are going so well!! Leanna!! Welcome back. It sounds like the surgery went well - just wish you didn't have the pain. How fabulous about all the clear nodes and the major tumor shrinkage/disappearance. Great to know that the chemo worked!!! Beth - my eye doctor also said that me needing reading glasses has nothing to do with the chemo. Congrats on the parents' 50th anniversaries. That is really strange that both of your parents would be celebrating one day apart. My parents recently celebrated 45 yrs. Paxton - great to hear that you are doing so well with your son. I know what you mean about the eating. I am really trying but still need to get more fruits and veggies into my diet. Good night my friends! Ditah",
      "MessageIndex": 1800,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Oct 31, 2010 04:17PM - edited Aug 20, 2013 11:03AM by Drim Magda - congrats on being done with chemo!! I think we are all done now. Is that correct? Hopefully we are all done forever!!! BRCA negative - what a huge relief. Throughout everything, the only time I cried when I got results was when they told me I was BRCA negative. I was just so relieved. I had convinced myself that I had too much going against me to be negative. LauraM - congrats on being done with Rads. Something else to put behind you! How great! Keep putting the creams on -especially at the boost area - for another couple of weeks. Day - I hope you're feeling better. I really do miss your educational posts. Jean - thanks! I had a great time doing the piece and am happy to go public to spread the word. Knowledge is power. Doesn't mean the caps are right for everyone but good to know about at least. Yay for the eyelashes. Mine are looking pretty sorry these days. The bottom ones are fine but the top ones are so short. They are a good thickness but then they just stopped growing. Guess I may need to go for that help eventually. Thanks Denise - yep, it was me. I'm glad I wasn't in it too much and that the story featured Shirley who is an amazing woman (she started the Rapunzel Project to raise funds to put freezers in cancer centers so that there can be a more affordable way to use these caps if one wishes to). Leanna - so happy to hear that your pain is getting better. It does kinda sound funny that you get to pick your size. What size do you start out at when they first put the TE in? and how often do you go for fills? I had heard that they like you to be fully expanded before the rads so they don't have to stretch your skin after rads. I'm sure your doctors will explain it all to you. I keep forgetting you have a teenage daughter. I know Nolan and Ryan are young athletic boys. Are they watching the World Series? Nolan Ryan...haa haa. Gotta love it! This is really going to put their names in the spotlight. I'm rooting for the Rangers now that the Yankees are out. Hugs to all the Warriors! Ditah",
      "MessageIndex": 1825,
      "PostDate": "31/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Nov 22, 2010 04:39PM Drim wrote: Hi Latte - thanks! Yes, I did know about that test. I even spoke with my onc about it before I started the tamox but she did not recommend it for the exact reason you stated. I don't know if she will have my estrogen levels checked. Perhaps I will have to go on Lupron shots or something. I will find out what she says tomorrow.",
      "MessageIndex": 1918,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Dec 23, 2010 01:22PM Drim wrote: My sisters!!! It's been so long and I've missed you all. I have been trying to keep up as much as possible and it's nice to see that we are starting to bounce back. All is well with me. Working hard and preparing for an apt. renovation - the one I was about to start when I got the 'word' last year. Everything seems to be back to normal except my eyelashes. Those suckers will just not grow - not even with the Rapid Lash I've been using but definitely a small price to pay. I'm Jewish but it seems I have a bunch of Christmas plans this year so I'm excited about that. New Year's Eve will also be exciting. I work in Times Square and our office window faces the ball at eye level. We are having a charity event here so I'm sure it will be really nice. I wanted to wish each and every one of you a very very happy holiday! I am sure 2011 is going to be a better year for all of us. I'm really looking forward to meeting as many of you as possible in person in 2011!!!",
      "MessageIndex": 2009,
      "PostDate": "23/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Dec 29, 2010 04:41AM Drim wrote: Hi Daiva! I'm glad you are giving yourself a break. It's been a crazy year and it's definitely time to relax with family. I've been at this job for almost 4 years but this will be the first time I've ever participated in the New Year's celebration there. I'm really looking forward to it! I look at the ball face to face all year long but it's hidden at the moment until New Year's. The sign already says 2011. Happy New Year my sisters!!!",
      "MessageIndex": 2020,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Apr 23, 2010 02:14AM Drim wrote: Hi all, I will also be starting TC x 4 @ 3 weeks around May 11th and probably herceptin after that (still t/b/d). I got some conflicting HER2 results (positive on the biopsy, negative on the lumpectomy) and because of that the doctors have been doing a lot of testing including Oncotype DX (got a 19), which has delayed the chemo process. Looks like I will be in a very nice facility. I met some of the staff today so they made me feel a little better. I also decided to try the Penguin Cold Caps for hair preservation so I am about to get the ball rolling on that. Good luck to all you wonderful ladies!",
      "MessageIndex": 6,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Apr 23, 2010 03:54AM Drim wrote: Hi Rdbarb - The cold caps were designed and widely used in the UK (and Australia). They are special caps that must be cooled to a very low temperature and then placed tightly on your head a little before, during and a bit after each infusion. It seems to have good success in maintaining a decent amount of hair. I'm hoping it will do the same for me. There is a great thread in here about it. Here is the link to the website:  www.msc-wordwide.com Good luck with everything!",
      "MessageIndex": 8,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jan 16, 2011 09:08PM Drim wrote: Hi May Warriors (I love that)! I have not been on all week as this has been a busy week at work and I'm still working on getting everything together for my apt. rennovations. It is going to require me to move out of my apt. as I only have one bathroom so unless I can figure something else out I may be moving in with my parents. I wouldn't mind at all except they live kinda far from the city so the commuting would suck. I already requested that they get DVR service as I cannot live without that (haa haa). I of course will pay whatever. I have a feeling once they see it they will love it and will keep it when I leave. I am also getting ready to go to Sun Valley Idaho for a week of skiing. I leave early Sat. morning. I haven't skied in 5 years. Should be fun. Daiva - I hope you are feeling well and are recovering quickly from your surgery! Leanna - Just always great hearing from you. I can feel your frustration. Denise - I believe I forgot to congratulate you on your daughter's engagement. I know it's exciting but don't worry about what you can and cannot provide. The greatest gift to your daughter for sure is your health. You look terrific both with and without wig. Magda - thinking about you and hoping you will bounce back. Work is a good distraction for sure. Patricia - hope you're having a great time on your trip!!! Can't wait to hear all about it. Jersey - who cares about cleaning!!! You can worry about that later. Great story about your letter to that surgeon. Good for you for standing up for high risk women!",
      "MessageIndex": 2072,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Apr 27, 2010 01:49AM Drim wrote: JennyB - Welcome!!! Also wanted to let you know I sent the article you directed me to read to my doctor. She said it was very interesting and she would be reading it carefully this week. Beanius - good luck with everything. Waiting for results is the worst part. We will all be thinking of you and hoping it all turns out okay. Remember they are doing all this testing because they want to know what's there or not there hopefully - not because they think there is something there.",
      "MessageIndex": 22,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 2, 2010 04:23PM Drim wrote: Redbarb, You and I are on practically the same schedule. I'm starting 5/11 withTC x 4. I'll definitely have rads and then tamoxifen too. Just waiting to hear if I will need Herceptin as well. Good luck to those starting this Monday and Tuesday!!!",
      "MessageIndex": 66,
      "PostDate": "02/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 5, 2010 08:48PM Drim wrote: Hi Tricia! I see I now have a HER2+ sister in this group. I did not think your post was too detailed at all. I think it's good for us to know what happens - especially those who have yet to start like me. Good tip about the ice chips. I actually am doing the cold caps. I was inquiring about cold everything - head, eyebrows, fingers, toes - now mouth! OMG - they might as well do my infusion in a freezer. Golfergirl - I laughed about your last hurrah post since I've been saying that for weeks now. Welcome CharlieBird, Dana and Day.",
      "MessageIndex": 121,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 7, 2010 05:22PM Drim wrote:",
      "MessageIndex": 150,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 9, 2010 05:51PM Drim wrote: njbhwgirl: I too seem to be more caught up in the hair thing than the side effects of the chemo and I'm feeling a little guilty about that. At first I thought this would be a good opportunity to do something different with my hair and have some fun, but when reality set in I was so drawn to the cold caps. I think I was most frightened of the time it would take for my hair to grow back since I will be on herceptin and tamoxifen and some people say those make your hair grow back slowly / thin your hair, respectively. Good luck on Wednesday. I'm one day ahead of you so lets hope for little/no side effects for both of us! JennyB: I'm a little worried about the eyelash/eyebrow thing too. Some people have talked about using Lattisse (you need a prescription from your dermotologist). I still have that in the back of my head. I guess the eyebrows won't take that long to grow back and I can hardly see my eyelashes as it is.",
      "MessageIndex": 173,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 13, 2010 04:18PM Drim wrote:",
      "MessageIndex": 235,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 17, 2010 09:04AM Drim wrote: Alice, Klaudette and Countryfrau - my thoughts are with you!!! I know you guys will do great. It sounds like you are all prepared. Just think positively and you will sail through today. Then just take it easy as much as possible, drink LOTS of water, follow the great advice of others and you will be fine! Klaudette - I too am happy for you that you are able to make other arrangements with your kids during the day. I'm sure it must be extra hard to have the kids to care for but I'm sure they give you lots of love too. fotopet - all I can say is YAY!!!! I'm doing a happy dance for you! Good luck tomorrow. juliebed, snipinfool, and Summer - good luck to you on Wednesday. Hopefully this group is giving you inspiration that you will do well too!",
      "MessageIndex": 307,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 24, 2010 09:17PM Drim wrote:",
      "MessageIndex": 422,
      "PostDate": "24/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 10, 2010 05:00AM Drim wrote: Leanna - your kids names are Nolan and Ryan! That's great!!! I'm a huge baseball fan! I love that everyone is putting up pictures now! What a good looking bunch we are. I'm pretty sure I have the anovulatory thing going on too. I got my period a week after my first treatment and it was pretty normal. Then 3 weeks later it started again but very light and without cramps or anything. It's been about 3 days and its pretty much the same - just light. I had lost about 15 lbs. over 4 months from all the stress of waiting for test results (and boy are there lots). I was actually really happy because I needed to lose 10 and the extra 5 was fine too. Right at the same time that I got this 'period' I have felt sooo bloated. I'm sure I've gained at least 5 pounds if not more in the last week.  Good luck to those getting treatments tomorrow and Friday.",
      "MessageIndex": 644,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 10, 2010 10:14AM Drim wrote: Oh Jenny! I am so sorry to hear the news. I'm also sending you (((((BIG HUGS))))). Stay strong! You're almost done! Summer - what a sweet picture of you and your daughter. Just noticed you're in NY. Is that NYC? There are quite a few of us on the east coast. I really hope one day we get to meet when this is all behind us. Leanna - I was thinking that the runny nose you describe is from the herceptin. It's supposedly one of those side effects they don't tell you about. It's supposed to go away when the herceptin is done. I just had my first dose of herceptin on Tuesday and it was uneventful. Hopefully it stays that way. I go in again next Tuesday and after my 3rd TC they will decide if they will continue on with H weekly until TC ends or of they will make the switch to once every 3 weeks. Hugs to all of you! ",
      "MessageIndex": 654,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 10, 2010 08:33PM Drim wrote: Leanna - sounds like you already have a lot of energy! With regard to the herceptin, yes, I will be getting treatment for a year. That's how it's done in the clinical trials so the normal couse of treatment is one year. Some people get it for two years (not typical). Others with metastatic cancer can be on herceptin for life. It's really quite a miracle drug. In terms of monitoring the heart, I got an echo (ultrasound) before I started treatment and will get one every three months throughoutt so yes, what your onc is telling you in terms of frequency is normal. Hopefully it's an echo and not an EKG. Not sure EKG is good enough. I know some people get MUGA scans but those are more invasive (I think since I've never had one). Hopefully you will get some sleep tonight! Kim - That picture is WILD!! I love it! LibraryJenn - I'm so glad you found us too. We all welcome you with open arms! Sounds like you have a beautiful family. Kinda cool to 'know' someone from Saskatchewan.",
      "MessageIndex": 663,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 23, 2010 11:47PM Drim wrote: Wow Redbarb - that is some story. I can't believe all of that crept up on you after all that time. I'm on Taxotere too and I've been seeing a few people with issues. It must have a cumulative effect where at first its not too bad but then sneaks up on you. Hopefully your next treatment will go well and you don't need to worry about switching. I'm only a day out from treatment #3 and had neulasta today. I'm feeling fine but just a little tired so I'm sorry I'm not addressing everyone but I have been trying to keep up and I too am sorry for you having the mouth, hand and foot issues. Everybody be well. Look at how are may group has almost made it to July!!! JennyB - you're going to be done at the end of June. You deserve to be the first one of us done with all you've been through I hope you're doing well! I'm happy to report my period issues are over (for now at least). Also wanted to mention for those of you on Taxotere. I had an ice cube in my mouth during that whole infusion (which I did the 1st time and not really the 2nd time) and I don't have that burnt tongue thing this time like I did last time so I think it really works.  Take care everyone!!",
      "MessageIndex": 796,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 1, 2010 04:49PM Drim wrote: Hey everyone!!! Once again it's been ages since I've posted. I have, however, been trying to keep up with everyone. I will probably come back soon and post again when I get out of work but I did see that some of you were starting Taxotare so I wanted to throw my 2 cents in since I've now been through 3 rounds of TC and still doing well (including the hair on my head). The only issue I'm really having is bloating so I need to get back on the probiotics. I have been fortunate enough not to have allergic reactions to the T. My infusion time the 1st time was 1-1/2 hours and now it's 1 hr. since I don't get reactions. My premeds include Dexamethasone, Pepcid, Benedryl and Aloxi. What I've been doing during each T treatment is to bring bags of frozen peas and put one on my toes and stick my fingers in the other. This is supposed to help with nail changes and neuropathy (although Taxol is supposed to be worse with these things). The other thing I do is to suck on ice cubes (big ones that hardly fit in my mouth at first). The one time I didn't do a good job with this my tongue felt like it was burnt so it seems worth trying. Like others have said, if you feel anything, let them know and they will slow the drip. Good luck to everyone!!!",
      "MessageIndex": 850,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 6, 2010 09:21PM Drim wrote:",
      "MessageIndex": 890,
      "PostDate": "06/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Aug 14, 2010 09:33PM Drim wrote: njbhwgirl - I was in Rio Grande and a resort called Sol Melia. My friend has a time share so 4 of us went. It's about 30 min east of the airport. I really enjoyed it! LauraM - I hope you are able to keep your eyelashes and eyebrows. I am 1 month PFC and still have my eyelashes. My brows started to fall out shortly after the last treatment. They are starting to fill in now but the eyebrow pencil looks pretty good. Good luck Wellsey66 - I voted for you too! And more importantly, congrats on the PET scan results!! x-raygirl - I love the picture. You are very pretty with the wig and bald. Sounds like a fun but exhausting party. I don't have any kids at all let alone little ones so both scenarios sound difficult to me. During my taxotere infusion I kept my fingers and toes cold with frozen peas. It seemed to do the trick as I have not noticed anything different about my nails and I am now 1 month post last chemo. I've had 4 or 33 rads and so far so good with that. Strangely I don't mind going every morning. It's really easy for me to get there and the staff and atmosphere are very nice. Can't wait for all of us to be done. We're getting to the finish line!!",
      "MessageIndex": 1287,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Sep 12, 2010 11:46PM Drim wrote: Hi May Sisters!!! I've been MIA for quite some time and a lot of good stuff has been happening I see.... PackJen - your hair is looking good! Paxton - I am beyond happy for you. You sound so much better and what a relief to be declaired cancer free. It makes the fight totally worth it! Leanna - One more to go is great. You have been through the ringer as well so thank goodness the end is near. How wonderful about reaching your Komen goal! You rock!! How great that you had this group to reach out to when you had questions or coordinating with your PS. Tess, Summer and Daiva - Congratulations on being done!!! Tess, your vacations sound wonderful. I'm so glad you were able to work out the rads schedule. You will be just fine on your vacation. njbhw - I'm crossing my fingers that the scans turn out fine. I know what you mean about seeing your doctor's number pop up. It freaks me out too. I'm still in for our Octoberfest Barb - welcome back. I was wondering how you were doing with rads. Funny that you asked about eyelashes. You and I were on a similar schedule and I am just now starting to notice thinning eyelash. My eyebrows are totally back. Wellsey - so exciting about your 'brush with greatness'. It must have been beyond exciting for you! Jenn - love reading your posts. It sounds like you are doing great!! Shrink tumor shrink!!! YAY!! Patricia - Paris! What a great gift to yourself and your sweetie! You sure as heck deserve this. Day - you are so creative!! GolferGirl - Just a couple more rads to go!! I still have 2 weeks left and the middle of my chest is a little red and bumpy. Other than that it is going well. Chris and Magda - Welcome to our group!! It is never too late to join. Magda, I'm 1/4 Czech (and 3/4 Hungarian). I only found out a few years ago about the Czech part. Both of my parents were born in Hungary so I just assumed all 4 of my grandparents were too but turns out my dad's mom (who died when I was like 6) was originally from Czechoslovakia. I have always felt an attraction to people from that country so I was very excited to find out about me and I would love to come and visit one day. As for me, the rads are going really well. I was fatigued at first - like week  2 or 3 but I really feel fine now. I'm going to start tamoxifen soon so that will be my new adventure. There is a test (genetic) that they do to see if you are a good metabolizer of tamox but my onc said it's starting to fall out of favor. Basically what she said to me is that the only alternative to tamox for me is ovary suppression. I'm already having hot flashes (not terrible) so I suppose if they get worse it means the tamox is working. Have a good evening everyone. Here to a great week!!!",
      "MessageIndex": 1523,
      "PostDate": "12/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Oct 18, 2010 03:54PM Drim wrote: Good morning my sisters! Jean - I'm definitely not laughing at you as I am a Mets fan as well. I am a diehard New York fan so I like the Yankees and the Mets but boy were the Mets hard to watch this year. I gave up at the end. Denise - I have to say the Rangers certainly deserved to win on Saturday night. They played much better all around than the Yankees so this should be a very exciting series. Did the walk yesterday - 5 miles - and feeling a little sore today. Will probably be worse tomorrow. A transvaginal U/S is an U/S of the cervix, uterus, ovaries, fllopian tubes and endometrial lining. I got the U/S before I started on the tamoxifen because tamox can cause a thickening of the endometrial lining (and probably other issues too). I wanted to get a baseline and make sure I have no issues to begin with. I guess if something does start to happen (and hopefully it won't) we know what to blame it on. Jenn - congratulations on being done!!! How very exciting for you.",
      "MessageIndex": 1751,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Nov 23, 2010 01:25AM Drim wrote: Paxton!!! That is such wonderful news!!! <insert happy dance>!!!",
      "MessageIndex": 1920,
      "PostDate": "23/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Dec 8, 2011 08:07PM Drim wrote: Hi Everyone! It has been ages since I've been on this site and I miss you all. I've been extremely busy with work and my apt. renovations. I did almost the entire apt. and now I'm doing what's left, which is my bedroom and closets. I'm definitely doing well healthwise. All of my checkups have been good. I've had a bunch of mammos and an MRI. So for me life is pretty much back to normal I'm happy to say. I can't believe it's been almost 2 years since diagnosis! nana, you asked about the cold caps. I was one of the people that did it and so was golfergirl. I think the caps worked out great for both of us. I finished chemo in July, dyed my horribly grey hair in October and then this June I started doing the keritan hair straightening because I did not like the texture of my hair. It wasn't great before chemo and I feel like it got worse. I lost maybe 10% of my hair at most and by March or so I probably had more hair than ever so I'm definitely pleased with that result.  Love you all! Happy Holidays!!! Ditah ",
      "MessageIndex": 2613,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Nov 7, 2010 10:18AM - edited Aug 20, 2013 06:07AM by Drim MTG - the opposite happened with me. The IHC from my biopsy came back borderline but the FISH came back highly positive. There was a long delay in testing between the IHC and the FISH so I asked for the lumpectomy tumor to be tested so we could make sure I was truly HER2+ before I went ahead with chemo and herceptin, and that came back negative via FISH. The doctors did not like that answer so they investigated further and determined that my tumor was heterogeneous with some parts of the tumor being HER2- and others being HER2+. Needless to say I was given the herceptin. Sarika - I hope they get to the bottom of this for your mom so she can receive all possible treatments that may work for her.",
      "MessageIndex": 12,
      "PostDate": "07/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/760298",
      "Title": "IHC 3+ but Fish inconclusive - what the f does it mean? sarika_for_mama Lowrider54"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jan 1, 2011 09:02PM Drim wrote: mdg - i was 43 at diagnosis with similar stats to yours except in the end it turned out I was HER2+. Even before we knew I was HER2+ 2 different oncs recommended chemo because of my age and health. Basically they said I was young and healthy and thought it was a good preventative measure that I would be able to tolerate well. I did actually have the oncotype test and it came back low intermediate so I was really struggling with the decision before HER2 made it for me. I ended up doing TCx4 with the H and I tolerated it very well. I had no real problems at all. Just felt a little 'weird' for a couple of days. I also did the cold caps which allowed me to keep my hair so I really didn't tell many people what was going on and since I looked normal nobody knew. Once you have all of your information in (onco score) you will have to make a decision that will make you comfortable in the long run.",
      "MessageIndex": 12,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762764",
      "Title": "If you were stage I, did you get chemo??? mdg SusansGarden"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jan 11, 2011 08:05PM Drim wrote: Bec9861 - FWIW I think the t-shirt is terrific. I haven't even had a mastectomy but can totally appreciate your sense of humor. I've read several of your posts and always find them to be informative and well written. Sorry your shirt almost made somebody vomit. dragonfly - congratulations! I'm glad you are doing so well. loving_mother - it's nice to see that you're feeling more relaxed. I went into the OR with a sense of humor and I think it helped ease my nerves a little.",
      "MessageIndex": 105,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762500",
      "Title": "Just Diagnosed :( loving_mother nwest125"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Dec 31, 2010 02:11PM Drim wrote: loving_mother - I have never heard of reconstruction after lumpectomy but I would imagine if you were to need reconstruction after the lumpectomy you would need to wait to see if you have clear margins. Did the BS tell you that you would need reconstruction with a lumpectomy? Have you had an MRI to determine if there is anything else going on in that breast? Sorry if you answered this already? With regard to reconstruction after radiation, it is true that it's more difficult to expand the skin. I finished radiation 3 months ago and the skin in that area looks and feels perfectly fine but who knows what the real deal is.",
      "MessageIndex": 57,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762500",
      "Title": "Just Diagnosed :( loving_mother nwest125"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 4, 2010 08:26PM Drim wrote: njbhwgirl: That is so sweet of you to offer. I think I'm finally all set with the things I need. If you ever need anything from the city please let me know as well. Welcome poohbear: So sorry to hear your story. It must be shocking but I'm sending you good thoughts. You will get through this! This group is great! golfergirl: Wow - we were diagnosed on the same day! We're almost in the same position except that today they confirmed that I am HER2+ so I will definitely be needing Herceptin. So now my treatment is a little up in the air until Friday! fotopet: As soon as I get the whole story I will let you know what my treatment is. Welcome all the newcomers!",
      "MessageIndex": 99,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 11, 2010 07:13PM Drim wrote: So today was the first day of Kemo and Cold Caps!  Familia was there for the durating of therapy!  Best Friend came for the Cold Caps application!  I enjoyed helping with the Cold Caps because I know how important my Gurls hair is to her!  I know familia and friends will be there no matter what!  My Dear Drim, don't ever doubt that your peeps will be there for you!  WE LUV YOU BEYOND!  I pray for my Best Friend and others that are going through this ordeal! Remember my dear friend we will be dancing through life and we pray for other to do the same!  I LUV U DRIM! ",
      "MessageIndex": 200,
      "PostDate": "11/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 14, 2010 07:06AM Drim wrote: Hi everyone - I'm on day 4 since first TC and I feel pretty good. The only real SEs I have are a cold sore at the top of my lip (yuck) and I'm feeling just a little fatigued. I'm doing the cold caps and I finally get to wash my hair today so maybe that will refresh me. I think drinking lots of water really did the trick so I'm glad to see that you ladies are doing the same. Let's hope for an SE free weekend for all of us!!!",
      "MessageIndex": 255,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 27, 2010 02:50PM Drim wrote: Day - so great to hear that you are feeling good. That was just awful what happened to you. Welcome Tuck - we are on the exact same schedule. I hope you're tolerating it well. I don't have a rads date yet but I'll probably start just around the time you are. Welcome to all the newcomers. Glad you found us.",
      "MessageIndex": 462,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 31, 2010 05:33PM Drim wrote: Hi all - haven't posted in a while. I have TC #2 tomorrow. I hope it goes as well as #1. Should be interesting tomorrow since all the Monday and Tuesday patients will be there due to the holiday today. Laying low this weekend trying to get all my water in and just here watching the French Open. I'm a big tennis fan although I have not played in a while. nanaof2 - sounds like you have a wonderful support system around you between your husband, sons and school staff. I'm sure that helps a lot. redbard - i'm so happy you doing so well be sorry that your son's team lost the baseball game in that fashion. Another one of my favorite sports - baseball. This is actually the first year in a very long time that I had to miss softball season. njbhwgirl - been thinking about you. I hope your mom is doing better! summer38 - what an amazing story about your coworkers/friends. I just kept thinking I wonder what the men were thinking. It's so nice to feel the love! Day - I bet you can't wait to get the new Onc. Its terrible what this doc has put you through. PackJen - you are so creative. Definitely sounds like the pressure is on to top yourself but it sounds like you will have no problem doing that. I am so NOT creative. I really admire you. JennyB - good luck with your CT scan. I had one a few years ago with the contrast and its not that bad. The stuff you have to drink is a little yucky but with all the stuff we've been going through it will probably be no big deal to you. Leanna - have fun at Disney. It's one of my favoirte places to go on vacation but definitely keep re-applying that sun screen. GolferGirl - Yikes - your period again. I keep wondering what's going to happen with mine. We are the same age and I got my period one week after TC#1. It was a little heavier than usual but not terrible. Lets see if my ovaries make one last stand. To all - I hope you're having a great memorial day weekend! I'll check in soon to let you know how #2 went. (((((hugs))))",
      "MessageIndex": 523,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 19, 2010 08:26PM Drim wrote: hi njbhwgirl!I think about you too. Congratulations on your graddaughter's christening. That's great that they were able to make it work for you!! I too ate a lot the 1st 2 weeks after Tx 2 but I think it's back to normal now. I gained some weight which is a combination of the eating and the bloating. The hair is actually doing really well. It's all there and I'm starting to get used to this whole - no styling it thing. The gray however is a different matter. I have lots and lots of gray hair and it's becoming impossible to do a good job covering it up. I'm just so thankful to have the hair that I don't even care. Yes, my team,hee hee (my mom and BIL) are doing great with the caps. They have it down to a science. Happy father's day to all those men supporting us fabulous women!!! ",
      "MessageIndex": 757,
      "PostDate": "19/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 16, 2010 10:56AM Drim wrote: So I'm finally resurfacing from my last chemo. The side effects were minimal but I feel so spacy - like I'm not able to concentrate at all. I try to read the posts and my mind just wanders. I sometimes wonder if it's the steroids. Packjen- Congrats on being done and thanks so much for posting those pictures. They brought a smile to my face! Redbarb- YAY!!! VACATION!! Have an absolute blast....and then the two of us it seems need to start improving our eating. I am terrible - always eating frozen foods, pizza and bagels (can you tell I'm from NYC). I need to get my hands on Cancer Fighting Kitchen as well!! Leanna- I have not officially congratulated you on your DH's job!! Thank goodness. Also, about rads, I'm not sure if I have the fight left in me to start arguing about the tattoos. My mom had BC a few years ago (LCIS) and she had rads and the tattoos so maybe I'll just give in and get them. Summer - so sorry about the Taxol reaction. Hopefully they do better next time. x-raygirl- NYC with your daughter!!! I hope you were able to enjoy yourself for the day. Were you able to take in anything or were you just too busy with the headshots. Patricia and Irishtess - hoping Taxol went well!!! Irishtess, I should be starting rads mid-August but still working out insurance issues so I don't have anything really lined up yet. YIKES! njbhwgirl - God bless you and your son. I can't imagine what this feels like but your son is a true hero. Now about Cape May - I am there!!!! fotopet - good luck with your final treatment. Don't be nervous - all good thought!!! You will be so happy to be done!! Wanted to let you know that I went to LGFB class yesterday. They gave us so much great stuff and the make-up woman did great with her demonstrations. I really did feel pretty walking out of there. However, I wish we had the opportunity to meet one another. They never went around the room and there were only about 8 of us. I'm off to follow up with the insurance people about my rad treatments. Have a great day!!!",
      "MessageIndex": 1008,
      "PostDate": "16/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 17, 2010 04:46PM Drim wrote: Jenny - I'm really pulling for you and hoping that soon you will have this all behind you. If I'm counting correctly, this Wednesday will make 3 weeks past your last treatment. From what I've heard, you may start seeing hair at about 3-4 weeks past last treatment so hopefully soon. East coast crew (and anyone else) - it sounds like we have a starting point for our gathering. X-raygirl - I live in Midtown west and work in Times Square. Would be nice to meet up with you if you have to be in Manhattan again. Did I mention I got my period again? I may have. It's really light like it was the last time so that means I'm expecting it to get really heavy again next week. I hope not but it just seems like a pattern. I know my RBC count went down a little from that but not too bad so I suppose I can handle it. I used to get really bad nosebleeds all the time and it never made me light headed so maybe I'm used to blood loss. Still - not fun at all.",
      "MessageIndex": 1015,
      "PostDate": "17/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 29, 2010 03:53AM Drim wrote: Leanna - I'm so sorry you're feeling under the weather. I only wish the best for you. I'm so glad that even though you are feeling crappy you have not lost your sense of humor - mosquito's cured of cancer - very funny! redbarb - welcome back from vacation!! We missed you! So glad you had a good time. With regard to rads, I just had my simulation on Monday which I thought was pretty cool. I was having insurance issues which delayed that for a while but I found out today that the insurance company settled with my health care provider so no more insurance issues!! YAY! Now I just need to finalize plans for my start date (hopefully 8/11) and my daily time. They wanted to give me 7:50am but that's the time I get up in the morning so I'm hoping to get a later time. I am very much an night owl and would sleep until noon if I didn't have to go to work. packjen - I think you've made us all hungry for banana splits! YUM!!! Kim - good luck to tomorrow - it's your last one!!! VERY EXCITING!! njbhwgirl - Rant all you want. I think your requests are totally reasonable. Patricia - good luck tomorrow. You have such a wonderful attitude. You are definitely an inspiration. Good night my friend! Pleasant dreams!",
      "MessageIndex": 1128,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Oct 21, 2010 04:48AM Drim wrote: I wanted to let you all know that tomorrow morning I will be taping a segment for Good Morning America on those penguin cold caps I used to save my hair. I'm really excited they are doing this but I'm also nervous about the whole thing. I only found out today and it's happening tomorrow morning so at least I don't have too much time to worry. Supposedly the segment will air on Tuesday 10/26 between 8am and 8:30am EST on ABC. I'll let you know how it goes and if anything changes. OMG!!",
      "MessageIndex": 1770,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Oct 21, 2010 06:51PM Drim wrote: Jean - I think the way this went down was that someone GMA got wind of the caps from the Rapunzel project (non profit org started by two woman from MN, one of whom was a cap user, in order to raise awareness and raise money for freezers). They recently donated a freezer to my chemo place. Since it's in NYC, GMA wanted to speak with my doctor and do the story there. So my doctor called me with questions since she is not the expert on the caps - she's the doctor...and by the end of the day she was asking me if I would be willing to be a part of the story. It happened so quickly. I had a blast. I was there for about 2 hours speaking with the crew and Juju Chang who is a wonderful person. I didn't feel that articulate today so hopefully it comes across okay. It wasn't so much that I was nervous but the words were just not flowing today.",
      "MessageIndex": 1773,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jan 4, 2011 08:07PM Drim wrote: Day - your hair looks amazing - really growing fast. I will check for the cording. i don't think I have it there but what you're describing sounds like the way my hamstrings always feel. I have no flexibility (can hardly touch my toes). I was even like that as a little kid. Jersey - I am BEYOND happy. I was praying and thinking about you every day with that hip. I have to say there is no way I would have been able to wait. I am the absolute worst at waiting for results. Good or bad I need to known NOW NOW NOW! Nice that you are coming to NYC. I saw Jersey Boys once and it is one of my favorite shows. I had a feeling you were talking about the Gansevoort when you said rooftop pool all year round. I didn't know they had one on Park Ave - I only know the one near Gansevoort street and I know it's spectacular - have always wanted to go up on that roof deck. I'm very excited for you.",
      "MessageIndex": 2036,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jan 4, 2011 08:08PM Drim wrote: Oh yeah - I don't think I have anything planned in May so I am totally up for meeting as many of you all as possible.",
      "MessageIndex": 2037,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Feb 1, 2011 06:31PM Drim wrote: Hi everyone! I am also back from my skiing vacation in Idaho. It was wonderful. I skied for 5 out of the 6 days I was there and I was suprisingly able to keep up. Barb - thank goodness everything is okay!!! What a relief Day - great to here that you have good news too. Tess - so nice to hear from you. It's been a long time. Daiva and Patricia - welcome back from vacation as well. Yay for vacations!!! Jersey - does sound like you sister's onc is cutting edge...but 1E does sound a little funny. Guess they are getting more granular with diagnosis now. Leanna, PJenn, Magda, Denise, Paxton, Kim, Laura, LJenn - I'm so thankful that you guys remain active on the boards.I miss Summer. Guess I need to connect with those of you on facebook. I changed my settings so you should be able to find me - Ditah Rimer. Beth - congratulations to us on making it to the one year mark and standing strong! I thought about the one year mark the whole week before and then when it got to the actual day I was so distracted by skiing that I completely forgot and didn't realize I missed it until I got home 2 days later. Hugs to you all!!! Ditah",
      "MessageIndex": 2151,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Feb 20, 2011 06:30PM Drim wrote: Hi everyone!! Once again its been a while but I have definitely been following...on my new iPhone. Wow, what a great toy this is. Up until now I've only had the old low tech flip phone (and on out of date blackberry for work) so I am a bit overwhelmed but I love it. packjen - I love disney. I hope you and your family are having a great time as I'm sure you are. paxton - I got a new mattress right before I started chemo because I thought it would be a good idea to be able to rest well but I didn't get anything fancy - just a good bed from Sleepy's. Maybe I should have gone with something more fancy.  You should definitely treat yoursefl as you so deserve it.  libraryjenn - Congrats on going back to work. I think that will be good for you. I was definitely fortunate to be able to work throughout my treatment and I feel like it helped me push forward and not allow myself to think about what was happening to me. Count me in with the HER2 group. I'll be having herceptin until the end of May. Leanna - I asked my MO about follow blood tests, etc. and she printed out the guidelines showing that you don't do that for Stage 1. I know that's not your stage so I would push for whatever tests you feel will put you at ease. I guess the issue is that if they test for stuff and there is anything that is the least bit suspicious they have to do follow ups and that could be stressful too so they prefer to wait until you present with symptoms. Crazy, I know. magda - love the picture. Glad you decided to post it. sacphoto - how fun about looking for venues for your daughter. ENJOY!! LauraM - I am so sorry to hear about your friend. That is awful news so it's no surprise you are thinking about recurrence. Daiva - that is an incredible and uplifting story. Thanks for sharing. How exciting that you are intimately involved in this. Yay for Emma. Happy Birthday Patricia and welcome back!! So I finally got my approval from the board to go forward with the renovations. This is going to be soooo much work. I'm not really nervous - just excited to get started. I've been busy at work but not too bad. I have tomorrow off for the first time ever (22+ years of working) because we got acquired by a new company and they give off for President's Day. I may be doing a news segment on those cold caps next week. If it materializes I'll let you know but I think it may just be a local news segment. I can't believe I'm coming up on my one year cancer free date (March 3). To all my other sisters - I'm thinking about you too and hoping you are well.",
      "MessageIndex": 2206,
      "PostDate": "20/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Sep 11, 2010 02:57AM Drim wrote: My best friend's mom has been stage IV for almost 5 years. I don't know all the details but I believe she was stage 1 originally, had a lumpectomy and radiation and was cancer free for 7 years. Then she was diagnosed with IBC. I certainly don't know all the treatments she's had but now she is on Doxil and herceptin. She said the cancer spread to her blood but I think it's contained in the blood. She is doing amazing. Her quality of life is great. She is in her early 70's. I hope the best for you all!",
      "MessageIndex": 48,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757548",
      "Title": "WANTED: STAGE IV FIVE YEAR SURVIVORS! MCTHO eag1954"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Apr 29, 2010 11:16PM Drim wrote: Hi all, I feel like I've been gone a while so I've just caught up on the goings on.  njbhwgirl:I did have my surgery at Beth Israel in NYC but I'm probably going to do my chemo at Weill Cornell on the east side. It just seems a lot nicer there and they are very supportive of the cold caps. There is a great thread in here on the cold caps (I don't know how to provide you with the link but if you google it, it will come up). I have not actually received the caps yet but I've spoken with the company and I've provided them with my information. I think I will get them next week. Feel free to PM if you want to discuss this further. Leah58: Congrats on being done. Thanks so much for stopping by here and giving us all so many great tips! JennyB: So sorry you are feeling crappy at the moment. Hopefully you will be feeling better soon!!",
      "MessageIndex": 50,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 3, 2010 10:49AM Drim wrote: Redbarb - Herceptin is an antibody that's given to patients that are HER2 positive. I will find out tomorrow one way or the other. If I need it I will get it infused once every 3 weeks for a year. The side effects aren't supposed to be that bad and the infusions take an hour or less (so they say). njbhwgirl - I'm sorry you won't be able to do the cold caps. It sure does seem like a lot of work. Since I live in Manhattan and don't have a car, my family has been running around like crazy trying to locate all of the things I need (dry ice, 2 gallon (hard to find) ziploc bags, special shampoo only sold in stores outside of Manhattan). Then my brother in law will be taking a day off from work and driving 1-1/2 each way to help me with everything. My mother will be doing the same. If it wasn't for my family there is no way I could do this.",
      "MessageIndex": 77,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 7, 2010 04:28AM Drim wrote: Day and Golfergirl - Good luck tomorrow!! Hope it all goes smoothly. PackJen and Laura: I'm so happy to hear things are going well!!",
      "MessageIndex": 138,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 12, 2010 06:57AM Drim wrote: Good morning everyone and welcome CTherese and Alice! You are always welcome. As you can see, my best friend took over my computer and posted last night. My family was great yesterday (day 1 of TCx4) and I'm happy to say that I'm feeling just fine. I know it may still be too early to tell as I go for my neulasta shot later today. The only advice I can give so far, just like everyone else says, is to drink a lot of water. I started my water routine 3 days before treatment. I made sure I had 8 glasses that day and the next and then stepped it up to 10 the day before and 11 the day of (plus they give you some hydration in the drip). They also gave me all the premeds beforehand - aloxi, benedryl, pepcid and the steriod. I also ate a little bit throughout the day. Then I took anti neasea when I got home. The craziest part of the whole day for me was definitely the cold caps. It was kind of hard but for the most part went smoothly. I also put my fingers and toes in frozen peas to help with nails and neuropathy - I did that during the Taxotere part (and a little before and after). I did nothing for my brows so I guess I'll have to deal with them someone.  nanaof2 - I'm glad you're feeling good as well. This group is fantastic! sunflower - great to finally hear from you. I'm glad you're doing well now. I'm sure next time they will give you benedryl up front. njbwhgirl and redbarb, mcshusi, and leanna - thinking about you and praying it all goes smoothly for you today/tomorrow!!",
      "MessageIndex": 206,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 16, 2010 01:23PM Drim wrote: Hi njbhwgirl! I've been waiting to hear from you. Sounds like you're doing well. It's seems like  most people tank on day 4. I feel like that was my worse day too (days 4 an 5) but really all I had was fatigue so I'm extremely grateful. I took the entire week off from work just because I didn't want to push myself not knowing what was going to happen to my body. I will be returning tomorrow. It will be nice to get back. Day 6 and doing well. Jenny: Thanks for the hair updates. I know it's stressful but you have a good sense of humor about the whole thing. You're the pioneer of this group so you're our glimpse into the future.",
      "MessageIndex": 289,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 22, 2010 05:18PM Drim wrote: njbhwgirl - so happy to hear you're feeling like yourself again. That's great! CTherese - I love your posts and so happy to see how well you are doing. That was amazing for KristyAnn to share with us. I don't know what I would do without this site. I would say by day 7 I was feeling totally like myself with very little side effects before that. Now I'm on day 12 and still feeling good so I'm hoping the same for you. I'm very grateful and hoping it stays this way. GolferGirl - welcome back. I think being busy at work is definitely a good thing. Makes you feel totally normal. I made it through the whole week of work no problem (days 7 - 11). faithfulc - thanks for stopping by! Have a good weekend everyone!",
      "MessageIndex": 394,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jun 1, 2010 12:56AM Drim wrote: Hi Jenny, Sorry you're having this issue. Maybe it has finally stopped now. Let's hope!!! I'm going to be 44 in a couple of weeks. They told me there was a good chance my period would never come back. I wasn't suprised to get it a week after Tx #1 even though it was a few days earlier than normal. I hope you will be able to get a good night's sleep tonight after all that baseball and I hope your kids had fun!",
      "MessageIndex": 525,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jul 5, 2010 01:24PM Drim wrote: Packjen and Golfergirl - good luck this week!!! Last treatment!!! I'm sure you must be so excited!! Do you have an appt. for your rad simulation? I may have an appt. tomorrow depending how insurance works itself out. By my guestimation I should be starting radiation around August 11th. Before that I go to Puerto Rico for a few days. My rad onc suggested I take vacation bewteen chemo and rads and the PR trip just happened to work out. Good luck to all of you starting your new chemo drug this week! LibraryJenn - congratulations on the port. Happy showering!!",
      "MessageIndex": 880,
      "PostDate": "05/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Aug 12, 2010 06:00AM - edited Aug 12, 2010 06:03AM by Drim Hi May Sisters!!! I'm back from Puerto Rico. I've been back for a couple of days but have been so busy ever since I got back that I haven't had time to read all the posts until now. I missed everyone but had a great time in PR. I started rads on Tuesday (got back from PR monday night). It's definitely too early to tell how I'm doing but really it's no big deal. About the tattoos, mine aren't as small as GG's but I have so many freckles (really sun damage) all over the place that I figured the tats would blend in. I was going to pull the Jewish card too but then decided not to be a rebel and just go for it. Maybe they will fade over time. Funny story...After a long day of traveling back from PR I was happy to grab my bag and head home. I finally got home ($60 cab ride) and realized I had taken the WRONG BAG! It was the exact same as mine and unusual so I couldn't believe it. So back to the airport I went. Can't blame that on anything but me! LauraM - congrats and good luck with your last chemo tomorrow!! YAY!! Leanna - I hope you're doing okay. That FB story was nuts. Don't people realize that if they post on FB everyone can see what they are doing. That's why I rarely post anything on there. The MRI story was every crazier. Good thing you are on the ball. RedBarb - How exciting about Extreme Home Makeover. I really never watch the show but once they did a makeover around the corner from me (I live in Manhattan so the makeover was to an apt. so it was nothing like your experience). I always wanted to do habitat for humanity. Sounds like you had a blast and I'll be looking out for you. Day - good luck with your ALND. Your hair stories are really funny. With regard to hair, so far so good with the eyelashes. They are all there. I have a few of old eyebrow hair still intact and a bunch of new growth but without eyebrow pencil it looks very light. I'm happy I still have no armpit hair but I totally have to shave my legs although not nearly as often. No sign of hair down there at all. I better get to bed now. Have to wake up nice and early to get to rads on time.",
      "MessageIndex": 1266,
      "PostDate": "12/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Oct 13, 2010 04:12PM Drim wrote: Hi Everyone...sorry I haven't had time to address everyone but I do address you all.....in my head....and I do keep up with the goings on. Daiva - rotated TE - oh my! But how fun is Vegas!! Jean - what a great idea to have everyone post updates! Okay, here is mine.... I finished chemo on 7/13, finished rads on 9/24, my company got acquired on 9/30, had my first day off in 3 weeks on 10/2, got my hair colored on 10/3 (very very happy with the results as it's made my hair feel back to normal - just a tad thinner), started tamox on 10/11 (i.e. 2 days ago). I will be on herceptin until the end of May 2011 but I'm not getting any side effects thank goodness. As usual I have to echo a lot of what Beth is saying. I feel really tired and moody but not sure if it's all of the work, the chemopause, the rads (can't really be the tamox yet). I am also feeling 'fat' although I'm really not fat - just feel kind of uncomfortable. I haven't even made an effort to loose weight but I do feel like I'm trying to eat a little healthier and my appetite seems pretty much back to normal. I'm going to start going back to dance class (jazz) in a couple of weeks now that I'm back in a real bra. The naturopath does sound amazing. None of my places offer that so I need to find one on my own (Beth, thanks for all the info). Oh yeah - got reading glass last week (I've always had great eye sight but I'm 44 now so I guess that had to happen sometimes). Jean - sending you hugs that you can keep up with your mom. It must be hard. Can't wait to meet all of you!!!! Ditah (Drim)",
      "MessageIndex": 1723,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Oct 16, 2010 06:54PM Drim wrote: Beth...your DMV eye test story cracked me up. The thought of people driving around with 'passable' vision. I wonder if my period is now around the corner as the 2 of us are traveling down such a similar path. Good luck with your color. I used 'organic' but who knows what that really means. I know it has no ammonia or parabens. Daiva....my parents are Hungarian but my mom lived in Israel for several years before I was born so although my name is not Israeli, the inspiration came from Israel. I guess I hesitated to post it because it is so unusual that it makes me easily identifiable and there are so many people I have not told about this. I just need to get over that. If people find out I guess it's fine. I just hate to be the topic of gossip. I know most people would not gossip about such things but there are always those few who do. Guess those are the types of people I don't need to associate with. Leanna....if I don't get on here before Wednesday I want to let you know that my thoughts will be with you for your sugery which I know will go really well. I'm sure you will be so happy to get past this next hurdle. Hope you're enjoying your very busy day. I'm doing the Making Strides walk tomorrow. I've been doing that for over 10 years. Can't believe I'm going to be a survivor this year. It's been 3 weeks since last radiation and the area seems to be clearing up nicely. I have some brown spots (think sunburn that turned dark that peeled but there is still some dark skin left over). I've now been on tamox for 6 days and don't feel a thing. I'm actually a little worried that I have not had hot flashes in almost a month. I'm worried that estrogen is fueling other cancer cells (which I'm really hoping do not exist). I'll give it a little while longer. I see my onc in a couple of weeks for my next herceptin and I'm sure we'll assess the situation at that time. On the suggestion of others on these board I had a trasvaginal ultrasound. The gyn called me with the results and said something like - 'it's amazingly perfect'. Sounded a little funny to me - but at least funny in a good way. I guess they don't normally do these things unless there is some kind of complaint. Have a nice weekend everyone....I'm gearing up for Game 2 of the ALCS - Yanks vs. Rangers. Last night's game was amazing. Yanks were down 5-1 in the 8th and scored 5 runs and ended up winning the game which ended at 1am. Very exciting!",
      "MessageIndex": 1742,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Jan 4, 2011 02:29AM Drim wrote: Happy New Year Beth and so nice to hear from you. I can't believe it. I am having soreness in my lumpectomy site and SNB site. I didn't have this at all until I got my mammo sometime around the end of October (surgery was also 10 mo. ago). It doesn't hurt - it's just sore and same thing with the SNB site - it doesn't hurt, it just feels tight if I really stretch it a lot (like try to pull my arm up and back. I haven't mentioned this to any of my doctors. I wasn't really worried about it - more just wondering how the healing process works. Maybe some nerves regenerated and we are having more feeling in the area. Hopefully this is totally normal.",
      "MessageIndex": 2031,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "Apr 29, 2011 04:00PM Drim wrote: My sisters!!!! I've been away for so long but trying to keep up with the posts. I just had to come back for you Jenn - to send you a big hug and all the positive thoughts possible. I am so sorry you have been dealt this blow but I'm hoping you can battle this like you've been battling everything else. Patricia - I'm so sorry to hear about your breakup. Cancer truly sucks! I'm sending you hugs as well. Yes, definitely getthat lump checked out - if just for peace of mind. I can't believe it will be May 2011 on Sunday. What a year. I have been out of my apt. for over a month during these renovations and I've been staying with my parents. It's actually been pretty good. Everything is wonderful except for the commute which is 1hr. instead of 15 min. I'm truly blessed to have such great parents thought. They are doing everything to make me feel comfortable. Jersey - perhaps we can try for a reunion (well actually union) this summer. Ditah",
      "MessageIndex": 2342,
      "PostDate": "29/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    },
    {
      "AuthorID": "Drim",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100589/profile",
      "Content": "May 19, 2011 06:18PM Drim wrote: Jenn - the story of your best friend touched my deeply. I was sitting here crying in my office thinking how much you must be loved. I think about you all the time and pray that you will be able to fight through this. Hopefully all of the love that's surrounding you is helping you to heal. Ditah",
      "MessageIndex": 2401,
      "PostDate": "19/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    }
  ]
}