{
  "AuthorID": "dsj",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
  "Posts": [
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "Mar 27, 2011 06:15PM dsj wrote: I just have to say that if you love Mick (and who doesn't?), you should read Keith Richard's \"autobiography\" \"Life.\". It is the funniest book I have read in a long time, and it's a testament to just how much the human brain can endure and still keep ticking.",
      "MessageIndex": 577,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766178",
      "Title": "Zappity Do Da - My WBR konakat konakat"
    },
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "dsj wrote: I am supposed to go for my dry run tomorrow and start Monday.  I woke up nauseated and a littler feverish; I think it's some kind of stomach virus.  Is there any reason why that would delay the start of radiation?  I'm going to call tomorrow and double check before I leave, but just wondering.  I really, really don't want to delay; I want to get on and done.  Dx 1/20/2010, DCIS, <1cm, Stage 0, Grade 2 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/751005",
      "Title": "Radiation while you have the flu? dsj dsj"
    },
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "Apr 9, 2010 03:10PM dsj wrote: Thanks all for the support.  I woke up feeling much better today.  I know it wasn't nerves, because I had a fever and my husband also had stomach cramps and fever, so probably some kind of 24 hour bug.  Also, (for reasons I cannot fathom), I'm not very nervous about radiation--though  I have been VERY nervous about other parts in the process. ",
      "MessageIndex": 5,
      "PostDate": "09/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/751005",
      "Title": "Radiation while you have the flu? dsj dsj"
    },
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "Feb 1, 2010 05:12PM dsj wrote: I would like to thank you Beesie, and indeed everyone, for your very helpful responses.  Beesie, I also read your response to Melissa in the \"starting to freak out\" post, and it really helped me put things in persepective.  Your pointing out that breast cancer specialists are also \"general surgeons\" made me go back and find out more about my first doctor.  Among the stuff I discovered was that he was a participant in an NIH funded study on SNB.  I do plan to ask him directly why his advice is counter what otherwise seems to be standard practice, but I have more confidence in his reply now.  I met with a radiation oncologist today, who agreed with both breast surgeons, confirmed my sense that lumpectomy and radiation was a good choice for me,  and who said that he thought I would do well, regardless of which treatment I ended up choosing.  (He actually sounded very positive, which is just what one wants to hear.)  Wednesday, I see one last oncologist; my PCP said if the two breast surgeons had different opinions, it sometimes helped to talk it through with a third specialist.  This has been a roller-coaster 2 weeks; but I feel like I do have more control over things now. Thank you to all who have helped me think all this through.",
      "MessageIndex": 4,
      "PostDate": "01/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/747604",
      "Title": "How to choose a doctor dsj dsj"
    },
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "May 20, 2010 03:10PM dsj wrote: I don't have an answer for you.  I did find out that, weird though it seems, there is no standard way of reporting pathology.   I think, though, that intermediate grade and no comedonecrosis are both favorable.  Here's a link where people discuss the terminology.  Sorry I don't have more definitive answer; maybe someone who does know can help.  http://community.breastcancer.org/topic/68/conversation/701836",
      "MessageIndex": 1,
      "PostDate": "20/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/752889",
      "Title": "DCIS--Confused about Pathology epink epink"
    },
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "dsj wrote: I was just diagnosed with DCIS low-intermediate grade.  I had suspicious calcifications on follow-up mammogram, then stereotactic biopsy that diagnosed the DCIS, the MRI that confirmed DCIS in right breast that showed up on mammogram but nothing else on right breast and nothing on left breast.  I have met with two doctors, who basically have given me the same advice: prognosis is very good, lumpectomy with radiation is a good option for me.  I actually feel pretty good about what I have heard.  I am trying to keep it all in perspective, and feel like I have probably (at least so far) gotten the best news I could have gotten for someone with breast cancer.  My dilemma now is trying to choose which doctor.  I met with one doctor, a general surgeon who does a lot of breast work and who was recommended by my ob/gyn and primary care physician (whom I trust a lot).  He works with multidisplinary breast cancer center coordinated through one of the hospital networks in my city.  I liked him a lot.  He seems a little more conservative than the second doctor I met.  He ordered the MRI and said that when he did the lumpectomy he would do a SNB because the DCIS was intermediate grade.  He referred me to a radiation oncologist that also works with breast cancer center and who I meet with tomorrow.  The second doctor I met with is the Director of the Multidisciplinary Breast Cancer City at the medical school.  Her center is accredited by the National Accreditation Board for Breast Centers.  (Not exactly sure what that means, but the med school made a big deal about it.)  She knew the first doctor.  She is a breast cancer specialist but she's also an administrator and interested in public health.  Coming at it from a kind of epidemiological perspective I think.  She said MRI and SNB were not necessary. Otherwise, she agreed with first doctor.  I talked to my PCP, and he said that he tended to be conservative too, and that if it were his wife, he would want the MRI and SNB.  In the end, I had the MRI, because my PCP physician thought I should, the surgeon thought I should, the radiologist who gave me the pathology thought I should, and I thought I should.  Thankfully, it came back clean except for the DCIS.  So in the end the high-power doctor was probably right:  I didn't really need it.  However, I feel like it gave me a huge amount of relief.  So here is my dilemma: do I go to the clinical surgeon who has good recommendations from everyone I've spoken to and who is treating me more conservatively (which I like), or the breast cancer specialist who is affiliated with the more high-powered breast cancer center.   I feel like I have a fairly uncomplicated diagnosis and am leaning toward the general surgeon because his philosophy is more in line with mine and because my PCP thinks so highly of him.  But then I get worried because I generally really value expertise, and wonder if I'm nuts to throw away an opportunity to be treated by a dedicated breast cancer specialist.  (Sorry this is so long; I kind of thought it out as I wrote it) Dx 1/20/2010, DCIS, <1cm, Stage 0, Grade 2 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/747604",
      "Title": "How to choose a doctor dsj dsj"
    },
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "Feb 3, 2010 01:33PM - edited Feb 3, 2010 01:37PM by dsj Beesie, Thank you so much for all the links.  I read them all, plus the NIH Conference Statement on DCIS at http://consensus.nih.gov/2009/dcisstatement.htm  The general opinion definitely does seem to be no SNB for DCIS.   Today, I met with an oncologist.  He spent about an hour with me and my husband, talking through all of it.  He said he had worked with both surgeons and that either one of them would be fine (I know the surgery part of it is very uncomplicated).  But he said definitely no SNB.  If the pathology came back invasive after the lumpectomy, then yes.  But not til then.  I told him I didn't kow how to choose a surgeon, because I felt like choosing one of them over another was really choosing who would be coordinating my treatment and following me up.  He said that would be him, not the surgeon.  He would coordinate treatment and follow me for at least 5 years.   He also said that he definitely would recommend all-breast radiation, not mammosite; the data are better.  He talked about tamoxifen after radiation and whether I should be tested for Braca (probably not). And he said he wanted me to meet another radiologist who, he said had state of the art technology.  And he said with radiation, it's really about technology. He said I should also consult with her (radiologist) about surgeons.  So, I am kind of back at square one.  I now am waiting to schedule an appointment with a second radiologist and after that maybe another surgeon.    I liked him, the oncologist.  He is in a really serious practice in a cancer center; vvery well thought of in the community; my PCP recommended him; and it makes sense to have an oncologist (rather than breast surgeon) \"in charge.\"  So I guess this is how I'm leaning at the moment.  I realize I am really lucky: I have access to high quality medical care and I do not have a really serious diagnosis (being at a cancer center really drove that home), so I'm going to try not to fret.  But I really do want this part to be OVER.",
      "MessageIndex": 6,
      "PostDate": "03/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/747604",
      "Title": "How to choose a doctor dsj dsj"
    },
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "Aug 20, 2010 02:03PM dsj wrote: As everyone says, most BIRAD 0 classifications turn out to be nothing.  Also, many (most) people have microcalcifications, and 80% of the time they are completely benign.  And even if they do turn out to be something, it means you have caught it very early.  Completely understand your anxiety, but the odds are definitely in your favor.  If you can, try not to think too much about it til Monday.  Nothing  you do this weekend (including worrying) is going to change anything. ",
      "MessageIndex": 11,
      "PostDate": "20/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/756961",
      "Title": "Microcalcifications and more exams Maakmezorgen reneedjones"
    },
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "Apr 17, 2010 03:00AM dsj wrote: I think in general they do not radiate the same area more than once.  So yes, radiation is a one-shot deal for almost all of us.  However, radiation can decrease your chance of a recurrence by 50%.  And since half of recurrences come back as invasive, this can be a serious consideration.   The decision whether or not to have radiation is based not only on your margin status, but also your age and the grade and size of your DCIS.  You need to talk these through very carefully with your physicians (breast surgeon and radiation oncologist) and find out exactly what your risk of recurrence is before you make any decisions.   Good luck. ",
      "MessageIndex": 5,
      "PostDate": "17/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/751330",
      "Title": "Radiation Treatment Debwa100 kittycat"
    },
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "Sep 14, 2010 11:01AM dsj wrote: I have had red bumps on my breast before, during, and after radiation.  Mine are itchy sometimes (but not always).  My rad onc said they were damaged sweat glands and that they are not uncommon for women, even those who haven't had radiation.  They generally appear in the folds beneath or between the breast.  I think there are lots of reasons why they could be there other than skin mets.  But I always tell myself if I'm worried, it's better to ask.  ",
      "MessageIndex": 1,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757984",
      "Title": "Red bumps 18 months post rads JacquelineG oaklandish1"
    },
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "May 4, 2010 05:34PM dsj wrote: I've been using Jean's Cream (radiation cream, ordered on the internet), as recommended by radiation oncologist.  So far (17 out of 25 treatments, including concurrent boost), and no side effects.  However, I don't know if it's the cream or just lucky. ",
      "MessageIndex": 4,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/752180",
      "Title": "Creams and lotions and gels--oh my! ghostie suzieq60"
    },
    {
      "AuthorID": "dsj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96713/profile",
      "Content": "Mar 23, 2011 05:58PM dsj wrote: Baruch dayan ha'emet",
      "MessageIndex": 45,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766537",
      "Title": "Olga Simkin Z\"L leprechaun Bestbird"
    }
  ]
}