{
  "AuthorID": "duchessofte…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
  "Posts": [
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "Apr 17, 2018 12:08PM - edited Apr 17, 2018 12:10PM by duchessoftea I was diagnosed in Jan. with mets to my left adrenal gland. Originally diagnosed Oct. 2016, right before my 43 birthday, went through chemo, then dmx, I had a clear PET in May 2017 but 7 months later a new tumor appeared on my left adrenal gland:( I have tried every AI and cannot tolerate any of them...so I am currently looking into alternative therapies...",
      "MessageIndex": 522,
      "PostDate": "17/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "Mar 26, 2018 09:36AM - edited Apr 17, 2018 12:12PM by duchessoftea",
      "MessageIndex": 511,
      "PostDate": "26/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "Mar 28, 2018 09:51AM duchessoftea wrote: Thank you, Nel! I am grateful to connect with you ladies on this crazy journey. I am super glad to hear that your oncologist said the same thing as mine in reguard to not removing the tumor. I also wanted it gone! But we are treating it instead. I am hoping that your upcoming scan is tumor free and you can go back to your NED status!!!!! I am ER+/PR+ her2- so our treatment is different. Please keep us updated with your scan....I will be thinking of you!!! Blessings, Michelle:)",
      "MessageIndex": 4,
      "PostDate": "28/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863532",
      "Title": "Anyone diagnosed with adrenal gland mets? duchessoftea Stilts"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "Apr 19, 2018 03:55PM duchessoftea wrote: So sorry, Nel!!! I want to move out of my area but don't want to leave my oncology team, so I know how you feel. Prayers and virtual hugs for you!!! I have not had the adrenal tumor explained like that, so that is really interesting!! Michelle",
      "MessageIndex": 10,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863532",
      "Title": "Anyone diagnosed with adrenal gland mets? duchessoftea Stilts"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "Apr 25, 2018 12:06PM duchessoftea wrote: So sorry, Nel. I hope your new oncologist is wonderfully supportive of all of the decisions you feel like are right for you. My oncology team felt like a FNB was not a good way to go for me. The risks outweighed the benefits. The surgeon and radiologist felt like the PET was conclusive for BC mets and the risk of spread and hurting the kidneys were not worth the risk initially. They wanted to start treating me and see if it responded to treatment. If not, they would biopsy. It did initially to the AI meds but I could not tolerate them so now we are starting IV chemo again on May 10th. Going to do that for 6 months and hopefully with no spread, be in remission, and then have the adrenal removed. So we shall see....I am praying that I don't lose my hair:) I just got it back!! Michelle",
      "MessageIndex": 16,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863532",
      "Title": "Anyone diagnosed with adrenal gland mets? duchessoftea Stilts"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "Apr 17, 2018 02:59PM duchessoftea wrote: alwaysbepositive, Keep us updated on your progress...I am curious how your Arimidex experience is going...I could not take it for terrible side effects. I hope you are able to tolerate it well. Blessings:):) Michelle",
      "MessageIndex": 6,
      "PostDate": "17/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863532",
      "Title": "Anyone diagnosed with adrenal gland mets? duchessoftea Stilts"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "Apr 19, 2018 04:01PM duchessoftea wrote: Wrenn, Mine was found on a PET/CT scan in Jan of this year. It was so dark, they did not even biopsy it, they knew it was bc mets. They did test my for all of the adrenal cancers, though and all were negative. I was put on Femera and it shrunk a tiny bit in about 6 weeks. My oncologist took me off Femera because it was raising my blood pressure and making it where I could not walk:( So I am not on anything right now. Taking a million supplements and hoping for the best. I just got done reading, What your doctor's not telling you about Breast Cancer\" by Dr. John Lee and it was really interesting....started taking natural progesterone and hope to feel better soon. Michelle",
      "MessageIndex": 11,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863532",
      "Title": "Anyone diagnosed with adrenal gland mets? duchessoftea Stilts"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "Apr 19, 2018 04:03PM duchessoftea wrote: Jenny (alwaysbepositive), I had those as well. Bone was horrible but my kidneys started bleeding and had to stop taking it. Praying it will work for you and the side effects will get better! Hugs, Michelle",
      "MessageIndex": 12,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863532",
      "Title": "Anyone diagnosed with adrenal gland mets? duchessoftea Stilts"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "Mar 27, 2018 11:47AM duchessoftea wrote: Thank you so much, Kkrenz:) I have been been put on Arimedex and my onc is talking about adding Ibrance. So far on Femara the tumor has shrunk some. Had to come off Femara because of joint damage so just starting this other. I'm 44 so I need to be able to walk:) Glad your tumor is gone and hope you don't have any others!! Did you have symptoms with the adrenal tumor? It is my only mets and was having severe fatigue....and a horrible skin rash.",
      "MessageIndex": 2,
      "PostDate": "27/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863532",
      "Title": "Anyone diagnosed with adrenal gland mets? duchessoftea Stilts"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "May 10, 2018 08:44AM duchessoftea wrote: Nel, I so agree!! Have a great day:) I start a 6 month round of Abraxane today....hopefully it will be over after this!!",
      "MessageIndex": 20,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863532",
      "Title": "Anyone diagnosed with adrenal gland mets? duchessoftea Stilts"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "May 24, 2018 11:40AM duchessoftea wrote: Hi Vania, My mets were only to the left adrenal per my last scan in January. The tumor was around the 2.5cm mark. At first we tried AI's like Femara and Arimidex but the side effects were so bad. The tumor did shrink some while on those but I have since started Abraxane IV chemo. I have not been scanned since starting so I am not sure where I stand. As far as the function of the glands, I am not sure about that either. We have not talked about it. My oncologist is hopeful that this chemo will wipe it out and then have the adrenal gland removed in 6 months. We have not discussed radiation, probably since I have just started IV chemo treatment. It is really rare and I am my oncologist only patient that he has had that breast cancer has mets to adrenals first without going anywhere else. Even taking it out is rare even for adrenal cancer. So I understand the lack of information. Please keep us updated and I will as well with this new treatment!!! Blessings to you and your English is wonderful:):) Michelle aka Duchess of tea:)",
      "MessageIndex": 22,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863532",
      "Title": "Anyone diagnosed with adrenal gland mets? duchessoftea Stilts"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "Jun 2, 2019 09:53PM duchessoftea wrote: Hi Stilts and Nel, When I was originally diagnosed with left adrenal mets the surgeon did not want to operate on me because the consensus was more mets would show up and it would be a unnecessary surgery. Well, a year went by and no mets anywhere else and after treatment during that year of hormone therapy and IV chemo ( which did absolutely nothing), I did not have any additional cancer spread. But last December the tumor started growing rapidly and became the size of the my adrenal gland in a matter of weeks and I had to get my adrenal gland removed. I chose not to have a biopsy as all of the doctors and surgeons felt like it couldn't be anything but BC mets. The surgeon felt like it was to high risk to have it biopsied and so I didn't. When they took the tumor out it was confirmed as the same cancer that I had originally. I am getting scanned again in a couple of weeks but I am doing great. Femara worked really well for me and actually did better that abraxane chemotherapy. I am not on any new treatments as they all make me ill and as long as I am doing well with no new mets, I am just going to enjoy life. I am taking one Femara a week. I just cannot take it anymore than that as my joints have just taken a severe toll from it. My cancer was different from you, Nel, as I am ER/PR+ HER2-. So our treatment protocols are not the same. I would look into all options, Stilts. I have felt so great since getting my adrenal gland out....I wish I would have done it sooner....",
      "MessageIndex": 28,
      "PostDate": "02/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863532",
      "Title": "Anyone diagnosed with adrenal gland mets? duchessoftea Stilts"
    },
    {
      "AuthorID": "duchessofte…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252844/profile",
      "Content": "May 7, 2018 02:09PM duchessoftea wrote: Nel, My onc and surgeon explained the tumor as a BC mets that is no different than it going to the liver or anywhere else. They did not understand the rationale of the adrenal tumor doing its job and catching the cells? So I guess different doctors have different opinions....So the plan is to treat with IV chemo for 6 rounds and then remove just like they did the original tumors in lymph and breast as long as there is no spread anywhere else....",
      "MessageIndex": 18,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863532",
      "Title": "Anyone diagnosed with adrenal gland mets? duchessoftea Stilts"
    }
  ]
}