{
  "AuthorID": "Duffys_Mom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275360/profile",
  "Posts": [
    {
      "AuthorID": "Duffys_Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275360/profile",
      "Content": "Jun 26, 2018 06:50AM Duffys_Mom wrote: Thank you for the suggestions. I am sure before this has healed I will have tried them all. I definitely like having a front close bra. On my first day back to work I put a nursing pad between the area that I have the stitches and my bra. It started out fine but began to rub. Today I think I am going to try to cut my bra away from the area. Right now it is just so sensitive - still using ice on it at lunch time. Thank you for the wonderful suggestions Duffy’s Mom",
      "MessageIndex": 4,
      "PostDate": "26/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865420",
      "Title": "Postop sentinel node surgery suggestions needed for bra Duffys_Mom Duffys_Mom"
    },
    {
      "AuthorID": "Duffys_Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275360/profile",
      "Content": "Jun 27, 2018 10:41AM Duffys_Mom wrote: Thank you Kidgo for the suggestion. Front close bras are my new best friends. I think part of my problem with the bra was that it hit exactly at the stitch spot and pulled on the steri strips. I bought some inexpensive front close sports bras and cut them down and that seems to work for now",
      "MessageIndex": 6,
      "PostDate": "27/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865420",
      "Title": "Postop sentinel node surgery suggestions needed for bra Duffys_Mom Duffys_Mom"
    },
    {
      "AuthorID": "Duffys_Mom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275360/profile",
      "Content": "Duffys_Mom wrote: Hello everyone. I am needing some help and hopeful someone will have suggestions I am postop day 2 from sentinel node surgery and can’t seem to find a bra or camisole that doesn’t hit the area under my arm and causes pain. It is right where a bra or camisole or tank hits my arm. I work in an office so no coverage would not be a good option. I am a C-D cup and breast from lumpectomy becomes sore without support also. My front close sports bras have worked for the lumpectomy but now do not work for the sentinel node removal. Any suggestions? Thank you Duffy’s Mo Invasive or Infiltrating Ductal Carcinoma (IDC) - June 1, 2018 Left, 1.4cm, Grade 2, ER+/PR+, HER2- (FISH) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865420",
      "Title": "Postop sentinel node surgery suggestions needed for bra Duffys_Mom Duffys_Mom"
    }
  ]
}