{
  "AuthorID": "Dulcigirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
  "Posts": [
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Dulcigirl wrote: I do not (yet) have LE. I'm grateful to you all for sharing your advice and experiences. I'm trying to learn and follow the precautions and then see what happens. My BMX was a week ago. My right armpit is numb/weird/painful and that is my most at risk side. I had read not to shave with a regular razor due to the risk of nicks/cuts. I tried using my electric razor on Monday. 1) I'm not allowed to lift my arm above shoulder height yet so I couldn't see, and 2) I sure couldn't FEEL what was happening. That led to FAR less than stellar results. Yuck. So, I'm really grateful I have fall and winter to figure this out, but how do you all handle this? Obviously electrolysis and waxing would be out. What about laser hair removal? Is that risky or safe? \"I believe in being strong when everything seems to be going wrong. I believe that happy girls are the prettiest girls. I believe that tomorrow is another day, and I believe in miracles.\" ~ Audrey Hepburn Dx 9/12/2012, IDC, Stage I Surgery 10/15/2012 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery 2/13/2013 Reconstruction (left); Reconstruction (right) Surgery 10/21/2013 Reconstruction (left); Reconstruction (right) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/795416",
      "Title": "To shave or not to shave.....THAT is the question!!! Dulcigirl Dulcigirl"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 28, 2012 01:56PM Dulcigirl wrote: I assumed no waxing because of a few sites I found online cautioning against the heat and possibility of infection. But those sites pretty much bashed ALL hair removal techniques to some degree. That's why I posted here. I was hoping those with access to LE specialists would have info regarding the safest way to go. My doctor said my risk was so low she wouldn't be referring me to one. What I've learned from reading posts here is that there is a big difference between \"low\" and \"no.\" Funny, because she told me no needles or BP ever on that side, but I don't have enough risk to go talk to the specialist. I may pursue it anyway. Thanks for all of the tips! Oh! Years ago I did some laser hair removal. The first visit is never that impressive. It takes a few times, but I had great results from that. If that's safe I would definitely start saving my pennies for it.",
      "MessageIndex": 9,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/795416",
      "Title": "To shave or not to shave.....THAT is the question!!! Dulcigirl Dulcigirl"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Feb 9, 2013 09:47AM Dulcigirl wrote: I don't know if this will help with your \"how much time off\" question, but my excisional biopsy was not super deep. i had one on each side and about two weeks after it I did a 30 mile bike ride. You will be sore and you will not want anyone to bump you, but your doctor should be able to answer the question of when you can return to work. Best wishes for good results. Try not to assume the worst, but there is nothing wrong with starting a list of questions as you think of them!",
      "MessageIndex": 8,
      "PostDate": "09/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800132",
      "Title": "Excisional biopsy. SueInMN fresitabr787"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "May 18, 2013 05:56PM Dulcigirl wrote: Linda, Not sure if it would work for you, but I have a glove rather than a gauntlet. When I need to do personal hygiene, etc. I can put a disposable rubber glove over it to keep everything clean. I read that tip on one of the threads here.",
      "MessageIndex": 7,
      "PostDate": "18/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/804802",
      "Title": "So tired after MLD, really upset about dx of LE Embemma Jwright"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "May 17, 2013 11:34AM Dulcigirl wrote: Lily, I do completely agree with this: \" I just believe that anyone in the public eye has a huge responsibility to share information wisely and if they do not know then to get their staff to research it properly as their words have power and impact way beyond our own.........\"",
      "MessageIndex": 86,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/804660",
      "Title": "Angelina Jolie's prophylactic surgery JoanQuilts SusansGarden"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 7, 2013 04:15PM Dulcigirl wrote: Oh, Stephanie, I'm SO sorry you find yourself faced with all of these decisions and worries. This site is such a great place for support and info! I would encourage you that once you have your surgery date you should join the group for surgeries in that month. You'll also want to join the reconstruction threads for whichever procedure you end up going with. I can't answer all of your questions. I can just share my own experience. When I met my surgeon to discuss my options she immediately told me that I would only be a candidate for implant reconstruction as I was too thin to have enough tissue to make two breasts. Be prepared for that. Also know that your particular surgeon may have a preference. Not all surgeons do all types of recon. you may have to shop around for a surgeon who can do the type you want, but be very sure he/she has a lot of experience performing that type of recon. I had my BMX and tissue expanders were placed at the same time. I do not think I drove for 4-5 weeks. It took a couple of weeks before I could get out of bed or out of the recliner without help or loads of pain. I gradually got stronger and also gradually got the anesthesia out of my system. It took about 6 weeks to really feel like myself again. Meanwhile my tissue expanders were being filled. I didn't have much trouble with that process, but I did have to sleep sitting upright in our recliner for 3-4 months. I had my exchange to implants in February. My silicone round mplants look quite natural. I'm pleased with the shape and feel of them. Two weeks ago I had a revision to smaller, different styled implants. I feel much better with these and am ready to move on. In a few months I will get reconstructed nipples and then a few months after that I will have areola tattoos. If things go as planned I will be done about 1.5 years after I started. Candidates for nipple sparing will not take as long I'm guessing. I chose not to keep mine. I think what you need to know is that it can be a lengthy process even if all goes smoothly. I do not know how differently a completely prophylactic experience will be. Hopefully some ladies can chime in on that one! Keep asking questions and keep reading here! Explore the different recon threads, but do keep in mind that there is a greater percentage of \"problems\" posted. Many women that have positive experiences don't hang out on the boards. So please don't assume that everyone has a negative experience! But it is good to know the risks. I wish you all the best! It's not an easy thing, but there are LOTS of women walking around us every day that have been here, done that, got the t-shirt and are still smiling!!!! Hugs to you!",
      "MessageIndex": 1,
      "PostDate": "07/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/814179",
      "Title": "Prophylactic Mastectomy questions sdekans1 hopedreams"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jan 1, 2014 10:57AM Dulcigirl wrote: The things I remember using at the hospital in addition to what Susie said: Battery operated toothbrush Wipes to clean my face Chapstick!!!!!!!!!  And be sure to start some regimen to help fight the major constipation. (Stool softener, prunes, etc.)",
      "MessageIndex": 6,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/816358",
      "Title": "Mastectomy with reconstruction coming up....VERY NERVOUS 1MindyydniM1 Skiergirl"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 24, 2013 07:39AM - edited Nov 24, 2013 07:39AM by Dulcigirl I love biking. I mainly ride Rails-to-Trails...so some rough spots, mainly gravel/crushed limestone/dirt. My first exchange ended up being too big. I rode through the summer with those in. Totally doable! I realize what you do is more strenuous. I just had a revision to smaller implants and LOVE them. The only issues I had with biking is that if I gripped extra hard or only had one hand on the bars my pec contracted and felt kind of weird. Still doable!! But that issue has gotten better too with the smaller size. I know with mtn biking you have more more weight on the bars, so the pec thing might be a bit more of an issue. But it never has hurt, just feels a bit odd. And you may want to try to stay close to your current size just so stuff doesn't get in your way. ;-) Of course all of my experience only applies to my type of recon. I did bmx to TE's to implants. I did not ride during my TE phase as it happened to be over the winter.",
      "MessageIndex": 12,
      "PostDate": "24/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/814179",
      "Title": "Prophylactic Mastectomy questions sdekans1 hopedreams"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "May 16, 2013 04:17AM Dulcigirl wrote: Another thought I had regarding the \"tiny scar\" comment: I was with my mom when she had her first diagnosis and mastectomy 26 years ago. That surgery was done by a general surgeon. Mom did not have reconstruction. Went through my mom's second diagnosis and mastectomy about 8 years ago. Again, no recon. The cosmetic difference between those two surgeries was quite vast. And then my own BMX this past fall, performed by a good breast surgeon and closed by my PS after he placed TE's.... My scars, though the line goes from near my armpit, across each breast probably 3/4's of the way ARE tiny in comparison to my mom's first surgery. Angelina's nipple sparing scars would be even smaller/less noticeable. I do not know when her mother had her mastectomies, but the comparison to what she saw on HER mom quite possibly matches my experience. When I chose to go with a double mastectomy following a very early IDC catch, I chose so with the image of my mom's first surgery results. I have been pleasantly surprised by my results. Not perfect, not the real thing, not something I would wish on anyone.....but vastly better than what I had anticipated.",
      "MessageIndex": 54,
      "PostDate": "16/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/804660",
      "Title": "Angelina Jolie's prophylactic surgery JoanQuilts SusansGarden"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 6, 2012 06:58AM Dulcigirl wrote: Well, yours are probably with mine somewhere....I'm wearing a long sleeved t today. Gutsy move!! But it's ok.....camouflaged my MIA parts with a beautiful bulky scarf!! Get your sweater back out another day and throw a scarf on it!!",
      "MessageIndex": 494,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 8, 2012 01:51PM Dulcigirl wrote: I actually found this website because my BS told me to come here. She actually specified \".org NOT .com\". Lol. I've been so grateful she said that! I never had steri strips this time. (I did for the biopsies.) I had three layers of stitches, according to my PS and a long piece of tape across each incision. They took the tape off at my one week appt. I'm chanting \"all four drains,\" too, mgdsmc! Everybody stay positive....one day at a time!",
      "MessageIndex": 538,
      "PostDate": "08/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 22, 2012 01:45PM Dulcigirl wrote: You too, Grier! I got a med alert bracelet for no needles/no BP on my right arm, the back side has 3 beads that have \"faith, hope, love.\" Love that verse! Thankful for you all today and every day!",
      "MessageIndex": 687,
      "PostDate": "22/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 26, 2012 09:51AM Dulcigirl wrote: Go Xanax!!!! :-)",
      "MessageIndex": 715,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 29, 2012 08:07AM Dulcigirl wrote: Good for you, Connie!!! Go team!! :-)",
      "MessageIndex": 735,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jan 4, 2013 10:51AM Dulcigirl wrote: I agree, Connie. Haven't watched it and am not interested right now. Walked it with my mom, my grandma, and now walking it myself. If the tv is on I like Wheel of Fortune or the History channel. Lol. I hope your next 12 days are great and that #3 is easier....",
      "MessageIndex": 887,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jan 16, 2013 06:26PM Dulcigirl wrote: My only choice was implants. Sometimes the choice is made for you! If you go to the Reconstruction portion of the message board you can read TONS of people's experiences. Just keep in mind that yours may be similar, but will still be unique. I never realized how many things factor into the equation of what to do/how to do it/when it happens/how it turns out, etc, etc!!! It's quite amazing. Ask anything you want...we're all here to help each other out!",
      "MessageIndex": 919,
      "PostDate": "16/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Feb 22, 2013 12:25PM Dulcigirl wrote: Just seeing this now. Connie, how are your fingertips doing? How is everybody? Hanging in there? Hope so!",
      "MessageIndex": 948,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "May 30, 2013 11:50AM Dulcigirl wrote: So, so sad....for the family, for the baby,....and for how she must have been feeling so lost and sad. But, mg, knowing you as we do I know you were kind to her. If her own family had no idea she must have been extremely good at hiding her depression. Prayers for you all...for healing and for happiness.",
      "MessageIndex": 999,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 7, 2012 02:20PM Dulcigirl wrote: Just got home from an after-church shopping trip. I picked up one of those big weird cushion things that allow you to basically sit up. Plus I'm hoping it will keep DH from accidently trying to snuggle. Scary. I also went to Kohls to get some loose tops or layered stuff. I really am not sure what TE's allow you to wear. I usually wear t's or sweaters that aren't super tight, but they would definitely show unevenness and lumps. Of course I had a mini-meltdown in the dressing room. I'm finding I'm really strong/tough and able to joke with people.....but leave me alone in the shower, dressing room, car and you'd best have the tissues handy. First thing when I wake up is hard too. Like someone said above: having a date for surgery makes it more \"real.\" Anybody know what the TE's are like look/shape-wise? How much will they need to be camouflaged by loose shirts, layers, scarves, etc? Thanks so much for being out there!!! It helps to not be facing it alone.",
      "MessageIndex": 75,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 15, 2012 12:34PM Dulcigirl wrote: It is odd to be counting down. Scary. I will be leaving my house in 14 hours. I'm leaving it pretty clean, too! If I slow down and think at all I start getting anxious and jittery. Hoping I can post back quickly in a few days \"after\" so that those of you on for next week can feel less nervous. (I know. \"Yeah, right!!\") Deep breath.",
      "MessageIndex": 142,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 19, 2012 07:23PM Dulcigirl wrote: I feel pretty tough tonight. Faced my fear and pulled out the empty pain pump tubing by myself! I had planned to call my friend (a doctor) over to do it, but just still feel too private about my new chest. I'll get there. I'm fine seeing it myself, but I'm not ready to take the show on the road yet. Sigh. BUT somehow facing that tubing fear and overcoming it really made me feel empowered again. Just like my first walk to the bathroom after surgery and even the surgery itself. I hope you get that same feeling, CindyLoo, with each step along the way!! The first time I ever changed a diaper was the day we brought our son home from the hospital. You'll be amazed at what you can do when you need to do it. :-) Sleep tight, girls! Sweet dreams.",
      "MessageIndex": 215,
      "PostDate": "19/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 24, 2012 07:31AM Dulcigirl wrote: And do NOT second guess yourself!! I take (stupid) pride in not pushing the call button/not being high maintenance. Well, the nurse who put my IV in did it in a tricky spot so the machine kept going off if I moved, if I didn't move, etc. I knew THAT wasn't my fault. But I woke up in the middle of the night feeling like I really needed to use the bathroom. I had a foley so I tried to reason with myself that I didn't need to go. After a while I finally called for help. I was so embarrassed. (WHY???!!!!) but the NA was so kind. He said sometimes the bag isn't hanging just right, blah, blah, blah. He did NOT dismiss me or make me feel badly. He just lowered the bag and chatted a while. Then he got quiet for a minute. Then he said, \"You poor thing!!\" Basically the way it was hanging wasn't allowing it to drain out. So I really DID have to go. A LOT!!!!!! (TMI #32. Ha!!) Trust yourself. Ask questions. Let them do their job which is keeping you comfy and helping you heal.",
      "MessageIndex": 297,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 25, 2012 09:06AM Dulcigirl wrote: Mary, I'm sure all of our stories/treatments will be different, because our general health, age, cancer location, etc. are all at least slightly different. My pathology report came back yesterday. Same as yours. ER/PR +, HER2 -, BMX, negative nodes, clear margins, and no more cancer showed up in the analysis of either side's tissue. My BS said that \"for having a bad thing, that's as good as it can get.\" I'm very grateful. My BS told me I should not need chemo or rads, but that my MO (I'll get a referral at my follow up tomorrow) will discuss further treatment options. (I'm guessing that means some sort of drug possibly.) Mine was IDC too, but smaller with lower stage and grade than yours I believe. I don't know if this helps you at all, but I sure hope so. (FYI: I like collecting old books and antique bicycles a whole lot more than collecting doctors.....) I've determined that I should try really, really hard not to jump to conclusions. No doctor wants to complicate things or confuse their patients when it isn't really her call. I'm waiting til I talk to the MO as this is now the expert for whatever comes next. One day at a time!!!! We can do this!",
      "MessageIndex": 324,
      "PostDate": "25/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 29, 2012 09:42AM Dulcigirl wrote: Grier, I used rubbing alcohol on a cotton ball to get rid of the goo....as long as it wasn't near any incision. Works great. Twitches, weird bubbling sensations, etc. YES!!! I asked my PS about it and he said,\"Absolutely.\" There is a scientific name for it, which I can't remember, but basically, and I quote, \"the muscles don't like what we've done to them.\" NOOOOOO!! REALLY???? Lol. I'm also having lots of sensitivity in my skin. Almost painful, but more annoying. At first I thought my skin was really dry or raw, but it must be creepy crawlies from all of the cut nerve endings. I really hate my armpit most. But I suppose I will eventually adjust and get used to these feelings. Or lack of feelings. Like I said earlier...that area only accounted for slightly less than 1% of the total me, and I've got things to do!!! :-) If any of you hear of ways to help with healing or minimizing the different nerve issues please post them. I can easily learn to live with it as the price of getting the cancer out, but if there are ways to help it I'd love to try.",
      "MessageIndex": 367,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 31, 2012 05:11AM Dulcigirl wrote: Paula...remember you may still have some swelling. I suspect it will go down some. My mom never had reconstruction. She isn't totally smooth-flat, but more than right after the MX. Mgd....wow!! So glad to hear from you and so grateful they caught your needs in time to quickly fix them. Scary!!! It sounds like your home support team is awesome! They'll always be proud of helping you, so let them do it! As Paula said, we don't know what the future holds, but we know WHO holds the future!! Praying for quick recoveries, accurate test results and wisdom in future treatment plans.....AND joy along the journey!",
      "MessageIndex": 409,
      "PostDate": "31/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jan 12, 2014 06:24PM Dulcigirl wrote: Connie!!!!! How are YOU??! I had a revision/second exchange in October...almost exactly a year from my BMX. I can live with these and am looking forward to nipples on Feb. 5!!  (I think it's amazing the things I get excited about now.) I'm finally starting to feel like I'm gaining some strength and now I'm working on losing my post-diagnosis 10 pounds. Boooo!!!  It sure is nearly impossible to get rid of and VERY easy to get back. My \"cancer stuff\" is finally beginning to settle down enough for me to really notice some age issues (shoulder, ear, thumb joints,...) that I have been ignoring. But growing older is a pretty cool thing to get to do, right?  Hope you all are out there living life!",
      "MessageIndex": 1055,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jan 1, 2014 07:34AM Dulcigirl wrote: Before I had my BMX I joined a thread called October 2012 Surgeries (or something like that!). It was a life saver. I know we all contributed to the list of what we needed and actually used. If you read through that thread you will be thoroughly prepared! But I think one of those threads starts up every month. I strongly encourage you to join yours!! I've made some lifelong sister-friends out of that list!! The sweetest, strongest women I know!! And hang in there!!! There is definitely life \"on the other side\" of all this. ",
      "MessageIndex": 3,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/816358",
      "Title": "Mastectomy with reconstruction coming up....VERY NERVOUS 1MindyydniM1 Skiergirl"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 9, 2012 04:18PM Dulcigirl wrote: I was told I'd be staying in the hospital one night. DeborahC--Thanks so much! I'm not dreading the TE's quite so much now. Lol. Buxom???? This will be a first for me. Ha!! Got fitted for my post-surgery camisole today. Teared up a little, but no loud sobbing. :-) The bummer was that she didn't have any white in my size, so she's shipping it to my house and it \"might\" get here in time.....and yep, that ALMOST started a meltdown. I feel like I have so much to accomplish and organize BEFORE. Poor DH last night said after surgery I am not to do ANYTHING. He said, \"All you get to do is sit in that chair and look pretty.\" (And, you guessed it, THAT made me cry!!!) Poor guy.",
      "MessageIndex": 82,
      "PostDate": "09/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 16, 2012 04:25AM Dulcigirl wrote: Well, \"Cinderella\" has arrived at the ball, but this is NOT the gown I ordered!!! Lol. I'm in pre op waiting for my radioactive dye job. Wait. Wait. Wait. Have a good day, ladies. Hope the rest of my nurses are as nice as the one who did my IV.",
      "MessageIndex": 149,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 18, 2012 05:52AM Dulcigirl wrote: Chapstick!! At the hospital I had to use theirs because they didn't want mine to interfere with anything, but have one handy at home too. The anesthesia really dries you out and the breathing thing you use after to clear your lungs is drying too. It was good to sleep in my own bed last night....with lots of pillows. The recliner IS a very comfy position, but I can't get up by myself. Can't reach or pull the lever and don't have the strength yet to push the footrest down with my legs, cuz it uses abs too much. Before surgery one of my fears was emptying the drains. It really isn't hard at all. And like someone above said, when I got brave and looked in the mirror I actually smiled. I don't really know what I was expecting, but they do look better than I feared. I'm no competition to Jessica Alba, but I get extra credit for courage and positive attitude, right? It was such a relief to have it just be done and now I can focus on the next thing....which (I've been ordered) is to learn to ask for help and accept it. Ugh!!! I really stink at that. God bless you all in whatever you face today!",
      "MessageIndex": 179,
      "PostDate": "18/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 20, 2012 09:03AM Dulcigirl wrote: Just thought of one more great tip...since I finally had the courage to use it this morning! My PS came up with it, though others may have too. After surgery I was on oxygen through the first night. The next day when I was getting ready to go home they gave me the oxygen tubing! They feel like they are recycling a bit and it is absolutely perfect to use in the shower at home. I just put it over my head (backwards from its intended direction) like a necklace and used the pins to hang my drains on it. It was comfortable and it won't be soggy like shoelaces, etc.",
      "MessageIndex": 220,
      "PostDate": "20/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 21, 2012 05:23AM Dulcigirl wrote: CindyLoo, I'm a control freak too. DH has been there for moral support and he writes down the measurements, but I've done the drains myself. It's really not hard at all. If you can get help, take it. If not, you'll be just fine! I even pulled the pain pump wires out by myself two days ago. I never imagined I could do anything like that. I really couldn't have, but some brave woman showed herself removing hers on YouTube. She rocks!! She gave me courage.",
      "MessageIndex": 236,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 24, 2012 04:22AM Dulcigirl wrote: Yay!! Hugs to you, Cindy!! It will get better throughout the day. Get some sleep.....",
      "MessageIndex": 291,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 24, 2012 10:45AM Dulcigirl wrote: Cindy, I sobbed my first time up and got very dizzy. I was terrified when they came back the next morning to make me try again. But guess what??? I did great! I was slow, but no tears and no dizziness. So, don't be afraid to try again next time!!!! Slow and steady wins the race....",
      "MessageIndex": 304,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 27, 2012 03:37PM Dulcigirl wrote: Connie, that just cracked me up!!! Laughing that hard still hurts a little, but it was worth it. Lol. Today was my first day with no meds of any kind. And I got to tag along on a grocery run. I think THAT may be my death sentence. I couldn't push the cart, of course, so DH had my daughter do that. If I walked behind or beside her she went SO SLOW!!! But if I got in front of her I was terrified she would run over my heels. Then I had to have them reach the higher stuff, put everything on the belt, etc. Guess what?? Apparently I have serious grocery control issues. :-( They also took me to the library I work at for just a few minutes. There was a special open house today. So, in honor of the occasion I stuffed my bra (cami) for the first time. It was funny to try to get the right amount of stuffing and have both sides be level and equal. Anyway, after the library we went to the store. I headed straight for the bathroom to pull those stupid puffs out!!! They just felt like they were putting too much pressure on my chest. I'll save them for \"special occasions.\" Ha!! My coworkers kept telling me how great I looked. They were very kind. But all I kept thinking about was something I read on some thread on this board. \"Of course I look fine. The cancer was in my boob, not my face.\" Had to bite my lip.",
      "MessageIndex": 340,
      "PostDate": "27/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 28, 2012 09:29AM Dulcigirl wrote: And for one more bit of silliness.... This morning I was looking over my final path report copy. I added up the weight of the tissue removed, converted grams to pounds, divided by my pre-surgery weight and am happy to report that I am still more than 99% all original me... ROFLOL!!!!! People give their children juice that isn't that \"real.\" :-O",
      "MessageIndex": 352,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 4, 2012 09:37AM Dulcigirl wrote: I've assumed that it has to do with nerve damage during the BMX. Since we know that loss of sensation is one of the side effects I'm choosing (!!) to believe this is a good sign that SOME areas will have at least some feeling. I could not feel my right armpit at all afterwards....but for the last two days it has also started having this dry, sunburned, irritation in spots. It gives me hope that some day I'll be able to tell if I really did apply my deodorant!! Lol. If my choice is cancer or skin irritation I'll choose this any day....but I'm hoping it gets better. So far today even my very softest camisole feels like sandpaper. At this rate I'll have to career change from children's librarian to topless waitress.....which means my PS is going to really have to step up, right??? Ha!!",
      "MessageIndex": 481,
      "PostDate": "04/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 6, 2012 04:02AM Dulcigirl wrote: I think some of it is habit, too. Like when I have my contacts in and still push my glasses up. Duh!!! ;-) Two nights ago I dreamed I was strapped in a dental-type chair and two metal false teeth sets mechanically moved in and chomped off my nipples. (I know!!! How weird!!! And I rarely ever have dreams that I remember.) but I woke up and my nipples really hurt....but they are gone. The body certainly is an odd/amazing thing, isn't it?",
      "MessageIndex": 490,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 6, 2012 10:26AM Dulcigirl wrote: Thank you for giving me hope, Grier!!! :-)",
      "MessageIndex": 504,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 7, 2012 02:41PM Dulcigirl wrote: Wellllllll......I suppose if you can't push the soap dispenser yet, driving MIGHT not be a good idea. Lol. ;-) It's amazing to me which things are difficult. Wiping the kitchen counter off is difficult. So that's a pushing down/wiping motion. The last few days I've been wearing regular t-shirts. DH asked if that was wise. I said I want to wear them and I put them on knowing it will only hurt for a second when I'm trying to take them off. Oh! And pulling the shower curtain shut if it gets stuck on the bar is not fun either. But it's progress. On my first outing (dr appt) I almost got stuck in a bathroom because the door pulled in and was very heavy. Thankfully someone else came in before I had to call DH to push the door open for me.",
      "MessageIndex": 520,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 23, 2012 08:40AM Dulcigirl wrote: This is a little late now, (I hope!!!!) but I know we can all relate! Lol. http://www.zazzle.com/i_pooped_today_shirt-235994588207553100",
      "MessageIndex": 694,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 26, 2012 05:45PM Dulcigirl wrote: Just got home from work and wanted to see if you'd been here, Connie. So, you made it through another step. It sounds like they have a thorough plan ready to go. Did you feel like your questions were answered? Yes. It looks like you really are doing this. One day at a time. Hoping you can rest and sleep tonight.",
      "MessageIndex": 718,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 28, 2012 07:23PM Dulcigirl wrote: Thanks for translating my post, Mgdsmc! I sure did not make that clear. :-( But Connie, check your miligrams of vocodin too, just to be safe. When i had my last kidney stone the strength was double what my PS prescribed me. It made me sick and i had to cut it in half. I sure hope you are able to sleep.",
      "MessageIndex": 732,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jan 8, 2013 06:21PM Dulcigirl wrote: I'm pretty sure it's normal, Connie. :-( I try to remember that I don't know their story. Everyody has one. But now is YOUR time! Take good care of yourself!!!",
      "MessageIndex": 901,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jul 25, 2013 04:50PM Dulcigirl wrote: Michelle, SOOOO glad you are getting some relief!! I am feeling pretty good. Scheduled for Nip Day in about 2 weeks, but will probably delay. I think my PS did a FANTASTIC job, but they are just too big for my personality. So I am agonizing over whether I can live with them or if I should consider a revision to go smaller.",
      "MessageIndex": 1019,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 15, 2013 10:20AM Dulcigirl wrote: One of my FB friends shared this: (I thought it was pretty awesome!)  http://theresathomas.wordpress.com/2013/10/11/purge-the-pink-what-you-can-do-that-will-actually-help-in-the-fight-against-cancer/ ",
      "MessageIndex": 1050,
      "PostDate": "15/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 6, 2012 04:02PM Dulcigirl wrote: Hi everyone, I was diagnosed 9/12 and am scheduled for my BMX on October 16th. I'm not even sure what to say right now, but I wanted to join the boards so that I could thank you all for sharing your journey. I've learned so much from lurking here. My PS said, \"Whoa! This one's been studying!\" ;-) So thank you!! I intend to pay that forward and share my experience in an attempt to help the next \"club member.\" Oh! I'm 46. My mom, aunt and childhood best friend are survivors due to early detection. My mom's best friend, my grandma, all of her sisters (4) and my great grandma fought hard as long as they could. With God's help I'm going to fight hard AND survive.",
      "MessageIndex": 59,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 13, 2012 07:53PM Dulcigirl wrote: Waiting with you all. Tomorrow after church I have to stop and get blood work done. Monday I'm \"packing\" for the hospital, and my daughter's stuff for grandma's house. Tuesday is \"D Day\". Or B- day in my case. Lol. I do feel like I'm becoming more calm as each day goes by....I will also try to post here as soon as I can in hopes of passing on helpful tips. I realized today that I find myself almost telling strangers. Like the grocery store cashier....like I need her to know these aren't just NORMAL groceries!! These are the things I'm stocking up on for my surgery. Because I have cancer. How weird is that? It's like I need the rest of the world to stop just for a minute with me. But life moves on and I can't wait to heal up from this and get back in there!!!! I don't know what the future holds, but I know Who holds the future!!! Sleep well, ladies! I'm soaking up every moment of side-sleeping I can get, cuz I've read it will be a while. :-)",
      "MessageIndex": 119,
      "PostDate": "13/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 17, 2012 05:31PM Dulcigirl wrote: Just wanted to mention one more thing that I took with me and used. I got a small pack of face wipes. It was nice to feel like my face was clean. Definitely not necessary, but it made me feel better.",
      "MessageIndex": 175,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 19, 2012 05:42AM Dulcigirl wrote: I'm laughing now too, because just last night i was wondering where my nipples ended up. I'm assuming they went to pathology before the garbage truck backed up....beep, beep, beep...... I explained the lack of nipples/aereola to my college girlfriends. They got quiet and I said, \"Hey!! It's worked for Barbie for longer than I've been alive!\" I can't laugh all day and I still have many moments of crying, but the moments of laughter are good!! Reminds me of a verse in a song I like. \"There may be pain in the night, but joy comes in the morning!\" My doctor had the radioactive tracer done about an hour and a half prior to my BMX. First the radiologist injected some numbing thing. Then the tracer. Neither one went directly into the nipple. It was near and angled that way. Then my doctor did the blue dye after i was already asleep in the surgery room. It's interesting how there are so many ways to do the same thing. Hoping this morning brings you all some moments of joy....be watching for them! Sometimes you have to wipe some tears away before you can see them.",
      "MessageIndex": 202,
      "PostDate": "19/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 21, 2012 07:39AM Dulcigirl wrote: Definitely take whatever your \"rig\" is for the drains. You CAN pin them to your shirt, but for me they are most comfortable when they aren't moving around. I love my cami!!! It's my new best friend. Toothbrush? I loved my battery powered one. Got a good brushing without too much arm movement. I also (though not necessary) took a little pack of face wipes. I did use them to clean my face, but you could just ask for a damp washcloth. Also, my discharge papers said deodorant only. No antiperspirant. I didn't know that ahead of time, so DH just got me some yesterday. I sure hope that's only temporary. Feels sticky. Lol.",
      "MessageIndex": 239,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 22, 2012 06:44AM Dulcigirl wrote: Just called my PS with my drain report. It's amazing what becomes a source of pride....lol. They said to come on down this afternoon. Yay??????? Not sure which I'm most nervous about. Having them removed or my first time out in public. It will be great to be done with them though. I told DH that I was always kind of proud of my fairly flat stomach so having those two grenades sticking out down there while there isn't much up top just seems wrong!! Then I started laughing so hard!!! He said, \"I know what you are thinking!!! They're about the right size/shape, (I wasn't very big) but the suction wouldn't work as well.....\" Stink! I thought I had solved the whole \"where should I keep my drains\" issue very efficiently.",
      "MessageIndex": 262,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 25, 2012 05:07AM Dulcigirl wrote: Oh, Cindy...... It's going to get better, ok? Hugs!!!",
      "MessageIndex": 319,
      "PostDate": "25/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 4, 2012 04:22AM Dulcigirl wrote: 5thsib...after my core needle biopsy I developed a large hematoma. LOTS of bruising and a lump. It did eventually clear up (just in time for my BMX, ironically), but it was very sore and discolored. Just keep an eye on it. I also used cold packs to help with swelling and soreness. Call your doctor's office and ask to speak with a nurse....they will tell you how best to help it heal up. Yuck. It was interesting to see how many different colors I turned. :-)",
      "MessageIndex": 463,
      "PostDate": "04/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 4, 2012 04:40AM Dulcigirl wrote: Ok. I have one of those \"is this happening to you?\" Kinds of questions. In two days it will be 3 weeks since my BMX/TE surgery. I'm improving, but there is one really annoying thing that doesn't seem to be changing and it was extra bad during the very long road trip we just took. All across my breast area the skin just feels raw. It ISN'T!!! (I keep checking.) it's worst on the top half. Riding in the car seemed to make it feel worse due to the friction of my VERY soft shirt rubbing on my skin more than it does if I'm just sitting in the recliner. (But I got to see my son graduate!! Yay!!) Is this from the nerve damage from surgery? Any guesses if it will ever stop or get better? Any tips/tricks to minimize the burning feeling that sometimes makes it hard to sleep? At first I really thought it was my super sensitive skin reacting to tape, etc, but now I'm realizing it is not on the surface. It feels uncomfortable to touch the skin, too, but there is no redness, rash, dryness, etc. so I believe it's nerves underneath. I guess I'm hoping somebody has a recommendation for some lovely smelling lotion or cream that would make it stop!!!!! Lol. If not that, I'd just love to hear a \"yep. Me too!\" so I'll know I'm not alone. No wait. That wasn't nice!! I'd rather nobody else was feeling this! Sooooo....how about just a good 'ole \"I had it for a week then it went away.\" ;-) Funny, too, because my husband accidentally elbowed my left one the other day and I didn't feel that. Weird foobies!!!!!",
      "MessageIndex": 464,
      "PostDate": "04/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 4, 2012 06:20AM Dulcigirl wrote: Thanks, girls! I have a somewhat rare skin condition that I've dealt with all my life, but not in THIS area, so I was a little nervous that this was related to that. I was trying to explain to DH how it felt. (We had 12 hours in the car yesterday which made it a lot worse.) I said, \"it's like if a large portion of your skin got burned, then started to heal. Then you took that brand new, pink, tender skin......and scraped it with a rusty metal yard rake!\" My son (smart mouth) pointed out that the \"rust\" wouldn't actually make it HURT more, though it would be more dangerous. Hmpf. I believe I'm allowed a little drama at the moment. I hugged my little pillow tight for hours trying to minimize the movement. Today I'm home and I'm not moving unless I have to. Hopefully it'll calm down again.",
      "MessageIndex": 472,
      "PostDate": "04/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 10, 2012 06:23AM Dulcigirl wrote: Connie, sounds like it could just be a nerve issue like mine, but just to be informed because of the node removal you might want to read the threads on this board about \"cording\" and lymphedema. My guess is that you have ticked off nerves too. ;-( My whole chest felt rashy/painful for the last week and a half, but there was no redness or dry patches or anything. If you see any redness you should call your dr.",
      "MessageIndex": 560,
      "PostDate": "10/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 12, 2012 09:37AM Dulcigirl wrote: Holy smokes!!! 600???? And you're still able to type??? You're my hero! I got only 60 last week and had to take meds for another day. Wow. I'm SO VERY happy for you!!! (And your hubby. Lol.) it IS fun to have some shape and some hope of more to come, isn't it? YAY!!!!!!!!!!!!",
      "MessageIndex": 585,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 23, 2012 04:16AM Dulcigirl wrote: I slept on normal pillows last night!!!!! Just two of them!! :-)",
      "MessageIndex": 691,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 24, 2012 08:44AM Dulcigirl wrote: Connie!!! Sorry you are having a freaking out moment!!!! (((((Hug!))))) Take a deep breath and remember how far you've already come...ONE STEP AT A TIME!! My BS told me NOT to google in general, but that THIS site had good information if I really felt the need to search. If you are feeling like you must search I would read the information parts of the site before you get stuck in message board land. I know how overwhelmingly supportive the message board has been for both of us, BUT we each have our own story and our own diagnosis, so panicking because of what someone else has faced/is facing doesn't make sense, right???? I don't know the scientific answers to help you. I know my BS said my ER+/PR+, HER2- is the best case scenario, so it's the HER2+ that is the difference between ours. If you're needing to start researching I would start there. But I would also ONLY do it to give you good questions for the oncologist. He/she will be able to tell you what it all means based on YOUR special story. Praying for your PEACE right now as you wait for your appointment and I'm so sorry you're going through this today! It's such a very cold day here in MI! I hope you can snuggle up with your kiddos and some cocoa and enjoy being together.",
      "MessageIndex": 698,
      "PostDate": "24/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 25, 2012 12:59PM Dulcigirl wrote: I wish you DID have more choices, Connie, although sometimes it's easier for me to just know that I have no choice and better just get through it! :-) My chiropractors talked to me before my final path report and told me there are dietary and vitamin/supplements that can help make treatments easier to deal with. There are natural, healthy things to do alongside the medical treatments that can help the healing, fighting, energy, etc. (That's one thing I like about mine. They never once said anything negative about my choosing to do the standard medical treatments. They just said whatever choices I made they could come alongside and support me. Great people.) As I read your last post that conversation popped into my head. Maybe you have someone similar in your area? I know you're worrying about the energy you need to be a mommy and a wife. Sending another cyber hug your way.....",
      "MessageIndex": 705,
      "PostDate": "25/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 26, 2012 07:17AM Dulcigirl wrote: Connie...is your DH going with you? I know when I went I was really nervous and was glad mine was able to make the appointment. It's hard to process everything and helps to have another pair of ears (and an extra brain!). I read through the thread that had caused your freak-out and saw the message that upset you. It would have upset me too. However I kept reading and the rest were much more positive. As many of them said, we have no idea how advanced the members of that group were. Yours was caught so very early!!! So head in to that appointment with your questions and the knowledge that you may have to take a few more steps on this journey, but you can do it! You've amazed me with your positive attitude and your strength...and you have every reason to stay strong and positive. I read on some other thread a comment about \"taking us with you in your pocket.\" I thought it sounded so dorky back then.....but I get it now. Feel free to take me along in your pocket!!! And I sure hope you'll update us as soon as you can. ((((((Hugs))))))))",
      "MessageIndex": 711,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 28, 2012 03:02PM Dulcigirl wrote: Don't mix your vicodin and Tylenol! They are both Tylenol products. Do you have any Motrin type stuff? You may want to just call your dr and check, but I'm pretty sure that's what my dr told me. Oh I am SOOO sorry it's hurting!!!",
      "MessageIndex": 729,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 30, 2012 04:26PM Dulcigirl wrote: I was just having a similar conversation with some other bc ladies....about annoying things people say and do. It is SO hard not to blow up at them sometimes, but I'm really trying hard to remember that they have no idea what to say. And they probably don't understand what my (your) procedure really will be like. Maybe they are thinking you'll need to stay germ-free while having your treatments??? Who knows what they are thinking!!!!!!! All I know, Connie, is that you're going to do GREAT!!! And then, guess what??? They'll probably assume it was all no big deal. Ugh!!!!!! On the other hand, you could probably really milk this for quite a while.....lol!!!",
      "MessageIndex": 759,
      "PostDate": "30/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Feb 1, 2013 04:48PM Dulcigirl wrote: ROFL, Connie!! That's awesome! My DH thinks my scars are hot (yeah, right!) cuz they make me look tough. Maybe instead of the usual recon tattoos I should just add barbed wire. Hilarious. I know you guys don't know me, but think cross between Alice in Wonderland and maybe Mary Ingalls.....",
      "MessageIndex": 945,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "May 14, 2013 03:37PM Dulcigirl wrote: Yay, Connie!!!!!!",
      "MessageIndex": 982,
      "PostDate": "14/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "May 27, 2013 06:52PM Dulcigirl wrote: Mg, So very sorry for your loss. I'm very sure you touched her heart as much as she did yours. May you find comfort in remembering the blessings of your friendship. (((Hugs!))))",
      "MessageIndex": 991,
      "PostDate": "27/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 16, 2012 05:30AM Dulcigirl wrote: You too, Mary!!",
      "MessageIndex": 151,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 18, 2012 04:06PM Dulcigirl wrote: The radioactive tracer dye? I think I lucked out because I had some numbness from my biopsy and I didn't even feel the needle go in. Before he left the radiologist told me I had to keep massaging it every few minutes for the next hour and a half til my surgery. So I kept trying to do it subtly so nobody walking down the hall would see it. DH thought that was pretty funny. CindyLooWho....what I learned throughout the whole experience was that ALL of the people were so kind and helpful. And none of it was the huge terrifying horrible thing I had running through my mind. I wouldn't wish it on anyone....but you will do great!",
      "MessageIndex": 190,
      "PostDate": "18/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 19, 2012 08:32PM Dulcigirl wrote: Lol! I could NEVER do that!! Or be a school bus driver. :-)",
      "MessageIndex": 218,
      "PostDate": "19/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 22, 2012 03:08PM Dulcigirl wrote: Whew! Home from my first follow up appointment. I'm exhausted!!!! But my drains are gone, the tape is off and they even did a little fill. I feel skinnier.....and tired!! But it was a good day. And nobody even looked at me funny. Plus I cracked DH up as we were walking into the vitamin store afterwards and I said, \"Cuz I make flat look good!!\" He almost choked. Ha!! But it's great to be back home in my soft jammies. Connie and Cindy....thinking of you tonight (and any other Tuesday girls). Praying you through tomorrow!",
      "MessageIndex": 266,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 28, 2012 08:29AM Dulcigirl wrote: Ha!!! That's awesome!!! My daughter replaced the nearly empty TP roll in the half bath. But it's upside down!!!! Grrr. I bite my tongue each time I use it. I also got in trouble for \"suggesting\" my DH wash the cast iron pans the way I do so they don't leave residue on the stove top when they are drying. (Head bowed in shame...back to the recliner I go.......)",
      "MessageIndex": 351,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 3, 2012 04:23AM Dulcigirl wrote: Perfect last paragraph, mgdsmc!!!! And yes, Connie!!! Onward and upward!!!!!",
      "MessageIndex": 444,
      "PostDate": "03/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jul 25, 2013 07:08PM Dulcigirl wrote: Funny, Cindy, because I can't say it either!! I picked up on it when I first started reading the boards and used it a few times, but not since before exchange. There is nothing fake about all of this! And these new ones? They are twice as much \"realness.\" Lol. Huge, huge congrats on finishing the masterpieces!",
      "MessageIndex": 1021,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jul 26, 2013 10:20AM Dulcigirl wrote: Hmmm,....maybe if I take MY glasses off mine will look a little smaller! Lol. 23rd Anniversary tomorrow...We're going to drive a couple of hours south, ride on a great, paved bike trail near the college we attended, then have a picnic in the park where he proposed. Awwwwww!!!!!",
      "MessageIndex": 1024,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 14, 2013 11:46AM Dulcigirl wrote: lol, Connie!!! Tell us how you really feel!! November's coming....",
      "MessageIndex": 1045,
      "PostDate": "14/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 6, 2012 04:42PM Dulcigirl wrote: More hugs and prayers for you Mary!",
      "MessageIndex": 510,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 7, 2012 01:13PM Dulcigirl wrote: Go Connie!!! I'm seeing my PS tomorrow also. Fill #2....I'm nervous! I wasn't expecting #1 when I went the first time, so didn't have time to get nervous. Silly, huh? I've done all of this other stuff, but I'm nervous that I might be more uncomfortable for a few days? Plus I am super emotional today. Grrrr. Today I just want to curl up in a ball in my closet and cry myself to sleep. Sheesh. I think I need to have just a wee bit of \"normal\" soon to perk me up. I'm hoping the PS will ok some beginning exercise AND driving!!! How long do/did you all have to wait to drive? When did you get the ok to start range of motion exercises? Regular exercise? (Like walking and a stationary recumbent bicycle.) Ok. I'm going to contemplate dinner and read a good book now. You all have been such a blessing!!! NOWHERE else that I felt free to just vent all of this whiny stuff!! Thanks.....",
      "MessageIndex": 516,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 9, 2012 05:14PM Dulcigirl wrote: I read it described as \"the iron bra.\" But I did have that feeling....like a bad fitting underwire. Too tight. I kept reaching up to pull my bra down, then remembering I wasn't wearing one! It has definitely gotten better in the last week for me, and improved even more after my fill this week. I have one new area that's annoying me now, but not that choking around my rib cage feeling. New soap opera title? \"As the TE grows....\" Definitely high drama. Lol.",
      "MessageIndex": 551,
      "PostDate": "09/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 12, 2012 07:56PM Dulcigirl wrote: Whew! I thought you meant 600 on each side!!! I think people usually tell the total per side. I'm at 280 right now...on each side. But I can't imagine getting 150 at once. 60 was doable. But I wasn't big to begin with. Loving my genie bras....but wishing they came with a wider neckline. I wanted to wear a shirt for my son's graduation that wouldn't work because the bra showed a lot.",
      "MessageIndex": 590,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 15, 2012 12:10AM Dulcigirl wrote: Me too. Silly iPad.",
      "MessageIndex": 625,
      "PostDate": "15/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Dec 4, 2012 05:54AM Dulcigirl wrote: Grier!!! That is AWESOME!!! Oh, I would have loved to see the look on his face!!! Connie....how are you doing?",
      "MessageIndex": 788,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jan 16, 2013 02:25PM Dulcigirl wrote: Just got home from my PS!! First of all, CONGRATULATIONS!!! Happy Squishy Day to you, Grier!! Yes, I now have a date. I was anticipating March or April because they are always busy, but I heard the nurse mention something about a cancelation, then my PS nodded, and the next thing I knew I was scheduled for the 29th. OF JANUARY!!!!!!! Hoping my boss is ok with that. (I am part time, so I shouldn't have to miss too much.) i hesitated to take the date, but then DH told them I can't sleep unless I'm in the recliner and the dr said, \"Let's just get those things out then, ok?\" Ok!!!! And Grier, just reading your comment about the change in how they feel is making me much more happy with getting it over with. DH asked why THIS is making me nervous. I said because the mastectomy? Had to do it, so I did. The TE's? Just had to endure it for a while, so I did. But this???? This is like having to pick the one coat that you will have to wear every day for the rest of your life!!!! You can't rush that! Lol.",
      "MessageIndex": 915,
      "PostDate": "16/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jul 27, 2013 05:33AM Dulcigirl wrote: Hey, Cindy, Did your bra size change after your weight loss? May I be a total snoop and ask you what it is AND can you remind me how many cc's your 45's are? 700, right? I'm making my pros/cons list and seriously considering downsizing IF it's worth it. And it may not be worth it!!! I've never done anything purely for cosmetic reasons and this would be pretty close to that. Ugh.",
      "MessageIndex": 1026,
      "PostDate": "27/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Aug 28, 2013 07:00AM Dulcigirl wrote: I hear you, Connie!! My call was September 12th. I got mad every time I walked into a store! I hope I can view it differently this year. I actually like pink...but I won't wear it in October. Not yet, anyway. Congrats on the nipples!!!",
      "MessageIndex": 1040,
      "PostDate": "28/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 11, 2012 06:49PM Dulcigirl wrote: Me too! Thanks, Sue!",
      "MessageIndex": 106,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 15, 2012 05:44PM Dulcigirl wrote: Yay to both chrissera and mgdsmc!!! Mary, hope the dye wasn't as bad as you feared. That will be my first \"job\" tomorrow morning. Then sit around and wait a while for it to do what it needs to do....then BMX. That is going to be a long, nerve wracking wait. Hope the book I'm taking is a really good distraction..... Catch you all \"after.\"",
      "MessageIndex": 147,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 17, 2012 08:44AM Dulcigirl wrote: Connie! It's going to be ok!! Just finished my surgery yesterday at 3:30 p.m. I AM sore and trying to get up for the first time last night was hard....but today the world is a much brighter place. Had to sip broth through a straw cuz I couldn't manage the spoon from that distance. Lol. They plan to send me home later this afternoon. So far the only things I've used from home are my comb, headband, and battery toothbrush. Will be wearing my camisole with pockets when I go home and hugging my pillow. I'll let you know what I wish I had at home. ;-) do take your stool softeners. And don't be like me! Dumb period started on Monday so my heaviest day was during surgery. Blech!!!!",
      "MessageIndex": 167,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 21, 2012 08:15AM Dulcigirl wrote: I had the OnQ. Mine delivered lidocaine for 3 days then I removed the guide wires at home. It definitely helped get through the first few days of pain, though I'm on prescription strength Motrin and also had some Vicodin the first few days. Hoping my drains will come out at my follow up this week. They're looking good! Not as bad as I thought they'd be. I just had two.",
      "MessageIndex": 241,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 21, 2012 10:22AM Dulcigirl wrote: I'm planning on wearing mine throughout reconstruction. I actually went to the medical equipment office at my hospital and they had some there, but not my size so the ordered them for me. You can certainly get along without it, so don't worry, but I do love mine. Very soft and I like the drain pockets....which can come off for later use. It also has pockets for fiberfill \"foobs\" in case you want to try to balance out your appearance during reconstruction. Not sure if I'll worry about that or just let the world see me go from 13-22 years old in a few months. Ha!!!",
      "MessageIndex": 245,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 21, 2012 12:35PM Dulcigirl wrote: Paula, my hospital had wi-fi. My husband kept my iPad, but brought it to me the next day and I was able to send out a quick \"I'm alive\" Facebook message. But you could just leave it at home. You'll probably sleep (or feel like sleeping) most of the time. I'll have to see if I can get new bras covered too. I've never had 7 at a time either!!! Lol. Toothbrush! Oh..I took a ball cap to hide my less than lovely hairdo on the way home. I'll be thinking about you Monday girls all day. I look forward to hearing fom you again when you're up to it. God bless!",
      "MessageIndex": 250,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 23, 2012 06:26PM Dulcigirl wrote: Glad you're back, Paula! Hope you sleep great tonight. Connie and Cindy....you, too!! Tomorrow is a brand new day. Make it a good one. :-)",
      "MessageIndex": 287,
      "PostDate": "23/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 28, 2012 08:10AM Dulcigirl wrote: Cindy, I was terrified of the drain removal. I took a Vicodin an hour before my appointment. It did not hurt AT ALL!!!!! It was just about the WEIRDEST feeling ever, though. Like a scene from Alien. Lol. Afterward I did have soreness and I've kept gauze over the holes just to keep anything from rubbing as they heal. Those spots are still a bit tender....almost like a bruise....if I bump them. My nurse did not \"yank\"...just firm steady pressure. I'm still shocked they didn't hurt coming out. Neither did the pain pump wires.",
      "MessageIndex": 349,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 30, 2012 08:03AM Dulcigirl wrote: I related to that, too. Very funny!! Plus I totally agree that at times since my BMX it has felt like the milk was coming in. Not QUITE the same, but close enough that I can't think of a better way to describe it. Is it the TE's or simply the nerve damage from surgery?",
      "MessageIndex": 380,
      "PostDate": "30/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 6, 2012 08:57AM Dulcigirl wrote: I have that feeling all across my chest and into both armpits. It goes around to my back a little on my node-removal side. I described it as very sunburned skin with even my softest camisole feeling like sandpaper. Or fresh new pink skin after a severe burn....being scraped by a rusty metal rake. But there is nothing wrong with the surface of my skin. It just feels that way. My PS told me it is normally temporary, has to do with all of the nerves that were cut trying to figure out what to do with themselves, most people have numbness, not this, and to take Motrin. I do have numbness on my incision lines. And I'm thankful for it in comparison right now. Hope this goes away quickly, Paula!! But I would be sure to ask your doctor. Yours could very well be different from mine.",
      "MessageIndex": 501,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 10, 2012 04:43AM Dulcigirl wrote: Before my fill this week I was really discouraged. I was feeling like I'd had a major sunburn or rash or something all across my chest and part way around the right side to my back. Everything that touched it made it hurt. The softest cami felt like sandpaper. Pain meds didn't help at all. But there was nothing wrong with my skin. So I realized, and my doctor confirmed, that it was all of those irritated cut nerve endings. Mine were definitely ticked and I couldn't really blame them. But it sure was depressing not knowing if it would improve. Hours after my fill this Thursday I realized it was a lot better!! Who knew? I'd like to call and see if I can go get another one NOW and see if it would make the remaining areas better! (Ok, plus I'm starting to see an actual boob shape and that's also exciting. Lol. \"More, please!\")",
      "MessageIndex": 554,
      "PostDate": "10/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 10, 2012 03:04PM Dulcigirl wrote: I want to sleep on my side SOOOO BADLY!! I've always slept on my side. This afternoon I changed the sheets/made the bed all by myself. ;-) And I left my big cushion and extra pillows on the floor. I was thinking maybe I'd try it tonight. But I have this completely irrational (I think) fear that if I'm on my side the top one will slide down and I'll have crooked cleavage. Anyone want to talk me off this ledge? Tell me TE's can't possibly slip out of place?",
      "MessageIndex": 566,
      "PostDate": "10/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 13, 2012 09:22AM Dulcigirl wrote: Happy Birthday, Paula!!",
      "MessageIndex": 599,
      "PostDate": "13/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 14, 2012 01:38PM Dulcigirl wrote: Connie, I had 3 nodes removed and am wearing a med alert bracelet that says \"no blood pressure, no needles, right arm.\" My BS told me to only use my left from now on. M hoping the bracelet reminds me AND others. My right veins have always been the good ones. Better safe than sorry...",
      "MessageIndex": 619,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 21, 2012 02:59PM Dulcigirl wrote: I had a fill today too! Slightly tight right now and that's it!! If I could sleep on my side again life would almost feel normal. ;-) And I'm getting a tiny bit of energy back. I'm exhausted today from a very long week, but yesterday I rode 11 miles on our exercise bike....I'm coming back! Look out world!!",
      "MessageIndex": 680,
      "PostDate": "21/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 22, 2012 02:33PM Dulcigirl wrote: Paula, I got this one: www.creativemedicalid.com/inc/... But this website has a huge variety. It was fun to look around. Now I want to get a simple, cheap sports one for times when I'm working hard or working out.",
      "MessageIndex": 689,
      "PostDate": "22/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 27, 2012 06:33PM Dulcigirl wrote: My grandma used to say \"the sooner you leave, the sooner you can come back.\" Thats what popped into my head about your chemo/holiday stuff, Connie. I know it's easy for me to say, but \"the sooner you start, the sooner you'll be DONE!\" I'm the same way with changes in plans. I'm HORRIBLE!! My usual procedure is something like: Change??? Are you kidding me??? (Panic, freak out, have a fit,....), then somewhere in there i choose to accept that it is what it is. Then i start making new plans for it and do what i have to do. I wonder if i'll ever be able to skip the first few ugly steps of that scenario.....Sigh.",
      "MessageIndex": 724,
      "PostDate": "27/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Dec 3, 2012 06:37AM Dulcigirl wrote: It's Monday. Connie, I came on here to tell you You're in my thoughts and prayers today....and then read that you've got a lot more than chemo #1 going on. Ugh!!!! Saying an extra prayer for all of your kids!!!!",
      "MessageIndex": 782,
      "PostDate": "03/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jan 15, 2013 01:16AM Dulcigirl wrote: Yay for the exchanging girls!!! I see my PS tomorrow and will hopefully get a thumbs up and date for exchange. My TE experience went fairly well til this last month. But I've had to basically try sleeping sitting up in the recliner for the last several weeks. Nights are tough. During the day I forget they're even there!! Position is everything. :-) Can't wait to hear how you all are feeling post exchange....remember to give them time to settle in before you pass judgement on them. Praying for speedy healing....",
      "MessageIndex": 912,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Mar 24, 2013 12:04PM Dulcigirl wrote: Yay, yay, YAY!!!!!!!!!! I'm so glad for you AND glad to hear from you! I hope the \"butt kicking\" is a very short one. May 15th will be here before you know it! YAY!!!!!!!!!!!!",
      "MessageIndex": 960,
      "PostDate": "24/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "May 15, 2013 04:26PM Dulcigirl wrote: Woohoo!!!! Now get some rest, Connie, and do what your doc told you to do!",
      "MessageIndex": 985,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Aug 16, 2013 04:15AM Dulcigirl wrote: Mg!!! Praying for an awesome, cleavage-filled day for you and speedy healing!",
      "MessageIndex": 1034,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 1, 2013 08:29PM - edited Oct 1, 2013 08:30PM by Dulcigirl Hey, Cindy!! Wishing you the same!! I'm having a revision to smaller/different implants this month. Not quite the \"moving on\" I'd hoped for after a year....but counting my blessings that all else is good right now. Pinktober. Blech. I'm using the month and facebook to educate about breast cancer AND being wary of where you donate your money. I'm so glad you thought to write here. Hope others will check in, too!!!!",
      "MessageIndex": 1042,
      "PostDate": "01/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Dec 25, 2013 05:50AM Dulcigirl wrote: Merry Christmas, ladies!!!",
      "MessageIndex": 1051,
      "PostDate": "25/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Sep 26, 2013 07:24PM Dulcigirl wrote: I did not have the test. They said no chemo, so no reason for the test. And of course it's just one more thing to \"what if\" about now!",
      "MessageIndex": 21,
      "PostDate": "26/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/808731",
      "Title": "anyone not get an oncotype test? kika2013 Cathymck"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Nov 20, 2013 01:41AM Dulcigirl wrote: 46, still very premenopausal. Mom was 46 her first time.",
      "MessageIndex": 88,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Mar 9, 2013 01:27PM Dulcigirl wrote: Coping powers??? Hmmm. Good question! I think once you get your treatment plan you put one foot in front of the other for as long as it takes. Just get it done. But I also firmly believe that God put me on this earth for some kind of reason....and if this is the path He needs me on in order to meet whomever He needs me to meet, then I'd best be looking around while I'm walking so I don't miss my opportunity! :-) Pretty tough to focus on others when you're terrified or in pain, but it DOES help you get through the day! Hoping your week ahead is full of unexpected blessings!",
      "MessageIndex": 47,
      "PostDate": "09/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/801005",
      "Title": "help. nobody is responding to my posts. englishteacher juneth"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Sep 20, 2013 01:11PM Dulcigirl wrote: Hi ladies, I discovered this website LAST September and had surgery in October, 2012. Just wanted to say hello. You're in my prayers. You can do this! There is so much priceless information and support here. And I hope that along the way you'll make some precious friendships like I've been blessed to do!",
      "MessageIndex": 224,
      "PostDate": "20/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Aug 28, 2013 08:52PM Dulcigirl wrote: I also have Meniere's and am just extra sensative to ALL meds. I have not had any trouble with dizziness or sickness with anesthesia. I usually just feel like I'm slowly trying to wake up. Last time was the hardest...the first thing I remember hearing was the nurse telling me to wake up, take another deep breath, etc. But never any sickness....just a bit of time to fully wake up and a gradual return to alertness. Express your concerns to your anesthesiologist. It's his/her job to give you just the right thing for you. Best wishes!",
      "MessageIndex": 9,
      "PostDate": "28/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/810059",
      "Title": "Anesthesia jitters - how do you feel when you come out of it? OldOakTree celtictrek"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jan 1, 2014 01:53PM Dulcigirl wrote: I was diagnosed Sept 12 and had my BMX Oct 16. That allowed my BS and PS to coordinate so that they worked together and my reconstruction process started immediately after my BS finished her part of the operation.  You will get more info at your appointment. There is a great section here on bco that gives a suggested list of questions to ask your doctor.  It will feel like forever and it will also feel like it goes too quickly! It's a great idea to start a binder and keep copies of test results, notes, business cards, etc. I think we all have that fear that you are feeling while waiting. I know I sure did! But take a deep breath and know that you do have some time to think, ask questions, make plans,...",
      "MessageIndex": 3,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/816373",
      "Title": "Wait time between diagnosis and surgery katiegrey Pupcake"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Feb 5, 2013 09:00AM Dulcigirl wrote: I really believed that someone told me never to use antiperspirant again during my discharge instructions the morning after my BMX. I was a bit foggy at the time. DH doesn't remember it. I tried a few different deodorants and finally settled on a grapefruit one by LaVanilla. For the first couple of weeks I used nothing and couldn't stand the smell. The LaVanilla helped with the smell, but I had to stop wearing some of the shirts I normally wore to work because I would get big sweat spots. 3 months went by and I went for my pre-exchange visit with my PS. I asked him if the \"no antiperspirant\" thing was forever or just while healing. I really thought he was the one who told me to stop using it! He said he would NEVER say such a thing and that as much as we go through he would never take away something like hygiene that would make us feel worse. So, I have NO idea WHO told me that or if I dreamed the whole thing up while medicated. What were you all told? My BS was able to do my SNB through my mastectomy incision so I did not have an extra incision to heal in my armpit...though it was very sore. She said one ended up being further in than it had appeared so she had to \"do some digging\" to get it. Shudder. Thanks!! For now I'm sticking with my natural LaVanilla just because it feels good. But I'm reserving my anti-p for special occasions.",
      "MessageIndex": 17,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/799506",
      "Title": "YUCK! How to tame the Armpit BO Monster - Suggestions? Janipani Alive4Five"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Feb 27, 2013 06:39AM Dulcigirl wrote: Randie, Your doctor should tell you if it is IDC (invasive ductal carcinoma) or DCIS (ductal carcinoma in situ). Treatment plans/options for the two can be different. Take a deep breath and try to see him for a complete explanation before you panic. Do you have a breast surgeon? If not, find a good one soon. THAT is where I got my best info. Hang in there!! You can do this! English Teacher: so sorry you've had to join us, but as you learn to navigate through the threads you'll be amazed at the wealth of info, love and support. One of the most important things I learned was that although I wanted to do something RIGHT NOW, it just doesn't work that quickly....but that is ok! You have time to get informed, find a dr you trust and make the treatment decisions that are best for you!!",
      "MessageIndex": 42,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/801005",
      "Title": "help. nobody is responding to my posts. englishteacher juneth"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 11, 2012 09:00AM Dulcigirl wrote: Thanks for the encouragement, Susan! Jenifer....that's what I was thinking! And I can't sleep w/out brushing my teeth....then I though of the Spinbrush and figured I could (hopefully!) lower my head and raise my hand enough to just hold it there! Lol. My mom does not remember ever needing help wiping (TMI!). But she did have hers done one at a time. I'm now cleaning my closet. Why? Well, because you just can't leave the house for surgery with a messy closet, right?",
      "MessageIndex": 10,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794641",
      "Title": "bi-lateral in 2 weeks lost in sea of posts of what I need ConnieGreene exbrnxgrl"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 11, 2012 09:54PM Dulcigirl wrote: Connie, you won't be far from me...I live about an hour SE of Flint. Go Tigers!",
      "MessageIndex": 21,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794641",
      "Title": "bi-lateral in 2 weeks lost in sea of posts of what I need ConnieGreene exbrnxgrl"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Jan 1, 2014 06:48AM Dulcigirl wrote: VERY normal to get a call back for just one side!!! VERY!! Don't let that make you lose sleep!!",
      "MessageIndex": 3,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/816345",
      "Title": "Ugh...Got a call about my mammogram imconcerned Dulcigirl"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "May 7, 2014 07:59AM Dulcigirl wrote: How did your appointment go?",
      "MessageIndex": 1184,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Oct 8, 2012 10:16AM Dulcigirl wrote: Thank you for this post and reply. My BMX with TE's is one week from tomorrow. I too have gotten lost in this overwhelmingly supportive ton of threads. Yesterday I picked up one of those cushion/pillow things that helps you stay upright (to read) in bed. NO IDEA what the official name for it is, but it seems to cradle me nicely and also act as the foundation of a wall to keep DH from an accidental snuggle. Yikes. I've also got comfy button up pj's for home, stool softener, a battery powered toothbrush, a pack of headbands because I'm sure the curling iron is out for a while, some baby wipes for freshening up if the shower seems like too much for a while, and rubber gloves/alcohol wipes for the drains. Tomorrow I'm going to our hospital med equipment place to be fitted for a recovery cami my doctor prescribed. Yesterday I stopped and got a couple of loose button down shirts and a couple of hoodies for whenever I venture out of the house again. And had a meltdown in the dressing room while trying them on. I've accepted this and am ready to move forward, but there are moments when it's all just very overwhelming!!! Connie, I'll try to notice anything I'd wished I had and write here before you go! (If I can find this thread again!!! Lol.)",
      "MessageIndex": 2,
      "PostDate": "08/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/794641",
      "Title": "bi-lateral in 2 weeks lost in sea of posts of what I need ConnieGreene exbrnxgrl"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Apr 25, 2014 07:29AM Dulcigirl wrote: too young: Crossing fingers and toes with you. Please let us know!",
      "MessageIndex": 1182,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Feb 28, 2013 06:38PM Dulcigirl wrote: I agree with you..I've done it that way three times...two did not work and I ended up with an exsional biopsy anyway. It was one of the most uncomfortable things I've ever done. I wondered how older patients with back or neck issues could even manage it. It bothered my neck quite a bit. There must be a better way.",
      "MessageIndex": 2,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/801190",
      "Title": "Stereotactic Biopsy Irishwfl kathindc"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Apr 18, 2014 06:58AM Dulcigirl wrote: too young.... Fingers (and toes!) crossed with you! Prayers for a speedy \"all clear!\"",
      "MessageIndex": 1177,
      "PostDate": "18/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Mar 7, 2014 07:13AM Dulcigirl wrote: Hi Mommy, So sorry you are having a difficult time! There is a wonderful thread on lymphedema here. That would be the best place to ask as the women are very knowledgable! There is a form of lymphedema (truncal LE) that affects the trunk/torso area. Many doctors don't know much about LE. Keep pursuing answers for whatever is causing your pain. Sorry I can't be more helpful, but do go to the LE thread and ask the experts! Best wishes for a speedy solution.",
      "MessageIndex": 1150,
      "PostDate": "07/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Dulcigirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161974/profile",
      "Content": "Sep 20, 2013 07:23AM - edited Sep 20, 2013 07:25AM by Dulcigirl",
      "MessageIndex": 120,
      "PostDate": "20/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810696",
      "Title": "\"Awareness\" rant! kayrnic AmyJM"
    }
  ]
}