{
  "AuthorID": "Dutchie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
  "Posts": [
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Feb 4, 2013 05:22PM Dutchie wrote: Hi to all you amazing ladies! I was diagnosed at 39 stage IIIb inflammatory breast cancer in 2008 and after repeated falls and dizziness diagnosed with brain mets in 2011. Also have a single small spot on my liver. I've had epirubicin, cytoxan Avastin, taxotere, Herceptin, Xeloda, gamma knife and a craniotomy to remove the large tumor on my cerebellum. I've got two daughters, 13 and 15, and a wonderful husband who is not such a wonderful nurse! Luckily I've been able to stay very active and strong. I wish all of you he very best! Nice to \"meet\" you. Your stories have inspired me.",
      "MessageIndex": 121,
      "PostDate": "04/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798841",
      "Title": "Roll Call 2013 LilSchatzie reader123"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Nov 29, 2015 01:09PM Dutchie wrote: Thank you both for the reminder to follow your own instincts and for the scan info- sounds like i'm having exactly the right test with blastic lesions. It's not extremelycommon to have arthritis at my age (47) , although it's certainly possible. But with my history, and a sudden onset, how could you not check it out? I get annoyed by the, \" Go see an orthopedist and leave me alone\" attitude.",
      "MessageIndex": 30,
      "PostDate": "29/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789488",
      "Title": "Can bone mets be missed with regular CT and bone scans? foreverhopeful GoldenGirls"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Nov 29, 2015 10:54AM Dutchie wrote: Hi all,  I have brain mets but no experience with bone mets...I have had clavicle and rub pain for a month so my",
      "MessageIndex": 26,
      "PostDate": "29/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789488",
      "Title": "Can bone mets be missed with regular CT and bone scans? foreverhopeful GoldenGirls"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Nov 29, 2015 10:59AM Dutchie wrote: Hi all,  I have brain mets but no experience with bone mets...I have had clavicle and rib pain for a month so my doctor decided to do a CT scan. It showed blastic lesions on my collarbone.. She told me she wasn't worried about it because it was on my collarbone. And she had never seen Mets there before? That doesn't seem like a scientific diagnosis to me; what do you think? Then she said blastic lesions were only for prostate cancer. She said if I wanted a bone scan that would be fine. I'm thinking yes, of course, just to be sure why wouldn't I? I'm not panicked, but I'm also not as complacent as she is. What do you think? Is a bone scan a good test for this type of lesion, which I know can occur with breast cancer regardless of what she says. I am in excruciating pain. I'm not worried; I just like to be thorough. Any thoughts? Or advice, it would be appreciated. Besides get a new oncologist which I suspect should happen!",
      "MessageIndex": 27,
      "PostDate": "29/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789488",
      "Title": "Can bone mets be missed with regular CT and bone scans? foreverhopeful GoldenGirls"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Apr 8, 2012 01:30AM Dutchie wrote: Hi Chrissera, I'm sorry for what you're going through; I remember the beginning phases after being diagnosed and it is exactly as you say-- chaos, tests, more tests, more chaos, and a million unknowns. Trust that it will all come together, maybe not as fast as you like, but it will. You said you don't know how to act right now but things WILL get clearer and when they do, you will be able to take a stance and face this thing with confidence.   I wish you all the best with your surgery and if you have any specific questions at all, day or night, I'm certain there is someone here who can help you. In the meantime, I think it's a fine idea to get that sleep or whatever you need to be able to deal with all this better. Taking care of yourself will be incredibly important, period.  Good luck!   P.S. Great advice above from Lowrider about going on the internet/WebMD/etc. A lot of websites will scare you to death and not provide the right information for you.",
      "MessageIndex": 4,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785455",
      "Title": "Just Diagnosed and Confused chrissera Butterflylady2012"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Aug 10, 2012 11:36AM Dutchie wrote: Bhd1 I had one of my elderly neighbors actually buy me some kind of miracle herb for like 200 dollars and this guy had absolutely no money. I was touched but didnt want him to pay for something I wasn't going to take! So I told him I had to check with my oncologist just in case and then told him she said there would be some kind of interaction..it was a lie but better than hurting his feelings. I've also told people I have a lot of allergies to be careful with, which is true.",
      "MessageIndex": 189,
      "PostDate": "10/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Aug 3, 2012 08:35AM Dutchie wrote: Another guy said to me ( again when I was wearing a scarf) \"what kind of a crazy haircut you got under there? It makes you look like you're bald!\"",
      "MessageIndex": 97,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Aug 3, 2012 09:23PM Dutchie wrote: Sorry if I'm over posting here but just remembered...when I was first diagnosed a coworker of mine said \"now you can get pot legally! Lucky!\" So stupid. Especially since maybe I'm a geek but I've never smoked pot. Legally or otherwise. These are the same people who think \"free implants.\" Yeah, they're totally worth having cancer for....NOT!!",
      "MessageIndex": 119,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Aug 6, 2012 04:23PM Dutchie wrote: Today I had an MRI and the nurse asked me about what treatment I had had over the past 5 years. After I finished my list she said, \"wow! That's a lot of chemo! Are you sure you needed all that?\" Seriously? I felt like saying,\"no, I needed most of it but the rest was just for kicks.\"",
      "MessageIndex": 163,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Aug 9, 2012 09:13AM Dutchie wrote: I have a \"stupid cancer\" bumper sticker and some lady I've never met asked me where I got it and who I know with cancer. So I said, me, and she started to panic!! \"but you're better, right? You're in remission, right? When I explained that I wasn't she started bawling. No lie. Bawling. Then she ran to her car and gave me her most favorite rosary beads. I tried to console her (WHY are we always the ones educating an consoling others?! ) and told her the beads weren't necessary but I also try to be gracious so i accepted then (I'm not catholic or even Christian). So I left on my merry way for a great day at work and she say there crying. What's scene.",
      "MessageIndex": 174,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Aug 4, 2012 08:43AM Dutchie wrote: OMG EnglishMajor love it!!!!!!!!!!!!! Surly I can't thank you enough for the scarf recommendation. Your timing is spot on and I hate wigs. Never been happy with my scarves so truly...thanks!!! Coolbreeze you bring up a fantastic issue--fear of death. I work with elderly people so even though we are having a rocking good time usually it's an inevitable issue. I get a lot of wisdom from them in terms of their views on death and life and it's a great comfort. To the woman posting about her mom I would say how terribly sorry I am. I'm not qualified to give advice but I can tell you what my old ladies tell me: don't let your fear of death ruin your enjoyment of the life you have left. Every minute is a blessing. It's ok to feel like, \"I'm just happy to be here!\" Sometimes that's enough.",
      "MessageIndex": 129,
      "PostDate": "04/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Aug 9, 2012 04:31PM Dutchie wrote: I'm not a negative person by nature, and even though this is supposed to be about stupid things people say, I've had some incredible kindnesses done and tactful things said to me. In fact I think it's all in how things are said. Although I am an atheist as well, I'm touched when people ASK if they can pray for me. And not out loud or in front of me, just because they want to help. It doesn't become about THEM that way. I've received some incredibly kind and thoughtful things...maybe we can start a new thread about people who do the RIGHT thing for us. :)",
      "MessageIndex": 180,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Aug 11, 2012 07:12AM Dutchie wrote: Linda that's great news! I'm so glad you got good support here. Take care!!",
      "MessageIndex": 642,
      "PostDate": "11/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Aug 2, 2012 11:29PM Dutchie wrote: I've said this before on another thread but it still amazes me...an older gentleman at the supermarket was staring at me (noticing I was bald under my scarf) for like 10 minutes until I finally had enough and looked right at him...at which point he said. \"tsk tsk.... You're a smoker, aren't you.\" What?! (for the record I've never smoked) I also got told, \"you just need to live long enough for them to find a cure...it won't be long--I'm sure of it!\"",
      "MessageIndex": 88,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Jul 29, 2012 09:07PM Dutchie wrote: 39 stage 3b 43 stage 4 I am absolutely shocked by this thread! I always thought I was young to have this but a quick scan of these posts shows me I'm average at most. What a crime that we are all between 23 and 51 (sorry if I missed someone but you get the idea). Makes you wonder. Wow.",
      "MessageIndex": 830,
      "PostDate": "29/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Aug 11, 2013 08:46PM Dutchie wrote: Dx stage 4 at 39. Heavy family history and was never told about testing even after beginning treatment. It was my idea to get tested. What a joke.",
      "MessageIndex": 944,
      "PostDate": "11/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Jul 26, 2013 06:46PM - edited Jul 26, 2013 07:53PM by Dutchie",
      "MessageIndex": 137,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807898",
      "Title": "Update on me - brain surgery scheduled nancyh RonnieKay"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Jul 27, 2013 10:58AM Dutchie wrote: Becca what a fantastic point. Mine was passed down through my dad. I learned in the counseling about genetic testing that it happens that way too. Fire I just wanted to answer your question bout how I found out but I'm afraid it won't help you. I had a large bruise. That's it! And hadn't hit myself. But I have inflammatory breast cancer so it's different.",
      "MessageIndex": 17,
      "PostDate": "27/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Jul 26, 2013 06:27PM Dutchie wrote: Hi Shelby, I'm sorry for your anxiety. While you're right to say we need to advocate for our own health, I couldn't agree more with Annette47. You did the right thing going to someone with experience. An that person will not tell you to wait 6 months if its truly suspicious to them. I agree with Annette47 that sometimes what we think are instincts are really fears. May I ask how old you are Shelby and if you have other risk factors? It's just that statistically most all lumps are benign. Here is what I'm hoping will help: I am sure what scares you is the whole \"catching it early\" issue. But millions of women safely watch and wait out a suspicious lump safely under a doctor's care. Good luck to you! And to answer your question I've had it go both ways with instincts. I was positive I ha breast cancer but was positive I didn't have brain mets when I did. And was positive I had bone mets in my back that turned out to be a gall bladder duct stone. So there you have it!",
      "MessageIndex": 3,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Jul 26, 2013 08:49PM Dutchie wrote: I can relate very much in that I had a similar family history and was not surprised at all when I was diagnosed at 39. So now I understand better that \"fated\" feeling you may be having. That said with your history you should be closely followed by a breast specialist, forever, period. Even at your age. Sounds like with your diligence you will always be on top of it. I'm sorry you're facing a 5000 cost for the test. I had to pay 400 dollars out of pocket and it stunk. I'm glad you reached out and believe me it's because we are fighting this that we want to help! Take care!!",
      "MessageIndex": 9,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Apr 8, 2012 12:50AM Dutchie wrote: Such tragic news...you don't know me but I am the same age as your sister and I am so sorry. I wish you and your family peace and comfort.",
      "MessageIndex": 9,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785463",
      "Title": "My Sister Passed Away Tonight Curlylocks kaycancer"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Jul 26, 2013 07:33PM Dutchie wrote: Please also keep in mind that pain is not an indicator of cancer. Some lumps are many are not at all. The aching does not mean it's more likely to be malignant.",
      "MessageIndex": 6,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Dutchie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148607/profile",
      "Content": "Jul 26, 2013 06:36PM Dutchie wrote: Sorry I see that you're 34 I missed that the first time.",
      "MessageIndex": 4,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    }
  ]
}