{
  "AuthorID": "Dxlsoleil",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289153/profile",
  "Posts": [{
    "AuthorID": "Dxlsoleil",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289153/profile",
    "Content": "May 16, 2019 05:05AM - edited May 16, 2019 05:30AM by Dxlsoleil I am four years out from APBI, I had the catheter placed on a Thursday, and started therapy on Monday, two times a day for five days. For me the worst part was that weekend in between. I wasn't in a lot of pain, but it was uncomfortable, sleeping sittting up was hard, and it kind of weirded me out to have that sticking out of my body. What I hated was having to clean the insertion point (at armpit) at home, alone over the weekend, twice daily. I was so afraid of getting an infection. I am lucky that my job allows me to work from home. Even sit baths get old after a week! A week after treatment I developed radiation burns. I had not been warned about that, and was on vacation in New Orleans, in July, not a place to be when you have radiation blisters (it was about 95 degrees every day! Sweating and blisters are not comfortable). On this same trip I developed Mondors Cord from just below the areola, down the breast to about three inches below, something else I had never heard of. I don't know if this was the result of the lumpectomy or the radiation. Again, not painful, but uncomfortable. It AUDIBLY snapped about a week or so later, which provided a lot of relief. The one thing that no one told me about, but, several doctors have told me since is a “known side effect\" of brachytherapy radiation, is the fibrosis and necrotic tissue I developed where the catheter was. I noticed a very hard lump about three years out, and it was visible (only nude) and somewhat painful four years out - this increased visibility could have been due to recent weight loss. BS suggested massage, which was painful (so probably didn’t do as much as I should) then PT, which could also be painful (why is it easier to have someone else inflict the pain?). It would start to dissipate only to return the next day. I was surprised that with all my research, multiple appointments with BS, RO, etc, (they were very patient with me), and various second opinions, this never came up. I am now one week out from having reconstruction on the left breast, removed the fibrosis and necrotic tissue, redistributed the remaining tissue (not much, with the weight loss, I was down to an A cup), and had silicone implants placed to even things out. I understand it is risky to work on radiated tissue, my BS recommended a PS with experience with this, and she felt that I am a good candidate. I had my first follow up two days post surgery, and didn't really spend a lot of time with PS, and it was first day without pain killers, so I may still have been a bit scattered. I hope she books a lot of time for my follow up in five days as I have a lot of questions after reading other stories. But, so far, everything is going great, wearing the surgical bra at night, and a sturdy, UNDERWIRE, sports bra by day. PS said I should do this to help the left pocket - one of myriad of questions I have for her, as I everything I've read strongly suggests not to use underwire. Which makes sense, since it is rubbing on the incision. If you are considering any brachytherapy radiation, ask about the risk of developing fibrosis and necrotic tissue I should add that the dermal fibrosis and fat necrosis that was removed all tested benign! Good luck everyone ",
    "MessageIndex": 335,
    "PostDate": "16/05/2019",
    "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842473",
    "Title": "Savi radiation treatment Sweetpea5741 ceanna"
  }]
}