{
  "AuthorID": "DZF60",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240410/profile",
  "Posts": [
    {
      "AuthorID": "DZF60",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240410/profile",
      "Content": "Nov 10, 2016 07:56PM DZF60 wrote: Thank you everybody for your input. My MO is against the chemo but said if I insisted, it would be 4 rounds of CT (I think? My brain is fried right now) - chemo would be every 3rd week.. He's really against it though. I just can't wrap my head around having a positive node with no chemo. And, who knows exactly how many nodes were positive as surgeon only took one. If indeed there were more than 3 positive, well, that invalidates the whole onco score doesn't it? I'm getting a second opinion next week at Fox Chase Cancer Center with Dr. Lori Goldstein. And yes, I was on Tamoxifen first time around, 2005-2009 and then Letrazole (so my onc says, but I don't remember that, BIZARRE! - 2010-2013.) That's a weird 4 year time frame - I've been trying to corroborate this with my nearby pharmacies, but am having trouble getting records from back then. I appreciate everyone's input. I wish it was absolutely cut and dried for me - node positive, chemo will help. I would sleep better at night.",
      "MessageIndex": 8,
      "PostDate": "10/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849866",
      "Title": "Low Onco Score but Node Positive - Chemo? DZF60 coraleliz"
    },
    {
      "AuthorID": "DZF60",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240410/profile",
      "Content": "Nov 9, 2016 06:15PM DZF60 wrote: More information, I'm even more confused. 5 year risk of recurrence with just Tamoxifen is 7%. 5 year risk of recurrence with Tamoxifen and chemo is 10%. This doesn't make sense. But my onc said it could be. I contacted Lillie Shockley at JHU and she said those scores sounded stange (reversed) and I should contact Genome, which I did. They are standing by the #'s. Please, please can somebody weigh in on this? Is this possible? I need to move forward with treatment soon! Thanks!",
      "MessageIndex": 1,
      "PostDate": "09/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849866",
      "Title": "Low Onco Score but Node Positive - Chemo? DZF60 coraleliz"
    },
    {
      "AuthorID": "DZF60",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/240410/profile",
      "Content": "DZF60 wrote: Hello - Just got my Onco score today. It's a \"2\". Is that even possible? Meeting with MO tomorrow to discuss. I'm not trying to avoid Chemo. This is my second breast can cer, first one in 2004, 12 years ago. Had chemo then and it was doable. For this new cancer - IDC, 1CM, ER/PR + (94% each), Her 2 -. 1/1 positive nodes. I was pissed that my surgeon didn't take more nodes. The one that was positive had 5mm of cancer on it - so not microscopic. So I am VERY nervous about the node situation and wanted the surgeon to take more. He said he didn't think it was necessary. Now I'm counting on chemo, rads and AI's to take care of anything left behind. I don't want to give up the chemo, but what does a 2 mean exactly? Thanks for all your help. Dx 10/2016, IDC, Left, 1cm, Stage IIA, 1/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849866",
      "Title": "Low Onco Score but Node Positive - Chemo? DZF60 coraleliz"
    }
  ]
}