{
  "AuthorID": "DZLassie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164838/profile",
  "Posts": [
    {
      "AuthorID": "DZLassie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164838/profile",
      "Content": "Nov 24, 2012 04:18AM DZLassie wrote: Hi everyone. Things feel like they have moved so fast for me after an interminable time of waiting to know what was wrong with me. Originally my breast surgeon felt I had extensive DCIS and warned me there was a 60% chance of microinvasion or IDC. Path report after mastectomy (DCIS waaaaay too extensive to consider lumpectomy plus path on that was grade 3 E/R -, pR-) showed multifocal IDC. Although the largest was only about 8.5 mm, there were enough of them that I was staged Ib. Saw my oncologist last Thursday who wanted me to start chemo ASAP, had a medi port put in on Tues and first chemo on Wed before Thanksgiving. Feeling a bit overwhelmed at the moment, primarily due to pain from port procedure. It feels likes there is a poodle sitting on my chest and neck (I don't want to say an elephant because it is not a heart attack - just pain). It still hurts to swallow and breathe and the frustrating thing is I was doing so well post mastectomy surgery.  I was up walking 2-4 miles a day the within a week. But this has me so down. And I hate going back on the pain meds because the chemo/pain med combo has made me constipated. But I really don't know what else to do because the pain is waking me up in the middle of the night. And I am sure the fatigue from the chemo is not helping anything - had to take a 3 hour nap this afternoon after an hour or so of sitting in a wig shop. Sorry for the middle of the night self-pity party but if anyone knows whether the pain from this port procedure will go away quickly, or has advice on that score, I'd love to hear it. Thanks. ",
      "MessageIndex": 586,
      "PostDate": "24/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "DZLassie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164838/profile",
      "Content": "Mar 11, 2013 06:57PM DZLassie wrote: Hi. Luvbugs. I am feeling more tired and nauseous than usual after my last chemo. But I guess it is to be expected after 6 poisonings. This is the hardest part for me - making myself sit back and rest when all I want to do is be busy with my kids. The rational part of me realizes that this is short term stuff. I should be getting back to myself by the end of the week at the latest. But right now, I am frustrated (and nauseous - sooooo not helping). So I tell myself tomorrow will be better than today and hang on to that. I need to get better quickly because I am looking at having my implant put in fairly soon. I have been having recurring large seromas around my TE and my PS wants to deal with it as soon as I am recovered from chemo to prevent infection. I am onboard with that plan as my sister-in-law is getting married in May and I want to be fully recovered from surgery for that event!",
      "MessageIndex": 1944,
      "PostDate": "11/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "DZLassie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164838/profile",
      "Content": "Mar 8, 2013 05:44PM DZLassie wrote: Hi everyone. I've more or less been a lurker here since my diagnosis in Sept. I have really appreciated all the good advice and thoughts you all have shared over that time. I just wanted to celebrate that I finished my last chemo of taxotere and carboplatin on Wed. and while I feel awful at the moment, I am counting the days until I start to feel better again. I am trusting that the Herceptin only will not be so bad - I so need to get on with my life. So thanks for being a lifeline for me even when you didn't even know I was there!",
      "MessageIndex": 1930,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "DZLassie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164838/profile",
      "Content": "Nov 29, 2012 07:48AM DZLassie wrote: Thanks everyone for your support and suggestions. I did go for a stool softener and ended up fighting diarrhea for a week! But have finally gotten over the hump on the port pain. I still have a lot of muscle stiffness in my neck, but the radiologists who checked my site did a chest xray to make sure everything was where it was supposed to be because my pain was unusual. So now a week after my first treatment, I finally feel like the nausea is mostly passing and I might have some energy. My oncologist gave me new nausea meds for the next treatment cycle (12/12) so I am hopeful that it might not be so bad next time. Thank you for everything!",
      "MessageIndex": 751,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "DZLassie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164838/profile",
      "Content": "Mar 11, 2013 07:05PM DZLassie wrote: Txjunebug - I have had drains twice (one lept for freedom early and had to be replaced) and I found the easiest way to deal with them was with a lanyard that had two large baby size safety pins on them that I could run through the plastic loops on the drains. It kept them out of the way and not stretched at the suture sites. And I got my post mastectomy front closure bras at WalMart - they were basically like sports bras.",
      "MessageIndex": 1945,
      "PostDate": "11/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    }
  ]
}