{
  "AuthorID": "EachDay",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
  "Posts": [
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 24, 2007 05:09PM EachDay wrote: Everyone reacts so differently to the different drugs.  I was on A/C and Taxol.  On A/C I felt better by the 3rd week...I had some energy, I felt \"able\" and I would do the things I wanted and could in that week.  I never pushed myself, took things at my pace so that I could enjoy those good days. With Taxol, my worst days were 3 and 4 of treatment, and by week 3, once again I was feeling \"able\". As the treatment progressed though, the energy level dropped (as is expected) so even my good week wasn't me running, or racing around.  I was working at my pace. Terry is right...give yourself time and take it easy.  No need to push it...do what your body is telling you it can. Best of everything...it's a challenge and it takes time to adjust and come to what your \"new\" normal is for treatment time.",
      "MessageIndex": 4,
      "PostDate": "24/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692588",
      "Title": "are there ANY good days? Methusala gshoemate"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 24, 2007 04:01PM EachDay wrote: I had chemo and rads following a lumpectomy and an axillary dissection.  I am part of a study that did rads to breast and underarm and was randomized to the group having rads to both areas.  I did 30 rads, had 27 lymph nodes removed and this was in February/March 2006.  I have full use of my arm, and while they \"warned\" me that having radiation to the armpit could induce lymphedema I chose to take part in the study regardless.  So far I have no signs of lymphedema and I make sure to use the arm to keep it flexible.  A tough choice to make but having had 1 lymph node affected I felt more confident having the rads to that area as well.  Down the road this study should determine if there is any extra benefit.  I felt it was worth doing for those coming behind me, not just for my own benefit.",
      "MessageIndex": 3,
      "PostDate": "24/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/692289",
      "Title": "Lost in grey area: Sentinel node biopsy followed with axillary lymph removal and rads ? trigeek TenderIsOurMight"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Jul 20, 2007 04:18PM EachDay wrote: I'm glad you called and found that it was something \"simple\". I had that and hadn't found this site yet and had no idea what was going on...at first I thought I was hearing things!! And when I realized it was coming from my breast, I kind of freaked out!!! I'm 2 years from my lumpectomy and it definitely went away, fairly soon after I noticed it. So many things go on with this that we have no clue about..glad you had joined this site and knew to ask the question. Hope you continue to have a smooth recovery.",
      "MessageIndex": 9,
      "PostDate": "20/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/657443",
      "Title": "Ever had a sloshing sound? Bliz Bliz"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 1, 2007 04:24AM EachDay wrote:",
      "MessageIndex": 2,
      "PostDate": "01/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/688748",
      "Title": "Any Advice? LDH leaf"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 24, 2007 04:48AM - edited Sep 24, 2007 04:48AM by EachDay Eula, I had a lumpectomy with chemo and radiation (whole breast).  My cancer was in the right breast so I didn't face the decision you need to make regarding the heart, and I wasn't offered mammosite. You are her2+ so I assume that you will also be having Herceptin at some point in the treatment journey. This is not an easy decision to make (none of the decisions we have to make are easy), but you are doing your homework and that's wonderful ~ it will give you a sense of having made the most informed decision. First I do want to say though, ((((Eula))) you are 67...and the next 15 years or so are significant....please remember that.  Whatever years we have are all significant.  I understand what you were saying and what you meant with regard to making life choices...I just want you to remember that there is value in every day we have...however many and while this is a difficult time of decisions, you never have to make any part of it or your life insignificant. You are worth every single one. The other thing I wanted to mention was that there is a thread in the \"Growing our Friendships\" forum entitled \"mammosite buddies\".  You might find some information there or by speaking to some of these women on the thread or in PMs...in this wide world on breast cancer.org there are going to be women who have been in your position. Best of luck with your decisions and your treatments Eula.",
      "MessageIndex": 1,
      "PostDate": "24/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692614",
      "Title": "Radiation Therapy Eula FitChik"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 17, 2007 06:53PM EachDay wrote: as my kids said when they were little, \"JUST BECAUSE\"!!!",
      "MessageIndex": 21,
      "PostDate": "17/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692278",
      "Title": "I love Shelli because....... geeta75 rue2u"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Jul 14, 2007 05:52PM EachDay wrote:",
      "MessageIndex": 6,
      "PostDate": "14/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/654142",
      "Title": "Prayer Thread for Olivia and Lisa40 boobbuster pinkyreeny"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 1, 2007 05:30AM EachDay wrote: Well said Mel. There are time patterns that are followed, most having to do with healing, not just physically but emotionally. I finished with surgeries end of July 05 and started chemo end of August 05. Rads weren't until I was fully one month from finishing chemo and again with herceptin, I had a one month rest from rads. And I'm glad I did. It's a lot to happen to the body physically, and it's an awful lot emotionally/mentally. Those \"breaks\" are so needed and welcomed. Time for you to catch your breathe before heading into the next part of what I called my \"triathlon\".",
      "MessageIndex": 18,
      "PostDate": "01/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/685875",
      "Title": "questions for those done w/chemo bluewillow karen1956"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 21, 2007 08:29AM - edited Sep 21, 2007 08:31AM by EachDay You've had to deal with so much ~ your father's death and now having this MRI.  My sympathies on your loss.  It's hard to lose anyone we love but especially a parent. Add in the waiting and it's stressful to the nth degree.  It's little wonder you are freaking out a little bit.  Loss has been a large part of your life right now and fear of death will be weighing heavily with you. The first thing  our mind does is go to the worst place, like sticking your tongue in a tooth with a cavity.  So naturally you are assuming the worst because the receptionist told you the doctor would fill out the form for what you are having done and you don't like the options.  Totally understandable.  I think we'd all go to that place immediately! Perhaps it's to be on the safe side.  If your doctor will no longer be part of your insurance group as of Tuesday night, perhaps they are trying to get you on this form in case this becomes necessary and then it was all signed and sealed \"before\" the change happened so that you are covered.  And if it's nothing?  Then nothing has been lost.  The worst thing about doctors/nurses...they leave out key parts in what they are doing.  They tell us what they think we need to know and no more.  And when we are afraid we don't think to ask or we want to know but are too frightened to ask.  There is much too much lack of communication in the medical field at times. So, we'll keep positive thoughts, send up lots of prayers for you. Be scared, admit that and it's okay to admit that and then try to focus on something that makes you happy or gives you pleasure until you have something more to go on.",
      "MessageIndex": 2,
      "PostDate": "21/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/692466",
      "Title": "Waiting Again (& Again) grouch2 awb"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Aug 18, 2007 07:09AM EachDay wrote:",
      "MessageIndex": 2,
      "PostDate": "18/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/679409",
      "Title": "Need for additional node surgery? rxt774 LizM"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 18, 2007 06:50PM EachDay wrote: If you have found a lump,  you are having nipple discharge and you have a close family history of breast and ovarian cancer, I am surprised that your doctor has not scheduled a mammogram.  Regardless of your age, when these symptoms present, the next step is a mammogram. If your doctor is denying you this, I suggest you might want to find another doctor who will.  This is not something to just \"leave\" because you are young.  Better to have it checked and know one way or the other. You are more than welcome to come here and vent, ask questions and discuss your concerns.  That's what we're all here for.  To help one another.",
      "MessageIndex": 1,
      "PostDate": "18/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/692379",
      "Title": "A lump has been found and I have recently had issues of nipple discharge DreamingApe EachDay"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 18, 2007 10:32PM EachDay wrote: I'm not used to having to book appointments myself.  In Ontario it is done for us when the doctor makes a referral. The best I can suggest given the set-up in BC is to call your doctor, explain that you are being denied and get the doctor on this asap.  That is your right and it is certainly the doctor's responsibility to see that any tests you need are administered.  As \"Tender\" said, you've maybe hit a bureaucratic employee who is just \"going by the book\" and not understanding that there are exceptions to rules. As for the nipple discharge, while it can be associated with breast cancer, it is also possible as you had been thinking that it is hormone based.  I've had galactorrhea before which is hormone related and causes discharge.  If you are using hormones for the endo (which I've also had) you are certainly \"playing\" with your system and all of this could be related to that. I'm not clear if you went to your gp for this or your gyn/ob...have all the issues with the endometriosis and the hormones been checked into (are you taking danazol or an estrogen, progesterone?) and ruled out? Don't let the system hold you back Dreaming...get the answers you deserve.  Your age should not be held against you.  That's discrimination.",
      "MessageIndex": 7,
      "PostDate": "18/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/692379",
      "Title": "A lump has been found and I have recently had issues of nipple discharge DreamingApe EachDay"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Oct 22, 2007 04:41PM EachDay wrote: I think this is an excellent question of valid feelings, worries and fears.  Issues such as breast cancer, and all the other things that seem to hit us with this (or the cancer comes after other life changing, traumatic events) disease.  And we question our faith.  I think this is normal and perhaps even necessary.  If we have become complacent our faith is shaken so that we can re-examine and re-evaluate our lives, our belief system.  There are times when we seem to be left on our own and abandoned.  It has been my experience that those times are when I am meant to look inward instead of looking out...to find what I have, what I can do, where I fit and what I am made of...so that spiritually and through faith I can reconnect with better understanding.  I'm very much impressed with Joel's response.  He and I are on the same path here but he has said it so much better.",
      "MessageIndex": 9,
      "PostDate": "22/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/694218",
      "Title": "Has anyone lost their faith? Bendcoles arnica"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 20, 2007 08:17AM EachDay wrote: My gosh Dreaming, you have given your body a wallop with all the hormones your doctors have given you for the endo!!  More and more I'm thinking that your woes are from all of this, but I completely understand your concerns about the discharge and the lump being breast cancer, and with your family history I would want that ruled out or discovered, whichever it is to be.  It would be wrong to just \"assume\" that the hormones are the culprit here and you have the right to know for certain.  You also have the right to be tested to be sure, no matter your age. With the endo, I would expect you have had a laparoscopy and are not just doing hormone treatment.  Have you had other surgery to reduce the adhesions? Which doctor is looking at you for the lump and discharge...your gp or your gyn/ob?  Hopefully it is the gyn/ob and hopefully this doctor is pushing for an answer asap.",
      "MessageIndex": 9,
      "PostDate": "20/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/692379",
      "Title": "A lump has been found and I have recently had issues of nipple discharge DreamingApe EachDay"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 19, 2007 04:51PM - edited Sep 19, 2007 04:52PM by EachDay A beautiful family. And two beautiful women...friends forever. Sending prayers for Shelli's spirit, her family and for you Geeta.",
      "MessageIndex": 17,
      "PostDate": "19/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692418",
      "Title": "Shelli is an angel geeta75 Sige"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Aug 27, 2007 06:03PM EachDay wrote: My thoughts and my prayers are with you Jill.",
      "MessageIndex": 12,
      "PostDate": "27/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/654197",
      "Title": "Stem Cell Transplant for Mets Jillt katie11"
    },
    {
      "AuthorID": "EachDay",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52442/profile",
      "Content": "Sep 21, 2007 09:44AM EachDay wrote: Poor girl...she is having such a rough go and she's got such wonderful spirit.  Her body is fighting infection on top of the chemo.  I love her spirit and her determination but she also needs to rest. She's in a good place right now with many experienced doctors who sound like they are staying on top of this. Your fear and anxiety are real ~ you want to help but are powerless to do anything to help physically.  But your love and your concern and your prayers will do wonders for her.  Keeping positive thoughts for her and keeping her in my prayers...and all of you.",
      "MessageIndex": 6,
      "PostDate": "21/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692481",
      "Title": "Pixie's Husband Here. I Need Your Prayers. PixieDust wackyjackie"
    }
  ]
}