{
  "AuthorID": "eafarchette…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71381/profile",
  "Posts": [
    {
      "AuthorID": "eafarchette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71381/profile",
      "Content": "eafarchette wrote: OK. They finally got me the results from my mammo & u/s. U/S came back showing just a cyst in my right breast (yeah!!!) however...mammo shows the lymphnodes in my left breast are enlarged from the armpit and across the top of the breast and down around the left side of the breast. Dr. has ordered full lab work up and is hesitant to order the biopsy until we get the lab results as the lymphs are so swollen. Has anyone else ever been through this? My grandmother had lymphoma years ago but was in remission when she did die of heart failure. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/721073",
      "Title": "Finally got results but... eafarchette wishiwere"
    },
    {
      "AuthorID": "eafarchette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71381/profile",
      "Content": "eafarchette wrote: I'm in total disbelief as I am writing this. I had a mammogram and ultra sound 10 days ago and I just called the radiologist's office and was told that they have not even read the tests yet! My general physician sent me for the tests after I went to see him because of a burning in my left breast and nipple area, redness to the breast and the lymph node swollen in my arm pit. Since then he has treated me for Mastitis with a 10 day supply of Keflex, but the only change there has been is the additional swelling of another lymph node. My husband and I have decided that it might be prudent to seek medical treatment in Florida as we live in the caribbean and I can't get an appointment with my general doctor for another week and can't get into see my ob/gyn for at least 2 more weeks.  Am I jumping the gun? I'm trying to be pro-active, but I just don't feel right and the symptoms seem to be getting worse. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/720890",
      "Title": "Need to vent eafarchette leaf"
    },
    {
      "AuthorID": "eafarchette…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71381/profile",
      "Content": "Aug 28, 2008 07:47AM eafarchette wrote: Thanks to all of you who replied. I live on the Island of St. Croix approx 90 SE of Puerto Rico. I do have access to the mainland as I have family in FL (Orlando). My plan is worst case scenario to go there as our local oncologist is based out of St. Thomas, and we normally would have to wait up to 3 weeks for an appt. I'm trying to plan for the worst and hope for the best. The tip to have a second opinion/reading I had no idea you could do. That tip will come in very handy...thanks so much!",
      "MessageIndex": 4,
      "PostDate": "28/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/720179",
      "Title": "New member w/question eafarchette eafarchette"
    },
    {
      "AuthorID": "eafarchette",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71381/profile",
      "Content": "eafarchette wrote: Good Morning, My cousin recommended that I check this site out. I am 45 years old and my last child is now 14 yrs. old. About 3 weeks ago I started noticing that the nipple area on my left breast was sensitive. This was about a week after my last period. I suddenly got my period again 2 days later. Since then my breast has become more sensitive, with occasional sharp shooting pains through it. By last Saturday, the Lymph Nodes in my left armpit had swollen and become very painful. I saw my family physician on Monday and he diagnosed me as having Mastisis and put me on an antibiotic and a painkiller. I am scheduled to go for an ultrasound and mamogram this Friday. I am now hearing that it will take up to 3 weeks to have the tests read and the results sent to my doctor. I live on an island in the caribbean so our services are somewhat limited. I am trying to be pro-active \"just in case\". Is there anything else that I should be doing/having done to diagnose at this point? My husband & I are both worried but we don't want to alarm our son. Any recommendations would be greatly appreciated. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/720179",
      "Title": "New member w/question eafarchette eafarchette"
    }
  ]
}