{
  "AuthorID": "EandAsmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268714/profile",
  "Posts": [
    {
      "AuthorID": "EandAsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268714/profile",
      "Content": "Feb 22, 2018 06:07PM EandAsmom wrote: Oceanbum, It was helpful to just hear from someone! Thank you for taking the time to reply. I spoke with my surgeon today and she said to try putting Aquaphor on it and then give it time. I'm hopeful that the bleeding will stop. It has consistently bled today so we shall see. Again, thanks for the reply.",
      "MessageIndex": 2,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/862710",
      "Title": "Bleeding from Nipple EandAsmom EandAsmom"
    },
    {
      "AuthorID": "EandAsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268714/profile",
      "Content": "EandAsmom wrote: Hi! This is my first post so I will give a bit of background. I am 50 years old. Two years ago began bleeding from my left nipple. Spontaneous bleeding, sometimes a lot. It took about a year to get diagnosed with a papilloma and I had it removed last summer. It was bliss to not be bleeding and even better to not worry about bleeding. Unfortunately it didn't last and I began bleeding again this December (6 months after single duct removal) from the exact same place. My surgeon was perplexed.. so I had a diagnostic mammogram..clear.. ultrasound.. confusing results because of previous surgery so I had an MRI which showed an 8mm enhancing mass right below my nipple..radiologist and surgeon believed it to be another papilloma (or adenoma). I had an excision last Friday and this time she removed all my ducts along with other abnormal tissue and sent it off. I am still waiting on pathology. I am not concerned that it is bc. The problem is that today I started bleeding from my nipple again! I am so confused. It is coming out of the same place in my nipple. She removed all my ducts. Where is the blood coming from? She had covered my nipple and areola with glue. For 4 days all was well. Yesterday , I could tell something had changed and it looked like there was bleeding under the glue. After my shower this morning, it's been bleeding. I am talking very little blood....like someone took a red sharpie and dabbed my gown several times....a spot the size of a dime in my bra....just like before my surgery. The blood isn't coming from the incision. The incision is on my areola and looks just fine. The blood is coming from a hole in my nipple like breast milk did. I know I need to call my bs. I live in OK and we have an ice storm so offices are closed and will be tomorrow too I'm sure. It isn't so bad of a bleed I need to reach her like there is an emergency. I am just so discouraged and confused. I have been searching these boards for any story like mine and I really haven't found any answers. I am hoping someone sees this and has some words of wisdom Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/862710",
      "Title": "Bleeding from Nipple EandAsmom EandAsmom"
    }
  ]
}