{
  "AuthorID": "earth",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70302/profile",
  "Posts": [
    {
      "AuthorID": "earth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70302/profile",
      "Content": "Aug 2, 2008 11:19PM earth wrote: Thanks for the responses. I guess I'm probably freaking out more than I should be.  It's just that because of the \"waiting game\" this has been on my mind now for over a month.  I am not finding it that easy to just let something go that has been eating me up for so long.  I had done tons of research before my ultrasound and studied ultrasound images of cysts and malignant tumors online.  While the ultrasound was being performed I could actually see the monitor and saw the one palapable lump was a big black smooth oval.  The other smaller lumps that I couldn't feel looked the same as the other one just much smaller.  From all the images that I saw online my lumps looked like cysts but I'm no specialist so I couldn't be sure of course. I'll probably wait until I get the ultrasound report in the mail and then I'll make an appointment with my doctor to at least talk to him about my concerns.  I'm pretty sure I want the palpable lump aspirated.  I do have breast tenderness/pain.  I would assume the aspiration would help alleviate the pain in addition to easing my mind.",
      "MessageIndex": 5,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/718911",
      "Title": "ultrasound results earth TheQu33n"
    },
    {
      "AuthorID": "earth",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70302/profile",
      "Content": "earth wrote: Been lurking on the board for about a month.  Found a lump while on vacation and had it checked out when I got back.  Doctor sent me in for ultrasound, which took a week for the referral and another week for the actual appointment and then a week and a half later for my doctor's assistant to finally call with the results.  She said it was \"normal\" and that there were numerous cysts in addition to the one that can be felt.  No need for aspiration, no immediate follow up - nada - just come back in three months for my annual physical or if the one lump, cyst I guess gets bigger.  Now, I'm glad they came back as cysts but is this the best way to handle this?  Should I not have a complete breast workup?  Mammogram (I'm 38 - doc says don't need till 40)?  Ultrasound on other breast?  I asked for the assistant to mail me a copy of the report and I'm thinking about going in and actually talking about this to the doctor.  Am I being overly freaked out?  What would you do? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/718911",
      "Title": "ultrasound results earth TheQu33n"
    }
  ]
}