{
  "AuthorID": "EastcoastTS…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
  "Posts": [
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 30, 2017 07:30AM EastcoastTS wrote: Glad surgery went well. Hoping for great path results for you. ",
      "MessageIndex": 8,
      "PostDate": "30/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860998",
      "Title": "Ready to kick it! MHerzberg Georgia1"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 30, 2017 09:31AM EastcoastTS wrote: Shenanigans: Good luck with surgery! I've had to cut out family since diagnosis. Or limit communication. (Brother mostly -- but his kids aren't much better.) But you know what? I think I made excuses for them before and just put up with their bul*sh*t. Now? I'm not willing to do that. And if they have proven to not be there for me...that is a big statement for my future with them. It's actually been liberating. Go figure. Make it all about you right now. Because it is.",
      "MessageIndex": 19,
      "PostDate": "30/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/856657",
      "Title": "Family Is Very Disappointing scar1888 wallan"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 19, 2017 06:42PM EastcoastTS wrote: MHerzberg: I'm so sorry that you've found yourself needing us. But this is the best place to land with this diagnosis. I could not have gotten through the past year without the supportive folks on BC.org. Please ask any and all questions, come here to vent, ETC. We're here for you. {hugs}",
      "MessageIndex": 4,
      "PostDate": "19/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860998",
      "Title": "Ready to kick it! MHerzberg Georgia1"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 23, 2017 06:16PM EastcoastTS wrote: Chiming in with this. I wanted Mammaprint as 2nd opinion, too. Just paid my $500 to Agendia because my insurance denied but they reduced the rate. When you open the bill, you see $4,200 but a letter attached says they will agree to $500. I did not have to ask them to lower -- they just do this. Oncotype also told me they would lower this if insurance denied, which they did not. I don't even blame my insurance for not doing both -- but I wanted both, no matter what. Request the Mammaprint and push your MO if you have to. I did. (And I had a lower score, but wanted to make sure my NO chemo decision was the correct one. My new MO, not the one who ordered the tests, was like: Oh, Mammaprint, too. This is so helpful to have!) Doctors. Sigh.",
      "MessageIndex": 5,
      "PostDate": "23/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/858871",
      "Title": "Oncotype 25 - intermediate risk - Chemo or not? Aymerz33 Aymerz33"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 10, 2018 08:12PM EastcoastTS wrote: Nikki: We are reading this -- and we're here for you. I'm so sorry about your diagnosis. And I can only tell you, as a relative newbie myself, that the fear and what I felt was extreme anxiety lessen as you gain more information and develop a treatment plan. It's terrible that you have family history in play as well (my mother also had BC but is a survivor and currently doing well). Just hang in there and know that you are not alone. Come here to vent, ask questions, ETC. Lots of us have young children, too. We get it. {hugs}",
      "MessageIndex": 6,
      "PostDate": "10/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862380",
      "Title": "Diagnosed with extensive DCIS with IDC at 31 Nikki0828 Nikki0828"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jun 30, 2017 06:41PM EastcoastTS wrote: Fatigue was the only symptom I had (besides finding the lump). Needed naps and just general exhaustion. Attributed to getting older (late 40s) and possible menopause. But no -- it was BC!!!",
      "MessageIndex": 63,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/778724",
      "Title": "Anyone have problems with fatigue prior to diagnosis? cfdr dlj140"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 4, 2017 08:15AM EastcoastTS wrote: Imbca: Except for surgical recovery, I have had more energy POST surgery than prior. The only symptom I had was that I was very tired for a year or so before, too. GOOD luck to you!!!",
      "MessageIndex": 67,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/778724",
      "Title": "Anyone have problems with fatigue prior to diagnosis? cfdr dlj140"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jun 22, 2017 06:31AM EastcoastTS wrote: Look into Charlotte's Web -- Stanley Brothers in CO. They have a great reputation. ;) I live in non-MM state, unfortunately.",
      "MessageIndex": 10,
      "PostDate": "22/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851983",
      "Title": "Cannabis Oil caall1234 Iwrite"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 6, 2017 07:09PM EastcoastTS wrote: BG46TN: I'm having either UMX or BMX with recon. Have to decide what to do! Surgery in 3 weeks. (gulp)",
      "MessageIndex": 29,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 2, 2017 11:50AM EastcoastTS wrote: I want to join if I can, too. My surgery is 2/27 -- so just before March! I joined the Jan. group (not sure if there is a Feb group) but they are all a bit ahead now. ;) Still debating UMX or BMX. Ugh.",
      "MessageIndex": 8,
      "PostDate": "02/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 7, 2017 10:31PM - edited Mar 7, 2017 10:40PM by EastcoastTS Hello all March BC friends: Plantchild: I'll be thinking of you on Friday. Again, what is in our minds (fear/angst) I think is worse than the actual when it presents itself for us to face. You'll get through this. Gardener4: We understand. Our fear is great, too. Maybe different in the case-by-case but fear just the same. But you may have very good news waiting just around the corner. All is still going well with me for the most part. However, I'll be honest, I do find this endeavor to be a (excuse my French) bitch at times. For example: My mother (82 and a genetic freak, TNBC survivor who looks and acts 20 years younger!) is helping me with drains twice daily because my hubby has gone back to work and my son back to school. I'm in hotel in TX for post-op appts and heading home Friday. Anyhoo -- I'm naked in front of her while she drains, and I was a bit modest before this point in my life. Well, no more of that! She might as well be changing my diaper again. It's a bit humbling. Tissue expanders are not horrible to date. Pains but nothing that is constant. More of feeling of pressure but even that not terrible. But I am, again, not expanded very much at all. My plan is to go slowly and be small in the end/all, be/all. For the showering question (sorry I'm trying to keep up with names), your doctor must give you instructions based on what you left the hospital covered in/with. You may be able to shower now or not. I safety pin my drains near neck somewhat away from the incisions (beneath breast fold) and do the best I can to not directly spray water on the incisions (as directed) but clean them, too. Again, this is bitch #2 but it's working well enough. I also bought a handy little item called Shower Pockets which are basically koosies on a string that you place the drains in. They hang near the neck and the whole thing dries quickly after shower. A lanyard or even panty hose (I have heard) work well. Pin and just get the drains high enough to get out of your way. It's not rocket science and is an inconvenience but doable. The koosie item would only work with 2 drains. **The best investment I made was to purchase a waist belt with two hanging pockets (don't know name) to place my drains in. I have used it 24/7. However, someone else said they used a carpenter's pocket/waist thing and I also think one used by waitresses (I used to have one in college job) would work very well, too. No pinning of drains -- just place them in the pockets. It's been GREAT! My only negative is my nipples are not perfect. One is black, the other maybe partially discolored. And some red on the black nipple breast. Not huge area but...Sigh. Tomorrow is PS and MO appts, so we'll see. I'm using the cream, ugh, silverdene or some such that they recommended. Perhaps it's helping or maybe they will fall off. Idk. <?> Other than rotting nipples, this has not been awful! Day 7 and really, my best day yet! Over 2000 steps on Fitbit and lessening meds. You can do it!!!!!!!! Warm wishes to all...my thoughts with you. ",
      "MessageIndex": 136,
      "PostDate": "07/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 17, 2017 08:16PM EastcoastTS wrote: 2FUN: Well, I'm positive about the infection because God blessed me with a good path. report!!! The rest is BS-reconstruction issues. I'd HATE to lose the TE, trust me, but I can deal if it comes to that.",
      "MessageIndex": 268,
      "PostDate": "17/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 26, 2017 02:53PM EastcoastTS wrote: SJI: ILC is \"sneaky\" has more than one doctor has used with regard to mine as well. Good luck with surgery! carmstr835: Welcome to a great and supportive group!!! LAW193: I Googled and found lists on blogs, etc., for things you need for to be prepared for breast surgery. (Also lots on this site.) I had a separate bag all packed for the hospital in addition to things I needed at home. Glad DiV posted an update. I've been thinking about her. Raven: Hang in there! What a trial all this is!!!! I get it. I'm still staring at my breast every day watching to see if the infection/redness dies down. It looks good (much better!) but not perfect. (sigh) I think it's going to be just a wait and see game. Re: Bromelain. I took before and after surgery. NO BS or PS or MO is going to approve this but it's used all the time in Europe and very (!) often in the US for cosmetic surgery along with Arnica. I got drains out at Day 9. Almost no bruising as well (BMX). 2FUN: Well, at least good news about your son and colleges!!! ;) We gotta take what good news we can get, right? Anyone I missed -- warm wishes coming from down South!",
      "MessageIndex": 453,
      "PostDate": "26/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 28, 2017 07:11AM EastcoastTS wrote: BG46TN: My BMX was my first surgery, too. And anesthesia went well. You'll do FINE! Advice I got from many ladies here that I will pass to you: tell them in your anesthesia interview or whatever you call it that you get nauseous easily. Even if you don't! I did and had zero nausea after surgery. Nada. And the stuff they give for nausea in the IV is harmless, I think. So it's can't hurt!!!",
      "MessageIndex": 486,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 23, 2017 09:54AM EastcoastTS wrote: Sjssparks: I had my injections four days prior to surgery. To make sure they could locate nodes. I know some folks have the day prior. Or some just day of -- and you'll already be under by then. Ask your team. I felt they were a breeze but I agree, you want to know what the procedure/process is for all. Or at least I did.",
      "MessageIndex": 377,
      "PostDate": "23/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Apr 8, 2017 01:19PM - edited Apr 8, 2017 01:25PM by EastcoastTS Raven and Bluebirdgirl: SO sorry about infections and the battle. I'm thinking about both of you. I've had this, too. Infection. And am still in a bit of a \"wait and see\" mode as my breast is slightly red in the area still (like 3% from the original, though, however, I'll never feel safe until...well, not sure when!). I did not see an infectious disease doctor but my PS prescribed three antibiotics about 5 days post-surgery. I was horrified at the amount because I eat a lot of probiotic food and take daily probiotic but it did the trick. I hope. Next step for me if comes back, etc., is IV, so perhaps that isn't a bad idea to push for. I also do a lot of Vit C. And for Pugs who asked about my spray paint cat: Yes, there is a homeless gentleman who has a fixation with spraying all his belongings gold. So -- he found a kitten by a dumpster and you get the story. Someone called the police, and the kitten was taken to local shelter I volunteer for. He lost hair, one eye and has some slight issues (neuro?) with legs that no one but me would notice (but I saw him recovering). Chances of survival slim when I brought him into my home. He's now a madman. The one-eyed little bastard!!!!!!!! I do worry about his future. We may be the \"cancer kids\" due to how many toxins he ingested. But he's loving life at the moment. Like we have to, right??? ;)",
      "MessageIndex": 705,
      "PostDate": "08/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 20, 2017 07:51AM EastcoastTS wrote: Marker placed for me at biopsy as well. ;)",
      "MessageIndex": 59,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "May 4, 2017 11:23AM EastcoastTS wrote: Sorry, same for me -- no reply in a long time. I hope everyone is doing well!!! My update is I'm just hanging around waiting for implants. LOL God -- love my tissue expanders! Actually, they suck but not as much as I expected. But they still suck! ;) And I'm only expanded to 205ccs! Maybe another fill or two (small ones) and I'm hanging up my boob hat. I'm also taking the first tamoxifen either tonight or tomorrow morning. Anybody else on the endocrine therapy trail yet? Hugs to all of you!!! I could not have made it through this journey without the support of BC.org team. No kidding at all about that.",
      "MessageIndex": 880,
      "PostDate": "04/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jun 26, 2017 03:38AM EastcoastTS wrote: Nice to see some activity, March 2017ers! I'm doing well. Exchange surgery coming up in Sept. TEs are a joy! Actually, they aren't that bad. Once I got over BMX healing and fills, they calmed down. Went back to work in May -- and though I often feel there are two groups now and it somewhat affects my view of life: Cancer and non -- work is going well enough, too. I just may not care as much about it. Idk. ;) Hugs to all of you!!!! I hope everyone is doing well.",
      "MessageIndex": 965,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 8, 2017 07:25AM EastcoastTS wrote: LisbethS: Stick-on velcro indeed found at Walmart!!! :) Cheers. ",
      "MessageIndex": 141,
      "PostDate": "08/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "May 31, 2017 07:58PM EastcoastTS wrote: Dafne: I understand. Sometimes we get sick of being \"brave\" if that's even a way to phrase it. Fear is hard to admit to -- but damn, how could we not be afraid sometimes with this? Get the BRCA test when you can. More information is power. Also, I dreaded taking tamoxifen and am almost finished with the first bottle! Almost nothing I can tell from taking it -- though may be too soon for SEs, I realize. Hope Team March BC is doing well!!!!!",
      "MessageIndex": 942,
      "PostDate": "31/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jul 25, 2017 10:24PM EastcoastTS wrote: Congrats 2fun!!! And, Raven, I know I posted to you on another thread -- but UGH, TEs SUCK!!!!!!!!!! I hope for the most successful Exchange for you very soon. Mine are set for getting-the-hell-out-of-Dodge (me) on 9/7. Can't wait!!!",
      "MessageIndex": 998,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Aug 1, 2017 05:04PM EastcoastTS wrote: Dafne: GREAT news on the genetic testing! Although sorry about the leaking TE. You, Raven and I will be September Exchange sisters! I'm set for 9/7. Can't wait to be rid of the TEs. Lisbeth: I'm going to jump on the call-your-doctor-ASAP train. I had a post-op infection -- very red breast but no fever -- and it could have meant losing the TEs if I did not get it under control. Which meant antibiotics and a big load of them. But it worked. Just not something you want to mess around with. Hey, guys, what did your doctors say about getting off Tamoxifen before surgery?",
      "MessageIndex": 1007,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 23, 2017 08:53AM EastcoastTS wrote: Lovepugs77: Yep -- sounds like you've been told to manage as I was told (except the cream applied is different). It probably matters little that Emla is prescrip. You'll do fine. And some people may not need the numbing cream but it certainly can't hurt! I also took an ativan, I think. ;) I wasn't driving. It was really a breeze. Slight stinging as the fluid went in but I mean...NOTHING at all. Not painful.",
      "MessageIndex": 369,
      "PostDate": "23/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 28, 2017 07:07AM EastcoastTS wrote: 2FUN: PROBIOTICS: Okay, even pre-C, I was a BIG probiotic proponent. I eat/drink a lot of probiotic foods (Kefir, kimchi, pickles (which MUST come from the refrigerated section of your grocery store to be truly fermented), miso soup, etc.. In any case, try those daily if your palette agrees. Also, my integrated oncologist just recommended a new probiotic (I take one daily but apparently it's basically useless LOL): VSL#3. Once a day or every other if you feel bloating. I just talked to the pharmacist and he said bloating means it's working on the gut in a good way. I had to go to a pharmacy to find but health food stores should have too. It will also be in the refrigerated section and you must refrig at home. FYI: it's not cheap. The pharmacist said clinical info is truly showing how good these are and in the larger (billions) for the probiotic. Culturelle, etc., he said is just not strong enough especially when we've been on antibiotics. I just finished infection round of THREE! Ugh. But due to food and even my shitty probiotic, I'm not having any issues.",
      "MessageIndex": 485,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 29, 2017 01:07PM EastcoastTS wrote: I haven't had a fill yet. Not until 4/11 due to infection which seems like really clearing. I'm not looking forward to it. My pecs are just going to be \"mad\" until this process is over. It's not unbearable but ain't comfortable either. I don't think I was a candidate for pre-pec (if that means in front) because it can place pressure on the skin if you do skin sparing mast., which I did. More chance of necrosis. Unless I misunderstood what they said!",
      "MessageIndex": 526,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Apr 4, 2017 05:37AM EastcoastTS wrote: DiV: So happy to hear from you! My thoughts are with you!",
      "MessageIndex": 622,
      "PostDate": "04/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Apr 6, 2017 03:02PM EastcoastTS wrote: Pugs: So sorry to hear your news. What a long journey this is. My thoughts with you! Hug those kitties!!! (I'm a cat person, too. I actually foster -- or did before C -- but had a recent foster failure meaning we now have a cat whom a homeless gentleman decided he needed to spray paint. Pretty horrifying story but the now teenage cat is doing well. He's actually bananas! We also have another elderly rescue cat and dog, too, and one almost 17 (!!) year old cat who is a neighbor's who has adopted us.) I'm crazy but love the chaos. I think animals are healing.",
      "MessageIndex": 658,
      "PostDate": "06/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Apr 6, 2017 03:03PM EastcoastTS wrote: Oh, my icon pic is the spray paint kitty during the holidays in a baby shirt. LOL I named him Banksy after the grafitti/spray paint artist. My little love wink.",
      "MessageIndex": 659,
      "PostDate": "06/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "May 4, 2017 12:44PM - edited May 4, 2017 12:45PM by EastcoastTS",
      "MessageIndex": 883,
      "PostDate": "04/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "May 16, 2017 01:48PM EastcoastTS wrote: I was also told to take VSL #3. It's medical grade probiotic. I got at a local pharmacy. Not cheap but I think good. I'm happy to dive into alternative discussion, too. I just sent Dafne a PM but glad to discuss openly here if the group is open. I've seen two integrative oncologists (one MD Anderson) and have a naturopath appt this Friday. This is all supplemental to western med. only. I'm doing tamoxifen and the normal stuff. I took supplements prior to BC and had interest, so this is not new to me just a different focus so to speak. ;)",
      "MessageIndex": 928,
      "PostDate": "16/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 5, 2017 10:24AM - edited Mar 5, 2017 10:30AM by EastcoastTS Sitti and March group of fellow BS troopers: Thank you for asking about me and SORRY for not responding sooner. I'm in a hotel, so that may factor into my even being slower getting into normal routine. I go home on 3/10. I decided upon nipple/skin sparing BMX due to multiple factors: dense breasts and mammo finding nothing, finding another small bump/lump a couple of days before surgery on \"healthy side\", etc. I was scared about more surgery of course and having two arms to deal with and mobility but here goes for my progress. I really was almost not sure up to surgery -- ha ha. Or maybe not ha ha, right? I'm six days out (surgery Monday 2/27) and want to let everyone out there facing this know that my experience has been BETTER than I expected. I had tissue expanders placed, 50 ccs filled at surgery (I'm really small and have very small tissue expanders, too) -- and the discomfort has been fine/manageable. Am I taking meds? YES. Tramadol and valium for muscle spasms. I have hydrocodone but have only taken one. I did the pre-Colace regimen + protein + fluids + arnica/bromelain (no doctor is going to jump for joy about this but it's safe) but had to get something else from the doctor because had constipation. Taking supplements (Juven powder, B6, CQ10, Vit C, too, because it can't hurt). I have Mepilex strips covering the incisions in the breast fold, waterproof derma-something with antibiotic sponge covering the drains (only have 2) so I can shower! These I have not touched. Have had swelling and bruising but not crazy amount (I think arnica helps here!). Range of motion is what I could consider very good but I'm horrible and have not done exercises yet. Going to do that today. I think I can do them all though. YOU CAN DO THIS. I think I'll have drains out next week. Also got news (though I was sleeping when I answered and hope it was not a dream, that my nodes were clear!!!). And that the other spot was fibrous, etc. Still glad I did BMX because it has not been that bad and I was not super attached to my AA/A tiny but perky/youthful breasts. I also will say that my path. report now says I am ILC officially, which I'm not at all surprised about. One path report said ILC the other said IDC/LCIS. I have not seen the report, only got this info on the phone. Good luck and warm wishes to all going through this! Ask any questions. I'm here to answer.",
      "MessageIndex": 102,
      "PostDate": "05/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 7, 2017 10:38PM - edited Mar 7, 2017 10:42PM by EastcoastTS Plantchild: I was not placed in a bra for home due to skin concerns. Though they later told me I looked great in the OR. Go figure. She said T-shirt would be all they would want against my skin. They may place you in a bra (I expected this but had nothing when I woke up). Have not worn one at all but I was tiny before and going braless is normal for me. Others may have better info but your PS will place the bra on you in the hospital I believe. If you need it. And give instructions on what to do. I had a camisole with pockets but have not even put it on. It's looks \"granny\" to me anyway. ;) OH! I also did one other thing. Bought $2 T-shirts at Walmart and cut them down the front -- bought stick on velcro and stuck them on to use as buttons. Have worn these a lot. I made two. And I'm the most UN-crafty person you can imagine. When you wash, just place new velcro stickers on. These are obviously not good for use outside the home. I only placed about 4 stickers per shirt but lots of comfort and EASE of getting in and out of even the first day of post-op. Better than being naked but not much more than this.",
      "MessageIndex": 137,
      "PostDate": "07/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 17, 2017 07:56PM - edited Mar 17, 2017 08:11PM by EastcoastTS Sorry I've been \"offline\" for a bit; will try to answer a few questions. Too many posts since my last visit to name names but good wishes to ALL going through this journey. You're my champions!!! (My excuse: I had surgery out of town -- had to fly home and just getting truly back and settled this week. I flew Day 11 if you count surgery as Day 1 without any issue.) Recliner: Have done beds the entire time with bunch of pillows. I do have a wedge pillow at home. Not sure if it's better than bunch of pillows and have one of those \"dorm\" pillows with arms rests. A recliner would be awesome but if you don't have one, you'll be okay. Small travel or heart pillows for underarms have worked well in situations, too. Drain removal: I only had two, removed 9 days after - and only had pain on one side because the stitches were VERY tight. According to surgeon. Indeed that side/site had been giving me minor issues. But removal is so quick and, really, don't fear it much. I barely felt it but I did not watch and talked the entire time. Just keep blabbering while they do it. TEs: I really dreaded these damn things but could not get surgeons (consulted with 3) that were comfortable doing one-step/direct for me. I'm very small and skin compromise just too possible. I was filled to 50ccs at surgery and that is plenty for me at this time. Complications: I had nipple/skin-sparing and was the one with a nipple that looked like roadkill with possible infection. Well, nipple is fine and going to survive (still looks raw but healing and this was expected, I was not alarmed) but the infection... Finishing course of massive antibiotics (switched from one typical post med. to three when redness on breast (cancer side) started showing up days after surgery. I believe, at least, that it occurred early on. The antibiotics have played havoc with my stomach a little. I eat probiotic foods, etc., all pre-cancer stuff, so I hate this, but I have no choice. The redness has toned down from say an 8/7 to a 1-ish but I can still see it faintly. Two more days of meds, then another appt. Tuesday. If the PS is not satisfied, it's either more antibiotics (IV or oral). Worse case: removal of TE on that side if IV doesn't satisfy her. But I've responded so well to the orals that I think it's going to be okay. If not, wtf, I have to deal, right? (Not to scare anyone. These things occur -- and I had my surgery at MD Anderson, so, um, things just happen.) Pain Following: Pain I have now is I believe (1) mainly TE-focused, though how can we tell? Mainly along the inside breast area/walls. What do we call this area? LOL I do have pain (2) on the incisions, which seems to be just starting for me. They look good, not infected, but I guess healing and \"stinging/burning\". Normal? Mine are in the breast fold but decent length. (3) My nipples, saved, both burn and sting. One is pretty damn good-looking for what occurred. But both hurt some which may be phantom pain. I have no idea! (4) I also get sharp/shooting, very brief pains. Both breasts. This occurred after my biopsy, too. <?> Pain med: Ask for what you need, everyone! I had tramadol but got nerve block during surgery, which really helped. I did have oxy of some type but only took one. Yuck. I have Valium that I'm using for spasms as needed but mostly just doing that and Tylenol at this point (also if needed). Ativan is also another I've heard works well. If you don't have what is working, ask. Overall, sleeping on my back is a bitch, but the surgery has been better than I expected. Except for unexpected/but research-possible-expected infection. Likely will not happen to you. I also can report that I have feeling under both underarms, in middle of chest, chest wall. I'm really not nearly as numb as expected. Though maybe due to skin-sparing? Idk. But I am very tender. Like I don't want to touch it too much. I was not placed in a bra. You guys may not believe it but I have not worn one ONCE. Was told no. Nada. Again, maybe due to sparing nipples and my small size. I was an A cup (maybe truly AA before) and with 50ccs filled, I'm not that much smaller if any. Of course funny ripples were not part of the pre-cancer party drill. I had perky/Kate Hudsons (just saying but they were tiny!). So seeing my same nipples and about the same size in a tank top is wild. Under the tank top is a bit of a mess but whatever. If I lose that TE, though, ugh. Will have to gather skin from somewhere and I don't have much to spare. Back would be only option and not much there. Good thing I'm going small. GOOD LUCK and warm wishes and hugs to everyone!!!",
      "MessageIndex": 265,
      "PostDate": "17/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 17, 2017 07:59PM EastcoastTS wrote: Also, tip that has helped me. I know some surgeons do not recommend ice/warm but I have been using a heating pad on LOWEST setting with comforter in between (so safe) and just having it against the side of body to throw my mind off pain, if this makes sense. Be careful due to losing feeling and not understanding true warmth and ice not good for nipple-sparing but try to send the mind to another part of the body. And it's comforted me when I was weaning off pain meds or adjusting to new bed. ",
      "MessageIndex": 266,
      "PostDate": "17/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 20, 2017 07:41AM - edited Mar 20, 2017 07:44AM by EastcoastTS DiV: My prayers, thoughts and warm wishes are with you! You are ONE tough lady and, boy, do I admire your strength!!!! ",
      "MessageIndex": 297,
      "PostDate": "20/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 23, 2017 09:46AM EastcoastTS wrote: Jada: Welcome to the group and know that we understand how you feel. I've had my low points and extreme moments of fear/vulnerability, too, especially when thinking about my 9-year-old son. As Molly advised, take this situation one day at a time. I've done this. Chipped away at the issue at hand, pushing the other aside to the next day or week. You will get through surgery. You're surrounded by women on this forum who have (or will) within days of each other. I'm myself 24 days out and doing well. We're here for you!!! Warm wishes, prayers and thoughts with you.",
      "MessageIndex": 376,
      "PostDate": "23/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Apr 9, 2017 05:13PM EastcoastTS wrote: Lisbeth: I can't really rec. a Vitamin C but also use Thorne and feel they are a good brand. I have an appt with a naturopath, too, coming up. This was actually on my pre-C list but had not gotten to it yet. As far as speaking to someone, even without your insurance while you get that figured out, your nurse practitioner -- if you have one -- OR BS/PS/MO should be able to give you a name of a social worker or therapist, very often without charge. My local cancer center and MD Anderson (where I had surgery) have someone \"on call\" that is without charge (aside from what you decide to do with your insurance, etc.). If you're feeling like this, I'd get in touch tomorrow morning and let them know you need assistance now. Also -- American Cancer Society has folks manning phones all the time, too. Idk for sure but reach out. There's no reason to go through this alone. You aren't alone!!!",
      "MessageIndex": 716,
      "PostDate": "09/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 22, 2017 05:12PM EastcoastTS wrote: Welcome, sjsparks! And warm wishes to all my March surgery buddies. Sorry I'm perpetually behind on comments. Someone asked about the nuclear injections. I was worried about these and they were a breeze. HOWEVER, I recommend that you ask for EMLA Cream prior (doctor can prescribe). I asked for the prescrip (I had to ask twice) but the nicest nurse during the procedure told me they apply if the patient asks IF they come early. 30 minutes. But you might want to know that first. Someone on this board told me to apply 1 hour prior, cover the breast, wrap in Saranwrap, head to appt. That kept my clothing clean and, really, I did not feel much of anything. It's a topical lodacaine cream. 2FUN: I'd mention the warmth to your PS. Better safe than sorry. I say because I am still dealing with a post-op infection. Warmth, redness, swelling initially (5 days post op). Major load of oral antibiotics really helped. All swelling gone, redness down to I'd say 5%, no heat. I never had a temperature of any kind. But -- still have some redness. My feeling is I may have to do the IV antibiotics at some point. Maybe not. PS was not alarmed by red still being there yesterday -- but I haven't had a fill yet. I'm 23 days post surgery, btw. I'm fine to wait on fills -- I'm really small and not getting many anyway -- but the redness does make me nervous, gotta admit. Would hate to lose my adorable/lovable TE! cdv4251992: I'm sitting here trying to imagine ways to creatively manage your work attire. The strict dress code is a challenge. No larger but professional blazer allowed? I've found some great ones at thrift stores recently. If no workable solution arises, could you talk to management? I hope you figure out something without much stress. That's what we need to leave behind at the moment! HUGS to all!",
      "MessageIndex": 353,
      "PostDate": "22/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "May 4, 2017 12:43PM - edited May 4, 2017 12:45PM by EastcoastTS",
      "MessageIndex": 882,
      "PostDate": "04/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "May 4, 2017 12:47PM EastcoastTS wrote: Wallen: Glad you're doing well and no heart attack! I know that must have been scary. FYI: the website is posting replies more than once. I deleted my additional two. Sorry!",
      "MessageIndex": 884,
      "PostDate": "04/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "May 15, 2017 10:20AM - edited May 15, 2017 10:22AM by EastcoastTS Bluebirdgirl: So sorry, too. But can add that I had an infection (post op -- few days later it showed up/red breast) and was prescribed THREE antibiotics, one of those being Cipro. I was horrified because I eat probiotic food and take a daily probiotic, too, pre C stuff I've just always done. Anyhoo, though, they worked. My advice: aside from the label, I took them with food after getting nauseous one time but otherwise, no side effects. Cipro can be hard on your stomach. And, yeah, it has some scary stuff out there about it but what are we to do at this point but take it? Take a probiotic, too, if you don't already. I get mine in the refrigerated section. Hugs to you from another infection girl!!!",
      "MessageIndex": 918,
      "PostDate": "15/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jun 2, 2017 03:58PM EastcoastTS wrote: Dafne: I also have family history (my mom) but not strong and my BRCA, etc. that they tested for was negative. So...you never know. I'm glad you went. But I get it. I want the \"ignorance is bliss\" some days, too. ;) Many days.",
      "MessageIndex": 949,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 28, 2017 07:00AM EastcoastTS wrote: tlj1973: Hugs and belated Happy Birthday wishes!!!",
      "MessageIndex": 484,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jun 26, 2017 11:36PM EastcoastTS wrote: Oh, Dafne! I'm so sorry. Hope your PS can find another way, too. ",
      "MessageIndex": 972,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Aug 22, 2017 04:05PM EastcoastTS wrote: Lisbeth: I've talked to two MOs who have said zip about deodorant -- or that it's not clinically proven as a risk. However, I am using natural deodorants now because why risk anything? EXCEPT -- they don't work as well! So I have regular deodorant for days I have to use that (meetings, etc.). For my children going through high school, I'd let them use the stuff that works because can you imagine the social issues without? And maybe limit on weekends when it's just family. At least then you're making an effort.",
      "MessageIndex": 1016,
      "PostDate": "22/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Apr 1, 2017 04:28PM - edited Apr 1, 2017 04:29PM by EastcoastTS Xtina: I think it's normal. I'm almost 5 weeks out and still have lots of what I'd call \"burning\". The sharp, somewhat painful \"zings\" are getting better as is (I think) the bullsh*t/ TE pain between my breasts and/or over ribs. I don't know how to explain it. But the burning remains. My PS said this is nerve regeneration. My nipples (spared) also burn and I don't even know if that is real or just my mind. LOL I think surgeons and doctors in general discount pain to a large extent. Idk why. It does get better though. Hugs to all!!!",
      "MessageIndex": 571,
      "PostDate": "01/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Apr 1, 2017 04:30PM EastcoastTS wrote: Also should add that a bunch of my burning is kinda above my breast fold incisions. I think I've read that Alloderm can cause burning. In any case, no one seems alarmed when I tell them this is happening.",
      "MessageIndex": 572,
      "PostDate": "01/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Apr 8, 2017 01:23PM EastcoastTS wrote: I also should say that I didn't really have any fever or pain aside from what I consider normal mast and TE pain (but did have some swelling). Major red streak across the breast, not entire breast. You could not miss it. I think it was a surgical infection vs alloderm. My nipple was also a mess but that is looking great. I'm not sure it'll ever completely match the other nipple, which suffered no damage. If they make it through this process, great, if not...I'll figure that out when I have to.",
      "MessageIndex": 706,
      "PostDate": "08/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Aug 21, 2017 04:03AM EastcoastTS wrote: My Exchange is 9/7! That's three of us with Sept Exchange dates. Excited to get rid of the TEs but a little nervous, too. ;)",
      "MessageIndex": 1014,
      "PostDate": "21/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 4, 2017 07:37AM EastcoastTS wrote: Wow, Grande, you're doing great it seems!",
      "MessageIndex": 19,
      "PostDate": "04/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 4, 2017 09:51PM EastcoastTS wrote: I don't think I've posted this on this particular forum -- but my mom (not on BC.org) is a ten year TN survivor. Had lump/radiation and 4 rounds chemo (I'm not sure what type, sorry). She follows no special diet, no special supplements and does drink beer/wine, however, she gets a TON of exercise, which I think is key. Very active and positive outlook. Good luck to all! ;) Stinks we're here but glad we have each other.",
      "MessageIndex": 15,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/856831",
      "Title": "10 year survivor of TN cancer Mary95 EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 14, 2017 05:57AM EastcoastTS wrote: Also should add that mine are being done days(!) before surgery. Thursday for Monday surgery. And will again be done in the OR (they better use something or have me under by then). I really have no idea why. (MD Anderson)",
      "MessageIndex": 53,
      "PostDate": "14/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746169",
      "Title": "Nuclear Injection pre-surgery pagowens Accepted2018"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 23, 2017 09:41PM EastcoastTS wrote: Okay, guys, popping in with good news on nuclear injections. As much as I was dreading this procedure, it was a piece of cake! I felt a slight burn as they went in but nothing major AT ALL. Took seconds to complete. However, please note:",
      "MessageIndex": 58,
      "PostDate": "23/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746169",
      "Title": "Nuclear Injection pre-surgery pagowens Accepted2018"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 13, 2017 07:00AM EastcoastTS wrote: Perhaps a silly question but if having bilateral (cancer one breast only), do they do the shots on both sides? Or only affected side? Thanks!",
      "MessageIndex": 48,
      "PostDate": "13/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746169",
      "Title": "Nuclear Injection pre-surgery pagowens Accepted2018"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 15, 2017 05:04AM EastcoastTS wrote: Another question: what do you guys think? When I asked for EMLA cream (which they prescribed) and if lidocaine is in the injections, they very nicely told me we could just do this in the OR if I was nervous. (I wouldn't say nervous, more designed/dreading.) That they liked to check early and make sure everything \"drains\". So -- should I tell them to skip this and just go with OR version? At 4 days before my surgery, will it impact my surgical plan if not done? I really don't want to make this call.",
      "MessageIndex": 54,
      "PostDate": "15/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746169",
      "Title": "Nuclear Injection pre-surgery pagowens Accepted2018"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 13, 2017 07:56PM EastcoastTS wrote: Okay, I will ask because I have NO idea if the BS plans to test the prop. side. I can see reasons to test and to not test, personally. Thanks, SpecialK! Your advice is so great.",
      "MessageIndex": 52,
      "PostDate": "13/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746169",
      "Title": "Nuclear Injection pre-surgery pagowens Accepted2018"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 29, 2017 04:48PM EastcoastTS wrote: Mtwoman: They ran the Oncotype on the surgical sample, and all I got was phone call with brief discussion (since my MO is in another state) about the #. I didn't think to ask about ER/PR/HER2 during that call. I just could not find it on the final path report. So I was stumped, too. She's sending me the report, so I guess it'll be there. Thanks, Lisey and SpecialK. Glad that will be included in the Oncotype results. Every time I feel like I know what I need to know about BC, more questions arise!",
      "MessageIndex": 4,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/853817",
      "Title": "Quick Pathology Question EastcoastTS EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 2, 2017 09:20AM EastcoastTS wrote: KimYR: SO sorry you are here but you've found a great place for advice/support/understanding. Tell whomever you want -- or not. I've told some colleagues but no neighbors, for instance. Nothing on social media. Zip. But it's what makes you feel better and helps you cope. Agree with Meow: you need the path report from the biopsy sample to tell you about hormone status, HER2 status, etc. Greeneyes has it right, too. You are hitting the tip of the iceburg. More info every day, more knowledge. A plan will slide into place. It does get better. I'm not kidding. I know you can't believe that but I'm almost 9 months out and in such a better place. Take care and know we're here for you.",
      "MessageIndex": 8,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859002",
      "Title": "Just got the call KimYR misbehavinggirls"
    },
    {
      "AuthorID": "EastcoastTS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "EastcoastTS wrote: I got my final pathology about a week after surgery (surgery 4 weeks ago). There was nothing about my ER/PR/HER2 status there. I do have this from the biopsy path of course. Which was run initially, then run again at 2nd opinion hospital. Same results. So -- don't they run that again with the surgical sample? That seems odd to me. The MO said no if they get clear from biopsy sample. I also read it comes with the Oncotype, which I received yesterday (via phone call -- I only got my #: 14. Nothing else until I see the actual report.) THANKS for advice!!! Dx@ 49. Oncotype: 14, BRCA 1/2- Dx 1/4/2017, ILC, Left, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- Surgery 2/26/2017 Mastectomy: Left; Prophylactic mastectomy: Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery 9/7/2017 Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/853817",
      "Title": "Quick Pathology Question EastcoastTS EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 29, 2017 05:03PM EastcoastTS wrote: Also, guys, I never had a Ki-67 reading? I asked and was told it would be done on the surgical sample, but again, not included on the final path report. Will this also be a part of the Oncotype? As you can tell, I love all the info I can get.",
      "MessageIndex": 5,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/853817",
      "Title": "Quick Pathology Question EastcoastTS EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Nov 3, 2017 09:56AM EastcoastTS wrote: My mother's came back without clear margins and they had to go back for another round. It was not another tumor, simply did not get all of the first one. I think it happens with lumpectomies...well, not often..but it happens. (I had BMX.) Good luck with the 2nd surgery.",
      "MessageIndex": 2,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/859845",
      "Title": "How many have not had clear margins? vampeyes vampeyes"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jan 10, 2018 04:17AM - edited Jan 10, 2018 04:17AM by EastcoastTS Emma: As others have stated, you are in the worst part of this journey. Once you have more information, knowledge/insight and a plan in place, please believe me when I say that the anxiety does lessen. Ask any and all questions here. Someone will have advice or an experience to share. Lots of moms here (like me). We get it. Just know you have support. {hugs}",
      "MessageIndex": 6,
      "PostDate": "10/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/861489",
      "Title": "Diagnosed with invasive ductal breast cancer Emma1973 raisan_angels"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 8, 2017 01:32PM EastcoastTS wrote: I did nipple/skin sparing. I was very small-breasted. And cancer not near the nipple. I think much has to do with tumor location. Not sure about breast size being an issue. Idk. PROS: Scars likely in the IMF (fold), so the breasts look pretty good, even after surgery. Your skin and nipple still there, even without tissue. If that makes sense. CON: Nipples may not be exactly where they were originally. Mine are a little to the sides now (not bad) but my PS said they cannot completely control this. I went from small to a bit larger (B cup), so the nipples adjust to the expansion. Tissue expanders are doable but fairly uncomfortable. I was glad to get my implants, that was for sure. 6 months in TEs. I don't know about DIEP, as I did not have that. I only have lack of sensitivity in some areas and occasional pings/pains (minor). No muscle issues that I have identified. Or weakness. But it's been 10 months since my surgery. This did take time. Good luck! Hugs to you.",
      "MessageIndex": 2,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860706",
      "Title": "New here - questions about BPM & reconstruction LL99LL LL99LL"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jan 16, 2018 09:11PM EastcoastTS wrote: NurseP: This is the long-running thread for tissue expanders (TE) below. Some experiences better than others, but I can tell you, they are not the most fun but are totally doable. You can read past posts or ask questions of those in TEs right now. Lots of info. When you're ready (down the road) the Exchange City thread has lots of Exchange info (surgery to replace TEs with implants). That surgery is a breeze in comparison to BMX. https://community.breastcancer.org/forum/44/topics... There are lots of threads on reconstruction and surgery (with lists of surgical tips) that may help. I had nipple & skin sparing. You may want to ask the PS what, exactly, they are thinking of for you. Where will scars be located? Tissue expanders below the pec? You can talk to more than one doctor. I talked to three plastic surgeons. Good luck and keep us updated.",
      "MessageIndex": 6,
      "PostDate": "16/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/861668",
      "Title": "How long does it take to recover? Nursepatient35 EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jul 25, 2017 05:13PM EastcoastTS wrote: So far, and I'm new to this, I've gotten fairly extensive bloodwork (including calcium) and physical exam. However, I had some issues so had CT and Bone Scan. All clean. I had the radiation exposure but...what are we to do? I'm planning to push for tumor markers. And perhaps will ask about a yearly MRI. I'm okay with the cost if it relieves MY mind. I think after a few years, perhaps we settle into the new normal and are not quite as anxious. And I'm not totally anxious. I'm reading Crazy, Sexy Cancer Tips and she's big on having a team. We hire our team and manage them. I have an integrative MO as well as MO -- but so far -- she's fairly conservative. ;) So my team is MO, Alt MO, Gyno (tamoxifen -- I'm getting yearly trans vaginal ultrasounds) and a functional MD once I get that scheduled. They will run tumor markers if the MO doesn't want to. And an endo. because I have bone issues to address too on top of all this fun!!! (I haven't figured out what a PCP would do for me since MO running so much blood work, though I have one that I don't see often.)",
      "MessageIndex": 16,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/857303",
      "Title": "Monitoring for recurrence - what do your doctors suggest? mellee gb2115"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jan 25, 2018 12:24AM EastcoastTS wrote: Nanaannie and myjourney62: Please ask any and all questions. Someone here will answer. (Although Nan is unfortunately more experienced than most here.) {hugs}",
      "MessageIndex": 12,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/861870",
      "Title": "New to the forum trinitymom2 myjourney62"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jun 28, 2017 07:44PM EastcoastTS wrote: Pattie: Someone will likely ask you to go to the settings area and fill in your diagnosis details when you have them. It makes it easier for us to help. But no worries that you're picking up information as you can. It's a hell of a lot to learn quickly. One question: do you have anyone who can assist during surgical recovery? I chose BMX (bilateral mastectomy) but had a small support system in place (hubby/mom) to help me. And I needed that for a few days. Not that you want to chose based on this, but it is a question to ask. Also -- even if you chose mastectomy, unilateral or bi-, you could still have to have radiation. I did NOT and I'm not saying it's likely. But it is possible if you have lymph node involvement and/or they do not get clean borders with the mastectomy. My tumor was close to a muscle and this was a possibility. And you won't know that until after surgery when path. results come in. Take a breath. You'll get LOTS of great advice and support here. I could not have survived this year without the people on BC.org. HUGS to you.",
      "MessageIndex": 1,
      "PostDate": "28/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/856496",
      "Title": "I am alone trying to decide between radiation or mastectomy pattiebfromblo shaneswife828"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jan 16, 2018 11:37AM EastcoastTS wrote: Nursep35: I had the luxury of short-term disability. I had more time than I needed (for which I was thankful) but one question: are you having reconstruction of any kind? I ask because I think tissue expanders increased my healing and pain (modest but doable). If you can get and afford 6 weeks, take them. You will be under lifting restrictions for weeks, depending upon your PS. I think I was 2 weeks nothing above shoulder. For 4-5 weeks, nothing over 5 lbs. But very modest even after that. I'm not sure they will want you lifting patients for a bit. Please ask your PS. Overall, the recovery is not bad -- again, more complicated if you have reconstruction at time of BMX. I had drains for 10 days. Factor having those into the mix as well. GOOD luck and ask any/all questions. {hugs}",
      "MessageIndex": 1,
      "PostDate": "16/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/861668",
      "Title": "How long does it take to recover? Nursepatient35 EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jan 23, 2018 02:27AM EastcoastTS wrote: So sorry you've had to join our little club -- but glad you found us. Good luck with surgery. {hugs}",
      "MessageIndex": 3,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/861870",
      "Title": "New to the forum trinitymom2 myjourney62"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 7, 2017 07:47PM EastcoastTS wrote: Monkeymomma: I'm so sorry that you're dealing with all this, not one but two areas of concern. I'll put in a prayer for you. The time when you're waiting on test results and all that is horrible. I remember that well (earlier this year). Just so much anxiety. Try to take a deep yoga breath if you can. And ask for a little medicinal help if you need it. I did at initial diagnosis, even just something to sleep. Really helped. Hang in there. You are not alone out there.",
      "MessageIndex": 2,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860703",
      "Title": "Awaiting biopsies but new challenge ahead Monkeymomma Monkeymomma"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 8, 2017 08:18AM EastcoastTS wrote: Monkeymamma: My only \"symptom\" looking back was that I was tired the year before. And, maybe, it seemed that my immune system was weak. I got colds/flu. Just unusual a bit.I did have a palpable lump, which isn't the most typical for ILC (it grows in sheets I believe and is often larger when found). It was not seen on mammo, was vaguely seen on US, and seen completely on MRI. You may want to stay away from blind Google searches. That will only send your anxiety level through the roof. Wishing for good news for you.",
      "MessageIndex": 5,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860703",
      "Title": "Awaiting biopsies but new challenge ahead Monkeymomma Monkeymomma"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 5, 2017 04:45PM - edited Dec 5, 2017 04:47PM by EastcoastTS Thanks, everyone, for chiming in. It's helpful to gain some insight into an area I was not really expecting to have to gain insight into. F-ing BC! (Exchange surgery just over in Sept, so thought I had a moment to breath, and now ovaries are not playing nice.) I have osteoporosis, too, to deal with. (Not unexpected as I'm very petite but I'm kinda young for it...) So have to throw that in the mix, too. Just getting to endo appts now. So I'm left somewhat with limited options. I have another TVUS next week. Happy holidays to everyone! You're my rock stars!!",
      "MessageIndex": 10,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860598",
      "Title": "Possible hysterectomy—opinions Carrie37 Carrie37"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 11, 2017 05:32PM EastcoastTS wrote: I think getting over anesthesia is, in itself, a major piece of the puzzle. Give in to what your body is telling you and rest without feeling guilty. I was tired for a while.",
      "MessageIndex": 7,
      "PostDate": "11/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/859318",
      "Title": "2 weeks post op - stiil feeling the need to sleep - Normal? KLAStrong EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 1, 2017 09:38AM - edited Sep 1, 2017 09:38AM by EastcoastTS Good luck to those facing surgery! I'm 9/7 but Exchange to implants. I had BMX in late Feb. If you guys have any questions, there are a couple of us on here who've been through BMX and maybe lumpectomy, too. We could try to help you prepare. Also, there are some GREAT lists on BC.org with ways to prepare for surgery. This was very beneficial for me. What to take to the hospital, what to do at home before, things to consider (yuck but good idea: stool softener, etc., etc.). Hugs to all.",
      "MessageIndex": 29,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 8, 2017 09:29AM EastcoastTS wrote: Thanks, Raven, for the well wishes. Hoping your exchange is a breeze. I had my Exchange yesterday. Last night a little rough with mild nausea from anesthesia. I do have some pain due to pocket work but all manageable. In tight surgical bra that is likely contributing to the pain but also helping keep the new babies in place. GOOD luck to everyone having surgery soon. You can do it, that's all I can say. One step/day at a time.",
      "MessageIndex": 49,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 8, 2017 10:10AM EastcoastTS wrote: Raven: Another thought: you and I had infections and I bet drains increase the chance for complications, right? Another open wound and area for bacteria to reach. Even if they are performing a good \"job\". So maybe that is why my PS nixed the idea. Idk.",
      "MessageIndex": 52,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 10, 2017 03:10PM - edited Sep 10, 2017 03:10PM by EastcoastTS I had my mom and husband help with drains. With limited range of motion, it would have been hard to drain and record amounts. Don't forget to have alcohol wipes on hand. You'll need to use those when you drain. Keeps everything sanitary. Also, my BMX hospital (MD Anderson) recommended Hibiclens (available on Amazon and Google for instructions to use -- something will certainly pop up), however, my Exchange hospital did not. I did it anyway with Exchange, because I had a post-op infection the first time around. It's just strong liquid soap that you wash area to be operated on for 3 days prior to surgery. Another step to reduce chance of infection. Some docs recommend, some don't. But it cannot hurt. (Cannot be used on certain areas and face.) ;)",
      "MessageIndex": 76,
      "PostDate": "10/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 15, 2017 09:42AM EastcoastTS wrote: joy seeker: Welcome to the group, though sorry you are here. Not sure about the walker but imagine better than crutches. I didn't want anything to touch any area around my chest, even clothing at first (nerves). I don't think a crutch under your arm would work -- especially with one side having nodes taken. That incision was more tender than my IMF incisions. Talk to your BS and stress mobility and how you'll manage the ankle from a pain perspective with incisions, etc. Dizzy: Exchange, seriously, is easier. (And I had what I would consider a more complicated exchange.) Although there are always things that can deviate from our plans, it's not likely to happen. You will do great!!!! And be rid of the TE beasts!!!",
      "MessageIndex": 112,
      "PostDate": "15/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 25, 2017 01:37PM EastcoastTS wrote: Lots of people here advised me to tell the anesthesia team in my pre-op appt that I get nauseous (even if I was not sure I had before) and they'll go ahead with Zofran and the patch behind the ear. I had both for BMX and Exchange, no nausea. Didn't want to wait until I was actually nauseous. ;) Don't tell anyone you don't want to. My colleagues know, because I kinda had to tell something, some friends (limited). My neighbors have no idea. I mean, it's just very personal and changes perception (IMHO) and I did not feel comfortable inviting so many people into my deal. So you do what your gut tells you you WANT to do. And with some people, I find it super easy to talk about. Mostly those who have cancer...go figure. Mobility was okay, actually. Lifting arms hard for me at first (putting arms into T-shirt, etc., impossible that I recall) but not as bad as I expected. I think I could brush hair and teeth pretty soon after without too much pain. And you'll only have one side. That is easier. Follow instructions from your doc. It's easy to do too much too soon. Get button shirts for first week or two. I'd also recommend Colace or something like this starting a couple of days before surgery. Many lists on BC.org detailing what to expect and how to prepare, but I'm sure you've found them already. Good luck!",
      "MessageIndex": 188,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Aug 20, 2017 09:53PM EastcoastTS wrote: MamaFelice: I did research prior to my BMX on supplements to not only take -- but those to stop taking. BS, MO, etc., weren't terribly helpful there. Try Arnica and Bromelain. Routinely recommended in Europe for surgery. I had almost no bruising and swelling. I also took a few others but have forgotten what. I'm joining this list, too, for 9/7 Exchange surgery, so I have to figure out what to take again. Stop taking Omega 3, aspirin, anything that thins the blood. Also I believe Turmeric does this -- so I may stop that. I'm on Tamoxifen and have been told 2 weeks off, 3 after surgery, likely due to blood clot issues. Good luck to all!!! ",
      "MessageIndex": 14,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Aug 31, 2017 08:29AM EastcoastTS wrote: Good luck, Littlebee72.",
      "MessageIndex": 27,
      "PostDate": "31/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 8, 2017 10:08AM - edited Sep 8, 2017 10:09AM by EastcoastTS Raven: NO drains. (Although there was possibility I would have them.) YEAH -- no TEs and no drains!!!! Next appt is: Tuesday. I have not removed the surgical bra, so have no idea what is under there. ;) I am preparing myself to feel \"underwhelmed\" with the implants. Because you know everyone says they don't look good at first. I'm expecting hamburger buns for a bit. I'll keep you updated. Can you believe we may be almost finished with this mess??? And then on to just living. Make sure to let me know how yours goes. HUGS.",
      "MessageIndex": 51,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 4, 2017 09:11AM EastcoastTS wrote: MFPM: Exhaustion after 8 days is completely normal I think. I was not \"myself\" with regard to energy level for a month or more. It took time. I agree with Raven. I feel part of the issue is anesthesia recovery. REST and don't feel badly for having to rest. I just tried to get a lot of protein, slept a lot when I needed to but also walked when I could to get my energy levels back to normal. And I read a lot on this site about recovery. I'm so sorry about the missed tumor and lengthy journey you've had. I get you -- I've only been dealing with this since Dec. but I'm tired of breast cancer and breasts in general myself at this point. Again with Raven: can you ask your doctor or nurse navigator/surgical center about support? Mine had a social worker who we could reach out to. Also a therapist on the survivorship care office side. Many people have asked their doctor for an anti-depressant to take during this challenging time. I took something when first diagnosed to help me sleep. You are not alone in this. Take one day at a time. One breathe at a time. You will get through this.",
      "MessageIndex": 253,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 11, 2017 02:07AM EastcoastTS wrote: GrandmaV: I have had PT with a specialist trained in myofascial release. I believe pain in the shoulder blades or below is common with breast surgery. Myofascial release helps with this. It's been great for me and restoring range of motion. Google it. The myofascial runs from front to back in some way. (I couldn't get it all -- but it has helped.) ",
      "MessageIndex": 291,
      "PostDate": "11/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 4, 2017 09:06PM EastcoastTS wrote: Yeah, Flygirl12! That is great news! I agree on pillow suggestions. I also remember using them on each side to prop up my arms -- as well as a few to prop myself up for a while. Drains were the same for me, bothersome but doable. And I had zero pain when they were removed. ",
      "MessageIndex": 37,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 13, 2017 11:00AM EastcoastTS wrote: Kiwifluff: Agreed with everything said here! We have SO many decisions to make with this diagnosis and so quickly, that it's impossible to not second-guess at times. I also delayed my biopsy slightly to get through the holidays. (All happening mid-Dec and New Year's.) And made my annual mammogram appt upon feeling my lump -- but I didn't rush them into making it the next day or anything. Of course I likely thought it was nothing. I also took time to make surgical decisions. Just know that you're not alone.",
      "MessageIndex": 97,
      "PostDate": "13/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 20, 2017 05:50PM EastcoastTS wrote: Dodgersgirl: Yeah to the waterbed! ;) Raven: Let us know what's up with the drain leakage. Due to previous infection, I'm hyper sensitive about them, too, but so far/so good this time around. You surely have so much swelling right now. I think I'm only beginning to \"deflate\" and I'm almost two weeks out. Try not to look too closely yet.",
      "MessageIndex": 145,
      "PostDate": "20/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 21, 2017 05:27PM EastcoastTS wrote: Dogmomerica: Luckily some great lists on this site, which helped me tremendously. But ask questions if you are not sure about something. Don't forget Colace or something similar. (+ other fiber recommendations, etc.) Start a couple of days before surgery. TMI -- but no one wants that issue with dealing with pain and healing. Narcs just bring it on. I also, as everyone knows, recommend the heck out of Arnica and Bromelain, started a couple of days before surgery and a week after. You can ask your PS about them, too. They may ok or not care. That is the typical response. ;) Do you need drain holders? I have two -- one went around my waist and one Koosie type material that hangs from neck for showering. Both are clean and the one around waist was a Godsend. It's flexible so should fit different size waists (I think). I can send to you. I'm not even sure I used the Koosie one but it's kinda cute anyway. LOL PM me your addy if you want them.",
      "MessageIndex": 154,
      "PostDate": "21/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 25, 2017 10:58AM EastcoastTS wrote: Patsfan: Okay, it depends upon how your facility does the procedure...but I had nuclear injections two days or so before surgery to locate the sentinel nodes. Instead of (I think) blue dye just before surgery. Recommended on this site was to have the doctor prescribe Emla cream (numbing cream), slather over breast, then cover with Saran Wrap. I kid you not. I went to the appt with that under my clothing (no mess, no fuss, it sticks). The nurse told me they could always do Emla but you have to go early and ask before the appt. That, again, depends upon the facility. I felt nothing. Easy, peasy. Search nuclear and blue dye injections on this site. Tons of advice and feedback.",
      "MessageIndex": 179,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 25, 2017 10:25PM EastcoastTS wrote: AndreaLee: This may depend upon your circumstances. I had short-term disability at work and my surgical team provided the date to return to work. Not me. I was out like you would be for a maternity leave. Did I need that much for actual physical recovery? NO. But it gave me time to start planning my emotional recovery. Getting back into the swing of exercise/dietary changes, etc. without the stress of work hanging over me. That said, I was back driving but not really comfortably in about 3 weeks. 4 weeks would be great if you can swing it. Some here say 4-6, which is even better.",
      "MessageIndex": 195,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 1, 2017 09:46PM EastcoastTS wrote: AndreaLee and GrandmaV: Hope you get better every day! Hugs!",
      "MessageIndex": 243,
      "PostDate": "01/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 5, 2017 09:11AM EastcoastTS wrote: MFPM: I get you about the NYC traffic. I used to live in Astoria and traveled into Manhattan for work. Yikes on many days of the week. However, there is also phone support through American Cancer Society and others. They have survivors to talk to I'm pretty sure. Google and see what is out there. Maybe just having someone to talk to about this (in person sort of) will really help. Thinking of you!",
      "MessageIndex": 261,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 5, 2017 08:23PM EastcoastTS wrote: Wonderwoman: YEAH! on picking up your daughter. That alone is healing.",
      "MessageIndex": 264,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Aug 25, 2017 09:26AM EastcoastTS wrote: Pinkvictory: I'm a newbie here too (relatively) -- but NOT everyone has drains at Exchange. In fact, I think it's in the vast minority for those who do. Mine is possible because I'm set to have a lot of pocket work. So I'm preparing myself although I may not have them, either. Don't worry about Exchange. Most folks say it's so much easier than BMX. So much. ;)",
      "MessageIndex": 20,
      "PostDate": "25/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 18, 2017 08:37AM EastcoastTS wrote: Good luck to everyone having surgery this week! Raven, you have this!!! Keep us updated.",
      "MessageIndex": 126,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 19, 2017 09:37PM EastcoastTS wrote: Good luck, Joyseeker. I'll be thinking of you. Dodgersgirl: I still use this little pillow with velcro on my seat belt. All through TE mess and now with recent Exchange surgery. Good idea, RebaMac!!! Travel pillow will work. Anyone who has not been prescribed muscle relaxers should ask. My doctor preferred Ativan -- and another preferred valium. But something with TEs is needed.",
      "MessageIndex": 139,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 25, 2017 11:04AM EastcoastTS wrote: Lizo Biker: You have the TE \"iron bra\" feeling right now -- it sounds like to me. My recollection is that I would feel like I needed to adjust an uncomfortable wire bra, but I was not wearing a bra. I even reached to do it a few times. Good news is, this feeling DID go away. Perhaps when I started getting fills. The deal for me was: fills helped with some pains (TE rubbing a nerve or something) but caused their own discomfort for a day or two. Good luck. The TEs and discomfort got a lot better with healing. The first 6-8 weeks were harder.",
      "MessageIndex": 180,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 18, 2017 07:15PM EastcoastTS wrote: Andrea: Glad you are doing well! You sound good for the 2.5 week mark. I'm 6 weeks tomorrow out of Exchange and doing well also. Really could tell an uptick in healing in the past two weeks. Hello to everyone on the Sept 2017 list!",
      "MessageIndex": 309,
      "PostDate": "18/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 9, 2017 02:33AM EastcoastTS wrote: MFPM: Going back a few months to recall -- but I had ALL kinds of things going on after BMX. Some may have been attributed to the tissue expanders but my skin overall felt very \"sensitive\". Like: don't touch. Nerve stuff, tingling and burning. This the doc said nerves regenerating or whatever they were trying to do. Shooting pains/stabbing. Not horrible -- but just a lot of healing going on. And this for me was a couple of months. Totally doable but you're still pretty soon out of surgery. If you have much swelling, call the doc. That I did not have a ton of. Had drains for 10 days.",
      "MessageIndex": 287,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 11, 2017 09:02PM EastcoastTS wrote: I believe there are some good exercises on Youtube from MSK (Sloan-Kettering). My nurse practitioner mentioned to me, though I wasn't great about doing them.",
      "MessageIndex": 296,
      "PostDate": "11/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Nov 29, 2017 03:43PM EastcoastTS wrote: I'm certainly no expert -- but plenty of grade 2/3 with no node involvement that I've seen in BC.org. However, I'm not downplaying your worry because this was a real concern (terror) of mine before I had all the path. info. I had pain under my armpit which I think was reactive from the biopsy. BC agreed. But it scared me. Ask all questions you have and make sure to review the pre-surgery lists on the site. Not sure where to direct you but you can search and find them. It's terribly helpful. I was really prepared! Good luck and my positive thoughts with you.",
      "MessageIndex": 7,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860453",
      "Title": "Every scan shows my tumor as being bigger! ToughCookie101 randrgirl"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Nov 29, 2017 08:19AM EastcoastTS wrote: Each test I had showed larger size as well -- US .8mm, MRI 1.2, final path 1.8mm. However, I am ILC, which is sneaky and can hide and is often larger. Good luck and try to take a calming yoga breath when you feel the panic setting in! Things get better once you have a plan in place. I promise this. HUGS.",
      "MessageIndex": 5,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860453",
      "Title": "Every scan shows my tumor as being bigger! ToughCookie101 randrgirl"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Apr 6, 2018 02:09PM EastcoastTS wrote: Congrats on the new baby!!!",
      "MessageIndex": 15491,
      "PostDate": "06/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 6, 2018 09:11PM EastcoastTS wrote: LS: I'm so sorry you are here, but as others have said, very glad you found us. (I could not have made it through 2017 without my BC.org team.) Everyone is right: Just after diagnosis is the WORST time. So much uncertainty and outright fear. But I promise you, it gets better. Somehow with a treatment plan in place and more knowledge, this journey gets easier. If you find you cannot sleep or are too anxious, it's okay to ask your doctor for something to help. Many of us had to initially. Ask any and all questions, no matter how small. Someone will answer. There are also lists upon lists here to help you prep for surgery. Big virtual hug from me to you. You are not alone.",
      "MessageIndex": 15,
      "PostDate": "06/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/863009",
      "Title": "I am terrified. LilSebastian Heart_song"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 29, 2017 12:25PM - edited Dec 29, 2017 12:26PM by EastcoastTS You are younger and this may dictate, (I was diagnosed at 49) but my MO prefers to leave the ovaries unless BRCA+ because of bone/heart/cognitive issues. IF possible. However, everyone's situation differs. I have bone issues (osteoporosis) so I have to weigh that against everything. (Sigh) It's all a bit of a balancing act, what we do to protect ourselves from BC but also protect the rest of our bodies, if that makes sense. I'm still working through what I may possibly do as next steps as well. ",
      "MessageIndex": 8,
      "PostDate": "29/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/861155",
      "Title": "Advice/experience on Ovary removal/Hysterectomy & Mastectomy notinuse DanceSmartly"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 4, 2017 11:31AM - edited Dec 4, 2017 11:31AM by EastcoastTS Can those of you chiming in state why your doctor (or you, in making the decision) chose hysterectomy and/or oophorectomy? I'm facing ovarian cyst issues, which I've never had before and have had previous ultrasounds, so I feel it may be Tamox. related. My gyno suggested hyst./ooph in a passing comment (as we scheduled another ultrasound appt). However, she does not deal with a lot of BC, and I'm going to discuss with a gyn/ocn, too. But for now, I'm just researching. I may have this issue now to deal with. Fun times in BCLand. Thanks!!!",
      "MessageIndex": 6,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860598",
      "Title": "Possible hysterectomy—opinions Carrie37 Carrie37"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jan 18, 2018 12:02AM EastcoastTS wrote: Paisley: I hope your tests went well. Keep us updated. The time you're in (initial diagnosis and without all information) is the hardest time. Absolutely the worst. But good news is, it gets easier. Have you perhaps asked one of your doctors for a med to help with anxiety? Many here took one during the early days. It may also help with sleep. {hugs!!!}",
      "MessageIndex": 3,
      "PostDate": "18/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/861471",
      "Title": "It's going to be a busy stressful week.... Paisley2916 EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jan 25, 2018 11:08AM EastcoastTS wrote: Paisley: Glad things are going well. This journey does get easier -- which is hard to imagine at first. Check the chemo boards for lots of good info (I'm guessing). And keep us updated on your progress!!!",
      "MessageIndex": 5,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/861471",
      "Title": "It's going to be a busy stressful week.... Paisley2916 EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 10, 2017 08:53PM EastcoastTS wrote: I used EMLA cream prior to the injection. Someone on this board recommended placing Saran Wrap over the cream under my clothing and going to the appt with it in place. Keep cream on an hour or so. It worked well. (Wiped off before the injections, of course.) I felt nothing. EMLA is prescip. but ask your doctor for it. Good luck!",
      "MessageIndex": 8,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860757",
      "Title": "Scared about radioactive injections for SX Nurzrobin DownNotOut"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 15, 2017 07:41PM EastcoastTS wrote: Waiting for results is the hardest part! But glad things went well. Know you have support and we're thinking of you!",
      "MessageIndex": 12,
      "PostDate": "15/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860757",
      "Title": "Scared about radioactive injections for SX Nurzrobin DownNotOut"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jun 30, 2017 09:06AM EastcoastTS wrote: ElleElleBee: As a relatively new member of the club, too, I can only say that you've found a great place for advice and support. Unfortunately, we all know -- in some part -- how you're feeling. So sorry you're here. I was also an A cup, maybe even AA, but you know what? I think that's how I located it. If I'd been bigger, the lump would have gone unnoticed. So maybe being smaller has some benefit. I agree on additional testing with your GP or perhaps the MO (medical oncologist) that you'll have will schedule that. Just ask lots of questions -- your doctors and here. Take one day at a time. I'm a mom, too, to a 9-year-old. That part is hard. Hang in there. ",
      "MessageIndex": 3,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856541",
      "Title": "Officially in the club at 32 years old ElleElleBee CurlyN"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 15, 2018 08:24AM EastcoastTS wrote: Sorry you've joined us -- but this is a great, supportive group. Ask and any all questions. We'll try to help. ",
      "MessageIndex": 8,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862479",
      "Title": "New and emotional LastChild EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 14, 2017 09:46PM EastcoastTS wrote: Theresa987: SO sorry you find yourself here. A member of the club no one wanted to belong to. Take comfort in knowing we understand and that you've found the most supportive group of people! Ask questions, no matter how minor. Someone will be able to chime in with advice or suggestions. I got my pre-surgical prep lists here (things no doctor, unless they have had this type of surgery and BC, would ever think to tell you), gained so much knowledge (much by reading what other doctors around the country were/are doing for those with a diagnosis similar to my own), and found a kinship. It's often a lonely place, even with family trying to help, because they don't quite get it. Walk that dog! (My dog and cats have been of great comfort.) Watch silly TV or romantic movies. In between the worry and angst and research. The fear gets better with a plan in place. I promise. Big, warm virtual HUG to you!!!",
      "MessageIndex": 9,
      "PostDate": "14/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859378",
      "Title": "Just diagnosed and terrified Theresa987 Theresa987"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 14, 2017 06:25PM EastcoastTS wrote: Raven: You do have this! No complications this time around. You and me both! LOL Will tell you -- immediate relief from removal of TEs. So damn glad those are gone!!! ",
      "MessageIndex": 106,
      "PostDate": "14/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 15, 2017 03:59PM EastcoastTS wrote: Pauline: I received a nerve block just prior to my mastectomy surgery. Apparently, it does help manage pain, although there are risks -- which they will cover with you. My doctor also used Exparel (injection during surgery) to help control pain. Coincidentally, my PS used Exparel during Exchange, too. You can Google to see about it. I was happy because Angelina Jolie's surgeon used it, so I felt: well, that must mean it's good! LOL For the nerve block, guessing it depends upon your facility. If this is standard process for them to go this route. Great to have questions about their pain management, though. I was very vocal about finding out what the deal was. Good luck!",
      "MessageIndex": 117,
      "PostDate": "15/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/857831",
      "Title": "September 2017 Surgery Group littlebee72 Deb_Z"
    },
    {
      "AuthorID": "EastcoastTS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "EastcoastTS wrote: Newly diagnosed and need advice. ;) Have spoken to surgical/reconstruction team locally and at MD Anderson. Have chosen MDA. My concern is doing surgery/recon and flying home. I have not completely chosen between unil- or bilateral (family history and waiting on genetics) but in any case -- has anyone else had to fly home (short flight: 2.5 hours)? WHEN did you go home? I would have husband/family support during travel. MDA does this so often -- they're what I consider very liberal about when you can fly, etc. THANKS! Dx@ 49. Oncotype: 14, BRCA 1/2- Dx 1/4/2017, ILC, Left, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- Surgery 2/26/2017 Mastectomy: Left; Prophylactic mastectomy: Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Surgery 9/7/2017 Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852138",
      "Title": "Travel For Surgery/Need Advice EastcoastTS 9lives70"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 15, 2018 11:53AM EastcoastTS wrote: CoComedy: You're about to get a college level med class in breast cancer with everything you'll learn over the next few months. There are many who know more than me but high ER/PR IS good because you have more treatment options. Lymph node and MRI results are good news as well. I mean, this diagnosis does pack a punch but we have to keep on truckin' right? (To use a beloved 70s saying.) They ran my Oncotype on the surgical tumor sample, so I believe that could be done then. Perhaps they run on biopsy samples sometimes, too? (I'm not sure.) This determined if I was going to do chemo. NO for me on that. Genetics were also done - especially since my mom is a survivor. But all ours were clean, which leads me to believe they have not found it yet. But press for any and all information they can give you. I wanted to know all I could to make informed decisions. You're doing all you can. And I think keeping a positive attitude helps a lot. I've met so many wonderful people along this journey and learned a lot. I've had my bad moments and absolute fear, too, however, trying to take it one day at a time and appreciate the joy in the moment (even while the scary stuff is occuring) is so good if you can maintain. Keep us updated and know that you have a BC posse out here.",
      "MessageIndex": 13,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862495",
      "Title": "Diagnosed but not really worried CoComedy rdeesides"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 6, 2017 10:55AM EastcoastTS wrote: You can also talk to a PS about laser. Apparently can really help with certain types of scars. But not covered in any way by insurance unfortunately. I read about it on Realself.com.",
      "MessageIndex": 14,
      "PostDate": "06/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835030",
      "Title": "Do mastectomy scars need to be so ugly? Gina4h Meow13"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 2, 2017 03:04AM EastcoastTS wrote: Garifalia: Similar situation here -- though mine came in at 14 (which I know is lower) but I wanted to be very sure with the NO chemo decision. My mom is a survivor and quite a bit of prostate cancer on maternal side of my family, which I've read may be related to ILC. (Which my mom and I both had, though all BRCA, etc., negative.) Mamma came in low risk. I was happy in any case to have all the info I could. Why would we not want to know all we can??? Hope yours is low risk and you can rest easy with your decision. Good luck!",
      "MessageIndex": 14,
      "PostDate": "02/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859482",
      "Title": "Mammaprint-who has had one? LizabethM gb2115"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 4, 2017 01:44PM EastcoastTS wrote: TaRenee: I'm right there with you. Same sentiment. Didn't do chemo and was glad -- but then fear: should I have done chemo? I trusted science (and doctors), too.",
      "MessageIndex": 25,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859482",
      "Title": "Mammaprint-who has had one? LizabethM gb2115"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 4, 2017 10:51AM EastcoastTS wrote: Hi, guys! I have now joined the Jan/Feb/March sugery lists! LOL. When I started reading, there was no Feb -- so I'm all over the place. I'm scheduled for 2/27 for either UMX or BMX. Leaning BMX but not sure. Maybe I won't be sure when they wheel me into the OR. Idk. These are crazy times -- but I'm doing okay. Hope you are all doing well, too.",
      "MessageIndex": 9,
      "PostDate": "04/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 6, 2017 09:45PM EastcoastTS wrote: Wow, Candles, thanks for the pre-surgery tips! I have Colace all ready to go and will hydrate well, too. Great idea about doing this for veins. I take a probiotic every day and will continue. My plans: arnica and bromelain before and after, good for bruising and recovery. Arnica cream is also effective for bruising but would not use on an open wound. Vitamin C, zinc and protein however I can get it. Also, shoot I can't recall exactly the name, but Juven (is that right?). I've read it's great for tissue healing. You can buy the packets at WalMart and I think mix with water. Not a miracle drug or anything but seems to help from reviews. I plan to let my BS know in our pre-consult which is 4 days before surgery (because my surgery is on a Monday morning) that I'm taking these. Just in case. I am not doing anything docs advised against. (Omega 3, Vit E, Advil, etc.) Good luck and warm wishes to everyone on the BC twister right now. As Tiny Tim said: bless us each and every one! ;)",
      "MessageIndex": 40,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 18, 2017 07:16PM - edited Feb 18, 2017 07:17PM by EastcoastTS I'm headed for BMX on 2/27. I asked about the pain ball and was told they didn't do these but would do Exparel (bupivacaine liposome) instead. I honestly am not sure if they would have done this had I not asked about the pain ball. You gotta manage your own health care, wow! Here's a good article about pain management from Angelina Jolie's surgeon. Ha ha. I know, maybe that topic is over-discussed -- but she must be a good doctor and she used Exparel! I Googled the med and that's how I found this article. My advice: ASK your BS. Because nothing will happen if you don't. But I'm pushy. http://www.everydayhealth.com/columns/health-answe... I also talked to a woman today who had BMX in November and her PS used Botox. Which I've just read about. She had one-step and almost NO muscle spasms. I'm going to ask about this, too. Why not? All they can say is: no. I've had it before (just being honest) so my body is cool with it. As far as reconstruction goes, I considered UMX (I'm possibly multi-focal, not sure. I did not do another biopsy on second spot seen on re-review of my MRI because I already had surgery date in place) but I finally just came to the decision that BMX is the best for my situation. Dense breasts, family history, possible high risk depending upon who you're talking to. Also, they found LCIS in my tumor, too, and the first diagnosis was ILC, now changed to IDC, but this is only on the biopsy path. So I wonder what the heck will truly come up with this in the final path -- and at least I won't be like: damn, wish I had known that and just gone BMX. Also, I'm really small (AA cup probably) and everyone concerned with cosmetic (which I realize it NOT getting the cancer out) has told me: girl, do BMX. But the final decision was me/mine/personal. You have to weigh all the factors and go with what you can live with or, heck, live without! But I'm not sure even when they wheel us into the OR -- is everyone completely sure they've made the best decision? I'm not sure there myself. Yes, I worry about more surgery and having to deal with both sides involved but...I want to make the best decision. If I made my decision from fear, I would go UMX. If that makes any sense at all. We're with you! Support, wisdom, kindness, acceptance, understanding. You're not alone.",
      "MessageIndex": 146,
      "PostDate": "18/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 3, 2017 10:53AM EastcoastTS wrote: Also not sure if you have tissue expander(s) but implants are AWESOME in comparison.",
      "MessageIndex": 17,
      "PostDate": "03/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860414",
      "Title": "Mastectomy Sisters How did u celebrate/remember your breasts? sm627 sm627"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 6, 2017 03:15PM EastcoastTS wrote: Sara: I was out for three weeks but I could have gone back sooner. (This was disability and doctor agreement, I was not invovled in timing decision.) However, your job is more active than mine at a desk! You don't want to get sick, though, from the kiddos. So take what you can that work will allow. To rest and be healthy. Some that I read about on the Exchange forum were out way less than me (no pocket work)! Depends a little on how much your PS is going to have to do. At least you're only one side. That should make everything easier. But just remember to limit yourself. You'll feel better, so you may want to do more. Just take it easy. That is what I tried to do. It was great how much better I felt than after BMX. ;) ",
      "MessageIndex": 22,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860414",
      "Title": "Mastectomy Sisters How did u celebrate/remember your breasts? sm627 sm627"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 15, 2018 09:41AM EastcoastTS wrote: I'm so sorry about this. But have to add my story. 3D mammo missed mine. US almost missed (radiologist's first words to me: good catch). And I had been having faithful mammos (3D for a couple of years) since the age of 39 due to family history. None caught anything. I felt the lump myself and would not have if I was not really thin. To my way of thinking. Larger breasts and my tumor would have been really, really big by the time anyone noticed it -- me or the shitty mammograms. I had very dense tissue and this is one reason I decided on BMX. I did not want to beg for MRIs for the rest of my life when all else had basically failed me. But all of that is another discussion and a very personal one at that. One note: this journey will get easier as you get a treatment plan in place. I promise this. You are in the worst time without full knowledge and a plan. {hugs}",
      "MessageIndex": 14,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862498",
      "Title": "Who missed this? mianola marijen"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 12, 2017 10:35AM EastcoastTS wrote: ShellyBeans and bvh2305: THANKS so much for words of encouragement and advice. I'm headed for BMX on 2/27 and reading all I can. Have a list for the overnight bag in place! ;) Colace ready, too. Prepare for Surgery: Heal Faster has been recommended if anyone else is interested. Used copies available on Amazon, etc. Much warm thoughts to all...",
      "MessageIndex": 76,
      "PostDate": "12/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 21, 2017 10:03PM EastcoastTS wrote: Pamela2016: Has the visiting nurse been helpful? My insurance covers one -- but have to ask Dr. to approve/order. Worth it? Glad you're doing well! (Or so it seems if you're even up to visitors!) HAPPY BIRTHDAY, too. ",
      "MessageIndex": 166,
      "PostDate": "21/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jan 31, 2018 06:17PM - edited Jan 31, 2018 06:17PM by EastcoastTS Basil: First off, sorry you've had to join our little club. But so glad you reached out and found us. I could not have made it through the past year without the great people here!!! Also, everything you are feeling is so normal. The angst when you're first diagnosed is horrible. I remember that well and can PROMISE that it gets better with a treatment plan in place and more information under your belt. Research: My mom went through this 10 years before me and did not do the research that I felt I had to do. And she's fine 10 years later. If you have a great medical team in place, then perhaps you will not feel you have to know everything. If it helps you cope. (And agree -- stay away from blind Google searches.) Just get a solid team (and seek 2nd opinions if you're not sure). I did and it was easy to secure them. Re: telling people. I'm not on FB and I suppose am fairly private (although I spill everything here!) and I didn't want to tell everyone. So I didn't. Now it's gotten easier. But my neighbors still don't know. I guess I'm saying: do what presents the LEAST stress at this moment. If it's easier, I've heard of some people designating a person as their communications lead. They let everyone else know what is happening. How about that? Or wait until after surgery, unless you have to, then let people know. Just do what you need for you right now. Everyone else must slip to second place for a while. BTW, I didn't tell my 10-year-old son until a couple of months ago what the real deal was. At first, we just went with it's surgery and not a lot more detail. I found that easier for me. Idk why exactly. I just did. About waiting for results. Well, I came here and did just what you're doing. Asked for advice and just read other's stories to calm my fears. I also asked for a little happy pill to help me. Sleep if nothing else. And I needed it -- for the first time in my life -- at 3am some mornings. Don't hesitate to ask your doctor for this. Many, many here have done the same. Come back and ask any and all questions when you have more info and have questions in place. I was well prepared for surgery because of my lovely \"friends\" here. I knew what to expect in some manner and, really, I didn't feel so alone. You are not alone!!! {big virtual hug from me to you}",
      "MessageIndex": 3,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/862121",
      "Title": "In denial, having anxiety and how do I tell people? Basil2 teriabbott"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 18, 2017 07:19PM EastcoastTS wrote: Whoops -- this was meant for another thread with someone asking for advice! I have multiple windows open. LOL. I'm a mess. So going to cut and paste over there, too. Ignore my madness for reading twice but some is good info. (Botox/pain article)",
      "MessageIndex": 147,
      "PostDate": "18/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 21, 2017 09:54AM EastcoastTS wrote: Thank you everyone for the advice and tips! 2/27 just around the corner for me. Gulp.",
      "MessageIndex": 159,
      "PostDate": "21/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 1, 2017 09:31AM EastcoastTS wrote: sm627: There is an fairly active list for Exchange surgery that has lots of people commenting on implant exchange surgery. You can ask and many will give recent examples, tips for surgery, bras used after surgery. I went back and read some older posts even (last year, etc.) and this really helped me prepare. Exchange City: https://community.breastcancer.org/forum/44/topics... Good luck!",
      "MessageIndex": 14,
      "PostDate": "01/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860414",
      "Title": "Mastectomy Sisters How did u celebrate/remember your breasts? sm627 sm627"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 3, 2017 10:51AM - edited Dec 3, 2017 10:51AM by EastcoastTS sm627: My experience was good. Exchange surgery -- as you'll read from almost everyone on the Exchange forum -- is SO much easier than UMX/BMX. So much easier. Now, that said, I had lots of pocket work completed due to my tissue expanders being very far apart. And one dropped during the process. All typical stuff but you have to correct at Exchange. But even with that, it's just completely so much easier. I was home that afternoon (morning surgery) -- reading newspaper with coffee next morning. I tried to be very careful about not lifting and doing more than I should for a few weeks. I'm three months post almost now. Because you'll feel better and feel like you can do those things. That was hard a bit. But other than that, really, you'll do great. Some ladies without pocket work are like, did not even feel it really. ;)",
      "MessageIndex": 16,
      "PostDate": "03/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860414",
      "Title": "Mastectomy Sisters How did u celebrate/remember your breasts? sm627 sm627"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Apr 23, 2017 06:55PM EastcoastTS wrote: 49. ;)",
      "MessageIndex": 717,
      "PostDate": "23/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Sep 28, 2017 07:34PM EastcoastTS wrote: They missed my tumor (which was palpable) on 3D mammo. Believe they would have missed on US had I not directed them to it: it's here. Just going by what the radiologist said after about it being faint and a good catch. Yes, I guess so. I did have dense breasts and had been getting 3D for a few years. Someone along the BC way told me my films were white -- could not see anything. I had no thought to ask about an MRI or something preventively (I have family history) but wonder if 3D is enough for dense breasts. Idk.",
      "MessageIndex": 79,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/634136",
      "Title": "Cancer missed by mammogram? joanne_elizabeth HoneyBeaw"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 19, 2017 10:42AM EastcoastTS wrote: Are we supposed to take Colace BEFORE surgery for a couple of days? What is best way to combat constipation? I've read so many options and would love to at least manage that. I have Colace, etc., on hand but not sure what to do with it! ;)",
      "MessageIndex": 152,
      "PostDate": "19/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 27, 2017 07:19PM EastcoastTS wrote: I'm four weeks past surgery today (2/27) and doing pretty well. I believe most of my pain or discomfort at this point is due to tissue expanders. ;) Gotta love them. It's not unbearable but just uncomfortable with twinges of pain or spasms. I'm working on range of motion (which is good and was never terrible but I've been careful) -- and feel great. Except for first two weeks maybe, I'm not that tired. No idea why but glad! Still sleeping on back. I'm a side sleeper but have actually gotten used to this, in the interim anyway. Walking each day and getting out about normally with family. Did restorative yoga today which is mostly just lying on the floor and listening to guided meditation! LOL I have asked for PT because I'm horrible about doing exercises at home. I need guidance and someone to bug me. And I want to heal properly. Glad to read everyone's updates!!!! Go Team Feb!",
      "MessageIndex": 235,
      "PostDate": "27/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 21, 2018 06:23PM EastcoastTS wrote: Oceanbum: I agree--better safe than sorry. July will be here before you know it. ;)",
      "MessageIndex": 15452,
      "PostDate": "21/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 4, 2017 10:52AM EastcoastTS wrote: Sara: Definitely check out the Exchange forum and ask lots of questions there, too. My ROM was good after Exchange -- after BMX, it took some time. Your PS should give you detailed instructions about lifting, exercise, etc., but mine was to \"not do anything\" for 2 weeks (I know, how detailed, LOL) and for 6 weeks or so, nothing over 5 lbs. Everyone gets different advice but I'd say, take great care of yourself in those initial weeks after. You want to preserve the pocket that has been created. I was also told not to lift arms over the shoulder for the first two weeks as well. I may have been a little sleepy from anesthesia the week or so after Exchange but the length of the surgery is shorter (guessing), so this should be less for you this time, too. Although mine was around 3 hours due to the pocket work. The first 24 hours I was a little groggy but just nothing like BMX. You'll do great, I bet!!! Try not to worry.",
      "MessageIndex": 20,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860414",
      "Title": "Mastectomy Sisters How did u celebrate/remember your breasts? sm627 sm627"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 12, 2018 05:02PM EastcoastTS wrote: Good luck tomorrow. I'm sorry this is tough right now. and you're having to make life changes, even if only temporary (with your children). You're in the worst stage of this (from my memory). Hang in there and come here when you need to.",
      "MessageIndex": 25,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862350",
      "Title": "Despair and kids Magnolia-mom bluepearl"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jul 16, 2017 05:45PM EastcoastTS wrote: Dodes: Keep your good spirits. Those carry you through much on this journey. Pretty much say 2017 is now devoted to the guest you didn't invite but decided to stay: BC. That's what I've done. Then, I want 2018 to be about other things! Not cancer!!! The more info. you receive and the more you understand your plan and your exact diagnosis, the better this gets. My Oncotype was done after surgery. Because if I had had lymph node involvement, they may not have run it. (Because chemo decision made already.) Not sure if that is always/always the case. You should receive your biopsy sample's hormonal breakdown soon, I'd guess. Ask them! I had to wait about a week for the entire thing -- but you got some info quickly you said. This information is critical for next steps and treatment planning. Along with the MRI, which should give everyone a very good idea of the tumor size and how the rest of the breast -- and it's partner -- are doing. My MRI said my tumor was 1.2mm and it was actually 1.8mm, however, I'm lobular and they are often larger in final path. analysis. You should get a very good idea (I think) since you are IDC. Once the steps fall into place, you'll begin to see where you are headed. Take a breath. Waiting was the absolute hardest part (not knowing my stage until about 2 months after diagnosis). All a guessing game until then. Stay off Google. :) Hugs to you!",
      "MessageIndex": 8,
      "PostDate": "16/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/856998",
      "Title": "Just Diagnosed with IDC, but don't have much info yet. Dodes Yvonne55"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jul 17, 2017 07:19PM EastcoastTS wrote: 49 for me, too. Young on the cancer spectrum. Joy. ;)",
      "MessageIndex": 12,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/856998",
      "Title": "Just Diagnosed with IDC, but don't have much info yet. Dodes Yvonne55"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 9, 2017 08:29AM EastcoastTS wrote: Chiming in after ChiSandy's amazing post. Dr. Love's book was the first thing I read upon diagnosis. I sent it to my mom when she was diagnosed, and she did the same for me. We're lucky that way. (not) ;) It's really a great read and very informative. I'm also doing Brassica tea and/or green tea daily IF I remember. Plus some supplements recommended by my alternative MO. Mainly, I've cut down on sugar, alcohol (wine after work was my MO), processed crap, eating more veggies/real food, getting more disciplined exercise. I'm thin, so weight not an issue. Which can be hard, too. Beach2beach: I love Ask an Expert! I check it all the time. Lillie will answer your questions within about 24 hours, too. I've asked two.",
      "MessageIndex": 21,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859177",
      "Title": "I just got diagnosed with IDC/DCIS Virgo73 swg"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 9, 2017 09:45PM EastcoastTS wrote: Virgo: I had additional spot seen on MRI that turned out to be benign. I didn't have a biopsy done on it because I was close to surgery already and had decided upon BMX. I figured, why have another biopsy when they're taking all the tissue? Also, a lymph node was seen as enlarged that turned out okay, too. They said it could be reactionary from the biopsy, which makes sense. So don't assume the worst. I know that's hard. I assumed the worst at first, too, because it's the scariest place to be when you do not have all the information. It does get better, I swear, once you do. Take care. We're here for you.",
      "MessageIndex": 26,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859177",
      "Title": "I just got diagnosed with IDC/DCIS Virgo73 swg"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 4, 2017 03:30PM - edited Feb 4, 2017 03:31PM by EastcoastTS Hello, Hahlyn: Thanks for the welcome! I'm sorry to be here as well -- but we have to take what life throws our way, right? I considered lumpectomy initially, too, but my 2nd opinion MRI review saw another possible area of issue (7mm, same quadrant I believe) in the \"bad\" breast and that was it for me. Ultrasound radiologist in session after the MRI reassessment could not see a thing. Comforting. (Not. And provides some of my reasoning behind my decision-making -- that they cannot see this stuff!) This was actually empowering or at least made the decision for me. One I didn't have to make myself. It was either have another biopsy 3 weeks before surgery or just UMX it. So...",
      "MessageIndex": 11,
      "PostDate": "04/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 6, 2017 09:50PM EastcoastTS wrote: Also should add that I've read over and over on this site from others so wise now to what we are facing: tell the anes. that you get nauseous easily so they prep you with anti-nausea drugs beforehand and after. It can't hurt...",
      "MessageIndex": 42,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 7, 2017 04:42PM - edited Feb 8, 2017 11:47AM by EastcoastTS Just got a zipper front bra (there were some hook/eye, too) at WalMart. Not $ -- $12 or so. They had more than one to select from. More of a sports bra, I'd say. My God what a selection of bras. I'm on the small/tiny side, so honestly, could almost go without every day. I'm not a big bra shopper. Goes to show that BS does not favor larger breasts, my friends! I think I got scammed on this deal. ;)",
      "MessageIndex": 45,
      "PostDate": "07/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 13, 2017 07:44AM EastcoastTS wrote: My thoughts are with you Rebamacfan123!",
      "MessageIndex": 91,
      "PostDate": "13/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852348",
      "Title": "February 2017 Surgery Hahlyn Jackiebro"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jul 25, 2017 02:46PM EastcoastTS wrote: Insurance paid for mine but the genetic counselor said that out of pocket (if insurance did not cover) is maxed at like $250. Talk to a genetic counselor, not necessarily the MO, if that makes sense. They'll help you more. Now that I recall, the genetics group called ME before running and stated that my out-of-pocket would be no more than the $250 or so that I recall IF insurance was a no-go. Perhaps you can find out who would test and call them.",
      "MessageIndex": 20,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/856998",
      "Title": "Just Diagnosed with IDC, but don't have much info yet. Dodes Yvonne55"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jul 25, 2017 07:55PM EastcoastTS wrote: Busy freaking out is normal. I still do it every now and then myself! HUGS to you. Ask any questions. No matter how small.",
      "MessageIndex": 22,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/856998",
      "Title": "Just Diagnosed with IDC, but don't have much info yet. Dodes Yvonne55"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 9, 2018 09:05AM EastcoastTS wrote: Magnolia: I'm so sorry you've had to join our club but am so glad you found us. You're not alone, so come here whenever you need to. Ask any and all questions. We UNDERSTAND. I also have a son, 9 @ diagnosis, and he was my most vulnerable segment (if that is the way to say it) of my journey. Just thinking about what I could miss with him, ugh, tore me up. But my son has been super positive, and really, he can't truly understand what all this means. Or is. And your children likely will not, either. The fact that you're feeling guilty means you are trying to be the best mom you can be...but right now...you have to come first for a while. But at the same time still be a mom. So if something slips for a few months, your children will survive and be fine. And you may have to lean on people in a way that is new, too, just for a bit. I promise you that once you get a handle on your diagnosis -- more information, more knowledge, a treatment plan in place -- this gets easier. The crazy, middle-of-the-night anxiety fades a bit as we cope. Come back when you have more information and those with a similar diagnosis can address specific questions you may have. Give yourself some time to manage all this. You don't have to be a supermom right now. {hugs}",
      "MessageIndex": 5,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862350",
      "Title": "Despair and kids Magnolia-mom bluepearl"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 15, 2018 09:59AM EastcoastTS wrote: I also did Livestrong and you get full access to the Y during the time period, which I think was 12 weeks. This was almost better than classes because I got back into the rhythm of going to the gym at no cost. Call your local Y and ask if they have it. A doctor may need to send info in, but it was easy to facilitate.",
      "MessageIndex": 18,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858382",
      "Title": "Working out post mastectomy Chloe3278 EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 11, 2018 11:27AM EastcoastTS wrote: I've been on Tamox since May and really have little side effects that I can note (to date). Minor if anything. So I agree with others. Try it and if you have issues, you can discuss with your MO. There are options. I have osteoporosis and Tamox is better for bones, not worse. Or better than AIs in any case. I'm with you, gb2115. I want protection. And feel they may have additional options for us at that time (9 years down the road). Good luck to all!!!",
      "MessageIndex": 5,
      "PostDate": "11/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862397",
      "Title": "Is Tamoxifen Worth It? Dustien msphil"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 28, 2018 06:57AM EastcoastTS wrote: Chloe: I did push-ups last week (not a ton of them) and it felt okay. But I have fairly small implants. I also did plank -- again, felt okay. I had Exchange in Sept -- BMX a year ago yesterday! ;)",
      "MessageIndex": 24,
      "PostDate": "28/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/858382",
      "Title": "Working out post mastectomy Chloe3278 EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Oct 14, 2017 09:07PM EastcoastTS wrote: Virgo: Thinking about you tonight -- telling your children. Take a breath when/if you can. Really, you're in the worst place right now. Fear just so high and plan not completely in place. Crucial/critical information outstanding. I remember this place well. (Staying up until all hours -- researching, etc.) I'm a Virgo, too, so get the worrying. I hope you find some peace somewhere in each day. Grab that if you can. This WILL get better. HUGS.",
      "MessageIndex": 54,
      "PostDate": "14/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/859177",
      "Title": "I just got diagnosed with IDC/DCIS Virgo73 swg"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jul 25, 2017 09:19PM EastcoastTS wrote: I had ILC -- missed on yearly mammograms since age of 39 (3D) and likely would have been missed on the US if I had not pointed out the lump. Radiologist's first words: good catch. I guess I was not aware that mammos missed tumors or I might have pushed for more. Whatever more would be. Some doctor along the way said my films were completely white (dense). Could not see a thing.",
      "MessageIndex": 41,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/634136",
      "Title": "Cancer missed by mammogram? joanne_elizabeth HoneyBeaw"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Mar 15, 2018 07:48PM EastcoastTS wrote: Minnie: I'm so sorry you're having to go through this. We all remember those stressful/waiting/testing times. Thinking of you and hoping the news next week is good.",
      "MessageIndex": 8,
      "PostDate": "15/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863218",
      "Title": "Lump size of an orange in breast MinnieM EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Apr 5, 2018 12:19AM EastcoastTS wrote: Yes, welcome. Although it's the place no one does want to be, you've found the most supportive, knowledgeable group ever. It seems like you've had great care from what you said -- and I also hope your BC was caught early. Adding another hug!",
      "MessageIndex": 2,
      "PostDate": "05/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/863735",
      "Title": "Add me here Aliceinchains Aliceinchains"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 2, 2018 03:16PM EastcoastTS wrote: Dr. Love's Breast Book is really good. An easy read and so informative.",
      "MessageIndex": 14,
      "PostDate": "02/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/862121",
      "Title": "In denial, having anxiety and how do I tell people? Basil2 teriabbott"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 9, 2018 05:55PM EastcoastTS wrote: It actually really worked well. The Saran Wrap stayed and kept the lotion off my clothing (which didn't really matter if it spread). This site is full of great ideas and tips for our journey. ;) Hugs to you!",
      "MessageIndex": 11,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862302",
      "Title": "Got all test results--surgery is scheduled astyanax66 EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 6, 2018 07:02AM EastcoastTS wrote: Basil2: One day at a time is a great way to manage this right now. All you can do. Everyone is anxious about surgery, but after two in 2017, I can say that everyone on my team was so capable and caring (down to the nurses who came in for the prep stuff at the very beginning). They do this every day. So, really, try not to worry. You'll do well -- and they will take care of you. You may have to lean on family, etc., for a bit, but that is okay, too. When you know what you're doing, express your anxiety to your doctors, let them explain everything (if you want to know details). Ask about their pain management protocol so you're feeling good about what will occur after. Also, there are many lists here for getting prepped once you know what you're doing. Some very small but beneficial tips that NO doctor will ever tell you. I was really well-prepared for surgery! {hugs}",
      "MessageIndex": 27,
      "PostDate": "06/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/862121",
      "Title": "In denial, having anxiety and how do I tell people? Basil2 teriabbott"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 16, 2018 09:36AM EastcoastTS wrote: Mae232: I'm so sorry you are here but glad you found us. This is the most supportive group! I could not have made it through my first year (2017) without them. You're in the worst part of the journey right now. Incomplete information and anxiety. At least you have surgery scheduled soon, so you'll get surgical pathology results, which will help complete your treatment plan. We understand the fear you're feeling. Just know that you're not alone. Come here with any questions or just to \"talk\". {hugs}",
      "MessageIndex": 2,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/862523",
      "Title": "just got diagnosed with IDC and waiting for results mae232 Mamasha"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jan 20, 2017 07:27AM EastcoastTS wrote: Newly diagnosed, too, Gaga. Thinking about you.",
      "MessageIndex": 18,
      "PostDate": "20/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/851940",
      "Title": "Just got the call from my doctor and she told me I have cancer GAGA615 msphil"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 6, 2018 08:48PM EastcoastTS wrote: Sorry you're finding yourself here (again). But you know the drill, it seems, and have it under control. Also sorry you've had your fair share of surgeries in the past. Just forcefully tell them to give you the anti-nausea meds, that you've had a bad reaction. I think they'll take you seriously with your track record of surgeries. Good luck and hang in there. I hope you find peace and comfort along this journey, too. {hugs}",
      "MessageIndex": 1,
      "PostDate": "06/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862302",
      "Title": "Got all test results--surgery is scheduled astyanax66 EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 8, 2018 04:40PM EastcoastTS wrote: astyanax66: My take on the dye/nuclear injections. I had mine a couple of days before surgery (MD Anderson) I guess because my surgery was on Monday am, bright and early. Anyhoo--someone on this list told me to ask for EMLA cream (topical numbing cream, prescrip). My doctor ordered, although I'm sure thought I didn't need but I made them do it -- and doctors discount pain in any case to a certain extent, especially surgeons! -- and the suggestion was: cover said breast in EMLA, cover then with SaranWrap (no lie) and go to appt. Do this about an hour before. So it has time to work. I also took an Ativan. Sorry I was nervous. I felt NOTHING. Nothing. So -- maybe some combo of those things worked. The facility did tell me that they'll do EMLA if a patient calls and asks beforehand because you have to come in early for application. So ask your facility and/or ask your doctor for EMLA. It's can't hurt to do this if you're nervous. ;)",
      "MessageIndex": 9,
      "PostDate": "08/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/862302",
      "Title": "Got all test results--surgery is scheduled astyanax66 EastcoastTS"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Dec 19, 2017 10:15PM EastcoastTS wrote: Jgd78: I'm not sure how to answer the chemo question, either, exactly. Oncotype decided no for me -- I have you by about ten years, however, and age may play a role for you. Take a fat list of questions to your MO on Thursday! Sorry you find yourself here and dealing with this. I'm a mom of a 10-year-old and thinking about him during all this was my biggest vulnerability. Big hug to you!!!",
      "MessageIndex": 10,
      "PostDate": "19/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860934",
      "Title": "nervous for my BC staging next week jgd78 Nancy2581"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Jan 30, 2017 10:06PM EastcoastTS wrote:",
      "MessageIndex": 1377,
      "PostDate": "30/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 1, 2017 03:50PM EastcoastTS wrote: Lisabekind: Thanks for the shout-out. You're close by - I'm in Charlotte. ;) Get the 2nd opinion. It's a good feeling to have more information, at least it was for me. And my path. changed! Not to mention the missed spot of indeterminate nature on the MRI (which pushed me into at last UMX land).",
      "MessageIndex": 1450,
      "PostDate": "01/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Aug 9, 2017 08:00PM EastcoastTS wrote: Okay, I have to chime in here. I was an AA cup -- tiny. So that can't be it! ;) Or maybe it can and I'm unlucky tiny boob chick! I do wonder how such little tissue could generate a tumor. Oh, well...",
      "MessageIndex": 116,
      "PostDate": "09/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764313",
      "Title": "Why don't Chinese women get breast cancer? MCTHO"
    },
    {
      "AuthorID": "EastcoastTS…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245091/profile",
      "Content": "Feb 13, 2017 08:30AM EastcoastTS wrote: DCISinAZ: I got genetic testing done -- my mom is BRCA 1/2- but still have BC and lots of prostate in the family. When she was DX (2009) they only ran BRCA. I was negative for all. My genetics counselor called and told me over the phone (she's at MD Anderson in Houston, so out of town for me). They also uploaded results to an online portal. It only took about 5 days that I recall! Fast. I'd do it and try not to be nervous. More information is beneficial and look at it this way: at some time in the very recent past, women would have loved to know more but science was not there to help them. It is there to help us now. Warm wishes... ",
      "MessageIndex": 2028,
      "PostDate": "13/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    }
  ]
}