{
  "AuthorID": "ebonylove",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124992/profile",
  "Posts": [
    {
      "AuthorID": "ebonylove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124992/profile",
      "Content": "ebonylove wrote: 1st time for everything, right? Well, this is my 1st post. Been checking the site out for a while now...I started my 1st dose of AC+T chemo on Monday February 21st, 2011 and whew! Those 1st five days were a hot mess! (Nausea, headaches, fatigue.) Since those symptoms are gone, now I have tingling/numbness in the fingers, loss of taste for sweets, and one morning I woke with a mouth sore but it disappeared within a day. Tomorrow is my 2nd dose of AC and Im scared shitless! I dread the nausea and fatigue returning. Will it return at a more aggressive rate? My hair hasn't started shedding yet, but Im expecting it after this dose, right? Everyday my 4 year old son tells me how pretty my hair is....how is he gonna react when he finds me bald??? I plan to get a wig this week. I've been putting it off because the idea of it freaks me out! Im 27 and Im sure the wig will make me look 67. Did the chemo make anyones nails black? I heard of this reaction and dont wanna look like Freddie Krueger! And not to mention, this port has a tight knot in my neck that is vicious! Is it suppose to hurt like this? Ive had it in for 2 weeks now? I have also managed to get lymph-edema! Yeah me! My right arm only raises to a 100 degree angle, after having the LAT-FLAP surgery immediately after my right breast mastectomy. Has anyone tried Latisse on their eyebrows or lashes to keep them in? I have some but am hesitant to try it. I hear it can make your eyelids dark..I dont wanna be bald and look like I have a black eye! Help! Lets network! ~Black Love~ Dx 10/2009, DCIS, <1cm, Stage 0, 0/0 nodes Surgery 10/9/2009 Lumpectomy: Right Radiation Therapy 11/9/2009 Breast Surgery 1/11/2011 Mastectomy: Right; Reconstruction (right): Latissimus dorsi flap Dx 1/21/2011, IDC, 1cm, Stage I, Grade 3, 0/1 nodes, ER+/PR+, HER2- Chemotherapy 2/20/2011 AC + T (Taxol) Hormonal Therapy 8/31/2011 Dx 2/7/2013, IDC, 2cm, Stage I, Grade 3, 0/10 nodes, ER+/PR+, HER2- Surgery 3/11/2013 Lumpectomy: Right; Lymph node removal: Right Surgery 3/19/2013 Lumpectomy: Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/765840",
      "Title": "Help! Questions! Just start chemo? Let's do it together! ebonylove momand2kids"
    },
    {
      "AuthorID": "ebonylove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124992/profile",
      "Content": "Mar 17, 2013 04:18PM ebonylove wrote: I have encountered BC 3 times and 4 surgeries since 2009. I have had some horrible surgeons and some great ones. One of the best is Dr. Jacqueline Jeruss at Northwestern Prentice Womens Hospital, dwtn Chicago. Dr Kim who is a breast plastic surgeon is the best for reconstruction as well. Def give them a call....they are the BEST in the city!!!",
      "MessageIndex": 1,
      "PostDate": "17/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/801952",
      "Title": "Chicago area - Looking for a Surgeon laurie2025 therapistmom"
    },
    {
      "AuthorID": "ebonylove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124992/profile",
      "Content": "Mar 17, 2013 05:50PM ebonylove wrote: Def have pt! I had a mastectomy in 2011 and without it I would have probably never used my arm the same way again. I just had more surgery last week and tomorrow I'm getting another referral for therapy BC once again I find myself in plenty of pain. It can be challenging trying to do it alone BC you have no one to set goals for you and if you ignore the pain, you will find yourself facing years of misery. Take it from me and get yourself the help early!",
      "MessageIndex": 2,
      "PostDate": "17/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/801929",
      "Title": "Post mastectomy pain :-( MrsH MrsH"
    }
  ]
}