{
  "AuthorID": "echan252",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82724/profile",
  "Posts": [
    {
      "AuthorID": "echan252",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82724/profile",
      "Content": "echan252 wrote: Dear all,  I am only 20 and i started to feel lumps and stuff when I was 19 (right first year of my university)....my doctor has been sending me to ultrasound for a close follow up for a year and just yesterday during my ultrasound appt I know I have a new one. My mom has been recently diagnosed with the same problem and she's around 45 (not malignant though).... I am doing a degree in science and i am JUST REALLY WORRIED because at such a young age I am already experiencing this, accumulations of mutations over time are the cause of many cancer and if these lumps are growing that means STH is wrong in my system arleady! (possibly some DNA mutations).... I know worrying doesnt do anything and just add to the problems but i just CANNOT stop thinking =( I am going to see a specialist, do you guys think it's a good thing to have it surgically removed? (im really scared of needles tho)....I tell myself be optimistic don't worry it's not cancer but thoughts just keep running through my head =( -echan Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732989",
      "Title": "OH MY GOODNESS =( echan252 momo3esb"
    },
    {
      "AuthorID": "echan252",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82724/profile",
      "Content": "Apr 23, 2009 03:09PM echan252 wrote: Thank you so much guys, I truly appreciate all of your opinions. I heard that biopsy isn't even 100% guarantee that the results is correct? And i have heard that many people leave it inside, and later it just grows bigger and bigger and eventually have to remove it?  Do you guys do anything or change or lifestyle to reduce the risk of breast cancer?",
      "MessageIndex": 3,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/732989",
      "Title": "OH MY GOODNESS =( echan252 momo3esb"
    }
  ]
}