{
  "AuthorID": "Ede123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278679/profile",
  "Posts": [{
    "AuthorID": "Ede123",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278679/profile",
    "Content": "Ede123 wrote: Before I get started here is a little bit of my backstory. I am a relatively healthy 23yr old female except for some major anxiety issues especially relating to hypochondria. I can not tell you how many different cancer scares I have had in the past, everything from brain to breast to tongue to stomach, it's just never ending. I have had countless tests for countless issues, not always cancer also things like MS and even Hep C (I work in a dental setting). Of course everything always comes back as normal although I doubt I will ever be truly \"normal\". I have suffered from anxiety since age 10 however over the past 5 years it has improved dramatically, I don't worry about health issues nearly as much as I used to, but this current issue I am having is really getting to me. My breasts are relatively small and normally lumpy. I had a previous BC scare when I was about 15 from me feeling my normal lumpy breasts and panicking that I was going to lose all my hair and die before finishing high school. They did an ultrasound for me and of course everything was fine and I'm just a moron. Fast forward to present day. Probabally about a year ago was the first time I noticed the current lump, only because of how tender it was. It is right along my bra line under my left breast. The pain often feels like it is on the ribs but there is defiently a lump that is causing it. The lump is the size of a lima bean, and I can move it around beneath the skin. It hurts a lot right now but so does my right breast because I have been squeezing the crap out of them the past few days looking for similarities. I think I can feel similar lumps on my right breast but not as big or sore as the left one. I have no family history of any cancers however I have been taking Marvelon 21 (a high estrogen birth control pill) daily for the past 10 years and am aware of the increased risk. The soreness comes and goes mainly when I have been wearing an underwire bra for a long time, over the past year it has not increased or decreased in size. When breast cancer is painfull will the pain come and go or stay constant and get worse? Is it possible to have a cancerous lump that does not grow noticeably even after a year? When I first noticed this I forced myself to forget about it, since up until now 100% of the shit I have worried myself sick over has always turned out to be nothing. I am probabally going to have my doctor assess the issue at this point but I am worried that if it is cancer then I have signed my death certificate by not having it checked out when I first noticed it. Or once again it will turn out to be nothing. The lump is aching right now, reminding me of it every 5mins. I was doing some reading on google, (which believe it or not actually reassures me more often that it worries me), and most of the stats seemed to be in my favour. Until I came across this form where another girl explained exactly what I have (small, sore, and smooth movable lump right under the left breast) and everyone thought it was a cyst but it turned out to be cancer. I don't know exactly what I'm looking to get out of this form, I know only a doctor can say for sure one way or another, I think I just wanted to talk it out and get possible advice? The only other thing I can think of is very close to the lump/sore area I actually have a third nipple, looks like a mole but it's technically a nipple. The lump is not attached to it just very close to it. Not sure if they are related or it's just a coincidence. Today is Friday night but I think I will call my doctor on Monday and see if I can get in for an appointment, although this is a bad time for me to take off work. I was also just in for a physical last week but I figured this issue was nothing so I never said anything because I actually forgot about it, and I honestly really hate myself right now. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "17/08/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866673",
    "Title": "Sore lump under left breast -Hypochondria? Ede123 Ede123"
  }]
}