{
  "AuthorID": "edge_of_no_…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245404/profile",
  "Posts": [
    {
      "AuthorID": "edge_of_no_…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245404/profile",
      "Content": "Jan 15, 2017 02:59PM edge_of_no_return wrote: good morning January 2017 warriors - second to reading the latest posts carefully, i patted away the tears reading responses to my dark blue note. grateful tears. i've been dealing w mental illness for a lot of years and have found that, like this new fresh hell that is bc, even one's family and closest of friends may not be able to share either journey with me, nor would i expect them to, or necessarily even want them to. i've been encouraged thru the years to find a support group for what i like to call brain cooties (h/t Jerrod Poore of CrazyMeds.org) and was never for a moment interested for whatever reason. Getting the news for bc is a wholly different animal and i'm really gobsmacked to find this specific, bite-sized group of brave, smart, vibrant & witty wimmins. You guys are brilliant! i'll be under my bedcovers,tapping the iGizmo, listening carefully. god bless.",
      "MessageIndex": 688,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "edge_of_no_…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245404/profile",
      "Content": "Jan 13, 2017 11:57PM - edited Jan 14, 2017 12:24AM by edge_of_no_return thank you so much for starting this group. i had the lumpectomy & sentinel node removal 1/6/17; waiting for oncotype test results. was hospitalized twice at the beginning of 2016for suicidal ideation & was just starting to settle down when the dx arrived. i am blown away by all the mothers, wives, sisters, teachers & helpers going thru this who are so incredibly brave and have so much to live for. battling the irrational & shameful desire to end one's life while pretending to be valiantly standing up to the illness is almost laughably absurd. perhaps if i pay attention to the journeys this class of January 2017 is undergoing i'll learn how to love life a little more. god bless all of you.",
      "MessageIndex": 624,
      "PostDate": "13/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    }
  ]
}