{
  "AuthorID": "eicats",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248931/profile",
  "Posts": [
    {
      "AuthorID": "eicats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248931/profile",
      "Content": "Apr 16, 2017 01:18AM eicats wrote: I just wanted to add my two cents that you should be fine to go to dinner on Friday. However, I had a liver biopsy over a week ago and I'm still having muscle pain in my side off and on. Not enough to stop me from doing anything, like dinner, however I have had to take Tylenol to sleep at night cause it hurts to breathe when I'm in certain positions. I think it has to do with the fact that they went between my ribs through the intercostal muscles which are now sore and trying to heal. Not to scare you, but I wish someone had told me this was a possibility before I went in so I could have been better mentally prepared.",
      "MessageIndex": 4711,
      "PostDate": "16/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "eicats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248931/profile",
      "Content": "eicats wrote: I am having a single mastectomy later this month and am trying to decide if I want to go flat or get reconstruction. I am stage 4 due to liver mets that are currently not active on a PET scan - hallelujah! However knowing I will forever be on some type of treatment, I'm trying to decide if reconstruction is worth working around treatment/having to take breaks from treatment and going through longer recovery or not. Can anyone share their experience making this decision? Dx 3/13/2017, IDC, Right, Stage IV, metastasized to liver, Grade 2, ER-/PR-, HER2+ (FISH) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863038",
      "Title": "Reconstruction or Not after single mastectomy when Stage 4 eicats Snowfall"
    },
    {
      "AuthorID": "eicats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/248931/profile",
      "Content": "eicats wrote: So I got amazing news this week that my PET scan was completely clear! Breast and liver no longer light up! However, a CT only 11 days earlier still showed 2 spots on the liver. My onc said they could be dead spots and we dropped the Docetaxol, keeping Herceptin and Perjeta. I'm feeling uneasy about just hoping the liver spots on the CT are dead spots. Could they be spots that are not growing and therefore don't light up on the PET, however they are still cancerous spots just waiting to grow larger once we stop the Docetaxol? Thoughts?? Dx 3/13/2017, IDC, Right, Stage IV, metastasized to liver, Grade 2, ER-/PR-, HER2+ (FISH) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/858399",
      "Title": "Clear PET but spots on liver still there on CT? eicats ShetlandPony"
    }
  ]
}