{
  "AuthorID": "Eleanorebel…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208076/profile",
  "Posts": [
    {
      "AuthorID": "Eleanorebel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208076/profile",
      "Content": "Apr 19, 2015 05:16PM - edited Apr 19, 2015 05:37PM by Eleanorebelle Firstly i just wanted to thank you all for taking the time to reply to my post, it means a lot to me! I do understand that IBC is a fast growing cancer and the fact that ive been having these symptoms for over five months is a good sign. The reason why i thought it could be IBC is because of the size difference between both of my breasts and the fact that my breast is constantly hot to the touch. It also feels heavier then the other, and of course the pain! As far as i know Burstitis cannot cause inflamed lymph nodes. It can cause swelling around the effected area (shoulder) but shouldn't make my arm swell. I will be getting a steroid Injection in my shoulder next week. I also forgot to mention that i had a stillbirth around six months ago, i let my milk come in but it only lasted around a week and then dried up. It is not mastitis, i have had multiple doctors rule that out.",
      "MessageIndex": 4,
      "PostDate": "19/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/830562",
      "Title": "22 and inflammatory breast cancer? PLEASE HELP! Eleanorebelle inks"
    },
    {
      "AuthorID": "Eleanorebel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208076/profile",
      "Content": "Feb 3, 2015 09:23AM - edited Feb 3, 2015 09:24AM by Eleanorebelle Thank you all so much ladies for taking the time to write! In the way of testing no I haven't had much done at all! None of the doctors I have seen including the breast specialist recommended it! I live in Australia so things might be different over here but the breast specialist I saw was at a private clinic, I will definitely look into seeing another one though! He seems to think it may be muscular and wants me to see a physio BUT also wants me to get an MRI if things aren't getting better in Six weeks. That seems like an awful long time! I will be asking my regular doctor tonight for a referral to get an MRI! And yes my lymph nodes were checked during my ultrasound and they were fine.",
      "MessageIndex": 4,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828085",
      "Title": "Stillbirth and possible BC? Advice please! Eleanorebelle coraleliz"
    },
    {
      "AuthorID": "Eleanorebel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208076/profile",
      "Content": "Feb 3, 2015 09:41AM Eleanorebelle wrote: also forgot to add no I haven't had a mammogram as the doctors think it will be useless due to the dense breasts I have at a young age (22)",
      "MessageIndex": 5,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828085",
      "Title": "Stillbirth and possible BC? Advice please! Eleanorebelle coraleliz"
    }
  ]
}