{
  "AuthorID": "Elena99",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196621/profile",
  "Posts": [
    {
      "AuthorID": "Elena99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196621/profile",
      "Content": "Feb 19, 2014 02:45PM Elena99 wrote: thank u for replying, I have been seeing an OBGYN , she wont refer me to a breast surgeon as there is no lump .,and told to come back in 3 months for a recheck, but am very worried and 3 months seems like forever",
      "MessageIndex": 2,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818218",
      "Title": "heavy sensation in left breast and nipple inversion Elena99 Elena99"
    },
    {
      "AuthorID": "Elena99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196621/profile",
      "Content": "Elena99 wrote: hi , i am 23 ,a year ago i started to have left breast pain and an inverted nipple;i went to see my doctor and had an ultrasound ,it came back normal and was given multivitamins tablets ,the pain stayed for a while and disappeared for 2 months but the nipple will retract at time.3 months later the pain came back ( it will come and go) ,had another ultrasound and again was normal .few weeks back my left breast started feeling more heavy ,the pain  was less often but my nipple was still retracted,confused i went back to my doctor and had another ultrasound yesterday which came back normal ....i don't know what to think as my breast feels weird and my nipple retracted. has anyone had similar symptoms???? please help Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818218",
      "Title": "heavy sensation in left breast and nipple inversion Elena99 Elena99"
    },
    {
      "AuthorID": "Elena99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/196621/profile",
      "Content": "Feb 20, 2014 03:07AM Elena99 wrote: the pain is more below and on the left of my nipple and sometimes feels like its coming from inside the breast ,not related to menstrual cycle ,i feel weak but no fever .;if i go see a surgeon will he help more or give any further breast exam??? 3 months feels long because i have had these for a year now and feel like it may be detected late .and i am really not getting sleep lately. Tangles ,you said you had same symptoms,how did u get dx ???, was our ultrasounds clear too??? thank u all for your support , my friends dont really get my worries and feel alone sometimes.",
      "MessageIndex": 8,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/818218",
      "Title": "heavy sensation in left breast and nipple inversion Elena99 Elena99"
    }
  ]
}