{
  "AuthorID": "Elfmcg",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254100/profile",
  "Posts": [
    {
      "AuthorID": "Elfmcg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254100/profile",
      "Content": "Jun 14, 2017 10:28AM Elfmcg wrote: Thanks girls, I'm really trying to not overthink. Sorry, I'm in Ireland, so the professor is the breast surgeon of the department. Thank",
      "MessageIndex": 3,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/856122",
      "Title": "Petrified Elfmcg Elfmcg"
    },
    {
      "AuthorID": "Elfmcg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254100/profile",
      "Content": "Elfmcg wrote: hi everyone, I'm 37, seven weeks post ACTH, still on herceptin until September and have just started last five days of rads which are my boosts, and i just can't believe how crappy i feel. Im in dire need of reassurance, I'm still aching like what i imagine a 90 year old feels like, my stomach is still bloating and sore, rumbling and grumbling like an animal lives there, full of smelly wind (TMI, sorry!)still have heartburn etc, i'm exhausted, having hot flashes, still bald! Is this normal? People keep telling me how lucky i am to have chemo behind me, and 'you must be feeling great now' i thought i would by now! I feel like i'm moany and moody and letting everyone down because i just feel crap! Not like a strong fighting woman, more like a frightened, tired mole! Ugh! someone please tell me this is normal, i've an appointment with my MO next Tuesday and i'm afraid when i tell him my symptoms, he'll want to handcuff me, take me straight back to hospital, run loads of tests and this whole rigmarole will start again. Dx 6/16/2017, IDC, Left, 2cm, Stage IA, Grade 3, 0/5 nodes, ER-/PR-, HER2+ (IHC) Surgery 6/25/2017 Lumpectomy: Left; Lymph node removal: Sentinel Chemotherapy 8/20/2017 AC + T (Taxol) Targeted Therapy 10/15/2017 Herceptin (trastuzumab) Radiation Therapy Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862658",
      "Title": "how long for Side Effects to go? Elfmcg MrsWinnie"
    },
    {
      "AuthorID": "Elfmcg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254100/profile",
      "Content": "Jun 23, 2017 01:28PM - edited Jun 23, 2017 01:31PM by Elfmcg hi everyone, I'm newly diagnosed with Idc, I'm in for lumpectomy and snb on Monday 26th. I already know I need chemo and radiotherapy as I'm her2+ and hormone negative. I just wanted to know was anyone else absolutely freaked out and fixating on node involvement and distant mets before their surgery? My bs says as far as he is concerned it's early stage and nodes looked good on us, but I am freaking out. All this waiting, too much time to read up on everything and I'm so worried it willget worse. Is this a normal feeling, or am i mental? I keep seeing all these women who were diagnosed as stage 4 at diagnosis and had no symptoms. Is that usual? Thanks ",
      "MessageIndex": 234,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855269",
      "Title": "June 2017 Surgery Group SBKH illimae"
    },
    {
      "AuthorID": "Elfmcg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254100/profile",
      "Content": "Feb 21, 2018 04:55AM - edited Feb 21, 2018 05:49AM by Elfmcg Thanks BLynnB and SpecialK, I've definately been throwing a 'pity party' for myself. haha I'm glad to hear some other people are feeling the same as me. Sometimes i feel unless your in Warrior Mode, people just don't want to know, and think you're whinging. But you are right, i suppose they will understand eventually, and if they don't, well that's their own problem. I will talk to the MO on Tuesday and tell him how i'm feeling. I had to go on an anti anxiety drug during this debacle as well, i just completely lost my footing. But here's hoping i will get a bit of a lift when Rads are finished next week. I'm having my next herceptin today. I hope you both continue to make a full recovery. on my way to get some pro biotics.  ",
      "MessageIndex": 4,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/862658",
      "Title": "how long for Side Effects to go? Elfmcg MrsWinnie"
    },
    {
      "AuthorID": "Elfmcg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254100/profile",
      "Content": "Elfmcg wrote: hi everyone, Im 35, no history of bc in family. I found a lump in my left outer breast about a month ago in the shower. I can't really remember how I felt it but I did. I went to my doctor who said it could be my breast tissue but he would refer me for triple breast assessment. I got a referral within two weeks, first I saw the professor, he asked me to show him the area of concern, he felt it and said he wouldn't be worried but would send me for baseline mammo. The nurse/radiologist greeted me at door and said 'well your one of the lucky ones, he's not even slightly worried about you, but at least you'll know what it's like when your 50. She took loads of slides of the left boob and asked me would I be ok if I got an ultrasound that day as she was concerned about a small area. I then went to get an ultrasound and the radiologist looked around and said 'yes, I'll have to core biopsy that area' and seemed worried. I started to sob as it had literally gone from zero to ten in a split second. She saw I was upset and said it could be a fibroadrnoma but the borders are a bit irregular for that. Then she asked another head radiologist to look and she said look there's a couple things things it could be but if it's anything sinister, it's small and no inflamed nodes on ultrasound and looks confined to that area, so they're all good signs. I just went into shock and then after biopsy was told I'd be called back into the Professor in a few minutes and given an appointment for results. I then was called back in and he said 'ok, so they found a little something in the middle of all that dense tissue, could just turn out to be a little bit of odd tissue' I then waited in waiting room for appointment and the original mammogram radiologist walked by and asked did they biopsy at ultrasound, I said yes, and she said basically the same thing the professor said. I was given an appointment for two weeks. My appointment is now on Friday and I am up the walls. I'm so worried it's cancer and so worried that if it is, it will be stage 4 and that maybe that lump was there for ages and I didn't realise. I'm completely freaked out. Could they really see these good signs they talked about if it does turn out to be bc? Thank you Dx 6/16/2017, IDC, Left, 2cm, Stage IA, Grade 3, 0/5 nodes, ER-/PR-, HER2+ (IHC) Surgery 6/25/2017 Lumpectomy: Left; Lymph node removal: Sentinel Chemotherapy 8/20/2017 AC + T (Taxol) Targeted Therapy 10/15/2017 Herceptin (trastuzumab) Radiation Therapy Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/856122",
      "Title": "Petrified Elfmcg Elfmcg"
    }
  ]
}