{
  "AuthorID": "Elin",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96369/profile",
  "Posts": [{
    "AuthorID": "Elin",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96369/profile",
    "Content": "Feb 14, 2010 11:48AM Elin wrote: Hi, Fogandroses. [This may be a bit long. And apologies if it runs twice. I have a Dell computer, afterl all...)]  Your posts have been really helpful to me. I had a partial right mastectomy for Stage 0 DCIS last June 2nd. I had clean margins and there was no need for any node examination. My surgeon was wonderful before and after---but did not tell me about possible complications. I developed a seroma and had several post-op visits to check on it. He didn't go into much detail, just said it was a \"possible fluid buildup\" and he believed it would resolve. Here's what happened instead: Eighteen days post-op, I was sitting outdoors at my granddaughter's high school graduation party, not drinking enough fluid, and with ice packs on this hard lump in the middle of my scar. That night, I had a fever and was extremely uncomfortable so I went to the emergency room. The ER doc there gently poked my breast several times over the course of four hours to see if it would do something or not (it didn't) and sent me home on antibiotics (I had hydrated while I waited to see him and my fever was gone) and with a tentative dx of cellulitis and a recommendation to see my surgeon Monday morning. The following afternoon---nineteen days post-op---I was resting at home. I'd just made a piece of toast in the kitchen when the doorbell rang. It was the Brazilian bread man, who came every week with homemade bread. I bought a loaf, saw him to his car and was back in the kitchen mere seconds later, butter knife in hand for my toast, when the seroma exploded and I was drenched from breast to foot in warm, rust-colored sticky fluid. (BTW, did you know it doesn't stain clothing?? Oh, such joy!) I was unprepared and completely unnerved. The on-call surgeon said, \"I'll bet you're a lot more comfortable now,\" and I said yes. That calmed me down. He advised me to see my own surgeon the following day, then told me to stand in a hot shower and let the wound drain, and apply bandages as needed. He said standing in a hot shower would encourage drainage, and it appears he was right. It drained like crazy. When I saw my own doctor the next day, now almost three weeks post-op, he drained still more fluid and apologetically said he'd never seen a seroma let go more than ten days after surgery. He drained it three more times over the next week or so. Then nineteen days after it let go in the kitchen, the wound closed. I began radiation about a month later. That ended September 28th. In December, six months after my surgery, I was getting ready for bed one night and noticed that my scar felt \"different.\" I looked down and lo and behold, a thick white-ish fluid was draining from a new hole near the old seroma. Since I'm dying childless, I was quite surprised to see what I concluded was clotted breast milk coming from the side of my breast! I saw my surgeon the next morning. There was nothing to drain and he didn't think it would happen again---but if it does, I'm to contact him immediately. I've gotten to know that lovely man better than I ever thought I would!... All of that brings me to this: in the last three weeks or so, I've noticed a new discomfort. My breast suddenly feels different to the touch. It lumpy around the seroma (of course it always was lumpy around the seroma!), but now there seems to be a long \"ridge\" effect a little below the scar, running toward mid-chest. I thought it might be a previously-unnoticable edge from where tissue was removed, but I don't know. And, the area in the upper chest wall and going toward the armpit is tight and sore. Reaching for anything is uncomfortable---so instinctively, I've begun reaching as much as possible to stretch it. That seems to help. I was considering calling my PCP and the surgeon again to see if the pain and bumpiness are normal (since we're all so different, is there a normal now?)---but I thought instead to check this site and see if anyone else had encountered this business. And I found all of you! Later on today I'll read more of these posts. I seem to remember from the dim recesses of my mind hearing decades ago about women who routinely had physical therapy following mastectomies. Why isn't that routinely mentioned in pre-op visits. I agree that we'd all be a whole lot better off if we were told about possible complications (PMPS, cording, seromas, etc.) before surgery. If we're strong enough to bear children, we're strong enough to cope with possibilities. I've already suggested that to my surgeon. This site is wonderfully helpful, and I'm very grateful I found it. Thank you all, E",
    "MessageIndex": 179,
    "PostDate": "14/02/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
    "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
  }]
}