{
  "AuthorID": "Elisha82",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153663/profile",
  "Posts": [
    {
      "AuthorID": "Elisha82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153663/profile",
      "Content": "Jan 19, 2013 08:59AM - edited Jan 19, 2013 09:00AM by Elisha82 My name is Elisha. I'm 30. Married with 2 yr old son. Dx in 2011 w stage 3c IDC. Had bilat mast, chemo and radiation. Couple good scans over summer. Dx about a month ago with multiple brain lesions. Ended up in hospital for 16 days, diagnosed there with leptomeningeal carcinomas. Very poor prognosis clinically, but praying ill be the one the tx works for!",
      "MessageIndex": 63,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798841",
      "Title": "Roll Call 2013 LilSchatzie reader123"
    },
    {
      "AuthorID": "Elisha82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153663/profile",
      "Content": "Jan 19, 2013 12:54PM Elisha82 wrote: at least they caught it early. hmmm. I was just dx with stage IV leptomeningeal carcinoma. No, it was caught super late. Said to me as I was laid up inhospital for 2 weeks w complications.",
      "MessageIndex": 565,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Elisha82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153663/profile",
      "Content": "Elisha82 wrote: I was dx in Dec with brain Mets, multiple lesions, all over my head it seems. Largest spot is 2x3cm I think. I had couple wbr tx, then one night my husband found me puking and seizing in the bathroom floor. Spent 16 days in the hospital, just came home jan 12. During my hospital stay, I managed to have 2 infiltrated iv's of Dilantin in my left hand- leading to 2 blood clots in my hand, had to be on a heparin drip for days, had 2 TIAs, mini strokes, due to tumors in my brain occluding blood flow. They also diagnosed me there in hospital with leptomeningeal carcinoma (diagnosed by lumbar puncture)- cancer in my csf- cerebral spinal fluid and meninges of my brain, i had a brain operation there in hospital to put a port in my head, ommaya reservoir. So they can remove CSF for analysis and also give me chemo- methotrexate. They also put in another portacath. I also experienced these episodes of extreme pain in my head, lasting about 15 minutes, where I couldn't speak, move or hear. I received so much IV dilaudid to keep my pain under control, some nurses refused to give me more, afraid I would go into respiratory distress. My family started to think about planning my funeral I was so bad off. By the grace of god, slowly they were able to control my pain, stopped the ivs 1 by 1. I learned to use a walker. Came HM a wk ago. The plan is for 2 more weeks of methotrexate, twice a week. Then possibly do more wbr to tx the brain tumors. While its great to be HM, its a whole new set of challenges. I have a great husband, and 2 yr old. I'm mobile, but limited. I use the walker. I'm not strong enough to pick up my son. I haven't pooped since being HM BC i take pain meds every 4 hours. I can't cook or clean and all i feel like doing is sleeping. I have faith and trust in god and his plan, mostly i am calm. But I'm also an RN. I'm clinical, i like to know statistics. Google leptomeningeal carcinomas. Not pretty. Few months even with treatment. I feel tired and I've barely begun to fight. My breast cancer was triple negative, so limits tx options even more. Somebody help me out. My sweet sweet family means well, but they hover, like mother hens, smothering me. I dont want to die, i have faith, but i don't know how or what to think right now. www.elisha-everthesame.blogspo... Dx 11/9/2011, IDC, 6cm+, Stage IIIC, 12/14 nodes, ER-/PR-, HER2- Surgery 11/21/2011 Mastectomy: Left, Right Chemotherapy 12/21/2011 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 5/7/2012 Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799104",
      "Title": "Need support! recent dx brain mets & meningeal carcinoma Elisha82 sandilee"
    },
    {
      "AuthorID": "Elisha82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153663/profile",
      "Content": "Feb 6, 2013 12:21AM Elisha82 wrote: hi, also should say original dx was Nov of 2011, age 29. My son was 11 months old.   ",
      "MessageIndex": 38,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Elisha82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153663/profile",
      "Content": "Jan 24, 2013 02:20AM Elisha82 wrote: These boards are really busy! Just bumping to see if anyone has any thoughts for me. should I get 2nd opinion? Is it worth it?",
      "MessageIndex": 10,
      "PostDate": "24/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799104",
      "Title": "Need support! recent dx brain mets & meningeal carcinoma Elisha82 sandilee"
    },
    {
      "AuthorID": "Elisha82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153663/profile",
      "Content": "Feb 4, 2013 09:58AM Elisha82 wrote: I only have a minute to post....have to get ready for chemo #9-IT methotrexate and s steroid not approved by FDA. Hope all goes well! I'll come back n post more later www.elisha-everthesame.blogspot.com",
      "MessageIndex": 19,
      "PostDate": "04/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Elisha82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153663/profile",
      "Content": "Feb 6, 2013 12:04AM - edited Feb 6, 2013 12:14AM by Elisha82 posted yesterday about getting ready for chemo #9. I didn't actually get the chemo, just got the not FDA approved steroid that is supposedly not safe for IT use, solu-cortef. As the med was going in my ommaya reservoir, I could feel myself getting hot, flushed, nauseous. I vomited and dry heaved for almost an hour. I dont know what all meds they gave me for all that to go away. (reason for steroid needing to be given w chemo. Last few methotrexate doses have given me a case of chemical meningitis, so Dr figured steroid would help w inflammation) Dr made me stay at hospital again last night just to keep an eye in me. Today, got premeds, phenerghan and toradol. Doc pushed med and the solu-cortef in reservoir over 10 minutes, very slow. No reaction til she finished, but then exact same reaction! I thought I was going to die. My heart was pounding, sweat dripping off my bald head, shaking, dry heaving for 30 min. It was awful. Gave me ativan and another dose if phenerghan. Slept for while. Tomorrow getting lumbar puncture to see if fluid pressure in spinal cord causing compression and the intense pain in my pelvic hip areas, both sides and lower back and neck. Anyone here familiar with leptomeningeal carcinomas (also called carcinomas meningitis) Breast cancer cells floating around in spinal fluid and thin layer of meninges under skull. Right now I'm having chemo inserted directly into am ommaya reservoir, inserted into top of my head, takes chemo directly into CSF. I've had reactions last week to the Methotrexate alone, so now trying to put steroid w it to keep inflammation down. I feel really alone. I've not found anyone remotely similiar in dx. The LM cancer has 4-6 month survival w treatment. Of course were praying so hard for a miracle!! Anyone familiar with anything in my story. (if you want more info about my story, my sister is writing a caring bridge. Message for my last name. Also have blog, address below) I haven't posted here a lot before...hope someone can identify with me. this is my 3rd hospitalization since Dec 28. First time 16 days, then 4 days,now working on night #2. dx Nov 2011 IDC stage 3- all clear after surf,chemo,rads. dx in Dec 2012 w7 plus brain Mets, also  leptomeningeal carcinomas both stage 4 and LM especially poor prognosis- praying against and trusting the Lord.",
      "MessageIndex": 37,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    }
  ]
}