{
  "AuthorID": "Elisabeth_W…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278361/profile",
  "Posts": [
    {
      "AuthorID": "Elisabeth_W…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278361/profile",
      "Content": "Dec 11, 2018 06:58AM Elisabeth_W wrote: Thanks for the support, sisters! I really improved from the antibiotics over the weekend-ultrasound yesterday showed a small 10 cc pocket, not worth the risk of draining. The very nice doctor and I decided I had more of an infection from the drain, not a big seroma. Now to get my poor nipple healed! Heather-I had the incision from sentinel node testing from my first surgery in July. I found it the most painful part of the recovery from a lumpectomy and breast lift. Overreaching was a real problem-I hear you. I hope it's just strain from overexertion. I noticed that any pulling feeling really improved at about the 3-4 week mark. I presumed it was when the internal dissolvable stitches dissolved. Hope the doctor has a good answer for you.",
      "MessageIndex": 321,
      "PostDate": "11/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "Elisabeth_W…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278361/profile",
      "Content": "Dec 8, 2018 07:03PM Elisabeth_W wrote: Hi everyone! I had a UMX/nipple sparing and immediate pre-pec implant recon on 11/13. Had a drain for 2 weeks and it was at 15 ccs a day when it came out. Since it's been out, though, it's been painful. Not pain med painful, just very tender and annoying. About 10 days after removal had to face the fact that it's still very swollen and sloooowwwlly getting worse. Going in for an ultrasound and possible aspiration Monday and am back on antibiotics (for my nipple, which has a patch that is struggling, but should make it). The antibiotics seemed to help the tenderness and swelling a bit, so bonus. Anyone else have trouble with seroma or hematoma, or am I the lucky odds winner?",
      "MessageIndex": 316,
      "PostDate": "08/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867842",
      "Title": "November 2018 Surgery Support Group evily RosieRed"
    },
    {
      "AuthorID": "Elisabeth_W…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278361/profile",
      "Content": "Sep 26, 2018 08:28PM Elisabeth_W wrote: I decided on a unilateral. My ILC was caught very early and the plan was BCT/rads. On 7/27 I had a lumpectomy on left with a breast lift/reduction on both. However, after surgery I have LCIS and ALH remaining in the cancer breast, and the tissue examined from the reduction also had LCIS. The tissue removed for the reduction on my right breast didn't have anything (and more tissue was removed from the right side than the left lumpectomy/reduction combined). It's standard care for ILC to leave the remaining atypia as it is a both a non obligate precursor and risk marker. It may turn into cancer, it may not. No way to tell. My breast surgeon also advised that if I was thinking about mastectomy (we only discussed double at that point) that I do it prior to radiation as implant reconstruction would be the best option and radiation would make implants more of a risk. She was concerned I might not have enough excess tissue to support flap reconstruction of both breasts. If I did the radiation, then had another cancer in 10 years in the radiated breast, required mastectomy anyway, and couldn't reconstruct, I knew I'd be PISSED. On the other hand, giving up both sexually functioning breasts felt like way too high of a price to pay. I could barely think about doing so. My BS said it was medical overkill for my diagnosis, but that she would support my decision. The only bright spot occurred when my plastic surgeon said the lift/reduction had created the perfect skin pockets for implants and I could have nipple sparing mastectomy with prepectoral implants and not undo all the good work he'd just completed and I'd suffered for. I'm 49 and my gut said BCT/rads wasn't enough (and might close the door on reconstruction in my case), but double mastectomy was too much. It actually took a couple of days until I realized I could have a unilateral mastectomy/reconstruction on the left and remove the remaining atypia that may or may not turn into cancer, which would eliminate the need for radiation (again, for me and my removed tumor). If I did have an issue with the contralateral breast, I could cross that bridge when I came to it. Which was the plan for BCT/rads anyway-it's a unilateral approach. In either case, I'd be taking the tamoxifen which would help. Some other people have mentioned it, but once I realized I could pursue a unilateral mastectomy, it felt totally right. It was 11:00 at night when I realized I could just do one and I was so excited I couldn't sleep for 2 hours. I have friends who went straight to double and I respect their choice. I saw two oncologists, a radiation oncologist, and all felt BCT/rads was the right path for me. Until I detailed my additional risk factors (mother with BC twice, dense breasts, mammographically occult disease, and age) and the risk of no reconstruction. Then my situation became very gray and really a personal choice, from their perspective. It's all a lot to consider and overwhelming. I was very clear that having at least one breast with nipple sensation was important to me as well as being able to reconstruct. Not everyone is concerned about that. Talk to people, know your diagnosis well, and explore what's important to you. You may wish to review the Mancester guidelines for contralateral mastectomy decision. They were created and published from UK data a few years ago. Within that paper there is a simple formula for calculating the risk of another cancer in the contralateral breast for your lifetime. It's a decision support tool based on current literature, nothing more, to give you an idea of your range of risk of another cancer in the contralateral breast. I've added the link below. Wishing you peace and grace. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4527227/",
      "MessageIndex": 19,
      "PostDate": "26/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867148",
      "Title": "Single or Double Mastectomy Advice?? Megsed kista"
    }
  ]
}