{
  "AuthorID": "Elizabeth1959",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105408/profile",
  "Posts": [
    {
      "AuthorID": "Elizabeth1959",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105408/profile",
      "Content": "Elizabeth1959 wrote: I usher at my church.  Today, one of the ushers said \"By the way, I've been meaning to let you know that my daughter's breast cancer is now in her liver.  She was five years out and had recently stopped her Tamoxifen.  She had to have her gallbladder removed and it was only at that time that the recurrence was discovered.\"  I don't know his daughter, but the usher is a nice man.  I don't think he understands I felt overwhelming panic and fear while trying to hand out church bulletins.  Coincidently, on Friday night, my husband and I had dinner with the husband of my friend who recently died from breast cancer.  I feel like I'm living in a surreal world.  The world where I make plans for the future and the world where I'm thinking about cancer/threat of recurrence.  I want to think I'm going to die of old age, but who knows.  This stinks big time. If anyone can explain how to cope with this very real fear, I am all ears. Elizabeth 7/10 right mastectomy, dose dense AC, 12 weeks taxol,rads,arimidex Dx 6/28/2010, IDC, 6cm+, Stage IIIA, Grade 2, 1/17 nodes, ER+/PR+, HER2- Surgery 3/20/2013 Reconstruction (right): DIEP flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787803",
      "Title": "Fear of Metasteses - How to cope Elizabeth1959 sugarplum"
    },
    {
      "AuthorID": "Elizabeth1959",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105408/profile",
      "Content": "Elizabeth1959 wrote: Yesterday I had a consultation for diep reconstruction.  The surgeon recommended mastectomy and reconstruction for non BC breast.  She says that most of abdominal fat will end up in trash.  If the breast cancer recurs, reconstruction options would be less ideal.  Also, recovery would be essentially the same  i.e. time off work.  My breast cancer didn't image well and was missed for many years on mammogram.  Now I am post-menopausal and on AI's so I assume my remaining breast is less dense and would image better.  I am BRCA negative.  IDC and estrogen positive.  I assume my risk of second breast CA is much lower because I am on an AI.  Anyone else in my shoes?  How did you make a decision.  Also, if I have bilateral diep would I have any yearly imaging i.e. breast MRI?   I understand breast cancer doesn't recur in abdominal fat but what about any small island of residual breast tissue? My understanding is there is no survival benefit for me to have bilateral mastectomy.  I understand my risk of breast cancer in remaining breast is higher than in most women but how high?  My oncotype dx score was low.  If I didn't have bilateral diep and I had a new breast cancer I would be very upset, but I still wonder if this is fear talking or is this a good decision. I am really curious what you (my fellow breast cancer sisters) have to say. Elizabeth 7/10 right mastectomy, dose dense AC, 12 weeks taxol,rads,arimidex Dx 6/28/2010, IDC, 6cm+, Stage IIIA, Grade 2, 1/17 nodes, ER+/PR+, HER2- Surgery 3/20/2013 Reconstruction (right): DIEP flap Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/794460",
      "Title": "One breast or two? Elizabeth1959 Elizabeth1959"
    }
  ]
}