{
  "AuthorID": "eliza0104",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99198/profile",
  "Posts": [
    {
      "AuthorID": "eliza0104",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99198/profile",
      "Content": "eliza0104 wrote: Hi everyone!  I have just noticed within the last 2 weeks, that I have a dip my left breast just right of my nipple.  I don't know if it would be classified as an indentation or not.  I haven't felt any lumps, but honestly I don't know what to feel for.   I notice it most when I raise my arms above my head and I can see it when I don't, however it's not as noticible w/ my arms down.   It reminds me of a dip in the road, you can definately feel it but it's harder to see (than feel).  It's almost like I have no breast tissue when I push on the dip/indentation.   Also, when I raise my arms the breast appears to almost be bottoming out.  It looks slightly different than the right breast.  Also in this dip/indentation I can see some shadowing (the skin appears ever so slightly bruised)  I haven't gotten hit or no trauma to that region.  I've also and I don't know if this has ANYTHING to do w/ this breast indentation or not, but I've recently been having bouts of what I can only say is internal itching in my left breast/chest region.  It's almost like I need to reach inside my chest and scratch my skin from underneath.  It sounds nuts, I know!  My paternal grandmother had BC (probably between 42-52)  I am 35 and a mother of 4.  Thanks for any insight, I plan on calling my doctor tomorrow but cannot figure out what this could be!!  Any ideas? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750099",
      "Title": "no lump, but dent (indentation) on one breast eliza0104 Jujube43"
    },
    {
      "AuthorID": "eliza0104",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99198/profile",
      "Content": "Mar 22, 2010 06:12AM eliza0104 wrote: Thanks for all your replies! I have an appt tomorrow afternoon at 2:15. I'll update after that!",
      "MessageIndex": 5,
      "PostDate": "22/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750099",
      "Title": "no lump, but dent (indentation) on one breast eliza0104 Jujube43"
    }
  ]
}