{
  "AuthorID": "EllaBooBell…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221282/profile",
  "Posts": [
    {
      "AuthorID": "EllaBooBell…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221282/profile",
      "Content": "Sep 15, 2015 01:55PM EllaBooBella wrote: Thank you, muska. I'm not too worried about the lung nodule because I'm low risk, having never smoked. But my pulmonologist said it looked very strange and he may end up ordering more imaging w/contrast. I still feel pretty confident that the nodule is nothing. I do have coughing, chest pressure, etc... but I also have issues with my heart as well. Symptoms can overlap, and I've got enough going on that I wouldn't even try to guess what's causing what. But I do believe symptoms are due to the anemia... which we've no idea why I have. I haven't had a period in almost 9 months now, so it's not due to heavy bleeding. I guess it's the idea that he didn't remark on anything at all re the breast nodule, didn't offer anything such as what the radiologist said. Just that I need a mammogram. For the record... I really hate Dr. Google. ;) Do you think that the location of the nodule, being 'behind' a breast implant means it's closer to the chest wall and in a location where nodules tend to be more benign? Yeah... I'm grasping here.",
      "MessageIndex": 2,
      "PostDate": "15/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834999",
      "Title": "1.9 x .5 nodule found in breast on CT EllaBooBella EllaBooBella"
    },
    {
      "AuthorID": "EllaBooBell…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221282/profile",
      "Content": "Sep 15, 2015 03:49PM EllaBooBella wrote: yes, it's def iron deficiency. My ferritin was found to be 7.4 a few months ago. They just don't know why my iron is depleted. Yes, I had breast augmentation many years ago, so that's why I have the implants. I've read that most times people find lumps which sends them in for testing, which can sometimes lead them to have other imaging. I guess in my case things seem backwards since I had the CT first. If the CT found the nodule, I'm guessing the mammogram is to look for more? If there's more, wouldn't that have shown on the CT? I'm a little confused about the order of things.",
      "MessageIndex": 4,
      "PostDate": "15/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834999",
      "Title": "1.9 x .5 nodule found in breast on CT EllaBooBella EllaBooBella"
    },
    {
      "AuthorID": "EllaBooBell…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221282/profile",
      "Content": "Sep 19, 2015 02:27PM EllaBooBella wrote: mammogram went okay. They simply couldn't find what the CT found. Very weird. I know the tech was struggling with positioning me, etc. Was one of the roughest techs I've ever had. 😕. They didn't have my last films to compare to, and I didn't know this during my appt. received a letter today stating they would send an updated comparison report to my dr once they receive the films etc. I don't know what to make of them not finding the nodule. The radiologist was pretty precise about where it's located, and the CT report states there were over 300 images. So I'm guessing it wasn't a mistake on the radiologist's part. I just don't know where I stand at the moment. Thank you for asking about me. I will update once they do a comparison of films and my dr gets the report.",
      "MessageIndex": 6,
      "PostDate": "19/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834999",
      "Title": "1.9 x .5 nodule found in breast on CT EllaBooBella EllaBooBella"
    }
  ]
}