{
  "AuthorID": "ellen1dg",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108886/profile",
  "Posts": [
    {
      "AuthorID": "ellen1dg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108886/profile",
      "Content": "Sep 11, 2010 07:16PM ellen1dg wrote:",
      "MessageIndex": 3,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757741",
      "Title": "Getting lost in abbreviations JanetinVirginia nancyh"
    },
    {
      "AuthorID": "ellen1dg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108886/profile",
      "Content": "Sep 12, 2010 07:23PM ellen1dg wrote:",
      "MessageIndex": 6,
      "PostDate": "12/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757741",
      "Title": "Getting lost in abbreviations JanetinVirginia nancyh"
    },
    {
      "AuthorID": "ellen1dg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108886/profile",
      "Content": "ellen1dg wrote: Hello.  Very grateful to have found this discussion boards site.  I did post yesterday on the \"woman 40-60\" support  forum, but thought I would post over here too.  My story so far.....   I had my every 6 month mammogram the week before my 51st birthday, a few weeks ago.  They have been keeping a close eye on me for a number of years now.. having me go every six months.  Never has fazed me.. take in in stride.  I have dense breast, hard to read.. and apparently they had been watching areas of calcification that this time had increased in size on the right breast. I was called before I even got home from the mammogram... luckily my 18 year old son actually gave me the message (does not always happen, lol).  I called back, they got the radiologist  doctor on the phone who explained what she was seeing, how they wanted me to have a stereotactic biopsy on my right breast and we set up an appointment for two days later with an oncologist surgeon.  Met him, he did a physical breast exam, and set up the biopsy for the following week (was taking mentioned 18 year old to college so had to put off for a few days).  Had the stereotactic biopsy on August 27.  Took myself in.. did not tell anyway (did tell my husband that night,, hard to hide the steri strips!)  The following Tuesday I heard from the surgeon's office and was told atypical cells were found, Lobular Carcinoma in situ.  Had an appointment with the surgeon the following day.  He wanted me to have an MRI, and also said regardless of what that showed, he wanted to have  a surgical breast biopsy too.  If everything came back negative, we would then discuss my being closely monitored and perhaps going on Tomixifen.  Had the MRI a week ago, Oct. 2.  Results of that received this Tuesday  showed a \"suspicious\" area on the left side.  So, yesterday went in for a breast MRI, vacuum biopsy.  Fun stuff!     I will get the results of that next week, perhaps before my appointment with my surgeon which is on Wednesday.  We will set up the surgical biopsy in the right side, and if atypical cells are found thru yesterday's MRI biopsy, I would have the left breast surgically biopsied at the same time too! So.........  that's my 3 1/2  week, quick introduction into the world of breast cancer.  Never had heard of so many of the terms used before!  I may be lucky, have everything come back negative, and will then just have to proceed as a future high risk patient.  I have been enjoying reading from the various boards here.. and appreciate all the love and support you give each other.  There is nothing like \"sisterhood\". Ellen   Ellen1dg Dx 9/1/2010, LCIS, Stage 0 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757889",
      "Title": "Not sure if I am in the \"club\" yet but.... ellen1dg Beesie"
    },
    {
      "AuthorID": "ellen1dg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108886/profile",
      "Content": "Oct 26, 2010 09:38PM - edited Oct 26, 2010 09:39PM by ellen1dg",
      "MessageIndex": 1,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759902",
      "Title": "Abnormal Mammogram soonermagpie soonermagpie"
    },
    {
      "AuthorID": "ellen1dg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108886/profile",
      "Content": "Oct 26, 2010 09:47PM ellen1dg wrote: A zero is \"incomplete\".  Your mammogram or ultra sound did not give the radiologist enough information to make a clear diagnosis; follow up imaging is necessary. Good luck! ",
      "MessageIndex": 2,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759902",
      "Title": "Abnormal Mammogram soonermagpie soonermagpie"
    },
    {
      "AuthorID": "ellen1dg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108886/profile",
      "Content": "Oct 23, 2010 05:42AM ellen1dg wrote: Hi Deanna,   You should be just fine.  Take it easy the day of the biopsy, and no heavy lifting for a few days afterwards, but after the first day you won't be in any pain  (and truly, the day of the biopsy  you may be sore, but no real pain!)  Good luck to you and have fun at that Renaissance festival.",
      "MessageIndex": 3,
      "PostDate": "23/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/759766",
      "Title": "needle core biopsy Deanna67 Deanna67"
    },
    {
      "AuthorID": "ellen1dg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108886/profile",
      "Content": "Nov 4, 2010 08:16PM ellen1dg wrote: I had a bilateral surgical biopsy (all the forms I signed called it a bilateral lumpectomy) andI  had the wire insertion done on both breast.  It was not really that bad at all.  No doubt everyone is different, but for me, I did fine.  You sit in a chair during the whoie thing, and they push you in and out of  the mammogram paddles/machine.  Had I been standing for it I might have had a more difficut time. I am glad that they found your cancer this early and that it is (only) stage 0.  Best wishes to you!",
      "MessageIndex": 117,
      "PostDate": "04/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/758019",
      "Title": "next course of action Deanna67 Deanna67"
    }
  ]
}