{
  "AuthorID": "Ellemche1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86242/profile",
  "Posts": [{
    "AuthorID": "Ellemche1",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86242/profile",
    "Content": "Jul 10, 2009 02:23PM Ellemche1 wrote: I am awaiting my surgery date for the procedure and I don't want the further biopsies to show anything negative either.  I don't want to be scared up either, I have a scare from the first round of biopsy.  The doctor reassured me he will go in round the ariola on both breasts. I am worried about losing sensitivity as well as the vanity issue not to mention the possibility that I could possibly be diagnosed with cancer or more precancerous cells.  I do not want to take the medication, Tamoxifin (not sure if I am spelling it correctly) because it will speed up the menapause process.   I was shocked when I was advised that I ADH, I expected poor news about my ultrasound because of my extreme bleeding problems but never did I think I would run into this.  I have no idea how I am going to deal with this.  I just got married (his mother passed away from cervical cancer this year) and after being single for soo many years was really excited to have a intimate partner and now it seems my body is falling apart.  I cried when I drove home after my GYN visit for to recview my Ultra sound & Mamagram. I cried for the possible death of my child bearing ability and was in shock over the finding of 't ADH (I also found out my father's mother passed away from breast cancer (it spread)).  I know what you mean about not wanting to concern your family, I also have one grown daughter and am helping my aging parents move.  So, I asked my GP for antidepresant, which I have never condoned, but I don't want to cry when ever it hits.  Over the years when I get really maxed I will go into the bathroom and allow myself to cry for a few minutes allowing my feelings to be released without scaring my daughter or making my husband feel overly concerned.  Lately, I am off for the summer, I have stayed up late, to my new husbands concern, to allow my thoughts to be purely about myself and my problem solving (un baised my any others mind) to occure.  I would like to think that I won't feel anxiety during the upcoming appointment and the waiting time.  I think I will do some more research intermediately in between my other responsibilities.   So far I did find out there are four different medications which are given for ADH. I was told that the medication will disallow estrogen into the the breasts (thereby keeping any ADH areas which convert into cancer localized in the breast and not spreading) and that the Uterus often receives the blocked estrogen and therefore can cause more the usual bleeding and the beginning of menopause, specifically hot flashes.  This is all I know now. My research is being split now between this and Fibroid removal options.  So I would welcome and appreciate any information you find will researching this diagnose and treatment options!   I will be happy to share any links I locate. Meanwhile, keep taking good care of yourself and family, educated yourself, enjoy life, and communicate.",
    "MessageIndex": 14,
    "PostDate": "10/07/2009",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/736302",
    "Title": "LCIS/ADH help covertanjou covertanjou"
  }]
}