{
  "AuthorID": "ElleOnWheel…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
  "Posts": [
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Mar 24, 2018 09:45PM ElleOnWheels wrote: Hi Mimi! I am so, so sorry you have had such a difficult time with medical and personal issues. What you have been through on both fronts is astounding...you are a helluva strong woman!! I'm new around here and know what you mean about feeling like a fifth wheel. There are some very strong bonds on this site...but I think most here are extremely welcoming, it just takes time to develop relationships. As far as radiation goes, I'm on my third go round right now. Had the original breast, then last May to my neck and skull, and now 8 in on 10 to my right hip. The treatment itself is easy peasy. And although I never had rads to brain mets, I did wear the ever stylish mask for the neck/skull rads and it wasn't bad. Depending on where it's being targeted you can get some side effects...I had a pretty tough time with throat and swallowing pain after neck, but it does ease up in a few weeks. You can do it!! After all you've been through this shouldn't be a problem. As far as the personal side...I am continously amazed at the behavior of so many humans. What can such so called \"friends\" be thinking? Obviously they didn't deserve you...same for the ex. I am happy to hear you have such a loving son for support and your granddaughters sound wonderful. Hug them tight and forget the other ones. Let me know how you're doing. I care and will be happy to be your friend. E ",
      "MessageIndex": 3,
      "PostDate": "24/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863488",
      "Title": "Not doing well, Need Mets Advice & Friendship please! Mimi2kleh MJHJAN1014"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Mar 22, 2018 09:45AM - edited Mar 22, 2018 09:46AM by ElleOnWheels Hi all, Diagnosed May 2001 - Stage 1, IDC, no node involvement Diagnosed May 2017 - Stage 4, bones, lung ",
      "MessageIndex": 507,
      "PostDate": "22/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 1, 2018 10:11PM ElleOnWheels wrote: Good luck, Jennifer!",
      "MessageIndex": 11,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864316",
      "Title": "OT: Cataract Surgery blainejennifer ElleOnWheels"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Mar 24, 2018 09:35AM ElleOnWheels wrote: Thank you, MJH and blainejennifer for your feedback and welcome. And MJH, thanks for the reminder that I AM strong. Sure doesn't feel like it some days...but I rally pretty quick and keep moving forward.",
      "MessageIndex": 3,
      "PostDate": "24/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863428",
      "Title": "Coming out of the shadows.... ElleOnWheels ElleOnWheels"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 1, 2018 05:33AM ElleOnWheels wrote: I'm having this surgery at the end of the month. I did have Lasik many, many years ago and I was TERRIFIED. So terrified I almost backed out. It was so quick and easy it was ridiculous. Good luck!! I can't wait to get it done, my vision is awful. I'm most afraid of looking in the mirror afterwards....  ",
      "MessageIndex": 4,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864316",
      "Title": "OT: Cataract Surgery blainejennifer ElleOnWheels"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 2, 2018 07:00AM ElleOnWheels wrote: Excellent news!! Glad it went so smoothly and was easy peasy. One down, one to go....",
      "MessageIndex": 13,
      "PostDate": "02/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864316",
      "Title": "OT: Cataract Surgery blainejennifer ElleOnWheels"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 8, 2018 02:02PM ElleOnWheels wrote: Waving hi to all! Stupid busy with work and cataract surgery/eye appointments. I work for a large Musical Theater company and we open our summer season next Tuesday. Nine weeks straight from there, so summers are crazy for me. So sorry I can't reply to each of you...but I'm reading, loving the pictures and cheering for all. Micmel...stay strong. I think you're doing an amazing job of keeping it together through all this. Much love, E ",
      "MessageIndex": 4598,
      "PostDate": "08/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 11, 2018 12:16AM ElleOnWheels wrote: Thinking of you, Keetmom. Hoping it was an isolated incident. Sending much love, Elle",
      "MessageIndex": 4627,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 22, 2018 12:12AM ElleOnWheels wrote: Helloooooooooo!!! I'm still here, just super busy work time on top of all the medical silliness. I have pages and pages to catch up on. I think of you friends all the time... hopefully I'll be able to catch up soon! xo",
      "MessageIndex": 4792,
      "PostDate": "22/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Aug 28, 2018 12:33PM ElleOnWheels wrote: Micmel....hi sweet lady! My port has been a dream, no problems at all, but years ago during my first diagnosis (17 years!) I had a dear, dear friend I met online that had to do all kinds of moves to get the port to behave. She would have me in stitches describing the port shimmy as she called it. Gracie...what great news on the tumor markers!! So happy for you. Mine are a mess...they slowly come down, then they shoot up for a few months, then they drop back down....and right now they are in the jumping up mode again. I see a scan in my future, but it's time. It will be about 5 months since I had one. Magda...I love that gate!! It looks beautiful. I have had many a baby gate with my furry children through the years but nothing permanent like that...I love it! Hope you are feeling well today. Grannax...there is NOTHING funny about scanxiety, but I did chuckle when I read your change in attitude. I can go from having myself dead and buried in a month to thinking I'll live for 20 years because I feel so good...crazy the ups and downs. Hoping for great results! Slooooowly catching up with everyone. You're an amazing bunch!!! As I mentioned I had a very busy summer. My job is extremely concentrated in the summer as we do 10 straight, 8 show weeks of musicals along with our cabaret venue. I'm the ticket manager and have been here just about 26 years. Last year I was diagnosed in May and for the first time ever didn't attend any of the shows or events that go along with them. I was just too sick and very weak from chemo. I kept up the day to day mostly from home and have the greatest boss/company in the world that never even batted an eye about it. What a difference a year, and change in treatment, has made. I made it to all 6 openings and opening night parties, a cabaret show, a few scattered events, a retirement party and worked my regular office schedule. And then there's my regular life stuff too! I am beyond grateful. Never thought I'd be so happy to do my job...but boy am I!! xo ~ E ",
      "MessageIndex": 5720,
      "PostDate": "28/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 17, 2018 02:48PM ElleOnWheels wrote: Oh my gosh, Bigbhome....those are gorgeous!! I have hydrangea bushes everywhere, they're my favorite but far from blooming here in Pittsburgh.",
      "MessageIndex": 4236,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 19, 2018 06:29PM ElleOnWheels wrote: Micmel... I'll come do your gardens if you come do my house!! lol",
      "MessageIndex": 4285,
      "PostDate": "19/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 20, 2018 05:16PM ElleOnWheels wrote: ",
      "MessageIndex": 4290,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 23, 2018 11:39AM ElleOnWheels wrote: Oh Holmes, I am so sorry. Such devastating news. I can't imagine what you and your family are going through right now. I send you and yours so much love and many gentle hugs. Ellen ",
      "MessageIndex": 4355,
      "PostDate": "23/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 30, 2018 05:50PM ElleOnWheels wrote: That's great news, Lynnwood!! My tumor markers climbed for a few months but my scans were good. Last month they dropped 300 points! Could have been from inflammation, radiation to my hip, who knows... I decided to just go along for the ride...",
      "MessageIndex": 4472,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 4, 2018 08:48AM ElleOnWheels wrote: Hi all. Micmel, I am so torn. I see both sides of this. I would be EXACTLY where you are. I would want to hurt her as badly as she has hurt you. Cut her out, be gone, buh bye, don't let the door hit you in the ass.... But then again, not being in the heat of it, I also agree with Runor. Do you really want your legacy to be one of bitterness and spite? One thing is for sure... TAKE SOME TIME. Let things settle. Don't make any big decisions while all these raw emotions are swirling around. I've been thinking of you. My heart hurts for you... I can only imagine. Please take care of yourself. Hopefully they'll be out of your house soon and you'll have the time and space to begin healing. Sending you so much love, E ",
      "MessageIndex": 4532,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Apr 2, 2018 02:17PM ElleOnWheels wrote: Thank you both so much for your replies. Pajim, I'm grateful to know I'm not the only one with the crazy side effects...and for the hugs! The more I look into it the more I realize it's really not that uncommon of a side effect from radiation. And they aren't totally ruling out more cancer. But hey, I already have that all through my bod...so what's another spot. blainejennifer, thanks for the info. Always nice to hear of someone else that had a procedure done. Doesn't seem too bad in the grand scheme of things. I have an appointment next Wed with my thoracic surgeon that did my bronchoscopy so we shall go from there!  ",
      "MessageIndex": 3,
      "PostDate": "02/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863669",
      "Title": "Esophageal dilation, anyone? ElleOnWheels Beatmon"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 20, 2018 05:19PM ElleOnWheels wrote: So happy... we got so much done this weekend (first pic). Probably 1/3 of the way done with the gardens, but the more I do the better I feel. Second pic is just a picture of my weigela bush I love... still a jungle around it. Hope everyone is having a wonderful day! ",
      "MessageIndex": 4291,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 20, 2018 09:40PM ElleOnWheels wrote: Oh my gosh... Holmes! Overwhelming doesn't begin to describe it, I'm sure. I hope your daughter and grandson are doing well. It's all so scary. And having little ones with everything else going on. Yes, overwhelming. Lynne has some great suggestions...know that we're all thinking of you and keep us posted. Micmel, I am so impressed you cleaned out your basement... and by yourself! I'm telling you... we could work out a good deal... lol. I think you're on the other side of PA from me... not sure why I think that unless I read it or made it up which is highly possible. You seem to get the weather I have a day later...and if I did make it up that makes no sense at all... Thanks for the compliments on my gardens...it so soothes my soul to work outside amongst the dirt and flowers. Have a great night everyone.",
      "MessageIndex": 4298,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 21, 2018 09:40PM ElleOnWheels wrote: Checking in.... Loooong day at work today (I hate when work gets in the way... lol) and even longer evening developing in the emergency room with my 87 year old Mom. Looks like a UTI so nothing too bad..but we all know how long you're in these joints. SO thrilled with all the good news... Micmel, Mae, Holmes!!! I'll try to catch up more tomorrow. E ",
      "MessageIndex": 4323,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 4, 2018 07:35PM ElleOnWheels wrote: OMG Mae, I would be so freaking pissed!! The fact that they have to hire TWO people to replace you speaks VOLUMES about the job you do. And somehow 1 percent almost seems worse than none. An intentional insult. Get outta there. Let them worry about training your replacementSSSS. Not your problem. All that spewed, I am stupidly loyal and have worked the same job for 26 years so I totally get if you do stay and help. Geeze....",
      "MessageIndex": 4540,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jul 25, 2018 08:07PM ElleOnWheels wrote: GOOD GOLLY!!!!! I leave for a few weeks and so much has happened I will never catch up! Waving hi to all and sending so much love, especially to those going through difficult times. Divine...hope the healing is going well, Bigbhome...thinking of you and dh, can't even imagine....Mae!!! great news,so happy! Micmel, you're a sweetheart to think of me when I've been away for so long. Eventually (hopefully) I'll get all the back pages read and know what's going on with everyone. I'm good...almost through my crazy summer season. Four shows down....On Your Feet, Titanic, The Full Monty and Brigadoon. Two more to go....Beauty and the Beast and Thoroughly Modern Millie. Three more weeks! xoxoxo~ E   ",
      "MessageIndex": 5226,
      "PostDate": "25/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 17, 2018 02:15PM ElleOnWheels wrote: Hello everyone! May I be so bold as to pull up a stool? (thanks Micmel) Today is my official one year anniversary from my MBC diagnosis and it just seems fitting to make some new friends. To be honest, I feel like you already are my friends because I read everything every single day...but I'd love to join the conversation. This past year has been a whirlwind as you all have experienced yourselves, but I had my PET/CT a few weeks ago and everything has greatly improved or at least remained stable over this year, and while my tumor markers recently took a crazy swing upward they dropped 300 points this month! They are half what they were when I started out. Found out this morning....Happy Anniversary to me! I'm holding steady on my 9th month of Ibrance/Faslodex after a few hellish months of chemo that didn't agree with me. I thank you all for all the support over the past year....can't tell you how much hope, knowledge, love and support I feel from reading this thread...you all amaze me. To all of you having scans or waiting for results...break a leg!! OK, that may be a little weird here but I've been in musical theater my whole life and silly/weird are things I do best. And burst in to song at any given moment. Everything is a song cue in my world! E",
      "MessageIndex": 4234,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 17, 2018 09:20PM ElleOnWheels wrote: Thanks so much for the warm welcome ladies. Not to worry, illimae and 50sgirl, I've seen the threats of PMs when one of you has gone quiet for a few days. And yet here I am... lol! Hoping for good scan news for all... have a good night everyone!",
      "MessageIndex": 4246,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 18, 2018 07:13PM ElleOnWheels wrote: Divine, nice to meet you neighbor! I am just south of the city in Allegheny County. My onc is with UPMC. I'm really lucky... there's a satellite UPMC Cancer Center mere minutes up the street from me and also in an independent hospital just as close. I feel very fortunate to have the excellent resources we have here in Pittsburgh. Count me in on the wedding...although I confess I set my DVR and will be watching after the fact. Saturday is my only day to sleep in a bit. I, like the rest of the world, adored Princess Diana. I admired all she did to better the world and feel the same way about her boys. They both seem so happy and it warms my heart. And I love all the pomp and circumstance...and the fascinators!! MJH....YAYAYAY to the falling tumor markers!! Mine just did the exact same thing and it's such a relief.",
      "MessageIndex": 4268,
      "PostDate": "18/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 18, 2018 09:22PM ElleOnWheels wrote: Whoa... that must be some dress!!!",
      "MessageIndex": 4271,
      "PostDate": "18/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 20, 2018 06:39PM ElleOnWheels wrote: Thank you, Lynne! You'd laugh if you would have seen it years ago. I dug up all these gardens and had tiny little bushes everywhere... I used to stare at it all and wonder what I'd done! That bush has to be a good 10 years old. I have a few others....a hot pink reblooming and a variegated. I love them and so do the hummingbirds. I'm something of a crazy bird lady too... lol.",
      "MessageIndex": 4293,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 25, 2018 12:18AM ElleOnWheels wrote: Micmel~let me be the first to say happy, Happy, HAPPY BIRTHDAY!!!!!! I'm sorry you are dealing with all that crap, I hope your soon to be son-in-law is ok...but for one day try to relax, enjoy the fantastic news of remaining NED and enjoy your day!! Been a stupid, busy week at work...I've been checking in and thinking of everyone. Love you Micmel... HAPPY BIRTHDAY!!!!",
      "MessageIndex": 4384,
      "PostDate": "25/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 30, 2018 03:15PM ElleOnWheels wrote: Thinking of you today, Micmel. I was very happy to see your DH was talking with an attorney. I know it goes against every Mom bit of you...but how they afford a place to live is not your problem to solve. And this is the second home he's been kicked out of?? Geeze Louise, he's something! Maybe this will wake him up...but probably not. Lynne, your flowers look beautiful!! Glad spring has finally sprung for you. I was back to cleaning out/mulching this past weekend. Still a bit to go... but we're getting there. Had cataract surgery today. Can't see a damn thing right now but doc says it went well. Fingers crossed!",
      "MessageIndex": 4466,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 1, 2018 12:00AM ElleOnWheels wrote: Jumping in my car to join the villagers... bringing Katherine Hepburn with me. She may be a tiny papillion but she has a bark with a pitch that can shatter glass... and she is not afraid to use it. That will get his ass outta bed and hopefully into a new apartment quickly!! Hi Daniel... love the pic and am amazed by your wife! Divine, I can only imagine the relief you must feel. That is HUGE to have that weight off you and your DH's shoulders. It must be a strange feeling right now, though. Tanya, I'm late here but wanted to tell you how much I enjoyed the pictures you posted. You and your family are so beautiful and obviously very intelligent and driven. Congratulations to all of you! Runor... you make me lol...",
      "MessageIndex": 4509,
      "PostDate": "01/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 6, 2018 12:28PM ElleOnWheels wrote: Sitting in the big chair waiting for my butt shots and zometa infusion. Saw my onc who is delighted with how things are going, as am I! Mae... I absolutely love the timing of your HR visit. I'm sure it struck fear in their hearts!! Your plan moving forward sounds wonderful and I think you made the best decision possible in this crap situation. I hope everything easily falls into place for you. Lynne... we are kindred spirits with the gardening. I just do flowers now, though. I have a tall fence that keeps the deer out, but the little critters ate everything! You have to laugh when you see a chipmunk running with a big tomato in it's mouth. I now mostly have flowering bushes...roses, hydrangias, rose of sharon, that type of thing. Then I do hanging baskets and window boxes for my annual flower fix. I will tell you... I too am QUITE the expert and growing weeds. 🙂🙂 Oop... time to get stabbed... more later. xoxo",
      "MessageIndex": 4574,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 9, 2018 11:09PM ElleOnWheels wrote: Tanya, what fantastic news!!! So happy for you! Lynne(50s}, I am having both eyes done two weeks apart. They were both pretty bad with the right being a bit worse. I'm with your husband, it is absolutely amazing how much better my sight is. I knew it was pretty darn bad, but wow! The world is so bright and colorful again. second eye (left) coming up this Wed. Thinking of you all... some day I'll be able to keep up. But for now I'm grateful I can keep such a busy schedule and feel almost \"normal\" doing it! And to all... a good night!!! ",
      "MessageIndex": 4615,
      "PostDate": "09/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 11, 2018 08:22PM ElleOnWheels wrote: Keetmom, I am so happy to hear from you. Even happier that things are stable! I can only imagine how scary that must have been and hope that you are feeling better. Like everyone said... rest, then rest some more. Thinking of you E",
      "MessageIndex": 4652,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Aug 27, 2018 01:24PM ElleOnWheels wrote: Hello again, friends! After a VERY busy summer I have been catching up the past few days and I am so saddened by the losses that have happened recently. My heart just breaks for the families and friends of those lost....especially the children. Keetmom, LaLady, Rpoole.....I didn't know any of you well but you all had a very special place in my heart. And I'm sorry. I'm so sorry this sucky disease took you away from your loved ones way too early. Just makes me want to SCREAM. And to those of you struggling....my thoughts are with you...along with so much love. I'm doing well...I'll give you an update after I wrap my head around this a bit more. Love you guys...been thinking about all of you. E",
      "MessageIndex": 5690,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Sep 4, 2018 02:42PM ElleOnWheels wrote: Hello, friends! Add me to the funky group. Seems I'm also facing some sort of progression as my tumor markers have been rising steadily for a few months now. They suck. Will be having a PET soon to get the real story. My wonderful onc is extremely calm about it all and said he's not overly concerned...that makes one of us. Ha! We had a long discussion about treatment options and decided I'll try staying on the Ibrance and switching to a different AI. That man has the patience of Job...I asked him a million questions and he thoroughly answered every one of them. Explained the difference between the various inhibitors/AIs, the worst side effects of each etc. He gives you options and then tells you to think about it and let him know how you feel. He likes to try to get the longest time possible out of each treatment....unless, of course, things are going crazy. I concur. For now I remain in my pretty constant state of denial and keep living my life. Micmel...busy lady!! When I was TRYING to catch up I so enjoyed looking at the shower pics. Everything looked beautiful....especially you and your daughter. Good luck with all the reception preparations. I know it will also be a huge success! Minnie, Holmes, Mae....hoping you all get good news with the scans. Thinking of you and jumping into the pocket. I'm the one constantly singing silly show tunes... Daniel, I'm so glad Leslie is feeling better. Make sure you're taking care of yourself too. My hubby spent many months in the hospital years ago and it is ROUGH to be on your side of things. Honestly I think it's harder at times. Grannax, I was so sorry to read about your progression. I wouldn't be particularly happy with my liver either! Hopefully you can zap it and get everything back in line. NO1, can you maybe move your MO appointment up a few days? Your stomach issues sound awful and I hate to think of you in agony. Better get back to work (oops).... love to all!!!! E   ",
      "MessageIndex": 5817,
      "PostDate": "04/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 17, 2018 03:24PM ElleOnWheels wrote: Micmel ~ Thank you. ❤️❤️❤️❤️",
      "MessageIndex": 4238,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 19, 2018 05:31PM ElleOnWheels wrote: Hi all! Been out mulching gardens all day. I pretty much dug up my entire back yard for gardens never dreaming I'd get sick and have a hard time taking care of them. Last summer I couldn't do a thing so they are a mess... but this year, look out!! With the help of my DH I am whipping them back in to shape...slowly but surely. If only I cared about cleaning my house this much... 😀😀😀 LOVED the wedding. I thought it was perfect. Traditional, yet modern...British and American... so many touching/emotional moments. I have always loved Harry... from the little one that stuck his tongue out to the caring man he has become. Just a joyful day. ",
      "MessageIndex": 4283,
      "PostDate": "19/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 29, 2018 11:28PM ElleOnWheels wrote: Oh Micmel...I am speechless. Absolutely stunned. And my heart is broken for you. Just broken. I can't even imagine. I agree with the others... get him (them, I guess) the hell out of YOUR house. Let your daughter know you're there if she needs you and then let go. Hardest thing you'll have to do, but necessary at this point. There is nothing you can do or say right now to make her see the situation for what it is. But she will...hold onto that... she will. I am SO sorry...you were so happy and. excited. And then this crap. It makes me SO ANGRY. I'd cancel that reception in a heartbeat. Why should you pay for it when they have zero respect for you? AND you're not invited??? This is so not your fault... nothing you did, nothing you said, NOTHING. Take care of you right now. Stay in bed, cry, scream... whatever it takes to start the healing. Then take stock of the good in your life and concentrate on that. I haven't been around long but I love you and send you nothing but love and hugs and anything else you need. Hang tough, sweet lady. You can and will get through this.",
      "MessageIndex": 4447,
      "PostDate": "29/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "May 30, 2018 11:07PM ElleOnWheels wrote: Granna, great news on the stable scan!! But wow on the MO. I'm with Divine... she sounds very odd. Well worth the effort to find a new and improved doc... but it is a royal pain. ",
      "MessageIndex": 4479,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 1, 2018 12:21AM ElleOnWheels wrote: Katherine Hepburn.... don't let that adorable face fool you.... ",
      "MessageIndex": 4510,
      "PostDate": "01/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 4, 2018 09:25PM ElleOnWheels wrote: Micmel... lol! Pick me up on your way. I can start with the other shin....",
      "MessageIndex": 4543,
      "PostDate": "04/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Jun 11, 2018 12:19AM ElleOnWheels wrote: Micmel, ",
      "MessageIndex": 4628,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/856706",
      "Title": "My Husband, My Life, My Love, My Family, My Cancer Micmel runor"
    },
    {
      "AuthorID": "ElleOnWheel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252576/profile",
      "Content": "Apr 5, 2018 06:03PM ElleOnWheels wrote: Thanks dlz913! All signs (so far} point to mine being damage from radiation. I have an esophageal dilation scheduled for Apr 17. Hopefully that will take care of it.",
      "MessageIndex": 5,
      "PostDate": "05/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863669",
      "Title": "Esophageal dilation, anyone? ElleOnWheels Beatmon"
    }
  ]
}