{
  "AuthorID": "elleredux",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
  "Posts": [
    {
      "AuthorID": "elleredux",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
      "Content": "Oct 27, 2018 02:33PM elleredux wrote: Hi Judben, I know this process takes a lot of patience, and it’s not easy! Many of us who had calcifications went on to be diagnosed with breast cancer, but many times it’s not cancer. It sounds like your doctors are being thorough. It seems like they aren’t seeing any large masses, so that’s good. Try to hang on to the positive thoughts, hopefully you can rest easy soon",
      "MessageIndex": 1,
      "PostDate": "27/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/868006",
      "Title": "Waiting for Biopsy Results Judben63 CasM"
    },
    {
      "AuthorID": "elleredux",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
      "Content": "Mar 15, 2013 11:39AM elleredux wrote: Hi Magnolia, I had a micromet (.7mm) found at sentinal node biopsy, and another one at ALND that was 5mm. My oncotype score was a 4. I did feel comfortable with the validity, because it seemed to match up with my pathology. My ki67 was less than 5%, and my ER and PR were very strongly positive, so a lower score was predicted. I also called the Oncotype company and was reassured by what I learned about the validity, the samples are triple tested. A low score does make the chemo decision tough with positive nodes. Hope this helps!",
      "MessageIndex": 2,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/801846",
      "Title": "Oncotype dx and positive nodes magnolia57 foreverchanged"
    },
    {
      "AuthorID": "elleredux",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
      "Content": "Feb 1, 2013 04:23AM elleredux wrote: Hi Shirley, Yes, definitely! I had a lumpectomy and a BMX while on my period. They will probably ask you not to wear a tampon and give you disposable mesh underwear with a pad instead. Just mention it to the nurse when you get there. You will do fine! :-)",
      "MessageIndex": 1,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/799769",
      "Title": "Will they do my surgery if I'm on my period? bigshirley softness1"
    },
    {
      "AuthorID": "elleredux",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
      "Content": "Mar 15, 2013 06:39PM elleredux wrote: Magnolia keep us posted on your results! It's interesting that you have your sisters report to reference.",
      "MessageIndex": 5,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/801846",
      "Title": "Oncotype dx and positive nodes magnolia57 foreverchanged"
    },
    {
      "AuthorID": "elleredux",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
      "Content": "Nov 3, 2016 12:57AM - edited Nov 3, 2016 12:57AM by elleredux Some states have Breast and Cervical Cancer Programs that include both screening and treatment. Check with your county health department, they should have someone in charge of Women's Health Programs who should be able to find out what your state offers. ",
      "MessageIndex": 7,
      "PostDate": "03/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/848873",
      "Title": "No insurance help Lindaerwin jamiesam26"
    },
    {
      "AuthorID": "elleredux",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
      "Content": "Dec 12, 2012 10:14PM elleredux wrote: Thanks everyone for the warm welcome! Kiwi, Maybe the difference in treatment recommendation is due to the fact that my DCIS area was originally more widespread. Also, it doesn't look like I will be having chemo (unless they find something else at the BMX). My Oncotype was a 4 (my ki67 5%) and my onc is recommending no chemo and tamoxifen plus ovarian removal or suppression. I also had the problems getting clear images, so the doctors felt mastectomy was the best option. I had 3 nodes removed, with just one positive for the .7 mm micromet. There seems to be differences of opinion as to how to treat these micromets. That has been the most confusing thing to sort out!",
      "MessageIndex": 5,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797553",
      "Title": "Diagnosed in September but new to the board... elleredux Moderators"
    },
    {
      "AuthorID": "elleredux",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
      "Content": "elleredux wrote: Hi Everyone, I have been reading posts for a few months and have now felt ready to post. I remember my first time reading this board, I was in awe of how amazing, strong, and supportive of each other you all were. At the same time I was so scared. I was so happy that this board existed, but still not feeling like I could accept what has happened so I could fully participate. I hope that makes sense. I am ready now. :-) My journey began in September. At my screening mammogram I called attention to an area in my left breast that I had noticed a thickening, not necessarily a lump. I also remember the breast looked sort of square on the bottom outside area. The technician marked the area, and sure enough I was called the next morning to return for a diagnostic mammogram. Within a week I had had the diagnostic mammogram, two different types of ultrasounds, and a biopsy. I remember the technician and doctor who did the imaging said things like \"your images haven't changed that much since last time\" and that my images didn't look \"that concerning\"...but sure enough I was diagnosed with IDC 1.7 cm. I was in the surgeons office within days. An MRI was ordered. I was told it showed nothing else. However, I was told that I took up too much contrast, and that my breasts were \"active\". My primary doctor explained that that may be related to hormonal issues, and that the concern would be that they'd miss something small. But it seemed pretty straightforward. My surgeon explained to me that I was Grade 1 and ER positive and that that was good. I was scheduled for a lumpectomy and sentinel node biopsy. He said he would be shocked to find something in the lymph nodes. After my lumpectomy, he told my friend in the waiting room that it was so small that he had to dig for it, and that they got everything and that I would be fine. The next week when he called to tell me the pathology showed DCIS and a micrometastis (.7mm) in 1 of 3 lymph nodes taken, he said this \"wasn't behaving like he expected\" and sent me off to get genetic testing. I remember he commented that the MRI doctor said \"my breasts lit up in weird ways\". He was talking about doing biopsies on the other side as well. During the next month I got genetic testing (BRCA 1 and 2, BART, PTEN for Cowden's since I had thyroid cancer almost 20 years ago). All tests came back negative. I also got a second opinion from another major hospital/cancer center. They agreed with the pathology. They said the other breast is clear. They recommended a mastectomy because DCIS was diffuse, and radiation (rather than removing more lymph nodes), and delayed reconstruction, six months to a year after radiation. They do not believe in any tissue expanders or reconstruction until well past radiation. This was kind of a shock because I had done a lot of research on reconstruction, even went to a long breast cancer reconstruction workshop with a panel of experts and everything pointed to tissue expanders being the way to go, even if you ended up having a flap/tissue transfer procedure. One of the reasons being that radiated skin is harder to stretch. I went pack to my original hospital (Also, major teaching NCI hospital), but this time to the breast experts. After a day of imaging, the surgeon recommended that I try the re-excision. Because it is very low risk, and apparently they usually take out more tissue than my original surgeon did. I thought it was worth a try. I had my re-excision and my recovery was easy. I went a week later for follow up and to get the results of my pathology. I knew the surgeon was out all week and that I would be meeting with the physicians assistant. He told me right away that my margins were clear and I sat there in stunned amazement for a while. After a brief discussion of next steps, radiation, I left and as I left he handed me a copy of the pathology report. I stopped in the cafeteria for something to eat on the way out. I began to look through it. My eyes settled on a sentence on the very bottom of the page that said \"DCIS transected at the inked margin\". That didn't sound right to me. To make a long story short, I was right. This info was sort of buried in a pathology report that had a lot of detail and my other margins were great. But still shocking and disappointing. I did receive a call from the surgeon personally and she said because it was minimal and on the outside of my breast she would put my case before the tumor board to see if they could deal with the margin in Radiation. She said if I did the reexcision it would leave me with a significant lumpectomy defect. So, the tumor board unanimously voted not to move me on to radiation and recommended mastectomy. Reasons cited were my age (just turned 48- all these breast cancer people keep telling me I'm young!) and the question \"how are we going to follow her through imaging?\". Remember the strange comments about my MRI? None of this DCIS showed in my original imaging either. So I have thrown in the towel and am scheduled for bilateral ( even though the other breast appears clear - I just cant shake those imaging issues/comments!) mastectomy with tissue expanders on December 19. I am not sure about radiation. Onc and surgeon think I can do either the axillary clearance or the radiation. I have an appointment with the radiaton oncologist for his opinion. I am trying to stay positive. I am hoping for no more surprises...I am scared. I am trying to focus on the negative genetic test results, and Oncotype was a 4. I just feel like this bilateral is like starting all over and who knows what will be found. Thank you for listening! I am grateful to have found this community and hope that I can be of support to others. By the way, how do I get my information to show up on the bottom of the posts? Thanks! Dx 9/10/2012, IDC, 1cm, Stage IIA, Grade 1, 2/15 nodes, ER+/PR+, HER2- Dx 9/29/2012, DCIS Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797553",
      "Title": "Diagnosed in September but new to the board... elleredux Moderators"
    },
    {
      "AuthorID": "elleredux",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
      "Content": "Jun 1, 2016 04:18PM elleredux wrote: Hi H2worry, I'm know this is a stressful time and difficult to get through. I know I feel better when I understand what's going on, so I thought I'd see if I can help you by giving you my take on your report. First, I believe that whenever a radiologist report indicates that a biopsy should be considered, it automatically puts you in the BIRADS 4 or 5 category. The report indicates that the nodule is ovoid, or oval shaped, vs. spiculated, or star/spiked shaped. Malignancies of the breast are typically, but not always, spiculated. It also states that on your mammogram that no calcifications were seen. Calcifications are commonly seen near malignant breast growths. The report states that ultrasound indicates no definite flow with the nodule, which means the ultrasound didn't detect blood flow to/within the nodule. Generally, cancer establishes a blood flow. All in all, the radiologist does not seem to have enough information to determine with a good amount of certainty whether this nodule is benign or malignant, so he/she states \"histologic correlation\" is recommended, which means biopsy- cells on a slide - a definite answer. I hope this is helpful and I'm really glad that the radiologist is being cautious!",
      "MessageIndex": 1,
      "PostDate": "01/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/844763",
      "Title": "Help understanding report! Hate2worry Hate2worry"
    },
    {
      "AuthorID": "elleredux",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
      "Content": "Jun 1, 2016 09:22PM elleredux wrote: Good catch Tracy! H2worry, I am sending tons of positive vibes your way. I hope that your results come quick and that they are benign!",
      "MessageIndex": 4,
      "PostDate": "01/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/844763",
      "Title": "Help understanding report! Hate2worry Hate2worry"
    },
    {
      "AuthorID": "elleredux",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
      "Content": "Aug 26, 2014 08:18PM elleredux wrote: Doona, The initial shock is so hard...all the unknowns and apprehension.  Ask your doctor for something to help you relax and sleep. Doing that helped me so much. And the ladies on this board are wonderful. I read way more than I post, but this board has been very grounding for me and such a good support. I had positive lymph nodes and am only almost 2 years out and doing well - and there are many others on the board who are doing well many years out. (((Hugs)))",
      "MessageIndex": 7,
      "PostDate": "26/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/823969",
      "Title": "results are in Doona Hopeful82014"
    },
    {
      "AuthorID": "elleredux",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165850/profile",
      "Content": "Oct 5, 2018 08:28PM elleredux wrote: Do you plan on having reconstruction? There are several methods of reconstruction that can give great results, but there is also a potential for increased risk of complications with reconstruction of a double vs a unilateral mastectomy. However, with a double mastectomy, many women do find relief in the stress/worry aspect of the stepped up monitoring of the \"normal' breast. I ended up having a double. I'm in healthcare, and every time I go past the mammogram center I breathe a little easier knowing that I won't be on a regular cycle of imaging and waiting for results.",
      "MessageIndex": 6,
      "PostDate": "05/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867604",
      "Title": "Uni or double Samnjb MCBaker"
    }
  ]
}