{
  "AuthorID": "ellen57",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97282/profile",
  "Posts": [{
    "AuthorID": "ellen57",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97282/profile",
    "Content": "Feb 13, 2010 01:06PM - edited Feb 13, 2010 01:10PM by ellen57 Well, I really missed the boat on finding this site! I have read through all your posts and am honored to be amoung such strong, caring women! I finished Rad 2 weeks ago and could really have used all your wonderful information while I was going through it with you!  I had 27 rads and 7 boost. I had small watery type blisters on my chest wall that then became leathery and needed creams. I am very large breasted (DDD) and the breast itself tolerated the rads very well, I got pink only. My problem was the fold under the breast. The skin there broke down very badly and actually bled at times. I started out rolling baby wash cloths and lining the fold with hydrogen 10, gauze and then the wash cloth. This worked for a few days, but then any movement caused rubbing from my bra and pain. I teach elementary school, so going braless was not an option! A friend gave me a great product called A SHOWER HUG (www.showerhug.com) which was designed for lactating or post surgical women to wear in the shower to prevent pain from the water pressure. It is a wrap that velcroes in front. I turned the velcro around and wore it under my clothes like a tube top. It gave me plenty of support and really did feel like a ((HUG)) when I needed it most! The other piece I wore was from Women Within's web site and it was like a tight camisole with built in bra with no underwires! It felt like I had my bathing suit top on and was very comfortable. I did find that during the most painful of times I preferred to sleep in one or the other. Now that I am almost 2 weeks out of rad. I can say that I am healing nicely. I have Irish skin that burns easily, I have had both basal and squamous cell cancers removed before so I was very nervous. The skin is still peeling but the new skin ispink and shiny. I did also have a part of my lung clipped by the radiation. I developed asthma type symptoms that the rad onc did not seem too concerned about. After more than a week of wheezing I started coughing constantly so I went to my Primary. That lead to an antibiotic, Advair, rescue inhaler, and 30 days of steroids. YUCK. I have terrible insomnia from the steroids, but everything seems to be clearing up. Sometiimes I get dizzy and have terrible hot flashes. I think it is from all the meds? I did my treatments before Christmas at 8:00 and went late to school. No problem as far as feelign more or less tired because it was so early on, except I am NOT a morning person. After the holidays, the 4:00 slot came up and I took that. I listened to a great book on cd in the car on the way- The Help- and it made the trip to and fro enjoyable. I was supposed to see onc. 2 weeks ago but he cancelled, then last week he cancelled me again, then we have had 2 feet of snow and he closed office for 2 days this week.(This was timely as we had 2 Snow Days that but up to a 4 day Presidents Weekend to relax and build up more stamina!) I am nervous and would love to see if anyone can tell me about the drugs we are about to start taking? I am overweight but in good health. I am about a year since my last period. I have had terrible hot flashes since diagnosis. Not looking foward to more SE. What have you all been told about the drugs and what to expect? Mimi- I can relate to the seroma thing! I had a big, very painful one after my first surgery. It actually leaked at one point, closed up and then a week later exploded- the stuff just poured out of me and I was out of town visiting my poor, traumatized parents. Had to drive 3 hours back to surgeon, he tried to get an OR, but there were none until 10pm so he opened it in his office! I never felt a thing- sort of like having a stitch removed and then RELIEF- it felt sooooo good! I would recomment the shower hug for soaking in a warm shower or tub and to wear dry to keep it from hurting. Good luck!  Congratulations to all of you who have just finished! Yeah! Feels great, huh?  To those of you who are still going through the drag of rad. it will all be over before you know it and just be a unfavorable memory. I feel I learned a lot about myself going through the experience. Think at the end of every day all you had been through that day and congratulate yourself for all you have done. I worked all the way through rad with special education kids in grades 1-3. I was a work aholic in the past and I had to put in a lot less hours now writing meticulous lessons and being on every committee, but I pulled from what I knew after 30 years experience and  taught from my heart. It may not have been my best year, but I knew I had done my best every day. I was renewed to be able to be ok with that.   God bless everyone in this club we never thought we would be members of!",
    "MessageIndex": 570,
    "PostDate": "13/02/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
    "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
  }]
}