{
  "AuthorID": "ellie123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
  "Posts": [
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Aug 10, 2008 06:02PM ellie123 wrote: I too had no option in my mind but to wear a wig to work and my team age boys were nervous about me being bald.  I had A/C so it was not a matter of \"thinning\" ....it was outta here.  So I wentot my hairdresser and she did her best but I felt like Hot Lips Hollihan and was very freaked out.  I went to the boutique at the center were my doctors were and the gal there was fabulous.  I tried on a couple of styles that were similar to my hair style and then she ordered several wigs for me to try.  They were there in a couple of days and her picks were perfect.  I am pretty sure that the brand was Henry Margu and it cost 350 but most of it was covered as a head prothesis by insurannce.  It was comfortable once I got used to it and while my immediate co workers knew my situation I could not tell you how many people raved about my hair and had no idea it was a wig.  Now I'm having a hard time getting used to my funky curly REAL hair!!  End of story....while I too am an internet buying gal I think if you can find a real \"wig\" person you'll have better luck. ",
      "MessageIndex": 8,
      "PostDate": "10/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719318",
      "Title": "Share the details of your wig with me? Drea angie27"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Aug 13, 2008 06:35PM ellie123 wrote: Drea I posted once but forgot to mention what so many other people have said that is really key......Have your hairstyleist give it a trim and it will make a HUGE difference.  So if you try one on and it looks okay but poofy the trim will help.  You can also use styling gels and all sorts of stuff (no hair dryer!) to make it look more natural.  Best of luck and hugs!",
      "MessageIndex": 25,
      "PostDate": "13/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719318",
      "Title": "Share the details of your wig with me? Drea angie27"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Aug 23, 2008 08:24PM ellie123 wrote: When I was diagnosed I thanked God not for the cancer (I had some choice words for THAT and thanks was not one of them) but for the folks who spend their day in lab coats staring at test tubes and understanding things I can not grasp.  I thanked him for my Onc who has studied long and hard to be able to guide me on the best path for my best chance of living long enough to do more of Gods work.  I thanked God for the unexpected meals that came when I was not sure I had anything left and my family who treated me like Mom but took care of me too.  The list of things I was thankful for goes on and on.  God is so much a part of this whole difficult, scary deal but for me He was made it possible to cope and follow the doctors recomendations.  Chemo feels like forever but its not.  You do it, it sucks, you get through it and life blessedly goes on.  My prayers for you at this tough time. Ellie",
      "MessageIndex": 9,
      "PostDate": "23/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719953",
      "Title": "refusal to do chemo treatment pasimms carol1949"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Aug 9, 2008 02:12AM ellie123 wrote: I had a bear of a time with my nails but after i started taking folic acid (in any drugstore) they improved a huge amount.  Then a friend suggested Sally Hansen in the Gold bottle.  It was more than the other clear ploishes but it really did help.  Good Luck!",
      "MessageIndex": 4,
      "PostDate": "09/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719225",
      "Title": "How long after chemo before your nails start growing again? VBG evans"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Dec 11, 2007 08:12PM ellie123 wrote: Thanks Shrink- I was reading other past posts and I think I'm going to bug my onc for a \"water pill\" and see if that helps.  I had some numbness but that's mostly gone (except for one spot on the bottom of my foot!).  Hope your hand feels better!",
      "MessageIndex": 1213,
      "PostDate": "11/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/614331",
      "Title": "June 2007 Chemo b445 GracieM2007"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Dec 12, 2007 08:47PM ellie123 wrote: Hi all- Thanks for a great welcome!  My onc wanted me to try some \"natural\" remedies for a couple of days before he saw me for a RX and they are actually working well.  It was a comfort to hear that other Junies are still working through the aches of Taxo. Shrink- I'll be keeping you in my prayers for strength as you go down another chemo road.  We can all walk with you and hold your hand!",
      "MessageIndex": 1221,
      "PostDate": "12/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/614331",
      "Title": "June 2007 Chemo b445 GracieM2007"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Dec 13, 2007 07:02PM ellie123 wrote: Hi Kathleen- The main things he recommended were to drink cranberry juice and try to eat foods full of potassium like bananas and prunes.  Citrus is also supposed to help and of course dring water constantly.  He added that as much exercise as I could tolerate would help as well.  Then I went on line and found something about laying with your legs up against a wall for about 5 minutes.  I remembered my son doing this after he ran sprints in track to drain the lactic acid.  I swear after my first upside down session I felt a difference (I also looked like a loon doing it but my kids are used to anything at this point!)  I'm still sore but it is getting better and the swelling is down.  Hope it helps!  I'm calling onc again tomorrow and I think I will keep this going for at least a few more days.  I'm so sick of meds! Laura",
      "MessageIndex": 1223,
      "PostDate": "13/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/614331",
      "Title": "June 2007 Chemo b445 GracieM2007"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Jan 11, 2008 07:42PM ellie123 wrote: Great news Shrink!!  Celebrate the weekend away!! Ellie",
      "MessageIndex": 1305,
      "PostDate": "11/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/614331",
      "Title": "June 2007 Chemo b445 GracieM2007"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Dec 14, 2007 07:02PM ellie123 wrote: Kathleen-  I know what you mean about the water....I feel like inground pool most of the time ( I also live in a bathroom most of the time!)  I have to say I am feeling significantly better at this point so I guess it is all working.  Hope you feel a difference too! Shrink-You got through the first chemo and you will do it again.  Keep looking forward and know that this time WILL make the difference your doctors are looking for.  I'm amazed at all the findings that have happened since I was diagnosed just a few months ago.  Strides are being made....WE CAN DO THIS! To everyone else..thanks for a great welcome!",
      "MessageIndex": 1233,
      "PostDate": "14/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/614331",
      "Title": "June 2007 Chemo b445 GracieM2007"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Jan 8, 2008 06:21PM ellie123 wrote: Hi all...Welcome Konakat....I was warmly welcomed and sort of fell off the map but I wanted to respond to your mom question.  I too dreaded that conversation since my mom is a chronic worrier and tends to the negative.  I had no choice but to tell her and she handled it pretty well.  I insist that she only talk about my prognosis  in the most positive way.   So far so good.  I have a feeling that if your mom figures out that you've been going through more than a busy work schedule, she'll handle it okay.   Blessedly the cancer diagnosis of \"their\" day is much different than today.   Good luck with your visit!  I wish my hair was long enough to look stylish!  I still look like a balding man...ugh. I've loved keeping up with everyone else.  Just started rads and since I'm a warm NYer (Hudson Valley) no snow days yet!",
      "MessageIndex": 1290,
      "PostDate": "08/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/614331",
      "Title": "June 2007 Chemo b445 GracieM2007"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Jan 12, 2008 07:24PM ellie123 wrote: Dawn, I'll keep your mom in my prayers.   Keep us up on any news.  Ellie",
      "MessageIndex": 1310,
      "PostDate": "12/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/614331",
      "Title": "June 2007 Chemo b445 GracieM2007"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Jan 24, 2008 06:58PM ellie123 wrote: Bonnie- I'll keep you, your husband and your boys in my prayers.  Such a scary time.  Try to stay strong and lean on those friends and family. Dawn- Prayers for strength for your mom, her mom and your whole family.   Let us know how your mom is tolerating the chemo.  Don't forget to take care of yourself during this time, you're just starting to heal.   Hugs.  We really have to make the most out of the good times in life...it sure can turn on a dime.  God bless the ordinary day!  Ellie",
      "MessageIndex": 1329,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/614331",
      "Title": "June 2007 Chemo b445 GracieM2007"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Dec 11, 2007 07:19PM ellie123 wrote: Hey Everyone- I'm a Junie but somehow missed this whole support page.  I tried the chat room a couple of times and was overwhelmed with the banter so I kind of dropped out.  Hope you don't mind if I ask a couple of questions even though I'm almost on the rads page! I'm 4 weeks past my last taxotere and I'm still having nasty leg pain and swelling.  Anyone else have these symptoms?   Thanks.",
      "MessageIndex": 1211,
      "PostDate": "11/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/614331",
      "Title": "June 2007 Chemo b445 GracieM2007"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Aug 5, 2008 09:47PM ellie123 wrote: Hey Kris I too have the identical muscle aches and I finished up last November.  I was still on Herceptin and blamed that but when I mentioned it to my onc he said it was typical to have muscle pain for an extented period after chemo.  Just like Otter I found that exercise helped most of all but it does really suck.",
      "MessageIndex": 6,
      "PostDate": "05/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719018",
      "Title": "Effects AFTER Chemo kris60 onwardandforward"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Aug 10, 2008 09:19PM ellie123 wrote: My onc is like a brillant whirling dervish and I have to be very prepared when I talk to him or he just blows by what I feel is important.  I have also been very bold and told him to please answer my questions and not just glaze over my concerns.  He always laughs when i get fussy.  I remember I was panciked before my first chemo be/c my stomach has always been lousy and I could not imagine how bad ti would be with chemo.  I literally took his hand and told him my fears.  He took care of me beautifully but really needs that eye contact.  I think we forget how hard their jobs are and they forget that we are people just like they are.",
      "MessageIndex": 17,
      "PostDate": "10/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719321",
      "Title": "How do you feel about your Onc? sunrizes2 OneBadBoob"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Jun 24, 2008 09:42PM ellie123 wrote: Dear Estepp- I sounds like you have a wonderful life and family.  Cancer does not have the right to take that away from you.  Hold on tight to as many of those wonderful people as you need and walk into that doctors office knowing that no matter what Doc has to say you will fight this and win.  As for the biopsies...find another surgeon that has enough compassion to give you a valium, numb you up and then do their thing.  This is not walk in the park but that much pain is just a lack of caring.  I too had no reason to be in this position but here i am walking out the other end after a year.  You have your family and literally thousand of sisters on this site that will hold you up evey step of the way.  My Avitar is Ellie but my name is Laura and I'm barely past 40....you can do this kiddo let us help. Ellie",
      "MessageIndex": 1,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707947",
      "Title": "Didn't have it in me Estepp CathyaMom"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "May 4, 2008 08:54PM ellie123 wrote: I'm not sure but if TC is Taxotere then holy moley did I have leg pain!  I continue to have awful muscle aches but i feel like it is the Herceptin that is partly to blame.  I excercise daily and that has helped along with Advil when it's really bad.  I even had leg swelling that freaked me out to no end and I had to lay with my legs up against a wall several times a day.  Weird stuff.",
      "MessageIndex": 2,
      "PostDate": "04/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705011",
      "Title": "TC and leg pain mikim ellie123"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Jul 1, 2008 09:21PM ellie123 wrote: I am in nearly the same boat as tooyoung.  I had 4 tx of A/C, 4 of Tax & Hercep and then the continuing tx of Hercep which will be the full year deal.  I have only one arnm to use and my doc never even suggested a Port.  Make sure you drink plenty before the infusion and that they hang Saline aong with your chemo to hydrate you and flush properly.  If they keep pushing the Port I would ask for a different treatment facility with onc nurses that can deal with veins. Good LucK!",
      "MessageIndex": 34,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708217",
      "Title": "Has anyone completed A/C tx successfully WITHOUT a port? deecsw MissUniverse"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "ellie123 wrote: I only have three Herceptin treatments left but this stuff seems to be kicking my butt every treatment.  Has anyone had a harder time as you got near the end?  I am also having an awful time with my eyes.  Severe dry eye out of nowhere...really painful and with a ton of meds I'm still a mess. Any info would be wonderful.  Thanks.  Ellie Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707880",
      "Title": "Herceptin ellie123 ellie123"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "ellie123 wrote: I know I have seen this before on this site but I can't find any posts using the search.  So I am wondering if anyone has had to discontinue Herceptin because of a reduction in the injection rate that was found on a MUGA scan.  I was really blown away when I went in for my second to the last tx and the doc who was covering for my doc said I was all done be/c of the results of the scan.  He seemed pretty relaxed about the whole thing but it sort of threw me.  Anyone had a similar experience? Thanks Ellie Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719014",
      "Title": "MUGA & Herceptin D/C ellie123 ellie123"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Jun 24, 2008 09:59PM ellie123 wrote: Thank you all so very much....it is so wonderful to have support. Caya - I'm hangin!  I appreciate you sharing your experience with me...it just seems to get tougher when I guess I thought I was at crusin speed. I have drops and tears and even some weird insert things but after every treatment I have had some really rough eye days. thanks. I like the nap idea too! Nan- Thanks... I feel better just knowing others have had this type of deal.  I have aches but after Taxotere this is a walk in the park.  I'm ready to move on and feel 100%. Cindy - You are right I'm nearly there and this is no time to whine!  I have been tired and can't seem to find my enthusiasm these days.  Thanks for the encouragement! Ellie ",
      "MessageIndex": 8,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707880",
      "Title": "Herceptin ellie123 ellie123"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "Jun 25, 2008 06:15PM ellie123 wrote: Thanks Cindy- I've been checkin in on the newly diagnosed threads and feel so blessed that I have traveled so far.  I'm ready for the rest of the ride...just need a boost I guess!",
      "MessageIndex": 10,
      "PostDate": "25/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707880",
      "Title": "Herceptin ellie123 ellie123"
    },
    {
      "AuthorID": "ellie123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/49831/profile",
      "Content": "May 10, 2008 09:30PM ellie123 wrote: Guess what I just found??  It was right on the main website for JH medicine. Johns Hopkins Kimmel Cancer Center Office of Public Affairs March 2007 EMAIL HOAX REGARDING CANCER An email falsely attributed to Johns Hopkins describing properties of cancer cells and suggesting prevention strategies has begun circulating the Internet.  Johns Hopkins did not publish the email, entitled \"Cancer Update from Johns Hopkins,\" nor do we endorse its contents.  For more information about cancer, please read the information on our web site or visit the National Cancer Institute's web site at http://www.cancer.gov/. Another hoax email that has been circulating since 2004 regarding plastic containers, bottles, wrap claiming that heat releases dioxins which cause cancer also was not published by Johns Hopkins.  More information. -JHM-",
      "MessageIndex": 5,
      "PostDate": "10/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705245",
      "Title": "Chemo from John Hopkins IllinoisNancy AnnNYC"
    }
  ]
}