{
  "AuthorID": "Elliana",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89101/profile",
  "Posts": [
    {
      "AuthorID": "Elliana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89101/profile",
      "Content": "Elliana wrote: Hi all, I had a lumpectomy on Monday, it was a lot easier than I imagined, very managable, no pain after first few hours. I haven't had to take the pain meds prescribed for me. I am having a lot of nausea and weakness on this my third day out and I'm just wondering if others have had this. It seems I should be getting stronger not weaker by now, I have really taken it easy and slept a lot the last couple days. I was in good shape going in, well rested, good health, etc. I do see the doc tomorrow to remove drain, so I can ask her then, but it just seems weird to be this weak right now. Great news is they found no lymph node involvement! Dx 8/28/2009, IDC, Grade 1, ER+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742572",
      "Title": "Persistant Nausea after Lumpectomy Elliana bbop53"
    },
    {
      "AuthorID": "Elliana",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89101/profile",
      "Content": "Oct 23, 2009 06:29AM Elliana wrote: Feeling a bit better today, I see surgeon 3pm today for post op. I walked maybe six blocks distance last night and danced a tiny bit around my house. Very little is different, I'm grateful and impressed by this, they didn't hack away as I feared they would. My incisions are very small, so far minor.  The various wires and radioactive shots of dye (!!) were mostly painless, I kept falling asleep. I had no need for anti-anxiety meds. I got really cold because of no food or water for 12+ hours. But that was the worst of it. Very little pain. Nausea slowly abating. Next I find out whether there were clear margins. I see my 20 year old daughter and her bf's band play tonight! Thank you for responding!",
      "MessageIndex": 4,
      "PostDate": "23/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742572",
      "Title": "Persistant Nausea after Lumpectomy Elliana bbop53"
    }
  ]
}