{
  "AuthorID": "emilybrooke…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
  "Posts": [
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 8, 2012 01:06PM emilybrooke wrote: Congratulations Melrose on finishing your chemo treatments. You are definitely an inspiration to us! Life - you're right I am going to post whatever the heck I like. On another note, my sister has been really supportive all along. Her lack of laughter really did surprise me. Your video was great too. Like I said, I have a pixie now but expect another cut before the week is over. Feeling- terrific post - I cried a little reading it not because it made me sad but the truth that you shared. Thank you!",
      "MessageIndex": 624,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 17, 2012 06:44PM emilybrooke wrote: Marnie - I checked out the links you posted. Thank you so much for that info. I am having a problem with heartburn 3-5 days out from treatment day. I am eating all the wrong foods! I printed the list and will be better for next week's treatment. Nat - I started physical therapy yesterday because I am not happy about my range of motion. Prior to bmx and lymph node removal I worked out 4-5 times each week. While strength training I was using 10 - 12 pound dumbells. After the surgery recovery time (6-8 weeks) my PS told me to limit my potential lymphedema arm to 5 pounds or less. Unfortunately, the physical therapist confirmed this info for me yesterday and said it is unlikely that I will ever lift weights heavier than 5 lbs again :( Another thing to add to the list of this this stupid disease has taken from me.",
      "MessageIndex": 733,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 12, 2012 12:33PM emilybrooke wrote: Road my onc told me that once I start Taxol (next Monday) I will probably only get the Neulasta shot for every other treatment. She explained that Taxol does not effect the WBC as much as AC did. I am definitely going to double check this info with her on Monday. My feelings are similar to yours - my onc said I had an \"Easy\" time with AC so the prospect of Taxol has my head imagining all kinds of crazy things. Susan I am not sure if I've mentioned this before - sorry chemobrain here- but you and I appear to be on the same treatment plan dose dense 4 AC , 4 Taxol with Herceptin every week for eight weeks of Taxol then switch to Herceptin every 3 weeks for the year. I went for my muga scan today in prep for Herceptin.",
      "MessageIndex": 954,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Oct 2, 2012 01:18PM emilybrooke wrote: Maddie agreed about the coughing and sneezing people around me. My sister gently scolded me because I do not have a poker face and the look of disgust I shoot people in public when they do not cover up is terrible. But too bad - eople need to cover up! Road and Susan did you have the Neulasta shot after your 2nd round of Taxol? I had my second round yesterday and Neulasta earlier today. I had it pretty easy after round one of Taxol but I think the neulasta is what really brings on the body pains for me. I had the radiation oncology appointment today. The doctor said that she is leaning towards no radiation for me: 1. the macroscopic (2.1mm) cancer cells in my sentinel are just above the cutoff of 2 mm. She said that the cells may have flattened after dissection when the pathologist put them on the slide under the microscope - weird explanation. 2. I had the double bmx, chemotherapy, herceptin for one year and tamoxifen for five years - I am doing everything possible so she thinks that should be enough. Factor working against me: my age  The radiation onc did not feel confortable comitting to no radiation w/o presenting my case to the Tumor Board (they really couldn't find a better name?) which meets in the middle of this month. I really thought I was going to get a definitive answer today and after being at the dr. office for three hours I wonder why I had to go in at all just to find out that I have to wait 2-3 weeks for an answer. Sorry for the mini vent - I too am tired of this =(",
      "MessageIndex": 1124,
      "PostDate": "02/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Oct 12, 2012 07:18AM emilybrooke wrote: Viginia - hope you have good news today! PAeagles - what a beautiful picture, thanks for sharing it! Susan - big hug to you Virginia- hubby and I missed the family vacation cruise this summer because of surgery/chemo. Your post reminded me that I better start looking forward to next summer and start thinking about where we want to go. So I heard from the radiation onc on Wednesday, hence my two day absence - and the 'Tumor Board' recommend that I have 28 days of radiation to my underarm area. The biggest factor in their decision: my age. I spoke to my breast surgeon yesterday and she explained that the rad onc contacted her and sher voted NO. She explained that because of my clear margins, I had a BMX, I will have 8 rounds of chemo, Tamoxifen for 5 years and Herceptin for 1 year that she felt confident that I didn't need radiation. I guess the rest of the voters felt differently. I am not sure what to do at this point. I know that once this area is radiated I can never have it there again, I worry about upping my chances of lymphedema, I know that the chances are low but I worry it could lead to some other cancer diagnosis. Finally, I know that 50% of patients go on to have problems with the reconsruction. I have a big decision to make. Just as I was beginning to see the light at the end of the tunnel - with two more treatments to go - this comes along to knock me back down --- oh, and my bloodwork yesterday showed that my liver enzymes are still elevated so now I'm just waiting for the onc to call and tell me that I probably will not be having treatment on Monday =( Grrrr.... thanking you ladies for letting me vent",
      "MessageIndex": 1200,
      "PostDate": "12/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jul 18, 2012 04:08PM emilybrooke wrote: Just reading some of the recent posts. I start my treatment on Monday and I am very anxious about it. I've been crying multiple times each day at the thought of starting this part of the journey. Your posts are making me feel a little better. I've also been jotting down your tips about managing the side effects. I am trying to find pre-tied scarves for when I lose my hair - any suggestions? I am so grateful for your posts and suggestions. Take care ladies!",
      "MessageIndex": 304,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jul 24, 2012 12:52PM emilybrooke wrote: Just checking in to say Hello Had my first chemo streatment yesterday - A/C and went for the Neulasta shot this afternoon. Yesterday I got home at 4, laid on the couch watching a movie, tried to eat and was shocked that just five hours after the infusion that my taste was gone. Hubby made me a peanutbutter, banana and choclate smoothie - that tasted pretty good. I hated the taste of even water last night but tried to keep drinking to flush it out of my system. I slept in 1.5 hour increments all night for a total of 12 hours. The whole night my body was weighted down by a dull pain. After moving around a bit this morning I started to feel better. I've been eating small meals all day and luckily no nausea. I hope to stay on the up and up - off to rest some more. I hope everyone is having a good week - thinking of you all!",
      "MessageIndex": 399,
      "PostDate": "24/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Nov 12, 2012 03:02AM emilybrooke wrote: Melanie - Hi and welcome to the board! I started seeing a therapist one month ago and also started a support group last month too. It has helped so much. I was very down during the treatments and now that treatment is over, I am experiencing a little anxiety about what \"normal\" is now. Mamabr - backlash? After the year you've had! :P on them. You deserve the R&R and time with the kids. Enjoy! Road - I participated in the Look Good program wwhile I was in the hospital for my surgery. The bag of goodies is awesome and actually turned me on to some products that I had never used before. I just wish I would have paid more attention to the application process - I am a total spaz when it comes to makeup.",
      "MessageIndex": 1390,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jul 30, 2012 05:40AM emilybrooke wrote: 25weeks - thank you for your spirit boosting message. Happy to report I got out of bed, ate breakfast and have plans today with my mother-in-law. We are going to pick up the wig that I ordered! This week will definitely be a better week =)  Ann - I see there have been a few posts about dose dense AC - it looks like we may be having a similar treatment plan. I have completed one round and received the Neulasta shot the day after.",
      "MessageIndex": 484,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 2, 2012 03:36PM emilybrooke wrote: Thanks PAeagles - I really thought I was nuts! donna - I would recommend having a friend or family member stay with you the first night. My husband kept a log of what I drank, what I ate and any SE I experienced to report to the nurse before the neulastsa shot the next day. He also helped me in and out of bed the first night when I needed it boobzilla - I'm having an emotional day especially over the idea of hair loss. Your post brought some happy tears on. Your friend is right We are defined by our heart, qualities and actions. Thank you for sharing, I will tuck that away for when I'm feeling down.",
      "MessageIndex": 545,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 7, 2012 10:40PM emilybrooke wrote: Ann - glad to hear that you are feeling better today. mamabr- I've been trying my best to make light of the hair situation too. Mainly because I am trying to make myself feel better about it. Short story, every week since surgery I have posted an inspiration quote on my facebook status so friends can follow my progress from surgery/chemo. Well this week I was planning on \"Hair today, gone tomorrow\" that did not go over well with my sister and mother-in-law. Neither cracked a smile - talk about awkward! Again, my small attempt to feel better about it or at least put on a brave face. Life - you go girl! Very impressed by your bravery =) Yesterday I had my second AC treatment and the nurse said \"It's week two - the big week aka hair loss\" I had a cropped bob as of yesterday morning. By 5 pm, I had Ginnifer Goodwin/Emma Watson's hairdo. Today i am experiencing some shedding. They let my cytoxin drip run 45 min instead of 30 min yesterday in hopes of preventing the headache I got last time - so far so good. I felt better today than I did the last day after the chemo. Had my shot at 1pm so I anticipate the pain/sleepiness to set in soon. Hopefully the claritin that I took will help.",
      "MessageIndex": 617,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 3, 2012 01:21AM emilybrooke wrote: Virginia - I just received three scarves from headcoversunlimited.com - love them! Beautiful assortment of prints and styles Boobzilla - my tastebuds were completely out of whack last week just days after the treatment. This week they have come back and I suppose next week they will be gone again =( Pinky - I am 9 days out from 1st treatment and I too have lost the hair shine and my texture is like straw",
      "MessageIndex": 557,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 12, 2012 06:06AM emilybrooke wrote: So last night I took the plunge...my head is shaved. Yesterday was a crazy emotional day leading up to it. But as many of you have said, I needed to take control. So at 10 p.m. last night, my sister-in-law who is a stylist, shaved my head and my brother-in-law followed suit. I cried a little but at the same time smiled because I took control. The best part was when my husband said \"Em, I'm not blowing smoke up your a** it looks really good.\" Just wanted to share my experience with you ladies and thank you again for all of your support! Ann - glad to hear that you are feeling a little better PAeagles - That has been one of my go to quotes over the last few weeks.",
      "MessageIndex": 658,
      "PostDate": "12/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 19, 2012 07:30PM emilybrooke wrote: Solantio - I too am having a tough time with the \"am I going to live\" piece of this disease. It's usually the worst on days 5-8 post treatment. I cry, I look up stupid statistics on the computer, I take care of things around the house that I can do for that \"just in case\" reason. It's so dumb. We are going to beat this, we just have to keep reminding each other of this. Ann - I laughed when I read your last post. I didn't beat the mattress but I did destroy a throw pillow about ten days ago. Sheer anger and self pity. Poor pillow didn't see it coming. I'm getting round 3 of AC tomorrow morning. It's an earlier appt. than the last two so let's see if the timing impacts my side effects. Hugs to everyone!",
      "MessageIndex": 751,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 25, 2012 07:24AM emilybrooke wrote: Jennifer - thank you so much for your post. I filled out the online app yesterday afternoon and they called me to verify my informtaion by 5 o'clock yesterday.  Thank you again!",
      "MessageIndex": 798,
      "PostDate": "25/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 13, 2012 06:30PM emilybrooke wrote: Nat - you are such a champ with your workouts. I was a fitness nut before this started and I really have to get back into something. I vow to walk this week while I am feeling good. Madelyn - I am so happy to see you back. I've felt a bit out of sorts these last few days and thought of you this morning. Susan - I had a bad headache after my first round. Then the nurses adjusted the drip time on the cytoxan - went from a 30 min drip to 45 mins for round two. This made a world of difference for me. Not sure what time frame you rec. meds on but it might be worth asking about. NDbc - I had problems with acne too. I read that it is from all the steroids that we are getting. My onc told me to use topical cream - not working! Started feeling more like myself yesterday, which took two days longer than it did after round one of AC. The emotions were out of control this last round too. I was a blubbering mess on Thursday and Friday. Hugs to everyone tonight =)",
      "MessageIndex": 680,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 20, 2012 03:15PM emilybrooke wrote: Thank you Madelyn for your post. It is definitely a reminder that in the end it will be okay and life will be normal again. As for the arms, you made me smile =) I know it may sound completely vain but I was proud of how I looked. I thought I was nuts with the heightened smell thing but I think your right PAeagles. Maybe it is making up for the tastebuds. I smell moisture in the house all the time, in particular the bathroom and laundry room, it smells dirty. My husband thinks I am crazy but now I can tell him that it is a side effect. And while the smell is present, at least I feel less crazy. I have to try some of this drinks that you ladies have suggested. This is the first time that water really is a problem for me. I had round three this morning and I am definitely dragging this afternoon. Plus, hubby is a little under the weather - scratchy throat. I asked the oncologist about it and she said to avoid him. I will be sleeping in the guest room tonight in case his germs have invaded our bed. Plus, I had my sister wipe down all surfaces and spray lysol.  ",
      "MessageIndex": 762,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 1, 2012 07:41AM emilybrooke wrote: I agree with the eyebrow/eyelash loss. I find it upseting because yo can cover your head with a wig/scarf. You cannot hide the eyebrows. I went to a class while I was in the hospital Look Good Feel Better and they had make-up artists help you with your beauty regiment. I hope I remember what they taught me! Roadwarrior thank you for the tip on the Osmosis product. I will be looking into to it. My DH wanted to shave his head with me but I asked him not to. I think I said it before, one baldy in the house is enough for me. Plus, his brother and my dad went ahead and shaved their heads to support me. Madelyn thank you once again for posting so much information on Taxol. I will have 4 rounds of Taxol every other week with Herceptin each week during my Taxol time. Then I will have Herceptin every three weeks for one year. My friend that just finished Taxol had a difficult time with the bone pain but said the side effects she experienced on AC went away during the Taxol treatment. As far as the down time, she was down about three days because of the pain but she did not experience the foggy feeling AC brings. My complexion is terrible! Some days I have welt-like pimples on my face. I am looking for a natural remedy but I really feel like between the steroids and the hormones there's no helping this right now =(",
      "MessageIndex": 859,
      "PostDate": "01/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 11, 2012 07:03AM emilybrooke wrote: Good Morning everyone - Life I am sending you the biggest {{HUG}} I can. I hope you allowed yourself to cry and that you are feeling better this morning. This disease does take a tremendous amount of energy, spirit, and hope out you at times but it cannot take away all that you have accomplished before it and all that you will do after it. You've been a huge support for so many of us, with the right words or advice and know we are behind you! About these menopause symptoms -I have some hot/cold flashes and I sweat occasionally at night. I'm 31 and going on 6 weeks w/o getting my period. I recall at one point the doctor saying that the drugs could put my body into menopause but I am unsure if this is what it actually occuring now. I will definitely be asking the onc about this later in the week when I see her to get my clearance to begin Taxol on Monday.",
      "MessageIndex": 940,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 5, 2012 11:55PM emilybrooke wrote: Had last round of AC yesterday and my shot today. So now, if it goes the same as the last three, the side effects should begin tomorrow. It took the nurses four attempts to get the IV into a vein yesterday...ouch! Of course this sent me into full blown anxiety mode but the rest went okay after that. I have to go for a heart scan next week before beginning Taxol and Herceptin on 9/17. I know that I am only halfway there but it sure feels good to be on the countdown side of the treatments. Congrats to you PAeagles, I am so happy that you are finished with chemo. Teeball I am sorry to hear that on top of BC that you have to deal with the car. But as you said, thank goodness your husband was not hurt. On another note, be sure to ask the onc about the green tea during Taxol. My doctor told me that I have to stop drinking it because it is such a diuretic (sp?) it can flush the drugs out to quickly. I don't mean to butt in but I thought it was worth mentioning to you.",
      "MessageIndex": 893,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 16, 2012 06:03PM emilybrooke wrote: Susan, I'm sorry you didn't get the news you wanted to hear. I'm sending a {{{HUHG}}} to you. Mssunshine, I started experiencing the runny nose and icky eyes after the last round of AC. Well I've got my lunch put together, my bag packed, and just finished putting on a second coat of Orly Nail Defense - I'm as ready as I can be for my first round of Taxol tomorrow. I'll be back to report on it soon. Until then, get lots of rest and minimal side effects to all.",
      "MessageIndex": 987,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 7, 2012 08:48AM emilybrooke wrote: Congrats Cyano - so happy to see someone else finishing up their treatment! I agree with Ann it will be such a monumental day when we are all finished with our treatments.",
      "MessageIndex": 910,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 21, 2012 06:23AM emilybrooke wrote:",
      "MessageIndex": 1049,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Oct 9, 2012 06:54PM emilybrooke wrote: I've been absent for a few days. I have really been trying to find a young women's support group or one-on-one counselor to talk to and had nearly given up. After last week's \"Yes/No - I'm sending your case to the Tumor Board\" meeting with the radiation oncologist I definitely visited my dark place. Add to that more Pink Sh*t everywhere and several people saying \"You're still doing chemo?\" My external reply - a nod. My internal reply - Absolutely, isn't everyone trying it, dumbass? Yep, it's been a rough few days. Today I heard back from both a support group leader and a therapist. I am looking forward to attending sessions with both in the coming week. Life I am so sorry to hear that you and your boyfriend have split up. I've said it before and I'll say it again - You are so strong - while it hurts right now, it may be for the best, especially if he cannot give you all the love that you most certainly deserve. City I loved your article. What a terrific story and so brave of you to share. I agree that writing helps you heal. I've written a little since this began too. Ann hugs, hugs, hugs - I know it is extremely difficult to be positive but boobzilla is on to something, positive thoughts will help with your healing Boobzilla your honesty helps so many of us put things in perspective - thank you! I really hope your brother stops worry about how he's dealing with this and starts focusing more on you. I hope everyone is having a good night. Hopefully, I hear from the radiation onc after the committee meets tomorrow to discuss my case. I will definitely post any updates. Plus, I have a check-up with the plastic surgeon on Thursday.  ",
      "MessageIndex": 1174,
      "PostDate": "09/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Oct 14, 2012 05:38AM emilybrooke wrote: Terrific news Virginia!",
      "MessageIndex": 1214,
      "PostDate": "14/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Nov 21, 2012 01:49PM emilybrooke wrote: Congrats Madelyn and teeballmom!!! Susan - I had the tissue expander placed so I'm not sure how much advice I can offer. I agree, comfy button down pjs are important. Then, lots of rest. They will give you pain meds and tell you to take them before the pain gets too bad. The doctor should provide you with exercises to perform so that your shoulders do not lock/muscles get too tight. I did not drive for 5 weeks. Finally, I'm sending a big HUG to you. I returned to work this week - thank goodness for 4 day weekends - I am exhausted. What a welcome back I received though! The students tied ribbons in the fence that spelled out my name with a heart, my classroom finally got painted (after 3 years of requests) and hubby sent me flowers at work (never happened in the 10 years I've been there). Happy Thanksgiving to everyone - I am very grateful to have all of you in my life!",
      "MessageIndex": 1440,
      "PostDate": "21/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Nov 25, 2012 06:34PM emilybrooke wrote: Marianne - I had the following side effects while on AC: body aches (possibly from neulasta shot), fatigue, sore gums, depression (not only from this whole experience but the steroids did a number on my emotions), and headaches. Maddie - I am scheduled for my \"exchange\" surgery on Dec. 10th. Two weeks from tomorrow! I am looking forward to getting rid of the TE's. Plus, I see the surgery as a one step closer to the finish line, even though I still have Herceptin for the next year.",
      "MessageIndex": 1466,
      "PostDate": "25/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Nov 9, 2012 04:47PM emilybrooke wrote: Life - that's terrific news about your essay, congrats! Susan - I am glad that you took a few days to think and you are 'at peace' with your decision Today makes 9 days post chemo for me. I had Herceptin on Wednesday and now I do not go back until the Monday after Thanksgiving. It is certainly a strange feeling to not have one single doctor's appt next week. In an attempt to feel normal I called my principal this morning to let her know that I will be returning to work on Monday, 11/19. I'll work for three weeks and then go out on leave again for the exchange surgery on 12/10. In radiation news, I met with the rads onc again after obtaining a second and third opinion. It appears that with all the pieces of my puzzle - age, hist grade, double mastectomy, sentinel node involvement (1), chemo, Herceptin, Tamoxifen - that my chances of recurrence are approx. 10% The radiation will lower the chance of local recurrence by 2% but will not impact other recurrence rates. My rad onc and med onc say that rads or no rads will be considered a reasonable choice for me to make. That being said, I am leaning more towards no rads for me. My hubby has been encouraging me to make a decision before I return to work so that I can stop losing sleep over this and try to \"feel normal\" again.",
      "MessageIndex": 1365,
      "PostDate": "09/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Nov 9, 2012 08:35PM emilybrooke wrote: Road - that's amazing news- Congrats!",
      "MessageIndex": 1371,
      "PostDate": "09/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Nov 30, 2012 06:41PM emilybrooke wrote: Hi Ladies - I am very sorry to hear about the difficulties some are facing - Susan, hang in there you're a strong woman Nat - You're in my thoughts and I hope everything turns out okay  this was my first full week back at work. The kids are definitely testing my patience and I am exhausted. One more full week and then I will be out again for my exchange surgery.",
      "MessageIndex": 1491,
      "PostDate": "30/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Feb 2, 2013 03:51AM emilybrooke wrote: Susan glad to see you on the boards but sorry to hear about the bone pain. I hope it passes quickly. Madelyn I noticed the swelling on 12/23, which was only 13 days post reconstruction, didn't think too much of it until I noticed that it wasn't going away. I don't recall doing anything to aggrevate it. The second specialist thinks that I already had a 'fragile' lymph system and the surgery just sent it over the edge - I don't know about that. I agree with you, thanks to Mamabr - teachers appreciate your support.  My students have gotten a little bit better but they still have their days. The older kids, who understand what I've been through are very sweet and supportive. Many of them pop by my room to see how I am on a regular basis. My current students are floored that I am so 'popular' Maddie it certainly will be a fashion statement ;) I'll rock it when I have to. Nat happy to hear the port is out. I am sure you are more comfortable already! My sense of smell has been heightened ever since the AC treatment. My husband thinks I'm nuts sometimes.",
      "MessageIndex": 1659,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Dec 14, 2012 07:13AM emilybrooke wrote: Susan - I am happy to hear that surgery went well. I've been thinking about you this week! Maddie - love the poem, it made me cry, good tears though Congrats Mamabr and Pinky ! I have beenachey from the exchange surgery but far more comfortable than the previous surgery. In fact, I am down from 4  to two pain pills each day. I am waiting to hear if I can take advil or motrin instead of tylenol. My armpits are a bit sore from the drain placement but luckily they are scheduled to be removed on Tuesday afternoon. I am by far more exhausted after this surgery but the dr. said this would happen because I only finished chemo 6 weeks ago and my body os still healing from that. My internal thermostat seemed to settle down for a few nights post-surgery but was back in full furnace effect last night - covers on, covers off, etc. The hair on my head seems to have had a growth spurt this week too. I look forward to starting biotin next week - my doctor kept me off of all vitamins pre-surgery. My eyebrows are starting to show some sign of regrowth but no progress on my spotty eyelashes. It will  come with time.  ",
      "MessageIndex": 1536,
      "PostDate": "14/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Dec 19, 2012 07:13AM emilybrooke wrote: Susan - Congrats, this is great news! I agree with Madelyn there is a sadness that comes with ending chemo. Sadly, it becomes such a \"normal\" part of our routine that you worry once it is over. I finished on 10/31 and the feelings lasted until after my 11/26 Herceptin treatment. I went for Herceptin again on 12/17 and as I sat there I got a little emotional thinking about how far I (and we) have come. I just so happened to get the same chair that I had for the first round of AC (in July) and I think that had something to do with the emotions. Again, it reminded me of how strong we all are and how I could not have gotten this far without all of the support each of you have provided. mss very happy to hear that you are BRCA negative and that the MRI came back clear. You certainly have alot to celebrate! I had my surgical drains removed yesterday - YAY - I feel liberated! Now I must wear a supportive surgical bra (oh so sexy) for 24/7 over the next six weeks. Took my first look (straight on in the mirror) yesterday. Still swollen but looking okay - for what they are.",
      "MessageIndex": 1549,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jan 25, 2013 04:44PM emilybrooke wrote: Hi Ladies - I had a lot of catching up to do before posting. I returned to work last Tuesday and have been exhausted when I get home each night. The kids have been a little out of hand but seem to be settling down now that they've realized that they are stuck with me for the next six months ;) Last time I posted I shared that the LE specialist that I saw was not going to treat me. Well since then I saw my oncologist and she did not like the looks of my hand and sent me to the LE specialist within MSKCC. Initially I tried to get an appt with her but it takes weeks to get one so I went to this other doctor that I had heard good things about. Anyway, so I saw the MSK specialist on Monday and she was floored to hear that the other woman said I do not need to be treated for lymphedema. She was very concerned about the swelling in my hand and said that the swelling next to my armpit may be the onset of mild LE too.  I will be treated for it from Feb. 11-15th. She has given me 20 exercises to do each day and already ordered me a glove and sleeve. Plus, she got on me about my posture and wants me to try one of those bras that pulls my shoulders back. She said, \"why are you rounding your shoulders like you are trying to potect your chest?\" Gee, I don't know b/c I am six months post BMX and not feeling too good about myself...  I told her to slow down and we'll deal with the LE first and my posture later. The deal is I have to go everyday for one week, two hours each afternoon, for LE massage/drainage and wrapping. I am pissed... but there's nothing I can do about it so I need to put my big girl pants on.  The specialist wants to manage what it already present to make sure that it does not get any worse. On the bright side, at least it is not the 4 week regiment that the first specialist discussed with me. Ok, vent over. Thank you for listening. Facial Hair - where do I start? First let me say that I am lucky, mine is very blonde. I asked my onc. nurse about it and she said it is absolutely related to chemopause and referred to it as - and I am not kidding - Monkey Face.  I will be using wax strips on my \"monkey face\" this weekend.  A colleague told me that when she waxed hers off that it never grew back.  Fingers crossed I have similar luck. Congrats to all that have crossed the rads finish line! All of the women on this board continue to amaze me! Ann, I know it was not the best news to hear but over time you will definitely begin to feel better about it if you should choose to have the mastectomy. Susan, I think of you often and pray that you are doing well.",
      "MessageIndex": 1640,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jul 17, 2012 07:01PM emilybrooke wrote: Hi Ladies - Is there room for one more? I had my BMX on 6/20 and will be starting chemotherapy on Monday, 7/23. My treatment plan is: 4 rounds of A/C every 2 weeks followed by 4 rounds of Taxol every two weeks. During the Taxol treatment I will receive Herceptin every week for eights weeks. After treatment I will have Herceptin every three weeks and Tamoxifen for 5 years. I am very nervous about this next step. I've been reading the posts in this forum and have found them to be helpful and reassuring at times. Thank you for this forum and i look forward to chatting with everyone.",
      "MessageIndex": 281,
      "PostDate": "17/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jul 18, 2012 07:29PM emilybrooke wrote: Questions about products to buy: Is one type of Biotene toothpaste better than the other? Mint Gel or PFB Plaque dissolving? Should I purchase any other Biotene products besides the toothpaste and mouth rinse?",
      "MessageIndex": 311,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jul 18, 2012 08:51PM emilybrooke wrote: Thanks for the recommendations Road and Madelyn!",
      "MessageIndex": 317,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jul 29, 2012 10:00AM emilybrooke wrote: Hi Ladies - I too had a bout with depression this week which worries me because I only had my first AC treatment on Monday, 7/23. According to the nurses, I had minimal side effects so I count myself lucky but I am nervous about round 2. Wednesday-Friday I was a hot sobbing mess - completely inconsolable. My sister stepped in and reminded me about how strong I was through the diagnosis, BMX and recovery. I guess there are going to be ups and downs through this experience. At times, it is so hard to remember that this will end and I - WE - will be okay. I suppose the best thing to do is enjoy all the days that I feel good between treatments and be social! City - love the pictures! I hope I can be so brave next week when my hair time comes. Boobzilla - crazy ER experience - so glad you are okay =) teeball - glad to see you back Welcome to the all the new names and faces!",
      "MessageIndex": 469,
      "PostDate": "29/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 1, 2012 09:48PM emilybrooke wrote: teeballmom and boobzilla - great posts today - I have been thinking about going to talk to someone about my feelings and your posts are definitely reinforcing that idea. City - I go for my second round of AC on Monday and the injection nurse told me the same thing about my SE for the first round should be what sets the stage for the remaining rounds. Similarly, I plan to learn from last week's experience. I wrote down most of what I ate, drank and experienced last week as a reminder for next week. I also wrote about how good I feel this week as a reminder for myself when I feel like crap next week. Question about hair loss - I am nine days out from my first treatment and I feel like the texture of my hair has changed. Am I imagining this?  Anyone else have a similar experience?",
      "MessageIndex": 535,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 6, 2012 03:58AM emilybrooke wrote: Going for my second round of AC tomorrow at noon. Hoping that the SEs are similar if not better than I experienced in round one. My scalp is starting to feel a little different in some places but no major changes as of yet. I just keeping waiting for it to happen. I hope everyone had a good weekend and I wish minimal SEs for everyone this week.",
      "MessageIndex": 600,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 16, 2012 04:25AM emilybrooke wrote: Oh my, the boards were busy yesterday and I feel like I missed alot. Life- your DB sounds like a terrific man. You have been such a positive inspiration to everyone on the boards. I know that things are going to be okay for you. PAeagles - a car accident, seriously? I really hope that you are feeling well today and you are not too sore. Nat - I had a red face three days after my first treatment and the doctor said it was from the steroids. Cyano - the shot definitely helps. After my last round I asked about my wbc and was shocked to hear it was so high. Then the nurse explained how much the shot can increase the count and it all made sense. My hair ---I shared that I buzzed it on Saturday. Now it is beginning to look patchy as the stubbles fall out. I have been wearing scarves with fedoras since Sunday. Funny, I always wanted to wear a fedora, NEVER had the guts/confidence to do it. Now it's all I wear. I tried to wear the scarf alone on Monday and boy did I feel self-conscious. I need to work on that. I wore my wig out to dinner last night with the girls. Again, felt self-conscious, like everyone knew I was wearing it. Anyway, by the end of the night I was relieved to take it off because it was definitely getting itchy. Hope today is a good one for all of you - Hugs!",
      "MessageIndex": 720,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 22, 2012 11:11AM emilybrooke wrote: Hugs to you, Ann.",
      "MessageIndex": 770,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 24, 2012 06:05AM emilybrooke wrote: Hugs from one emotional woman (yeah - that's me) to all of you ladies today. It seems like the Friday after treatment is always the worst in terms of emotions. I went to physical therapy yesterday and she had me do some arm exercises. Today I am sore and had a total meltdown over how physically weak I am. All right I've put it out there, now I will try to let it go for the day and attempt to feel better.",
      "MessageIndex": 792,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 30, 2012 07:55AM emilybrooke wrote: Thank you boobzilla for your uplifting post.  This week, the good week,  I have done just that...trying to get back into a physical fitness routine with walking and light pilates, small errands, and had lunch with friends two women from work on the BC train as well. Seeing them was so helpful as one is 1.5 years out (36 yrs old) and the other is about 3 months ahead of me (45 years old). She just finished Taxol three weeks ago, has her exchange scheduled next month and returns to work on Tuesday. She is definintely a huge inspiration in my life - actually she has always been! I started my job as an English teacher ten years ago and she has been a mentor from the start which makes it even crazier that we are going through this together. Life - thinking of you and look forward to hearing more about the illustrations. Susan - I'm with you - a year from now when this is behind us we should meet up! Madelyn - You've been such a big help thus far that I am also looking to you for info and guidance during the next step with Taxol. I hope everyone is having a good day today. I'm heading out now for some more physical therapy =)",
      "MessageIndex": 840,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 14, 2012 02:32PM emilybrooke wrote:",
      "MessageIndex": 970,
      "PostDate": "14/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 19, 2012 01:22PM emilybrooke wrote: I am two days out from my first Taxol and Herceptin treatment. The nurses explained that since I had both on the same day it might be difficult to differentiate the SEs for each one. They gave me steroids, benadryl, and pepcid drips before starting the Taxol. Taxol was a three hour infusion and the herceptin was 1.5 hours. They explained that the first round of Herceptin is the longest and each one after will be 30 min. I was there for 6.5 hours on Monday. So far I am experiencing some dull aches in joints that I typically have problems with - my right ankle, my right shoulder and my knee. I had a bit of pain in my sternum earlier today but it seems to have faded. My onc is only giving me the Neulasta after the second round of Taxol which has me a bit concerned. I am not missing the side effects that I had from the shot but I also want to protect myself from germs.",
      "MessageIndex": 1016,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 28, 2012 06:19PM emilybrooke wrote: mssunshine - I am on the same 4 rounds Taxol with Herceptin then Herceptin every three weeks for one year. I am also getting Herceptin on the week that I do not get the Taxol. So I will have 8 herceptin by the time the Taxol ends at the beginning of November. Madelyn - I agree about being more in control of my diet these last two weeks. During AC I was a bagel maniac for 5 days and then the week between treatments I tried to eat as many vegetables/fruits and grilled chicken as I could stand. I am finally beginning to crave vegetables again and plan to make white bean & kale soup this weekend before my next round of Taxol Life so glad to hear that your sweetie is back home with you and lifting your spirits! I am scheduled to see the radiation oncologist on Tuesday afternoon. I am already having anxiety about this appointment. Sorry, about to vent a little - when I was diagnosed in May the surgeon was leaning towards a lumpectomy. I said NO I wanted the double bmx to make sure it was all gone. After surgery she hit me with the chemo news, then two weeks later the HER2/herceptin news. I just hope that maybe I can catch a little bit a of break on this one and not need the radiation. But in the pit of my stomache I feel like they will want me to have it because I am young and they want to take every precaution possible - okay vent over thank you for listening to me. Hugs to all and a good weekend too!",
      "MessageIndex": 1102,
      "PostDate": "28/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Oct 16, 2012 09:19AM emilybrooke wrote: Had my 3rd round of Taxol yesterday and 5th round of Herceptin with it. No Neulasta shot for me this go around - thank goodness because last time it kicked my butt. Met with oncologist yesterday who was very surprised to heard that I am leaning towards no rads - against the recommendation of the board. SHe encouraged me to get a second opinion before committing to this choice. I asked a lot of questions regarding stats about my staging, lymph node involvement and chance of recurrence if I choose to do rads vs. not and sadly she was unable to provide any. This upset me because I've looked for studies on Sloan Kettering's site, Johns Hopkins, and MD Anderson - having little luck I thought that my oncologist of all people might be able to provide this. So I will be looking for a doctor to get a second opinion and still awiting news from my breast surgeon who requested that the pathology dept re-examine my slides. In other news, I started one-on-one counseling last week. Having never done this before, I found it very interesting and look forward to this week's appt. Tonight, I will be attending a support group meeting which meets twice each month - once for group discussion the second time for meditation/guided imagery and then reiki. I will you know how it goes. Susan - please try not use your new gift on anyone no matter what dumbass comments comes flying out of their mouth. I'm not sure they'll let you use the chatboards from prison ;)",
      "MessageIndex": 1227,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Oct 22, 2012 06:38PM emilybrooke wrote: Congratulations itsalltemporary and roadwarrior! stride - I too am sending you a big HUG right now. Just confirmed my last round of Taxol - 10/29 Definitely getting excited about the last round. Still awaiting more info on the radiation front - no one has been able to produce any stats or studies for me to read. I have a follow-up with radiation onc on 11/2 so I will have to make a decision by then.",
      "MessageIndex": 1262,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Nov 13, 2012 03:01AM emilybrooke wrote: Life - I just finished reading some of your midlife posts - Amazing! I really enjoyed reading them. Melanie - Thanks! I have actually decided to go in to work for a few hours this Thursday in order to get my photocopies ready and get some materials to plan from home. Maddie - Thanks for following up with me. I decided against the radiation. After speaking with my oncologist (again) she helped me understand the statistics more. For the small percentage (2%) that it is going to lower my chances of local recurrence, I have opted against it. I will continue the Herceptin for 1 year and Tamoxifen for 5 years.",
      "MessageIndex": 1405,
      "PostDate": "13/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Nov 16, 2012 03:07PM emilybrooke wrote: Stride - happy to hear the surgery went well! Today is the last day of my medical leave from work. I'm excited to meet my students on Monday!",
      "MessageIndex": 1411,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Dec 11, 2012 08:24AM emilybrooke wrote: Hi Ladies, Just checking in quickly... I had my exchange surgery yesterday morning. I was in the OR by 9, recovery by 11, leaving the hospital by 1:30 and resting at home by 3 pm. The pain is present but not nearly what it was after the BMX. i am sticking to the pain meds once every four hours. The doctor provided enough for now through Thursday. I have my post-op appt next Tuesday where I hope they will be able to remove the two drains that I have in place. I haven't looked at them yet but my sister (the nurse) is coming over to help me change the gauze in a bit. I imagine they won't look so good for a while with the swelling and all. I hope all is well for each of you!",
      "MessageIndex": 1517,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jan 6, 2013 02:47PM emilybrooke wrote: Madelyn, I was also hoping that it was the excessive eating I was doing. But I've been eating much better and still some swelling. Maddie, I still have a few aches and pains but overall the new breasts are settling in.  I will be 4 weeks post-exchange tomorrow and looking forward to swapping the post surgical bras for something a little more comfortable. If I am not mistaken, your exchange is coming up at the end of this week, right? My physical therapist taped my swollen hand earlier this week and repeated it yesterday. It seems to have brought down some of the swelling (in the web between thumb and pointer finger). My right thumb is still swollen and a little tender but certainly feeling better than it was. According to hubby, my hair is growing at rapid speed. I think it's growing at a fair pace. Similar to what itsalltemporary said, my eyebrows are back and I even had to get them threaded this week to give them shape - highlight of my week ;) The lashes are coming in too.",
      "MessageIndex": 1592,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jan 10, 2013 09:38PM emilybrooke wrote: Susan, I am so sorry to hear what has happened to you. I hope that this message finds you with things sorted out in Albuquerque and physically feeling a little bit better. \"Have not been having sex with pirates\" - sent me over the edge. Hopefully, this is the last bit of trouble you will have on your road to recovery. As far as the hair goes, I too seem to be having  male balding pattern going on. It is growing in a dark shade of dirty blonde, it looks gray at times though. I have a little bit of an Eddie Munster vampire like hairline going for me. There's hair there just not nearly as much as the rest of my head. I am sending you a big [[HUG]]",
      "MessageIndex": 1596,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jan 10, 2013 09:40PM emilybrooke wrote: I saw the LE therapist today. Both doctor and therapist do not believe that it is LE - woohoo! So they will not treat me for it. That being said, they do not understand why I am having this swelling. They said it could be signs that I am more suseptible to LE in the future. They want to monitor it and allow me to continue physichal therapy. I need to be a better patient and allow my hand/arm time to rest when it needs it. The swelling has gone down a bit since Tuesday which makes me very happy.",
      "MessageIndex": 1597,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Aug 14, 2012 04:00PM emilybrooke wrote: Maddy - here's a big hug for you {{{HUG}}} Anyone having trouble with their gums? I feel like mine are receeding on the bottom front teeth. I brush very carefully with a soft toothbrush and biotene. Then I rinse with either the baking soda mix or the biotene rinse.",
      "MessageIndex": 687,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 4, 2012 01:50PM emilybrooke wrote: Good morning ladies, I hope everyone had a good weekend. I'm heading out for round 4 of AC this morning. This will be the last of the AC - thank goodness. Then the plan is to start Taxol in two weeks. I am happy to be getting this part of the treatment over with. After today I will be halfway through chemotherapy - something else to be grateful about. Wishing everyone minimal SEs this week and a good day!",
      "MessageIndex": 883,
      "PostDate": "04/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Sep 27, 2012 07:08AM emilybrooke wrote: This week is my \"week off\" from chemo and I have been keeping busy with a bunch of different things. Thank you you noticing my absence Susan fortunately I am okay! I am working on the t-shirt orders for my friends and family the upcoming Making Strides walk at a beach near our house on 10/21. I'm also working on a pie/cheesecake fundraiser for Thanksgiving that the senior class at my high school runs each year. This year I am the grade co-advisor and I feel bad that I am out on leave missing so many events this fall. I've been going to physical therapy and also trying to up the ante on my exercise routine. I have been trying to walk every single day and have only missed three days since last Monday's treatment. But I also need to start incorporating some lower body training - like squats and lunges - because my legs are definitely feeling a little jiggly. Soltantio you are so right about eating right for our long term prognosis. It was hard to eat the right things during the AC treatments but I am trying to find my way back to fruits and vegetables now that I am on Taxol. I plan to ask my onc about what I can/cannot take. Thanks for the reminder!",
      "MessageIndex": 1090,
      "PostDate": "27/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Oct 3, 2012 05:37PM emilybrooke wrote: Road I think I am feeling the difference that you described between the Taxol and Neulasta effects. The Taxol is definitely in my legs while the Neulasta is all lower back. Susan will they doc let you have the Taxol this week if your counts go up or do you have to wait for another cycle of it? My liver enzymes are elevated right now (2 days post Taxol 2). I have bloodwork scheduled for next Thursday to see if I can have round 3 of Taxol on 10/15. I have been an emotional disaster for the last 24 hours. I did not have this problem after round 1 of Taxol. I think BC awareness month set it off. It's like every commercial, every newspaper, and every magazine is about BC - can't escape it. It's going to be a very long month if this keeps up.",
      "MessageIndex": 1139,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Oct 17, 2012 07:19AM emilybrooke wrote: Virginia - yes, it is because of my age. The doctors want to be sure that nothing is lingering. However, I thought that was what the chemotherapy was for. I am still awaiting the re-read of my path slides and have started looking for rad onc outside of the hospital I am with for additional opinions.",
      "MessageIndex": 1230,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Oct 20, 2012 03:31PM emilybrooke wrote: PAeagles - I agree, good analogy. I have a bit of stubble on my head too. Plus, knock on wood, I haven't lost all of my brows or lashes from Taxol. One more round to go one week from Monday.",
      "MessageIndex": 1248,
      "PostDate": "20/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Oct 25, 2012 05:39PM emilybrooke wrote: I too watched Guiliana and Bill - even before her diagnosis I was a huge fan of them as a couple and the show. I was disappointed at how it was portrayed as well. Before my diagnosis in May I was so back logged on my magazine subscriptions due to grading from work that I missed three issues of Glamour. The day we went to the plastic surgeon for the presurgical appt. I picked up the March issue and started leafing through it on the train into Manhattan. BAM - Guiliana and Bill - six pages of pictures and their story as they went through the journey as a couple. The article definitely showed more emotions than the show did. So I sat there crying on the train, my husband not knowing what the hell hit me.  He went on to read the article that night and felt like he \"got it\" after reading it. Nat I'm sorry to hear about the onset of lymphedema. Binney's post seems on the right track. My PT explained that seeing a specialist as soon as you begin to see the effects can definitely help/lessen the swelling and/or immobility of the arm. Life I'm happy that the paperwork finally went through for you. Your sister will be in my prayers. I am going in to work tomorrow for a bit. Not to actually work  but because I am co-advisor to this year's senior class. As a tradition, they take an aerial view shot of the kids for their yearbook with the class advisors in the front. I emailed my principal to see if it is okay if I come in for the photo and fortunately she said yes. I feel bad because I have missed so many important events for the students this year. Plus, my co-advisor is working her butt off and doing the job of two right now. I have been trying to coordinate many of the events and fundraisers from home but there is only so much that I can do.  Plus, I plan to speak to my leave replacement to find out where she will be leaving off and I will be picking up. As long as the onc says it is okay, I plan to return to work on Nov. 15 - 2.5 weeks post chemo - work for three weeks and then go out on leave again for the reconstruction exchange surgery.",
      "MessageIndex": 1289,
      "PostDate": "25/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Oct 28, 2012 12:47PM emilybrooke wrote: Roadwarrior - Congratulations to you! I am curious to hear what the radiation oncologist says during the consult but hoping that as you said, it's nothing more than a conversation saying 'No rads' Please keep us posted as I am still awaiting more info about whether or not I should do the rads Susan - I am glad the event was such a sucess but sorry to hear that you still aren't doing well with the side effects. Any east coast dwellers around here besides myself and City?  This Hurricane Sandy / \"Frankenstorm\" is quite the story in NY. It's supposed to make landfall sometime tomorrow. While I am concerned about everyone's safety there is part of me that is saying: \"Hey Hurricane Sandy, B*tch, maybe you haven't heard but I am scheduled to have my last Taxol treatment tomorrow. If you go screwing this up for me...\" Okay, I vented about the storm. Fingers crossed it is safe enough to go for treatment in the morning.",
      "MessageIndex": 1296,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Nov 1, 2012 08:42AM emilybrooke wrote: Unfortunately, Hurricane Sandy delayed my last Taxol treatment for a few days. Instead of having it Monday, I had it yesterday.  The treatment center was packed as they were trying to get all of the cancellations from Monday and Tuesday accomodated in one day. Many people were unable to get in, including their nurses.  The building was running on generators and had limited electricity but the nurses were calm the entire time and everyone was extra nice to one another. Since I rec'd Herceptin yesterday after the Taxol, my Herceptin schedule has changed a bit and instead of being a \"Monday patient\" I have been switched to Wednesdays. After next week's Herceptin I will not go back until after Thanksgiving. I expected the last round to bring lots of excitement and positive feelings but with everything that is happening here on Long Island I was like \"ok, it's over.\" I hope to have more of a celebration after things settle down around here. I have the follow-up appt with the radiation onc tomorrow to ask a few more questions before making my decision.  Last week I went for 2nd and 3rd opinions outside of the hospital network I am in and both doctors said that if I were their patient they would not be treating me with radiation because the cells in the sentinel node were microscopic and they were more concerned that the long term effects of rads might outweigh the treatment.  As I said, I am bringing these concerns, more questions, and more to the doctor tomorrow. Our house has been without power since 3 pm on Monday. Fortunately, husband's best friend never lost his power (by some miracle) and he was more than happy to take us in. So I plan to rest on his couch, instead of my own, while I recuperate from this last round of Taxol.",
      "MessageIndex": 1317,
      "PostDate": "01/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Nov 3, 2012 07:19AM emilybrooke wrote: Thrilled to be back in a house with power this morning. It came back late last night. My sister's boyfriend, also hubby's best friend, took us in all week after the hurricane. Nat - school was canceled all week and still waiting to hear what this week brings. My principal reported that the building was not damaged but many of the surrounding streets had some big issues preventing people from getting to the building. Life - CONGRATS! I am so happy that you finished! As so many have pointed out, sisters are such a gift in life. I don't how I would have gotten through this if I didn't have my sister. Since I've been away from work, my husband has spent a great deal of time at his job and my sister took me to every single chemo treatment. I continue to pray for your sister. Susan - I am also sending you a big hug and positive energy.",
      "MessageIndex": 1336,
      "PostDate": "03/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Nov 12, 2012 03:57PM - edited Nov 12, 2012 03:57PM by emilybrooke Melanie - I did not work during the treatment. I am a middle/high school English teacher. I was diagnosed in May, surgery in June, and started treatment in July. I have missed 2.5 months of work and will be returning next week, which is 2.5 weeks post chemo. I am going to work for 3 weeks before I go out on leave again for my exchange surgery. Then, I hope to return to work by mid-January. I elected not to work because I was fearful of the kids' germs. Thankfully, I had enough sick days banked to use so I did not have to go without pay - such a blessing.  I am still concerned about the germs but I need to feel a little normal which is why I am going back for what I am calling a \"limited engagement\"",
      "MessageIndex": 1394,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Dec 7, 2012 02:11PM emilybrooke wrote: Terrific news, Nat I am so happy to hear it!",
      "MessageIndex": 1511,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jan 2, 2013 02:44PM emilybrooke wrote: Happy New Year Ladies - Still recuperating from the exchange surgery. I think I over did it a little during the holidays because my right hand, near my thumb, is slightly swollen. My BS said it could be residual swelling from surgery but it could also be mild lymphedema. I am awaiting an appt with the lymphedema specialist. It has been the same size for a few days now. Fingers crossed it will be okay. Had my 6 month check-up last Thursday. The breast surgeon said \"It's all over now. This is behind you.\" Good words to hear, made me breakdown right there in her office.",
      "MessageIndex": 1577,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "emilybrooke…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155727/profile",
      "Content": "Jul 14, 2012 06:27AM emilybrooke wrote: Thank you Badger!",
      "MessageIndex": 911,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    }
  ]
}