{
  "AuthorID": "Emilylaughe…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
  "Posts": [
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Aug 8, 2016 08:55AM Emilylaughed wrote: So. It's been a bit of time, but we got the news last week that her swelling is actually due to cancer, not just lymphedema. She started getting small red bumps that were finally biopsied, resulting in a positive screen for cancer. Her disease is slow and degenerative, but at the moment it is feeling fast. She has swelling all through her body—her trunk, around her organs and lungs, and it started today in one of her legs. (The leg isn't too bad yet.) I'm sitting beside her as she finally sleeps, listening to her breathe and wheeze and wishing that things were somehow different than they are. At least we have our answer as to why the swelling wouldn't go down; it turns out it was cancer and not just lymph fluid that keep multiplying. I thought that cancer tended to make people thinner, but with my mom it is plumping her back up. All of the swelling is causing stress on her organs, and it's all gotten very, very complicated. She's working on being enrolled in a clinical trial for an oral chemo and new hormone that should work together to give her some more time. Beyond that, we might try a few rounds of taxol (she was on taxotere already, so that might not work as effectively as they would like). The doctors insist that she still has life left in her. But not knowing what to do to make her more comfortable or to make this easier or to fix her is infuriating and heartbreaking. Anyhow. Just logging in to update with sad news. Thank you all for your continued support. I'm going to allow her to sleep, but continue pondering if I should wake her to get her to a hospital. I just can't stand considering waking her when she's finally sleeping after an uncomfortable few days of her not sleeping.",
      "MessageIndex": 11,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845724",
      "Title": "Swelling just not going down Emilylaughed Binney4"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Aug 8, 2016 11:07AM Emilylaughed wrote: I should also mention: she got the flexitouch pump and it was working WONDERS on her arm. But then we had to stop using it because she was diagnosed with chronic cancer--and the depth of that massage can push cancer cells into other organs at a faster rate, so it's off the table. But had this only been lymphedema, that would have worked wonders!",
      "MessageIndex": 15,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845724",
      "Title": "Swelling just not going down Emilylaughed Binney4"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Jul 7, 2016 10:28AM - edited Jul 7, 2016 10:29AM by Emilylaughed thank you so much for the kind response, floaton! I've been reading a lot about water therapy and it is good to hear that it has worked for you. We were on our way toward controlling it and it is just so frustrating to figure out how to get this right. I am hoping that once she starts doing the extra PT we may actually be on our way again. I just feel so bad for her! She is on oral chemo right now (nothing detectable, but after a recurrence to her belly fat, potential lymph involvement on the second side and a cancerous pleural effusion, we are being proactive. So at least we don't have infusions to deal with...but the constant tick of taking a pill each day wears her down just as much We both really appreciate you taking a moment to share your experience. That is what has been getting us through optimistically... Because not much else seems to. ❤️",
      "MessageIndex": 2,
      "PostDate": "07/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845724",
      "Title": "Swelling just not going down Emilylaughed Binney4"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Jul 8, 2016 10:50AM Emilylaughed wrote: Really and truly, bless you all. Each story that I read her that echoes some truth from someone else's experience is this flicker of light in what is continuing to be just a really dark place. The cancer never got her down this much. But the pain in her arm is enough that I just want to find her some kind of relief. She's been trying to walk around, but it's so incredibly humid in the area that she can't handle going outside (and I don't blame her. I don't want her out there either). She's trying to do things in the kitchen and around the house, but everything is so hard when she's wrapped down to her individual fingers. Even feeding the dog is a terrible struggle and she winds up frustrated and annoyed and near tears because she just can't seem to do anything. She wants to exercise her arm, but the most that I can get her to do is flex her fingers without her going into bouts of talking about how much it's hurting. I've been big on hydration with her. It's the one thing I seem to be winning that battle. I'm glad that was a good choice. :) (That's been one thing I've done all along. Even when any part of this journey has seemed like it was spiraling out of control, I could always fill her water glass and tell her to drink.) Tomorrow I'm going to the LE therapist to talk to them now that we have a diagnosis on her shoulder and to understand the preferred course of treatment and the level of priority on taking care of the different parts of this process. I'll talk to them about water therapy, too. I don't know how my mom's going to feel about it, but I would imagine that the water could be one place that she actually feels like herself again. Plus, she used to love swimming when she was young, so maybe just having that sensation for however brief of a time could be a good influence. Binney, thanks for your explanation about the lymph fluid/inflammation. At least there is a reason that one is causing the other. It's so discouraging to go through these cycles, and even worse when nothing you're doing seems to get her any kind of relief. She's taking her pain pill and looks like she's about to start resting comfortably enough for the night. I'll take it. At some point something is going to have to give. All of this stinks. I'm sorry you've all experienced it, and wish you all the very, very best. <3",
      "MessageIndex": 5,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845724",
      "Title": "Swelling just not going down Emilylaughed Binney4"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Aug 29, 2016 06:45AM Emilylaughed wrote: Things have been rough through August. My mom was diagnosed with a recurrence a few weeks ago. It's not a large tumor, it's lots of small metastasis popping up all over her skin and in the pleural lining of her lung. She's had a pleurex installed and she's breathing a lot better than she was before. She got home from her hospital stay and her arm, which had been wrapped for the 6 nights she was in the hospital, opened up, so we had to deal with healing that. But now we are waiting for chemo to start next week. The doctor had originally wanted to get her enrolled in a clinical trial for a new oral chemo, but she is unable to go through the testing necessary to be enrolled—And the cancer seems to be a bit more aggressive than we'd hoped. Right now, she's really tired, sleeping a lot, and feeling uncomfortable. Nothing is really going to help until we can start fighting the disease. The oncologist was encouraging about the treatment, but we're increasingly anxious about it... Mostly because without doing anything, the cancer is visible on the skin and just keeps growing. It's gone from about 15 bumps along her scar to more than I can count wrapping the whole way around her body. She doesn't have any tumors in any other organs, so no radiation, no surgery on the table; just a systemic approach to fending off the beast a bit longer. Maybe (hopefully, I pray) a lot longer). I didn't think that lymphedema would lead to this. Thank you all for your support through this. We're coming up on 4 years since the first diagnosis. I'd always hoped for 5. Not my will, though. Thy will. And it will be done. I just hope she doesn't suffer.",
      "MessageIndex": 17,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845724",
      "Title": "Swelling just not going down Emilylaughed Binney4"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Jul 8, 2016 11:09AM Emilylaughed wrote: If it's something that works, I think it could be $100 well spent. With the exception when it comes to thousands for a pump, I'm more than happy to toss money into solutions. She has two sleeves and two fingerless gloves right now, and we're working on getting a night sleeve, too. But the more options on the table (insurance-covered or not) the better...",
      "MessageIndex": 7,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845724",
      "Title": "Swelling just not going down Emilylaughed Binney4"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Jul 8, 2016 11:37AM Emilylaughed wrote: One more question: We just noticed two tiny bumps right around the area that everyone's been working. This is the area under her mastectomy, where she's got a lot of swelling right now. I think they are likely caused by irritation from all of the lotion and massage and general disrupt to the area, but cellulitis doesn't start like that, right—That's something that's more of a red rash? I don't think they're cancer concerns, but we'll clearly be keeping an eye on them. They weren't there yesterday. She fell asleep, and now I'm working on not consulting google...so I figured I'd pose the question here. :) It's quite honestly always something.",
      "MessageIndex": 8,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845724",
      "Title": "Swelling just not going down Emilylaughed Binney4"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Aug 8, 2016 10:55AM Emilylaughed wrote: Thanks, ladies. I've got my dad, her husband, trying to help, but he's doing a fine job of trying to ignore what's actually going on. My younger brother is the same. They are both wonderful people, but not the best support. That said, I am enrolled in a yoga teacher training right now, and that's been really useful. We've spent a lot of time on philosophy and it is helping me put all of these new feelings into place. It's also given me a family of gorgeous women who are the most supportive friends I have ever had. Since my first post she woke up, ate some dinner, we re-wrapped her arm, and she has a bit more color. She's starting to snooze again, and we're watching the gymnastics competition, so I'm just taking in each moment as they come. Eating is rough because she's got such a full feeling all the time. Her breathing is changing all the time. Right now, she has one lung that's been radiated twice that we also did a pleuradesis on about a year ago. The other lung has the start of what is probably a cancer-filled pleural effusion. Together with the trunk swelling, it's causing extra compression on her lungs. She can breathe, she just gets short of breath, wheezes from time to time, and does abdominal breath when she's sleeping. There was some rattling this afternoon—first time I heard that—but it slowly faded away. So it could have just been the way she was positioned. Just so anxious for the treatment to start. It might be a week and a half or two weeks, but I'm hoping it happens faster than that. She might be getting a drain for her breathing issues in the meantime; that's why i was wondering if we should go to the hospital. She saw her PCP on Friday who recommended the drain but through a doctor, not a tech. I agree. But I think the drain is necessary pretty soon, and we just don't have an appointment yet. I don't think there's going to be a tech who can install it on a Sunday night, either, but at least she would be somewhere they are monitoring her. Now that she woke up, I feel less like I might need to make that happen right now. We're getting all of the previous treatments out of her system, so nothing is fighting anything in the meantime--which just feels so wrong. <3",
      "MessageIndex": 14,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845724",
      "Title": "Swelling just not going down Emilylaughed Binney4"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Oct 11, 2016 10:53AM Emilylaughed wrote: Hi everyone— Thank you so much for checking in. :) My mom is actually beginning to turn the bend and has been getting better. It's a slow process, but I the warrior who's fought for the last 4 years is coming back. The chemo seems to be working; She's had some odd reactions (her sugar will drop, her blood pressure will rise), but for the most part, she's stable. Her tumor markers are falling, and the swelling is slowly reducing. The upper part of her arm is now supple, and the the fingers, hand and lower arm have all reduced; they aren't better yet, but it's slow steps in the right direction. She goes for her third chemo infusion on Wednesday and if all goes well, we're expecting the Oncologist to sign off on use of the flexitouch. Once cancer begins to be controlled, they say that it's safe to move the lymph around, and we may be able to reduce some of the swelling by resuming some massage. We want to make sure that's something her doctor's agree with, but for the most part, it seems like the jury is out as to if it's dangerous or not. We've had her wrapped pretty much constantly for the last 2 months and she's tolerating it so much better than she had been. I don't think it was lymphedema, I think it was lymphedema with cancer cells that made the past 2 months so miserable. We're hopeful right now that the chemo will continue to work and maybe she can regain at least a little bit of motion in her affected side. She does have a number of sleeves; light compression, tight compression, night garments, velcro garments—We really did try everything—but the gold standard—4 ace bandage wraps, beginning with fingers and going the whole way up the arm—are the only thing that are doing the trick right now. After a very trying August and September, October is proving to be a better month by far. Love to you all!",
      "MessageIndex": 26,
      "PostDate": "11/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845724",
      "Title": "Swelling just not going down Emilylaughed Binney4"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Sep 20, 2016 11:59AM Emilylaughed wrote: Any experience with diabetes and Halaven? My mom's first two treatments went relatively well—And from the looks of the skin involvement, it seems to be working—but during her rest week between treatments her morning blood sugar readings began to drop. (It's usually around 120. It's hovered in the 80s/90s, and today went down to 69.) I know there's concern about liver involvement; could that be what we're looking at? We're scheduled to go back tomorrow for her next treatment. Her oncologist is on vacation, but we'll have a nurse practicioner examen her. Just curious if anyone else has experienced!",
      "MessageIndex": 1604,
      "PostDate": "20/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Nov 6, 2016 01:46PM Emilylaughed wrote: Thanks to both of you! Her medical team has been made aware (both the lung specialist and her oncologist) and neither of them are overly concerned about it. Her oncologist took her off of the daily baby aspirin, but both of them said that sometimes this can happen. I also just got the story from her that she might have overdone it on the first day that the fluid was red; she tried to do some chores around the house, which she hasn't been doing much or any of. That part of the story wasn't forthcoming until yesterday. I always learn bits and pieces after the concern sets on... Cive, that's actually very encouraging to hear. The fluid was a little bit less red yesterday, and the nurse just got here today—so we'll see what comes of that. I would love for this part of the journey to be coming to an end. It's always odd when she feels fine but strange things happen. Thanks for the responses!",
      "MessageIndex": 3,
      "PostDate": "06/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/849676",
      "Title": "Experiences with Pleurex Catheter (lung tap) Emilylaughed cive"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Jun 21, 2016 06:47PM Emilylaughed wrote: thanks for the reassurance; it is terrible to see my mom so uncomfortable and unhappy right now! You ladies are such amazing inspirations when everything around here seems so dark. I'm really ready for this bout of bad luck to come to a close so that we can enjoy some quiet moments and enjoy some peace again.",
      "MessageIndex": 2,
      "PostDate": "21/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845327",
      "Title": "Lymphedema and insect bites (we think) Emilylaughed LewisThomas"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Jun 22, 2016 04:13AM - edited Jun 22, 2016 04:18AM by Emilylaughed thanks musical. I've tried to do all of the best things for her for the last nearly 4 years, but this new complication has been harder than anything else she has gone through because it's made her so listless and disgusted. I'd be worried that they cancer was back somewhere new if we hadn't just got scans that showed that everything was stable. She doesn't have a lot of mobility in her arm right now (we're going to get it back come hell or high water), but she keeps it elevated. She has been complaining about not being able to do exercises, but fist pumps are certainly possible. :)",
      "MessageIndex": 8,
      "PostDate": "22/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845327",
      "Title": "Lymphedema and insect bites (we think) Emilylaughed LewisThomas"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Jun 23, 2016 04:22AM Emilylaughed wrote: God bless you all. :) I was reading about bug bites after it happened, and believe me, that wasn't something we were shooting for. The lymphedema therapists said that it's not so bad when it's the unaffected extremity, but we're still keeping a good eye on it. Nothing red or streaky happening. I wish smells were something that didn't turn her stomach; I'm big on essential oils, but my mom is big on absolutely no scents, otherwise she gets grouchy. That said, I think I'm doing a heavy cleaning of the house this weekend and shaking up any insect hideaways best I can.",
      "MessageIndex": 14,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845327",
      "Title": "Lymphedema and insect bites (we think) Emilylaughed LewisThomas"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Jun 22, 2016 06:55PM Emilylaughed wrote: Hi Musical—Thanks for checking in. She's still exhausted, but we had a good appointment with the therapist today. I talked to her oncologist's office today, and they think that the antibiotic is what's really knocking her out. It's making her fight a different fight, and that one's important too, but her poor body is getting tired. The insect bites seem to be pretty much healed, so no worries there even though that's what got me started into a tailspin as the straw that broke the camel's back. The swelling in her arm is really decreased, but she's got lots of muscles spazzing in her arm and neck and back, so we're working on those. They're recommending an actual massage to loosen her up. Thanks for the tips; she's been sleeping in a recliner chair and elevating her arm as much as she can. When we got home this evening she got comfortable on the couch, and I'm hoping that helps stretch her out a little more! We got two new exercises for her to work on for the next few days, so we'll see how that goes. Next therapy is Friday, next doctor is Monday, and we can only pray that she feels a bit better in between. I'm so grateful for your responses. I am glad to be her support, but sometimes I need advice to help prop me up and keep this thing going the right way! <3",
      "MessageIndex": 10,
      "PostDate": "22/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845327",
      "Title": "Lymphedema and insect bites (we think) Emilylaughed LewisThomas"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Jun 24, 2016 03:59PM Emilylaughed wrote: Thanks, Musical. :) We saw her PCP today, and they are going to do an MRI on her shoulder on the affected arm; best case scenario, it's a frozen shoulder and they need to break up the tension. Worst case scenario the cancer is in the bone and that's what's causing the pain. (The scan from 2 weeks ago is still clean, so we're going to try to be hopeful that it isn't the worst case scenario--she had a bum shoulder before that picture was taken. Still, hard to not go there. :)) The bug bites are worth keeping an eye on, but nothing to worry about right now. So, the daughter is going to do what she can and clean and cook and stay positive. I'm supposed to go on a short trip next week, but I'm questioning leaving her be; she just needs the help right now. No one said that life had to be easy, I guess. Thanks for checking in. You don't know what a blessing it is to know that someone is thinking of you! <3 I hope that you're doing well and having some fun this weekend!",
      "MessageIndex": 19,
      "PostDate": "24/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845327",
      "Title": "Lymphedema and insect bites (we think) Emilylaughed LewisThomas"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Jun 21, 2016 07:18PM - edited Jun 21, 2016 07:22PM by Emilylaughed I spent some time googling, and the bite most looks like a hobo spider bite (http://mddk.com/hobo-spider-bite.html) the clear one in the middle of the page. It's a clear fluid, sort of just a blister that is oozing, but we're keeping it covered, so it's a bit of 'cover it, then hope it bursts, keep it clean, let it drain, then cover it...and it heals up and the blister forms again.' But all of that said, it's not cloudy, it's not red, it's not hot. She's really tired, but I think that has more to do with the General lymphedema and not so much these bites.  Eta: it could probably be just a mosquito bite, too. I don't think it was anything crazy that hit her, it's just the complication bit...",
      "MessageIndex": 4,
      "PostDate": "21/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845327",
      "Title": "Lymphedema and insect bites (we think) Emilylaughed LewisThomas"
    },
    {
      "AuthorID": "Emilylaughe…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166231/profile",
      "Content": "Jun 21, 2016 08:06PM Emilylaughed wrote: We do have access to therapists. She has an appointment tomorrow afternoon, and I'm sure they will take a look at it; they will be sure to say they aren't doctors, though. I think we'll talk to her pcp in the morning. I am always more anxious about strange situations like this than I ought to be. My mom has always stayed so stoic and strong, but since the lymphedema started a lot of that resolve has been slipping away, which makes it harder for me to make judgement calls on if it's a normal crappy feeling or if it's one that needs to get to a hospital immediately. I think this one can wait until tomorrow",
      "MessageIndex": 6,
      "PostDate": "21/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845327",
      "Title": "Lymphedema and insect bites (we think) Emilylaughed LewisThomas"
    }
  ]
}