{
  "AuthorID": "EMM_ann",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91407/profile",
  "Posts": [
    {
      "AuthorID": "EMM_ann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91407/profile",
      "Content": "EMM_ann wrote: I was diagnosed with DCIS (intermediate grade) and did my first lumpectomy last month followed by 2nd one to clear margins early Oct. During the 2nd surgery, doc found that one sentinel lymph node is positive and he went to take all nodes out (1 out of 27 is also positive). He also took several wall tissue surrounding the original lump area in addition to a bigger margin. The path report says two out of four wall tissue have DCIS which I was told the margin is cleared. But last week I was told that a senior pathologist thinks that DCIS (in those two wall tissues) is actually invasive cancer. They sent the sample to A.F.I.P for 2nd opinion. How could this happen? I though I am in a very early stage of breast cancer several weeks ago. Now lymph nodes are involved and the margin is not cleared! I have no family history of breast cancer what so ever. But I did go through painful 5x IUIs and 3x IVFs to try to have a baby. I also want to know if anyone gets any information regarding to have a baby after chemo. I am 35. If I am in that Tamoxifen for 5 years, that will put me in the age of 40! I have never been pregnant before and I has been married for over 9 years. Both me and my husband have no any biological child at all! I am so desperate for this whole breast cancer thing. Any information you know would be really helpful (either DCIS w/ lymph node or any fertility issue after breast cancer treatment) ! I am new to this forum and I hope I could find some friends here. Thank you, Emm  Dx 9/29/2009, DCIS, 1cm, Stage II, Grade 2, 2/29 nodes, mets, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/742731",
      "Title": "DCIS w/ lymph nodes positive ? EMM_ann EMM_ann"
    },
    {
      "AuthorID": "EMM_ann",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91407/profile",
      "Content": "Oct 25, 2009 07:28PM EMM_ann wrote: Thank you all for your kind words. I guess I can only go step by step. I will go talk to the surgeon tomorrow morning and we will decide to do a re-excision or the mastectomy. I guess it would be years before I can go back to the infertility treatment (I need to go through chemo, radiation, hormone therapy). Thanks.",
      "MessageIndex": 4,
      "PostDate": "25/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/742731",
      "Title": "DCIS w/ lymph nodes positive ? EMM_ann EMM_ann"
    }
  ]
}