{
  "AuthorID": "Emmapeel1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58670/profile",
  "Posts": [
    {
      "AuthorID": "Emmapeel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58670/profile",
      "Content": "Jun 13, 2017 06:33PM Emmapeel1 wrote: I have had BC since 2007 and mets since 2012 and work full time, traveling on business throughout the West. I think that working has been what has kept me sane as it makes me feel normal and distracts me from obsessing. Only recently after 12 rounds of Taxotere and now being on Ibrance do I have fatigue but it is truly creeping in more and more. I hope to keep on working for as long as my body will let me do so.",
      "MessageIndex": 37,
      "PostDate": "13/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/855380",
      "Title": "Is anyone working full time still, after met diagnosis? talpha1 Lumpie"
    },
    {
      "AuthorID": "Emmapeel1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58670/profile",
      "Content": "Jul 14, 2015 12:45AM Emmapeel1 wrote: Hello All, 12/12 diagnosed with multiple diffuse bone mets which have been and continue to be stable thanks to Afinitor/Aromasin.That said, I have recently been diagnosed with a 1 cm lesion on liver, multiple potential lesions in the omentum/peritoneal regions and also what appears to be several lymph node metastisis. (and maybe a stomach metatasis. Ugh.) My question, I have a large pleural effusion which is causing me intermittent coughing and shortness of breath. My doctor states they prefer to wait on any draining until they see if the medicines will cure the problem. This is satisfactory to me however I would like to know if 1. My coughing/shortness of breath symptoms are considered mild (I see many references to pain)-basically I would like a point of reference for when I should become more concerned. 2. Has anyone had success in their pleural effusion being corrected via chemotherapy? I am starting Xeloda and Herceptin this week. Thank you for any insight that can be provided.",
      "MessageIndex": 23,
      "PostDate": "14/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832831",
      "Title": "Newly diagnosed Stage IV malignant pleural effusion hopeful34 paulatkc"
    }
  ]
}