{
  "AuthorID": "encyclias",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
  "Posts": [
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Feb 17, 2014 12:21PM encyclias wrote: Cathy, I had chemo first (and saved my breast although that wasn't the main reason).  My oncologist said it was best for me to proceed this way since my cancer was very aggressive and, for reasons he gave, I agreed. See both a surgeon and an oncologist before committing to a specific protocol.  They both have much to offer pro and con. Big hug, Carol",
      "MessageIndex": 4,
      "PostDate": "17/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818144",
      "Title": "dealing w people cathycteach geekyknitter"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Sep 26, 2013 09:00AM encyclias wrote: I had a PET scan before starting chemo last year.  My oncologist wanted to make sure the cancer hadn't spread from my breast before deciding which chemo drugs I would do best with.  He picked right, apparently, because the two lumps were almost completely destroyed.  Then, I had a lumpectomy and rads.",
      "MessageIndex": 3,
      "PostDate": "26/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/811685",
      "Title": "Meeting with BS yesterday Milane Hortense"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Mar 22, 2014 07:33AM encyclias wrote: Coop, I read that S&W just opened up a radiation oncology dept in 2012.  I would guess this means new, state-of-the-art equipment.  Just in case you need rads. Carol",
      "MessageIndex": 14,
      "PostDate": "22/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819371",
      "Title": "IDC Coopdizzle Kalonis52"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jan 3, 2014 09:11AM encyclias wrote: It is my understanding that in the ER/PR+, the R stands for 'Receptors.'  It is not a measurement of the estrogen or progesterone in your body but rather whether or not your cancer cells have the ability to use these two hormones to promote their cell growth.  The majority of women with breast cancer are ER/PR+.  I am ER/PR-, which means my cancer cells don't have Receptors to use either of them; it has nothing to do with my body's estrogen or progesterone levels. There is a big learning curve with breast cancer, and the more you learn, the less you will blame yourself.  You are NOT responsible for your cancer! Carol ",
      "MessageIndex": 9,
      "PostDate": "03/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/816438",
      "Title": "Beating myself up Bad_At_Usernames Dtowles"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Apr 20, 2014 03:21PM encyclias wrote: Annette, I love your grandmother's line: \"they don't make saggy old lady implants.\"  That is exactly what I have been saying if I find I may need a mastectomy in the future.  Wouldn't even consider reconstruction. Sending best wishes for grandma to kick this cancer to the curb. Carol",
      "MessageIndex": 14,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820310",
      "Title": "Elderly mother recently diagnosed tdisibio Infobabe"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Oct 7, 2013 11:04AM encyclias wrote: Generally, the call comes from the doctor who ordered the test. Keep trying to pin your doctor down. Carol",
      "MessageIndex": 1,
      "PostDate": "07/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/812435",
      "Title": "Scared and annoyed jenistar aviva5675"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 12, 2013 06:01PM encyclias wrote: I had an ultrasound biopsy also.  I actually had two biopsies that day; one for each lump on either side of my breast.  Didn't find it painful, a bit achy the next day -- Tylenol fixed that problem.  Carol",
      "MessageIndex": 7,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/807625",
      "Title": "so worried lillykat8141 Janet456"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 12, 2013 08:02AM encyclias wrote: I had been told by my surgeon and my chemo nurses that if the port wasn't being used regularly, it had to have a heparin flush every 4-6 weeks.  I cheat and let it go about 8 weeks.  Although chemo ended in Dec, I find the port very useful still so I am not upset at the maintenance.",
      "MessageIndex": 5,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807621",
      "Title": "Port cath bhd1 surfdreams"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Apr 14, 2014 02:31PM encyclias wrote: My breast was already numb from just having the two wires put in to guide the surgeon to the old biopsy markers -- which were all that was left of where my two lumps had been prior to neoadjuvant chemo.  They did the shots about an hour before my surgery.  I didn't find the shots painful at all.  When you are laying there with two long wires with masking-tape flags at their ends sticking out of your breast, I doubt there is anything else that will surprise or hurt you.  Carol",
      "MessageIndex": 29,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746169",
      "Title": "Nuclear Injection pre-surgery pagowens Accepted2018"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 23, 2013 02:15PM encyclias wrote: I think it was about a week, during which time I did labs, a PET scan, and then a MUGA scan.",
      "MessageIndex": 7,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806224",
      "Title": "How soon after the port was in place did you start chemotherapy? EdM encyclias"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Apr 24, 2014 04:32PM encyclias wrote: I did neoadjuvant also in the fall of 2012.  Started with two lumps total of 5cm (50mm) and a bunch of involved nodes.  After my A/C x 4, a lumpectomy found one lump totally gone, the other only 3mm left, margins wide and clear, and also no cancer in the lymph nodes anymore.  Went on to rads. Good luck to all for wonderful success with your treatments. Carol",
      "MessageIndex": 4,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/820462",
      "Title": "Neoadjuvant therapy genny5775 annika12"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Mar 8, 2014 10:47AM encyclias wrote: Good memory, 4sewwhat!  I remember Laetrile bandied about in the 1950s, 60s.  Made from the kernel inside apricot pits, and also known as B17, people would go to Mexico for treatments.  Can't remember anyone beating their cancer, though.  Here's the Amer Cancer Society writeup on it: http://www.cancer.org/treatment/treatmentsandsideeffects/complementaryandalternativemedicine/pharmacologicalandbiologicaltreatment/laetrile",
      "MessageIndex": 335,
      "PostDate": "08/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Oct 30, 2013 07:22AM - edited Oct 31, 2013 06:18AM by encyclias It was recommended that I do chemo first by my MD Anderson-certified oncologist and then decide on either a lumpectomy or a MX. Seems to be their new protocol for my stats. I started with two lumps, one 2.7cm and the other 2.3cm along with some nodes, both axillary and interstadial. I had A/Cx4, 3 wks apart. After the third infusion, neither of the lumps could be felt. A month after the last chemo treatment, I had another mammo and US and there was nothing to be seen anymore. However, these tests do not find things under 5mm. I decided to have an LX and a SNB and let the surgeon take a look. He found one lump had totally been destroyed by the chemo and the other had a tiny 3mm bit left which he removed (3mm out of an original total of 50mm). Not perfect, but the margins were wide and clear, and the SNB was negative as well. The two thin incisions healed very quickly and without discomfort -- unless I forgot and raised my arm to reach something on a high shelf during the first few days. Then on to rads. One of the reasons I did not go for an MX is, being a diabetic (Type 2, a few pills a day), we tend not always to heal very well and the less I would have to heal, the better. Not having had problems in the past, still a MX and reconstruction would require a lot of healings over a long period of time. Second, I am the sole caregiver for a handicapped husband. Third, it seemed overkill to have an MX with a now-negative mammo and US. The chemo, LX and rads seemed to work best for me. I had a follow-up PET scan last week, a year after my original diagnosis and PET, and I have NED anywhere at the present. Of course, like all these scans, it can't see less than 5mm. We all have to make our own decision based on our own personal and family needs and health situation. Good luck in making your decision. I am sure it will be the right one for you. Carol",
      "MessageIndex": 6,
      "PostDate": "30/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/813768",
      "Title": "Lumpectomy vs masectomy Grk1732 Beesie"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Mar 24, 2014 07:48AM encyclias wrote: I loved my port.  Had it in for a year and a half.  Got it taken out about a half hour ago; just got home from the hospital.  It served me very well.  I could not have gotten through the chemo infusions, surgery, and all the blood draws without it.  As for tank tops, pick out those whose shoulder straps are a bit wider; I did put the very narrow-strapped and string tied ones away until now.  Summer's coming!  Yeah! Carol",
      "MessageIndex": 7,
      "PostDate": "24/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819452",
      "Title": "Which treatment is better? Port or IV? blinds23 MellowYellow"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Sep 28, 2013 05:44AM encyclias wrote: Second opinion time.  I have also read repeatedly you can't have rads twice.  Additionally, she sounds like she is talking about a first time rad patient with the standard 5-wk protocol rather than some special treatment for a second time patient.  I definitely would hold back and see another RO for an opinion.  Your MO should be able to come up with a name. Good luck, Carol",
      "MessageIndex": 3,
      "PostDate": "28/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/811782",
      "Title": "Had recurrence and Dr wants to do radiation AGAIN!?!? Run4Us Run4Us"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 30, 2013 03:41AM encyclias wrote: Surgery was at 1:00 and I was home by 4:00.",
      "MessageIndex": 1,
      "PostDate": "30/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/806953",
      "Title": "lumpectomy, home same day? vaper Moderators"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 1, 2013 02:18AM encyclias wrote: I was given a choice by the anesthesiologist whether to go with the tubes or the mask.  I don't like the idea of the tubes, so I chose the mask.  He swung it over and told me to grab it and put it over my face -- it was the last thing I remembered until I woke up having an ice chip shoved in my mouth, followed by two very welcome cups of coffee and a ride home. Like Bevin, I needed a mammo first to find the biopsy markers so wire guides could be put in for each of my two (ex-) lumps, along with that blue dye for the SNL biopsy. Carol",
      "MessageIndex": 6,
      "PostDate": "01/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/806953",
      "Title": "lumpectomy, home same day? vaper Moderators"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Dec 29, 2013 11:07AM - edited Dec 29, 2013 11:09AM by encyclias Medicare covers 80% of all inpatient, outpatient or clinic chemotherapy costs.  They also cover the chemo drugs which are given to the patient there.  If you have a supplemental policy that pays the 20% difference, they will have to pay since Medicare is paying.  http://www.medicare.gov/coverage/chemotherapy.html At another Medicare website, it only talks about prescription drugs that you go to the drugstore for that are not covered; not the ones used during chemo infusion. You're good to go! Carol ",
      "MessageIndex": 3,
      "PostDate": "29/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816215",
      "Title": "Any sites for Medicare approved chemo drug costs aaoaao aaoaao"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Sep 25, 2013 06:49AM encyclias wrote: Whan I started having some burning, especially along the incision lines, during the first few rads, my RO told me that it was not uncommon and that it would go away shortly and not show up again until toward the end of my rads.  He was right. Carol",
      "MessageIndex": 7,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/811535",
      "Title": "3 treatments & skin already acting up?!! KristinaA slv58"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 22, 2013 06:55PM encyclias wrote: Deen, my hair started growing back a couple weeks after my last A/C cycle, right about the middle of January.  It's been five months now since then and I have a full head of soft curls about 3-4\" in length.  Having always had very long straight hair, it has been interesting having these curls -- just wash and wear.  Unappreciated is the gray -- my natural black hair did have about 25% silver in it but it still looked black.  Now, saying I am a brunette would be a stretch of imagination.  But in looking closely, some of the gray does have black roots.  My mother had naturally curly hair that looked just like this, while mine was always straight. What surprised me the most are the compliments I have gotten with my mop of chemo curls, even being told I look much younger (I'll take that with a grain of salt). Hoping you start to see real growth soon, Deen.",
      "MessageIndex": 19347,
      "PostDate": "22/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Aug 13, 2013 09:28AM encyclias wrote: I was fortunate to go through chemo the winter.  I pretty much lived in knit beanies of all styles and colors, just like everyone else around was wearing.  But I am retired and didn't have to go to work.  Had a few cloche-type hats but rarely wore them.  I did buy a wig, spent a good deal of money on it, tried it on a few times and then put it away.  It just wasn't me at all; I didn't even recognize myself in the mirror.  But I did love my beanies.  Later, when my hair started to come in a bit and the weather got warmer, I switched to ball caps.",
      "MessageIndex": 19452,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Feb 16, 2014 10:27AM encyclias wrote: crazyride, same here; the eyelashes are still going through these oddball cycles.  Not overly noticible to others, fortunately.  My PFC was Dec 2012. Carol",
      "MessageIndex": 19989,
      "PostDate": "16/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jan 2, 2014 08:02AM encyclias wrote: As an example of what a PET scan sees besides cancer, my first PET in Oct, 2012 showed I didn't have any Alzheimer's precursor plaques in my brain, that I had a gallstone which was 'very old' but not causing symptoms (actually, it's about 20+ years old), also that I have diverticulosis -- those intestinal pockets common in old folks like me -- but none of them were inflamed (\"don't eat small seeds\"), and she showed me my ovaries, 12 years past menopause, were atrophied down to the size of raisins.  Plenty more interesting things, but none lighting up like the cancer in my breast and nodes clearly did.  I am sure that what is scar tissue would be quite clear as just that, but it is something to ask whoever did the evaluation of the scan.  And if it didn't light up as cancer ... Went for my follow-up PET last month.  It didn't see any cancer, but the doctor was still laughing over the old gallstone, wanted to know if I was trying to set a record. Best of luck, HBollinger. Carol",
      "MessageIndex": 1,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/816405",
      "Title": "Scar Tissue on PET Scan? Hbollinger encyclias"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jan 2, 2014 09:06AM encyclias wrote: You can ask for a copy of the written report and the computer disk which shows the actual scan.  I never had to ask for either because the private imaging group I use automatically gives both to the patient and sends copies to the doctors involved in the treatment.  If I were in your place, I would ask for it just to have it for the future.  When I was ready to start rads, my RO was delighted I had the disk copy, which he then copied and, based on what he saw, changed some of my proposed treatment.  He could have gotten it from my MO, but that would have taken more time when I was already set to go with treatment. Carol",
      "MessageIndex": 3,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/816405",
      "Title": "Scar Tissue on PET Scan? Hbollinger encyclias"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Sep 12, 2013 06:51PM encyclias wrote: Bojo, saying prayers that the results are benign. Like the others said, only the pathologist is qualified to determine if it is cancer or not, and as ballet said, it may take longer to get the results -- mine took at least a week.  Please, try to stay calm. Carol",
      "MessageIndex": 9,
      "PostDate": "12/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/810860",
      "Title": "Had Core Biopsy and Nurse Told it Doesn't look good bojoi7 ballet12"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 27, 2013 09:59AM encyclias wrote: I've been meaning to post this website.  The lady who created it is Rosa from Madrid, Spain.  She contracted breast cancer while doing post-grad work in the UK.  What she had done was have photos taken every week as her hair grew back.  She is now cancer free by a few years and living the good life again.  So here it is.  You'll have to go down all the way to the bottom of the webpage to the beginning  and start with her first photos.  Her commentary is also very interesting as she moves forward, week by week.  I referred to Rosa's webpage frequently while waiting for my hair to grow back. http://hairgrowthafterchemo.wordpress.com/ Carol",
      "MessageIndex": 19404,
      "PostDate": "27/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Aug 13, 2013 09:48AM encyclias wrote: Goldie, I have plans to give it to the MD Anderson affiliated cancer center here.  They have loads of new and used wigs, beanies (knitted by church groups here), hats and scarves that they give away for free.  I agree we need to pass on clean, usable headwear.",
      "MessageIndex": 19454,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jan 17, 2014 08:18AM encyclias wrote: Having always long straight hair, 'naturally' my hair would grow back in curls.  But I really enjoyed them, especially the wash & wear.   But all good things must come to an end.  I had asked my PCP how long the curls would last -- his wife is a 10-yr bc survivor -- and he remembered hers lasted about a year.  Well, it's been about a year now for me.  Recently, they haven't been looking as well as they did, and yesterday I brushed my hair back from my forehead and saw that the curls comprise about 4\" of each hair, and beneath that, about 2\" of straight hair growing in.  Now, my mop is a mess.  Can't decide what to do while I wait for it all to grow out at least to ponytail length for the hot summer. Sending hope and best wishes that after chemo everyone's hair grows back thick and quick. Carol  ",
      "MessageIndex": 19906,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Nov 3, 2013 08:53PM encyclias wrote: Just a possibility I stumbled upon: \"Review: Slurred speech in Paxil\" http://www.ehealthme.com/ds/paxil/slurred+speech ",
      "MessageIndex": 8,
      "PostDate": "03/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/813953",
      "Title": "Severe slurred speach, limp foot, and swallowing trouble ChattyChatty Momine"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jan 30, 2014 03:40AM encyclias wrote: When I went through my 33 rads last summer, all I ever used was baby powder (kept nice and cool in the refrigerator) and aspirin for itching and pain.  My skin never broke down, nor did my right breast look any drier than my left breast, only a light tanning. Worked for me, but might not work for others.  My RO was very happy with the results. Carol ",
      "MessageIndex": 750,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Apr 25, 2014 09:40AM - edited Apr 25, 2014 10:23AM by encyclias While I -- so far -- have luckily not experienced LE, I did ask the general surgeon who did my lumpectomy and SNB last summer what my chance of getting LE were if a node or two were removed, and he said 10% unless many more nodes were involved.  So I was at least forewarned.  I would hope other surgeons would at least comment on it before a SNB. Carol",
      "MessageIndex": 5,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/820492",
      "Title": "The Myth About Sentinel Node Removal and LE cinnamonsmiles carol57"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jan 25, 2014 08:59AM - edited Jan 25, 2014 09:00AM by encyclias I still make that mistake sometimes also, Pam, although I know the correct term is supine.  The further along you get in distance from your school years, it seems the more you forget the finer points.   I had x-rays many times during rads, and some CT scans as well. Carol",
      "MessageIndex": 654,
      "PostDate": "25/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815476",
      "Title": "Winter 2013-2014 Rads TeamKim mouse9587"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Feb 4, 2014 12:18PM encyclias wrote: Maatlsis, Can't speak for anyone else, but this was my experience with neoadjuvant chemo.  I was originally diagnosed at 64 with Triple-negative breast cancer in Oct 2012.  I started with Adriamycin/Cytoxon x4, three weeks apart.  By the last infusion, you could no longer feel either of the two lumps in my right breast (orig totaled 5cm) nor did they show up on a mammogram anymore.  A few months later at my lumpectomy, the surgeon found that one lump (2.3cm) had completely disappeared, and he then removed what was left of the other lump (previously 2.7cm), which was just a 3mm crumb.  Checked that the margins were wide and clear, as were the nodes.  I went on to have radiation therapy a few months later.  And at the end of this past October, a PET scan found NED (no evidence of disease). For some, the neoadjuvant chemo works, and for some it doesn't work as well.  Different chemo drugs than mine can similarly be used and get the same types of results. Your mom is fortunate to have you backing her up.  Hugs to both of you, prayers for a good outcome. Carol",
      "MessageIndex": 1,
      "PostDate": "04/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/817664",
      "Title": "IDC; Chemo Before Surgery MaatIsis encyclias"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Mar 26, 2014 11:46AM encyclias wrote: Felt a lump, that's all.  Great otherwise. Carol",
      "MessageIndex": 8,
      "PostDate": "26/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819541",
      "Title": "Did you have any symptoms prior to being diagnosed? Footballnut Footballnut"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jan 2, 2014 09:27AM encyclias wrote: tekwriter, Amgen, the manufacturer of Neulasta, has a program available called the Safety Net Foundation which provides this and other drugs for free if you have no drug insurance that will cover it and meet other eligibility requirements (when they use the term 'uninsured,' they are talking about drug insurance).  I was surprised that I qualified back in 2012 -- they are quite generous when it comes to income limits since the shots are around $10,000 each. Start here:  http://www.safetynetfoundation.com/index.jsp",
      "MessageIndex": 44,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815627",
      "Title": "Starting Chemo January 6, 2014 desimone birdlover23"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Oct 5, 2013 09:36AM encyclias wrote: Jess, if your mother's brain issues have only come about in the past few weeks, she may have had a TIA (mini-stroke). My SO has had several of these (he does not have cancer), with the same confusion, lack of cognitive abilities, forgetfulness, several other issues, being the symptoms. Perhaps it would benefit your mother if you contacted her primary care doctor to see if he/she would recommend a visit to a neurologist to see what is going on in her brain. My SO has had CT scans to check for bleeding inside the brain; a few times yes, a few times no. He also has had an ultrasound of his neck arteries to see that there was plaque buildup which could chip off and obstruct a bit of the blood flow in his brain. And of course several electroencephalograms (brain wave) tests. These TIAs can sometimes presage a major stroke. Carol",
      "MessageIndex": 1787,
      "PostDate": "05/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Sep 26, 2013 09:12AM - edited Sep 26, 2013 09:12AM by encyclias Kiko, the leading cause of death is still heart disease, and these health warnings still work for that.  I was at a relatively low risk for breast cancer, and still got it anyhow; I was only at 6% as compared to the US lifetime average of 12.5%.  What made it as high as 6% is they automatically add points if you are over a certain age. Carol",
      "MessageIndex": 20,
      "PostDate": "26/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/811564",
      "Title": "In Total Shock!!!!!!! carissabforlife Kiko"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Feb 22, 2014 05:49AM - edited Feb 22, 2014 05:51AM by encyclias Alyon, just a few far-out sounding possibilities.  I don't know your mother's age and if she fits, but my husband had similar problems and this is what it turned out to be (different times).  1.  Diphenhydramine HCL, a very common over-the-counter medication used for allergies, better known as Benadryl.  In addition, this is the same drug used in most nighttime 'sleep-aids'.  There are many references online from major drug companies and medical research studies, but this article explains it the best: Grandma Isn’t Crazy, She’s Taking Antihistamines  http://polymedicine.com/article.antihistamines.html My husband stopped taking it, and all his symptoms went away very quickly. 2.  On another occasion, I was stunned to find out that Jim's sudden weird behavior -- for which I took him to the ER -- turned out to be a response to a urinary tract infection.  I had wondered about them requesting a urine specimen from him, like what does that have to do with his nuttiness?  Never had heard of a UTI doing that before but it seems fairly common.  All was well after antibiotics eliminated the infection. Hopefully, the doctors will be able to get things back under control for your mother soon.  Carol",
      "MessageIndex": 2129,
      "PostDate": "22/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 4, 2013 08:09PM encyclias wrote: soriya, I used all my regular make-up during chemo.  Hope the chemo goes easy for you. Carol",
      "MessageIndex": 87,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 26, 2013 08:49AM encyclias wrote: bluestars, I was given only Emend in the form of a pill as they unhooked me after each infusion, along with two lesser-dose pills to take over the next two days.  Never had a minute of nausea, as my MO had promised me from the beginning.  The only real side effects I had from A/C chemo (x4, 3 wk intervals) was fatigue toward the last two infusions, and a lowering wcb during the third for which I was given a Neulasta shot as a precaution.  No SE from that either.  Since I take Metformin for my diabetes which generally gives me the daily D, I didn't have constipation problems, LOL. Carol",
      "MessageIndex": 601,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Oct 25, 2013 12:40PM - edited Oct 25, 2013 12:41PM by encyclias My RO told me I had to wait six months before the next mammo since my rads ended in late July; I think the appointment, made by my BS, is in January. I did manage to get a PET scan last Monday, almost exactly a year after my first just before chemo. Thankfully, it was clear of cancer now. Carol",
      "MessageIndex": 5,
      "PostDate": "25/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/813544",
      "Title": "When Was Your First Mammo After Finishing Rads? corky60 Kicks"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "May 18, 2013 04:20PM encyclias wrote: Hi all!  What a batch of wonderful information you all have posted here.  I am so glad to have found this thread. I am still waiting for my first rad.  My lumpectomy surgery resulted in a seroma/hematoma and my RO didn't want to start rads as it was on my last visit to him.  I get to see him in about ten days and hope we can go ahead with this.  Long periods of time between various procedures scare me to death that the creepy little mets are having a world tour of my body.  I had my last A/C chemo in late Dec, and didn't get an LX until early April.  The LX revealed a 3mm residual carcinoma, but with clear margins and negative lobes.  Now I am waiting again, this time for the rads.  I have lucked-out with a great RO, though.   I just want to get this over with and try to enjoy what will be left of the summer when it is done. Sharon, my aloe plants are ready to go to work.  All I need are the rads to go with them...sigh. Just realized that my signature data are wrong.  There were a few nodes positive for cancer at the very beginning which are now neg.  Need to get around to fixing it. Thanks to all. Carol",
      "MessageIndex": 115,
      "PostDate": "18/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 29, 2013 04:39PM encyclias wrote: Sciencegal, what you are describing as gold chainmail (lol) is a form of bolus.  They have a photo of one at Google images.  It's actually very pretty. I had asked my RO if I would need a bolus, and he said no since I hadn't had a mastectomy, and explained a bolus was to put some 'insulation' between the beam and the internal organs since there was no longer any breast tissue/fat to protect the lungs and heart to some degree.",
      "MessageIndex": 654,
      "PostDate": "29/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 12, 2013 03:53PM encyclias wrote: I'll ring a bell for you, Corky!  Congrats!",
      "MessageIndex": 915,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 20, 2013 12:10PM - edited Jul 20, 2013 12:11PM by encyclias",
      "MessageIndex": 1066,
      "PostDate": "20/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Aug 8, 2013 08:48PM encyclias wrote: Pat, I can't imagine what you RO meant by that.  I had the customary 33 rads (28+5 boosts).  In addition, my RO went after the internal mammary nodes under my sternum using a different method.  With great care to avoid my heart underneath, he made a lead alloy mold shaped to match the area to be treated.  And he used only electron beams, which are much shallower, don't go all the way through you (electrons are also usually used for normal boosts).  My poor sternum got 28 of these electron rads. I didn't have any fatigue, nor nausea, but my skin over the sternum got toasted good!  That is unlike my  whole breast radiation from which I only had a little 1/2\" skin break about a week after my rads ended. I cannot say how your sternum will take the rads.  Ask your RO if they are using electrons and how many treatments you need.  The electrons they used on me went all the way through the sternum itself to reach the nodes below it, so I wouldn't think it would be much different from yours if they are just targeting your sternum.  But then again, I guess there are different strengths and it can be set for different depths, so yours may be very different.  Ask the rad techs there; they are usually more forthcoming with information. Am I making sense?  I think I need more coffee. Good luck, Pat.  I hope it turns out uneventful and successful. Carol",
      "MessageIndex": 1268,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 5, 2013 05:56PM - edited Jun 5, 2013 10:46PM by encyclias Wooohoooo!   Finally, I get my mapping tomorrow and start rads on Monday.  I have had such long waits between various phases of my cancer treatment that I have become almost paranoid that the doctors are allowing any mets to get a free ticket to ride --- especially since I am triple-negative.  I just want to get this over with before the summer ends. Wishing everyone a great outcome with a minimum of discomfort or complications.",
      "MessageIndex": 273,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 28, 2013 07:02PM encyclias wrote: Thank you for your good wishes, Linda, and a happy weekend.  Just don't know if I have the ability to bear the skin damage and pain that so many having rads have had to bear.  I'm a wimp.  I'm a double-wimp. To everyone, have a great weekend.  Never thought two days off could mean so much. Carol",
      "MessageIndex": 644,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 20, 2013 09:34AM encyclias wrote: LWO919, my RO uses only special marking pens; no tattoos.  These marker lines are quite difficult to lose under normal living conditions  The ink is actually raised up and seems to have a reflective grit in it.  With an occasional re-drawing here or there, they stay on throughout the course of the rads.  Now to figure out how to get rid of them since I am close to the end.  Anybody? Carol",
      "MessageIndex": 1059,
      "PostDate": "20/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 24, 2013 01:49PM - edited Jul 24, 2013 01:49PM by encyclias Lynn, all I was told about dining out was to stay away from salad bars and buffet restaurants since a hundred people may have handled those serving spoons before you.  I still cheated on that; I went up and loaded my plate, put it on the table, went to the ladies room and scrubbed my hands, and then went back to eating. They made no mention of fresh fruits and veggies, but I always wash them anyhow.  I do believe they 'overload' their warnings somewhat. Carol",
      "MessageIndex": 542,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 28, 2013 10:11PM encyclias wrote: maziel, I've had a port for 10 months now and I do anything and everything I want to do; I was never given any restrictions.  Took about a week or so to heal the little incision where they put it underneath my skin, and then off to the gym.",
      "MessageIndex": 667,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Aug 10, 2013 02:56PM encyclias wrote: Hi, Beachbound!  If she was a \"lovely lady\" you spoke to at our RO's office, it definitely wasn't me.  I finished my rads about a week and a half ago and my skin is really starting to heal now; the tan is slowly going away along with the tenderness.  I didn't have much problem during the normal rads, 28/5, but those special ones to the sternum got pretty ugly although I didn't have skin break nor peel.  I go back for a final visit on the 22nd of this month.   I hope your treatment is going well and mostly painless.  And happy belated anniversary!  Carol",
      "MessageIndex": 1277,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Aug 25, 2013 02:48PM encyclias wrote: dragomirova, back when I first started rads, I saw my RO on the 4th day and told him I was feeling stinging and a burning sensation in my breast; wasn't it too early for that to start?  He said that many women frequently feel some pain the first week or so which goes away for a while before the real reaction to the rads starts. Carol",
      "MessageIndex": 1407,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 9, 2013 02:08PM encyclias wrote: Speaking of Claritan, I hadn't realized it was an allergy type medication.  Remembering back many years ago, until it was taken off the shelves because the main ingredient could be used in the process to make meth or something, I used to use Sineaid as a super painkiller instead of as a sinus med.  No other over-the-counter drug of any brand or type had the painkilling ability that Sineaid did; be it for a broken leg, migraine headache, toothache, backache.  Maybe Claritan has somehow put together a formula like that, bypassing the Sineaid ingredient. I will have to get a bottle to keep in the house. Carol",
      "MessageIndex": 179,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 9, 2013 04:33PM encyclias wrote: I'm sorry, Patty, I wasn't clear.  It was Sine-aid that was taken off the shelves about 8 or 9 years ago.  I understand for a while it was behind the counter, but it seems that it is just not carried any more.  I used it for decades.  It was an antihistamine which also contained ibuprophin(sp), and anything that could take away a sinus headache would work on any type of pain. Carol",
      "MessageIndex": 181,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Aug 13, 2013 10:16AM encyclias wrote: Lynn, head to the drug store and buy any heartburn/indigestion pills that have omeprazole in them or buy the actual generic.  The over-the-counter strength is 20mg, the prescription dose is 40mg.  Not being a big woman, I used the 20mg and by the next afternoon the burping, indigestion and heartburn was completely gone.  It's one pill a day for a few days.  Then I put it away until the next A/C infusion. What is happening is that the cells lining our stomachs are very fast-growing, just like our hair and the cancer, and these all get clobbered the same way. I had a PET scan just days before chemo Carol",
      "MessageIndex": 996,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Apr 17, 2013 05:53PM encyclias wrote: ScarYola, I can sympathize.  My ISO (Insignificant Other) has turned out to be very dumb, or merely in denial.  I have been trying to get him to see the seriousness of this cancer and, after telling him I have a good reason to be worried since women  (and men) die each year from from breast cancer, he pops up with the analogy that he could walk around the corner and get hit by a bus (like 50,000 women die by being hit by buses each year?).  I ran out of patience trying to give him a more realistic perspective.  He doesn't want to hear it and therefore allows himself to hold back any empathy and concern.  His head is buried in the sand.  To be fair though, he is suffering from beginning dementia, but has always been a 'me' type of person. It's times like these that I wish I had family left.  But some friends and neighbors are tugging me along, giving me support when it gets too much to deal with, welcome shoulders to cry on.  God bless them!  Right now, my focus is on staying alive and getting through this and going back to enjoying the beautiful world we have.  As for how I deal with my ISO in the future -- we've been together 16 years -- depends much on how I come out of it all, physically and emotionally. Hang in there, ScarYola!  Build up a support group, get well first, and then deal with these painful emotional issues.  Focus on getting well.  Sending you healing thoughts and prayers.",
      "MessageIndex": 1678,
      "PostDate": "17/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 3, 2013 07:34AM encyclias wrote: anniej, it is very good that your oncologist is being cautious about your general health as well as the cancer, even if the waiting is upsetting.  And it shouldn't be much of a problem to reschedule with just a change in chemo drugs.  Sending best wishes for a good report from the cardiologist, regardless of which chemo you end up getting.  I had asked my husband's 80-year-old cardiologist about Adriamycin back when I started chemo in Oct.  He told me he used to see many cancer patients coming in with damaged hearts.  However, he made a point that many of these patients had not had proper testing -- prior to using Adriamycin -- which would have showed their hearts were not in the range to use this drug to begin with -- many oncs would only give an EKG rather than an Echo or a MUGA scan (a different technique of measurement) to more clearly define heart health.  Nowadays, with proper testing, he said it is rare to see a heart patient with Adriamycin damage.",
      "MessageIndex": 59,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 6, 2013 08:11AM encyclias wrote: Lana, I've never had any problem from my port, installed in Oct, except that it is so darned ugly.",
      "MessageIndex": 109,
      "PostDate": "06/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 19, 2013 03:54PM - edited Jul 19, 2013 04:45PM by encyclias Grace, I would think it will be a meeting to discuss different surgical options.  At this point, there is no way to know just how successful your chemo will be.  My chemo (a/c x 4 @ 3 wk intervals) almost totally wiped out the two large tumors I had, leaving mostly just a need for mopping up.  So my surgeon just did a lumpectomy, took samples to run through pathology, checked the margins where the tumors had been, and pulled out that lonely little 3mm residual cancer bit from what had been the larger of the two tumors.  Also, a SLNB biopsy was clear.  The mastectomy option was dropped. I'm at the last of my rads now, just 4 boosts to go, and I will be turned loose for a month or two (which in itself is scary). Good luck in your treatment.  You can beat this. Carol",
      "MessageIndex": 422,
      "PostDate": "19/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 21, 2013 08:37AM encyclias wrote: peace, I am a diabetic.  Type 2, and hereditary -- everyone in my family, and I do mean EVERYONE for generations, gets it around retirement age and never seem to have any complications.  Didn't surprise me a bit when it showed up a few years ago.  I take Metformin and Amaryl daily. When I was diagnosed with BC, my internist -- who treats my diabetes -- told me to just keep on taking my pills. His wife is a BC survivor.  He warned me not to lose weight and to try to eat regularly.  As for diet, he went on to say that until at least the chemo was done, I should eat what a felt like of comfort foods, but not to go hog wild with them.  In other words, a medium portion of mashed potatoes but not a whole mixing bowl full.  He further said having a few months with higher blood glucose is not going to cause me harm, that there would be more harm in not eating. I cannot speak for diabetics who depend on insulin.  That advice has to come from a diabetes doctor who knows his patient well. Carol",
      "MessageIndex": 476,
      "PostDate": "21/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 24, 2013 05:07PM encyclias wrote: Mellie, don't take the chance with buffets unless you know what your white cell count is that day.  I would know because I had blood lab the day before each chemo; that usually became the buffet day depending on the count.  While I took precautions with not handling serving pieces, I never went buffeting when my wbc count was below the normal mid-range.  Not worth the disaster it could cause. We eat out every other day at regular restaurants, and the chemo never became a problem.  But I did do a lot of handwashing during those months.",
      "MessageIndex": 548,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Aug 2, 2013 11:12AM encyclias wrote: Momx2, sending my deepest sympathy to you and your family.  Losing a mom is a terrible thing. Carol",
      "MessageIndex": 800,
      "PostDate": "02/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Dec 30, 2013 07:00PM encyclias wrote: My chemo was neo-adjuvant on the recommendation of my MO and surgeon.  What it did was shrink my two tumors (totaling 5cm), to just a single 3mm bit -- less than the size of half a greenpea.  My LX afterwards was quite easy and totally unnoticeable with such a small crumb to remove.  The margins were wide and clear.  The SNB showed there was no longer cancer in the nodes -- actually, there had been several nodes involved originally rather than just the big one that was felt by the onc.  My doctors felt confident that the chemo had done its job and also clobbered any other cancer cells which may have been floating around in my body just as it had clobbered the two breast tumors and the nodes.  I then went on to request radiation just to make sure there weren't any strays locally still in my breast. I had a PET scan last month, and very different from my first one in Oct 2012, this one was clear of cancer.  Hope it will last. Had I done it the other way, with adjuvant chemo instead, I would have had to have a MX or settle for a LX and a very deformed breast (I am not big-breasted).   I am a diabetic and as such, it is well known that we don't heal wounds very easily in general; so certainly a MX or BMX would not be a first choice -- and certainly not reconstruction either.  It wasn't an issue of vanity; it was more an issue of potential healing problems.  Also ripping out a bunch of lymph nodes could certainly cause future permanent complications, such as lymphedema.  And then, as has been brought up, there would be no way of knowing if the chemo actually worked!  This board has many threads titled  --  (your choice of: taxol, taxotere , A/C) -- \"didn't shrink my tumor.\"  What if this happened during adjuvant rather than neoadjuvant chemo?  How would the doctors know, except waiting to see if the cancer shows up somewhere else in the future? But doctors have their own protocol which they feel works for them.  Hopefully, theirs will work for you.  Good luck!  The choices can drive you crazy. Carol ",
      "MessageIndex": 20,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/816047",
      "Title": "Stage III+ with a 1.5 cm tumor? I can't get my head around this paloverde Holeinone"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 17, 2013 03:48AM encyclias wrote: Rose, for me it's been about a decade since the end of menopause.  When my cancer was diagnosed, I was sent for a PET scan.  The doctor who did it was going over the film with me and she mentioned: \"See, there are your ovaries.  They have shrunk to the size of raisins and are no longer functioning, which is perfectly normal after menopause....\" In my own case, I would not seek surgery to remove two non-functioning ovaries at this point in time.  If yours are no longer functioning and have shrunk to just a shadow of their former selves, you may not need it either, something to ask your oncologist.",
      "MessageIndex": 2,
      "PostDate": "17/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/806227",
      "Title": "Removal of ovaries Rose12 Rose12"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Aug 24, 2013 11:11PM encyclias wrote: cynthia, no, the wire localization is generally for lumpectomies and other surgery, not biopsies.  Carol",
      "MessageIndex": 25,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809670",
      "Title": "Lumpectomy Told different stories about wire localization IrishDancingMom dogsandjogs"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jan 3, 2014 10:19AM encyclias wrote: Warrior, it's been found that chemo works especially well on ER- breast cancer, better than it does on ER+. Carol",
      "MessageIndex": 117,
      "PostDate": "03/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/815985",
      "Title": "Oncotype Dx Test Anyone? Warrior_Woman Jojo0529"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Oct 1, 2013 11:46AM encyclias wrote: Which chemo drugs are they going to give you?  They have many different side effects. Courage!  If a wimp like me can make it through A/C chemo, anybody can.  Hoping you have an easy day. Carol",
      "MessageIndex": 39,
      "PostDate": "01/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/811564",
      "Title": "In Total Shock!!!!!!! carissabforlife Kiko"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Nov 2, 2013 05:34PM - edited Nov 2, 2013 05:39PM by encyclias I didn't have any problems eating or drinking anything during chemo. But about a month or so after, I totally lost my desire to eat three things: baby-back ribs, pizza - especially with extra cheese -- and fried chicken. All ick, and no idea why. But as a different problem, from about the same time (January '13) until now, I have noticed that I get queasy every day at dinnertime; whether we eat at home or go out to a restaurant. I can eat before dinnertime or eat in the evening. But I can't eat from about 5:30 to 7:00. Anyone else get mealtime queasies? Carol",
      "MessageIndex": 8,
      "PostDate": "02/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/813351",
      "Title": "unable to eat meat and other questions about chemo lovewins encyclias"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 5, 2013 06:26PM encyclias wrote: My RO says no tattoos.  I asked him why, and he replied that the tattoos were originally designed to  mark exactly where a patient had had rads prior, even years before.  And he went on to say that with the computerized medical records we have nowadays, there is no longer a reason to permanently mark the patient. And here I was, hoping for some wee kitty tats.",
      "MessageIndex": 284,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 28, 2013 07:32AM encyclias wrote: We don't have a bell, either.  Only one is in the chemo room.  Started rads on June 10th.  So far, I just get a medium pink immediately after, which fades away overnight.  No pain yet.  Got my Aloe plants ready for use when the time comes.  In addition, my RO says if I want, I can use any mild moisturing lotion that doesn't have perfume in it.  I am certainly looking forward to the weekend. Congrats to those who have completed their rads. Carol",
      "MessageIndex": 637,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 5, 2013 04:08PM - edited Jul 5, 2013 05:18PM by encyclias I got the same advice from my RO, don't put on anything if you are not having a problem, and then he will give me some aloe to use (I already have several plants of my own).  He warned about suddenly using some cream/oil/moisturizer for the first time, especially on broken skin, without any type of patch testing -- like a couple days on my healthy breast or on a minor scratch elsewhere.  It seems that he sees some rad patients who superimpose a contact dermatitis as a reaction to a new skin product, an allergy or sensitivity to a component of it, that is unrelated but will look like rad damage.  Sounds sensible to me.",
      "MessageIndex": 789,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 11, 2013 11:02PM - edited Jul 11, 2013 11:04PM by encyclias McKatherine, I am up to my 24th rad and have yet to have any fatigue.  I sure remember the fatigue I had towards the end of my chemo; haven't felt anything remotely like it with rads.  My skin is still intact with an occasional red bump and bit of itch here and there.  Mostly it just looks like I have a  suntan on my right breast.  Hope that continues; I have 5 reg rads and 5 boosts.  My RO said the boosts won't be a problem. Carol",
      "MessageIndex": 887,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 19, 2013 09:23PM encyclias wrote: Hi CLYDAY!  Yes, I am in Pensacola.  Hi again, beachbound!  Surprised to see there are three of us on the board from a relatively small city. Finishing the last of my rads next week at Sacred Heart's Cancer building, at West Florida Hosp rather than at their bigger facility on Airport. Carol",
      "MessageIndex": 1046,
      "PostDate": "19/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 20, 2013 12:08PM encyclias wrote: Thanks beachbound and GWTF.  These markings have been on me for six weeks now.  They don't rub off, smear off, melt off, wash off.  When you run your finger across them, they are raised up and remind me of miniature asphalt roadways.  I'll find out Monday morning how to get them off.  The markings they put on me last week for my boosts seem to be just Sharpies; I've already half washed them off.  I get there about 9:00 am, if you are around, beachbound. Thanks both, Carol",
      "MessageIndex": 1065,
      "PostDate": "20/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 24, 2013 08:53PM encyclias wrote: itis, I finished chemo the end of Dec, had my lumpectomy in early April, and started rads on June 10th.  So between the chemo and rads we are talking about 5+ months.  And tomorrow is my last boost, wooohooooo!",
      "MessageIndex": 1128,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 25, 2013 07:59AM encyclias wrote: shipsgirl, congratulations on finishing chemo!!  Way to go!",
      "MessageIndex": 1137,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 25, 2013 10:13PM encyclias wrote: Thank you, Melody. Johnetta, the rad treatments I had took about 4 minutes or so.  I got four zaps to my breast from different angles: left, overhead, right, and then through my back upward to my breast.  The zaps themselves only take a few seconds each.  The positioning is what takes the time.",
      "MessageIndex": 1154,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Sep 12, 2013 02:41PM encyclias wrote: JDB, I never got any fatigue at all from rads.  It may have helped that I live only a few minutes drive from the center. Carol",
      "MessageIndex": 1506,
      "PostDate": "12/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 19, 2013 01:13PM - edited Jul 19, 2013 01:14PM by encyclias Had to check it out first, Beachbound.  I googled henna tattoo Pensacola and came up with five links for henna artists right here in this small city.  Try your city. Carol",
      "MessageIndex": 1040,
      "PostDate": "19/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 25, 2013 09:12PM encyclias wrote: I had periodic x-rays all through my rads. Carol",
      "MessageIndex": 1150,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 13, 2013 11:55PM - edited Jun 14, 2013 12:00AM by encyclias Sandy, I only had my 4th rad treatment today, but had a stinging pain at the surgical site from the very 1st.  I also have a seroma located there.  Nothing really painful; more annoying but only lasts a couple hours. Sat down and had a discussion as well with my RO today and he said it was fairly common to have some pain along the scar, and that some patients also get shooting pains in the breast; not to worry and let him know if I needed any painkillers.  I am trying to be optimistic and hoping to breeze through these rads.  But if not, I do have a doctor who will try to keep me comfortable, which is a tremendous relief. I also asked him what damage I can expect to my innards and he told me just the very top of my right lung and that my heart is a 'zipcode' away from the beam. I wish everybody pain-free success with their treatments.  I will be so glad when this is over Carol",
      "MessageIndex": 404,
      "PostDate": "13/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 26, 2013 12:00PM encyclias wrote: bluestars, there is a poster in my doctor's office which says: \"80% of breast cancer patients have NO family history of breast cancer\"  No doctor has yet come up with any specific reason for the 80% who get it.   Lots of theories, some totally crackpot and some just unproveable, have been floating around for years.  But research goes on.  It probably won't be too long in the future that there will be vaccines and cures.  That will come, maybe even soon enough for some of us to benefit. Congratulation on your BRCA negative result!  That is wonderful news. Carol",
      "MessageIndex": 611,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Dec 29, 2013 09:55PM encyclias wrote: littlebit, contact your local health dept (usually county).  They can arrange for free or low-cost mammograms and will be your best information source for local help available.  I live in a military town also, yet we have several govt and charitable cancer resources here.  Good luck to you.",
      "MessageIndex": 6,
      "PostDate": "29/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/816262",
      "Title": "No insurance but concerned Littlebit27 Littlebit27"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Mar 1, 2014 03:14PM encyclias wrote: Bella, have seen an oncologist yet?  They may have other options which will work equally well but without as much damage risk. Good luck to you for the best outcome. Carp;",
      "MessageIndex": 27,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/818459",
      "Title": "1st Meltdown BellasKids AZ85048"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Aug 24, 2013 03:59PM encyclias wrote: GO!",
      "MessageIndex": 4,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/809763",
      "Title": "Concert during chemo? Cougarlicious sundermom"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 16, 2013 03:31PM encyclias wrote: Thanks, Heart.  You have given me some hope.  My surgical scar and the seroma under it from my April lumpectomy is still very sensitive, and when I started rads last Monday, later that afternoon it started to sting.  And it has been the same for the treatments later in the week.  My RO said it was not uncommon and that it probably will go away during rads.  It seems to hurt about 4-5 hours after treatment, and then mostly disappears a few hours later. Wishing all a relatively painless experience with their rads, and congrats to those who are about to graduate. Carol ",
      "MessageIndex": 443,
      "PostDate": "16/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 22, 2013 11:33PM encyclias wrote: cricketsand frogs, you need to sit down with your RO and ask about potential lung damage.  Mine had no problem telling me that the very top, a small percentage, of my right lung will have some damage that should not noticeably affect me.  I also asked about my heart, and he said that my heart is \"a zip code away from the beam.\"  Whew! Everybody is different as to where the focus of the radiation is.  You have a very valid concern; ask your doctor. Carol",
      "MessageIndex": 546,
      "PostDate": "22/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 26, 2013 10:08AM encyclias wrote: Just finished my 13th rad and was out shopping yesterday at Lowe's.  They just got a new batch of Aloe vera plants in the garden center.  I decided to pick one up to go with the one I already have  -- just to make sure I will have enough if I start to get the dreaded burning and skin damage.  So far, just a tiny bit of painless tan.  Hoping it will remain that way.  Can I be that lucky? Carol",
      "MessageIndex": 594,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jun 29, 2013 07:05AM encyclias wrote: Thank you, ldesim.  I hope you are right.  On to my weekend.  Today is our orchid auction!",
      "MessageIndex": 647,
      "PostDate": "29/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 2, 2013 01:34PM encyclias wrote: Soteria, after all their drawing and planning was finished and just getting normal rads, I walk in the door and sign in -- let's say 9:00 AM.  Go the dressing room, take off my shirt, put on a gown, wait a minute or two (unless they have a bit of a backlog due to outside causes) and go into the rad room, put down my purse and eyeglasses, climb on the table, have the two techs position me, stuff a wedge under my knees.  I get five zaps from different positions/angles of the machine.  Takes about seven or eight minutes, if that long.  Then I get up, hit the dressing room, get my shirt, my purse, put the gown in the hamper, say goodbye to all, and head out the door to the parking lot by 9:25.  This is how it has been for the past 17 rad treatments.  Hope they will continue this fast and easy ... (praying for my skin, that it doesn't do too badly) Hopefully, they will take care of your pain problems once you are down to routine rads. (I can swear my table is padded except for the neck and head holder part that hurts the back of my neck.  I'll look tomorrow now that my curiosity is tweaked)",
      "MessageIndex": 714,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 17, 2013 05:28PM encyclias wrote: Heart, so sorry you are feeling under the weather with that cough.  Just figured I might mention that a good friend of mine went to a big family reunion in the Midwest -- she's from the Southeast -- and came home with whooping cough.  It took her doctors and a specialist almost 3 weeks to diagnose since until recently, it has been so rare.  But it seems to be passing around now as less children get vaccinated.  She, being of retirement age, I suppose that her childhood vaccination had long since worn off.  I think it's only effective for 10 years. I got a DPT vaccine about two years ago when I went to my doctor and asked for a tetanus shot booster.  Dr said all he had at the moment was the DPT.  Well, I don't particularly like putting extra drugs into my body.  But then he said those magic words,  \"I won't charge you extra for the other two, the diptheria and pertussis.\"  Wow, now that was a bargain!  I like three for the price of one, cheap Scot that I am. Just saying. I hope you feel much better soon, Heart. Carol",
      "MessageIndex": 994,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 20, 2013 10:10AM - edited Jul 20, 2013 10:11AM by encyclias Thank you, GWTF.  These are not just Sharpie types of markings.  It's some sort of a very thick ink.  Last night, I tried getting rid of the ones which are not adjacent to the radiated areas of my breast.  So far, it is a tie between alcohol and nail polish remover.  Problem is the ink is so thick that you have to keep going over and over the line.  Eventually, they will probably wear off; I really want to wear my tank tops again without the no-longer-needed lines sticking up above the neckline.  A little kid in a restauant thought I had really awesome tattoos; had to tell him they were just painted on.  He was so disappointed, lol. I am sure there is some sort of secret remover for this stuff. Carol",
      "MessageIndex": 1062,
      "PostDate": "20/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 25, 2013 07:08PM encyclias wrote: Thanks nyama.  My RO actually wrote me a real prescription that I take a vacation, lol. Patricia, it doesn't have to be water.  Any fluids will do: milk, fruit juice, soda, Kool-Aid, broth, ice pops, and the best of all (....drumroll...) coffee!  But remember, coffee is also a diuretic and could contribute to constipation if that's a problem.",
      "MessageIndex": 1145,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Aug 10, 2013 05:55PM encyclias wrote: I know exactly how you feel.  I finished rads a week and a half ago and am feeling somewhat adrift without constant medical supervision.  I am taking an Ativan each day to try to keep the anxiety under control until the fear wears off a bit with time.   I hope you get your anxiety under control also. Hugs, Carol",
      "MessageIndex": 1279,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Aug 27, 2013 03:00PM - edited Aug 27, 2013 03:00PM by encyclias Woohooo!  Beachbound! Are you getting your chemo in the same building as your rads? Carol",
      "MessageIndex": 1420,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Apr 3, 2014 11:09AM encyclias wrote: I finally had my port removed about 10 days ago.  My chemo ended around Christmas of 2012, but I hung onto the port as a security blanket -- figured the minute I took it out, the cancer would come back.  But I have been thinking about summer coming ... and bathing suits ... and tank tops; well, the darn thing was so hideous looking on my rather thin chest, like a big ugly boil. So it's out now.  Hopefully my chest will return to its normal scrawny appearance soon. Carol",
      "MessageIndex": 5,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819806",
      "Title": "When / or Did you have your Port Removed after Chemo? laurie2025 Spookiesmom"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Oct 2, 2013 08:46AM encyclias wrote: Bless her heart; she's 90 years old! Your mom is going to have to have a biopsy first before anything else to verify that it is cancer.  It's generally done under a local anesthetic, takes a few minutes for most of us; my two lumps were done in about 20 minutes and relatively painfree.  A bit of soreness the next day, took a Tylenol.",
      "MessageIndex": 6,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/812045",
      "Title": "Best Doctor for 90 Year Old Patient DoRightByMom salspecs"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Nov 5, 2013 12:18PM encyclias wrote: I had one two weeks ago, 'eyes to thighs', and almost exactly to the date of the one I had last year which found involved lymph nodes that no other test could see. Anyway, my PET is now clear; no sign of mets anywhere in my body - gives me an excuse at least to bypass a colonoscopy, lol. A great relief that my bones and other organs appear okay at the moment. However, like all scans, it can't see anything less than 5mm.",
      "MessageIndex": 6,
      "PostDate": "05/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/811185",
      "Title": "PEM scan keepthefaith encyclias"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Apr 20, 2014 12:50PM encyclias wrote: Don't overdo it, ladies, but I drove myself to all my chemo, both of my Neulastra shots, and all my rads without any problem.  I live about five minutes from the treatment center, so that helped immensely.  Good luck to all of you.  May your treatments be easy. Carol",
      "MessageIndex": 267,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Apr 24, 2014 05:14PM encyclias wrote: Sharon, aloxi is a wonderful anti-nausea drug. Sending thoughts to all that your treatments will go easy and you will be done with chemo before you know it. Carol",
      "MessageIndex": 358,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Apr 11, 2014 09:35PM encyclias wrote: Optimistictraverler, I agree.  I got a PET scan in Oct '12 right after my biopsy and diagnosis since swollen axillary nodes could be clearly felt, and those axillary nodes lit up on the PET.  Also, so did the medistinal nodes under the sternum, between the lungs.  But thankfully, the cancer did not show anywhere else.  After neoadjuvant chemo, a lumpectomy and rads, a follow-up PET scan the following Oct was clear.  I much prefer a PET scan and hope I can continue them on an annual basis, but I doubt that will happen because they are several thousand dollars and I don't think Medicare will approve any more of them without a real reason. Carol",
      "MessageIndex": 143,
      "PostDate": "11/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819132",
      "Title": "Freaked out and have no idea where to start Ddkath70 Holeinone"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Apr 19, 2014 07:38PM - edited Apr 19, 2014 07:38PM by encyclias Lemonade, they can't use your port for radioactive isotopes; I've had two PET and one MUGA scan, and that's what the techs tell me each time. Good luck! Carol",
      "MessageIndex": 252,
      "PostDate": "19/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Apr 20, 2014 04:47PM encyclias wrote: Weren't you immunized as a kid, clarrn? Carol",
      "MessageIndex": 273,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/819587",
      "Title": "Starting Chemo in April 2014 Kazzy115 Sunshine36"
    },
    {
      "AuthorID": "encyclias",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175965/profile",
      "Content": "Jul 17, 2013 04:24PM encyclias wrote: tallydiver, does your mother live close to either of the two facilities?  Standard radiation treatment involves being at the facility five days each week for about six weeks, generally.  A total of about 33 treatments for most of us.  Treatments only take a half hour or so, but distance can be a serious problem for daily visits. Best wishes to your mom for a completely successful recovery. Carol",
      "MessageIndex": 21,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/805828",
      "Title": "Mom - 64 just diagnosed and need your help. tallydiver tallydiver"
    }
  ]
}