{
  "AuthorID": "EnergizerBu…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
  "Posts": [
    {
      "AuthorID": "EnergizerBu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
      "Content": "Jul 15, 2009 07:04AM EnergizerBunny wrote: Clean breasts here also!",
      "MessageIndex": 5,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737406",
      "Title": "How many of us have mets but clean breast vivo Roxanne1"
    },
    {
      "AuthorID": "EnergizerBu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
      "Content": "Jun 22, 2008 11:25PM EnergizerBunny wrote: Nancy - I had similar pain for a very long time.  Had the dentist check and fine tune my bite, and had a bite guard made.  After finally being diagnosed with the mets - found out that my madibular was indeed involved.  Some of my treatments made the pain worse for a while and then it pretty much went away.  Every once in a while I still get pain after treatment.  I have found that where I tend to get the pain is where we see the improvement on the tests - my treatment at work!",
      "MessageIndex": 12,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707440",
      "Title": "Any one with bone mets that only hurt upon touch? NancyM Malinda"
    },
    {
      "AuthorID": "EnergizerBu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
      "Content": "Jun 22, 2008 11:24PM EnergizerBunny wrote: Nancy - I had similar pain for a very long time.  Had the dentist check and fine tune my bite, and had a bite guard made.  After finally being diagnosed with the mets - found out that my madibular was indeed involved.  Some of my treatments made the pain worse for a while and then it pretty much went away.  Every once in a while I still get pain after treatment.  I have found that where I tend to get the pain is where we see the improvement on the tests - my treatment at work!",
      "MessageIndex": 10,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707440",
      "Title": "Any one with bone mets that only hurt upon touch? NancyM Malinda"
    },
    {
      "AuthorID": "EnergizerBu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
      "Content": "Jun 22, 2008 11:24PM EnergizerBunny wrote: Nancy - I had similar pain for a very long time.  Had the dentist check and fine tune my bite, and had a bite guard made.  After finally being diagnosed with the mets - found out that my madibular was indeed involved.  Some of my treatments made the pain worse for a while and then it pretty much went away.  Every once in a while I still get pain after treatment.  I have found that where I tend to get the pain is where we see the improvement on the tests - my treatment at work!",
      "MessageIndex": 11,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707440",
      "Title": "Any one with bone mets that only hurt upon touch? NancyM Malinda"
    },
    {
      "AuthorID": "EnergizerBu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
      "Content": "Nov 26, 2007 03:16PM EnergizerBunny wrote: What a sad and empty life she must have to spend her energy on that.  Unhappy people need others to be unhappy to feel better.  I'm so sorry that you have had to deal with it.  We'll help any way that we can!",
      "MessageIndex": 19,
      "PostDate": "26/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695377",
      "Title": "Intruder on our Boards ruths2 chemosabi"
    },
    {
      "AuthorID": "EnergizerBu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
      "Content": "Sep 2, 2009 01:19PM EnergizerBunny wrote: Jennifer - I pmd you - please check when you get a chance.",
      "MessageIndex": 12,
      "PostDate": "02/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739402",
      "Title": "Single Moms - Custody after we are gone? JeninMichigan hermajesty"
    },
    {
      "AuthorID": "EnergizerBu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
      "Content": "Sep 1, 2009 09:42PM EnergizerBunny wrote: Chrysanthemum - I did not have this particular combination, but did have Paclitaxel (trade name Abraxane) and am now on Carbo and Avastin.  The Paclitaxel caused hair loss, some peeling of the hands and feet, all-over skin dryness and after the first round - extreme bone pain.  However, I have to attribute some of the pain to the neulasta shot also.  I continued to have some additional pain after each tx, but starting a pain med regimen before each round helped immensely.  I'm not sure what to think of the Avastin yet - just had first round.  I had more nausea after this last tx than with others - but don't know if it is the Avastin or Carbo.  I know what you mean about constantly switching treatments - this is my third chemo change so far this year!  I'll send good thoughts your way.",
      "MessageIndex": 1,
      "PostDate": "01/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739830",
      "Title": "Starting new treatment chrysanthemum EnergizerBunny"
    },
    {
      "AuthorID": "EnergizerBu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
      "Content": "Nov 27, 2007 06:18AM EnergizerBunny wrote: There is an anonymous saying, \"Adversity introduces a man to himself\".  I believe that it also introduces us to the people around us!  I have faced the same attitudes and misconceptions that you are all talking about.  When I start giving in to the pressure that I should feel differently than I do, I remind myself that I have the right to feel as I do without guilt.  When I'm able to own my feelings without guilt, I find that the need for explanations, excuses or apologies no longer exists.  Mind you, it doesn't happen all the time, but I'm getting better at it.  I was once on the other end of the equation.  One of my employees had horrible back problems.  I was constantly telling her what she needed to do, how to sit and walk, feeling that she was adding to her demise by giving in to the pain.  Alas, I also thought some of it was for attention.  When my pain began, I found people around me having the same reaction.  Boy, we are so critical and judgmental, especially when we can't see the disease or the pain.  It wasn't until I began this journey (stage iv) that I saw how wrong I had been.  Live and learn, and assert your right to your own feelings.  We may not be able to convince others, but we don't need to.  Spend that energy on yourself - that will be the best testimony in the end.",
      "MessageIndex": 11,
      "PostDate": "27/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/695919",
      "Title": "Have u ever encountered anyones attitude without BC? Ter EnergizerBunny"
    },
    {
      "AuthorID": "EnergizerBu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
      "Content": "Aug 15, 2009 01:07AM EnergizerBunny wrote: Hey Wayover - I can relate.  I also have it in both femurs and tibias, as well as sternum, pelvis, hips, ribs, spine, neck, skull and jaw.  So we have to pick and choose rads when necessary.  Yes, rads usually helps with pain quickly - it is unusual for rads not to work.  I had rads (while doing chemo), to the base of the skull to prevent future problems.  I started with aredia (similar to zometa), and arimdex (hormonal treatment).  However, the cancer progressed.  I went for a second opinion and began xeloda (oral chemo) and zometa.  We took a three month break after a year and attempted to keep stabalized with hormonal treatment.  However, the cancer progressed.  We did three rounds of abraxane, but still had progression, then three rounds of doxol and when I go back on August 24th, we'll do a pet scan and possibly try a new chemo since my tumor markers have still been going up.  But, through all of this I am happy that it has not progressed to any other organs!  What concerns me is the pain you are experiencing.  I had the same problem and when I got my second opinion, the first thing they did was address the pain issue.  Thank goodness!  I was using a cane when I went there and now I'm doing great!  Insist on pain management!!  I have been dealing with this three years now, but I am optimistic.  I hope your treatment goes well - keep us updated. ",
      "MessageIndex": 12,
      "PostDate": "15/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738838",
      "Title": "Now bone mets, need encouragement wayover20 kbugmom"
    },
    {
      "AuthorID": "EnergizerBu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
      "Content": "Sep 2, 2009 05:21AM EnergizerBunny wrote: Andyr1- It is very difficult at times not to distress over any new ache or pain.  Has your mother informed her oncologist about the stomach pain?  I would truly urge her to do so.  Have you talked with your mother about the Lexapro and her opinion of whether or not it has had any type of effect?  Who (besides her obviously loving daughter) does she talk with about what is happening in her life?  Most cancer centers have a psychologist or psychiatrist on staff for patients - if she is going to an oncologist with a private practice, they should be able to recommend someone in the area who deals with cancer patients.  Everyone has some slumps - believe me.  We all have different ways of dealing with the difficult times - some use work, some use their faith, others use friends, relatives or co-workers, some may use meditation, imagery, therapy, support groups, activities, discussion boards, chat rooms, personal reflection or even fun (the list is endless).  I would suspect that most use a combination of methods.  I hope that your mother receives good news when she gets her scan - in the meantime I hope that you are able to talk with her about getting some assistance with the feelings she is having now. And don't forget to take care of yourself also!",
      "MessageIndex": 1,
      "PostDate": "02/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739685",
      "Title": "recurrence andyr1 ElaineD"
    },
    {
      "AuthorID": "EnergizerBu…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48656/profile",
      "Content": "May 12, 2009 08:47PM EnergizerBunny wrote: I know exactly what you mean cheryl - sounds like a page out of my own life.  When I have good days I overdo it trying to make up for lost time and then pay the price. While my husband does the outside work and auto care, I am responsible for the house.  It is in dire need of a deep cleaning and clearing out of stuff as all of my children are grown and gone.  Am trying to get to it, but it will take forever.  I have nine rooms and three bathrooms to tackle with two sets of fairly short stairs.  If I don't have to do the stairs much, I can work a lot longer.  If the housing market was better, we would sell and downsize.  I have thought many times about getting in some help, but haven't been able to make myself do it.  I also do some babysitting for my new granddaughter and on those days I don't get much else done.  Let me know if you get some help and how you like it!",
      "MessageIndex": 6,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733989",
      "Title": "POLL: What type of help do you get around the house? mason204 KLee"
    }
  ]
}