{
  "AuthorID": "EnglishLass…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219660/profile",
  "Posts": [
    {
      "AuthorID": "EnglishLass…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219660/profile",
      "Content": "Aug 10, 2015 04:15PM EnglishLass wrote: Thank you lefty37 and the Mods for your good wishes,I'll let you know how I get on. ",
      "MessageIndex": 3,
      "PostDate": "10/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834061",
      "Title": "Deep ache spreading to shoulder and down arm EnglishLass EnglishLass"
    },
    {
      "AuthorID": "EnglishLass",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219660/profile",
      "Content": "EnglishLass wrote: Hi All, Whilst stretching up at work and being taken aback by the pain, I discovered a very painful lump 5 days ago and didn't feel right, so managed to see my Doc the following day, who has referred me to the BC clinic and I'll be seeing them on Friday 14th. The ache has been constant since, sometimes being a pain worsening in waves and has now travelled down my arm, giving me a tingling almost pins and needles sensation in it and my shoulder. The ache in my breast feels deep ( like that warm, fuzzy, tight feeling in your chest when you have the flu). I can't get comfortable and have difficulty sleeping. The lump is very small, like a pea and hard. There's no history in the family, so hoping it's a cyst pressing on a nerve which they'll be able to drain or remove. Sharing in case someone else is similar and it feels good to let it out too. X Somewhere around the corner, all is well Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834061",
      "Title": "Deep ache spreading to shoulder and down arm EnglishLass EnglishLass"
    },
    {
      "AuthorID": "EnglishLass…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219660/profile",
      "Content": "Aug 13, 2015 07:48PM EnglishLass wrote: Hi BarredOwl Nothing pulled, but I can see my post sounded like I had. It was my arm briefly pressing on my breast that caused the pain. I'm being seen tomorrow so hoping they can give me some relief from this ache. Thank you for your good wishes and take care. ",
      "MessageIndex": 5,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834061",
      "Title": "Deep ache spreading to shoulder and down arm EnglishLass EnglishLass"
    }
  ]
}