{
  "AuthorID": "enthused",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83246/profile",
  "Posts": [
    {
      "AuthorID": "enthused",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83246/profile",
      "Content": "enthused wrote: Back in January, my mom had her first mammogram done. They found what appeared to just be a \"spot\" and she was sent in to get it removed. The surgeon had told her that it was in a pre-cancer stage, and was just a spot, it hadn't turned into a tumor or cancer yet. She went in, had it taken out, and a week later went back to see the surgeon. The surgeon then told her that it was a tumor and it was cancerous. She was told she would need a partial or total mastectomy. She was told to go home and think about which one she wanted done and come back next week with her decision. The next week I went with her to see the surgeon, and she had decided on having a partial mastectomy. After asking a bunch of questions, everything was set UNTIL my mom asked her about the second little spot they had found beneath the first one. The surgeon had forgotten all about that, and then she had to postpone everything even longer because she needed to do a biopsy to get that little one out and test it for cancer. From this moment on myself and my mom have not liked this surgeon, but we stuck with her instead of getting a second opinion. After the second little \"spot\" coming back as cancer, the surgery date was rescheduled again. We were told that she would have to go the day before to get this \"dye\" shot into her breast, which would then tell them the next day exactly which lymph nodes were infected, and then they would take them out. 4-6 weeks after this she would need just radiation. Well, she had her surgery on April 23rd, about a week and a half ago. They took out one lymph node, and we went back to see the surgeon last friday. Once again, she changed what she was saying, and told us she needed to go back in as that one lymph node was infected. She also told us that by going back in my mom would need chemotherapy in addition to radiation. She would not answer how many she needed to take out now, and this whole procedure has just been a mess. She left it at that and told us to come back next week to discuss surgery dates.  At this point we are both confused. My dad thinks we should just stay with the current surgeon, but my mom and myself both do not feel comfortable with her anymore, as she changes her story quite often, making it harder and harder every time we go back in. She doesn't explain things and just shoots patients in and out one at a time. When we ask her questions, she doesn't give a clear answer, and constantly changes what she has to say.  I guess what I'm after is just to know if the procedure that things are taking place in for my mom is what usually happens? And also is it too late to get a second opinion? We have both felt something off about the whole thing since the beginning where a \"spot\" that was what cancer is before it turns into cancer suddenly turned into a just under 2cm tumor, and now all this. Sorry if this was long, and TIA!  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733605",
      "Title": "Need some help understanding.... enthused stateofgrace33"
    },
    {
      "AuthorID": "enthused",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83246/profile",
      "Content": "May 4, 2009 08:46AM enthused wrote: We are in Vancouver, Canada.  At the end of the last visit, after she told us she would do the surgery in 2 weeks, she then changed it again, saying she would do a MRI first and some sort of bone scan to see if it had spread to the bones? She isn't very clear on things and is constantly changing her mind as to what she wants to do.",
      "MessageIndex": 2,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733605",
      "Title": "Need some help understanding.... enthused stateofgrace33"
    }
  ]
}