{
  "AuthorID": "eot28",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
  "Posts": [
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Sep 29, 2016 04:26PM eot28 wrote: Thanks for starting the thread, Javamama :). I am scheduled for my PBMX without reconstruction on October 11th.",
      "MessageIndex": 1,
      "PostDate": "29/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/848523",
      "Title": "October 2016 Surgeries javamama yogadedra"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "eot28 wrote: Hi there, I had a double mastectomy without reconstruction on October 11. This was prophylactic so I had no lymph nodes removed. I woke up with swelling in hands and pins & needles feeling in hands. Since the surgery the hand numbness/swelling and pins & needles feeling has been persistent and over the past few days the feeling has spread up both arms, tops of my shoulders, neck and now in my lower face. It's not completely numb but feels like it feels when your foot falls asleep. I'm now almost 3 weeks out from surgery. I have some cording in my left armpit and I start physical therapy this week for that. I'm wondering if anyone has experienced this? Online I read it's called paresthesia. I can't seem to find any reference online of it being this wide-spread (only see references to people having it in their armpit or upper arm after axillary dissection). Thanks! Surgery 10/10/2016 Prophylactic mastectomy: Left, Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/849461",
      "Title": "Paresthesia after mastectomy (pins/needles in hands etc.) eot28 Marcia_Taylor"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Oct 31, 2016 02:33PM eot28 wrote: Thanks so much ksusan. Good to know that manual drainage and fist pumping helped. I have cording in one arm even though I had no lymph nodes out so I do wonder if manual drainage might help. I'm also restricted in my sleep positions so that's good to know that moving around at night also helped. I'm wondering also if it could be scar tissue compressing the nerves more (since it's getting worse in these 3 weeks post-surgery). It started with just my hands after surgery and now it's definitely been spreading. I'm crossing my fingers that PT can help. I'll also look into manual lymph drainage. Ksusan, did you go to a lymphedema specialist to get the drainage or were you able to learn how to do it yourself? Thanks again!",
      "MessageIndex": 6,
      "PostDate": "31/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/849461",
      "Title": "Paresthesia after mastectomy (pins/needles in hands etc.) eot28 Marcia_Taylor"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Nov 11, 2016 10:52PM eot28 wrote: Jennj99738 - I'm sorry you're dealing with such pain. I had my BMX on Oct. 11 and I also have some nerve pain in both elbows. Sometimes it's dull pain and I can't figure out exactly what's causing it. I am going to PT twice a week and I have cording in my left arm which might explain the elbow pain, but it doesn't explain the right elbow pain. I also have a lot of swelling though (sometimes down my arms and in hands) which could also be pressing on nerves. I didn't have expanders put in (no recon yet) so I can't speak to whether the expanders could be causing the pain but hopefully someone else with experience will chime in. I hope things get better for you! This is definitely difficult stuff to deal with.",
      "MessageIndex": 14,
      "PostDate": "11/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/849461",
      "Title": "Paresthesia after mastectomy (pins/needles in hands etc.) eot28 Marcia_Taylor"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Nov 11, 2016 10:53PM eot28 wrote: ksusan - thanks so much. Really glad to hear your swelling subsided after radiation. I'm in PT now and hoping it starts to help - they taught me MLD so I'm doing that twice a day and it seems to help so far. Just really hoping it's not permanent - the PT and surgical nurse are still calling it 'Post Surgical Swelling' at this point. Fingers crossed. ",
      "MessageIndex": 15,
      "PostDate": "11/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/849461",
      "Title": "Paresthesia after mastectomy (pins/needles in hands etc.) eot28 Marcia_Taylor"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Oct 31, 2016 01:27PM eot28 wrote: Oh thanks so much for the information. It's good to know it at least lessened or went away in most cases. Farmerlucy- do you remember how they did the nerve cleanse? Was it like massage or stretching or something like that? I'm starting PT tomorrow so I'm hoping they can help with it. Thank you all",
      "MessageIndex": 4,
      "PostDate": "31/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/849461",
      "Title": "Paresthesia after mastectomy (pins/needles in hands etc.) eot28 Marcia_Taylor"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Nov 1, 2016 01:32PM eot28 wrote: Oh great- thank you so much ladies! It makes me feel better to know it improved for you all. I have PT later today so I'm looking forward to that. Thanks again!!",
      "MessageIndex": 10,
      "PostDate": "01/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/849461",
      "Title": "Paresthesia after mastectomy (pins/needles in hands etc.) eot28 Marcia_Taylor"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Nov 11, 2016 10:56PM eot28 wrote: Jennj99738 - also it's good that you're going to a lymphedema therapist. I started with a PT that is also a certified lymphedema therapist. I think people can be a lymphedema therapist and also be either an occupational therapist, PT or massage therapist. The lymphedema therapist should be a good start though to look into that elbow nerve pain.",
      "MessageIndex": 16,
      "PostDate": "11/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/849461",
      "Title": "Paresthesia after mastectomy (pins/needles in hands etc.) eot28 Marcia_Taylor"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Nov 4, 2016 08:24PM eot28 wrote: ksusan, I'm curious if you had any hand or arm swelling when you had the pins & needles feeling in hands and arms? My PT said I'm most likely getting the pins & needles from swelling. She doesn't think it's lymphedema (she's a certified lymphedema therapist) but she thinks is still post-operative swelling (since i'm 3.5 weeks out from surgery). Just curious if you had swelling as well or just the pins & needles/numbness feeling (if you remember). Thanks so much! ",
      "MessageIndex": 11,
      "PostDate": "04/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/849461",
      "Title": "Paresthesia after mastectomy (pins/needles in hands etc.) eot28 Marcia_Taylor"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Apr 2, 2015 12:12PM eot28 wrote: Thanks again DiveCat - I have the GC appointment next week so will see how that goes. I did read that the GAIL model can underestimate risk in people with a strong family history (and for the other reasons you mentioned). So we'll see. ladybugmommy2010 - you might want to see if you can get an appointment with a genetic counselor too.",
      "MessageIndex": 9,
      "PostDate": "02/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829937",
      "Title": "Strong family history - considering prophylactic mastectomy eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Apr 6, 2015 12:27PM eot28 wrote: Thank you so much Nbnotes! I will PM you.",
      "MessageIndex": 11,
      "PostDate": "06/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829937",
      "Title": "Strong family history - considering prophylactic mastectomy eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Apr 13, 2015 01:37PM - edited Apr 13, 2015 01:45PM by eot28 Thank you all so much. Nancy, I'm so sorry about the loss of your sister, and for what you've been through. All the best to you. The genetic counselor I saw last week is running another model instead of GAIL called Boadicea. Not sure if anyone has used this one and if so, did it help? Puffin1, thanks so much also for reaching out. I definitely know how alone this feels. I will PM you to chat more too - thanks for the offer. Anyway, thank you ALL so much for your thoughts/input. It is SO helpful - I can't thank you enough.",
      "MessageIndex": 16,
      "PostDate": "13/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829937",
      "Title": "Strong family history - considering prophylactic mastectomy eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Apr 14, 2015 04:37PM eot28 wrote: Ispy, so sorry for what you're going through. I definitely understand why you're considering PBMX and I also understand how hard it is to know whether Tamoxifen or surgery is the better way to go. I have considered tamoxifen too and really don't know which direction to go. I haven't had a papilloma, just multiple fribroadenomas that have been biopsied in some cases (and watch to see if they grow) and surgical removal of others. Melissa, that's good to know tamoxifen can reduce breast density - I didn't know that. I have 'extremely dense breasts' according to my mammogram reports. I do get MRI's every year also. Ispy, one option is to also get annual MRIs if you don't already. I get them covered since I am considered 'high risk'. But it does make me wonder if mammograms are useless for me, then I'm really only getting screened properly once per year (in MRI). Uggh is right. Ispy, I'm curious, was it the CancerNext-Expanded (43 gene panel) you took from AmbryGenetics to discover the BARD1 mutation? That's the test the genetic counselor is recommending for my family. Just curious. Thank you!",
      "MessageIndex": 24,
      "PostDate": "14/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829937",
      "Title": "Strong family history - considering prophylactic mastectomy eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Apr 16, 2015 03:31PM eot28 wrote: That's great Ispy that you have the referral to the plastic surgeon. Would love to hear how it goes. I am glad too that you've pretty much decided on the PBMX. Just making the decision is so hard and it's good to be at that point. Especially since you've had DCIS and this fast growing papilloma, it seems to be the best option. I agree. It sounds like it's just not worth the risk (and anxiety) to not do anything. I also often think of the decision as choosing between the lesser of two evils. I have been waffling a lot on the decision but in my gut I know I would feel better and have a cleaner conscience (and a lot less anxious) if I went with the surgery. Just a matter of time until I make the final call. I've met with the general surgeons but haven't met a plastic surgeon yet. Need to do that. My biggest decision now I think is around reconstruction or not. So would love to hear how your plastic surgeon appt. goes. All the best to you and really glad you are in a spot where you can move forward on it and consult with the surgeon. Hopefully someone will chime in about papillomas also. ",
      "MessageIndex": 26,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829937",
      "Title": "Strong family history - considering prophylactic mastectomy eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "eot28 wrote: Hi there, I have a strong family history and according to the GAIL model I have a 50% risk of BC. I have consulted with a couple of surgeons and since I am a BRCA 'uninformed negative' (others with BC have not tested positive, nor have I), it is hard to tell if there are a lot of others like me who have gotten prophylactic mastectomy. One surgeon told me that most in my position don't get surgery but some do. The other thing that makes me feel alone in this is that I think I might not want reconstruction. The thought of multiple surgeries and having increased risk of complications plus implants for the rest of my life, turns me off of the whole prophylactic surgery. If anyone is like me and considering surgery or has had surgery I'd love to learn more about your experience (or even if you know of someone like me). I am struggling with this decision and feel pretty alone in it as I don't fit in the BRCA+ group and I also don't want to do reconstruction. Thanks so much! Surgery 10/10/2016 Prophylactic mastectomy: Left, Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829937",
      "Title": "Strong family history - considering prophylactic mastectomy eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Mar 27, 2015 01:02PM eot28 wrote: Thanks so much ladies for all your help! I am meeting with a genetic counselor in a couple of weeks. On the phone they said apparently they can now test for about 40 gene mutations. One sister's panel had about 8 mutations tested. So we'll see. Good to know about the GAIL model as well - I will ask them more about the model and how to determine my actual risk. Thanks again for all the info!",
      "MessageIndex": 6,
      "PostDate": "27/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829937",
      "Title": "Strong family history - considering prophylactic mastectomy eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Apr 17, 2015 03:58PM eot28 wrote: Thanks Ispy- yeah, I met with a breast cancer surgeon and she referred me to a plastic surgeon. It was helpful to talk to her. I think because I have only had benign findings in my biopsies they are still a little hesitant to recommend prophylactic but she at least listened to me and said she has had patients like me before. So I have her in the back of my mind as the surgeon I would probably go to. I still have to make the plastic surgeon appointment. I do feel it would be a relief to just have the decision made. You're right in that the 'what should i do?' phase is really hard. I feel it's hard to plan anything being in this limbo. I hope to get some strong clarity soon. I've been waffling on it a bit lately. So glad that you feel a sense of relief now and it's just taking the steps to make the appointments and scheduling etc. - which is easier to focus on. All the best to you and so glad you've made the right decision.",
      "MessageIndex": 28,
      "PostDate": "17/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829937",
      "Title": "Strong family history - considering prophylactic mastectomy eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Mar 27, 2015 01:37AM eot28 wrote: Thanks so much farmerlucy. That's a great tip about ensuring they don't leave extra skin. ",
      "MessageIndex": 3,
      "PostDate": "27/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829937",
      "Title": "Strong family history - considering prophylactic mastectomy eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Oct 28, 2016 10:34PM eot28 wrote: Do you have a pins & needles feeling as well, or just complete numbness? I had a BMX without reconstruction on October 11th and I have numbness on my chest but no pins & needles feeling there. Both of my arms have pins & needles and both hands also feel that way. The hand numbness/pins and needles started right after surgery and the arms come and go mostly starting about a week after surgery. I'm going to a physical therapist for evaluation next week to learn more and also get treatment for cording in my left arm. I didn't have any lymph nodes removed so it's weird to have cording, but I have been experiencing the increasing numbness since the week or so after surgery. I will let you know if the physical therapist thinks the delayed onset numbness is normal - she's highly experienced with post-mastectomy PT so I hope to learn more.",
      "MessageIndex": 3,
      "PostDate": "28/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/848760",
      "Title": "Numbness after mastectomy and lymph node biopsy :( Momandwife36 lrwells50"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Dec 1, 2016 07:44PM eot28 wrote: Thanks everyone! I will make sure to tell my PT to only lightly massage the cord if at all. An oncology massage therapist told me that untreated they usually go away within 6-9 months. So I might just stick to my own gentle massage and stretching of it for now. Thanks again!",
      "MessageIndex": 7,
      "PostDate": "01/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/850404",
      "Title": "Cording - did gentle massage get rid of it? eot28 meg2016"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Jan 22, 2017 09:24PM eot28 wrote: Great info! Thanks so much!!",
      "MessageIndex": 4,
      "PostDate": "22/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/851842",
      "Title": "How long after surgery to wear bras comfortably (enough)? eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Jan 15, 2017 03:29PM eot28 wrote: Thanks ksusan. Yeah I have some flesh at the upper underarm area that is still really sensitive. Seems the whole chest is still pretty sensitive at 3 months out. Time for some creative scarves :).",
      "MessageIndex": 2,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/851842",
      "Title": "How long after surgery to wear bras comfortably (enough)? eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "eot28 wrote: Hi there, I had my BMX without reconstruction about 3 months ago. I've just recently tried wearing Coobie bras with a little padding. I can get through about 2-3 hours with it on before I start to feel uncomfortable. I never really liked wearing bras before and never wore sports-type bras (which is probably adding to the discomfort). I have some chest sensitivity and some patches of swelling still. Just curious how long after surgery (for those that wear bras or camisoles) it took to be able to wear a bra for most of the day? Thanks! Surgery 10/10/2016 Prophylactic mastectomy: Left, Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/851842",
      "Title": "How long after surgery to wear bras comfortably (enough)? eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Jan 23, 2017 12:35AM eot28 wrote: Thanks so much, ladies. Your posts give me hope that in time it will get better. This weekend I sewed some pockets into one of my old comfortable bras from the Gap (soft bra with no underwire). I stuffed the pockets with some fiberfill and some pads. I was able to get through a few hours in it without too much discomfort. It rides up a little but if I'm not doing anything too active it might be ok for a while. I do have some pockets of sensitive swelling on both sides in the sternum area. So the good thing about this bra is that it doesn't press too much on the sternum (which the Coobie bra does right now). I guess it's going to be trial and error for a while. But it gives me hope that some of you found it to get a little better over time. Fingers crossed :). I might try one of the camisoles soon too and I did get some knitted knockers so I have those to try out as well- thanks! Thanks so much again!",
      "MessageIndex": 7,
      "PostDate": "23/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/851842",
      "Title": "How long after surgery to wear bras comfortably (enough)? eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "Jan 25, 2017 01:21AM eot28 wrote: Thanks so much, mustlovepoodles. That's good to know that the sternum sensitivity decreased over time. I think sometimes just having hope that it will improve can go a long way :). So thank you for making me feel better. Sometimes the pain/issues with wearing bras and padding makes me mad at myself for not getting reconstruction - even though in my gut i know implants were not right for me. But I think just having hope that I will be able to eventually get by with padded bras most days, helps with the second-guessing :). Thanks so much again for sharing :).",
      "MessageIndex": 9,
      "PostDate": "25/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/851842",
      "Title": "How long after surgery to wear bras comfortably (enough)? eot28 eot28"
    },
    {
      "AuthorID": "eot28",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213230/profile",
      "Content": "eot28 wrote: Hi there, I have cording in my left arm even though I had no lymph nodes removed. I've been going to PT and they haven't worked too hard on it yet but I fear they may have a stronger touch than I would like. It seems like there is mixed opinion about how to treat cording, with some doctors and therapists saying you should massage them and 'break' them or 'pop' them. But I heard from a lymphedema doctor that massage of cords should be very GENTLE so as to avoid increasing the risk of lymphedema. I'm confused on who to trust. Just curious if anyone has experience with gentle massage and stretching getting rid of the cord without needing to 'break' it or 'pop' it? I'm very worried about lymphedema (since I already have a lot of post-op swelling). So I want to ask my PT to be gentle with the cording if that seems to be the best treatment (or have them avoid working on it since they seem to have a 'strong touch' so far). Thanks! Surgery 10/10/2016 Prophylactic mastectomy: Left, Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/850404",
      "Title": "Cording - did gentle massage get rid of it? eot28 meg2016"
    }
  ]
}