{
  "AuthorID": "ependlet",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38405/profile",
  "Posts": [
    {
      "AuthorID": "ependlet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38405/profile",
      "Content": "ependlet wrote: I have LE in my right arm and shoulder.  I have a PET scheduled for October 1 and am concerned about the amount of time I must lie on the table with my arms above my head.  During my last PET I was ready to cry about half way through my arm ached so badly.  Have any of you experienced this kind of discomfort and if so do you have any suggestions? Betsy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/692499",
      "Title": "LE and PET scan ependlet Kessala"
    },
    {
      "AuthorID": "ependlet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38405/profile",
      "Content": "Sep 21, 2007 01:22PM ependlet wrote: Thanks Amy, I didn't realize that was an option.  I'm not claustrophobic either and the wrap sounds really comforting.   I hope they do that at my center. Betsy",
      "MessageIndex": 2,
      "PostDate": "21/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/692499",
      "Title": "LE and PET scan ependlet Kessala"
    },
    {
      "AuthorID": "ependlet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38405/profile",
      "Content": "ependlet wrote: I've been a visitor to these boards since my diagnosis in October, 2006 and want to echo the sentiments of so many who have posted before me. You folks are my lifeline and my angels. This is my first post and I am hoping that in time I can be as helpful to others as you have been to me. I've only had one small encounter with lymphodemia but with 15 lymph nodes now gone, consider myself a prime candidate for infection. In an effort to be proactive I am looking to switch to an electic razor. Unfortunately I haven't had any luck finding a model with good consumer reviews. Has this been an issue for any of you? In the big picture I know that this must seem like a very trivial problem but I live with the illusion that if I can control the little things, the big things won't feel as scary. I'm open to any comments or recommendations. Bets Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/584120",
      "Title": "Electric Razor ependlet ependlet"
    },
    {
      "AuthorID": "ependlet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38405/profile",
      "Content": "Apr 13, 2007 02:54PM ependlet wrote: Thanks Binney, I read the posts and had no idea that this was an issue for so many people. I guess there truly are no stupid questions.",
      "MessageIndex": 2,
      "PostDate": "13/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/584120",
      "Title": "Electric Razor ependlet ependlet"
    },
    {
      "AuthorID": "ependlet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38405/profile",
      "Content": "ependlet wrote: Help!!  I'm going to Mexico next week for my daughter's wedding and my cancer related fears are interfering with my enthusiasm.  I know that it will be very hot and very humid and that we will be spending the bulk of our time outdoors.  I have moderate lymphedema in my right arm and am wondering how to protect it from sunburn and insect bites.  Does a compression sleeve provide any protection?  If not, how do you apply sunscreen and/or insect repellent when wearing a sleeve - or, do you just go without the sleeve?  This is my first trip away from home since diagnosis and if you haven't guessed, I'm freaking out a bit.  What sounded like a great idea in December is beginning to feel overwhelming.  I'm grateful for any advice and/or tips you can offer me. Thanks in advance, Betsy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/709055",
      "Title": "Sunburn and Insect Bites ependlet ependlet"
    },
    {
      "AuthorID": "ependlet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/38405/profile",
      "Content": "Jul 14, 2008 05:49PM ependlet wrote: Binney thank you so much!!  I will definitely look for the Off you mentioned and plan to bring a couple of long sleeve shirts with me (it's a beach wedding so I might be able to pull it off).  By the way, can you put sunscreen on under the sleeve?  I bought some Neutrogena spf 70 and will try it on my good arm tonight.  Thanks again. Betsy",
      "MessageIndex": 2,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/709055",
      "Title": "Sunburn and Insect Bites ependlet ependlet"
    }
  ]
}