{
  "AuthorID": "EpicSquirre…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
  "Posts": [
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Jul 27, 2017 06:06PM EpicSquirrel wrote: This is just what I needed to see today - thank you soooooo much for sharing this! I'm having SEs from tamoxifen and every day it is a struggle to take the pill. Glad to hear whentreatments do work!",
      "MessageIndex": 6,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/856831",
      "Title": "10 year survivor of TN cancer Mary95 EastcoastTS"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "May 9, 2017 03:31PM - edited May 9, 2017 03:33PM by EpicSquirrel Yes! Just diagnosed this week with 11mm invasive ductal carcinoma. This was after mammograms and ultrasound in February, a surgical excisional biopsy of another area in the same breast in March (that one was benign) and surgical follow up and new pain and lumps I found in april. My doc says and I believe it was lucky this one was found at all. My breasts are dense, regular pain/cysts/lumps, and the radiologist thought this also was benign. I'm thankful the surgeon wanted to look at it herself and needle biopsy it to be sure. But yeah, no telling how long it was hiding there. I'm nervous as heck waiting on the MRI (one week wait)to tell us more and see what else might be lurking :( ",
      "MessageIndex": 4,
      "PostDate": "09/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/854830",
      "Title": "Feel like I've gone 0-100mph in 3 seconds LoveK9s Lula73"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "May 24, 2017 06:36AM - edited May 24, 2017 06:39AM by EpicSquirrel I did twilight sleep for a surgical biopsy and will do it again this week for lumpectomy and SNB. I slept the whole time and prefer to be asleep now that I've done it that way. I have had so many procedures and tests on the breast, for me there's like a cumulative stress to go through these. If being asleep is an option i will always take it from now on. I asked the surgery center what this twilight mix was. They said propofol and fentanyl. Hardly any breast pain after, I did have headaches and a little dizziness for a couple day",
      "MessageIndex": 5,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855301",
      "Title": "Excisional Biopsy-Local (MAC) or General Anesthesia adw7374"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "May 17, 2017 03:40AM EpicSquirrel wrote: Lumpectomy with sentinel nose biopsy scheduled May 25. I need to go in the afternoon before for the sentinel injection (freaked out about that). I'm most nervous about too many lymph nodes being taken out. Although nothing showed up on the MRI outside of the one tumor, so bs thinks she won't need to take many, I'm so afraid of lymphodema and how it wouldn't impact my qol I'm having high anxiety about it. (Other shoulder is already limited mobilty due to arthritis) ",
      "MessageIndex": 164,
      "PostDate": "17/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Jun 5, 2017 10:24AM - edited Jun 5, 2017 10:28AM by EpicSquirrel Any doc who told me that all of those symptoms were from stress.. I would run away from that doctor and never look back. Sorry i don't have any specific advice or idea what it is but just wanted to say go to another doctor that will listen better. I'm glad they ruled out some scary stuff like lupus etc, but then giving up andattributing all this to stress seems lame. I wonder about something hormonal at least for part of the symptoms. (So maybe more than one thing going on?) Have her hormones been checked? How old is your wife and what was the benign mass? I am in 49 in perimenopause (told it can go on for years) and have been having the thinning hair, night sweats, hot flashes. Had a \"flare up\" of breast cysts at the same time and a solid mass that was rather mysterious though benign. Lo and behold turns out there was cancer in that breast too -- highly hormone sensitive. Barely caught it. Oh editing to add -- I do have another idea. Maybe an inflammatory reaction not to the clip exactly but to the mass itself. My \"mystery\" mass showed chronic reactive inflammatory changes. The thought later was that whatever was there (by the time they biopsied it it was just dead tissue in the center) my own immune system had attacked and killed it. I was also having some immune issues and low grade fevers last year. Hmm.",
      "MessageIndex": 1,
      "PostDate": "05/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/855809",
      "Title": "Titanium allergy? jdp1886 sas-schatzi"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Jun 14, 2017 05:38PM EpicSquirrel wrote: MTWoman: What do you think about Dream Water for sleep? The first two weeks when I was literally not spleeping more than 3-4 hours a night and literally couldn't work from the stress, my surgeon's office suggested melatonin (the main ingredient in Dream water, though there are other ingredients in it as well). It seems to work for me -- kind of gently lulls me to sleep. I still wake up early or sometimes in the middle of the night, but it does help. I'm trying not to take it nightly. Should I worry about getting attached to it, or it causing any other problems?I'll ask my therapist about it too, but would love to know your thoughts. (Or anyone else here struggling with hard time sleeping due to anxiety/stress) ",
      "MessageIndex": 38,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Jun 8, 2017 01:59PM - edited Jun 8, 2017 02:00PM by EpicSquirrel I've made an appointment to see a psychologist who specializes in anxiety and stress at a respected place here. Was able to get an appointment for tomorrow! I've never seen anyone like this before so I'm a little nervous, but I feel good about taking a step to try and help myself. Although I returned to work this week after being off for a week to recover from the surgery, I have had a hard time focusing on work.",
      "MessageIndex": 16,
      "PostDate": "08/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "May 24, 2017 04:07PM EpicSquirrel wrote: I just had this done (today, in advance of surgery tomorrow morning) I was very nervous about it and my breast is very sensitive -- I've had two very painful core needle biopsies, a fine needle aspiration and mammograms on this breast this year, all painful due to fibrocystic breasts, cysts and inflammation. THIS was not painful. Here is how it went for me: The technique they used was a single injection that included lidocaine in the injection, mixed in with the tracer. The injection was given at the edge of the areola. I said I was nervous and my breast is sensitive, so they sprayed a cold numbing spray on a few minutes prior. They said I would feel a prick and that I might feel the fluid going in, there might be a little burning but not too bad. I didn't feel any burning or pain. The prick was really nothing. It did take a solid couple of minutes for the shot, for it to all go in (if you have this done the afternoon prior, they have to use more of it, and the lidocaine adds volume as well) Mostly I felt NOTHING after the initial prick. Twice I did feel kind of pressure for a second or two, like it was GOING to hurt, but then it didn't. My breast now, about an hour later, feels a little weird.. hard to explain, but definitely not painful. Call ahead and ask what technique they use and see if you can find a place that uses this technique of the lidocaine mixed into the tracer.",
      "MessageIndex": 116,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769441",
      "Title": "Radioactive Injection into Nipple NOT TERRIBLE waynesgirl50 Motherofall6"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "May 17, 2017 09:02PM - edited May 17, 2017 09:10PM by EpicSquirrel I'm anxious about this. I am scheduled for surgery next week. My surgery is very early in the morning (I will arrive when the surgery center opens), so they are having me get the radioactive injection the afternoon prior. (The surgeon will also do the blue dye the day of surgery, but after I'm sedated) I'm worried because my breasts are small, dense, painful, and full of cysts. They are sensitive on their best days. I call them my \"autistic breasts\" because of their sensitivity to everything. I've had a lot of fine needle aspirations over the past decade and the only one that hurt was the most recent one just last month on this breast near the nipple. I was cussing and crying on the table. Previous aspirations were painless or virtually painless. I also sometimes get a vasovagal reaction. The fact I'm stressed, haven't been sleeping, I think makes it more likely to happen. Also if the procedure is painful it happens. So of course now I'm also anxious that I'll have that (extremely unpleasant, I feel somewhat traumatized for a couple hours after it happens) This breast has been through a lot this year including a surgical excision. (I had pain in this breast in January and there's so much benign stuff going on in it, the cancer wasn't diagnosed until this month) I haven't been sleeping since cancer diagnosis. I'm crying every day. I can't work. I just feel like I can't take any more.. and the cancer treatments are just starting. All this, combined with the fact I'm having it the day before (so more volume of dye I'm afraid means more pain) I'm stressed out. I called the surgeons office today to ask how this procedure is done. She said it is is near but not in the nipple, it is one injection, and it is numbed. That sounds good I think but I'm still anxious about it. I also told her I'm having a hard time sleeping and they recommended Benadryl or melatonin. Some moments I feel ok but other times I feel like my anxiety/stress isn't being handled. I've never been on any drugs for anxiety or depression. I've never felt like this before. I don't have a psychiatrist or anything. I don't know what i need or how to ask for what I need.  ",
      "MessageIndex": 112,
      "PostDate": "17/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769441",
      "Title": "Radioactive Injection into Nipple NOT TERRIBLE waynesgirl50 Motherofall6"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Jun 15, 2017 09:30PM EpicSquirrel wrote: @MTwoman The psychologist I'm seeing specializes in anxiety. Her take was the same as yours, that the Dream Water is totally fine for me to take during this time to help me sleep, she's glad it helps me, thinks melatonin is fine, and that getting some more sleep is good and outweighs any other minor concerns about it for now She also said it is a normal reaction for me to feel stress/anxiety right now and I should try to \"be ok\" with that for now, and not let the fact that I have anxiety over this cause me more anxiety. Well, she said it in better words than that but you get the idea :) It made me feel a lot better.",
      "MessageIndex": 45,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Jun 4, 2017 12:41PM - edited Jun 4, 2017 12:43PM by EpicSquirrel This is wonderful MTWoman - thank you! This month since being diagnosed with bc is the first time in my life I have felt like I might need professional help to overcome this anxiety. and indeed I was wondering \"is this anxiety\" -- your post is helpful. I am taking daily walks and I love to cook and on my own found the \"complicated recipe\" idea also works. But I'm still anxious and can't distract myself for long, can't sleep well. Re your idea of talking to pcp or finding a psychiatrist.. do you think a medical oncologist could help as well? (I have a consult with one in a couple weeks, after my oncotype score is back)",
      "MessageIndex": 11,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Jun 9, 2017 02:38PM EpicSquirrel wrote: Had the appointment today and I think this was such a good idea. I'm going to see her weekly for a few weeks. Although she specializes in anxiety, she seemed to know about bc, which helped the conversation. Gave me some good coping ideas for this week -- similar to your advice MT, about distractions etc. Asked me to keep anxiety notebook this week (She told me what and how to track it) Glad I took this step",
      "MessageIndex": 19,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Jun 14, 2017 06:56PM EpicSquirrel wrote: ok thank you MTWoman! This helps me feel less worried about taking it for now. I'll ask her about it and let you know her take on it also.",
      "MessageIndex": 40,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Apr 19, 2017 07:49PM EpicSquirrel wrote: Hi jillybean My mom survived colon cancer. I didn't know anything about it and was very scared for her. And I'm a LOT older than you are :) so it's ok to be scared and confused. I just did my best to be with her at doctor appointments when i could be, to help her listen and take notes for her, that kind of thing. I was there when she had surgery, and was able to be holding her hand when she woke up (thank you to that recovery nurse. Those moments meant a lot to her, she told me later.",
      "MessageIndex": 6,
      "PostDate": "19/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854093",
      "Title": "Mom has spiculated mass, needs biopsy jillybeantabby EpicSquirrel"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Apr 19, 2017 06:40AM - edited Apr 19, 2017 08:19AM by EpicSquirrel Now that I have the report from the radiologist, I wanted to post some of the text from the report here and ask for any advice. The nurse practitioner at the surgeon's office (the bs was in surgery that day) sent me immediately to get an ultrasound and aspiration because I was in so much pain and had so much swelling right under the nipple, which is just a couple of centimeters away from the incision where the previous mass was taken out. (The excised mass was benign intraductal mostly infarcted tissue with reactive inflammatory and fibrocystic cells, fat, and periphery microcalcifications. Whew!) On Thursday last week the radiologist did an aspiration on the spot to both relieve the pressure/pain and also to biopsy the fluid. She was concerned from looking at it and, as she said, how it has presented, that none of this was showing up on the ultrasounds from February 1 that preceded my surgery, that perhaps this is related to the surgery and might be an infection. So I have been calling my doctors office every weekday since then and they keep saying they don't have the results back. I don't *think* it is a major infection from how I feel -- there is no redness, the \"swelling\" has gone down *a bit* since the aspiration, but I do have a headache and sometimes feel like I\"m running a low grade fever on and off throughout the day (though when I get home and take my temperature it is normal) Is it normal to not put me on antibiotics (she said they need to know what they are dealing with) and to wait this long for results? I logged into my patient portal and was at least able to see the text from the radiologist report from the day of the imagine and aspiration. (I wasn't able to copy & paste with their system so I am typing this from transcription, will try to get it all right): 2 cm from nipple is a thick walled cyst overall measures 2.5 x 1.9 cm and the central cystic portion measures 2.2 x 1.7 x 1.7 cm. The wall is at least 5 mm in thickness and is hypervascular. Numerous additional simple cysts are present. There is an oval hypoechoic nodule at 12 oclock located 6 cm from the nipple measuring 11x9x6 mm. This demonstrates smooth margins but was not documented on the outside ultrasound 2-1-2017. Real time ultrasound guided into the complicated cyst at 12-2 oclock - Fluid complement was completely evacuated yielding 5cc of turbid, partly pussy fluid which was sent for Gram stain, culture and sensitivit. The thickened cyst wall remains in place. (I am adding a note here: After the aspirated this she said she was sorry but it seemed to be immediately refilling.. she and her assistant applied a lot of pressure to try to get it to stop, and put me in a pressure bandage for 24 hours. It does seem to be smaller than it was - and no pain now - but I can tell it isn't totally gone. Now back to her report...) The 11mm oval solid nodule features most consistent with fibroadenoma, considered probably benign. Recommendation is pending analysis of the fluid.  Ok that's what I know. Other than the fact that my breast is now bruised from this experience, has a large scar from the removal of the 4 o'clock mass, is still full of cysts, has a possibly fibroadenoma, and I KNOW from my breasts that I will be in pain in a short time again if this one fills up or the others grow. I am so thankful that I have not been diagnosed with bc, and I know this is a bc forum, but I just CANNOT BELIEVE that no one really seems to know what causes all of this, that there aren't any real treatments or help for benign but PAINFUL and INTERFERING WITH LIFE conditions like this. I feel like whenever I visit someone they are like OMG Maybe it is cancer we have to find out, and then Oh whew it wasn't cancer, go on about your business, and I'm like but I'm still in pain (sometimes literally in tears from the pain), I still have issues :(  I am editing to add: the 11mm likely fobroadenoma I found myself this week. No one seems to have seen it on the February mammo or subsequent ultrasounds. Indeed when I was having the US the tech hadn't touched that area and saidshe was done. I said to the tech: We also noticed a lump here, and showed her. Then she took the images there. Makes me wonder what else is in my breasts that no one has noticed. They are always so lumpy I feel like if I brought every lump/cyst/whatever to a doc's attention I'd need an Ultrasound Unlimited Season pass lol. But seriously, with all of the above, should I be worried that things are being missed? Can this and a 5mm cyst wall thing underneath my nipple, 2cm from a surgery done six weeks ago really be brand new  ",
      "MessageIndex": 4,
      "PostDate": "19/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/854131",
      "Title": "Several weeks after surgical excision biopsy EpicSquirrel MTwoman"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Apr 26, 2017 08:21AM - edited Apr 26, 2017 08:25AM by EpicSquirrel Just a small update to keep this accurate. The RN practitioner at the breast surgeon's office called. She said that the first test (posted in my message above, it said Gram Stain shows few white blood cells but no microorganisms present) doesnt show any infection, but they are doing more tests to be sure. She said the surgeon wants to see me herself, once more data is in. They are also re-looking at my biopsy slides from the excision. She said not because they expect cancer, but to try and get a better idea of what's going on, if that sample showed inflammation or infection or something else. I'll get a call for that appt in a few days I'm so happy and grateful they are taking this seriosuly and trying to get to the bottom of it. Feel like I'm in good hands. Curious if revisiting previous biopsy slides is common -- what additional info could they yield?  ",
      "MessageIndex": 7,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/854131",
      "Title": "Several weeks after surgical excision biopsy EpicSquirrel MTwoman"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Apr 13, 2017 08:17AM EpicSquirrel wrote: I see her tomorrow afternoon. Well, her nurse practiononer actually, which should be fine. I will ask a ton of questions and let you know what she says. I'm in more pain every day this week and haven't been able to sleep without my sports bra this week either :",
      "MessageIndex": 2,
      "PostDate": "13/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/854131",
      "Title": "Several weeks after surgical excision biopsy EpicSquirrel MTwoman"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "May 9, 2017 12:10PM - edited May 9, 2017 12:11PM by EpicSquirrel Did a core needle biopsy of the 11mm solid lump -- it is invasive ductal carcinoma. The doc thinks this is probably stage 1. Having me get an MRI to find out more.",
      "MessageIndex": 8,
      "PostDate": "09/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/854131",
      "Title": "Several weeks after surgical excision biopsy EpicSquirrel MTwoman"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Jun 26, 2017 11:09PM - edited Jun 26, 2017 11:18PM by EpicSquirrel yellowcat If you are post menopause and age 50+ look into the IDEA clinical study that many major cancer centers are recruiting for. It is to follow women who choose endocrine therapy only -- no rads -- after lumpectomy if they have a favorable cancer profile like it sounds like yours might be. I'm one year too young and perimenopausal so didn't qualify, but chose to not do the radiation anyway since mine is also favorable -- including low oncotype score, no genetic mutations, er+, her2-, stage 1 My anatomy would also not allow prone positioning or brachy etc.. and where my tumor was had an impact on my decision: left breast, and also some of my lymph nodes would be in the field even though they wouldn't be aiming for them. I asked RO many details about chance of rads induced lymphedema, heart or lung damage, new rads induced cancer, breast fibrosis, etc Radiation does cut chance of local recurrence about in half. So you need to know all your numbers and what kind of surveillance/follow up you would need, and all your currenttreatment options to know if that's worth it for you.",
      "MessageIndex": 7,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856413",
      "Title": "I am fighting having radiation yellowcat ChiSandy"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Feb 14, 2017 08:24AM EpicSquirrel wrote: Thank you. It turns out you are right. I went into the surgeon for the consultation and she was much more frank with me. The radiologist thinks it is cancer but the core needle biopsy results are benign. That's why it was discordant. The breast surgeon does not think it is cancer but concurs with the recommendation of an excisional biopsy mainly because this will not go away on its own and may get inflamed/infected again in the future. The surgeon did an ultrasound and we could see the clip that the radiologist put in, in the center of the solid part of lump, where the biopsy was taken. The surgeon showed me that there IS fluid at some of the (smooth) edges. She thinks it is/was a cyst and I possibly bled into it/burst blood vessel and now there's debris in it, and dead tissue (FREAKY!) and it may have been infected (I had been on 10 days of doxycycline prior to the imaging due to appointment scheduling). Thissounds so weird I asked how this happens. She says nothing I did or could do to prevent it, these things just happen?!?! But now that it's in the condition it is, it should come out. Anyway she told me not to worry about cancer. She sees a lot and doesn't think this is it. But of course it will be tested to be sure. I'm having it out on March 2. I'm 48 and it's the first surgery of my life so I'm a little nervous. But happy with her frankness and comforted that it is probably not cancer.",
      "MessageIndex": 5,
      "PostDate": "14/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/852484",
      "Title": "Radiologist and lab are stumped - what are cancer chances? EpicSquirrel MTwoman"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Mar 3, 2017 10:11PM EpicSquirrel wrote: Just a short update. I had the surgery yesterday, an excisional biopsy. She took the entire lump but no surrounding tissue, since the breast surgeon thinks most likely it is not cancer. I will have results at my in-person follow up a week from today. It has been quite a stressful two months -- trying to get an initial appointment, being given antibiotics, waiting for mammo and ultrasound, core biopsy, waiting on that result, and then the surgical biopsy. Even with the likelihood that this is benign it has still been a lot of appointments and stress, as well as some physical pain. The healthcare system isn't easy to navigate. Thankfully I have a job that allowed me time off for all these appointments and provides health insurance. I think about all the women who dont have that, the extra worry and stress. Anyway thank you for the advice and greetings. The surgery itself wasn't bad at all, in fact to be honest the core needle biopsy was more difficult and I had about as much pain after! Anyone worrying about a surgical excision, try not to be scared, it was easy. I'll come back to share the results.",
      "MessageIndex": 7,
      "PostDate": "03/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/852484",
      "Title": "Radiologist and lab are stumped - what are cancer chances? EpicSquirrel MTwoman"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Feb 6, 2017 11:20PM - edited Feb 6, 2017 11:23PM by EpicSquirrel I would be surprised if she didn't get the right place because my breasts are very small (barely b cup) and the lump is large and literally visible to the naked eye. Also she took four core samples. On the phone she said that it was discordant with the imaging/what they expected? Anyway I think you are right that i should just have it removed to be sure -- and also for my own curiosity now haha -- but of course I'm really nervous about what's going on. Re the idea of cellulitis, she originallly thought it was an abscess. But when when tried to aspirate it with a fine needle, no liquid came out. During the core biopsy there was also no puss or sign of infection. Though perhaps the antibiotics handled it? (It was a long wait for the imaging appt and I completed 10 days of doxycycline while waiting",
      "MessageIndex": 3,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/852484",
      "Title": "Radiologist and lab are stumped - what are cancer chances? EpicSquirrel MTwoman"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Apr 20, 2017 12:44PM - edited Apr 26, 2017 08:23AM by EpicSquirrel [edited to delete the image of the report since it may have identifying info on it -- anyway a more recent update is nowbelow] ",
      "MessageIndex": 6,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/854131",
      "Title": "Several weeks after surgical excision biopsy EpicSquirrel MTwoman"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Jul 23, 2017 09:45AM - edited Jul 23, 2017 09:46AM by EpicSquirrel Melatonin doesn't help everyone but maybe like me you will be lucky and it will work for you. You take it only at night, about a half hour before bed. There's a product called Dream Water that's a little expensive that I love that has melatonin and some light anti anxiety supplement in it as well. Benadryl also helped me, though I know a lot of people don't like it. Also there's a great pinned thread in the \"Not diagnosed but worried\" area titled Anxiety that is worth looking at. I didn't sleep for a couple weeks either. I was better after surgery, felt like something had been accomplished, and then better again after all the treatment decisionshad been made. So it's does get better!",
      "MessageIndex": 1,
      "PostDate": "23/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/857268",
      "Title": "Struggling with sleeplessness Linwentz T_J_DEIPtrouble"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "May 23, 2017 01:45PM EpicSquirrel wrote: thank you for the replies and smart thinking. I will likely do the radiation -- unless something from the surgery or gene testing makes me go bmx instead. I was just surprised to hear such a risk of LE from rads, and wondered I felt others had heard similar from their rad oncologists. Or if an anyone's rad onc talked about how they would try and mitigate the chance during treatment somehow.",
      "MessageIndex": 4,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/855375",
      "Title": "Chance of lymphedema from rads? EpicSquirrel ksusan"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "May 24, 2017 03:18PM - edited May 24, 2017 03:19PM by EpicSquirrel muska, The RO says chance of LE from rads is 3-4% Chance of local recurrence with rads is 5% The 3-4% number *might* have been customized to me, I'm not sure, because she drew a picture showing that due to where my tumor is + flat breasts that mean a I can't do prone = some lymph nodes will be in the rad field She said the 15-20% local recurrence without rads might change for me after surgical pathology is in (my lumpectomy is tomorrow) That's my dilemma. I am actually wondering if all of the rads possibilities (LE+heart+lungs+angiosarcoma etc) is worth a net 10-15% decreased chance for local recurrence. That's what I'm wondering about -- if it seems crazy to risk that recurrence rate to avoid these possible complications (since I AM someone who tends to get comlications, and the LE complication in particular would be devastating to me given my mobility issues with my other arm). Also if I did get local recurrence I could still have rads available later. If I do rads now that's closed off in the future.",
      "MessageIndex": 11,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/855375",
      "Title": "Chance of lymphedema from rads? EpicSquirrel ksusan"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Apr 14, 2017 07:36AM EpicSquirrel wrote: They did an ultrasound but aren't sure what it is. took a fine needle biopsy, tried to evacuate all the fluid. The radiologist *thinks* its a seroma that is starting to get infected. Sent the fluid to a lab for analysis. Anyway it is good I went in. She said I have small cysts in the breast and a solid nodule they will look at more closely later. This seroma or cyst has a \"thick, very vascular wall\" which concerns her. The fluid was mostly clear but near the end had a possibly puslike look and some blood. It is close enough to the surgery area that she thinks it's related.",
      "MessageIndex": 3,
      "PostDate": "14/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/854131",
      "Title": "Several weeks after surgical excision biopsy EpicSquirrel MTwoman"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Mar 8, 2017 11:12AM EpicSquirrel wrote: Thank you for the kind notes! Follow up appointment with results is this Friday morning. I will post results here, regardless of the outcome, in hopes that it may help others with a similar mystery.",
      "MessageIndex": 11,
      "PostDate": "08/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/852484",
      "Title": "Radiologist and lab are stumped - what are cancer chances? EpicSquirrel MTwoman"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Mar 10, 2017 02:58PM EpicSquirrel wrote: Result is benign! Details:  Diagnosis Left breast mass 4:00 excision: 1.2 cm extensive infarcted tissue, intraductal Fibrocystic changes, chronic inflammation and microcalcifications, peripheral Gross description: Mass like specimen 3x2x1.5 cm Cut sections reveal a well circumscribed hemmoragic fatty tissue nodule measuring 1.6x1.4  I'm not sure what it all means except that they diagnose it as benign, the surgeon says it's all good, incision is healing well, come back in six months for a follow up. ",
      "MessageIndex": 12,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/852484",
      "Title": "Radiologist and lab are stumped - what are cancer chances? EpicSquirrel MTwoman"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "May 24, 2017 06:44AM EpicSquirrel wrote: I'm doing lumpectomy regardless, to get more info. I would only do the mastectomy if it will mean I can absolutely avoid the rads, and we won't know that until after more info from the tumor and the SNB. So I am kind of thinking of this as \"exploratory\" if you will. Breast surgeon kind of agreed -- she said we can always take more later, but you can't take less. She said other women sometimes decide to bmx after the lumpectomy heals, but before rads. She feels it's a reasonable way to help gather more info and decide since I am still waffling. Haven't seen medical oncologist yet. Only surgeon and rad oncologist.",
      "MessageIndex": 6,
      "PostDate": "24/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/855375",
      "Title": "Chance of lymphedema from rads? EpicSquirrel ksusan"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Feb 14, 2017 08:09AM EpicSquirrel wrote: I have had many painful lumps that so far have all turned out to be benign cysts (except for one that is solid and i am having excised on march 2, though the surgeon does not think it is cancer) Cysts can be very painful. Twice I ended up in urgent care cause I couldn't wait for the several days until doc office could see me. The pain can be from a cyst (or other benign lump) itself pushing on a nerve or the tissue around it pushing on a nerve. The pain can be from an infection/abscess (can happen even if not lactating!) Good you are having it checked out to be sure. If it does turn out to be something it's good you are having it talent care of.",
      "MessageIndex": 6,
      "PostDate": "14/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852573",
      "Title": "pain in area of lump GG31 EpicSquirrel"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "Apr 20, 2017 07:22AM EpicSquirrel wrote: I also don't know what the two week rule is. But if you've found a lump and are curious about the next steps, usually it's a mammogram, then possibly an ultrasound and then possibly a simple biopsy of some sort. They may or may not do all of this in one appointment. Not 100% sure what you've already gone through so please forgive meif this is too basic of info. From my experience: For a mammo you will be asked to undress from the waist up and wear a shirt type gown. The mammo is uncomfortable because the kind of squish the breasts, but it doesn't take long and there's no damage/pain after. Then you might leave and someone looks at the film later, or you might be able to wait and talk to the radiologist right away about what was seen. They might want to do an ultrasound (not painful) and perhaps a biopsy. Personally I prefer it all in one go. Ultrasound is not painful and no radiation to worry about. The ultrasound tech won't tell you anything during the ultrasound. You will have to wait again to talk to the radiologist (doctor) about what was seen. Biopsy if it is recommended and if they do it that day might be a needle biopsy where they numb the skin and take a small sample (in my experience with a small needle, after they numb the skin it usually isn't very painful or if it is, not for very long) If there is any pain with your lump now and if it is a cyst, this will actually give you some relief when the pressure is gone right after. You can ask questions at any step of the way and ask what all your options are at each step of the way and you can stop the process any time you want to. If you are nervous just tell them. They will not do any surgery that day, as if you decide on a surgical biopsy that would need to be scheduled in advance, and you have time to get your biopsy results back from the lab and then meet with the breast surgeon to discuss all details options. Put a little snack in your purse in case they keep you there a while. Wear pants so that when you undress \"from waist up\" you are comfy. Sometimes rooms are cold so a scarf/wrap might be good too. Good luck and let us know how it goes!",
      "MessageIndex": 2,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854334",
      "Title": "What Can I Expect On My First Hospital Appointment 😓 DJBosh Kicks"
    },
    {
      "AuthorID": "EpicSquirre…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/246663/profile",
      "Content": "May 21, 2017 02:47PM EpicSquirrel wrote: TEW I am also facing similar choice: mast+hormone or lump+rads+hormone My healthcare team however is NOT making me choose right now. My breast surgeon (who recommends the lumpectomy) says \"We can always take more later, but we can't take less\" She says many women decide on mastectomy AFTER lumpectomy, as the lumpectomy gives more information -- did it travel to lymph nodes, did they get clean margins, etc. There's a chance with mastectomy you might still need rads (though a lower chance) if they can't get good margins near chest wall or something. She also has set me up to speak with rad oncologist before I decide The main thing is you DO want to decide before radiation, as rads can make future healing/reconstruction harder. But you may NOT need to decide before doing a somewhat exploratory lumpectomy. Also I'm applying for genetic testing, the BRCA gene test which if I get might help me make my decision. Don't let them rush you. Make sure you are getting all answers you need to make the best choice for you.",
      "MessageIndex": 15,
      "PostDate": "21/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854858",
      "Title": "Mastectomy or lumpectomy with radiation? jillybeantabby ML1209"
    }
  ]
}