{
  "AuthorID": "Erdwoman",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169906/profile",
  "Posts": [
    {
      "AuthorID": "Erdwoman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169906/profile",
      "Content": "Feb 10, 2013 07:42PM Erdwoman wrote: Well said Paynesville. Several years ago I met an older woman who was small in size but large in bust. She had a UMX and chose not to wear a prosthesis, I don't know her reason. At first I was a little \"surprised\", within a few minutes I wanted to raise my arm in support and yell right on sister. We are not are boobs. That being said, I had a BMX and chose reconstruction. The TE make me question that decision every day. I know that in time it will all be better.",
      "MessageIndex": 1043,
      "PostDate": "10/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "Erdwoman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169906/profile",
      "Content": "Feb 10, 2013 02:31PM Erdwoman wrote: Shellshine, I am with you. I am 58 yrs old and had large breast for 45 years. I am enjoying my little ones immensely, and my DH doesn't care either. Just remember that your final implants will look so much better then the TE. I had my surgery first, and am getting ready to start treatment so my TE will be in twice as long as normal. Hoping to get them out by September. Seems like a long way off, but time will fly.",
      "MessageIndex": 1041,
      "PostDate": "10/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "Erdwoman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169906/profile",
      "Content": "Feb 11, 2013 06:23PM Erdwoman wrote: Hope, I had my surgery at Kaiser. Both my husband and I have been very impressed with the level of care. Immediately upon diagnosis they assign you a team. When one makes a move they are all notified. Exceptional care for a sucky situation. I think it's important that we all stop and smell the roses, or hibiscus, and look and enjoy the world around us. 300 cc's. I am impressed, I've been told that the more they are filled the better they will feel, is that true? I sure hope so cause I am having a bad day with them today :-)).",
      "MessageIndex": 1046,
      "PostDate": "11/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "Erdwoman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169906/profile",
      "Content": "Feb 15, 2013 09:28AM Erdwoman wrote: Tamiami, I pray your drains are out, it is so uplifting these rewards we get. Lmimp64, I hope your home and doing well, how much water is to much? Heading into first treatment in one week and I drink a lot of water. I had another fill yesterday, 150cc. Rushed home to look at my larger boobs and realized these little misshapen things resembled the face of a walrus (no whiskers). It can only get better, right?",
      "MessageIndex": 1057,
      "PostDate": "15/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "Erdwoman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169906/profile",
      "Content": "Feb 8, 2013 11:38PM Erdwoman wrote: Hello ladies, I just found this sight. Have done quite a bit of reading and relating. I was diagnosed right after Thanksgiving. I had 3 tumors, all under 2 cm. all were invasive, not aggressive and hormone receptive. Had surgery Jan 11, removed both breast and TE placed. Yes they are uncomfortable and I hate the fact I have to sleep on my back for the next 6 or more months. Have had 2 fills, and coming from triple D's, I love my little boobies. I will start chemo on the 25th and am feeling nervous about it. Radiation is probably in my future too, but that will be decided after chemo. Thank you for being here.",
      "MessageIndex": 1019,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "Erdwoman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169906/profile",
      "Content": "Feb 15, 2013 09:31AM Erdwoman wrote: Oh and on a good note, found out they are going to exchange the TE's between chemo and radiation. I thought they were going to make me wait till after all treatments and healing from treatments were done.",
      "MessageIndex": 1058,
      "PostDate": "15/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "Erdwoman",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169906/profile",
      "Content": "Feb 17, 2013 08:25AM - edited Feb 17, 2013 08:27AM by Erdwoman I have a delemma that I would like your opinions on. I had one node that showed \"some\" cancer cells. Onc highly suggest doing axillary biopsies. If 4 or more show more cells then we do radiation, otherwise if clean no radiation. He said \"if there are cancer cells don't you want them out?\". BS says he is not sure if he would be that radical, taking them out has no change in my long term outcome, it is diagnostic not therapeutic. If I choose not to remove them it is automatic rad. If I choose to remove them it is 50/50. I am afraid of the possible Side effect of removing them, and yet another surgery, but I don't want rad either. I start chemo next week and have until completion to decide. All in all I have been doing pretty good, right now I feel almost normal. Iq can even sleep on my left side for short periods of time. Getting out and walking everyday and starting to resume normal life again. I know once chemo start it all changes again, but loving it right now. Some of you have been having some real challenges, stay strong and know that soon 2013 is going to be but a blip in our lives. <3",
      "MessageIndex": 1079,
      "PostDate": "17/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    }
  ]
}