{
  "AuthorID": "Erinashley19",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277295/profile",
  "Posts": [
    {
      "AuthorID": "Erinashley19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277295/profile",
      "Content": "Erinashley19 wrote: Hello all. This will probably sound ridiculous but about a month ago I was putting away the vacuum and winding up the cord when the end of the cord (with the plug) came up and whipped me hard in my breast. The initial pain was severe but slowly went away after about 20 seconds. I didn’t bruise and didn’t think anything of it until a few nights later I went to sleep and my breast was hurting in the same spot where it was hit (I was sleeping on my sides my breast was squished). After that I began feeling around and the area where it was hit and itwas extremely tender. Now it’s a month later and the area is still very sore. There’s no lump, no breast change of any sort that I can see or feel. It just can’t be right that the area is still so painful! I’m 36 and have dense breasts. The area of concern is in the upper(fairly high but still in the breast in my opinion) inner part of my breast at about the 2oclock position. It hurts most when I press it but also hurts if I run or jump. I’m beginning to think there is a lump I can’t feel and the cord happened to hit it just right causing pain? I just don’t know what to think but I’m freaking out :( E Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866011",
      "Title": "New here and worried Erinashley19 Erinashley19"
    },
    {
      "AuthorID": "Erinashley19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277295/profile",
      "Content": "Erinashley19 wrote: I actually posted a day or 2 ago about pain in my right breast from a hit caused by my vacuum cord (I know it sounds ridiculous). The pain hasn’t lessened or worsened since. It been a month. The area is tender but I can’t seem to feel any distinguishable lumps. I though it was just sore from being hit so hard but I think not after a month has passed. This afternoon I was poking and prodding (as I’ve done just about everyday for a month) and this time I squeezed and got some sticky green discharge. It literally looks like an infection. Now I’m in full on panic mode!!! I was planning to call my OB once I was done with my period but I cant wait that long. I’ll have to call Monday. Has anyone else experienced nipple discharge like this? I’m assuming this is quite bad :( please help! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866041",
      "Title": "Green nipple discharge. Help! Freaking out! Erinashley19 Erinashley19"
    },
    {
      "AuthorID": "Erinashley19",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277295/profile",
      "Content": "Erinashley19 wrote: I'm making an appointment today with my OB but wanted to get some feedback from anyone who experienced something similar. A month ago a whack to my right boob from the vacuum cord either caused this pain I'm feeling or simply brought it to my attention (I'm thinking the latter). For weeks it was painful to even lay on my right side becuase it would squish my breast. A couple of time I got firm hugs from people and that too caused pain like someone pressing on a really nasty bruise. The past week or so the pain hasn subsided quite a bit. I no longer have pain when i sleep, hug or move in general. But I take both hands and flatten them on my breast and push it flat i can feel the tender spot up high and kinda deep. It isn't as bad but it's still there.The location is also weird in thats it's higher up. It's about the 1or 2 o'clock positions (upper inner part) and at least 2-3 inches away from the nipple. I know self diagnosis is never going to work but it just seems like nothing fits the symptoms. I always figured IDC was closer to the nipple being in the ducts. Maybe ILC? I can't feel a thing as far as lumps go. There are no other symptoms, no puckering, bruising, thickening of tissue. I did have discharge but it was green and out of both nipples (and more than one orifice). This is NOT related to my cycle. That much I'm certain of.I know pain can be associated with cancer. I've read enough posts here to believe that but pain with no lump? I don't know what to think. Just looking for other people who can maybe share their experiences. Obviously hoping and praying for something benign.. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866136",
      "Title": "Deep,localized pain in 1 breast when pressed. No lump. Thoughts? Erinashley19 Erinashley19"
    }
  ]
}