{
  "AuthorID": "ErinOrchid",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164427/profile",
  "Posts": [
    {
      "AuthorID": "ErinOrchid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164427/profile",
      "Content": "Dec 12, 2012 12:54PM ErinOrchid wrote: I start chemo 12/26.",
      "MessageIndex": 4,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797520",
      "Title": "Is this really happening to me? ErinOrchid ErinOrchid"
    },
    {
      "AuthorID": "ErinOrchid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164427/profile",
      "Content": "Dec 11, 2012 09:44PM ErinOrchid wrote: Hi Ali, Actually my friend was telling me about it, he is a physical therapist and has a patient that is currently using one.  I wasn't actually sure it would work though, I brought it up to my onco and he kind of dismissed it as \"It may or may not work\". The chemo I have been prescribed is 4 treatments of AC and then 4 weeks of weekly infusions of T. And if I am accepted into this study then possibly a year of this other drug due to the HER2+ findings.  Has anyone else had experience with the cold cap deal? Help! :)",
      "MessageIndex": 2,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797520",
      "Title": "Is this really happening to me? ErinOrchid ErinOrchid"
    },
    {
      "AuthorID": "ErinOrchid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164427/profile",
      "Content": "Dec 12, 2012 07:53PM ErinOrchid wrote: Hi Ali, Thank you! I need all the tips and tricks I can get about the Chemo! Also, thanks for pointing in the direction about the cold caps! I have gotten some more information on it and am seriously considering using them! Erin",
      "MessageIndex": 6,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797520",
      "Title": "Is this really happening to me? ErinOrchid ErinOrchid"
    },
    {
      "AuthorID": "ErinOrchid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164427/profile",
      "Content": "ErinOrchid wrote: I am 29 years old, diagnosed with IDC triple negative (although I had HER2 receptors on my 4.7cm tumor) on November 8, 2012. I found my lump when it was the size of a nickle and by the date of sugery (2 months after discovering the lump) it was 4.7cm. I had a mastectomy of my left breast with 17 lymph nodes removed on November 26, 2012. Today, I found out PET scan results which identified a 'hot spot' on the back side of my ribs. So now I will also under go a CT guided needle biopsy this week. It feels like one thing after another. At first I was in denial about it all, then I saw my chest where my once young pretty breast sat for so many years and it hit me, \"I will never be the same ever again\". I was so excited to get breasts ('become a woman') but now I feel like they have betrayed me and I am so angry. More and more I am starting to think this is just the beginning of this horribly ugly thing called cancer invading my once active, social, busy life. Before my surgery I was thinking, once you get through surgery and see your new chest you will move on and be OK. But now knowing I have 6mo of chemo with possible radiation to follow the chemo, a mastectomy of my right breast, and all that comes along with reconstruction, I am admitting I feel defeated, exhausted, emotionally at my edge, and this is just the beginning of a long road. Dx 11/8/2012, IDC, 4cm, Stage IIB, ER-/PR-, HER2- Surgery 11/25/2012 Lymph node removal: Left, Sentinel; Mastectomy: Left; Prophylactic mastectomy: Right Chemotherapy 12/25/2012 AC + T (Taxol) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797520",
      "Title": "Is this really happening to me? ErinOrchid ErinOrchid"
    },
    {
      "AuthorID": "ErinOrchid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164427/profile",
      "Content": "Dec 13, 2012 04:26AM ErinOrchid wrote: Hi all, I'm new to BC (diagnosed on 11/8/12 at age 29). I had a mastectomy on my left side 11/26 and start chemo on 12/26 (Merry Christmas... right?!?!) I am typically an easily nauseated person (if I get a head cold I typically vomit), in fact I have vomited from smelling something gross and even from brushing my teeth. I am really sensitive to most medications and for my surgeries I have had to be loaded up with anti-nausea meds.  On top of being emotional about the possibility of loosing my hair and I VERY nervous about being ill for the next 6 months during my chemo. I am currently being prescribed  dose dense chemo: 4 treatments of AC and then 4 weeks of weekly T.  Any tips and tricks would be amazing! Erin",
      "MessageIndex": 306,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "ErinOrchid",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164427/profile",
      "Content": "Dec 14, 2012 06:54AM ErinOrchid wrote: Hi all, Thank you so much for the support from everyone! Reading this after a day like today helps me to feel not so alone :) Had a ultrasound needle biopsy in the middle of my chest this afternoon, right by my fresh MX (let's just say it was not pleasant AT ALL)... My PET scan indicated a 'hot spot' which turned out to be a lymph node.  I am afraid this might be metastasized from my left breast... My onco said that if it is cancer the chemo should shrink it... hope it's not another surgery...grrr Well, hope everyone has a restful night!",
      "MessageIndex": 333,
      "PostDate": "14/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    }
  ]
}