{
  "AuthorID": "eva9310",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201378/profile",
  "Posts": [
    {
      "AuthorID": "eva9310",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201378/profile",
      "Content": "eva9310 wrote: I'm newly diagnosed but have already started my chemo treatment.  I'm in Houston, TX so we have excellent care here fortunately and I'm with MD Anderson which has some of the best cancer docs and research so I feel confident in my care.  I noticed so many people have surgery first.  That was my initial reaction too but then after hearing my doc explain why chemo first I couldn't see it any other way.  Just curious.  I know everyone has a different story but in the few posts I've read, I hardly see anyone doing chemo first. Stage 2B, 2 tumors 1-4.5 CM left side only, the other was less than 2cm, 2+ lymph nodes ER/PR - Negative, HER2 - Positive 6 months of chemo (3 months of Adriamycin & Cytoxan then 3 months of Perjeta, Taxol, Herceptin), then surgery then 9 months of Herceptin) We won't know about radiation till after surgery and I will weigh that with the overall odds of recurrence at that point. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/821821",
      "Title": "Confused as why everyone seems to have surgery first eva9310 april25"
    },
    {
      "AuthorID": "eva9310",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201378/profile",
      "Content": "Jun 11, 2014 09:38PM eva9310 wrote: Wow!!  Thanks for the responses.  I really only found out about my cancer and within one month my team at MD Anderson had me started on my chemo.  I tried to do as much research as possible but it was all so confusing and I was so busy trying to line up my life, kids, summer etc before chemo.  I really assumed this was the \"standard of care\" for my type of chemo, I did have the option of surgery first but my medical and surgical oncologist strongly suggested I go this route with the hope of having complete ratification or as close to it as possible.  I didn't know Prejeta was new but I believe I do remember them saying that between that and taking the perception for another 9months after chemo they have had great success.   You all don't know this but my hair just started falling out yesterday (sad but true statement, my hair and my boobs were my two better assets :-) - so I was feeling down and  your responses made me feel good about my treatment and put a smile on my face (especially since I'm new to post).  This website is one of 3 my medical oncologist suggested I visit to avoid a bunch of wrong information.  I'm glad I came here!  Thank you all again! Eva",
      "MessageIndex": 6,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/821821",
      "Title": "Confused as why everyone seems to have surgery first eva9310 april25"
    }
  ]
}