{
  "AuthorID": "evieo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
  "Posts": [
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "Jul 26, 2008 04:59PM evieo wrote: I am in Physical Therapy right now for baddddd shoulder pain, pectoral muscle pain and pain that runs down my arm. I finished rads on 12/28/07.  This week I had a PET scan, I am still showing NED.  I saw the rads doc on Thursday and she said she felt strongly that the pain stems from the cervical spine, like a pinched nerve. I will see the PCP next Friday, hopefully to get a bone scan ordered. Go on vacation. Stress also causes pain in the shoulder blades. Relax a bit and try not to sit on hard surfaces too long. Blessing to you and your hubby on your trip! Evie",
      "MessageIndex": 4,
      "PostDate": "26/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/709696",
      "Title": "Muscular or the scary stuff? caaclark LizM"
    },
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "Jul 25, 2008 02:59PM evieo wrote: I am on Tamoxifen since Jan '08 and have pain in the hip, sometimes feet.  I walk 5 out of 7 days and go to physical therapy. If I need a pain reliever, I take Advil or Aleve, but not very often.  You can also try one of those wraps you place in the microwave to deliver moist heat. Good luck with it! Evie",
      "MessageIndex": 7,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/709609",
      "Title": "pain meds roxy42 evieo"
    },
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "Jan 3, 2010 10:05AM evieo wrote: I got a pain in my right side (bc side) half way through rads.  That pain has been with me for 2 years now.  I've had 2 PET scans (last in March '09) after the pain arrived and they were showing NED.  I just had xrays of the ribs and they show that I had previously had a broken rib on that side. I had NEVER been told that before so I guess it happen after chemo.  My bone scan and MRIs (last in March 09) show arthritis and degenerative disease in my spine and neck.  I will be 60 on Feb 13 so I guess the arthritis is to be expected.  I have not pushed for any other testing because I want my body to rest from so much radiation. The pain is daily, sometimes wose then others, but never stops me from doing what I want to do.",
      "MessageIndex": 6,
      "PostDate": "03/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746017",
      "Title": "arthritis on recent bone scan... really? LittleFlower LittleFlower"
    },
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "Aug 17, 2008 04:47PM evieo wrote: Hi, Mary Lou, Except for taking naps, I could have written your message myself.  I finished all treatment at the end of 2007 and I often say \"I am not the same as I was before.\"  I have always had boundless energy and could be on the go morning til night, now I can only do a portion of what I used to. Oh, I walk almost every day, I clean one or two rooms at a time, I cook and wash.....BUT there is a big difference in what I can do now. I think you are right, lack of estrogen probably is the culprit. I also have problems thinking straight and remembering stuff. All in all, I can see and feel what this experience has done to me but I still have to be very thankful that I am still here.  I won't ever be who I was again but I struggle to be the best of who I am now. Not everyone can see this struggle so they don't always understand. I am just glad I found this board where others DO understand and I get my support here for all the side effects of bc. Hope things move along for you. If you need that nap, then take it! Only you an your body know what a fight this is. God bless you, Evie",
      "MessageIndex": 1,
      "PostDate": "17/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719657",
      "Title": "Still have the fatigue after 2 years. Mary-Lou Molly2013"
    },
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "Jul 11, 2008 05:54PM evieo wrote: Naomi, The surgeon who did my initial biopsy was the first one to give a stat to me and he said 50/50. The oncologist has never given me stats because he says that stats are very broad and do not reflect an individual's chances. Also, the info is always old info as they cannot keep them current because of the sheer numbers involved.  He told me we have done all could do to treat my bc and I should go out and live my life.....IF it comes back...well, we'll deal with it at that time.  I continue my fight by walking 4 to 5 miles on most days. I completely understand being scared sometimes, I know I am. Then I have to actively seek out a loving moment and embrace life today. I snuggle on the couch with my husband, or pull a beautiful granddaughter on my lap for a kiss, call one of my sisters to chat, make a big family meal on Sunday, etc.  And every single day, the first thing I do is thank God for another day, not just because I have bc......but also because you CAN always get hit by a truck. Find those things that make you feel most alive, then embrace them when you are scared.  Feel the power of life, of loving moments. I am Evie and I live about 40 miles north of Dallas, TX.",
      "MessageIndex": 12,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/708899",
      "Title": "80 % chance of it coming back!!! Naomi browneyes2323"
    },
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "Aug 6, 2008 09:14PM evieo wrote: Danyel, I iked the advice Bobbie just gave you! When I was n chemo, I would be down for about 2 days..too sick to do anything much but lay on the couch and sleep most of the day.  The only food that had any appeal was a Big Texas Cheeseburger, even when I had no taste buds. Maybe it was a mental thing.  I would gain 6 to 10 pounds during the chemo day and the next day, probably from the steroids and the BIG bags of IV I would get to keep me hydrated. Those pounds melted away as I expelled the IV liquid.  After 2 days down, I'd be back to normal with no problems until the next infusion. I feel that I did not have a hard time during the year I was on chemo and I weighed the same at the end as I did at the begginning. Good luck to you! Just look forward do anything you feel you need to do to get through this. It's a fight but you'll never fight alone.  Blessings to you, Evie",
      "MessageIndex": 9,
      "PostDate": "06/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719128",
      "Title": "update from doctor Danyel98 Maryiz"
    },
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "evieo wrote: I am wondering if anyone experienced a tingly, sometimes numb, sometimes a litlle pain, in their back before dx with mets.  The spot is just to right of my spine, nothing can be seen like a mole, lump, etc. This sensation comes and goes.  I have reported it to my PCP but not the onc yet. Dx 10/24/2006, IDC, Stage IIIB, Grade 3, 3/12 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725454",
      "Title": "Tingling spot in back evieo mye"
    },
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "Feb 27, 2009 11:43AM evieo wrote: I have always had dense breast too, always had my mammos every year, usually called back for a sonogram because of the density and mammo hard to read. Never found the lump that spread to my lymph nodes under my arm and under the collar bone. In fact, had 2 mammos after the node biopsy, both came clean.  Then had a breast MRI, no lump found, no cancer that had spread only a new teeny, tiny spot of a DCIS that the Radiologist said was NOT the same cancer found in the lymph nodes (hence, I only have had a lumpectomy.)  I have digital mammo every 6 months on the BC breast and MRI once a year. So far, insurance has paid.",
      "MessageIndex": 19,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719956",
      "Title": "Dense breasts.....demand mri Naomi evieo"
    },
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "Dec 4, 2008 07:17PM evieo wrote: Sunshine Smiles...first of all, I LOVE your name and the picture it paints in my mind.  Thank you for answering, I am going to continue pushing my PCP to look into it.  If it is nerve related, I still would at least like to know that.  Hugs back to you! Evie",
      "MessageIndex": 2,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725454",
      "Title": "Tingling spot in back evieo mye"
    },
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "Dec 5, 2008 01:23AM evieo wrote: Kasey, My prayers are with you and your family. Fight, Kasey, because this is war! Get angry at the BC, raise your fist at it and declare the most intense battle you've ever fought. I'll be fighting along side of you. Tender hugs, Evie",
      "MessageIndex": 25,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725446",
      "Title": "Now under Hospice/Palliative care Kasey RobinWendy"
    },
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "Dec 9, 2008 10:15AM evieo wrote: Thanks for answering, everyone!!!  The PCP checked it again yesterday and feels it is connected to a neck problem that causes pain in my shoulder too.  I am going to keep on top of it. Hugs and smiles, Evie",
      "MessageIndex": 8,
      "PostDate": "09/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725454",
      "Title": "Tingling spot in back evieo mye"
    },
    {
      "AuthorID": "evieo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55484/profile",
      "Content": "Jun 13, 2010 12:47AM evieo wrote: I was diagnsd in Oct 2006 because of a painful node in the axilla, Biopsy showed 3 nodes all cancer. I then had 5 different chemo agents over a standard course from Nov '06 to Sep '07. Primary never found over many  MRIs, sonograms, exams.  For surgery, surgeon said no masectomy needed, oncologist argued that \"yes\" it was needed.  Had a lumpectomy on a very tiny new cancer in the same side but it was not the cancer than invadede the lymph nodes. After surgery, I had 35 rounds of chemo, all finished at year-end 2007. So far so good, 2.5 years with clean reports! I take tamoxifen for a 5-year period.  Good luck to you!!  It's a scary, tough decision to make.",
      "MessageIndex": 6,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/753797",
      "Title": "Unknown Primary - mastectomy? pamdo hymil"
    }
  ]
}