{
  "AuthorID": "Evilmidget",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209328/profile",
  "Posts": [
    {
      "AuthorID": "Evilmidget",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209328/profile",
      "Content": "Mar 6, 2015 11:45AM Evilmidget wrote: I'm supposed to have 36 treatments and have had the first 10. I haven't noticed too much fatigue but today my aerobic capacity seemed much less than normal (Spinning). I think I'll dial it back a bit the next couple of days and see how things go.",
      "MessageIndex": 152,
      "PostDate": "06/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730002",
      "Title": "RADIATION FATIGUE - POLL bluejay1 Siciliana"
    },
    {
      "AuthorID": "Evilmidget",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209328/profile",
      "Content": "Jan 27, 2015 10:30AM Evilmidget wrote: Thanks everyone! I think I was just feeling a little sorry for myself yesterday because 1) I didn't get my drains out, which I was really counting on, and 2) more cancer was found as a result of the mastectomy. It was all a little overwhelming. I'm better today.",
      "MessageIndex": 6,
      "PostDate": "27/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/827919",
      "Title": "My husband won't look at me. Evilmidget Jpicch"
    },
    {
      "AuthorID": "Evilmidget",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209328/profile",
      "Content": "Evilmidget wrote: I had my mastectomy a week ago and although I'm not healed by any stretch of the imagination, my scar isn't that bad. I just went to my post-op and found out I have more caner which means radiation (no chemo), but my surgeon also wanted to see my incision and I lifted up my camisole to show her. Meanwhile, I looked out of the corner of my eye at my husband and saw he turned his head toward the wall. I know he has an issue with blood but it's just a scar. Tonight I asked him if he was uncomfortable with my mastectomy and he said, \"No\". but when I asked if he'd just look at my breast (or lack of breast), he said it wasn't important and he didn't care. We haven't been intimate for awhile due to his impotentance, but this isn't about sex. I'm pretty devastated because it's as if I'm just a thing....like a piece of furniture that's been dinged or something. Is this something that any of you have experienced? Dx 12/1/2014, DCIS/IDC, Left, 2cm, Stage IIA, Grade 2, 0/3 nodes, ER+/PR+, HER2- Surgery 1/20/2015 Lymph node removal: Left, Sentinel; Mastectomy: Left Dx 1/21/2015, DCIS, Left, 3cm, Stage 0, Grade 2, ER+/PR+, HER2- Radiation Therapy 2/23/2015 Whole-breast: Breast Hormonal Therapy 2/23/2015 Arimidex (anastrozole), Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/827919",
      "Title": "My husband won't look at me. Evilmidget Jpicch"
    },
    {
      "AuthorID": "Evilmidget",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209328/profile",
      "Content": "May 6, 2015 03:57AM Evilmidget wrote: I had my left breast removed in January, 2015 and don't know why I didn't request the other one be removed at the same time. I told my surgeon I didn't want reconstruction and to please make my incision as flat as possible. I finished rads (I had unclear margins) in April and met with my surgeon about a week later. I told her I'd like my other breast removed and she said, since it's elective surgery I should make sure to take all the vacations etc. before the surgery because, although that breast is cancer free, it's never 100% clear until the pathology says it's clear. So...long story short, I'm having the next MX in October. That way I can enjoy Summer, and bike riding, hiking, golfing AND the brand new Great Pyrenees puppy that we'll be bringing home in early July. ",
      "MessageIndex": 28,
      "PostDate": "06/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/827945",
      "Title": "How is life with one boob? mtrebtoske316 Bekadawn1"
    },
    {
      "AuthorID": "Evilmidget",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209328/profile",
      "Content": "Apr 3, 2015 12:59PM Evilmidget wrote: I second Compass Oncology and Dr. Schneider. I'm in my 6th week of radiation there and the techs. are great, the SIM was great and I can't say enough about this group. I understand they also have a Compass Oncology in Portland where some of the doctors on our side (Vancouver) also treat patients. I'm so pleased with their care and professionalism. ",
      "MessageIndex": 3,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/830038",
      "Title": "Comments on Radiation Oncologists in Portland, OR metro area? Hopeful82014 Hopeful82014"
    },
    {
      "AuthorID": "Evilmidget",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209328/profile",
      "Content": "Feb 4, 2015 10:45AM Evilmidget wrote: Thanks for the replies. Mine is very small and not uncomfortable and I noticed it after my workout yesterday. I think I'll wear a compression top today and see what that does but I think I will just wait and see if it gets any larger (good idea Kittybelle about taking pictures to track the size). Oh...and off topic, does anyone know why my diagnosis doesn't appear at the bottom of my posts? I have it set to \"members\".",
      "MessageIndex": 5,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/828170",
      "Title": "Seromas? Evilmidget Erica"
    },
    {
      "AuthorID": "Evilmidget",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209328/profile",
      "Content": "Evilmidget wrote: I had a unilateral mastectomy without reconstruction on Jan. 21st and so far it's been really painless. I got my drains out eight days after surgery (it was a relief, but wow...did that burn!!). Anyway, today I noticed that I've got a small to moderate seroma around the scar. It's not infected, just had that \"waterbed\" kind of effect where I can push on it and actually see that there is some fluid in there. I've read that they will eventually reabsorb, but that sometimes they need to be aspirated with a needle. Has anyone had this issue and what did you do? As I said, it's a pretty small swelling...no sign of infection, just fluid. I don't know if it's significant enough to call my nurse navigator or not. Dx 12/1/2014, DCIS/IDC, Left, 2cm, Stage IIA, Grade 2, 0/3 nodes, ER+/PR+, HER2- Surgery 1/20/2015 Lymph node removal: Left, Sentinel; Mastectomy: Left Dx 1/21/2015, DCIS, Left, 3cm, Stage 0, Grade 2, ER+/PR+, HER2- Radiation Therapy 2/23/2015 Whole-breast: Breast Hormonal Therapy 2/23/2015 Arimidex (anastrozole), Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/828170",
      "Title": "Seromas? Evilmidget Erica"
    },
    {
      "AuthorID": "Evilmidget",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209328/profile",
      "Content": "Feb 4, 2015 10:07PM Evilmidget wrote: I just have the one they put on me after my MX surgery. It's like a 1980's tube top...but tighter. Today I just wore one of my HB compression tops from my workout stuff. Since I am a personal trainer/fitness instructor I have a lot of this type of clothing but I have found that the tops with the built-in bras irritate my scar and I don't think they do anything but increase the pressure that might cause the seroma to get larger.",
      "MessageIndex": 8,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/828170",
      "Title": "Seromas? Evilmidget Erica"
    },
    {
      "AuthorID": "Evilmidget",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209328/profile",
      "Content": "Feb 4, 2015 10:46AM Evilmidget wrote: Oh sure...and now it shows up! ",
      "MessageIndex": 6,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/828170",
      "Title": "Seromas? Evilmidget Erica"
    }
  ]
}