{
  "AuthorID": "EXAIMA",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10251/profile",
  "Posts": [
    {
      "AuthorID": "EXAIMA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10251/profile",
      "Content": "EXAIMA wrote: I could not say this before, My mom died almost 20 days ago. She battled 3 years  with the recurrence, but she said she was tired. God bless my mom. WE LOVE YOU AND WE WILL NEVER FORGET YOU. Thank you for everything you gave me here, I helped her a lot just because you helped me. I will have you forever in my prays.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706848",
      "Title": "My mom is an angel now EXAIMA omo"
    },
    {
      "AuthorID": "EXAIMA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10251/profile",
      "Content": "EXAIMA wrote: Hi, It has been a long time since I wrote last time. My name is Yasmina and I am writing from Honduras. My mom is very sick now, It is 2 years ago since she knew she had mets in  the lungs, bones and chest wall.  She drained her lung last april and since then she has not recovered. She stays in bed almost every day, and now since almost one month  she has migraines every day. We went to the doctor waiting for brain mets, but he told us she is fine but she has a HERNIA IN THE SPINE CLOSE TO THE NECK. She is in terrible pain and barely walk now. Sometimes I feel so angry and sad, I wish I could do more for her. I love my mom so much and she had suffered a lot in her life, that this is so UNFAIR! sorry, I feel very sad today, I wish my mom wasn't sick. I love her , and I pray to God every day. thanks for listening. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/699469",
      "Title": "HERNIA IN THE SPINE EXAIMA LuAnnH"
    },
    {
      "AuthorID": "EXAIMA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10251/profile",
      "Content": "EXAIMA wrote: My mom had a transfusion two weeks ago and did not have any change, her hemoglobin is in 9, she was almost 6, she is very weak and sad, (like depression ) she has a strong pain in her right leg. She almost can not walk, the doctor says it is not normal, he has to check if the cancer is in the bone marrow and spread all over in the bones. She was diagnosed two years ago with mets in lungs and some points in bones, but they were little, now I think he supposes it is became worst. Has anyone gone with something like this? What can be? My mom is having a radiography tomorrow and the doctor says we are gonna know. I hope is nothing terrible. I will pray today, please pray for us. Sometimes I forget my mom is sick... But this disease always come back to remember us. Thanks for everything. from Honduras with love and scared. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/663373",
      "Title": "I am very scared! EXAIMA sportycath"
    },
    {
      "AuthorID": "EXAIMA",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10251/profile",
      "Content": "EXAIMA wrote: I told you my mom was having these terrible headaches and she did a scan and everything was fine, well results that they did it again and something appeared, they found several mets. I do not know what happened the first time,well, the doctor sent 10 radios and we thought that she was going to be ok. After that she began having terrible pains in her \"stomach\" or very close. the doctor sent a liver scan. They found that she has mets there also. But the doctor now said, he won't send anything to her, he exactly said \" Her time is coming\" What? Why does not send medicine to the liver or something? I asked him like twenty times, and he said she can not take any more rads or chemos. There was no  use at all. The only thing he will send now is medicine for the pain, I asked how much ? He said WEEKS. WEEKS ? WHAT THE HELL IS THAT? We are not done yet! This thing hasn't seen the best of us! When my mom knew ( We did not tell her the part of weeks) She became very depressed and sad and said she is tired. Help!!! What can we do? Just wait? Help please!!  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703111",
      "Title": "MOM WITH METS IN LUNGS, BONES, BRAIN AND NOW LIVER EXAIMA sdurantmd"
    }
  ]
}