{
  "AuthorID": "exercise_guru",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221172/profile",
  "Posts": [
    {
      "AuthorID": "exercise_guru",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221172/profile",
      "Content": "exercise_guru wrote: I am having a lot of issues with my right breast what is slipping under my armpit and I'm having a lot of discomfort. I have one sports bra that supports under my arm and pushes that breast forword to the front. Unfortunately it will not hold my prosthetic on the other side. Does anyone have a suggestion for a good sports bra I can wear all the time to keep that breast going to the front so it doesn't rub up under my arm? My plan is to find a good mastectomy sports bra was separate cups and a wide band under my arms to provide support both sides. I would appreciate any help cuz I'm not sure what to do my regular mastectomy bras are good and the ones I got from Walmart also tend to have a wider band under the arm. Unfortunately I really need to push that breast forword also I have a lot of pain from the cording above it right into my armpit. Age 42 05/15/2015 PALB2 mutation, DBL Breast Cancer Type 1A Grade 3 ER+PR+(right 1.3cm,.5cm) HERr+(left1.6 cm), 06/26/2015 BMX with TE 8/27/15 Chemotherapy TCH 12/30/2015 TAH/BSO/Reconstruction 1/29/16 Arimidex 3/1/16 Femara 5/6/16 Tamoxifen Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/868714",
      "Title": "I need a sports bra with under armour support exercise_guru LoriCA"
    },
    {
      "AuthorID": "exercise_guru",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221172/profile",
      "Content": "exercise_guru wrote: Ladies I am hoping maybe you might give me some advice. I had reconstruction but my breasts are shallow like hamburger bun shallow and I would like to move up a size when I wear my bras and fill them so they are not dented and appear naturally? I do not know anything about Mastectomy Bras or forms. Is there a possibility that something would work in my situation? I posted here because I am hoping that the ladies in this forum would be more knowledgeable about what products might be available. I am hoping for something lightweight and breathable. Also any recomendations for a good Mastectomy Bra I could buy to try. I have been researching converting bras on the internet but I have never seen one in real life to know what to do. I am not sure if this is relevent but I have a very wide chest so my implants are quite flat even with the biggest size of teardrop my PS said he could put in. The bra is a large 38C but I would look much better proportioned if I were a 38D or DD Age 42 05/15/2015 PALB2 mutation, DBL Breast Cancer Type 1A Grade 3 ER+PR+(right 1.3cm,.5cm) HERr+(left1.6 cm), 06/26/2015 BMX with TE 8/27/15 Chemotherapy TCH 12/30/2015 TAH/BSO/Reconstruction 1/29/16 Arimidex 3/1/16 Femara 5/6/16 Tamoxifen Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/847871",
      "Title": "Breast forms? Reconstruction but much smaller than I was exercise_guru SpecialK"
    }
  ]
}