{
  "AuthorID": "Expat2uruguay",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277219/profile",
  "Posts": [{
    "AuthorID": "Expat2uruguay",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277219/profile",
    "Content": "Expat2uruguay wrote: Hi everyone. This is actually my second post here. this morning I started my chemo treatment and I feel pretty good. After the treatment I ran some important errands that involver walking for 30 minutes. But just now I vomited (a lot) for the first time. It's concerning how quickly it comes on. I barely made it to the bathroom in my own house. I don't know what I would do out in polite Society, or while I was walking down the street. I guess I better carry a roll of toilet paper for cleanups. Anyway, the thing I'm really struggling with is a lack of information. Because I I'm living and receiving treatment in a country where I don't speak the language fluently or hardly at all it's very difficult for me to understand what's going on. The doctor gave me some papers 3 weeks ago, but someone misplaced them while I was on vacation seeing family in the states. So my biggest priority is to get back to the doctor 4 those papers. my best friend came with me today to translate and help me with my first chemotherapy treatment. Unfortunately it produced a real strain on our relationship when I was pushing to get more information and she was doling out blame for the loss of information. I plan to just go it on my own, because I don't believe that these doctors are telling me the truth when they say they don't speak English. English is taught for three years in the elementary schools here and anyone who receives higher education probably knows more English. Besides, my oncologist is the freaking son of the president, so I really find it hard to believe that he can't have a conversation with a patient in English. so I'm going to force the issue by showing up alone with my Google translate on my phone and see how it goes. This would be for the appointment with the oncologist to replace the lost papers. The lacknof info is pretty damn frustrating, but it is extremely unhelpful for me to appear frustrated. I hope that this place can be one of my strategies to bridge the information Gap. I just wish this site wasn't so big... Dx 6/1/2018, IDC, Right, 1cm, Stage IIB, Grade 2, 12/2 nodes, ER-/PR-, HER2+ (IHC) Chemotherapy 8/27/2018 AC Radiation Therapy Hormonal Therapy Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "27/08/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866869",
    "Title": "First chemo treatment and first vomit Expat2uruguay Fairchild"
  }]
}