{
  "AuthorID": "Fa-Marie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270735/profile",
  "Posts": [
    {
      "AuthorID": "Fa-Marie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270735/profile",
      "Content": "Fa-Marie wrote: my daughter is 23 and developed 2 large lumps that are hard. One is about 1-2 inches from her collarbone on the right side that is oblong shaped on her chest wall but not in her breast. It feels like a broken rib or her rib is pushing out. The other is half an inch to the right of the center of her breast that is round about the size of a quarter. Neither cause pain to the touch and both are hard like bone. The doctor had an x-ray and an ultrasound. Both came back normal and the doctor can't explain whatthe lumps are. The dr told my daughter if it was cancer or concerning it would show up in the x-ray. I told my daughter that's not true. The dr told her she's young and it's Nothing to worry about. Both lumps appeared and seem to be getting bigger. No direct pain to touch. But has an achy feeling behind her chest wall, that has been getting worse. I'm not sure what to think. Any advice because all I can do is worry Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863212",
      "Title": "Too young Fa-Marie Moderators"
    },
    {
      "AuthorID": "Fa-Marie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270735/profile",
      "Content": "Mar 14, 2018 09:49AM Fa-Marie wrote: I agree that they should be able to explain what the lumps are and not just write it off. The first appointment the dr had to call another dr in to feel the lumps because the dr appeared puzzled to the size and the feel of it. That's when they ordered X-rays which was Normal results. so the dr ordered ultrasound and that came back normal. Going back to the dr one more time to see if they can explain or run more test. I will see if we can get the imaging report.",
      "MessageIndex": 2,
      "PostDate": "14/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863212",
      "Title": "Too young Fa-Marie Moderators"
    }
  ]
}