{
  "AuthorID": "FabFive",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275514/profile",
  "Posts": [
    {
      "AuthorID": "FabFive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275514/profile",
      "Content": "Jan 4, 2019 08:54PM FabFive wrote: I went back after the 6 months and the mass is now 1.2 cm so it has doubled in size. Both the ultrasound and mammogram are clean and cannot see the mass. So they have to send me in for a MRI biopsy next week. So we will see.",
      "MessageIndex": 4,
      "PostDate": "04/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/865219",
      "Title": "New Bi-Rad 3 Mass - should I get a biopsy FabFive KBeee"
    },
    {
      "AuthorID": "FabFive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275514/profile",
      "Content": "FabFive wrote: I am 37 years old and have a strong family history of breast cancer - for the past 4 generations every woman on my mothers side has had it. Including my mom at age 55 and my sister at age 36. I am the only one that hasn't. All of us have been negative for BRCA1 and BRCA2. So I started screenings at 30. I had a breast MRI earlier this week and they found a new 6mm mass that is categorized as Bi-Rad 3. It is 5mm from the nipple and I have some tenderness there but it is not palpable. My doctor just said to wait 6 months and repeat the MRI. So it's super small and didn't look that concerning to the doctor. My concern is that we know it wasn't on the MRI last year and it didn't show on my mammogram in August either so we already know it is new. With my family history should I be pushing for a biopsy or just chill and wait the 6 months? I don't want to be the super anxious patient but I also don't want to sit and wait if it is a problem Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/865219",
      "Title": "New Bi-Rad 3 Mass - should I get a biopsy FabFive KBeee"
    },
    {
      "AuthorID": "FabFive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275514/profile",
      "Content": "Jun 15, 2018 02:08PM FabFive wrote: I sent a message to my high risk doctor just to have her review the radiologist report and make sure she's ok with waiting. If she says she is good with it then I am ok waiting. I think my concern comes from the fact that it was not there on past MRI's and it is now so we already know it is a change - if it had shown on the baseline MRI I wouldn't worry at all. I think my other worry is just that the radiologist read the report and sent it to the nurse practitioner at my doctors office who called me but I am not sure if my actually high risk doctor reviewed it. My sisters was also Bi-rad 3 but because it was a change from the previous mammogram they biopsied it anyways and it turned out to be DCIS. Thanks for the input. Hopeful my doc can put me at ease.",
      "MessageIndex": 3,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/865219",
      "Title": "New Bi-Rad 3 Mass - should I get a biopsy FabFive KBeee"
    }
  ]
}