{
  "AuthorID": "Fabian59",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
  "Posts": [
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Dec 7, 2014 07:01AM Fabian59 wrote: Get the port. I just finished 4 infusions and all my IV in my same arm and have 2 bad chemotherapy burns which may never go away. My oncologist said I did not need a port but looking back now wish I had gotten one. Oh well all done with my chemotherapy and I am alive and feeling better. Onward and upward with the radiation and then put me back together. Attitude is everything. Maybe they will invent something to get rid of chemo burns. Hopefully.",
      "MessageIndex": 11,
      "PostDate": "07/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826668",
      "Title": "Chemo without a port Momaich nottoday"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Feb 1, 2015 01:30PM Fabian59 wrote: I am 4 weeks into radiation therapy and already have a bad rash and burn. I went to my dermatologist last week because I thought I was allergic to something but it turned out to be the radiation therapy. Have 3 weeks to go. I had a scare with my right breast and had to have a biopsy on that breast but it was benign. I only had the left breast out but now wishing I could have had both out. I have a consultation with my breast surgeon on Wednesday about having the other breast out. I am sick of biopsy's for the last 10 years. I feel that it would give me a better chance. Does anyone know how long you have to wait after radiation to have surgery on the other breast. If I can have it out then I will have the expanders put in and have my weekly fill ups. Then about 3 months after the other breast heals from the radiation will have reconstruction on both. Anyone else out there experienced this?",
      "MessageIndex": 1310,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Dec 9, 2014 07:47PM Fabian59 wrote: I also have Cigna Insurance and I had a surgical assistant that I was never told about or authorized. I see where she has filed another claim with Cigna which is still in the process which is more than the first. If my surgeon had checked to see if my insurance was going to pay it is one thing but she did not. If the insurance does not pay her bill (which I have not yet received one from her yet) then I am going to send it to my surgeon and tell her to pay it as I was never told or authorized her to be in the operating room with me. My surgeon can pay the bill out of what the insurance paid her. If she gives me a hard time I will not go back to by breast surgeon. Just saying....",
      "MessageIndex": 680,
      "PostDate": "09/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Dec 31, 2014 03:44PM Fabian59 wrote: I finished my last chemo session of Taxotere and Cytoxin on Dec. 3, 2014. I was so glad for that. This time I had a very bad edema (swelling) and fluid retention in legs all the way up past my knees. Of course I did not know that this was one more side effect from the chemo. Plus week and a half ago I jammed my big toe in the middle of the night and tore the big toe nail completely off. Ouch that hurt so just tore it out by the root. Good news it did not get infected and is now healing. Didn't expect that one. Guess Chemo makes everything in your body weaken. Went to Dallas and New Orleans for Christmas for 6 days. My feet were so swollen the whole time I could not really enjoy myself too much. After getting back on Monday night I went to my regular doctor and she called my oncologist to find out that the extreme edema is another side effect of the chemotherapy. Both doctor and nurses didn't know anything about chemotherapy so was very glad they called for me. I had no idea that that is what it was. I would keep my feet elevated all day and of course at night but after walking around for only 2 hrs. it was right back up to 2+ pitting edema. Hurt to walk. Doctor gave me lasix and potassium for 5 days. Have already lost 5 pounds of fluid from yesterday. They gave me enough for 5 days but don't know how long it is supposed to last. Anyone else have severe fluid retention. I had been on a plane and traveled in the car but never had it this bad. Supposed to start radiation for 6 weeks next week still waiting for them to call with my time. Three out of four treatments caused caused chemo burns but two out of three are healing nicely. I am finally getting my strength back and as soon as my feet get back to a normal size and can wear shoes then plan to start exercising. Hope everyone is doing well and hang in there so we don't ever have to go through this again. Happy New Year.",
      "MessageIndex": 751,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Oct 23, 2014 11:47PM Fabian59 wrote: Well thought I would update on my progress.  Just had second infusion yesterday, took 5 hrs. because there was so many patients getting chemo.  It is a wakeup call and now traffic does not bother me.  I used the cold caps both times and lost some hair so far.  I put it on 1 hr. before and left it on 4 hours after finished the treatments.  I am being treated with Taxol and Cytoxin as well as all the anti-nausea drugs and steroids.  I have to say that I am really not having a hard time at all.  Praise the Lord.  I have not been nauseated at all and only after taking the Neulasta shot is the worst I have felt.  Have not missed any work at all and have not had any reactions at all through both chemo sessions.  I go for my second Neulasta shot tomorrow and will continue to take the Claritin for 5 days post chemotherapy with 1000 mg of tylenol and told to do my my oncologist.  I will continue to post and wish all of you success in your coming months.  2 chemos's down 2 to go followed by 6 weeks of radiation and then I get my new boobie.....",
      "MessageIndex": 334,
      "PostDate": "23/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Dec 16, 2014 07:04PM Fabian59 wrote: I just finished my last chemo on December 3, 2014 and go to see the radiation doctor in two days. Assuming I will start January 5, 2015. Starting to take vitamins once again with iron to help with my blood count. Just went to Plastic Surgeon today and am at 450 cc's so will go back to him a month after finishing the radiation. Continue to go to oncologist every month now. Getting other breast checked also with breast surgeon. It seems like it will never end. I just want to wake up in the morning and feel like I am not tired. Well can't give up now. Everyone enjoy your holidays.",
      "MessageIndex": 693,
      "PostDate": "16/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Oct 30, 2014 10:50PM Fabian59 wrote: Speedcat:  Sounds like you have a chemo burn from your infusion.   I have one from the first infusion and my oncologist said it will probably eventually go away.  Second spot not yet but it does burn a little so hoping it doesn't make a mark like the first one.  Only two more treatments to go so don't really want a port.  Oncologist said I did not need one.  Hope everyone is doing well.  Hang in there.  Half way there.",
      "MessageIndex": 422,
      "PostDate": "30/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Nov 23, 2014 08:53PM Fabian59 wrote: I was diagnosed in July of this year an had a mastectomy in September. Two centinel nodes were disected and both were positive. When I had my MRI it did now show this so was pretty bummed out when I woke up and found out I could not have my Tram flap which I thought I was going to get. In stead I ended up with the expanders and have only two more fill ups before I am up to my 450 ccs. I was hoping that I could get away with just radiation but because of the positive lymph nodes and my oncotype test was 29 and because my oncologist considers me to be young (59) she was it would give me the best chance of survival. Without any treatment radiation or chemo they gave me a 85% chance of having a reoccurrence. I only have to have 4 chemos of Taxotere and Cytoxin and each treatment has affected me differently. I have had no nausea or vomiting at all just mostly being tired all the time. I continue to work full time but take off 4-5 days after each chemo treatment to wait for my immune system to readjust. I could have gone for the 85% of reoccurence but because we are one year away from retirement (my husband and myself) I felt I owed it to him. My oncologist said that if I was 75-80 years old she could not recommend any treatment. So I have endured 3 treatments with my last one scheduled for 12/3. I have used the elastogel cold caps and they are working. I have had alot of thinning but think I will keep what I have left at this time. Hang in there everyone. I am flying for Thanksgiving and plan on using a germ mask. I think it is important to be with family for Thanksgiving so will take my chances on the plane ride. Good luck everyone and enjoy your holidays.",
      "MessageIndex": 622,
      "PostDate": "23/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Dec 6, 2014 08:49PM Fabian59 wrote: They could do the tram flap after I am done with chemo, which I just finished and now I need radiation for 6 weeks. I can have the tram flap but I do not want to go through 5 weeks of downtime so went for the implant.",
      "MessageIndex": 664,
      "PostDate": "06/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Oct 12, 2014 07:19PM Fabian59 wrote: I have just completed my first chemo treatment almost 2 weeks ago.  My oncologist told me about the penguin cold caps so I watched the video and decided to try it.  Instead of buying them they told me to get the hypothermia cold caps on Amazon.  They came in two days and with the help of my amazing husband started it 30 minutes before they started of Taxotere.  I am also taking cytoxin for my chemo.  I only wash my hair at first every 5 days but was so oily that I could not stand it.  I used 4 caps during my first treatment and changed them out every 25 minutes and kept them on for 2 hrs. post chemo therapy.  I used baby shampoo but it seemed to not get out enough oil so am using another gentle shampoo that is all natural with no chemicals and no phosphate.  I still get only 2-3 days between washes and this seems to be the worst part of my chemotherapy treatment.  I am fatigued but have absolutely no naseau at all and have not missed one day of work at all except for the day of my treatments.  Can anyone recommend anything that you can spray on your hair to get the oil out or another kind of shampoo to get me thru the 3 days between washes.  I realize that I may still lose my hair and already have a nice wig just in case.  Only a few people at work know what I am going through so don't really want to way anything unless I have to because we have a very gossipy office.  I also put my hands and feet in ice water during my taxotere treatment.  I just received some new cold packs so that part should not be that bad for my next treatment.  Any information would be greatly appreciated.  Good luck everyone in out fight against breast cancer.  Oh by the way I was stage two and my two centinal nodes were involved so they say that I am only getting the chemo (4 ) treatments and then radiation as a longevity issue.  I am only 59 so would like a few year of retirement with my husband next year.   I had the expanders put in and won't be able to get my implant until May.",
      "MessageIndex": 190,
      "PostDate": "12/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Oct 29, 2014 05:46PM Fabian59 wrote: I am 7 days post chemo treatment #2.  Feel pretty good overall just feeling tired.  My only complaint is that I got frost bite on two of my fingers during my last treatment and the feeling on the ends of these two fingers have not gotten better at all.  Also the Taxotere marked my arm from the first infusion and now it is 4 weeks post first treatments and still has not gone away.  I went to the oncologist today and she said that it probably will eventually go away.  Second treatment has not marked my arm yet and hopefully it wont'.  I only have to have 4 treatments altogether so 2 more to go.  Has anyone else had either of these problems.  Thanks. ",
      "MessageIndex": 398,
      "PostDate": "29/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Nov 15, 2014 05:56PM Fabian59 wrote: I have just finished treatment 3 of Taxotere and Cytoxin and feel pretty good.  I have one more treatment left on 12\\3\\14 then on to 6 weeks of radiation.  Then have to wait 3\\4 months for implant.  Got expanders and only have 2 more filups to get to my 450ccs per my plastic surgeon.  I have to say that I really love all my doctors.  I have read back on several of these boards especially the cold caps users and feel very fortunate that I am being treated with respect and dignity.  My oncologist said I did not need a port so I did what she said .  Only complaint is after 3 infusions those three veins are gone.  Hope they come back some day.  I have had absolutely no nausea or vomiting because of the anti nausea drugs that I take before my infusions and they also give it to to IV before the drugs.  I am using cold caps and have had alot of thinning of my hair but will be happy with what I have left after my last infusion and feel I will still be ahead od the game. My first Neulasta shot was painful but the second one was not bad and today I am 3 days past my third shot and treating myself with Claratin and 1000 mg of Tylenol for 5 days post injection and it really helps.  I just pray to get through the holidays without getting depressed as sometimes I find myself worrying about the cancer.  I wish everyine good luck in yuour treatments.  Be good to yourself and baby yourself during your rough days.  I did not miss any work the first treatment but I have alot of sick time built up so after thr last two treatments am staying home to get through the 4-5 days post infusion.  Alot of people come to work sick and as our immune systems are so low I think it is better to baby ourselves.   Good luck everyone.  ",
      "MessageIndex": 570,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Dec 6, 2014 09:06PM - edited Dec 6, 2014 10:13PM by Fabian59 Well I just finished my last chemotherapy on Wednesday and boy am I glad. I am just trying to get through the side effects for my last infusion. My 3rd one was the worst for me and they say that they are all different. One was the learning session, two was not bad, three was really bad and so far #4 has not been that bad. We went to Louisiana for Thanksgiving and had a good time. I wore a mask on the plane so I would not get sick and I guess it worked. Looking forward to Christmas in Texas, another plane ride but should feel pretty good by then since it will be 3 weeks post last infusion. I used the cold caps and kept hair on the sides and back but lost alot on the top. At this point I am just happy to have any hair at all and look forward to it regrĵowing hopefully soon. I wear a wig to work so will have to continue for several months with that.The only thing I wish I had done different was if I could go back I would have gotten a port but my MO said I did not need one so went with her suggestion. I have 2 bad chemotherapy burns which may never go away and just waiting to see if the 4th one comes out. I pray it does not. Wishing everyone a Merry Christmas and a Happy New Year. I should start my radiation in January and then implant in June. Plastic surgeon said I would need 3-4 months to have it look the best. Good Luck everyone and don't give up.",
      "MessageIndex": 665,
      "PostDate": "06/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Fabian59",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206350/profile",
      "Content": "Feb 22, 2015 09:50PM Fabian59 wrote: Well I have now finished my radiation treatments as of last Friday. They gave me a certificate and a coffee mug which was nice. Burned pretty bad but it is starting to heal. I had 33 treatments altogether. I had a biopsy in the other breast last month and it was benign. I have decided to have the other breast out. My oncologist agrees with me and my breast surgeon. Wish I had had both of the out in September when all this started but no one suggested it so I am going to go ahead and do it. While I am healing from the radiation from the left side I can have the other mastectomy and get my weekly fill ups and have both permanent implants in mid June. Did not even get tired with the radiation. Alot of itching with the radiation dermatitis and spent about $200 on different creams and lotions. Oh well got through it, second phase done. Start Arimidex in two weeks. Side effects from that are bone loss, joint pain and hot flashes. If it helps save my life that's OK. Hope everyone is doing well. Planning a cruise after the other mastectomy after the drains come out. ",
      "MessageIndex": 889,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    }
  ]
}