{
  "AuthorID": "faith22",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108498/profile",
  "Posts": [
    {
      "AuthorID": "faith22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108498/profile",
      "Content": "Mar 17, 2011 03:04PM faith22 wrote: I had my BMX in October, initially had nerve pain and numbness and was given neurotin. They had to gradually increase the dose before pain was gone.(plus I think it has to build up in your system.)  I was on it a couple of months. Te nerve pain is now gone although I continue to have some numbness in axilla down to inside of arm. Managable at this point.",
      "MessageIndex": 13,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765786",
      "Title": "Nerve Pain post BMX with Axillary Dissection Question HollyinMich dannade"
    },
    {
      "AuthorID": "faith22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108498/profile",
      "Content": "faith22 wrote: I am just wondering if anyone can let me know what to expect. I am scheduled for BMX on 10/13 with immediate reconstruction. I am having tissue expanders put in with implants after treatment. I was told I would be going to nuclear medicine first for the lymph nodes then would proceed to surgery. What do they do in nuclear medicine, are injecting dye into the nodes, is this painful? I know I will be having sentinel nodes biopsies but I thought I would be under for that. I am staying overnight only, I know I will be coming home with drains but what can I expect concerning recovery.I was doing pretty well mentally unti they called me with a date, now I am starting to get real anxious again.I am trying to keep one day at a time and try not to think too far ahead. Can anyone give me some info . Thanks guys this site has been such a blessing Dx 8/26/2010, ILC, 1cm, Stage I, Grade 2, 0/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758934",
      "Title": "Wondering what to expect faith22 Lovegolf"
    },
    {
      "AuthorID": "faith22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108498/profile",
      "Content": "faith22 wrote: I have been dx with ILC (L) breast 1.8cm. MRI both breast showed two areas (R) breast as well. Had a core needle bx last week areas (R) breast and results were inconclusive, atypical cells. Surgeon wants to do excisional bx to get better path. Before I make decsion on how to tx (L) breast want results from (R). Given these choices for (L) breast. Lumpectomy, will try to get clear margins, if find out margins are not clear will have to go back in for more surgery at a later time. I was hoping path could be run while you were under.Lupectomy  would require radiation.How bad is radiation. My other choice is mastectomy with immediate reconstruction. Would not require radiation unless nodes involved. If I have to have radiation doesn't that effect sudccess rate of reconstruction. I do not see my oncologist until later this week so I have such limited information. It has only been two weeks since dx. My head is spinning and I have only just begun this journey Dx 8/26/2010, ILC, 1cm, Stage I, Grade 2, 0/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757963",
      "Title": "Just diagnosised/choices faith22 Cowgirl13"
    },
    {
      "AuthorID": "faith22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108498/profile",
      "Content": "Sep 7, 2010 12:29PM - edited Sep 7, 2010 12:31PM by faith22 Thanks for the reply, I will ask about MRI guided biopsy if they are unable to obtain biopsy witth ultasound think that would give me more peace of mind than having freq MRI to watch for changes. I honestly don't even know if my surgeon is a breast surgeon. This whole thing has  been a blur. My mamogram show a lesion in July, had a followup ultrasound checking same lesion,(nobody thought it was cancer) went to surgeon had another ultrasound, the lesion seen on Mamogram and first ultrasound was a cyst but after draining the cyst he saw another area that conserned him that he bx, that turned out to be cancer (this was not seen on mamogram). I have not even have a followup appt yet with my surgeon to discuss surgical options yet. I have the second bx Thurs and my appt with surgeon next Monday. So glad I have found this site",
      "MessageIndex": 3,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/757621",
      "Title": "Just diagnosised faith22 faith22"
    },
    {
      "AuthorID": "faith22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108498/profile",
      "Content": "Oct 19, 2010 10:46AM faith22 wrote: BMX with tissue expanders done 10/13. First couple of days rough due to drug reactions. Currently maintaining on advil with no problems, didn't tolerate percocett well. My chest doesn't look much different size wise than it did before surgey, just real numb, and I do have that tightness. Biggest irritation are these drains, will se PS today, not sure will pull or not. He initially told me two weeks for the drains, but then told me to bring my drainage log with me to appointment, so who knows? Lots of fatigue both mentally as well as physically, the mental part has surprised me. Giving myself permission to just veg on the couch. Initial frozen section on nodes is negative but surgeons says will have to wait for final pathology before they can say were definately negative. I should know more on Monday. No regrets on choice to do BMX, none!",
      "MessageIndex": 126,
      "PostDate": "19/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758668",
      "Title": "October 2010 Mastectomy cc4npg cc4npg"
    },
    {
      "AuthorID": "faith22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108498/profile",
      "Content": "Oct 13, 2010 04:48AM faith22 wrote: Surgery tomorrow, nervous, but so tired of this waiting I just want to get this behind me already. I just realized how much time has gone by since all this has started, we are talking months. Hopefully by this time tomorrow this part will be over. This forum has been so helpful, I don't know what I would have done without it.",
      "MessageIndex": 55,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758668",
      "Title": "October 2010 Mastectomy cc4npg cc4npg"
    },
    {
      "AuthorID": "faith22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108498/profile",
      "Content": "Oct 9, 2010 01:22AM faith22 wrote:  I am scheduled for BMX with reconstruction 10/13. I was real nervous about injecting the lymph nodes  but the doctor ordered Emla cream, told me to put on about an hour before,that it would help numb area, big relief. Also have issues with nausea and they gave me a prescription for something that you take the night before and lasts 72 hours, told me to tell anesthia and they could put some anti-nausea drugs in when they put me under as well. Those two little things have helped me so much, crazy the things you worry about! We have a breast cancer navigator(she's a nurse) who works with my surgeon and the hospital, whose job it seems, is to reassure and educate breast cancer patients. She was the one who suggested the numbing cream and had MD order it.",
      "MessageIndex": 21,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758668",
      "Title": "October 2010 Mastectomy cc4npg cc4npg"
    },
    {
      "AuthorID": "faith22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108498/profile",
      "Content": "Oct 25, 2010 10:19PM faith22 wrote: I have just seen my surgeon for my first follwup and he had my pathology report. My sentinel nodes were clear...yeah.. but said I had close margins. Could not take any more tissue because close to chest wall. Not going to recomend radiation, just will watch closely. I had reconsruction done at the same time that BMX done. I will see oncologist on Monday and find out what the treatment plan is. What is usual treatment for areas that had close margins. Everything else going ok, some numbness and swelling in one arm, said had difficulty finding sentinel nose in that breast,surgeon hoping it will improve over time. Thanks guys",
      "MessageIndex": 215,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758668",
      "Title": "October 2010 Mastectomy cc4npg cc4npg"
    },
    {
      "AuthorID": "faith22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108498/profile",
      "Content": "faith22 wrote: Have just been diagnosised with ILC, riding a rollercoaster of emotions.The MD then ordered a MRI for both breast to better determine size etc, now find out there is an area of concern in the other breast. Have not even processed the fact that I have cancer and now your telling me there may be more!. Area of concern deep in the breast tissue MD not sure will be able to be seen on ultrasoubd for him to biopsy but they are going to try. If unable to biopsy will just have me do freq MRI to watch area for changes, is this normal. I feel kind of shell shocked right now. Dx 8/26/2010, ILC, 1cm, Stage I, Grade 2, 0/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/757621",
      "Title": "Just diagnosised faith22 faith22"
    }
  ]
}