{
  "AuthorID": "Faith85",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231899/profile",
  "Posts": [
    {
      "AuthorID": "Faith85",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231899/profile",
      "Content": "Jul 21, 2016 11:33AM Faith85 wrote: Another question. Is underarm pain common after an excisional biopsy? I figure the itching and burning around the site are the healing process but not sure about the underarm pain?",
      "MessageIndex": 3,
      "PostDate": "21/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/846169",
      "Title": "Excisional biopsy Faith85 Faith85"
    },
    {
      "AuthorID": "Faith85",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231899/profile",
      "Content": "Faith85 wrote: I had an excisional biopsy on Friday and my follow up is this Friday. My surgeon said that the freeze testing showed some unidentifiable areas. The longer process testing was required. He treated it as cancer during the surgery so it is all out. Can anyone explain to me what would cause the tissue to be unidentifiable or what that means? My doctor did express he was concerned. Of course, I know not to jump to conclusions. Thank you to anyone who may be able to help! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/846169",
      "Title": "Excisional biopsy Faith85 Faith85"
    },
    {
      "AuthorID": "Faith85",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231899/profile",
      "Content": "Jul 20, 2016 07:55PM Faith85 wrote: Okay, thank you! I was extremely worried a couple months ago (before my first biopsy). Since that came back benign (intraductal papilloma), I'm really less anxious. Before this biopsy, my doctor said he was confident that it was nothing invasive but not so confident it wasn't DCIS. The stuff he said after surgery just wasn't as clear to me (maybe because of anesthesia lol) and my hubby and mom seem to have talked to 2 different doctors. Lol",
      "MessageIndex": 2,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/846169",
      "Title": "Excisional biopsy Faith85 Faith85"
    }
  ]
}