{
  "AuthorID": "faith23",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64299/profile",
  "Posts": [
    {
      "AuthorID": "faith23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64299/profile",
      "Content": "faith23 wrote: I am new to this site. I have visited the site numerous times but always failed to join. I guess it has been hard for me to discuss. My mom has breast cancer stage IV with bone mets. She was diagnosed Nov 2004. She went through chemo after her masectomy and seemed to be handling things well. We found out in July that her tumors were showing activity therefore she began chemo again in August. As of 2 weeks ago she was done with her treatments.She has tumors all along her lumbar area and some on the vertebreas as well. There are to many to do radiation. She lives in pain but is a survivor. The cancer has not spread to any major organ.  Her cancer test just went up from a 41 to a 61. I am scared the chemo didn't work and she will have to go back on it. It is so hard to see her go through this. What am I suppose to do? I feel so helpless. I'm so scared of losing my mom. She is all I have. I would appreciate any insite to her condition. You all are remarkable people and deserve much praise for the struggles you endure. Thanks.... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702141",
      "Title": "My mom is Stage IV bone mets faith23 LANEF"
    },
    {
      "AuthorID": "faith23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64299/profile",
      "Content": "Nov 5, 2008 07:46AM faith23 wrote: I want to thank all of you for your replys. It means more than you know to have you to talk to. Its hard talking with close friends about my feelings because they don't understand how it feels. They try as hard as possible and I do appreciate them but its nice being able to share my fears and concerns with ladies going through the same thing as us. Thank you again for the support. Right now you are all I have!",
      "MessageIndex": 6,
      "PostDate": "05/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723873",
      "Title": "Doxil and Avastin??? faith23 faith23"
    },
    {
      "AuthorID": "faith23",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64299/profile",
      "Content": "faith23 wrote: I am looking for some help. I feel like I am at the end of my ropes with things. My mom was diagnosed in 04 with stage IV breast cancer w/bone mets. She has been on and off chemo now for the past two years. Her most recent chemo treatment was Avastin and Xeloda. Her cancer is estrogen friendly and the hormone therapies they tried have failed to stop the cancer from growing. My mom's abdomen area has been swollen for some time. Her new oncologist told her the liver was enlarged and ordered a CT scan. The scan revealed scar tissue and fluid(blood) but no cancer at least thats what we thought. About two weeks ago she complained of severe abdom. pains. She was admitted to the hospital and found out her gall bladder was only working at 7%. She had her gall bladder removed the next day. The surgeon noticed her liver did not look normal so he took a biospy. We found out the cancer had spread to the liver. Her blood work is perfect. The liver enzymes are normal. Her oncologist is in aww about it. He said he does not believe it is throughout the liver but he is ordering an MRI. She just had a pet scan last month and nothing in the liver showed up. It makes no sense to me. She received her first round of her new chemo treatment today. She is taking Doxil and Avastin. Does anyone know anything about the Doxil? The Avastin has not caused many side effects for her so she can handle it pretty good. I am so scared...I don't know how much more my mom can handle. Her poor body is so run down. I really feel she is losing her fight to live. I think if it was not for me and my brother she would let go. I don't know how but I am so strong around her. Its so hard to see her like this. Here I am now crying like a baby typing this email. I am so lost. Am  I being selfish to ask her to keep going? I feel that for my own selfish reasons I make her fight. Its not fair to her to live her life sick and miserable. I feel we are losing this fight with cancer...what do I do?  I know October is breast cancer awarness month and I just participated in the Race for the cure. I hold so much anger inside though....my mom is not a survivor. She is still fighting...its not fair! I guess I have used this forum to let loose of some feelings. I really can't tell her how I feel. I'm so scared. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723873",
      "Title": "Doxil and Avastin??? faith23 faith23"
    }
  ]
}