{
  "AuthorID": "Falconmarks…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213957/profile",
  "Posts": [
    {
      "AuthorID": "Falconmarks…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213957/profile",
      "Content": "Jul 23, 2015 01:13AM Falconmarks wrote: hello Everyone, I had my double Mast May 13, 2015 and have expanders in. I am full up to about 500ccs. I have a lot of pain. I also have chronic pain problems anyway for years, spinal issues, Radiculopathy and CRPS/RSD (Chronic Regional Pain Syndrome/Reflex Sympathetic Dystrophy). My pain management Dr. is trying tohelp me with everything given that he knows my history and he is now helping with managing the pain through the cancer/reconstruction, etc. My question to all of you is, how bad is your pain? I know everyone is different but I was told after a fill you will be \"sore\" for up to 48 hours or so. Then some have said it is extremely painful. Well, I go with the \"extremely painful\" line. Do any of you ever get the pain in your BACK???? After a fill, doesn't matter a little or a lot I feel like I had the muscle pulls, then stretching, which I expect. But then it feels like I got speared through my breast, chest right out through my back! I can hardly life my arm. This time only the right one. Last time it was the left one. I can't sleep, it's so hard to breath deep. My sternum even hurts. I feel like I was beat up and almost stabbed to death by four or five men! I know I am exaggerating but that is how bad it gets. It takes about a week to calm down! Luckily I am filled to where I want but they have to do 2 more fills for the dr to have his extra room for the surgery??? Whatever. Just two more and I'm done. Then I am going to take a break for a while before I get the implant surgery. I REALLY need a break from the hospital and doctors!!! Thanks for listening to my rant! Any responses about your experiences, especially back pain would be appreciated. Teri",
      "MessageIndex": 1304,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Falconmarks…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213957/profile",
      "Content": "Jul 24, 2015 05:50PM Falconmarks wrote: thanks Minustwo. Sorry I'm in the wrong room. I thought it was any kind of chronic pain. Thanks for the referral to the other room. Have a good day and be healthy as possible everyone!",
      "MessageIndex": 1306,
      "PostDate": "24/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    }
  ]
}