{
  "AuthorID": "fallprinces…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266211/profile",
  "Posts": [
    {
      "AuthorID": "fallprinces…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266211/profile",
      "Content": "Jan 6, 2018 09:47PM fallprincess wrote: Hi. I was having hip pain this summer, and my oncologist ordered a bone scan in late Sept. The hip was clear, but \"something\" lit up in the skull bones behind my sinuses, deep inside my head. A CT scan confirmed that there was an area of concern, so I was sent to an ENT doctor to see about the possibility of a biopsy. He said, in effect, no way, literally the most inaccessible part of the body. So my oncologist waited three months and did another CT scan in late Dec. Area of concern was still there, but showed no growth at all. My oncologist says he doesn't know if it is cancer or not. He says it looks like cancer, but it is not acting like cancer. The plan is another three month wait and another CT scan in April. I am grateful \"it\" is not growing, but the waiting is hard, and I feel that this pattern might go on indefinitely. Is it typical for it to take a long time to get a stage IV diagnosis (not that I want one), or is my case just odd?",
      "MessageIndex": 4377,
      "PostDate": "06/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "fallprinces…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/266211/profile",
      "Content": "Jan 7, 2018 02:09PM fallprincess wrote: Thank you so much, Deanna. I so appreciate your perspective! I am being treated locally, but there is a major cancer center nearby.",
      "MessageIndex": 4379,
      "PostDate": "07/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}