{
  "AuthorID": "farmdau56",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208409/profile",
  "Posts": [
    {
      "AuthorID": "farmdau56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208409/profile",
      "Content": "Dec 3, 2014 06:35AM farmdau56 wrote: Hi--How are you doing Mrs. D.? I, too, work with children and plan to keep working during chemo (I start on 12/10). How has it gone for you? I think being around the kids will keep my mind off of the chemo/cancer but, on the other hand, how to avoid all those germs?? Best to you--",
      "MessageIndex": 570,
      "PostDate": "03/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "farmdau56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208409/profile",
      "Content": "Feb 19, 2015 05:49AM farmdau56 wrote: Hi all--I had my last infusion a week ago. It was definitely the roughest in terms of feeling bad, but I'm so glad it was the last one! Even so, I am feeling VERY tired and anxious. Just sick of the SEs, being bald, having no appetite, etc. I try not to complain to anyone much (except my husband, who is very patient) but I know all of you can relate. Will start radiation in early April--my rad. onc. told me I could put it off a bit longer than a month in order to go away during my spring break. Who else out there will be starting radiation soon? Onc. told me to start taking zinc 3 weeks after last infusion in order to speed up taste bud recovery. But some people have told me zinc is really hard on the stomach. Anybody taking it? congrats to all of you who have had your last treatment and the very best to those of you who are still going. Hang in there!!",
      "MessageIndex": 902,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "farmdau56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208409/profile",
      "Content": "Feb 27, 2015 02:38AM farmdau56 wrote: Hi Seagirl--It is just 2 weeks past my last chemo (TC) and I do have some numbness in my toes. I first noticed it a few days ago. My fingers/nails are really sore, too, despite tea tree oil treatments. Hopefully these SEs will go away soon. Good luck with your 6th treatment--hope it is your last?",
      "MessageIndex": 906,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    }
  ]
}