{
  "AuthorID": "fea",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78314/profile",
  "Posts": [
    {
      "AuthorID": "fea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78314/profile",
      "Content": "Jan 26, 2009 01:35PM fea wrote: Francine,  I said some prayers for you. I hope everything went well. Will be waiting to hear from you.",
      "MessageIndex": 14,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727434",
      "Title": "Post Mastectomy problem- Dying skin crusader1 NotVeryBrave"
    },
    {
      "AuthorID": "fea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78314/profile",
      "Content": "Jan 24, 2009 10:42AM fea wrote:",
      "MessageIndex": 5,
      "PostDate": "24/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727434",
      "Title": "Post Mastectomy problem- Dying skin crusader1 NotVeryBrave"
    },
    {
      "AuthorID": "fea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78314/profile",
      "Content": "Jan 24, 2009 07:02PM fea wrote: My PS wanted me to wet it in the shower, but no ointment. I think that ointment would make it softer, too. Unfortunately, I used ointment the whole time and this still happened. I will try a little neosporin on a gauze after my shower! My problem may have been not getting it wet at all, either. I have not had a debridement-Is this when they cut the dead skin off? My skin is black looking only on part of the incision site-about 1in. in lenght and very small in width (not sure exactly but much smaller than 1/2 inch). My PS is hoping that it looks better on Thursday. It doesn't seem to look any different to me. It does get soft after a long shower, but then hardens back up!!  Is this normal?",
      "MessageIndex": 10,
      "PostDate": "24/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727434",
      "Title": "Post Mastectomy problem- Dying skin crusader1 NotVeryBrave"
    },
    {
      "AuthorID": "fea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78314/profile",
      "Content": "Jan 24, 2009 09:46AM fea wrote: Hi crusader1, I am new to this site. I am in the same boat as you. I had a skin saving masectomy on right and prophylactic on left on 1/6/09 with immediate recon (silicone implant to left and tissue expander to right) and now have some dead skin on both breasts. My PS only removed some stitches and wants to see me next week. I never got them wet, even when she said I could for fear of infection. She said that I needed to get them wet. Does anyone know if there is anything that can be done for dying skin? Is it something that can't helped no matter what? And, is it okay to get the skin so wet that the skin turns moist?  She hasn't told me that I need another surgery, yet. Please keep me posted - I have a feeling that I will be following your footsteps!",
      "MessageIndex": 3,
      "PostDate": "24/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727434",
      "Title": "Post Mastectomy problem- Dying skin crusader1 NotVeryBrave"
    },
    {
      "AuthorID": "fea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78314/profile",
      "Content": "Jan 24, 2009 08:22PM fea wrote: Digger, I also have a hard piece of skin that could be snipped and WILL NOT touch it either! LOL. I figure it will fall off when it's ready! I also started to walk on my treadmill today - hoping it will get the blood flowing and help with my healing. I don't run, just walk at a fast pace. I was so worried about my right side (cancer side) TE getting infected....It turned out that my good side (L) that got the immediate silicone implant looks worse. The right side actually looks ok.....My \"foob\" is definetely smaller than the original, but I know once it fluffs out and this blackened skin is gone, it will look good. Right now its perfect all around except the bottom which is squared off due to the stitches.",
      "MessageIndex": 12,
      "PostDate": "24/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727434",
      "Title": "Post Mastectomy problem- Dying skin crusader1 NotVeryBrave"
    }
  ]
}