{
  "AuthorID": "fenella",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
  "Posts": [
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 10, 2013 11:05AM fenella wrote: That's brilliant news. So pleased for you. 9 months of this type of anxiety sounds like hell. I'm sorry that you didn't get to enjoy your pregnancy as much as you deserved to but now it's time to celebrate being a happy and healthy mummy. It's so encouraging to hear benign stories for all us that are waiting.",
      "MessageIndex": 6,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798660",
      "Title": "B9 results!!!! scar3d2death GramM"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 28, 2013 03:15AM fenella wrote: Hi Linaep Just reading this post as I did a search on string bean lumps lol. Just wondered if you had got any further. How long is your lump. I only found this latest one yesterday but it feels like a hard string been about 4 cms long. even when i turn on my side it stays in place.",
      "MessageIndex": 2,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798292",
      "Title": "palpable lump and now tender axillary lymph nodes baml fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 10, 2013 01:05PM fenella wrote: 2 transducers. Is that the screens they use? If so that will be what they are doing.i had  a second ultrasound last week as they were trying to locate the cyst. She was comparing it to the original view and explained this to me.",
      "MessageIndex": 4,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/518307",
      "Title": "breast ultrasound lindalane JaLoLa"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 21, 2013 05:03PM fenella wrote: Hi ladies hope you don't mind my wading in but found this thread really useful. I had a cyst that refilled with blood. It was sent to cytology and came back cancer free but with abnormal cells (apparently they are chunkier than normal) so she wanted a biopsy. I have many cysts within my breast and can no longer feel the problem one....2 ultrasonds later and they cannot find the area to do a biopsy. So the ultrasound lady said she thinks i'm normal. Not sure I'm comfortable with just leaving..the consultant had thought another mamaogram might be useful (i'm 36) but the radiologist didnt' think it was necessary.  I'm not comfortable just living with abnormal cells that may be something more just because they can't find the area. I'm considering going back to my GP and asking if it is worth me paying for an MRI.  Interesting that some of you ladies have had the MRI before the biopsy maybe this is a route i should push for.",
      "MessageIndex": 14,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800132",
      "Title": "Excisional biopsy. SueInMN fresitabr787"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Mar 1, 2013 06:07AM fenella wrote: Hi Wintersocks. Thanks for your response Who would i ask for my pathology report? Should my GP have a copy? I'm seeing my GP on Tuesday hoping to have a good chat about my concerns, mention the MRI and of course the new lump, which feels totally different to any others. Like a little rod, long and thin.",
      "MessageIndex": 13,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801097",
      "Title": "End of my tether don't know which way to turn fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 27, 2013 03:37AM fenella wrote: Aww Julienne thank you so much. I'm in the UK too and it's nice to know others are in the same boat.  I have to be fair to the consultant and radiologist they have taken me seriously and been great...they just haven't escalated it when they haven't found a conclusive answer. If i go private to any of the really local private hospitals it is the same breast consultant who is actually very good indeed to be fair...she sent me for another u/s after a 6 week wait and see and said it might be worth doing another mamo ....the radiologist decided that cos it was only 11 months since my last mammo to not bother...I've been reasonably calm till now...when they were checking checking and double checking but since being sent away saying we're not sure but we think your ok i've started to panic again...i'm checking my boobs morning and night....there is an area in the same area as teh problem cyst but maybe slightly deeper...and then this long lump that feels like a stringy ligament...All they can see are simply cysts on the ultrasound which has been done my 2 radiologists now. arrrgh. I've had a friend btw who was told Fatty Lump honestly god knows. In a way i'd just like them to find the area so a biopsy can be done. I've now made another appointment with my GP to talk through my concerns with her...she's very good. I just feel bad if i go back to the breast clinic just 2 weeks after the last time..for possibly the same reason and yet another new lump. It's madness. Let me know how you get on with everything. What happened with the FNA was it solid or fluid?",
      "MessageIndex": 3,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801097",
      "Title": "End of my tether don't know which way to turn fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 28, 2013 11:24PM fenella wrote: Hi Beesie, no I don't have the actually pathology report. Here in the UK you don't get to see anything just what you are told unfortunately.",
      "MessageIndex": 11,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801097",
      "Title": "End of my tether don't know which way to turn fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Mar 2, 2013 11:14PM fenella wrote: Hi Alice. Thanks for your reply. Yes it's been a one stop breast clinic that I've been going to and I have to say it's been excellent and so quick etc. Hopefully when I see my GP on Tuesday she will send me back there for my new lump but it's getting crazy now I'm back and forth constantly with new lumps.  ",
      "MessageIndex": 16,
      "PostDate": "02/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801097",
      "Title": "End of my tether don't know which way to turn fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "fenella wrote: Feel like screaming...i've been struggling with fibrocystic breasts for a year now....no pain just lots of cysts....one turned out to be filled with blood when aspirated....then they found abnormal cells....but then couldn't find the area to biopsy because of all the cysts. so i was discharged and told to come back if i feel any change.  Birads 3....i'm terrified i know the risk is v.low but they still cannot be sure i do not have cancer.  I had a mammo 1 year ago...and about 5 ultrasounds in teh last year. I still feel an area where the problem cyst was but not sure it's the same one...and now I have found another weird lump that feels very different to all my \"cysts\" it's long and stringy like a vein or thin ligament it runs from the side of my areaola right across the breast (centre to about 9 o clock) now i dont' know if i go back to the breast clinic....see my gp for another referral to the breast clinic or book a private MRI as that is the only test i haven't had and haven't been sent for. Starting to feel like they will not take me seriously with all these lumps and bumps but i dont' want to leave it as the one i don't get checked will teh be the bad one...it's only a week since my last ultrasound and was told i look normal. Sorry for the rant but it's all really starting to get to me now.  I don't know what is what. Thanks for any advice. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801097",
      "Title": "End of my tether don't know which way to turn fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 8, 2013 07:59AM fenella wrote: Hi there. I'm 36 too. Try not to panic you've done the right thing by scheduling the appointment. I know it's really scary and for some reason we just think the complete worst. Age is on your side and most lumps are benign. Try not to google too much it will send you crazy and the information isn't always relevent....one study i read was on women back in the 70's so totally out of date. Let us know how you get on, stay calm there are many benign things it could turn out to be. fingers crossed for you :)",
      "MessageIndex": 1,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798551",
      "Title": "Breast lump for 3-4 mos, now hard pea-size bump on left clavicle baml connie432"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 11, 2013 07:06AM fenella wrote: Hey there. Try to stay calm it's unbelievably unlikely you have anything to worry about here. Normally I wouldn't recommend googling but I think the stats on breast cancer for your age might calm you down...hey i'm 36 and only 1500 women a year in the UK are diagnosed each year between the ages of 35-39. So you can image how slim the odds are for young women like you.  I'm also a mum and I know if you were my daughter I would probably feel more hurt that you didn't come to me than i would feel anxious because of the lump. Please do tell your mum to take you to see your doctor, you might have an infected spot or something, there are probably hundreds of benign causes for your lump. Ok don't google i've just done that, between 2008 and 2010 in the UK there were no women diagnosed with cancer between the ages of 15 and 19. I know your in the states but even so you get the picture.  Take care.",
      "MessageIndex": 5,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798677",
      "Title": "Scared out of my mind! soccerchick1997 fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "fenella wrote: Hi really look for some advice here as Google doesn't seem to have much on this issue plus I know the dangers of Dr Google all too well. I had what was though to be a \"simple cyst\" aspirated in november it was a thick yellow fluid but they had no concern, the dr must have pricked me to as fresh blood dripped from my breast. This lump didn't disappear when i returned it was starting to shrink but was filled with blood but it was sent for a report. The report came back as negative for cancerous cells but not totally normal. I asked what wasn't normal she said it was a little \"Chunky\" for what they expect with a simple cyst. She wanted a biopsy but they can't find the cyst now.  I wondered why \"chunky\" was a concern? Thanks I'm pretty nervous about waiting for 6 weeks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798411",
      "Title": "\"chunky fluid\" breast cyst. Any ideas? fenella Moderators"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "fenella wrote: I'm being watched by my specialist regarding a cyst that looked normal on ultrasound but was found to be bloody. Cytology was negative for cancerous cells but not entirely normal either. Specialist desribed it as \"chunkier than they would expect for a cyst\" she wanted a biopsy but as it had been drained weeks before I could no longer feel it and I had many other cysts so they didn't know where to do the biopsy or if it was still there. Was told to come back in 6 weeks but sooner if the cyst refilled.  Obviously I keep checking ( a lot) I can feel a firm area but not convinced that is new, i have lots of dense tissue it seems deeper than the worrisome cyst, basically I'm no longer sure what is normal for me and what is not. Do I wait for my 6 week appointment or call her saying I can't be sure it's the same thing (could be other cysts that they said i had that were deeper or the dense tissue) but there is a firmish area? What would you do? When I find my many lumps they are always so clearly new. argh the anxiety of waiting. Thanks :) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798500",
      "Title": "What should I do? fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 5, 2013 04:55AM fenella wrote: I understand your worry I had a cyst that was aspirated that seemed simple but turned out it was thick bloody fluid, cytology was negative but they wanted a biopsy. I have many cysts and the problem one can no longer be felt due to aspiration so ultrasound hasn't been very helpful for a biopsy. I have to wait 6 weeks to see the breast specialist again but I'm hoping they will do an mri or something as I'm not happy with leaving it, if they have concerns, I want answers. Good luck. Let us know what happens. :)",
      "MessageIndex": 5,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798392",
      "Title": "Lump felt , but not visible on mammogram or ultrasound jabnee Maddog23"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 3, 2013 02:23AM fenella wrote: Fingers crossed for you. You always think the worst but cysts are incredibly common...i have tons but by googling i decided i didn't have a cyst....(i did)...lesson learned. currently on a 6 week wait on a strange cyst looks normal but the fluid isn't quite normal on aspiration they can't biopsy cos they aren't sure which one if any it was and as i can't feel it either now it could be gone...waiting is a nightmare :(",
      "MessageIndex": 3,
      "PostDate": "03/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798308",
      "Title": "Finally Had my Breast Exam! t8ermomma EmD"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 28, 2013 03:20AM fenella wrote: Hi Ariom thanks for your response. All i had was fine needle aspiration no biopsy as yet.  Could that be enough to cause it do you think? worried sick about this one because even when i turn on my side it doesn't move and stays in place. In fact that is the best way to feel it. It seems to run almost from areola to under the arm can't quite feel the end. It's very hard like a ridge, cord or vein.",
      "MessageIndex": 2,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801156",
      "Title": "Long Thin Lump Almost Like A Thick Vein fenella Moderators"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 28, 2013 03:55AM fenella wrote: Thank you Ariom. :)",
      "MessageIndex": 4,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801156",
      "Title": "Long Thin Lump Almost Like A Thick Vein fenella Moderators"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "fenella wrote: I've discovered yet another lump. This one if very different to all my cysts and thick tissue. It starts on the outside of the areola and goes out towards the outside of the breast. Feeling it standing up it feels like a hard rod, if i lay down on my side so all the tissue goes away from the lump it remains in place and feels like a long hard vein. It's across the same area where the worrisome cyst was. Has anyone else had any experience of a lump like this? or any ideas what it could be? Back off to see the GP on Tuesday who will hopefully refer me back to the breast clinic. Starting to feel like a regular there. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801156",
      "Title": "Long Thin Lump Almost Like A Thick Vein fenella Moderators"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 9, 2013 08:26AM fenella wrote: Thank you so much Beesie, i'm feeling much brighter today, unfortunately my boobs are so lumpy i'm not always sure what i can and can't feel. I'm meant to be looking out for the cyst refilling as after aspiration it did look like it disappeared so they couldn't biopsy it. There are many other cysts in that same breast so every lump i feel i panic about, though for the 3 cysts i've seen the bc about they have all felt very clear, so i'm sure if it refills i'll feel it. Trouble is I start worrying about all the other lumps I feel and I panic that I'm showing them the wrong one and should really be showing them another one....argh fibrocystic breasts they are such a pain, though I shouldn't complain I'd take them any day over the awful alternative.",
      "MessageIndex": 4,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798553",
      "Title": "Can Cancer Cause Cysts fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 9, 2013 08:51AM fenella wrote: Yes the cysts that I have felt have been aspirated by ultrasound. They have all looked to be simple on ultrasound too. I have other large cysts that are deeper and cannot be felt as well as some small ones that have just been left.  The second cyst that was aspirated produced thick yellow fluid and i think she caught me somewhere as it made me bleed out where the needle went in.  That night it didn't feel like the lump had totally gone and over a few days got larger again, when i went to have that checked again they said simple cyst and asked if i wanted it aspirated they did so and this time they removed a small amount of thickish old blood which was sent for testing, though was though it could have been caused by the previous aspiration. The results from the tests came back with no cancerous cells but nor did it look totally normal. Apparently it was more chunky than they would expect from a simple cyst. I don't know what they mean by chunky, possibly the thickness of the fluid i presume and I'm not sure why chunky fluid is a concern. Good to know about so many women who also had cysts, especially complex ones that were benign.",
      "MessageIndex": 6,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798553",
      "Title": "Can Cancer Cause Cysts fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 9, 2013 09:18AM fenella wrote: Oh that is intersting I'll google that. I know they are meant to disappear at menopause but that could be another 20 years away.",
      "MessageIndex": 8,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798553",
      "Title": "Can Cancer Cause Cysts fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "fenella wrote: Hi I have a cyst that was drained and was found to be bloody, cytology negative but surgeon says it didn't look totally normal either as it was a little chunkier than they would expect. I have many cysts. I know it is rare for cancer to be found in a cyst, (the cyst looked simple on ultrasound) so I wondered if cancer can cause normal cysts to develop?  Tried to google but couldn't find anything to this effect. They just talk about intracystic cancer.  On a nervous 6 weeks wait now to see the consultant again, as they couldn't find the area to biopsy on ultrasound as it had been aspirated.  So many thoughts running through my head. Thanks ladies :) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798553",
      "Title": "Can Cancer Cause Cysts fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 9, 2013 01:13AM fenella wrote: I've just had an ultrasound, actually about 4 ultrasounds in the last 8 months for various cysts. They see the cysts, they look simple, i'm given the choice regarding aspiration. They suspect the bloody one was caused by a previous aspiration that did make me bleed. I go back in 5 weeks now unless it refills. I guess what i'm worried about is that it isn't the cyst that is the problem but an underlying cause?",
      "MessageIndex": 2,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798553",
      "Title": "Can Cancer Cause Cysts fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "fenella wrote: Hi all thought I would start this thread as I've been on and off these boards for the last year with various lumps and bumps due to fibrocystic breasts. I feel for the last year their has been a constant anxiety in the back of my mind every time i find something new. Looking through many threads I see lots of women with fibrocystic issues and thought this woud be a good place to help and support Women who are living with the fear that fibrocystic breasts causes and to talk about our experiences with our fibrocystic boobs. My history I'm 36 from the UK March 2012 - Simple cyst aspirated seen on Mammo, confirmed by u/s - aspirated. Many other cysts found on u/s too. Nov 2012 - Simple Cyst Aspirated Dec 2012 - Cyst refilled with Blood. Sent for cytology Jan 2013 - No cancer found but abnormal cells discovered biopsy requested. Area to biopsy could not be found due to aspiration and many other cysts. Feb 2013 - Follow up appointment site still cannot be located on ultrasound. Told probably normal lots of simple cysts seen. 26/2/2013 - Long stringy lump found - is there no end to this? I feel my boobs pretty much morning and night and no longer know what i cannot feel...though when something is new i'm pretty good at finding it. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801102",
      "Title": "Fibrocystic Breasts Support Thread fenella springmac"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 28, 2013 02:20AM fenella wrote: Hey ChefHolli That's really interesting...i hadn't given up the caffeine because everything i read said it could help reduce the pain but nothing about the lumps..i don't have any pain really. However after hearing it straight from someone who has tried it and isn't trying to sell something I will give the caffeine and vitamin E a go. Oh but how i love my coffee but if if it helps end this nightmare it'll be worth it. Has anyone else tried this or anything else that has actually made their boobs less lumpy?",
      "MessageIndex": 2,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801102",
      "Title": "Fibrocystic Breasts Support Thread fenella springmac"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 7, 2013 04:57AM fenella wrote: I agree Emd it's worth mentioning everything, but equally we are hyper aware of our breast right now looking for changes and prob noticing stuff that has always been there but we've never worried about it before. I'm obsessive over my nipples at the moment, notice one pokes out slightly longer than the other...i've never even check my nipple lengths before!! I'm trying to keep the inner crazy at bay as much as possible but I know it's hard. :)",
      "MessageIndex": 7,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798426",
      "Title": "Indent or no indent, that is the question. EmD EmD"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 10, 2013 12:52PM fenella wrote: Hey Emd was it today you were back at the Dr's? sorry i'm in the UK so your time difference is probably very different to mine. By the way other than your possible indent your boob sounds a mirror image of mine. Vein across the top lump at 9 o clock....9 is on the outside right?",
      "MessageIndex": 10,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798426",
      "Title": "Indent or no indent, that is the question. EmD EmD"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 10, 2013 02:13PM fenella wrote: Oh the referral will be good make you feel like you are more in control. After my first cyst I popped a bottle of champagne...now hoping i didn't celebrate too soon. my vein sounds a little different it is a straight line horizonal about 1-2cms above the areola it then tilts down the side and stops for a bit where the fibrous full and cysty bits are at 9 o clock then picks back up underneath and goes down the breast, possibly called the milk line i'm not sure. Never noticed this vein till my first cyst, though admittedly i never overly examined my breasts before that other than a wash in the shower, then i googled veins and breast cancer, bad move, though admittedly there wasn't much on it, I mentioned my to the breast dr last time i went and she just said it could be more obvious because of the cysts and that she didn't get very excited about veins. recently on my left breast ive noticed another obvious vein down the areaola which is quite comforting...hopefully. Honestly i over analyse every little thing now, hopefully as time goes on once i have identified every little quirk my breast has I will be well aware of new changes.",
      "MessageIndex": 12,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798426",
      "Title": "Indent or no indent, that is the question. EmD EmD"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 7, 2013 12:12PM fenella wrote: I is so hard to tell, i'm trying to decide if i should phone my surgeon, i'm meant to phone if the cyst refills, I can feel a firm area but think it's always been there, certainly doesn't feel like the cyst has refilled. Now i worry that this firm area is part of the problem but pretty sure its the bit i always feel that they tell me is thickened tissue. So many cysts and dense tissue I can no longer feel what is what.",
      "MessageIndex": 9,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798426",
      "Title": "Indent or no indent, that is the question. EmD EmD"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 11, 2013 01:57PM fenella wrote: Well you are one step closer to finding out what it is. What did she say about the vein?",
      "MessageIndex": 15,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798426",
      "Title": "Indent or no indent, that is the question. EmD EmD"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "fenella wrote: Hi I've had a follow up appointment at the breast clinic, basically i had a bloody cyst aspirated and whislt cancer wasn't found the cells were abnormal. The surgeon wanted a biopsy but they couldn't find the area to do the biopsy as i have many other cysts and it was aspirated. I went for a 6 week check up and they did another ultrasound and once again all they can see is simple cysts and cannot find an area to biopsy. They have now discharged me from teh breast clinic saying they think i'm normal but they can't be 100% sure as they couldn't do the biopsy. Question is do i accept this? I'm having a hard time knowing there is abnormal cells and leaving it there. Would an MRI help? I don't know what my options are. Any advice would be appreciated. Thanks  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800748",
      "Title": "Abnormal Cells - Do I take it further? Really worried fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 20, 2013 10:24AM fenella wrote: Thanks Beesie No i don't all i know is the cells were more chunky than they would expect. Apparenty she said i was rated at C3 a simple cyst is C2 and Cancer is C6. She said usually abnormal cells turn out to be ok but obviously sometimes they are not. The cyst had refilled on ultrasound it looked simple and they only aspirated it the second time because I asked them to. When it was found to be bloody they sent it to cytology.  I really don't know what to do...though I'm really worried that I have these cells and they simply just don't know if there is a problem or not. Would an MRI show anything that couldn't be seen on ultrasound? Any other advice?",
      "MessageIndex": 2,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800748",
      "Title": "Abnormal Cells - Do I take it further? Really worried fenella fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 13, 2013 06:28AM fenella wrote: Hey Was just checking in to see how you got on with your US. I haven't been around for a while...been trying to keep myself busy during the 6 week wait. Well i'm glad they found nothing but equally it doesn't give you answers does it. My surgeon has always said to before mammo's and u/s that if they find nothing she wants to see me again. It's so hard isn't it because you just want to know it's normal. My 6 weeks appointment is next tuesday. the cyst doesn't seem to have refilled so not sure what the next stage will be as she wanted a biopsy if it could be found ...i wanted a biopsy too for total piece of mind. if i can't feel it and ultrasound can't be sure which one it is if any...i'm not sure where that will leave me :( Good luck let us know how you get on with the Dr.",
      "MessageIndex": 14,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799958",
      "Title": "Had my ultrasound today... EmD ChefHolli"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 14, 2013 08:02PM fenella wrote: Oh god that sounds awful. fibrocystic boobs are a pain but i'll take that diagnosis over the alternative. Hopefully they find a way to ease your pain.",
      "MessageIndex": 8,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800361",
      "Title": "surgeon consult today Ilovemyboobs fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 14, 2013 04:24AM fenella wrote: Hi. I totally understand why you would want another opinion. I have fibrocystic breasts i'm 36..ultrasound shows lots of cysts and i have thickened tissue. I've been told that fibrocystic breasts sort themselves out after menopause. I would def get a second opinion for peace of mind. Even though i'm 36 and have all these lumps and bumps i worry so totally understand where you are coming from.",
      "MessageIndex": 1,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800453",
      "Title": "Fibrocystic changes post-menopause or time for second opinion? Kristee fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 12, 2013 06:44PM fenella wrote: Well from what i can work out about my breast surgeon is she specialises in all things breast. This includes reconstruction surgery but all breast cancer treatment....so basically it seems she is a boob dr.",
      "MessageIndex": 9,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798738",
      "Title": "Super silly question mrsmanhattan fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 14, 2013 01:39AM fenella wrote: Hey there. I too have fibrocystic breasts. Lots of dense tissue and many cysts on ultrsound. Started earlier this year. i don't get any pain though. I'm 36. If you don't mind my asking what symptoms do you have? Think i'm going to be heading back and forth to the breast clinic for a long time.",
      "MessageIndex": 6,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800361",
      "Title": "surgeon consult today Ilovemyboobs fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Feb 15, 2013 10:31AM fenella wrote: Hey no i haven't really had any great advice on how will i know if something is wrong but they the people that did my ultrasound were great they said I would probably have a quite a few visits with fibrocystic breasts and as soon as i feel something new to go back and get it checked.  I think the best advice is to check regularly really get to know your breasts and then you'll know if there is something new...which could still be due to fibrocystic changes but to get it double checked. I really regret not checking my boobs before i found the first cyst so i would know what they originally felt like.",
      "MessageIndex": 6,
      "PostDate": "15/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800453",
      "Title": "Fibrocystic changes post-menopause or time for second opinion? Kristee fenella"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 8, 2013 07:15AM fenella wrote: oh bless you. It's so annoying how you think of these things after the appointment. I'm on a 6 week wait at the moment for a suspicous cyst i asked why it wasn't totally normal after the cytology test she said because it was a little chunkier than they would expect from a simple cyst. I thought of all these extra questions as soon as i got home duh. Going to get a pen and paper and write my questions down for the 6 week appointment.  ",
      "MessageIndex": 6,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798543",
      "Title": "Will I regret 'waiting and seeing'? hbranden9 hbranden9"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Mar 5, 2013 06:31AM fenella wrote: What a great idea for a thread. I've been off and on these boards for the last year. I have had a few cysts. The first one after reading on google what cysts felt like i was convinced mine wasn't a cyst. The lump i guess was reasonably round in shape (small marble) felt smooth though i couldn't work out a size as i wasn't sure where the borders were. It wasn't soft like i had read, it felt hard to me.",
      "MessageIndex": 1,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801388",
      "Title": "Benign results sign out thread. :) :) :) little_me PurpleCat"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 11, 2013 05:57AM fenella wrote: Hey there. I can't offer you much advice regarding microcalcifications as my lumps are cyst based. However I can totally relate to your fear and anxiety. I'm 36 and have 2 sons 9 and 6. When I found my first lump I was in bits, it was the darkest place i'd ever been, I didn't tell my sons what was happening and it was really hard to hold it together around them, it turned out to be a benign cyst. Since then I've had another simple cyst and a suspicious one (bloody aspirate) thye want to do a biopsy but as they aspirated it, it seems to have disappeared which is good but I have many other cysts so they can't be sure if it is one of those. If i feel I have to make another appointment, failing that I have to go back in 6 weeks. I'm pretty much in a constant state of anxiety but I was determined this time not to go back to the dark place of before. The only way i have managed to do that is not to allow myself to think to far down the line, if you feel your mind wondering try to think of something else. I know you won't forget about it entirely, it's constantly in my mind but the awful darkest thoughts I try to keep under control.   Good luck with your biopsy and let us know how things turn out.",
      "MessageIndex": 2,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798693",
      "Title": "asking for help again hoping42 hoping42"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 7, 2013 12:09PM fenella wrote: From what I can work out it is fat that is seen between the glandular tissue and the back of the image, it can cause imaging issues for the posterior image i believe. Just what I picked up from google but I believe the retroglandular fat isn't a concern and is quite normal i think it's just something that is there. Maybe someone else can shed some light on it.  Fingers crossed for you :)",
      "MessageIndex": 1,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798510",
      "Title": "Having Biospy done today nanna5 Klm0221"
    },
    {
      "AuthorID": "fenella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164186/profile",
      "Content": "Jan 7, 2013 12:28PM fenella wrote: Yeah Googling isn't good and you'll just get conflicting information and you'll be convinced that it's the worst case scenario. I've been there! Fingers crossed for a benign outcome for you let us know the outcome.",
      "MessageIndex": 3,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798510",
      "Title": "Having Biospy done today nanna5 Klm0221"
    }
  ]
}