{
  "AuthorID": "ferretmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
  "Posts": [
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "ferretmom wrote: I am having infusions every 3 weeks. Using my left *good* arm, lumpectomy, SN excision, radiation 2007. Right side recent mastectomy, SN, no rads. Before surgery the anesthesiologist made 3 attempts to get a IV going, 2 infiltrated. Last week the oncology nurses made 4 attempts to get a IV going. 3 infiltrated. 4th time they wrapped my arm in warm blanket with a hot pack. Finally got a good vein. Now this arm aches and feels heavy, no swelling, no redness. I go for another infusion on the 23rd. What if anything can I do to prevent these infiltrations. I was advised to drink more water, that I'm doing. These are not inexperienced nurses, I just have cranky veins. Any words of wisdom from this forum's members? Dx 1/2010, ILC, 1cm, Stage IIA, Grade 3, 2/2 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/753801",
      "Title": "IV infiltration ? ferretmom ferretmom"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Jun 8, 2010 10:47AM ferretmom wrote: Thank you ladies LindaLou, I am indeed concerned about lymphedema. 7 months after lumpectomy/radiation in 2007 I developed cellulites in that breast. Some swelling along the back and rib area. It resolved on it's own when the infection cleared. I have a appointment with the oncologist and my breast surgeon before my next infusion date. My BS is the one most concerned with the possible lymphedema and told me she would send me to a therapist without hesitation. Perhaps that time has arrived. She did tell me we now have a good one in my area. In my onc nurses favor, the ladies found a vein right away. It's just that the darn thing blows about 3 min into the saline drip. Not getting the harsh chemos, just Zometa and Herceptin. No real reason for the cranky veins.",
      "MessageIndex": 3,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/753801",
      "Title": "IV infiltration ? ferretmom ferretmom"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Nov 6, 2007 07:06AM ferretmom wrote: Dear Adam I would certainly want more info on this cream before I would agree to try it. I could not find it on the website.",
      "MessageIndex": 3,
      "PostDate": "06/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/694974",
      "Title": "Radiation Induced-Dermatitis LeeSilsby labhusky"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Oct 6, 2007 06:28AM ferretmom wrote: RAD October, that's funny. Got my *freckles* yesterday, dry run on the machine next Monday, actual tx begins Tuesday. They gave me Aquaphor cream. UGH...... Must find one less gooey and greasy.",
      "MessageIndex": 25,
      "PostDate": "06/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Oct 10, 2007 08:28AM ferretmom wrote: I'm enjoying the sense of humor here. My best friend of many years has not stopped crying since I told her of my BC. She is someone that takes to her bed with a hangnail. Dear friend though, just overly sensitive. I comfort her. Another dear friend sent me the funniest e-mail on what I could use my bras for that I would no longer need. His/hers soap hangers in the shower. Plant hangers in the kitchen window. Wind sock. This friend is strong. She is bipolar, and has been down the road that makes one a strong person far too many times. Keep laughing ladies. Tx #2 today. Also started Arimidex, might as well get this show on the road.",
      "MessageIndex": 63,
      "PostDate": "10/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Oct 16, 2007 07:42AM ferretmom wrote: Penni, a thought for you. Could you go into the treatment room wearing a open front shirt/blouse backwards? You will need to drop it down for treatment, but at least it will give you some feeling of being covered. I am handed a gown to wear backwards from changing room to treatment room, about 15 steps. Just seems to me any facility should offer that, but if not, and you provide your own coverup, what can the do, fire you?",
      "MessageIndex": 94,
      "PostDate": "16/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Oct 19, 2007 07:18AM ferretmom wrote: Morning GlowingGirls. Radiation Dermatitis. On my boob, back and abdomen. Dr said switch to Cortaid cream. Hopefully my body will just adjust to this. There is a nasty cold/flu type bug going around here, seems like everywher I went yesterday folks were sneezing and hacking. Hope all of you enjoy the weekend. Our weather is not going to be the best, but I hope to get some outside cleaning done. Both the front and back decks are full of dirt/leaves after last weeks wind. Won't even mention the windows :-((",
      "MessageIndex": 115,
      "PostDate": "19/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Dec 7, 2007 10:02AM ferretmom wrote: Hi Joanne How long have you had your ferret? I've had them since 1990, and now volunteer for rescue and education for these misunderstood, wonderful little animals. I just wish they wern't so medicaly needy, my vet bills are as bad as my own. I currently have 7, and two fosters going to a forever home tomorrow.",
      "MessageIndex": 316,
      "PostDate": "07/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Dec 9, 2007 08:01AM ferretmom wrote: I will get the BRCA test next week. My mother died from cancer at age 58. We do not know if it was BC as by the time she was diagnosed it was in her liver and she died in less than a month. My onc suggested testing even though he feels my risk is low.",
      "MessageIndex": 322,
      "PostDate": "09/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Oct 29, 2007 06:07AM ferretmom wrote: Good Morning Ladies I'm ready for another glow week. My skin feels like it is covered in sand. Tiny dried blisters. Not terrably itchy, unless I use the Aquafor. That softens my skin, but makes the itchiness worse. Brenda, I'm with you, it holds in the heat. I think it also keeps air from the skin, maybe not such a good thing. Spent several days feeling dizzy. Not sure why, doubt it is a side effect of rads. Felt OK otherwise, just discomboobalated..... See the rad onc on Tues. Will mention it, but I doubt she will say it's somehow connected. Have a great Rad October week everyone, we are getting closer to the end...",
      "MessageIndex": 157,
      "PostDate": "29/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Nov 2, 2007 06:11AM - edited Nov 2, 2007 06:24AM by ferretmom Helen, thanks for the report on boosts. I will have mine towards the end of this month. I still have quite a hematoma in that area, I hope it is gone by then. I have a visual of it exploding. LOL  Anyone know much about basal cell skin cancer? I had 4 removed last year, and now I have two new ones. Strange thing is, all have been on the left side of my body, as was the BC. I think basal cell does not metastasize, but I find it interesting that everything is on my left. hmmmm",
      "MessageIndex": 196,
      "PostDate": "02/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Nov 2, 2007 06:23AM - edited Nov 2, 2007 06:26AM by ferretmom Drat, since I asked for ideas I should give the correct info, no? Skin lesions not mast cell, they are basal cell. Will try to figure out how to edit my post. Edited OK, now how to remove this one? sigh",
      "MessageIndex": 197,
      "PostDate": "02/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Oct 7, 2007 08:52AM ferretmom wrote: Hi Layne The Udder cream is nice, I use it on my hands. I'm sorry to hear of your kitty. We lost our Moosie last year, same thing. I asked the rad tech for LadyBug tats, he said *sure thing, I've been practicing those*. So far everyone I've seen has been pleasent and very helpful in explaining the process as I go. Best to all our Rad October boobs.",
      "MessageIndex": 30,
      "PostDate": "07/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Oct 23, 2007 05:52AM ferretmom wrote: Good Morning everyone. Yes, the Cortaid cream helped a lot. I do not seem to be reacting much now. Not so many new blisters. Very tender nipple, a shooting pain here and there, but certainly not anything to complain about. 10 down, 26 to go. Is anyone able to watch the monitor during rads and exrays? I asked if I could turn my head to watch, but it is just enough change in positioning that it throws off the alignment. Disapointed, wish I had known to ask before the mapping session, maybe that could have been done so I could see the monitor.",
      "MessageIndex": 130,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Nov 27, 2007 09:33AM ferretmom wrote: Hi everyone. Nope, no tx yesterday either. Still have the 8 boosts left. The Silvadine is helping, but for every healing spot, a new area opens. I have some grey ucky looking skin on my rib under the boob that dr isn't too happy with. I think it's better today, so hopfully we can get the show on the road again. I have very odd skin to begin with, prone to breakouts. Then there are the years of high desert sun damage, although the boob wasn't a direct hit so to speak. Layne, I did not tell a certain family member either.",
      "MessageIndex": 288,
      "PostDate": "27/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Dec 7, 2007 07:44AM ferretmom wrote: Good morning all. Recieved last boost on Tuesday. My rads team gave me a *Terrific Patient* card, and a Purple Heart Award. Too funny, and very sweet.  That same afternoon I got a call from the Humane Society to do a animal rescue pickup. My love, my life. What a terrific way to end treatment days. Then yesterday I get a call from a Agricultural station in CA, A consficated ferret (iligal in CA) needed to be picked up. So off I went in the seasons first snow storm. Made it back in 4X. This morning we have about 4 inches of snow on the ground here. If rated on a scale of 1-10 of concern for re-occurrence, hmmmm... 0 I just feel the slice, dice and light saute' took care of the problem for me. Now it's back to my life, so long cancer.",
      "MessageIndex": 314,
      "PostDate": "07/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Nov 17, 2007 09:00AM ferretmom wrote: The time has gone by quickly hasn't it? I have two more regular tx then 8 boosts. Looks like Joanne and I are headed for the finish line. Will have 4 day break over the holiday, my skin can sure use it. I adore my team, and plan to bake my often requested Bundt cake and have it delivered with thank you flowers and balloons. Have appt with the oncologist for tumor marker tests in December. I plan to discuss with him *again* the pros/cons of Arimidix for my particular case. Have a good weekend all, I'm re-arranging my sewing/quilt room. Have not done any quilting for almost 2 months, and I'm having withdrawals.",
      "MessageIndex": 260,
      "PostDate": "17/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Nov 26, 2007 07:59AM ferretmom wrote: Glad to hear everyone is doing well. I had a little setback. Last Tuesday the rad tech started to set me up for the tx. Looked at my skin peeling and called the rad onc to take a peek. She stopped all treatment till today. I knew my breast was really sore and beginning to peel, but the area under my boob was really breaking down. So, hopefully we can begin again today, but I'm not sure as my skin doesn't look much better and I have shooting pains from inside. Told my excellent hubby it feels like it will pop if poked. ouch I only have one more reg tx, and 8 boosts to go. Wish me luck friends, my boob will appreciate it.",
      "MessageIndex": 281,
      "PostDate": "26/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Oct 9, 2007 06:40AM ferretmom wrote: Will have the first zap today, then 33 more. I need to ask about Thanksgiving and the Friday after as I just *might* want to do something besides zapping the boob. Brenda. I hope you do not get too sore since you reacted on first treatment. How do you feel today? I too was told I would probably not notice anything till the end of the second week. Interesting that we are all so different, eh? We have just one kitty now, but have lots of other critters. I volunteer with animal rescue groups, a huge love in my life.",
      "MessageIndex": 46,
      "PostDate": "09/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Oct 16, 2007 07:21AM ferretmom wrote: Morning ladies.... Yesterday the rad machine was down for repair, so now I'm a day behind. I also have a rash/blisters. Not supposed to happen after just 4 tx, so I'm wondering if it is a reaction to the Arimidex? See the dr today, so hopefully she will know. All I know is I itch. Been very careful not to use anything but mild soap, and no scrubbing the area. Better today, so maybe a day off was a good thing, although I was bummed when they called to cancel. Funny how you work to plan your day around the appt time, then feel disappointed when we don't have to be there. Also, adds another day to treatment schedule. Cheese with my whine please",
      "MessageIndex": 90,
      "PostDate": "16/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Sep 16, 2010 10:08AM ferretmom wrote: Ladies, I know some chemo drugs and radiation can make a difference in how well we heal, etc.  The strange thing is I did not have rads on this side and the only *chemo* I am getting is 16 treatments of Herceptin and Zometa 2X a year. This should not delay the healing process.  My ONC is now looking into the possibility that Herceptin by itself might cause these problems.",
      "MessageIndex": 4,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758099",
      "Title": "Seroma may need TE removed - worried Carole66 Carole66"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Mar 26, 2010 10:35AM ferretmom wrote: I am throwing a *Bye-Bye Boobie* party. Inviting family and close friends. I'm requesting each guest bring a dish of something I can put in the freezer that I can just thaw and heat when I don't feel up to cooking. I'm also asking each person to bring their best/funniest things to do with a bra that is no longer needed. Ideas like: His and hers soap holders in the shower. Double herb plant hangers in the kitchen window. Stuff it, put it on backwards under a Tshirt and go to the mall. The food will be very informal, finger foods, cheese assortment, wines. Dessert is a cake in the form of a Boob. I have one friend that thinks this is morbid, but she did not turn down the invite. LOL",
      "MessageIndex": 15,
      "PostDate": "26/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/750239",
      "Title": "Family member about to have mastectomy - family gathering before TrueBee ferretmom"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Sep 16, 2010 09:23AM ferretmom wrote: Good morning Carole66 I had a implant put in at the time of my mx on April 14. After several seromas, infection, 2 more surgeries, incision not healing and implant extrusion I had it removed last month. My PS wants to let me heal till the end of Oct then try a expander. Not sure yet if I will. Sometimes our bodies just don't co-operate. Let's hope yours will and you can move forward in the re-construction process with no more problems.",
      "MessageIndex": 1,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/758099",
      "Title": "Seroma may need TE removed - worried Carole66 Carole66"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Jul 19, 2008 07:59AM ferretmom wrote: Hi Sandy I started getting blisters on the 4th day. I had every reaction to the rads the onc said *could happen* and then some. LOL Others in this forum during the same time seemed to all react differently, some had very few problems. Radiation does a number, that's for sure. I'm seven months from rads, and have developed a complication that we are treating now. I liked a gel the rad team gave me, it was soothing, felt cool on my breast, and wasn't sticky like aquphor. Towards the end, you might feel like your nipple is going to explode. Keep in touch with the ladies here, you will get helpful advice for each step along the way. ferretmom",
      "MessageIndex": 3,
      "PostDate": "19/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/709322",
      "Title": "How Early can SE's begin? easyquilts AccidentalTourist"
    },
    {
      "AuthorID": "ferretmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56449/profile",
      "Content": "Apr 1, 2010 09:18AM ferretmom wrote: Finally got my surgery date, April 14th. Looks like I will have great company on that day, and all this month. Meet with the PS for my implant *fitting* today. I hope she still thinks I will have enough skin left to not do the TE and just go for the implant. Best thoughts for all of us April gals.",
      "MessageIndex": 60,
      "PostDate": "01/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    }
  ]
}