{
  "AuthorID": "fgm",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
  "Posts": [
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "Mar 19, 2013 10:05AM fgm wrote: GMA-I haven't posted anything with this thread but I've been reading some of the posts. Regarding your swollen breast, have you tried self massage?  I've gone to a LE specialist who taught me all kinds of exercises and self massages. Also, I wear a lightly tight camisole daily (although I couldn't wear it during my RADS).    This morning I had a swollen, painful breast and before I got out of bed I did some self massage and it really helped.",
      "MessageIndex": 2202,
      "PostDate": "19/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "May 6, 2013 09:44AM fgm wrote: Thanks Purple.  We don't interlock our arms or anything else but just the pushing and pulling of our arms in the water may have done it.  Thanks for your advice.",
      "MessageIndex": 3674,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "May 6, 2013 08:37PM fgm wrote: Binney-Thank you so much for your response.  Those articles were very informative and helpful.  My bathing suits have halter straps so I don't think that's the problem. But, I need to go in the deeper water so I get the benefit of the water pressure. And, I need to go slower. I going to class on Wednesday and I'll talk to my instructor and ask if she'd like a copy of the article. Do you wear your compression sleeve when you walk or go on the treadmill?",
      "MessageIndex": 3676,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "May 15, 2013 04:32PM fgm wrote: Dawn-thank you.  I was kidding when I asked about a body heating pad.  I didn't know they actually existed. I'm going to look into it.  Do you recommend any particular one. Purple- I looked at your GRRR thread and I would call your PCP and make an appt for tomorrow. It could just be an allergic reaction to something but take care of yourself and find out. That's what I would do if it was me or one of my daughters. ",
      "MessageIndex": 3730,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "May 15, 2013 08:31AM fgm wrote: Thanks everyone. Glad you found your shoes, Purple...they really help for traction in the water. I took Tylenol because I'm on generic Fossomax and you aren't supposed to take Advil. Tylenol never did much for me.  Do you think I could find a heating pad for my entire body ?   I'm just getting back to exercise after a year of surgery and treatments. I'm not as young as I use to be and I think it will just take time.  In my mind I'm 25 but not my body...I just want to feel like myself again.  But I am happy to be alive!!!!",
      "MessageIndex": 3725,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "Jul 10, 2012 03:03PM fgm wrote: Hi Everyone, I'm new to this site. I had 27 lymph nodes removed during my lumpectomy on May 7. (all were negative).  I bought a Jobst arm sleeve and glove. I don't have any swelling. Just some tightness in my armpit and a vein that keeps \"popping\" down my arm.  I wore it Sunday for the first time because I was cleaning out a room and closet to get it ready for painting.  I was told to wear it when I do heavy lifting, gardening, etc. It was wonderful.  My armpit pain went away and I was able to raise my arm to an almost presurgery position. My question is, how often do you wear your compression sleeve and glove and when?  Also, how often do you  buy a new one?   Thanks a lot. ",
      "MessageIndex": 1141,
      "PostDate": "10/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "May 5, 2013 08:40PM fgm wrote: Hi Everyone, I haven't been here for awhile but I have a question. I joined a health center this month. On Friday I joined an aerobics swim class. The next day my breast was sore and a little swollen.  Do any of you wear your sleeve in the water?  Thanks for your help.",
      "MessageIndex": 3672,
      "PostDate": "05/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "May 6, 2013 08:44PM fgm wrote: Here's an article I found on water exercising. It repeats many of the ideas in Binney's articles: http://www.lymphnotes.com/article.php/id/24/",
      "MessageIndex": 3677,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "Jun 11, 2013 11:29AM fgm wrote: Thanks Hugs for the info.  I went to a bra fitter who specializes in cancer patients,etc.  She ordered me a Bellisse compression comfort bra in a size 40G. She wants me to wait to pay for it until my lymphedema PT sees how it fits. The blasted thing costs $250. And I should get one to wear and one to wash.  She's not sure how much my insurance company will pay for it.   Purple, sorry you are still suffering with that rash but somehow when you are with your grandchild things don't feel so bad....at least that's how it is for me.",
      "MessageIndex": 3779,
      "PostDate": "11/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "May 14, 2013 04:51PM fgm wrote: So far I've done 3 water exercising classes anywhere from a week apart to 3 days apart.Each are 45 minutes long and in warm water (92 degrees).  I stay in the deep end which was recommended to me at this site.  Each time I'm wiped out and achy in every muscle I own for a day or 2 after the class but while I'm exercising, I'm okay. The treadmill doesn't do this to me. Anyone else have this experience?",
      "MessageIndex": 3718,
      "PostDate": "14/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "May 31, 2013 01:03PM fgm wrote: Purple-I'm so sorry that you are still dealing with that rash.   I went back to my LE therapist and she is teaching me breast massage.  My arm is doing great...no sign of swelling. But, my breast is swollen so I hope these massages help. I went to a bra compression specialist and she couldn't find a compression bra to fit me.  I'm large breasted but small around my back.  She told me that after DD cups manufacturers don't make much.  So, she's going to order some bras for me and see if any fit.  She's also going to ask a women up north who is a LE truckage specialist about my case. In the meantime, I'm sleeping with a foam form fitted under my breast. I bought some cheap bras at Walmarts and I slip the form in that. So far, it's working. When I wake up my breast is soft instead of hard.  Hope everyone has a comfortable weekend!",
      "MessageIndex": 3756,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "May 31, 2013 06:13PM fgm wrote: Thanks for the info Proud and Purple.   I have a compression cami. It helps with my side but it squishes my breast and by the end of the day it's torture and makes my breast hard.  I'm waiting to hear from the fitter.  I'll let you know. Have a great weekend!",
      "MessageIndex": 3759,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "fgm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148213/profile",
      "Content": "Jul 12, 2012 02:46PM fgm wrote: Thanks for your answers.  I had the cording but that seems to have gone away with exercise.  My surgeon said I have surface vein thrombosis and that should go away too.  Hope they don't come back. I've gone to a LE specialist and LE physical therapist and I do my exercises daily. I haven't started the weight training yet, probably in the next couple of weeks.  Now, I'll know to wear my arm sleeve and glove when I do.   I'm so glad that I found this site.  Thanks again for your help. ",
      "MessageIndex": 1156,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    }
  ]
}