{
  "AuthorID": "fhaido",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202586/profile",
  "Posts": [
    {
      "AuthorID": "fhaido",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202586/profile",
      "Content": "Jun 30, 2015 09:29PM fhaido wrote: Thanks Woody for the love. Things are not looking good based on what I am reading. Now we need to see how the onc wants to proceed.",
      "MessageIndex": 2040,
      "PostDate": "30/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "fhaido",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202586/profile",
      "Content": "Jul 23, 2015 08:12PM fhaido wrote: Thank you so much Ronnie, Woody and Isy for your comments! I will keep you all posted - after her ultrasound and blood tests we will know more... Isy, it sounds like you and my mom have experienced similar pain. She is going to ask her onc for steroids if the pain doesn't get better. Thanks again, you are all in my prayers",
      "MessageIndex": 2118,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "fhaido",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202586/profile",
      "Content": "Oct 2, 2015 06:29AM fhaido wrote: Hi everyone, my mom had progression with Gemzar and the onc wants to change her chemoto Halaven. Could anyone share your experiences with Halaven? I was hoping for Navelbine, but it looks like Halaven is the prefenrece...thanks!!",
      "MessageIndex": 2311,
      "PostDate": "02/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "fhaido",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202586/profile",
      "Content": "Jul 25, 2014 10:36AM fhaido wrote: Good luck macska, please keep us posted. My mom was also diagnosed with mets to liver (multiple) and bones 2 weeks ago. The biopsy results indicated that the tumor is not hormonal anymore, which limits her treatment exclusively to chemo. She is 57 years old, my best friend and the greatest grandmother in the world. She is meeting with with oncologist this afternoon to figure out the chemo treatment and get started as soon as possible. I have not stopped crying the past 2 weeks. I would love to hear success stories of women with triple negative tumors. Thank you all for this wonderful forum!!!!",
      "MessageIndex": 397,
      "PostDate": "25/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "fhaido",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202586/profile",
      "Content": "Jul 23, 2015 12:04PM fhaido wrote: Hi everyone, I have a question about liver pain. My mom, due to major progression, changed her chemo from taxol to Gemzar/Cisplatin. The plan is to do 3 cycles of 2 weeks on and one off of the combo. Her first cycle is over (so she's had 2 weekly chemos). First week she did not have any side affects but the liver enzymes (which exception of bilirubin) were extremely high and off the charts. But after the second week she started experiencing severe abdominal pain, particularly when she breathes. The onc saw her yesterday and felt that her liver is very enlarged and asked her to do semi-weekly ultrasounds (starting tomorrow) along with her weekly blood work. Depending on the results she will decided what to do about her chemo that is scheduled for next week. I am soooo worried because I've read that when you are at the point of having a lot of pain in your liver that it is not a good sign. Has anyone experienced similar pain that then stabilized? Thank you so much.",
      "MessageIndex": 2114,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "fhaido",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202586/profile",
      "Content": "Nov 24, 2014 12:19PM fhaido wrote: Woody, my mom's diagnosis was IDC. I have been reading about Avastin and you are right, it is still used in Europe and South America. I am sure hoping that she is one of the cases in which Avastin is effective... Thank you. Ronnie, thank you! I will let you know about her scans. She just turned 57 and is the best Grandma ever! We need all the prayers we can get and we will include you all in ours! Xoxo",
      "MessageIndex": 865,
      "PostDate": "24/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "fhaido",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202586/profile",
      "Content": "Oct 1, 2015 03:52PM fhaido wrote: I would also like to learn more about Halaven. My mom had progression with Gemzar and it looks like the onc wants to use Halaven next.... This will be her third chemo. Thanks!!",
      "MessageIndex": 1197,
      "PostDate": "01/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "fhaido",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202586/profile",
      "Content": "Jul 25, 2015 10:02AM fhaido wrote: Leftfoot, it looks like you are in good hands. Hoping that your heart is strong again and will do well with the next round of treatment. Praying for you. Cathy - thanks for giving me hope. The pain is a little better and we are hoping it only gets better with the new chemo. Lots of love to yo",
      "MessageIndex": 2125,
      "PostDate": "25/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "fhaido",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202586/profile",
      "Content": "Nov 24, 2014 08:16AM fhaido wrote: Hi everyone! First of all let me tell you how inspiring you all are! My mom was diagnosed with Stage 4 (liver and bone mets) in July. She took Aromosin for 5 years and was cancer free (she was stage 3 when she was first diagnosed in 2009). It looks like the cells mutated and are no longer hormonal, that's why Aromasin stopped working. A biopsy confirmed the change. Her cancer now triple negative. She is in Brazil and her chemo combo Taxol with Avastin and I noticed here in the US they stopped doing Avastin for bc. Has anyone had any experience/stories with this combo? Her scans are scheduled for the fist week of December so we will learn how effective it had been...",
      "MessageIndex": 862,
      "PostDate": "24/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "fhaido",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202586/profile",
      "Content": "Jun 30, 2015 04:01PM fhaido wrote: Hi ladies, I have been following all of your stories and you are all an inspiration, true warriors. My mom is also dealing with liver and bone mets for the past year. Her last scan besides showing significant progression it also shows that she has developed pseudocirrhosis. I know it is serious and I have been crying all afternoon. Anyone with experiences with pseudocirrhosis? Thank you",
      "MessageIndex": 2037,
      "PostDate": "30/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    }
  ]
}