{
  "AuthorID": "fhf2007",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111672/profile",
  "Posts": [
    {
      "AuthorID": "fhf2007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111672/profile",
      "Content": "Oct 21, 2010 02:35PM fhf2007 wrote: Thank you for your quick response and support. It is so nice to hear someone's opinion other than your own group of docs, rather someone who has been thru this fun. Glad to hear I am following the right path.",
      "MessageIndex": 2,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759689",
      "Title": "confused over what diagnosis I have fhf2007 fhf2007"
    },
    {
      "AuthorID": "fhf2007",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/111672/profile",
      "Content": "fhf2007 wrote: Started in aug when I found a lump in my r breast, went to the gyn who ordered us/mammo. The radiologist came in after and said it was suspicious and needed a core needle biopsy. Had that 2 weeks later, final diagnosis from path report: fragmented intraductal papilloma with focal atypia. Recomm excision. Next saw surgeon who listed under his impressions as adh and then performed a lumpectomy with needle localization. It took 15 days! to get the results from this biopsy. At day 9 the surgeon left me a message that the path were trying to distinguish adh from dcis and had sent the sample out for a second opinion. When we met with the surgeon the final path report stated: benign breast tissue with sclerosed adenotic papilloma extending to resection margin. However, he still sent me to an oncologist with the dx of adh. At this appt she gave me an exam, figured out my risk using the Gail model, said she was going with the adh dx and talked to me about taking tamoxifen. Weighing risks/benefits, I decided to start. Took for 5 days then got a call from onc. States she reread path reports and spoke with paths who are going with sclerosed adenosis. I asked about first biopsy and she said \"cells could have been crushed and diff to eval\". So she took me off tamox. Okay. Sorry so many words but I wanted to tell the whole story for the last 2 months. I am very confused over what my actually dx is and what I should plan to do to be proactive. I am definitely having a f/u mammo in 6 mos and f/u with surgeon. I have a 3 mos f/u with onc but I am not confident in her anymore and am not sure if I'll go. Does anyone have any comments or ideas for me? Thanks for the venting! :)  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/759689",
      "Title": "confused over what diagnosis I have fhf2007 fhf2007"
    }
  ]
}