{
  "AuthorID": "FightLikeAGirl72",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
  "Posts": [
    {
      "AuthorID": "FightLikeAGirl72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "FightLikeAGirl72 wrote: Can you have lymphedema in connection with your diagnosis of breast caner?  I only ask because my arm is tingly, swollen and just feels weird.  I already know I have lymph node involvement with my breast cancer, all the goodies, such as lymphedema is something I don't know much about.  Thanks. Dx 7/22/2014, DCIS, 3cm, Grade 2, ER+/PR+ Surgery 8/12/2014 Lymph node removal: Left, Underarm/Axillary; Mastectomy: Left, Right Dx 8/13/2014, IDC, 5cm, Stage IIB, Grade 3, 3/13 nodes, ER+/PR+, HER2- Chemotherapy 9/26/2014 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/823162",
      "Title": "Potentially Silly Question FightLikeAGirl72 kareenie"
    },
    {
      "AuthorID": "FightLikeAGirl72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "FightLikeAGirl72 wrote: Okay, I had my biopsy on Wednesday.  Something I hope I never have to go through again.  Has anybody noticed after their biopsy that the little inhabitants (that's what I call my cyst/mass/whatever) were smaller after their biopsy?  This whole thing is new and quite odd to me.  It just seems to get more confusion every day! Thanks! Kris Dx 7/22/2014, DCIS, 3cm, Grade 2, ER+/PR+ Surgery 8/12/2014 Lymph node removal: Left, Underarm/Axillary; Mastectomy: Left, Right Dx 8/13/2014, IDC, 5cm, Stage IIB, Grade 3, 3/13 nodes, ER+/PR+, HER2- Chemotherapy 9/26/2014 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/822892",
      "Title": "Here's a silly Question FightLikeAGirl72 FightLikeAGirl72"
    },
    {
      "AuthorID": "FightLikeAGirl72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "FightLikeAGirl72 wrote: This Post was deleted by FightLikeAGirl72. Dx 7/22/2014, DCIS, 3cm, Grade 2, ER+/PR+ Surgery 8/12/2014 Lymph node removal: Left, Underarm/Axillary; Mastectomy: Left, Right Dx 8/13/2014, IDC, 5cm, Stage IIB, Grade 3, 3/13 nodes, ER+/PR+, HER2- Chemotherapy 9/26/2014 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822787",
      "Title": "Two More Days Until Biopsy Time! FightLikeAGirl72 FightLikeAGirl72"
    },
    {
      "AuthorID": "FightLikeAGirl72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "FightLikeAGirl72 wrote: Dear Cancer, As I sit here, obsessing over a BIRAD 5 report, planning my funeral, my next vacation, my work week, researching every possible webpage looking for clues, then calming myself down, I want to thank you.  I want to thank you for making me take extra time with my children, hugging them tighter, kissing their heads more, spending more time with them.  I want to thank you for having me blow off work because quite frankly you are on my mind.  I want to thank you for loving my husband more, even if he has no clue what I am going through, despite me trying to explain my fears and me trying to under his fears.  I want to thank you because things that were important in my life, such as making my sales quota, are no longer important.  I ignored you, Cancer, for almost five months, as my mother died of lung cancer, but you would not give me a break.  I guess you think than you are tougher than I am.  However, what you don't realize that even with a BIRAD 5, with an area of scattered microcalcifications, architectural distortion, two masses, one of which is hypoechoic, longer than wide, with a posterior wall that hides and a single axillary lymph node with spiculated margins - that does not mean you won.  What it means is that you are an unwanted visitor and you will leave.  I will fight you tooth and nail every step of the way.  You will not get me down, you will not deter me, no matter what you end up to be.  I think you need to know that. Sorry ladies, I had to get that off my chest.  I recently received my mammogram/ultrasound results which discussed my mass 2.5cm x 3cm with microcalcification an area of scattered microcalcifications, scattered distortion and single spiculated axillary lymph node in my left breast with suspicion of lobular cancer. I met with my surgeon at Walter Reed Hospital in Bethesda Maryland.  Oddly he did not feel any swollen lymph nodes and mentioned early stage cancer.  I have a biopsy scheduled for July 16th.  It's been a bit of a roller coaster ride of emotions since I won't know anything definitive without the biopsy results. I feel quite alone in this, even though I have the support of my friends and family.  Does anybody feel the same? Dx 7/22/2014, DCIS, 3cm, Grade 2, ER+/PR+ Surgery 8/12/2014 Lymph node removal: Left, Underarm/Axillary; Mastectomy: Left, Right Dx 8/13/2014, IDC, 5cm, Stage IIB, Grade 3, 3/13 nodes, ER+/PR+, HER2- Chemotherapy 9/26/2014 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822442",
      "Title": "Dear Cancer FightLikeAGirl72 Mouche"
    }
  ]
}