{
  "AuthorID": "fightlikeag…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
  "Posts": [
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 17, 2014 05:35AM FightLikeAGirl72 wrote: Good luck Karmen!  I am waiting for my results as well.  I keep replaying my biopsy in my head.  While I was pissed yesterday that the doctor missed my lymph nodes and breast mass twice, I take a little humor in knowing that they were moveable and challenging him.  Almost mocking him.  They are kind of defiant like me!    Praying for everybody under our circumstance that the results are B9.",
      "MessageIndex": 6,
      "PostDate": "17/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/822823",
      "Title": "Waiting and anxious Karmen Karmen"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 18, 2014 11:03AM FightLikeAGirl72 wrote: Shewolf, Tell those things to stop acting up!  Are you icing?  I ice, but don't do pain meds. My boobs actually feel normal.  It's the damn lymph node biopsy that is killing me and trapezial muscle that's killing me.   I did not tell anybody this, but I also had a weird experience on the day of the biopsy.  You see, my mom died in March of Stage IV lung cancer.  She was diagnosed in January and I had a little more than two months with her.  She and I, always had a special bond.  Every time somebody in our family was sick, I would have these wild dreams.  I would call her and ask her who was sick and she would tell me, except when it was her.  My father and she had their marriage blessed after 45 years in September.  I looked at my husband and said \"One of my parents are sick.\"  I was pretty in tune with her.  So as I sat in the waiting room, I pushed my hair to the side and looked in the mirror.  I was staring straight at her in the mirror.  Now granted we resemble each other faintly, but not enough for a mirror image.  As I looked in the mirror, she asked me \"What the hell is your problem?  You are going to be fine?  This is not as bad as you think!\"  I literally shook my head like a salt shaker.  The image looked back at me and said \"Do you think that's going to make me go away?\"  By this point I was freaked out.  Then somebody came into the waiting room and I was looking at myself. How's that for strange? I hope you start to feel better!  I'd recommend alcohol, but I am not sure you drink and I am not so sure we should mix emotions and alcohol right now anyway!",
      "MessageIndex": 2,
      "PostDate": "18/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/822892",
      "Title": "Here's a silly Question FightLikeAGirl72 FightLikeAGirl72"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 15, 2014 02:50PM FightLikeAGirl72 wrote: Thanks sarahjane!  I think I may have made \"googling\" a profession with as much time as I spent looking up everything.  I just got back from a manicure and pedicure.  I figured if I have to fight like a girl then I might as well keep up appearances.  Hopefully it's what the doc said masectomy and radiation.  Otherwise, I have threatened to wear Disney princess wigs during chemo and draw on my eyebrows with Sharpies :)!",
      "MessageIndex": 3,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822787",
      "Title": "Two More Days Until Biopsy Time! FightLikeAGirl72 FightLikeAGirl72"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 18, 2014 09:22AM FightLikeAGirl72 wrote: Holeinone, I am pretty in \"tune\" with my body.  However, there are things beyond my normal conception that I don't even understand.  For example, my mom, passed away in March of Stage IV lung cancer.  I knew she was sick before she was diagnosed.  She and I shared this very special bond.  So, when I sat in the clinic for my mammogram, her voice came to my head and said, \"You are not going to like what you hear.\"  Sure enough Birads 5.  As I sat in the waiting room on Wed., I looked in the mirror, shifted my hair to the side and was starting at her, not me.  She said to me \"What the hell is your problem?  You are to be fine. This is not as bad as you think!\"  I shook my head like a salt shaker and she was there staring at me and asked \"Do you think that's going to make me go away?\"  Luckily somebody else came in the waiting room and sat down.  So needless to say, my not knowing and all of the other stuff I can't explain, really messes me with me.   As for my family, that's another story for another day.  In all candor, I wish I had my sisters and dad with me.  Would they give me a pity party, probably not! Would they help me with everything around the house - absolutely!  I guess the good part of that is because I have the responsibility of taking care of the house, a lot of time, my mind is not on my worse fear.  Go figure.  I am glad I have these boards to, because I like to vent, but won't do it in front of anybody because if I did, it would be terrible! I will tell you one thing, I've probably accomplished a lot more heavy cleaning, since the mammogram!  That way if I have my worse case scenario, people coming in and out of the house will know that it's clean!",
      "MessageIndex": 9,
      "PostDate": "18/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822787",
      "Title": "Two More Days Until Biopsy Time! FightLikeAGirl72 FightLikeAGirl72"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 18, 2014 09:23AM FightLikeAGirl72 wrote: Sarahjane, Glad there is another worse case scenario person on here with me!   My results may be available as early as Monday. I am also the type of person, who likes to know everything yesterday.  I need to be able to plan for treatment, kid's rides, work, etc. Kris",
      "MessageIndex": 10,
      "PostDate": "18/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822787",
      "Title": "Two More Days Until Biopsy Time! FightLikeAGirl72 FightLikeAGirl72"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 15, 2014 09:15AM FightLikeAGirl72 wrote: All: I deleted my prior post because I was feeling sorry for myself.  In all truthfulness, I should have deleted instead of posting it at all. So tomorrow is biopsy day.  I strangely feel normal today with only a slight ache in my arm and back.  Of course the bad boob always hurts.  It reminds me to be optimistic that it's benign and that I am the one of the 25% that comes back with with a benign birads 5.  Oh but wait, there is that lymph node thing going on.  One enlarged axillary with spiculated margins.  Makes me wonder how many are actually under my arm and if one spiculated lymph node is better than three or four?  Then there's the radiologists impression \"suspicious of lobar carcinoma.\"  Needless to say, I just want to get to the next step.  Waiting for the biopsy day made me do nothing but make me a professional Googler.  I am sure waiting for the results of the biopsy are either going to result in a spotless house or an obnoxious shopping spree.  Out of curiosity, are there any people on the board who had a birad 5 with lymph node involvement that was not cancer?  Also did everybody assume the worse until they had their biopsy results.  Thanks in advance lady.  My roller coaster ride seems to never end. Gentle Hugs! Kris",
      "MessageIndex": 1,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822787",
      "Title": "Two More Days Until Biopsy Time! FightLikeAGirl72 FightLikeAGirl72"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 18, 2014 08:44AM FightLikeAGirl72 wrote: Sarahjane, Okay, I did a little more research, but nothing new.  Still feeling like a pin cushion and absolutely no sympathy from the natives (husband and kids).  I still had to take out the trash, recycles, clean up their dishes, run the sweeper, clean, laundry, grocery shop, take care of dogs and work.  One strange thing I noticed is that the inhabitants (cysts/mass/whatever) inside of my breast are smaller after the biopsy.  I don't know if they were reacting to my own hormones (my \"friend\" showed up morning of biopsy) or what, I just find it odd.  I also heard about the little guys moving as a good sign, but right now, I am resigned to it being BC.  I don't know why, but probably because if I get my hopes up and convince myself it's B9, it will sting even more to find out it's not.  Does that make any sense?  So, instead of worrying about treatment, I am looking at post-masectomy clothing for work.  I am not thrilled with the ruffles and the ruching.  Just because I don't have boobs, does not mean, I can't be sexy and love my clothes!",
      "MessageIndex": 6,
      "PostDate": "18/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822787",
      "Title": "Two More Days Until Biopsy Time! FightLikeAGirl72 FightLikeAGirl72"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 17, 2014 10:19AM FightLikeAGirl72 wrote: Sarahjane: Yesterday's biopsy was remarkable.  To make three pokes it took the radiologist five tries.  Ouch!  My breast mass kept moving on him, so he had to get two people to pin it down.  The same with my lymph nodes.  They did not want to cooperate.  He also did a fine needle aspiration of some cysts behind my nipple.  Get this, when he punctured two of them, they disappeared.  He was able to get something from the third, it was clear and thick.  The doctor who supervised the radiologist kept saying something about a lot of this looks like fibrocystic changes ... so who knows.  One thing I will note, I feel better today now that the biopsy is over!  There is nothing I can do until I get the results other than stay positive! Kris",
      "MessageIndex": 4,
      "PostDate": "17/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822787",
      "Title": "Two More Days Until Biopsy Time! FightLikeAGirl72 FightLikeAGirl72"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 20, 2014 06:03PM FightLikeAGirl72 wrote: Stacy, I am a paralegal by profession, sales representative by choice.  Like you, I love to research, it is second nature to me.  I've read every possible article possible, self-diagnosed myself and then decided to hell with it, if it's here, there is nothing I can do other than deal with it.  Right now, my intuition is not my best friend, which is odd.  Usually, I know when I am sick, this time I have no clue.  Go figure.  If I get my results this week, then I expect surgery within the next two weeks.  My goal, if it is positive, is to get through surgery and then watch my husband run his half marathon in California on Labor Day weekend.  Life goes on!  I will let you know when the results come back.  If it is B9, I am renting the largest house on the beach of North Carolina and throwing a huge party.  I see you had your lymph nodes removed at IIa, was there any involvement or was that to err on the side of caution? Kris",
      "MessageIndex": 13,
      "PostDate": "20/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822787",
      "Title": "Two More Days Until Biopsy Time! FightLikeAGirl72 FightLikeAGirl72"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 1, 2014 01:12PM FightLikeAGirl72 wrote: Thanks April.  Hope springs eternal.  The doctors at Bethesda told me yesterday that 80% of masses, come back benign.  I asked them to break that down to my BIRAD 5 reading, and of course their statistic was 25%.  I guess better than 5, but still interesting.  If it comes back benign, I will be in complete shock.  I analyze every ache and pain in my body everyday and I am scared beyond belief.  I know in a few weeks, I will have my answers and face the beast head on, if I must.  In the meantime, I just live my life as normally as possible.  I just wish somebody could put me to sleep for the next three weeks and wake me up when we have answers!  Thanks for keeping me in your thoughts in prayers, I know you've traveled this road and it is very special when you find supportive folks, who have an idea of what you are up against!  ",
      "MessageIndex": 4,
      "PostDate": "01/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822442",
      "Title": "Dear Cancer FightLikeAGirl72 Mouche"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 1, 2014 11:55AM FightLikeAGirl72 wrote: Thanks lintrollerderby.  Whatever the diagnosis, we will deal with it when its conclusive.  From what I've read and discussing it with the doctor, we caught it early.  Now, let's find out what we can do to treat it and hopefully destroy it.  Outside of not being able to control it, the worst part of this for me is that the mass is sitting on top of one of my nerves, it almost feels like I have carpal tunnel!  How is your adventure coming along so far?  I look at your stats and I am curious.  ",
      "MessageIndex": 2,
      "PostDate": "01/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822442",
      "Title": "Dear Cancer FightLikeAGirl72 Mouche"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 1, 2014 04:56PM FightLikeAGirl72 wrote: Thank you all for your kindness, words of advice and encouragement.  I know this is all a journey that none of us signed up for and I am looking forward to making new friends and getting through this together! Love to all my new friends and I will ask God to bless each and every one of you as I say my prayers tonight!",
      "MessageIndex": 8,
      "PostDate": "01/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822442",
      "Title": "Dear Cancer FightLikeAGirl72 Mouche"
    },
    {
      "AuthorID": "fightlikeag…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/188789/profile",
      "Content": "Sep 27, 2013 12:38AM fightlikeagirl13 wrote: Yes I do. My nurse from hospice says its a side effect of the amount of morophine i take, being 300 mg a day. Are you on any narcotics? Opiods? Needless to say, lots of constipation too. I take 1500 mg of magnesium for that problem. I'm afraid its one more adventure in our world of cancer. I do notice if I try to up my water and have a least 2 lassrs of cranberry grape juice, the flow is better. Normally I have to wait, get a trickle, strain to keep the trickle going",
      "MessageIndex": 1,
      "PostDate": "27/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811733",
      "Title": "Oh well, now peeing is a challange! stagefree Anne45"
    },
    {
      "AuthorID": "fightlikeag…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141955/profile",
      "Content": "Dec 30, 2011 01:15AM fightlikeagirl2011 wrote: WOW!! This really scares me. I start rads in January and my onc said it is much easier than chemo. Chemo was horrible, so I can't imagine what rads will be like if she is wrong! What a beast BC is.",
      "MessageIndex": 83,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777460",
      "Title": "\"Easy\" part of treatment? MY A**! BlueCowgirl Tazzy"
    },
    {
      "AuthorID": "fightlikeag…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141955/profile",
      "Content": "Dec 30, 2011 01:14AM - edited Dec 30, 2011 01:14AM by fightlikeagirl2011",
      "MessageIndex": 82,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777460",
      "Title": "\"Easy\" part of treatment? MY A**! BlueCowgirl Tazzy"
    },
    {
      "AuthorID": "fightlikeag…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139829/profile",
      "Content": "Nov 21, 2011 10:01PM - edited Nov 22, 2011 05:34AM by fightlikeagirl33 ILTMB, I was wondering if the size of your breasts have changed. I had bloody nipple discharge from my right nipple my Dr found a lump in each breast and scheduled a mammogram and an ultrasound. I went in Friday for both and was told I have a lot of ductal papillomas and will need to see a BS for a ductal excision. My Dr called today with the results of my nipple discharge culture and said it grew a lot of bacteria, so I have a breast infection on top of everything. My breasts are noticeably larger about a size larger and the pain is as you described. I have noticed it getting worse and they ache. I hope your doctor finds out what is going on soon, pain isn't fun and neither is the unknown. I'll keep you in my prayers.",
      "MessageIndex": 18,
      "PostDate": "21/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778029",
      "Title": "help..symptoms getting worse ILTMB ILTMB"
    },
    {
      "AuthorID": "FightLikeAG…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202220/profile",
      "Content": "Jul 27, 2014 07:40PM FightLikeAGirl72 wrote: Darla, Sorry you have to join the club.  I was diagnosed within the last week as well.  My story is a little different.  My cancer showed up as DCIS with infiltrating characteristics.  Basically, it meant one of my lymph nodes tested positive for cancer and they undersampled my breast tissue for biopsy.  My path report shows that my cancer is both ER+ and PR+.  I am also a Grade 2.  I am awaiting the HER2 report.  My breast mass is tricky because it is a fibrous mass with cancer.  From what I understand, the actual cancer mass may be smaller than the 3.6 cms. that appears on the mammography report. Whatever the case, I know, I have breast cancer.  Because of the node involvement, I chose to undergo a bilateral mastectomy.  My breasts are small and my mass is big, so if they were taking one-side, they might as well take both.  I will have four months of chemo, followed by six weeks of radiation. There are a few of us here, who like you, just received the news.  Please feel free to PM at any time.  All of us, are more than happy to help in any way we can! Kris",
      "MessageIndex": 10,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/823106",
      "Title": "New to site, recently diagnosed DarlaJ DC197"
    },
    {
      "AuthorID": "fightlikeag…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139829/profile",
      "Content": "Nov 20, 2011 07:03AM fightlikeagirl33 wrote: Thank you Beesie. I will keep thinking positive.",
      "MessageIndex": 4,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778401",
      "Title": "A 6th sense fightlikeagirl33 fightlikeagirl33"
    },
    {
      "AuthorID": "fightlikeag…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139829/profile",
      "Content": "Nov 20, 2011 05:15AM fightlikeagirl33 wrote: Yes BC does run in my family. I have a maternal aunt who died from BC in the 80's as well as a paternal aunt who died of BC.",
      "MessageIndex": 2,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778401",
      "Title": "A 6th sense fightlikeagirl33 fightlikeagirl33"
    }
  ]
}