{
  "AuthorID": "fight4two",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
  "Posts": [
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "fight4two wrote: This Post was deleted by fight4two. Dx 8/20/2012, IDC, 3cm, 2/9 nodes, ER+/PR+, HER2- Chemotherapy 10/1/2012 AC Chemotherapy 11/26/2012 Taxotere (docetaxel) Surgery 1/20/2013 Lumpectomy: Right; Lymph node removal: Right, Underarm/Axillary Radiation Therapy 3/4/2013 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/798557",
      "Title": "Neoadjuvant Chemo - Tumor not shrinking fight4two fight4two"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Jan 29, 2013 12:26PM fight4two wrote:",
      "MessageIndex": 18614,
      "PostDate": "29/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Jan 30, 2013 03:03PM fight4two wrote: Thanks for the itchy dry scalp solutions! Another question, is the eyebrow/eyelash serum to prevent the loss of eyebrows and eyelashes? Or to help them grow back faster?",
      "MessageIndex": 18617,
      "PostDate": "30/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Feb 19, 2013 02:58PM fight4two wrote: Yay! You ladies are right - when the eyebrows/lashes DO decide to come back, they come back fast!  I am happy to report that I have eyebrows again and I see MANY tiny lashes coming in.  This has helped me look a lot more like \"me\" as my makeup skills are poor, to put it kindly! I am thinking to start biotin.  I figure it can only make things go faster or have no effect.  Has anyone had any negative effects from biotin?  I only ask because I feel so nervous taking pills these days.  This dx has definitely increased my paranoia!",
      "MessageIndex": 18809,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Dec 26, 2012 04:13PM fight4two wrote: Hi Ladies -- Can't wait to \"officially\" join this thread.  I still have sixteen days to go until I'm PFC (barring no delays!)  I've been lurking - looking at the beautiful progress you ladies are having with your hair -- loving those pictures!!! I've had some scalp pain with taxotere.  Not as painful as when my hair was falling out with the AC, but some tenderness.  At first I thought my remaining stubble that never fell out was probably falling out, but I find no hair on my pillows or towel.  Anyone have scalp tenderness when the hair started growing back??  I am hoping thats what it is.  I have found a teeny bit of new growth, so I'm hoping the tenderness is my hair coming back. I can't really see the area that is tender, so can't see if there is growth there or not.  I would be happy if there was finally a positive reason for pain! HA! Hope to be back here starting a picture timeline in 16 days!!!",
      "MessageIndex": 18334,
      "PostDate": "26/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Jan 25, 2013 05:22AM fight4two wrote: Hi racy! How long did your hair have to be before you got extensions? I've been thinking about extensions but wondered if my hair would even be strong enough to support them. Oh, to have hair again!! Congrats on your shoulder length hair!!",
      "MessageIndex": 18579,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "fight4two wrote: I'm looking for a recommendation for a great oncologist in the Los Angeles area. I was recently diagnosed with mets to my spine. My mets sprang up fast and furious while I was pregnant, but now that I am 2 and 1/2 months postpartum I am feeling great. It's so hard to do treatments knowing there will be side effects both emotional and physical when you are not feeling bad. Wishing I could just sit in denial and just take care of my sweet little baby, but I know that I need to get going on a treatment plan and would love to go to a highly recommended oncologist. Dx 8/20/2012, IDC, 3cm, 2/9 nodes, ER+/PR+, HER2- Chemotherapy 10/1/2012 AC Chemotherapy 11/26/2012 Taxotere (docetaxel) Surgery 1/20/2013 Lumpectomy: Right; Lymph node removal: Right, Underarm/Axillary Radiation Therapy 3/4/2013 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/853665",
      "Title": "Los Angeles Oncologist recommendation fight4two Pessa"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "fight4two wrote: I am pre-menopausal and was hoping to use tamoxifen to treat my bone mets. Unfortunately, after my latest PET scan, my oncologist has stated the tamoxifen isn't working and that I need to be moved onto an AI. He told me to stop taking the tamoxifen and within two days my period resumed and now my bones feel bruised and I'm thinking that even if the tamoxifen wasn't stopping the spread it may have been slowing it?? Anyhow, the next plan is for letrozole and palbociclib. However, since I am not in menopause, I need to get Lupron shots. My oncologist told me that the lupron would reduce my estrogen levels within days. Upon some research, I see that some women aren't in full menopause for a few months after starting lupron and begin taking AI after their estrogen levels test at an appropriately low level. Does this mean that I won't be able to start my next course of treatment for potentially months??? Or if my oncologist starts me on the new regimen immediately, does this mean that I will just be experiencing the side effects of the drugs without any real benefit until the lupron successfully puts me in menopause months later? Any clarity on this would really help!! Anyone else switch from tamoxifen to an AI while being pre-menopausal? What was your process? Thanks. Dx 8/20/2012, IDC, 3cm, 2/9 nodes, ER+/PR+, HER2- Chemotherapy 10/1/2012 AC Chemotherapy 11/26/2012 Taxotere (docetaxel) Surgery 1/20/2013 Lumpectomy: Right; Lymph node removal: Right, Underarm/Axillary Radiation Therapy 3/4/2013 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/854678",
      "Title": "How long do you have to wait for AI after Lupron? fight4two zarovka"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Jan 28, 2013 12:00PM fight4two wrote: I'm having trouble comprehending the theory behind the drains.  So we have to have the drains in until they drain only a small amount, which means less physical exertion and more resting.  But once they are out, we can exercise and move about a lot?  Doesn't this cause a lot of fluid and now there is nowhere for it to drain?  I almost feel like resting to get the drains out is cheating the system (ie getting them out earlier than we should??), if once they are out we change our habits.  I guess I'm just confused because no one explained the drains to me, and I'm fearful that if I move a lot after they are out, I will have excess fluid and maybe get lymphodema???  If someone could explain this to me, I'd really appreciate it.  I wish I asked more questions to the dr! I'm so confused! Thinking of you today, TammyT!",
      "MessageIndex": 818,
      "PostDate": "28/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Feb 16, 2013 04:55PM fight4two wrote: Hi Josie.  My plastic surgeon implied that if I get radiation, I won't be able to get reconstruction at a later date via tissue expanders and that I'd have to go the flap route.  I didn't ask too many questions, because I was set on the quadrantectomy with mastoplexy.  Maybe ask about flap possibilities? Has anyone else been having cording issues?  I've read online that its a pretty common complication after lymph node removal, but neither my BS or PS seem to be familiar with the problem and just seem perplexed when I show them my armpit cording.  And my MO said it was a vein.  No one seems concerned about it (but me!).  It hurts A LOT when I move in certain positions, otherwise no pain at all.  The intense pain from pit to elbow has moved down and now its from elbow to wrist.  I can see the cord pop out in my inner elbow now too (in those certain positions).  I have been limited in my exercises, not by my shoulder, but by the pain in my elbow! I am worried, as I will need to be flexible soon to get into position for radiation (plus it would be nice to be able to move without pain!)  I have asked for a PT but have yet to hear from one, and they will just be giving me a regular PT trained in upper body mobility, not trained in BC and lymphedema.  UGGGGHHH...",
      "MessageIndex": 1070,
      "PostDate": "16/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Feb 16, 2013 05:17PM fight4two wrote: Lmimp64 - I think I'm limited by who I can have since I have an HMO and have to be referred to the PT.  I guess I could pay out of pocket, but not sure how expensive that would be.",
      "MessageIndex": 1072,
      "PostDate": "16/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Jan 20, 2013 09:14AM fight4two wrote: wirdgirl - I love how your dog cuddles you but avoids any sensitive areas! I am worried about my cat jumping on me while I'm sleeping, since I will be ordering a recliner and probably sleeping in the living room.  I am hoping she is as sensitive to my needs :)",
      "MessageIndex": 607,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Jan 23, 2013 11:57AM fight4two wrote: I MADE IT!! Just wanted to check in and let you know that I'm back home and on the mend after my surgery.  I do have a drain in, but its not draining much.  Not sure if thats a good thing or bad thing. How do you guys elevate your arm when you are sleeping (for those who had lymph nodes removed.)  I try to keep my wrist above my elbow above my shoulder above my heart, but when I wake up, my arm is never like that! And mirmirpanda, are you able to hold your sweet baby yet?  My baby is 4 1/2 months old, and I'm wondering when I can take care of him again.  It would be heartbreaking if I had to wait the full 6 weeks. Love to all!  And I'll be thinking of those who have surgery the rest of this week - my surgery week sisters!  You can do it!  Its so nice to know that \"thing\" is OUT!",
      "MessageIndex": 687,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Jan 20, 2013 09:12AM fight4two wrote: My surgery date is coming up and I'm soooo nervous!  I caught a cold last week and I had an unexplainable fever, so my doctor had me on levaquin - a very powerful antibiotic.  The antibiotic is hurting my shoulder and calves though, and there is a black box warning about tendon problems with shoulders and achilles heel, so I'm terrified and didn't take my fifth (out of seven) dose yesterday.  None of the tests he did on me showed a bacterial infection, but my fever did go down two days into taking the drug.  I hope it was coincidental, as stopping the drug if it was killing an infection is probably the worst thing I can do! So now I'm afraid of interactions with anesthesia and wishing I hadn't had a cold so I could be 110% before surgery.  I need this surgery NOW though and don't want it delayed.  I'm sick with worry and just cant wait to wake up in the recovery room and be told that everything went fine.  Please ladies, I need you all this coming Monday.  So many of you before me have been so strong and done well.  This gives me hope.  But yet, still terrified!",
      "MessageIndex": 606,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Jan 26, 2013 12:20PM fight4two wrote: Not sure if I'm imagining things, but I swear my abdomen/stomach area is much more bloated looking since surgery. Its like I have a balloon in there! Is this a side effect of the anaesthesia or the antibiotics?! Anyone else notice this?",
      "MessageIndex": 774,
      "PostDate": "26/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Feb 3, 2013 11:11AM fight4two wrote: Ugh, my stomach still looks bloated and my surgeon said it shouldn't be a side effect of anesthesia or surgery!! I hope this is not my new normal. I can't figure out what happened or how to fix it. More worrisome though is when I asked her about my upper arm, she said its normal for the back to feel numb. But I've been having a lot of pain from my shoulder to my elbow on the inside of my arm, almost likea tendon or nerve is supersensitive. Its been hard to do my arm exercises because its painful to even get in the starting position. So yesterday I lifted my arm slightly and looked at my armpit in the mirror and there is a tendon or something hanging low in my armpit. I can see it when I lift my arm. I looked at my untouched armpit and nothing there! I don't think I've explained this well. I'm worried because I don't know why I have this sensitive nerve from armpit to elbow that's actually visible in the armpit. Before I just figured pain and numbness were normal and would slowly decrease over time, but it troubles me because it impedes my exercises and I want my range of motion back! Anyone know what this is or what I should do?? I wish I had better pt under my medical plan. Just a visit from a physical therapist in the hospital who obviously didn't specialize in BC patients because she couldn't answer my questions like if I can shave the armpit area or if a cut could increase chance of lymphedema. I really wish I was surrounded by more knowledgeable medical professionals. Thank goodness I have you guys!! I can't believe Jan went by so quickly and we've all had our surgeries!! Healing thoughts to all!!",
      "MessageIndex": 947,
      "PostDate": "03/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Jan 14, 2013 10:08AM fight4two wrote: Hi! I'm late in joining this thread, but my last neoadjuvant chemo was just canceled (supposed to be 1/10) and I am being sent straight to surgery! My surgery is currently scheduled for 1/21.  I will be having a partial mastectomy (quadrantectomy?) and a full axillary node dissection.  I am afraid of lymphedema and hoping to heal quickly since I have a four month old baby to care for.  My husband has plans to take a week off from work, but I think I might have to ask him to take off for longer.  To add to my stress, I just fell under the weather this weekend.  I think it might just be a cold, but it is accompanied by fever.  I assume my surgery will have to be postponed.  Just wanted to introduce myself before I try and read up on all you ladies have written.",
      "MessageIndex": 445,
      "PostDate": "14/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Mar 4, 2013 07:14PM fight4two wrote: My scars feel so thick and cordlike.  And the worst part is the area where they removed my tumor it is really hard.  I was so looking forward to feeling that area and having it finally be soft.  My BS said its from the surgery - so I questioned how I would know if there was anything there (self exams??) and she said thats what they have scans for. UGH. Are you girls doing anything to soften your scars?  Is this a permanent thing, or do they soften over time?  The drs didnt tell me to do anything but I always feel like I learn more from the forums so thought I might as well ask!",
      "MessageIndex": 1145,
      "PostDate": "04/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "fight4two",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161365/profile",
      "Content": "Mar 17, 2013 02:20PM fight4two wrote: Hi Tami! Just wanted to chime in that I had cording as well. It hurt the most when it first developed and then only seemed to hurt when my arm was in certain positions, but felt 100% fine in other positions! I could see the cords pop out in my armpit and inner elbow. They reduced my flexibility because they were so tight and I couldn't stretch past them. I diligently did stretches and it seemed to resolve in about six weeks (about 10 days before my pt was finally approved!!) When I saw the pt I had full range of motion back and no visible cording. Unfortunately since starting radiation some of the armpit pain and reduced flexibility has come back. I've been told to continue lightly stretching but not to push through the pain as it could cause the cording to come back. Sorry you are having to deal with this. It caused me much distress because I was worried I wouldn't be able to get into position for radiation. I hope yours resolves itself soon!",
      "MessageIndex": 1165,
      "PostDate": "17/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    }
  ]
}