{
  "AuthorID": "Findaway",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229044/profile",
  "Posts": [
    {
      "AuthorID": "Findaway",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229044/profile",
      "Content": "Mar 28, 2016 05:57AM Findaway wrote: Windward - Thank you and your friend for the link to the alternative information. I am seeking any and all info/research regarding natural approaches that support our own bodies innate healing mechanism. Well tomorrow I begin week 4 so that means I actually haven't quit but have come oh so very close. To be honest that thought is on my mind every treatment. So far no skin issues or color changes. Thus far my challenge is that my back spams each time I get into position on the table. It's brief but painful. It seems to be that extended position. I found it also happens if the therapists make me laugh while they position me. That's too bad because they can be very funny and I really enjoy their humor. Reading along this thread has been very helpful to me and I want to thank you all for sharing your journey and caring words. I hope at some point I can share something that will be of help to one of you. Have a smooth and peaceful week all.",
      "MessageIndex": 2291,
      "PostDate": "28/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Findaway",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229044/profile",
      "Content": "Apr 27, 2016 03:33AM Findaway wrote: I have a question or 2 for you all about boosts. I had 5 weeks of whole breast and 1 week of boosts to my surgery site (about 12-1 o'clock). I never had any skin color changes around the area of the suture site BUT my axillary area got tan during whole breast and bright red and lymphedema after boosts. I never had any swelling after surgery (2 sentinel nodes removed) and this was not a treatment area. I also have rib soreness. Soooo my question is when you got your boosts did you have skin redness over the surgery site? Did anyone have a similar treatment of whole breast and surgery site BUT have a lot of tan/redness in axillary as a \"spillover radiation? Lymph issues? I know everyone is different in all ways but I can't make sense of these \"symptoms\". I was very happy to have no lymph issues after surgery (and I should not have had with only the 2 nodes taken out) and since you can't feel radiation all I have is skin changes in strange areas that confuse me. Makes me wonder where the radiation went. Thank you for your time.",
      "MessageIndex": 2578,
      "PostDate": "27/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Findaway",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229044/profile",
      "Content": "Mar 17, 2016 10:52AM Findaway wrote: Hi all. Thank you for the kind welcome. I am happy to find you. Today was day #8 for me. Every day is psychologically draining. I have wanted to bail on the treatments every day. I guess you can say I am going in fear. I know I need to change that thought process around. I have an alternative medicine background and have read the research on radiation on both sides of the coin and I am thinking I have made the wrong choice for myself. I am also struggling with the antioxidant thing. I was not told to not take antioxidants by my RO until I asked her on Friday (the weekly touch base with you meeting) and she said not to. I told her I was drinking a ton of alkaline water and it was high in antioxidants but she said go ahead and drink it. Mixed message there. There is a great deal of research that shows it does not interfere with chemo or rads and actually enhances the killing of the therapeutic modalities of cancer, decrease side effects and protects normal tissue. I am not suggesting that you take antioxidants I am just sharing where my head space is. Anyways I am glad I can drink the water, that gives me some peace of mind. I have adopted a new mantra \"change the soil so the seed can't grow\". It's a nice thought when I lay on that table every day. Thank you for listening",
      "MessageIndex": 2143,
      "PostDate": "17/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Findaway",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/229044/profile",
      "Content": "Mar 10, 2016 01:41PM Findaway wrote: Hi everyone. This is my first post. I am new and don't know the lingo yet but plan on reading all the posts from the beginning to hopefully learn. I started radiation on this past Monday March 7th and will go for 6 weeks. I am so very glad to find you all. 3 days down and not liking the new experience.",
      "MessageIndex": 1999,
      "PostDate": "10/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    }
  ]
}