{
  "AuthorID": "fireagate",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179395/profile",
  "Posts": [
    {
      "AuthorID": "fireagate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179395/profile",
      "Content": "Jun 7, 2013 05:42PM fireagate wrote: I just wanted to respond about the use of thermography for detecting breast cancer. I had thermography done about 2 years ago. This thermography showed \"thermal patterns strongly suggestive of hormone imbalance with associated cystic and/or fibrocystic breasts.\" I was prescribed various herbs, vitamins and iodine to help clear estrogen. I took these. This past Feb. there was an area on the side of my breast that looked a little weird. I went in for another thermography. I did tell the technician why I was there and showed her the area of concern. She called a few days later with the results.The thermograph showed less estrogen than last time and nothing else to indicate further follow up. I was told to keep up the good work with the herbs and such. Now three months later and much wiser, I realize that weird looking skin around the breast is not good and I should have gone to my regular doctor. I did this after a lymph node on that same side became enlarged and did not resolve after a month. After more wiseness and smartness...don't wait a month to get enlarged lymph nodes checked out (over the years have had several enlarged lymph nodes and they just say ..oh you are fighting and infection). I will be starting chemo in the next two weeks. Two tumors each about 2.5cm that are invasive and one area that is DCIS plus metastatic disease to the lymph node. I did make a followup appointment with the thermography clinic and asked why the thermograph did not pick the two tumors up. She told me that she was sorry she did not know why. She looked over the results again and said there was some additional heat in that area but not enough to show any concern. I personally would never trust a thermography test again. They miss stuff just like any other test.",
      "MessageIndex": 3,
      "PostDate": "07/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/804888",
      "Title": "Inconclusive??????? Butterfly88 MelissaDallas"
    },
    {
      "AuthorID": "fireagate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179395/profile",
      "Content": "May 21, 2013 12:21PM - edited May 21, 2013 12:23PM by fireagate Hi, I'm a couple steps ahead of you and scared also. This is my first post here. I found a weird spot also on the side of my breast in February. Not a lump but more fibrocystic like and a bit of wierd skin texture. Went to get a thermogram..cause thats what I was doing. It turned out great (don't recomend them now haha). A week later a lymph node felt swolen and have had that before, so thought no biggie. A month later saw my nathuropath. Kids were having appointments so why not check on it. She said to go get a mammogram. They added an ultra sound. And at that time a doc came in and took over the ultrasound exam. We finished with \"I'm sorry to tell you but I believe its malignant.\" :-( So fast forward, I had a core biopsy last week.  They scheduled me before I left after the ultrasound.  My biopsy was positive for cancer. Your's may not be. That is why they do them, because they don't know for sure from the mammogram/ultasound. I had an mri yesterday morning. A surgeon from the hospital I went to called yesterday afternoon and her receptionist said she was going to work through her lunch to see me today. So what a warm fuzzy that gave me...must be bad if the doc is seeing me the next day on her lunch. Makes me mad at them..why not just say, \"We have an opening tomorrow and can go ahead and see you\". I'm scared more from that. So far I have found a few things to help with when I'm feeling like I'm spiraling. Books - Anticancer (alot about nutrition. I am following this and helps me feel more in control. and positive stories). Book - Mind over Medicine (more positive stories). Messages from Yogi green tea bags hehe. (like - Happiness comes when you overcome the most impossible challenges). I'm a bit introverted so reaching out to more friends and telling everyone I know has been helpful. I feel stupid doing it but, everyone I talk to seems to know a cancer survivor (thriver) and that so helps to hear. They also keep checking in with me and letting me know I'm not alone. Make sure your self talk is positive even if you don't believe it at first. Some of it will start sinking in. Write postive thoughts, quotes etc down and read them to yourself when things feel really bad. Don't beat yourself up about your decisions you have made in the past!!!! You went to see the doc when you felt something and you only waited a week or so after finding a lump. You did everything right! Be a good loving friend and tell yourself that because it's true. I have three kids - 15, 11 and 8. We go out for a walk every evening now. Even if i feel exhausted and it always makes me feel better. Ok lol. Sorry some of that was for me too. I'm still scared waiting for this appointment in a couple of hours. It will be ok. :-)",
      "MessageIndex": 4,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/804972",
      "Title": "Completely terrified and having a major anxiety spiral. TwinMamaHeather 38tooyoung"
    },
    {
      "AuthorID": "fireagate",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179395/profile",
      "Content": "May 21, 2013 10:07PM fireagate wrote: Twinmama - More tests. MRI showed something small but suspicious in other breast, so another biopsy next week. Next is a CAT/PET scan to show if it has spread farther than one node. And a blood test for the evil cancer gene. She did say it was possible that it could still be stage 2. So I'm going to be thankful she gave me something positive to focus on. Just a note..my aunt had breast cancer. She felt a lump and it was also in a node and she is cancer free and doing well after 15 years.  Meeting with a couple of oncologists (reg and naturopathic) from a nearby integrative cancer center on Friday. They may suggest another surgeon to speak with. Going to go out for a walk with the kids. Then play planetside2 (video game) with my eldest and drink green tea and enjoy being alive. I already cried my heart out this morning so trying to make that last for a bit. :-) So glad you had a fun day with your boys today!!",
      "MessageIndex": 7,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/804972",
      "Title": "Completely terrified and having a major anxiety spiral. TwinMamaHeather 38tooyoung"
    }
  ]
}