{
  "AuthorID": "Fire1978",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
  "Posts": [
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Aug 5, 2013 01:44AM Fire1978 wrote: hey :) Hope all goes well. Most Surgeons do exicional biopsies the same way a lumpectomy. Its a lump...ectomy is removal. Most dont just take tissue, they remove the whole thing. As most other biopsies are done first and this excisional is to cleary get all the tissue. My \"excisional biopy\" my surgeon who is with swedish cancer institute in Seattle calls it lumpectomy as he is going to get all tisue surrounding and remove lump. I think tomato tamato some times ;p For most surgeons this is the rule: For our surgical team, a surgical, excisional biopsy is considered a lumpectomy. This clearly means we plan to perform a surgical biopsy using the same guidelines for margin clearance that we use for a lumpectomy. In addition, we have standardized the surgical technique so that all our breast biopsies/ lumpectomies be performed using a standard, uniform protocol. http://www.breastdiseases.com/exbxlump.htm Our Surgeons here who I work with also use lumpectomy in wordage, codeing and such. (im a nurse on a med/surg floor) BUT alot of places like John Hopkins has a different view. And they should, im sure alot of surgeons only go in to get \"majority\" of lump, therefor excisional biopsy! lol I go in Wed, and DR is going to remove all of the lump with surrounding tissue (lump is small)",
      "MessageIndex": 16,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/807892",
      "Title": "getting worried now faerie1111 faerie1111"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Jul 27, 2013 03:59AM Fire1978 wrote: becc81..stand strong girl. i feel ya. about wantin to \"know.\" its not but feeling a fraud it could be. I am so mentally strong that it cant be, untill faced with this fear!! I am 5 '2 to! lol standing tall...haha The waiting game sucks, the tests the fears the reality. I dont have the right to say reality...but being diagnosed with stage 1 cervical cancer, not me??!!! I just thought wrong cells...not cancer! I feel like I have a dramatic over reaction  to, like my mind wanst to \"go there\"  but I know its not..then reality hits....somethings wrong and i know it... I am not a drama queen, I dont pretend, i am real. But then what is going on? I hope things are good with you...surgury date is good. Is there a specific lump they can target?!",
      "MessageIndex": 15,
      "PostDate": "27/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Jul 28, 2013 11:17PM Fire1978 wrote: rozem..Thanks for replying. This lump was tiny at first, then has grown to a grape in a year. Mammos do pick up firbroadenomas and they looked extra good, but saw nothing. Different feel fifferent vibe.  Crazy! At least with your inner intuition you didnt ignore it! Hope all is going well? bessie..I know that 80% are B9..of course..I have poured over all the women hear scared because of a lump and it turned out fine. Not too many with similar situation of Fam HX or symptoms, but every womans body is different. You are a wealth of information! lol lintroller derby...you didnt freak me out, yes you are in the minority, but that gap is closing as every year goes by. Sounds like you are intune and were going to go the distance! Im glad you did the genetic testing. I have 4 daughters 17, 13, 10, 9..With my family Hx...They need to know. They also need their Mother!! I was going to just see what local Surgeon said on Monday, but he doesnt know boobs as well and i get the feeling he will order another US...if they still dont see anything then wait and see...MAYBE and MRI. that weeks away. So my previous surgeon who is at swedish breast center in Seattle, i made an apt for this Wed..Feel like I dont have time to wait and see. WHEN this DR says B9. I will beleive him and go on my merry way :P But need that Specialist.",
      "MessageIndex": 26,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Jul 28, 2013 11:30PM Fire1978 wrote: I put off seeing a specialist as i dont have insurance..But they have a program based on income. We make really good money, but ins is $1400 a month out of pocket for really cruddy ins, so we dont do it. We own our own construction Business and I work PRN. But I think %80 will be covered. Wiling to pay out of pocket! Im sorry about losing your Dad :( Mine was killed by a drunk driver. So sudden. Shouldnt happen that way!",
      "MessageIndex": 27,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Aug 3, 2013 11:20AM Fire1978 wrote: Went to Swedish Breast center...My DR from before who is a breast surgeon dealing specifically with Breast cancer, is worried about my \"fibroadenoma\" 2 1/2 yrs ago it was a small oval fibroadenoma. Now it has grown 3x its size has blurred edges all the way around has grown taller than wide. It looks like a small fetus. He said he has never seen a fibro adenoma do that before. And even though core biopsy said B9, that clips were on the edges of tumor, so there could be cancer cells in and around it. excisiona; biopsy scheduled on wednesday. He even got a second opinion from another DR. He doesnt like to just do random exisional biopsies. And they were both worried. AND from my last pathology report, is says some cells CAN be corresponed with fibroadenom and some are aytipical! So DR was pissed local DR's didnt want to investigate further this. I feel in good hands. Hes not doomsday, but hes worried, Im worried about my breast looking funny after this, im worried about cancer that had been missed, and this funny tumor that is funky :(",
      "MessageIndex": 29,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Fire1978 wrote: My name is Shelby. Something is really wrong with my breast. I know it to my core. 3 yrs ago I found a lump in right breast, mammo showed a tumor in left breast. Didnt hurt, didnt ache nada. Ended up being fibroademona. 14 mo ago I started having a achy breast on left side. Within a month I had a pea sized nodule. Achiness getting a little more pronounced. Within months it was size of a grape. Fast forward 14 mo..Burining, pulling aching, irritable inducing lump and pain. And a def feel of something is really wrong..Im a nurse prn, so i dont have Ins (put off mammo) But my hospital offers free womens health fairs, even though im 34, got some strings pulled for a diagnostic mammo and US. They instantly honed in on my previous biopsy spot (im like hello, i dont care about that spot, what about my new lump?) It was a birads of 4(my previouse tumor, it had tripled its size, was taller than wide, spikulated edges, illdefined. Was a perfectly smooth oval with slight spikulation previously. So I had a biopsy. Complex fibroadenoma. B9, ok, move on with your day your fine. WHAT ABOUT MY NEW LUMP!!!! SO I asked my collegue the radiologist to \"humor me\" Im worried about this lump. The one thats painful, burning, aching, getting worse, deep chest tingling lump that has grown???Im fatigued all the time, its not my kids either :)  Plus my maternal gma had BC. And my paternal Gma died of Ovarian. Several aunts and my mom just had a birads 5 mammo. Umm, So he glanced over it, said\" looked like nothing, have a good day\". So I enlisted another Dr who was surgeon, that had some experience with breasts. Consultation was yesterday. He wants to wait to talk to radiologist and see what exactly he saw first. So MAYBE an Mri, most likely a wait and see 6 mo. This is a small community in Wa state. Its probably nothing. I had 5 children with home births, i breastfed them all till they were 3, I am tough. Im an orgfanic nut. I am very in tune with my body! I love this DR...for hernias, ect (hes general) And hes kinda cute :) I love my husband, so im kidding. I happen to feel like i have the best honey. But today i realized im just not comfotable seeing what they have to saY.  So i made an apt with Swedish breast health center in Seattle. For next week. Im supposed to wait to hear from my surgeon on Monday. What if he wants to go forward now with mri?? I have to tell him hes fired? thats a tough position! I get that for small tumors it is harder to go in, to find right tissue and it can compromise \"watch spots\" on further mammo ect. But I need someone who knows. Im SO rambling. As I sit here and hold my breast. Im not a doom and gloom person. But I have this overall scary silence abou this. I knew i was in labor with kids before i had my first contraction. Different vibe in the air, different smell...some 6th sense. I feel like that now. Not overly anxious, just dont want delay. There is a reason more 30 something dies from this disease or find out later when it mets to the bone..brain..whatever. They are not listened to!! But as a healthcare provider, I see so many people who are hypochondriacs, Or have procedures that arnt needed. I dont think its so much the DR's dont \"listen\" I think they just are more aware of statistics and the \"real deal\" And every once in awhile something slips past them, they are human. But I cannot tell my 17, 13, 12, 10, 9 (4 are daughters) That I might die. Has anyone been told to watch and wait? Then go to a different Dr and it was Cancer?? Thanks to all. My hope, love and thoughts go out to all of you women, to your spouses, children and family. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Fire1978 wrote: My name is Shelby. Something is really wrong with my breast. I know it to my core. 3 yrs ago I found a lump in right breast, mammo showed a tumor in left breast. Didnt hurt, didnt ache nada. Ended up being fibroademona. 14 mo ago I started having a achy breast on left side. Within a month I had a pea sized nodule. Achiness getting a little more pronounced. Within months it was size of a grape. Fast forward 14 mo..Burining, pulling aching, irritable inducing lump and pain. And a def feel of something is really wrong..Im a nurse prn, so i dont have Ins (put off mammo) But my hospital offers free womens health fairs, even though im 34, got some strings pulled for a diagnostic mammo and US. They instantly honed in on my previous biopsy spot (im like hello, i dont care about that spot, what about my new lump?) It was a birads of 4(my previouse tumor, it had tripled its size, was taller than wide, spikulated edges, illdefined. Was a perfectly smooth oval with slight spikulation previously. So I had a biopsy. Complex fibroadenoma. B9, ok, move on with your day your fine. WHAT ABOUT MY NEW LUMP!!!! SO I asked my collegue the radiologist to \"humor me\" Im worried about this lump. The one thats painful, burning, aching, getting worse, deep chest tingling lump that has grown???Im fatigued all the time, its not my kids either :)  Plus my maternal gma had BC. And my paternal Gma died of Ovarian. Several aunts and my mom just had a birads 5 mammo. Umm, So he glanced over it, said\" looked like nothing, have a good day\". So I enlisted another Dr who was surgeon, that had some experience with breasts. Consultation was yesterday. He wants to wait to talk to radiologist and see what exactly he saw first. So MAYBE an Mri, most likely a wait and see 6 mo. This is a small community in Wa state. Its probably nothing. I had 5 children with home births, i breastfed them all till they were 3, I am tough. Im an orgfanic nut. I am very in tune with my body! I love this DR...for hernias, ect (hes general) And hes kinda cute :) I love my husband, so im kidding. I happen to feel like i have the best honey. But today i realized im just not comfotable seeing what they have to saY.  So i made an apt with Swedish breast health center in Seattle. For next week. Im supposed to wait to hear from my surgeon on Monday. What if he wants to go forward now with mri?? I have to tell him hes fired? thats a tough position! I get that for small tumors it is harder to go in, to find right tissue and it can compromise \"watch spots\" on further mammo ect. But I need someone who knows. Im SO rambling. As I sit here and hold my breast. Im not a doom and gloom person. But I have this overall scary silence abou this. I knew i was in labor with kids before i had my first contraction. Different vibe in the air, different smell...some 6th sense. I feel like that now. Not overly anxious, just dont want delay. There is a reason more 30 something dies from this disease or find out later when it mets to the bone..brain..whatever. They are not listened to!! But as a healthcare provider, I see so many people who are hypochondriacs, Or have procedures that arnt needed. I dont think its so much the DR's dont \"listen\" I think they just are more aware of statistics and the \"real deal\" And every once in awhile something slips past them, they are human. But I cannot tell my 17, 13, 12, 10, 9 (4 are daughters) That I might die. Has anyone been told to watch and wait? Then go to a different Dr and it was Cancer?? Thanks to all. My hope, love and thoughts go out to all of you women, to your spouses, children and family. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Jul 26, 2013 10:45PM Fire1978 wrote: Thanks bessie...Both of my brothers have not had any issues that i know of, nor would they listen to me if i said they could get BC! And my Uncles have other varius issues. But that I know of nothing except Lupus. I know that out of the many that come here to seek information, most will get to pass on. I really really need to get that test! I have heard of family HX and brca test is negative too. Just never know. I think having stage 1 cervical cancer changed my brain. I am a survivor already. Dont want  a repeat. Cervical cancer is one of the highest reacurring CA out there. They take your uterus, but the cancer might not be gone, It can grow in the walls of your vagina. Come back as Lung CA....ummm anywhere! Most women who have lung ca that did not smoke they are finding cervial cells. Crazy. Dont want this to be anything! I want to be the 90 yr old gardening barefoot with long silver hair..lol Damn it im gonna be! WE ALL ARE Going to be! Can I ask how you are doing? How did you find out? Such strong amazing ladies. Women rock.",
      "MessageIndex": 13,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Jul 28, 2013 11:56PM Fire1978 wrote: becca  you will be fine! Its good you are going in to find out :) Its nice having a community of women to face your fears, excitements with out judgement. Sometimes we just need that \"i hear ya sister\" and talking to each other about it helps. I came on here to not freak myself out or self diagnose..but to listen to others expeirences. Even though they are all different!! Sometimes you can relate to \"how you found out it was BC\" or laugh because you were sooo worried it was and wasnt.. I have been lurking here for about 10 mo And just signed up last week..lol (I didnt freak out in the begginng, i was like ok whats wrong with my boob...but then was so busy. NOW, its a different feel. For sure. As this journey has been along one so far, it is not the worst one ive had. I used to race Motocross and 5 yrs ago was in a very bad accident. I looked down at my leg...Ankle bone was 5 ft from me, foot was backwards and obvious other breaks. I was going through a nast nasty divorce after 12 yrs. Single mom of 4 kids..After that accident I lost my Job, my benifits, couldnt walk for a year, developed a to the bone pressure sore on leg..I was executer of Grandmas will and in a nasty legal battle with my Mom and bros, who wanted more Money. LOL IT WAS HORRIBLE! But I was able to sell my house before power was shut off, bout Property in Hoodsport WA. In One of the most Beautiful places. Salt water, gorgeous Mt fed lake. rIght near Olympic MTs I can see them. Found the LOVE of my life my true soulmate, remarried. Walked again, found a new job. Kids are healthy and happy. Ex is happy and remarried. Life is to short. THAT was a dark place for a minute, Someone on here said (not that they liked cancer) but it was a postive change, they were able to learn how to help others and felt fufilled. I have my small moments of fear. But 90% I'm very calm, like abnormally calm. Because face it....what else can I do? lol No way to escape the waiting game. So I stay busy with my 5 kiddos, drink wine with my Husband...Garden. And when that fear comes I embrace it. It would be weird to ignore a feeling, or be put down by it. Sometimes you just need to think the worst for a minute..imagine it. Then imagine what you would do if it were true. Go as deep as your mind wants. Then snap out of it. You dont know. worst that can happen is BC. Then you have options, life doent stop. My husband and Son do Motocross (Husband races professionally) So hot! lol but anyway...I met this Gal who came over to borrow sunscreen at the track...She had just started growing her hair back. She was stage 3b. She said \"what can you do? Waiting sucks, but what can you do about it? Nothing. Just keep moving on\" Anyway im rambling..lol",
      "MessageIndex": 28,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Jul 26, 2013 08:20PM Fire1978 wrote: thanks ladies, I am a little nuts right now. My  complex fibroadenoma was a birads 4. They didnt see this lump on us or mammo, the one im worried about. My 2 great aunts and gma had breast cancer, one ovarian CA 5 yrs after beating breast. Gma ending up dying of ovarian. My maternal gma had breast ca at 42. And my 2 aunts, one has breast one has ovarian. My mother is now going through lumpectomy for issues they found last week on mammo. Ive been told I need to do the brca testing, but its 5,000 out of pocket. So strong family hx. Maybe thats why im worried. this new lump is not showing up on screens, but can be felt. I definetly dont want to step on toes with my dr's here as i work with them! So I will see what they have to say first. I agree fear and imagination is the evil af all evils. The surgeon i saw has been practicing for 5 yrs, mostly gastro surgerys!! And hernias, few cases of breasts. The radiologist just made the move from family practice to radiology few years ago. There is not alot of experience here. As a nurse of 14 years I maybe have seen too much! Thanks for responding. I bet its hard to listen to people who \"are worried\" when you all are fighting something deeper now. Thanks for being strong! Stinking cancer, I was lucky in 2007 I was stage 1 cervical cancer. Just a hx no need for radiation or chemo. But i left my ovaries as being on hormones whith a possible genetic factor, they wouldnt even put me on them! But strong hx of ovarian, so that was a gamble!",
      "MessageIndex": 7,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Jul 26, 2013 10:36PM Fire1978 wrote: I hear alot of women say their breasts are fibrocystic. Mine arnt at all...Clear babies they are. So fibroadenoma (the original) was out there clear as bell. The 2nd mammo was out their clear as well. Nothing else. But had so drastically changed in 2 years they thought malignant. A complex fibroadenoma is different than regualr. The cellular changes can cross over to CA, as a normal wont. BUt this lump that is where it shouldnt be , did not show up. I have never ever ever had weird breasts, no pain with menstration, no pain with pregnancies, nothing ever. Not with first lump, didnt even know it was there! I know  you obviously know more about this than I have so far, so I do have alot of apprehension. My Gma never smoked pot she was a very straight laced woman. But when she was battling stage 4 BC, her mouth sores were too much and she couldnt eat. She was able to through smoking, the nausea was so much better. It is hard when you are 20 and pregnant searching for the \"bud\" that fell on the floor..lol We laughed about it. Was so weird. I have seen my fam in despair. Many aunts and grandmas battle through this as well as Ovarian CA...which stage 4 of that is a certain ending. And maybe that is contributing. 5-10% of breast cancer is hereditary. That is 5-10 women out of 100. They get these statistics from somewhere. We just all think it cant happen to us! Or we wont be that statistic, 90% it wont be me, im not looking for trouble where trouble doesnt belong, but still....... I love My Aunt Bert, Aunt ester, Aunt doris, Aunt rhonda, My Nanny, and my Moms Biological mom. I never met her, my mom was adopted, but we know She was native american and was diagnosed with BC before she got pregnant at 42. SO she put my mom up for adoption, this was her 4th baby, and from what the dr told my mom ( in 57' you didnt say much because was so private) That she didnt have it in her to raise another baby. We dont know if she died and made the ultimate sacrifice so my mom wouldnt have to be motherless. or not. Will never know. Ok im going to deep! Dutchie, how did you find out if you dont mind me asking?",
      "MessageIndex": 12,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Jul 28, 2013 03:12AM Fire1978 wrote: Mistytee, I didnt even realize I had one! 4 yrs ago I found a lump in right breast..and because of family HX they did a mammo. And found the fibroadenoma in left breast..had no clue! Looked suspicious though so they did biopsy. Now with new lump I have that I feel and is worrisome, they saw the previous biopsy spot and it was sooo dramatically different looked malignant, but was a complex fidroadenoma. Honestly didnt know that was there still! From what I know, they can be firmer or movable a little....Sorry I know that doesnt help! Lump is a lump is a lump and we just want to \"be sure\" !!",
      "MessageIndex": 19,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    },
    {
      "AuthorID": "Fire1978",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179454/profile",
      "Content": "Jul 26, 2013 10:14PM Fire1978 wrote: Mellisadallas, my mom had an instant umm more views moment, and dr said hes pretty sure its malignant (obviously he cant just tell) but shes put off her mammo with a lump . not painful for 4 yrs. She went in because of my issues with this new lump. She said she knew and didnt want to hear it so she waited.like it would go away. I made her go. I dont have sisters, just brothers. So I have had a dr tell me that if its not immediate than its pretty much ok. But I dont have immediate with all these boys haha. Im very sure that so many people have had concerns and history and it is ok. And there is still a great chance this is B9. I need to focus on that! thanks! Dutchie, thanks. Thats why im worried. Maternal Hx and paternal. Both sides. But im sure it will be ok. You had a strong HX?",
      "MessageIndex": 10,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808361",
      "Title": "how many people just \"knew\", and was it ? Fire1978 zoemiapepper"
    }
  ]
}