{
  "AuthorID": "firework106…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161919/profile",
  "Posts": [
    {
      "AuthorID": "firework106…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161919/profile",
      "Content": "Nov 18, 2013 11:27PM firework1068 wrote: a month after turning 49. 2 years ago!",
      "MessageIndex": 37,
      "PostDate": "18/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "firework106…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161919/profile",
      "Content": "Oct 5, 2012 09:33PM firework1068 wrote: Frapp, Everyone is different so the choice you make will be the right one for you. I decided to have a Bi-lat Masectomy for a few reasons....first of all, my tumor was es+as well as HER2+. Secondly, I wanted to avoid radiation at all costs! and finally, it was important to me to have symmetry once I had reconstructive surgery. I was given the research from my onc and surgeon but the decision was mine. With my dense breast and history of cyst, aspirations blah blah.....I knew having them both removed was the right decission for me. Good luck with the surgery. Keep us posted. Blessings, Lorraine",
      "MessageIndex": 43,
      "PostDate": "05/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794390",
      "Title": "Sitting at DF waiting for results Frapp Frapp"
    },
    {
      "AuthorID": "firework106…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161919/profile",
      "Content": "Dec 17, 2012 08:55PM firework1068 wrote: Mr and Mrs Five Alive, ((((hugs)))) to both of you. I wonder if the planning Christmas events helps to occupy her mind? Sounds like she's a very smart woman, probably needs the stimulus! I hope by now she's decided to opt for pain meds......it's true that the stress of pain affects healing. I'm just hopeful you both will be able to enjoy the Holidays.",
      "MessageIndex": 19,
      "PostDate": "17/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797691",
      "Title": "Mrs. Five Alive in Hospital FiveAlive lilylady"
    },
    {
      "AuthorID": "firework106…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161919/profile",
      "Content": "Oct 5, 2012 10:52PM firework1068 wrote: Yay! Stage 1 sisters! Hello my people, it's great to have our own forum. I spend time perusing the other sites for information because they sure know their stuff. It's so hard when they lose someone.....our stageIV sisters are truly inspirational. Having said all that......Since June 2011.... stage 1, grade 2, er+,pr-' HER 2 positive. Bi-lat MA, port, expanders, 6 chemo, Nuelasta and 52 weeks of Herceptin, exchange surgery and now having a reconstruction \"do over\" at the end of this month. I'm on Arimidex and suffer from painful joints and bones...weight gain (muffin top) +17lbs. Walking everyday and swimming as often as possible. What would you all like to talk about?",
      "MessageIndex": 13663,
      "PostDate": "05/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}