{
  "AuthorID": "FiveAlive",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
  "Posts": [
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Oct 24, 2011 09:26AM FiveAlive wrote: Joanne_L, I agree with what others are saying about something not sounding right about the treatments you are receiving if it truly is Stage IV.  For your sake I hope it is simply just a misunderstanding of your oncologists explanation of your status.  Assuming you are going to the Cancer Clinic at the Ottawa General, I have nothing but praise for the oncologists working there.  Ask them if you truly are Stage IV and why they think that.  Your pathological report and MRI/CT scans are the best source for the answers.  Identifying your current Stage was no doubt completed.  You just need to confirm it with the onc.   http://www.breastcancer.org/symptoms/diagnosis/staging.jsp",
      "MessageIndex": 53,
      "PostDate": "24/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776744",
      "Title": "Should I ring the bell? Joanne_L susan_02143"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Feb 26, 2013 05:21AM FiveAlive wrote: So very sorry to hear this Sheff's husband.  My sincere condolences.  Sadly, she passed away before she saw my reply to her question on my own wife's condition...who died two days before Sheff.  :-(",
      "MessageIndex": 38,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801017",
      "Title": "Sheff is an Angel Sheff dawny"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jun 13, 2011 08:42PM FiveAlive wrote: I hope there are many others here who will follow in your footsteps and dance along!! 1, 2, 3, cha cha cha!! Great news!!",
      "MessageIndex": 46,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770269",
      "Title": "the Dancing has begun susan_02143 K-Lo"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Aug 19, 2012 09:38AM - edited Aug 19, 2012 09:41AM by FiveAlive So very sad.  Rest In Peace Dawn.  Condolences and best wishes to her family and close ones.  :( This link should work:  http://marysvillefuneralhome.com/obituaries/watza-dawn-1940/watza-dawn-1940-obituary",
      "MessageIndex": 11,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792209",
      "Title": "China (Dawn) is an angel Frapp bhd1"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Mar 17, 2011 12:26AM FiveAlive wrote: Denis & Lynn, our thoughts are with you.",
      "MessageIndex": 79,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765945",
      "Title": "The verdict is in Bernicky lwd"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Mar 12, 2012 02:03PM FiveAlive wrote: Thank you Kim for sharing that news.   Our deepest condolences to her family and friends...we  have lost yet another person to share stories with on this forum but she will always be in our hearts. ",
      "MessageIndex": 36,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784030",
      "Title": "A sad update on Suze 35 Suze35 Janie-bug"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jun 6, 2011 06:34AM FiveAlive wrote: 66.  Thinking of you as a fellow Ottawan and hope things are OK.  {{{KK}}} ",
      "MessageIndex": 334,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Dec 14, 2012 04:44PM - edited Dec 14, 2012 04:45PM by FiveAlive Well, Mrs. Five Alive (Monique) officially started Halaven yesterday...and not a minute too soon.  The Xeloda/Gemzar routine had to be abandoned two weeks ago because it outlived it's effectiveness.  Halaven (eribulin) is still on trials here in Canada but she was extremely lucky and was literally the last one (of 21) approved for the trial at her hospital.  Unfortunately things were starting to take a wrong turn in the last week so hopefully this can reverse some of it. The ascites is growing, abdomen/liver pains, pains all throughout the bones, tiredness itching all over, low grade fever last night, bilirubin shot from 10 to 23 in one week.  And the Halaven side effects are so similar it will be hard to tell when they kick in.  4mg of hydromorphone every few hours is helping though.",
      "MessageIndex": 1154,
      "PostDate": "14/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jun 10, 2011 05:13AM FiveAlive wrote: Yes, that is no doubt her. I feared the worst when I read her last messages about Hospice,  Awww man.  Why is it the people I am following so closely are the ones falling by the wayside. May she forever find comfort in the arms of the angels.  So sad...",
      "MessageIndex": 10,
      "PostDate": "10/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770129",
      "Title": "BeckyOD sincitydealer Lena"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Dec 16, 2012 02:38PM FiveAlive wrote: Thanks for the info K-Lo.  Well,  I am sad to report that Monique is now in the hospital.  It certainly does not seem to be related to the Halaven so I won't scare people off by posting much about it here.  I will explain it more here:  Mrs. Five Alive in Hospital",
      "MessageIndex": 1156,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Sep 8, 2011 11:07AM - edited Sep 8, 2011 11:10AM by FiveAlive LC815, you have been missed:  Another person gone missing: LC815 Please know that many of us care and are thinking about you.  Sending you nothing but positive thoughts.  (((LC815)))",
      "MessageIndex": 25,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774363",
      "Title": "Home Hospice and waay in the dumps. LC815 sincitydealer"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Dec 19, 2012 06:43AM FiveAlive wrote: Thinking of you lukejessesmom.  Halaven does add more time for those it works for.  Just getting to and thru treatments seems to be the problem because it tends to be a later stage chemo.  Sending positive thoughts.",
      "MessageIndex": 22,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797789",
      "Title": "Finally Home but the News is Not All Good lukejessesmom SusanR"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jun 14, 2011 02:04PM FiveAlive wrote: Mark, I followed your story as well...my condolences to you and your family.  I wish you all the best as time goes on.",
      "MessageIndex": 22,
      "PostDate": "14/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770302",
      "Title": "Finally at rest luvmywife irish22"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jun 17, 2012 10:53PM FiveAlive wrote: No we have not tried Gemzar yet Penny but it is a name that keeps coming up so we will see if the onc agrees...especially if it is good for liver mets.  Carbo/Taxol worked fine from Jan-June 2011 and was restarted in November 2011 after things went downhill again.  But here we are in June 2012 and the cancer is winning this time around.  Will keep you all posted what is prescribed next and its success.  Thank you.",
      "MessageIndex": 5,
      "PostDate": "17/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789152",
      "Title": "Carbo/Taxol People: Question FiveAlive FiveAlive"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jun 30, 2012 12:14AM FiveAlive wrote: Well, the oncologist finally gave in today after the latest scan so it's no more Taxol/Carbo.  The scan showed all liver mets increasing in size, two doubling in size (to 26mm and 32 mm respectively) and several new ones appearing.  The abdomen soreness and two \"hard spots\" are a constant reminder that this thing is rearing its ugly head again. Next week begins Gemzar and Xeloda....and the battle goes on... ",
      "MessageIndex": 7,
      "PostDate": "30/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789152",
      "Title": "Carbo/Taxol People: Question FiveAlive FiveAlive"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "FiveAlive wrote: I thought I should post this as a new Topic since after only one treatment of Halaven and pre-existing conditions I did not want to mess up that thread as to it being a Halaven side effect. It would appear Monique has SBP (Spontaneous Bacterial Peritonitis) due to the portal hypertension and cirrhosis.  I brought her to hospital Friday evening with a high temperature and pain in the abdomen.  They now have her on antibiotics specific to SBP and although the pain is still there she decided to stay off the pain killers because of the constipation.  Unfortunately these symptoms had started just before her first Halaven treatment and the oncologist has said she likely won't get her second treatment this week.    That's a bummer because there are not a lot of treatment options left and we were hoping Halaven would do the trick.  The ascites, SBP and itching are showing where this thing is at but if we can get more treatments and the Christmas gathering it would be OK.  We are at 4.5 years...and still hoping for at least 5 alive. Husband of Stage IV wife. Only one in five survive to five...we are hoping for at least Five Alive. Liver and bone mets. Dx 7/4/2008, IDC, 2cm, Stage IV, Grade 3, 3/13 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797691",
      "Title": "Mrs. Five Alive in Hospital FiveAlive lilylady"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "May 16, 2011 03:10PM FiveAlive wrote: I was just in Manhattan last week for the first time and loved it.  The weather was better than this week but you should should be able to keep busy and entertained without getting too wet.  Some suggestions: - buy a 1 week subway pass for $29 (all you have to know is whether the train is going uptown or downtown and whether it is a local or express. Just ask for one of the subway maps at any station).  You will save a lot of your precious energy, have a lot of fun and it is always safe. -enjoy the sights and sounds of Times Square. It's always busy with shopping and restaurants. - go on one of the sailboat cruises and see the Statue of Liberty -walk across the Brooklyn Bridge.  It's only about half an hour and gives you a beautiful view of the downtown skyline.  I took the subway to Brooklyn, walked the Brooklyn Heights Promenade and then walked back on the bridge to get the subway back to Times Square.  Once in a lifetime experience!! - walk or bike (lots of rentals) in Central Park. - beside Central Park is the American Museum of Natural History (good for a full day of visiting if you want.  It's suggested price is $26 but I offered them $10 and there was no problem at all). -go to the Top of the Rock (top of the Rockefeller Center close to Times Square.)  You will have the best view ever of the Empire State Building, Central Park and all of downtown. - go for the worlds most decadent sundae at Serendipity III. - go to the Chelsea Market for the freshest of anything you would ever want. Have Fun!!",
      "MessageIndex": 6,
      "PostDate": "16/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769039",
      "Title": "I'm in a New York State of Mind FightnF8 Kay_G"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Feb 23, 2013 08:22AM FiveAlive wrote: Thank you for your concern Sheff. It is with heavy heart that I announce my dear Monique passed away peacefully two days ago after her long battle with breast cancer.  So, contrary to the name I chose here, she did not quite make it to five alive...which statistically was working against us.  Her two last chemo treatments (Halaven) landed her in hospital...the second time for two weeks.  Her liver having had enough chemo treatments. She was never the same when she got out this last time.  It was long days and nights for both of us and she began deteriorating mentally and physically as each day passed. Her saving grace was that she became less and less aware of her surroundings as things progressed.  We are not sure whether it was the toxins building up in the brain or perhaps mets to the brain...but in the end, it did not matter.   We finally had her admitted to a hospice, after some great home care, on February 11.  She knew where she was going and she was OK with that.  She was surrounded by family at all times except overnight.  Three days ago her doctor told us she had 24-72 hours left.  I chose the first shift of 11:00 until morning.  Her breathing was at the Cheyne-Stokes level and we were told this could go on for days.  At 4:00 a.m. the nurses came in to turn her and give her a regular shot of hydromorphone.  At 5:00 a.m. her breathing had changed to a more calm level. I nodded off and at 6:00 a.m. the nurse awoke me to say she had a weird feeling Monique had just passed and in fact, she had.  6 was a significant date in our relationship...from our first talking to each other to our first date and so on.  It was almost a signature good bye-from her. She will be dearly missed by myself and many others.  Here is a link to her death notice and a picture of her at her 50th birthday celebration.  She did not know at that point it was Stage IV.",
      "MessageIndex": 1,
      "PostDate": "23/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800719",
      "Title": "Mrs. FiveAlive? Sheff GatorGal"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Feb 11, 2012 10:27AM FiveAlive wrote: Well, for those who want to hear it, here is a males perspective.  I hope I don't get attacked. We love you women!!  It's as simple as that.  It doesn't matter if you are bald, breastless, or fatigued all the time...we still love you!!  If it was only about the sex we would just marry Kimberly Clark (the makers of Kleenex) and not need you and your nurturing minds and loving bodies.  But this is not the case.  WE need the warm caring woman and because of our physical need for sex, the two go hand in hand.  Unfortunately nature does not make us lose much of our sex drive until much past when you lose yours.   So what are we supposed to do?  It's a natural thing, we want it, and yes, contrary to what you may think, we NEED it.  I will be candid here and say my wife and I have not had sex in 3.5 years because of all the cancer crap.  Before that the sex was great!!   To say \"I don't need it, so why do you?\" is unfair but I DO understand that if you really are not capable, why fake it?  We sense it and we might as well go see Kimberly then. I cannot propose a solution to anyones problem here (although that Scream Cream may be worth mentioning to her...but at this point it's just as much a mental as physical thing for her).  I know this won't last forever for me and until the day she sadly is gone, I will remain her ever loving husband and remember all the good times we had in the bedroom before cancer and menopause.  Meanwhile, we husbands will love and care with the patience you would have if we were sick.  Best of luck to all you ladies and know we love You!!",
      "MessageIndex": 75,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Nov 9, 2011 03:04PM FiveAlive wrote: Thank you for your kind replies.  We sincerely do hope this round of chemo works again.  My understanding though is that this \"not-so-lovely\" cancer mutates itself and becomes stronger and more resilient as time goes on.  She had a 50 percent reduction in tumour size the last time around but it sure came back with a vengeance, as we found out, over the last six months with the chemo break. The previous scan 3 months ago showed a \"mixed result\", meaning some were larger and some were smaller.  She had a visit today from the home care nurse and some of the important questions are starting to be asked like whether she wants to go to a palliative hospital or die at home.  She asked my opinion and I told her it's totally up to her wishes.  It looks like she will be choosing to have her last days at home, near her sunroom and the bird feeders, which is fine.  She will be around familiar surroundings and it will be much more convenient for family and friends to visit I believe.  The onc told me the other day to make sure my employer is aware of the situation so that I can make plans for my work.  It's all a bit surreal right now as it feels like something has shifted.  Our cat, that's her in the avatar, has even been acting strange.  She has been wanting to paw at my wife's abdomen the last little while (declawed thank goodness) and even jumped on it twice now...which is something she has never done.  You can imagine how much that made her jump with the pain she is feeling.  Anyway, we continue to live day by day and hope for the best.",
      "MessageIndex": 14,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777801",
      "Title": "No Five Alive FiveAlive Traci-----TripNeg"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Feb 25, 2013 12:27AM FiveAlive wrote: Thank you all for your kind words.  The hardest part is going thru the old photographs that will be shown at the service.  I could see thru the pictures that much of her \"joy of life\" seeped by as the years went by and yet she fought with all her might to beat this.  But, although her quality of life did spiral down from diagnosis, she did gain some more time with us because of the treatments...and I am thankful for that at least. I hope for only the very best for all of you fine ladies.  I will be thinking of you always...as I will my Monique.  Damn this stupid cancer.  There has to be a solution out there. ",
      "MessageIndex": 42,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800719",
      "Title": "Mrs. FiveAlive? Sheff GatorGal"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Mar 19, 2011 12:25AM FiveAlive wrote: Don't look at it as giving up Pee.  You are fighting the good fight and are still in control.  That's what is important.",
      "MessageIndex": 20,
      "PostDate": "19/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766342",
      "Title": "I have quit all chemo pee FightnF8"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "May 24, 2012 10:57AM FiveAlive wrote: So very sorry to hear your news.  May your memories of her carry you and give you strength at all times.",
      "MessageIndex": 50,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787974",
      "Title": "My Daughter is Gone Joyce4123 bevin"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "FiveAlive wrote: \"There is favorable interval response with significant decrease in the size as well as number of multiple hepatic metastasis.  Findings are suggestive of partial response as per RECIST criteria\". Well those are the golden words we were waiting for from her latest CT scan and my wife was extremely happy to hear them yesterday (as was I of course).  She is officially off chemo for the time being and on to Femara in the meantime.  Summer will be so much more fun now. Now it's cross the finger time and hoping they don't come back with a vengeance which I hear they can.  Into year 4 since diagnosis...and counting on more hopefully. Husband of Stage IV wife. Only one in five survive to five...we are hoping for at least Five Alive. Liver and bone mets. Dx 7/4/2008, IDC, 2cm, Stage IV, Grade 3, 3/13 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770104",
      "Title": "One step forward... FiveAlive ibcmets"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "May 1, 2012 08:48AM FiveAlive wrote: My wife was diagnosed with breast cancer in June of 2008 and by the time they did liver scans it was the Fall of 2008 before they determined it was also in her liver.  They figure she had the breast cancer about a year before she was diagnosed.  She also is ER+/PR+ Her2- like your Mom and here we are almost 4-5 years later (depending on where you start counting from).  Although her liver enzyme levels are starting to creep up even while on chemo, we remain hopeful that if this one is no longer working then there will be another chemo to try.  Carbo/Taxol combination is what's working best for her but no guarantee as to which one might work for your Mom.  Keep positive and enjoy her presence as we should all enjoy our loved ones.",
      "MessageIndex": 6,
      "PostDate": "01/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786672",
      "Title": "Stage IV breast cancer spread to liver. manmieyol FiveAlive"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "FiveAlive wrote: We were hoping to be on the positive end of the \"Five Year\" statistics for Stage IV but it looks like it is not to be. Two weeks ago, after my wife came home from her two week Hawaiian cruise with her Mom, I knew things were not right.  We met with the onc two days ago and the latest scans confirmed the worst.  \"Liver is studded with metastatic lesions involving both lobes and all segments.  There is marked progression when compared with the prior examination.  There is significant mass effect from these lesions causing effacement of hepatic and portal veins\".  And it just goes on from there.  Her LFT's are way off the chart.  We thought her bloating was from ascites but the oncologist says it is the liver itself at this point.  She has immediately gone back on the Carbo/Taxol regime which worked previously and had the first treatment yesterday.  Now it's just a matter of crossing our fingers for more time.  The doctor said if the chemo does not work or had she decided not to do chemo she would be \"getting very sick in several weeks\".  I wish I had better news but it is what it is. Husband of Stage IV wife. Only one in five survive to five...we are hoping for at least Five Alive. Liver and bone mets. Dx 7/4/2008, IDC, 2cm, Stage IV, Grade 3, 3/13 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777801",
      "Title": "No Five Alive FiveAlive Traci-----TripNeg"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jan 11, 2013 09:22AM FiveAlive wrote: We are very sorry to hear this latest update about Apple.  Our thoughts and prayers are with her and her family. :(",
      "MessageIndex": 179,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798177",
      "Title": "Has anyone heard from Apple? marie5890"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "FiveAlive wrote: I thought I should post this as a new Topic since after only one treatment of Halaven and pre-existing conditions I did not want to mess up that thread as to it being a Halaven side effect. It would appear Monique has SBP (Spontaneous Bacterial Peritonitis) due to the portal hypertension and cirrhosis.  I brought her to hospital Friday evening with a high temperature and pain in the abdomen.  They now have her on antibiotics specific to SBP and although the pain is still there she decided to stay off the pain killers because of the constipation.  Unfortunately these symptoms had started just before her first Halaven treatment and the oncologist has said she likely won't get her second treatment this week.    That's a bummer because there are not a lot of treatment options left and we were hoping Halaven would do the trick.  The ascites, SBP and itching are showing where this thing is at but if we can get more treatments and the Christmas gathering it would be OK.  We are at 4.5 years...and still hoping for at least 5 alive. Husband of Stage IV wife. Only one in five survive to five...we are hoping for at least Five Alive. Liver and bone mets. Dx 7/4/2008, IDC, 2cm, Stage IV, Grade 3, 3/13 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797691",
      "Title": "Mrs. Five Alive in Hospital FiveAlive lilylady"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jan 6, 2013 09:28AM FiveAlive wrote: Well, Monique had another go at Halaven two days ago and guess what?  She's back in hospital.  The symptoms started again shortly after they administered it on Friday.  Abdominal pain and rising fever .  At 39 degrees C (102 F) she was admitted immediately in the emergency last night.  It may not be so much a reaction to the Halaven (which was reduced 20 percent from the first attempt) as, according to the nurse, her liver is having a tougher time dealing with any chemo since there are so few good cells left.  Not sure what the next step is at this point.  I have been marking down her energy levels (out of 5) since December 19 and there is a definite pattern.  She hits a low of 0 (awake only a few hours and in discomfort) and gradually gets up to a 4 day before she hits rock bottom and starts climbing again. Amazingly she did hit a 4 on two important days (Christmas and up to midnight on New Years eve).  But then she hits that low right after.  Obviously we are back to 0 again.",
      "MessageIndex": 35,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797691",
      "Title": "Mrs. Five Alive in Hospital FiveAlive lilylady"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jan 18, 2013 03:52PM FiveAlive wrote: 13 days later and Monique is finally out of the hosptial (again) for the second time in less than a month.  Her neutrophils went down to 0 for 4 of those days but Neupogen brought them up after two shots (and much bone pain).  She was on non-stop antibiotics and she has come out a much different person because of all this.  She is barely walking or talking she is so exhausted.  Was it the Halaven?  Like I just posted on lukejessesmom's thread, it could have been but who knows any more.  Yes it was likely a reaction to the chemo but they think it could be any chemo doing it at this point.  They had already reduced this one by 20% and waited 3 weeks.  She has told the onc she wants no more chemo's unless he can guarantee she won't end up in hospital...but of course he can't and I'm sure she knew he would say that.   So where do we go from here?  Well, we have a Case Worker coming to visit next week about hospice options.  The proposed Aromasin + Afinitor could be effective or maybe not...the lady beside her in hospital was there with permanent lung scarring here from it, and I know from reading here that is not an isolated incident.  Stupid cancer.",
      "MessageIndex": 50,
      "PostDate": "18/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797691",
      "Title": "Mrs. Five Alive in Hospital FiveAlive lilylady"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "FiveAlive wrote: Mrs. Five Alive is no longer responding to Carbo/Taxol after 8 months of treatment.   Is there anyone  who has had a similar situation (where it did work at one time) but moved on to a chemo that provided more hope?  We are just looking for suggestions that can be brought up with her oncologist.   Thank you. Husband of Stage IV wife. Only one in five survive to five...we are hoping for at least Five Alive. Liver and bone mets. Dx 7/4/2008, IDC, 2cm, Stage IV, Grade 3, 3/13 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789152",
      "Title": "Carbo/Taxol People: Question FiveAlive FiveAlive"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jul 8, 2012 10:31AM FiveAlive wrote: Sorry for my late response, we have been away at a cottage for the week.  Coolbreeze, the tumours are \"numerous\" according to the scan results and they usually only talk about a few in each scan.  I find it odd that every scan talks about differents mets in different segments of the liver.  I'm afraid to ask to see the actual scan but I might do that next time.  Depending on the treatments over the last four years we have heard numbers as big as 8 cm but now they are tending to blend together in the scans so who knows.  Overall she does not feel bad but tiredness and weakness as well as the increasing soreness/swelling of the liver are the main issues.  Liver ablation was never an option because she has always been fighting too many mets to make the procedure worthwhile.  Same with RFA apparently.  There are mets in a couple of her vertabrae but those seems to be stable at the moment.  I think her onc and her went with the mixed chemo's because at this point she can't afford the 2 or 3 months it takes to find out if it's working with just one.  So, tomorrow is the start of Xeloda and Gemzar...and more finger crossing.",
      "MessageIndex": 11,
      "PostDate": "08/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789152",
      "Title": "Carbo/Taxol People: Question FiveAlive FiveAlive"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "FiveAlive wrote: We were hoping to be on the positive end of the \"Five Year\" statistics for Stage IV but it looks like it is not to be. Two weeks ago, after my wife came home from her two week Hawaiian cruise with her Mom, I knew things were not right.  We met with the onc two days ago and the latest scans confirmed the worst.  \"Liver is studded with metastatic lesions involving both lobes and all segments.  There is marked progression when compared with the prior examination.  There is significant mass effect from these lesions causing effacement of hepatic and portal veins\".  And it just goes on from there.  Her LFT's are way off the chart.  We thought her bloating was from ascites but the oncologist says it is the liver itself at this point.  She has immediately gone back on the Carbo/Taxol regime which worked previously and had the first treatment yesterday.  Now it's just a matter of crossing our fingers for more time.  The doctor said if the chemo does not work or had she decided not to do chemo she would be \"getting very sick in several weeks\".  I wish I had better news but it is what it is. Husband of Stage IV wife. Only one in five survive to five...we are hoping for at least Five Alive. Liver and bone mets. Dx 7/4/2008, IDC, 2cm, Stage IV, Grade 3, 3/13 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777801",
      "Title": "No Five Alive FiveAlive Traci-----TripNeg"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Dec 31, 2012 07:54AM FiveAlive wrote: Sure missing our Apple a day.  Wishing you well Apple.",
      "MessageIndex": 14,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798177",
      "Title": "Has anyone heard from Apple? marie5890"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jan 7, 2013 11:24PM FiveAlive wrote: Thank you Michelle for posting that. Apple, please know that we would all really really miss you if you fall out of the tree of life. Please hang in there and know that our positive thoughts are with you. Mitch & Monique",
      "MessageIndex": 92,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798177",
      "Title": "Has anyone heard from Apple? marie5890"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jun 23, 2011 10:08PM FiveAlive wrote: So very sad.  My condolences go out to all of her family and friends.  There are no words to describe the unfairness.",
      "MessageIndex": 76,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770458",
      "Title": "Liver Done jleigh PizzaDad"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jun 9, 2011 10:04PM FiveAlive wrote: Thank you, thank you. Yes, we can now enjoy the plans we made for the summer (chalet in the Muskokas, condo at Mont Tremblant, visiting friends in eastern townships etc.) and she has made some more tonight by booking an October cruise to Hawaii with her Mom and girl friends.  She said \"I hope I am doing the right thing\" and I told her to go for it because she deserves it. Here's to hoping the Femara does its job of taking care of the estrogen.  I have to cross my fingers and toes for her because she can't due to all the neuropathy with the latest cycles.   Thanks to all those who do the same!! It's all good! ",
      "MessageIndex": 19,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770104",
      "Title": "One step forward... FiveAlive ibcmets"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Dec 18, 2012 09:50PM - edited Dec 18, 2012 09:52PM by FiveAlive I think that everyone's good thoughts are working....mostly anyway.   First the good news.  Monique is being released from the hospital tomorrow. They have unplugged her from the Piperacillin and Tazobactam (for the peritonitis) and she will be going on the same but in pill form.  She is still very weak and tired but the pain has lessened in the abdomen and her fever is gone.  A good friend of hers has advised, like some of you...to take the pain killers.  This friend had to go to pain managment sessions because apparently the effectiveness of pain killers can be diminished by waiting too long to take them.  Lesson learned.   Also the C-diff going around was not what she had so that also is good news.   Now for the not so good.  In the words of the oncologist she saw today about the CT scan yesterday, she was told \"your liver is pretty well shot\".  Thats the first time we have heard something so blunt when it comes to the liver status.  So much for the nice \"previous lesion of 2.5 cm is now 3.5\" that we usually see in a report.  She also gave a bit of \"the talk\" and said to \"make sure your affairs are in order now\".  Because Monique's blood work is all in the dumps at the moment there is no chance of another chemo treatment until at least January 3rd.  She would be starting her #1 Halaven again at that point.   But right now...we are just both happy that she will be coming home and that the Christmas dinner that she has been so diligently planning will happen.  She always does a theme when it's our turn and this year it's all about rainbows...as in pot of gold at the end of it.  I will post some pics at some point to show the extent of the rainbow colors all over our house. Yes I do take some time for myself also but understanding this dreadful thing called BC and reading the good advice on this forum keeps things in perspective and really does help me be supportive and still retain my sanity.  Cheers, Mitch ",
      "MessageIndex": 27,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797691",
      "Title": "Mrs. Five Alive in Hospital FiveAlive lilylady"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jan 18, 2013 04:17PM FiveAlive wrote: Thanks LuAnnH for the positive news for A + A.  I have had others do the same and my hope is that she can at least get strong enough to get started on it.  My little Trooper is showing how weary she is from this battle and whatever can help next needs to not be hurting at the same time.  But alas, there are no guarantees for anything it seems...just hope I guess.",
      "MessageIndex": 52,
      "PostDate": "18/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797691",
      "Title": "Mrs. Five Alive in Hospital FiveAlive lilylady"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Nov 14, 2011 02:15PM FiveAlive wrote: The support in this forum never ceases to amaze me...thanks everyone! Well, tomorrow is dose number two of this regime of the Carbo/Taxol and we are still optimistic.  Monique's biggest battle right now is the pain in her liver and keeping food in.  She is on hydromorphone for the pain but only takes one a day before bed so she can get a few hours sleep.  She seldom gets more than a few solid hours of sleep a night...and hasn't for a while.  She is often very weak and although she moves around when she is not lying down it seems everything is an effort.  Even her breathing when she is tired seems forced.  I have read that is one of the side effects of the hydromorphone (as well as her dizziness) but it worries me because there is not always someone around during the day and she is not one to call me often at work.  I think it's time to start arranging something where she is always in touch or I start working from home.  She has lost 6 pounds in the last week and much of it because she cannot \"digest her food\" since everything seems to want to come back up.  Even soup is proving an effort lately.  At lunch today she said \"I just want to keep busy\" which makes sense.  When she started this same chemo regime in early January of this year she was feeling better after the first treatment.  This has not happened yet so hopefully number two will work tomorrow.  We shall see I guess.",
      "MessageIndex": 38,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777801",
      "Title": "No Five Alive FiveAlive Traci-----TripNeg"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Mar 24, 2012 11:28AM FiveAlive wrote: Yan, I can only imagine what the last year has been like for you.  And yet, in some ways, it is difficult to put myself in your shoes knowing that my wife is fighting and will have fought the same battle.   I wish you much strength and comfort as time goes on. Mitch ",
      "MessageIndex": 350,
      "PostDate": "24/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766537",
      "Title": "Olga Simkin Z\"L leprechaun Bestbird"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Dec 16, 2012 11:01PM - edited Dec 16, 2012 11:07PM by FiveAlive Thank you all for your kind words.   Well, constipation has led to the opposite problem.  Whether it was the laxative from last night or a chemo side effect or the current CDAD outbreak the hospital is having...it's not fun.  They have an \"isolation\" sign on the door now as a precaution.  She is not allowed to leave the room but she isn't good for very many steps at the moment anyway.    A CT scan is on order for Monday or Tuesday to see the status of her liver and abdomen so I guess that will reveal more about what is going on.  She is doing a lot of sleeping and not much eating at the moment.  She doesn't want a TV and can't focus on books so talking during the visits are the best we can do for her at the moment.  She is a real trooper when it comes to pain but I have told her it's OK to take the meds (hydromorphone) if she needs them.  She wants to go home already but I'm sure she knows that's not possible right now.  It's amazing how things like attending a choir practice and planning a Christmas dinner are her current priorities.  We are telling her to look after herself first and not to worry about the things that others can handle.  Since the treatment for SBD lasts from 5-7 days, I'm telling her to hold tight and let the antibiotics do it's stuff.  I will keep you posted. Mitch",
      "MessageIndex": 16,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797691",
      "Title": "Mrs. Five Alive in Hospital FiveAlive lilylady"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Jan 6, 2013 11:49PM FiveAlive wrote: Thanks for all your words of encouragement.   Although this is truly her battle (as well as yours) it does seem to make a difference when I can share the ups and downs.  Likewise your posts assist in combatting this thing.  The peritonitis was not confirmed the first time because they were unable to do a \"belly tap\" but the antibiotics seemed to clear it up...as they are doing this time.  She was fine when I visited her this afternoon but had gone thru 3 bouts of high fever throughout the night and day...but the Tylenol 3 and antibiotics are doing their job.  They are doing blood and urine cultures and hopefully tomorrow we will have some indication as to what it might be.  I have read elsewhere though that it could end up just being her reaction to the chemo and nothing else.",
      "MessageIndex": 45,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797691",
      "Title": "Mrs. Five Alive in Hospital FiveAlive lilylady"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Mar 23, 2011 05:18PM FiveAlive wrote:  Our sincerest condolences to you and your boys Yan.  I have no other words at the moment. M & M",
      "MessageIndex": 15,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766537",
      "Title": "Olga Simkin Z\"L leprechaun Bestbird"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Mar 16, 2011 08:19PM FiveAlive wrote: Every 3 weeks because she is on chemo.  Before that when she wasn't on chemo it was every 3 months.",
      "MessageIndex": 7,
      "PostDate": "16/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766265",
      "Title": "survey: how often do you see your oncologist? kristinpianista Lena"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Nov 19, 2012 08:14PM FiveAlive wrote: Our thoughts and prayers are with you Lowrider.",
      "MessageIndex": 51,
      "PostDate": "19/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796556",
      "Title": "Lowrider, Facebook post mnmom3"
    },
    {
      "AuthorID": "FiveAlive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/123393/profile",
      "Content": "Nov 6, 2012 03:23PM FiveAlive wrote: It's so sad to hear this.  Deepest condolences to all of her loved ones.  This is all so wrong.",
      "MessageIndex": 4,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795985",
      "Title": "carla9112 is an angel bourscheid GatorGal"
    }
  ]
}