{
  "AuthorID": "five_cents",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165428/profile",
  "Posts": [
    {
      "AuthorID": "five_cents",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165428/profile",
      "Content": "Aug 2, 2016 04:31PM - edited Aug 2, 2016 04:32PM by five_cents stage 3a 2012 Mets to bone 2016 ",
      "MessageIndex": 128,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "five_cents",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165428/profile",
      "Content": "Jan 7, 2013 08:29PM five_cents wrote: Grace 533, I'm scheduled to get a Picc line in on Thursday.  My first chemo was terrible, they almost couldn't find a vein, five different nurses, lots of bruises and I almost got sent home.  Here in Toronto they really don't do port, except for people receiving chemo for a year; partly due to the waiting time for the surgery and partly because of the risk of complications.  I'm looking forward to the picc line, although they were able to get a line started easily on my second chemo I've started to get some vein pain already in my upper arm, it feels like a hard swollen area and, with four treatments left I wasn't looking forward to it. The picc line needs weekly flushing so a home care nurse will come and do that on my off weeks from chemo. I'm a litle concerned about skin breakdown from the tape but we'll see what happens.  The bonus is that the nurses can pull it on the last treatment so when I'm done chemo I can be done for real!  Let me know if you have any questions about the procedure after thursday.",
      "MessageIndex": 950,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "five_cents",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165428/profile",
      "Content": "Dec 19, 2012 08:36PM five_cents wrote: Oh no Steiner, I hope you are feeling better!  I'm not sure if some of the nausea & vomiting I had last week was from a stomach bug or not.  Everyone else in the house got sick too; I was hoping since I was on day 7 that I was clear of the nausea.  Today I was at the mall finishing my holiday shopping, had a big coughing fit and for a few seconds was worried I was about to throw up all over WalMart...it's like the nausea is just lurking down below waiting to be triggered. Day 14 and I've started to lose some hair in clumps - but it's not on my head!",
      "MessageIndex": 495,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "five_cents",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165428/profile",
      "Content": "Dec 28, 2012 01:42AM - edited Dec 28, 2012 01:45AM by five_cents Dwithd, I think you can try using pantyhose with the legs cut off as a skull cap too.  Something cheap and fast to experiment with while you wait.  Or a quick search using \"do rag\" turned up Sally Beauty supply  http://www.sallybeauty.com/do-rags-caps/Hair15-08,default,sc.html (I think I'm a bit looped from the steroids - anyone else need a problem solved? That I can do lying in bed?)",
      "MessageIndex": 697,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "five_cents",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165428/profile",
      "Content": "Dec 16, 2012 02:12AM five_cents wrote: Hi everyone, I've been lurking and wanted to thank you all for your stories and supports and to join into the group!   I was diagnosed in late September, surgery at the end of October and started chemo on Dec. 6, a bit delayed due to some surgical complications. Chrisvel, I'm having the same chemo as you, FEC X3 + D X3.  I think this is the standard of care for most Canadian treatments too. It's been harder than I thought it would be, but manageable.  I'm keeping my eyes on the spring and telling myself that by April this part will be all over and the healing can start.  The worst side effect right now is an extremely sore throat.  It's been building for a few days and I'm taking my temperature often but I think it's actually a sore in my throat, gargling salt water seems to help. Eating is already challenging because of altered taste and fatigue so I'm hoping it doesn't get any worse!   Best wishes to everyone Jen",
      "MessageIndex": 379,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "five_cents",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165428/profile",
      "Content": "Dec 27, 2012 11:14PM five_cents wrote: second treatment today and so far, so good. I hope everyone else's day was good too! Judaday - that allergic reaction is a bit nerve wracking, I'm glad it sorted out in the end and hope they fix it for next time. Because of my nausea last time the dr. extended my steroids and changed the anti-nausea drug. I'm hoping it will work, it was pretty minimal nausea but days 5/6 were fairly extreme.  He said the delayed onset nausea is rarer but can happen, especially in younger women.  I also asked about taking sleeping pills, meaning over the counter type, but he wrote me a prescription for Ativan which should be good, especially with the longer steroids.  the pharmacist even warned me about how effective it can be. She said to take it only when you're ready to go to bed - not when you still plan on cleaning up and then going to bed because it works so quickly.  I'll see how it goes tonight but nice to have something planned if my insomnia is as bad as last time. It was lousy just lying in the dark feeling sick. Have a good night everyone - best wishes to those who go tomorrow for a smooth day!",
      "MessageIndex": 687,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "five_cents",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165428/profile",
      "Content": "Dec 19, 2012 02:27AM five_cents wrote: My head has been itching too - but I also think I have some eczema under there.  Anyone else wondering what their head will look like underneath all the hair?  One of my boyfriends when I was much younger shaved his head and found a giant birthmark across the top of it. He complained to his mom why she didn't warn him and she said she couldn't believe he would be that dumb!  I guess we're all about to find out.  Day 12 out from FEC and waiting...",
      "MessageIndex": 468,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "five_cents",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165428/profile",
      "Content": "Dec 21, 2012 11:41PM five_cents wrote: Hi Sandra60, I have my second treatment on the 27th. At my hospital it's going to be a long day, i have to do blood work, onc visit and chemo all in one day and they've already said that they are overbooked and short staffed after the holidays. Powermom - I had itchy hands, the skin turned red and peeled right off. But it was on day 8 - 10 and mainly on my palms. I have baby soft skin on my hands now! I had a bunch of other rash symptoms as well, hives on my arms and a small reaction to the Neulasta. Cream and a cheap pair of gloves seemed to help my hands feel better. Handfuls of hair coming today, would like to have enough left over for a family Christmas party tomorrow...keep your fingers crossed.",
      "MessageIndex": 541,
      "PostDate": "21/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    }
  ]
}