{
  "AuthorID": "FLDREAMER",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
  "Posts": [
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Jan 16, 2012 03:35PM FLDREAMER wrote: I've just spent hours reading all these posts as well as each of your past posts.  (I did take a break.)  I feel like I'm in college again trying to learn everything, remember it all and retain what I've read.  I even made notes in a notebook I've started.  Since my surgery on 12/27, I've tried to 'forget' I have cancer but now that chemo is looming ahead (1/30), I know I need to face reality.   At 69 years of age, I'm worried about how chemo will affect me.   I have a cardiac history (triple by-pass in 2004), three stents, fibromyalgia, and rheumatoid arthritis.  I'm scared of what the chemo will do to my body.   My name (FLDREAMER) is because I had plans to work only thru May of 2012 and then retire and move to Cape Coral Florida.  Since I'm blessed to have a job with insurance and disability, I don't dare quit it and move anywhere.  I live in Illinois and hate the snow.  And the cold weather hurts my bones!   I've only cried three times since my diagnosis and today was one of them. I thank all of you for your posts.  They have been helpful.   Although I may end up in a February chemo group, I feel I know you and will keep all of you in my thoughts and prayers.",
      "MessageIndex": 472,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Jan 16, 2012 03:39PM FLDREAMER wrote: I just thought of a question which is very important to me.  I am scheduled to do the chemo on a Monday and receive the shot (whatever that is) on Tuesday.  Within a week or two of starting this regimen, I will be trying to return to work at least part time. Is it better to schedule the chemo for a Thursday with the shot on Friday?   Would that give me the weekend to recover so I could be a productive worker on the following Monday, Tuesday and Wednesday?     I do office work so I'll be sitting at a desk when I work.  I'm worried about the fatigue as well as the nausea/etc.   Comments, suggestions anyone?",
      "MessageIndex": 473,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Jan 20, 2012 04:08PM FLDREAMER wrote: A big thank you to everyone on this board.  I continue to read it all when I can.  I'm sorry I was so freaked out the other day over the cost of all this.   I've decided I will fight this like crazy and do all I can to get better.   I had chemo school today.  Thanks to this forum, I knew what to ask and understood all she told me.  Our facility is one large room with about 20 infusion chairs, big screen tv, and it looks out on a pond (snow covered at this time).  There are always three nurses in the area at any given time.  I even got a free wig that I can play around with this weekend to see if I like it.    My chemo is now changed to start on Thursday, February 2nd.  I'll get my shot on Fridays.  As for trying to work during chemo, I've finally accepted I cannot plan this like a schedule and have to go with the flow and just wing it to a great extent. On the plus/negative side, the workers at my place of employment just went on strike today...first time since 1960.   IF I was working, I'd have to park a long way from the entry, cross a picket line and be concerned about the conditions and emotional stresses that go along with that.  So, it's sad for the workers and the company but good for me that I don't need to be going to work just now. Again, a big thanks to all of you. ",
      "MessageIndex": 641,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 2, 2012 09:55AM - edited Feb 12, 2012 07:35AM by FLDREAMER I just want to take my toys and leave the sandbox.  (This is what Nancy HB said way back in December.)  I start my first chemo in one hour and want to run away and hide.  As she stated back then, I thought I was ready and I'm really not!     If I get one more phone call from a well wishing friend, I'm gonna scream.  I'm letting them go to voice mail.  I know they mean well but every time the phone rings, I jump a mile high.  So I guess my nerves are on edge!  (you suppose?) A big thank you to all of you on the January group.  All of your posts have been helpful.  Although I think I know what to expect, I still don't feel ready.  But I can't even imagine how bad I'd be if I never had any of your posts to read and enlighten me. On the positive side, I feel very grateful that I had a mammogram, we found the cancer, the surgery is over with and I'm finally on the road to getting the chemo done.  Waiting one month to start felt like a nice hiatus but was also kinda difficult.  I just want all this to be over with.   I do have a port that was placed dring my surgery on 12/27 so hopefully, all will go smoothly with that part of it.   Later,......  thanks again, all of you! ",
      "MessageIndex": 935,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 12, 2012 08:51AM - edited Feb 12, 2012 09:12AM by FLDREAMER Unwanted visitors:  I've been alone for years.  My extended family (nieces, etc.) NEVER visit me at my home, although I see everyone at birthday parties, holidays, etc.  Recently, my niece, her husband and their three children were going to drop in after they picked up the kids at day care to give me something.   (I didn't know how to say stay away!)    Note, I said after day care!  Plus, they've had colds recently.   And to top it off, she and her husband are nurses....he's a chemo nurse.  WTH?). My house is 360 square feet (yes, teeny!),  There is no room for even one visitor.   As it is, something came up and she cancelled.  I was so glad.  I feel sorta guilty for not wanting them to come over but geesh! My own two daughters and 15 yr old granddaughter have been very sick and have stayed away from me.  I miss them terribly and have been lonely.   I've been having weird dreams.  Of my mom who's been gone for many years.  Perhaps I want my 'mommy' again.  Some have been soothing, some just sad. When I went in for the Neulasta shot, I stopped in the hallway and stood there with a sense of absolute dread that hit me in the depths of my soul.  I felt like the little child (or pet) who reacts the minute they are near the vicinity of the place/people that 'hurt' them.  I know I'll probably feel this again on 2/16 when I return.  I have something VERY important going on the night of 2/16 and pray any reactions from the second treament that afternoon don't hit me that soon. A thank you to all who have posted.  It means a great deal to me.. ",
      "MessageIndex": 1131,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 12, 2012 09:38AM - edited Mar 28, 2014 08:38AM by FLDREAMER Anyone else feel their post is small....until they submit it.  I constantly edit mine since they seem so big.  Oh well.   Thanks Rachel....and I know I just have to set boundaries for my friends, extended family and even my adult daughters.  Very hard for me sometimes. General Info (of a rather personal nature).  shared with good intentions, of couse. Herpes virus:  (of any type).  I received this 'gift' (never mind how) in 1988.  Knowledge acquired then indicates it can lie dormant for many years and is more common than many people realize. Chemo can bring to the surface (literally) something we never knew we even had.  Don't ever blame anyone for it though.  And just treat it as your doctor advises and get on with it.  It is very manageable. Pads:  Peeing pink didn't last very long but if concerned, basic panty-liners can provide a semblance of security. Wipes:  If you have leakage (common among women after childbirth but also older women (I qualify for both), just keep a few wet wipes in a sealed baggie in your purse or jeans pocket. They are handy for personal hygiene when you're out.  IF the chemo urine is toxic, this might prevent any irritation.  Or keep some soothing cream / Vaseline with you. Skipping chemo:  I'm 69, supposedly the surgery got the cancer.  I have rheumatoid arthitis, fibromyalgia, a triple by-pass in 2004 and three stents since then.  I very seriously thought why bother with the chemo.  BUT, my two daughters (although grown) have many health issues and are on the road to recovery. My 15 year old granddaughter has her own struggles with a chaotic family.  I will go thru whatever I need to do in order to be here for nothing else then to continue to give them my moral support as they struggle with their own journeys.  More importantly, I'm not ready to be on the other side yet.  I intend to battle this, retire and at least enjoy another vacation on the beach somewhere even if I can't actually move there!  So, I'll fight this thru to the end. (remind me of that when I'm not feeling so well. lol).  I haven't seen these issues addressed so i thought I'd share.    ",
      "MessageIndex": 1133,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 12, 2012 08:21PM - edited Feb 13, 2012 07:50AM by FLDREAMER Janetanned & Rachel Thanks, I've added my treatment regimen.  I like it being part of the signature.  Good idea, whoever first suggested it on here.   ",
      "MessageIndex": 1145,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 24, 2012 04:36PM FLDREAMER wrote: Just caught up reading for past few days.  Can't respond individually, but: HUGS:  to all of you as you struggle with the SE's, etc.   AC:  my third is next week. I dread it already. HAIR/WIG:  I got the hair buzzed off on Tuesday and was doing somewhat okay.  (I had cried all day last Sunday and Monday so I was 'out of tears' by the time of the haircut.  Then, on Wednesday, I visited a wig store that individually did some tucking (sewing) my two free wigs and showing me how to make them fit better.  She even trimmed the excess 'hair' on the wigs so they would look nicer.  We then found one at her shop that was closer to my before cancer hair color and I was able to purchase it for only $10.  She filled out a voucher with the Susan Komen Foundation that would cover the other $100 cost.  This was a lifesaver for me as money is tighter than ever. DAUGHTERS:  The one daughter is supportive but still has problems that creep into our conversation often.  The other daughter called me on Tuesday (the day of the head shaving) asking if she could pitch a tent in my backyard and live there with her dog as it is unbearable at her boyfriends (he's very abusive).  I told her NO, that she could pitch a tent at her sister's house if necessary but not at mine.   Remember, I live in a 360 sq ft tiny house.  She has mental health problems and is trying to get SSD.  There are problems going back in time over ten years in which I've provided money and support to them both.  I can't do it anymore. Anyway, that put me into an absolutely HATEFUL mood that lasted two days.  I drove around screaming in the car that I hate everybody, and named each person that I hate.  This was on Ash Wednesday so I didn't feel very Christian that day.  I honestly thought about stopping all the treatment and quitting my job and running away.  I was so despondent I drove to a nearby church to stop in and pray (there were so many cars in the lot that I couldn't face going in the building).  I wanted to be alone.  So I drove to a cemetery and screamed in my car some more.  Once I was done venting, I felt better and able to keep going. INSPIRATIONAL:  I got home to log onto FB and found someone telling me how much of an inspiration I am and how brave I am.  If they only knew!!! MONEY/BILLS:  Today, I sorted thru all the unopened EOB'S and medical bills.  Then, I cried some more.  I wrote checks to pay some older ones.  I've stopped paying on the credit cards.  I have no assets they can take.  I already talked to a lawyer.  One year from now, I may go bankrupt.  Not sure yet.  I'm trying to keep current with the medical ones.  For me also, I now am about  $4500 in debt for medical copays from last year and just the two months of this year. I'm considering giving up my car (still many payments left) and buying a beater.  But I don't have the money for that either.  I will be looking into the copay asssistance that is out there. I HATE CANCER and this journey it has me on but physically, I'm feeling better.  I just need to get the emotions in gear.   ",
      "MessageIndex": 1431,
      "PostDate": "24/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Jan 16, 2012 10:18AM - edited Jan 16, 2012 10:20AM by FLDREAMER This is my first post although I've been reading since I was diagnosed in November. Had a LMX on 12/27/11.  I will start chemo on 1/30/12. It will be AC x 4 every two weeks and then T each week for 12 weeks.  I'm still getting used to these terms. I have chemo school on 1/25. I'm worried about the time I'm off work.  Are any of you working during your chemo?  Is it possible? How do you manage it?  I did all right with the surgery, drains, etc.  But I'm freaking out over the chemo.  I live alone although my daughter is close by and will help as needed.  I just wish the surgery was the end of it.  Feels like this will last forever.  I'm terribly stressed over the chemo part of this as well as the financial end of it all. Money is so tight it scares me!",
      "MessageIndex": 466,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Jan 31, 2012 10:43AM - edited Feb 1, 2012 07:06AM by FLDREAMER",
      "MessageIndex": 896,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 1, 2012 07:35AM - edited Mar 28, 2014 08:27AM by FLDREAMER I started to edit a post I made recently.   I messed up my editing and decided to just delete it. Basically, it said I've been away because I was able to take a nice 4-day all expense paid trip away from home.  It was a wonderful escape from.thinking about the cancer.  I delayed the start of my chemo so I could have that escape.  Now, I'll have my first chemo tomorrow.",
      "MessageIndex": 911,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Jan 19, 2012 01:05PM FLDREAMER wrote: Janetanned:  I have a question.   You stated your husband gives you the Neulasta shot.   WAs there any trouble arranging for that with your insurance provider?  My MO office just told me that wasn't an option for me.   (My daughter gives me a monthly Vit. B12 shot so she could do it for me.)   They said insurance might not cover it then.  They also told me that the shot cost several thousand dollars.   OMG, I am freaking out and in tears.  Is anyone else stressed out over the cost?   I had the LMX on 12/27, have never felt sick from the cancer.  There is just the teeniest tiny part of me that says skip the chemo, live my life and see what happens.  But that scares me to death too.   Even though I'm older (age 69), I don't want to get worse and give myself a death sentence. But the financial strain is killing me in its own way. Sorry, I just needed to vent.  . ",
      "MessageIndex": 596,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 2, 2012 07:19PM FLDREAMER wrote:  Well, the first chemo is over with and I survived.   My regimen is AC x 4 every two weeks.  Then Taxol once a week for 12 weeks.  I've mentally separated them into segments.  So to my thinking, I have one AC down and three to go.  That is less daunting to my brain!  lol My port was wonderful.  She accessed it on the first stick and it only stung a teeny bit. Here's a summary of things for anyone who's interested. 1)  saline flush (very quick and easy) 2) salt water started (no problem)   3) Emend for 20\" minutes.  This should help the nausea. 4) Zofran and Dex (something)  Z is for nausea and the Dex is a steroid (30 minutes total) 5) The A (adriamyocin)  30 mintutes.   (This is the 'big' one that is pink. 6) Ctytoxin for 1 hour. 7)  a saline flush and over and done. I felt fine throughout the procedure itself.  It took a total of 3 hours from entering to leaving.  One hint for anyone who has urinary incontinence or leakage (sorry if TMI).  I wear a pad for protection as well as a Depends.  I had to 'go' several times throughout that three hours.  When I went after the Adriamycin (pink one), I was already peeing pink.  Next time, I'll have some flushable baby wipes in a baggie in my jeans pocket so I can cleanse myself when I'm done.  A is the one that can cause skin reactions so I think that is a good precaution. Again, sorry if TMI. Please, all of you, keep in mind that it's different for everyone.  I just thought I'd give you a time capsule of mine.  Our chairs were recliners and very comfortable.  I was so thankful for that.  The staff were wonderful as well.  If I have to do this, then I'm determined to try to see the positive as much as I can.  (Actually, I hate it all but wallowing in that frame of mind was dragging me down!)  Now, at the 6 hour mark after treatment, I'm very sleepy.  I plan to take my meds and get to sleep.  I know the SE could be worse in the days ahead so I'm grateful for how I'm doing now.   Again, thanks to all of you who've gone before and gave us ideas, hints, clues to what to expect.  Love and hugs to all of you! ",
      "MessageIndex": 951,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 3, 2012 11:10PM FLDREAMER wrote: It's day 2 after my first AC chemo.  Other than being tired and napping earlier in the day, I'm doing well.  I get my Neulasta shot on Saturday morning as we finished the chemo at 4pm on Thursday and my insurance insists it must be at least 24 hours after the end of the chemo.  (And my MO is closed at 3pm Fridays).  So the shot is ahead of me.  I don't expect all of these to go this well.  I'm just thankful that this one is (so far).  I live alone and went out tonight and did all my normal stuff.  Enjoying the moment as I don't know what is ahead.",
      "MessageIndex": 980,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Mar 13, 2012 04:34AM FLDREAMER wrote: Peggy:   So sorry for all the SE's you're having. I really hope they ease up soon.   I felt that overwhelming fatiuge after my last AC and the lost of appetite.  It just finally went away.  So I can certainly sympathize with you.  Hope your bloodwork indicates something you can treat...like a vitamin you should take or something.   Will they really start the Taxol when you've been feeling that way?  I know you don't want to delay but on the other hand...? Janet:  I had to laugh at your 'checklist'.  I leave home before 6:30am and am not sure I'm even fully dressed, let alone the rest of the list.   Sorry to hear of the cold and ensuing problems.  Hope they are gone soon.    Thinking of all of you today. ",
      "MessageIndex": 1619,
      "PostDate": "13/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Mar 26, 2012 07:47PM - edited Mar 28, 2014 09:45AM by FLDREAMER STUBBLE:  Wish I had kept more of my hair.  The stubble is really hanging in there.  I don't mind going bald but my head is cold on the cooler days.   I wear the wig sometimes but don't really like it. HEAD SORES:  This is just in the past two or three days.  My head has little bumps on it.  They look a little red like they're going to be pimples or something.   Geesh, I never heard of this.  Am I allergic to the wigs?  Got acne on the head?  How can I go bald if I look like a toad head? TAXES:  Not related to chemo but I really looked over my bills the other day.  Trying so hard to pay something to everyone.  Cried over my financial status.  THEN, I did my taxes (with an accountant so I know they're right).  I owe the Feds $2068 and the State $463.   Then, I really cried.  It's my own fault.   I opted to get as much take home pay as I could and channeled it to my kids and I spent some money I took out of my 401K foolishly.  Now, I will pay the price. My daughters keep telling me to forgive myself because in my 69 years of life, it's the first year I've made some stupid financial decisions.   OLDER DAUGHTER:  Her social security hearing is April 2nd.  Praying she gets approved as I can't help her anymore like I used to.      Sadly, at this time, I'm worth more dead than alive and that's sometimes makes me think to not fight this illness but then I decide that damnit, I'm gonna fight...even if I end up in the poorhouse! ",
      "MessageIndex": 1790,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Mar 26, 2012 07:37PM FLDREAMER wrote: I haven't been on these boards since about 5 pages back.  Had lots of catching up to do on my reading.  My 4th and last AC was two weeks ago.  It left me more fatigued than the others and even a bit nauseous but it has now passed totally.   For those of you with SE's laying you low, I'm so sorry to hear of it.  Hope things are easing up somewhat.   CharB22:  Sorry about your FIL.  Thinking of your husband and children....wishing all of you didn't have to go thru so much at once... Marylla:   I am 69.  I understand your uncertainty about going thru all this.  I, too, thought about skipping it all and taking my chances.  I feel young.  Can't believe I'm really the age I am! lol  I'll be darned if I'll let this thing take me.  I have a 15 year old granddaughter who still needs me around to cushion her from her chaotic household.  (We're going out to eat tomorrow night and I know she is looking forward to it.)  I'll fight to the end this damn disease.    But, it is a choice and perhaps not the same choice for all. DeniseG:  I love your dandelion analogy.  I'll keep that in mind.  It is so true.   I had a MX in December, with 7 nodes removed.  Three of them had cancer, the next four did not. If this chemo can kill any remanining 'seeds', then I'll put up with it. On this Thursday, I will have my first of 12 weedkly Taxols.  My MO doesn't do Neulasta with these.  And this is Taxol, not Taxotere.  (They're not the same, are they?)  And there has been no mention of Herceptin. Is this always done and i'm just not aware?   To all of you.   I care and think of you often.  Sorry I haven't been very supportive in my posts.  It seems I just haven't had the energy to log in. ",
      "MessageIndex": 1789,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 5, 2012 07:46AM - edited Feb 12, 2012 07:58AM by FLDREAMER Help!  A question for those who've had a few sessions.   RINGING In the ears anyone?    I've had one AC, one Neulasta shot and am taking Zofran as an anti-nausea med.  Other than being really tired, I haven't been too bad.  But, I am experiencing a mild, constant, 'ringing in the ears.'   Has anyone else ever experienced this?  To which of the above is it a possible side effect?",
      "MessageIndex": 1001,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 13, 2012 07:59AM - edited Feb 13, 2012 08:00AM by FLDREAMER Bela T:   I was scared also.  Now that the first is done, I just feel dread and a bit anxious.  HUGS to you! RECLINER sleeping has been my habit for many years (since my heart surgery and some back problems).  It became a habit.  My kids joke that I don't need a bed or bedroom.  Anyway, I' was trying to break that habit before the cancer DX and it's tougher now.  I loved sleeping on my side but it's the one that had MX.  I switch back and forth between the LR recliner and the bedroom.  I hope I can lie on that side again someday.  I can't sleep on the other side. DRY eyes.  This has been a problem for me also.  There are good products on the market for this.  Can't think of their names at the moment..  ",
      "MessageIndex": 1157,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Mar 11, 2012 08:19PM FLDREAMER wrote: Thought I'd check in.  I had a wonderful weekend!  It was so nice since next weekend will be 'post AC # 4\" and I doubt I'll feel so good.  I had a long lunch with a friend on Saturday (including a Margarita).  Then, out for ice cream in the evening with daughter #2  & granddaughter.   Today, daughter #1 and I took a long drive to the country so she could do something pet related.  It was actually very pleasant and we had no difficult conversations.   I took the patio cushions out of storage and put them on the swing and chaise lounge on the covered patio and even took my bike out of the shed to get it tuned up.   I feel so normal I almost wonder if the chemo is killing anything (until I see my bald head).  And I feel perhaps this was a blessing to replace the tremendous depression I was feeling and remind me life might be normal again.... Hopefully.   Thinking of all of you and wishing you a few days of feeling really good.  It does renew the hope. ",
      "MessageIndex": 1607,
      "PostDate": "11/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Mar 11, 2012 08:31PM FLDREAMER wrote: HAIR:  I buzzed the hair a few weeks ago and am used to it now.  But that stubble hangs on.  Now, I kinda wish I'd just gone real short and wait to buzz it all until it was really necessary.  However, I do use a lint remover nightly and it always picks up stray stubble. WIGS:  I have three very nice and have been complimented but I hate wearing them. No matter how I adjust them, I feel like I have a rubber band around my head.  I have become very comfortable taking off my wig (in the restaurant at lunch) to show others how I look.  And anytime I'm driving or riding in the car, if it's uncomfortable and I'm not cold, I just go bald.  Wonder if I'll become that brave going to work or a store or something.  Don't think so.  There's something invisible or anonymous about being in the car!  (childlike, I know...sort of like the little kid hiding behind a skinny tree thinking you can't see her or something). HALOS:  These are those partial wigs that you wear under a baseball type cap.  They look neat in the TLC catalog.  Any of you have them?  Do you like them? VALUE ALL OF YOU:  Last but not least, I can't begin to tell all of you how important your posts and your responses mean to me.  I value the understanding and empathy from each of you.  I am so thankful for this forum and computers!  I care about each of you and hope this week is good to you! ",
      "MessageIndex": 1608,
      "PostDate": "11/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Apr 7, 2012 01:08AM - edited Mar 28, 2014 09:52AM by FLDREAMER I need to catch up on reading about six pages or more.  But since my 1st and now yesterday my second Taxol, I've been too tired to log in.    However, I felt I needed to log in and share some good news.  Many of you have read my frequent rants about my ill older daughter.    Anyway, she tried for social sec disab almost two years ago and was denied.  She appealed with the help of a lawyer and the appeal date was this past Monday.  The judge decided on the spot during the tele-conference to award her disability.  She and I both sobbed with relief. For her, this means she will have retroactive pay plus a monthly amount.  She can get out of the negative relationship she's in and move to where she wants to live.  She is a good person and will repay me the thousand or so I've helped her with in recent months.  She has hope again.  I know money won't solve all the problems and she'll struggle still with getting the right medications, relationships, etc.  But there is hope. And for me, most of all, if my heart disease or cancer takes me, I'll die knowing she has a steady income (although small) that will keep her from being homeless.  This alone is priceless to me.  I've been very fearful that something would happen to me.  There is noone else that would or can help her if that happened.  (Her father died many years ago.)  I am so grateful right now.  I don't even care about my cancer.   I can now concentrate on my healing and not worry so much.",
      "MessageIndex": 1916,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 12, 2012 05:59PM - edited Feb 12, 2012 06:00PM by FLDREAMER Question regarding our profiles: Several posts back, someone suggested we enter our treatment regimen as part of our signature status info.   On the profile page, where would we enter that?  I tried entering it at the bottom of some info but it only showed up on that particular post, not all of them.  What am I doing wrong? ",
      "MessageIndex": 1142,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 19, 2012 04:46AM FLDREAMER wrote: HELP!  I waited too long to do the short haircut.  I had an appointment scheduled and cancelled when I felt sick.  Now, it's set for this Tuesday.  Last night, sleeping, my head hurt....like if I bumped it hard against a door or something.  As I changed positions, I tugged at some hair just for the heck of it and it came out.   Do I even have time to have a short haircut for a while or do I just go ahead and buzz it all off?  I thought I was ready for this but find that I'm not.  Once again, tears have been shed.  NancyB:  I'm with you. I'm tired of hearing how 'inspirational' I am.  Well, when all those people get done telling me that, they get to ...log off, hang up, go home...back to their normal cancer free life and \"pray for Karen, think of her\" etc.  but their life is normal.  I'm mad as hell at the world right now and I'm jealous as heck.  I don't want to be an inspiration.  I wanted to work till June, retire and move to a warm beachy climate.  I hate this, I hate this, I hate this. ",
      "MessageIndex": 1314,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Mar 9, 2012 10:00PM - edited Mar 10, 2012 07:16AM by FLDREAMER Hi Everyone:  I've just caught up on reading pages of posts.  Too many to respond to each of you.  My third AC was last week and all I've done is sleep...almost around the clock.  And although there's no nausea, there's been a drain of appetite as well.  Living alone as I do, once I settle into my recliner, if I didn't gather whatever I needed before I sat down, I just don't have the energy to get up and get it.  I think part of this is just an overwhelming depression as well as fatigue. I started back to work this week as well.  I'm cleared to work up to 32 hours a week but only could put in 24 this week due to the fatigue.  Today was an 8 hr workday and it really zapped me.  My boss is so glad to have me back that he's very understanding but at the same time there is so much to be done that he kept asking me to do 'one more thing before I leave.\" I think I am appearing to be too 'healthy' and upbeat and therefore am perceived to have it together.  Do I have to fake being sick to be able to leave when I am just tired to the core?  Sigh.  It is like people who tell us we're an inspiration, brave, etc.   (and look so good besides).   Someone else posted that maybe they need to be less of a slob when their hair comes back.  I hear so many compliments that my 'hair' (they know it's a wig) looks great.  I think ...'geesh, when I used to go get my hair colored or cut, nobody ever said a word\"   Now, all of a sudden, I look so great. The minute I get in my car I take off the wig.  And skip the hats.  I just drive home bald.  I couldn't care less what other drivers think if they notice.  I hate the wigs even though they're actually all quite nice.    Next Thursday (3/16) I have the final AC.  Then two weeks after that I'll start the first of 12 weekly taxols.   Hugs to all of you.   I'll try to keep up.  (Oh, the mental health situation with my daughter has continued.  I just choose not to comment on it tonight. But I have shed more tears over that than I have over the cancer!  On the plus side, she has a hearing to acquire social security disability scheduled for April 2nd....after waiting for a year.  She has a lawyer and if she's approved, it will help a lot.  If she's denied, that's another story.)  I think of each of you daily and keep you in my prayers.   Best wishes to all of you. ",
      "MessageIndex": 1589,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Mar 12, 2012 08:00PM FLDREAMER wrote:",
      "MessageIndex": 1615,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Mar 14, 2012 08:12PM FLDREAMER wrote: Well, here I am.   Dreading my 4th AC tomorrow (Thursday).  It's my last AC.  Then, in two weeks I'll start the first of my 12 weekly Taxols.   It's scary to read of everyone's SE's but I know that doesn't mean I'll have the same. I do appreciate everyone sharing their stories.  It gives us all at least some idea of what is possible. I'd rather know than be blindsided!     I am sorry to hear of all of you who are having it so rough.  I hope it eases up very soon. Just wanted to check in briefly.  Take care, everyone!",
      "MessageIndex": 1661,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Jun 14, 2012 07:47AM FLDREAMER wrote: I feel like a 'black sheep.'   I've stayed away so long, I'm not sure you'll remember me!   I started here in January but since my chemo actually started in Feb, I mainly posted on that board.  But, I missed many weeks on there as well.   I just haven't had the energy to keep up. In the past few days, I've read every page since I was last on here (since page 62).   I can't possibly comment on everything that's happened but know this.......I never stopped thinking about any of you.  I do care.  I am so happy for those of you who are done with chemo.   And sad for those still having problems.   I have my next to last Taxol today.  And the final one next Thursday.  Then,  I have four weeks off before I start 30 or 35 RADS sometime in late July.  They will be daily (M-F) till done. I've been super depressed and wondered if all this was worth it.  But here I am nearly done.   The emotional difficulties I had with my eldest daughter took their toll on me and I am trying hard to just concentrate on me.  I just don't have the energy to let her affect me anymore.  I stil care but just can't let it get to me like I used to. Regarding Facebook:  Not sure if I'll join your group or not.  I guess I'll have to think about that.  There is just too much to keep up with.  Just reading my emails and my personal FB keeps me too busy!  Maybe when I have more energy I'll feel different. A big thank you to all who PM me and were concerned as to how I'm doing.  Some of my responses were maybe a little too long and involved.  Forgive me for that.  I certainly can digress at times.   Hugs      to all !!!",
      "MessageIndex": 2330,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Mar 28, 2014 10:44AM FLDREAMER wrote: My last post on this thread was back on 6/14/12.    Since I ended up actually starting chemo in Feb of 2012, I was trying to keep up with both groups.   Reading both threads, dealing with the health and work issues (and family crap) became too much and I dropped out of your group.   I just happened to be reading lately to see how everyone is doing.   So very sorry to hear of Barbara (Seagrover)  having died.    Is your FB group still active.  Can I be part of it still?   When I was more active, I felt connected to all of you and have often wondered how you are doing.    My situation is that I am still working (I was 71 just this past Dec.)  I will retire at the end of June.   Money is a major continuing worry for me but I will manage somehow.   And my two 40'ish daughters with various health issues have been a continued source of anxiety and concern.  At least, they are both now on Soc Sec Disab which helps.   I find the emotional strains of everything are the worse for me.  And most of that is based on fear.   In the past few days, I've quickly speed-read the past 40 pages and it brought back to me just how bad it was and how far we've come.  I feel a renewed spirit of hope and fight.   And I am thankful for each day that is good.   Hugs and warm thoughts to all of you!",
      "MessageIndex": 2566,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "FLDREAMER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142076/profile",
      "Content": "Feb 2, 2012 01:27PM FLDREAMER wrote: Fantastic list.  Thanks to everyone.  I start my first chemo in one hour and this has been very helpful.",
      "MessageIndex": 765,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    }
  ]
}