{
  "AuthorID": "flmnfem",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113903/profile",
  "Posts": [
    {
      "AuthorID": "flmnfem",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113903/profile",
      "Content": "Nov 23, 2010 08:47AM flmnfem wrote: Thank you for all of your posts- it helps to feel not as alone with this! Thanks for the advice as well- I will follow it. I will post the outcome one way or the other after my appointment tomorrow, and thanks again. Jan PS-RN4babies, good luck with your appoinment on 11/30. I will be thinking of you.",
      "MessageIndex": 5,
      "PostDate": "23/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761086",
      "Title": "Called back 50% of the time- help! flmnfem Lisa1962"
    },
    {
      "AuthorID": "flmnfem",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113903/profile",
      "Content": "Nov 24, 2010 04:27PM flmnfem wrote: Hello All, Well, I am home after a long stress filled day of additional magnified mammo , hands on exam and ultrasound. The final verdict for me is what he thinks to be a cluster of cysts. I am relieved, and so grateful to all of you and this site, but am as many of you have suggested keeping my appoinment next Wed. with the surgeon for the all important second opinon. Today  I was told to come back in 6 months for a diagnostic mammo, but did share with him my intention to go to the surgeon next week as well. While there, a woman ahead of me had a perfect mammo in Aug., a perfect diagnostic mammo today- ordered after she felt a small lump- and the lump finally did show up on us. They were very concerned for her, based on the feel and ultrsound image. When I left they were trying to arrange a biopsy for her on Friday. I promised her I would keep her in my thoughts. Just goes to prove mammo's can't catch everything.  I will keep you posted, and also check back to see how everyone else is doing. Again, thank you and this site is the BEST!",
      "MessageIndex": 11,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761086",
      "Title": "Called back 50% of the time- help! flmnfem Lisa1962"
    },
    {
      "AuthorID": "flmnfem",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113903/profile",
      "Content": "flmnfem wrote: Hi, I am 46 years old, and of the 6 years I have been getting mammograms, I just got my third call back on Thursday. Of course they can't take me until Wed ( the 24th) and I am scared stiff. All I know is that they saw something in the left breast, and need me back for more pictures. Do you think since the other times it has been Ok that this will be too, or do you think sice I have a history of call backs, there is now finally a problem they have detected? I made an appointment already with a top breast surgeon in my area, and he can see me on Dec. 1. Do you think that was smart on my part, or should I have waited until after they do another mammogram/ultrasound if needed on Wed? I take care of my elderly, ailing, mom and don't know what I will do if I am sick. HELP! Jay Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761086",
      "Title": "Called back 50% of the time- help! flmnfem Lisa1962"
    },
    {
      "AuthorID": "flmnfem",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113903/profile",
      "Content": "Nov 24, 2010 08:43AM flmnfem wrote: Thank you Sue- your words have made my morning getting ready to go to the hospital a bit easier. I will post whatever I know as soon as I get home today... Thank you again, Jay",
      "MessageIndex": 8,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761086",
      "Title": "Called back 50% of the time- help! flmnfem Lisa1962"
    },
    {
      "AuthorID": "flmnfem",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/113903/profile",
      "Content": "Nov 23, 2010 01:33PM flmnfem wrote: Herre I am again.. No new news for me, but I am really feeling panicked and can't seem to shake it. I am now SURE I have BC, and feel like a trapped animal. I talked to a good friend who had stage 4 BC , treated 2 years ago, and instead of that bringing me in off the ledge, it made the possibilities all the more real. The digital mammogram  results are read both by a person and a computer, so now I am even more concerned about the call back I got. I thought I was a strong person- cared for my Dad when he was struck with ALS, taking care of my Mom now , etc- but not now!",
      "MessageIndex": 6,
      "PostDate": "23/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/761086",
      "Title": "Called back 50% of the time- help! flmnfem Lisa1962"
    }
  ]
}