{
  "AuthorID": "Flowergrower",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69044/profile",
  "Posts": [
    {
      "AuthorID": "Flowergrower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69044/profile",
      "Content": "Flowergrower wrote: Hi everyone, Has anyone else experienced very low neutrophils whilst taking sertraline (an SSRI anti depressant) and Ibrance? I have done 7 cycles of Ibrance and my bloods have been fine. I have taken half does of Sertraline for 8-9 days, had blood test yesterday and now my neutrophils are very low so I have to have another blood test next week and can't start cycle 8. My dr said it was unusual for neutrophils to suddenly dip (I have been fine until now) so probably the sertraline? I'm on holiday next week so can't do blood test then so next cycle will be delayed by minimum of 2 weeks which I find a bit worrying! Nothing seems to be simple! Thanks :) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/865832",
      "Title": "Sertraline and Ibrance Flowergrower Flowergrower"
    },
    {
      "AuthorID": "Flowergrower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69044/profile",
      "Content": "Flowergrower wrote: Hello everyone, I haven't posted here before as it has all seemed too scary but I have read some posts and you are all very inspiring. I was diagnosed in Nov 17 with extensive liver mets and also mets in spine, 13 years after original dx. Taking Ibrance and Letrozole since Jan and on cycle 7, I had 20% shrinkage after 3 cycles (good but have no idea to how that compares to average response). I am wondering if it is more effective to take the 2 tablets together or not? I did read here where someone thought it may be advantageous to take Ibrance in the evening (i have been taking both in the morning) - any thoughts on this? I have been lucky (if any of us can say that!) in that I have minimal side effects so far, I'm still doing some work and keeping fit. Anxiety is a huge issue for me though as I have 2 teenagers and my partner died 2 years ago, so v scary thinking about the future for the children (feeling the tears coming now!) Thanks for reading Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/865238",
      "Title": "Best time to take Ibrance and Letrozole Flowergrower Chicagoan"
    }
  ]
}