{
  "AuthorID": "flowerchild",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/28938/profile",
  "Posts": [
    {
      "AuthorID": "flowerchild",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/28938/profile",
      "Content": "flowerchild wrote: I was diagnosed 10/06 w/ IDC. I did chemo (AC), radiation and Tamoxifen for a year (recently stopped).  Last summer I noticed a change in my cancer breast. The surgeon agreed and sent me for a mammo and sono. Both showed nothing. My insurance wouldn't pay for an MRI so I paid out of pocket ($1200). The MRI didn't show anything. Since that time I have had another mammo and sono and both show nothing. My insurance does not feel it is medically necessary to have an MRI and won't pay - I can't afford to pay out of pocket again. My surgeon is insisting on a biopsy, he would make an incision and remove the suspicious area.  My question is - Is the biopsy really necessary. If something was wrong wouldn't the MRI have seen it? Has anyone had an experience where the MRI missed a cancer?  I really don't want a biopsy. I'm already missing half my breast and the suspiscious area is fairly large.  I know it probably seems vain but I REALLY don't won't to have a biopsy and start down this road again.  Any comments would be appreciated. Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708679",
      "Title": "can MRI miss lump?? flowerchild Jen44"
    },
    {
      "AuthorID": "flowerchild…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/28938/profile",
      "Content": "Jul 7, 2008 10:56PM flowerchild wrote: Thanks for your reply Jenny. I'm so torn, one minute I know I have to have the biopsy then the next I think it's overkill. I know that the only way to know for sure is to take it out but .... I don't want more surgery. I haven't talked to anyone about this so just typing it out is helpful. If I bring this up with friends or family they will flip out. Thanks for listening - it helps to hear another opinion.",
      "MessageIndex": 2,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708679",
      "Title": "can MRI miss lump?? flowerchild Jen44"
    }
  ]
}