{
  "AuthorID": "fmaury",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152986/profile",
  "Posts": [
    {
      "AuthorID": "fmaury",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152986/profile",
      "Content": "Jun 2, 2012 11:55AM fmaury wrote: I did not get a reply to my question so I went ahead and used the rolled flexible gauze all around my chest and it worked amazingly well! It also allowed me to sleep without a bra...so much comfortable!",
      "MessageIndex": 1,
      "PostDate": "02/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788454",
      "Title": "Tired of my post surgical dressing fmaury Blessings2011"
    },
    {
      "AuthorID": "fmaury",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152986/profile",
      "Content": "fmaury wrote: Hi everyone,  Hi everyone, I was diagnosed with ILC and LCIS and had a bilateral mastectomy a little over two weeks ago. I am doing fine and my incisions looks good. I still have 2 drains but pretty sure they are coming off on on Monday because the volume is almost at 30ml each. However, I can't stand the gauze dressings anymore because they bother me at the edges. Has anyone used rolled gauze dressing? If not, I am going to try and let you all know how it works.  All the best, Caroline Dx 4/11/2012, IDC, <1cm, Stage I, Grade 2, 0/1 nodes, ER+/PR+, HER2- Hormonal Therapy 7/8/2012 Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788454",
      "Title": "Tired of my post surgical dressing fmaury Blessings2011"
    },
    {
      "AuthorID": "fmaury",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152986/profile",
      "Content": "May 15, 2013 07:51PM fmaury wrote: Lily and Luane, I'm with you. I already had a poor opinion of Angelina Jolie because every thing she does seems to be calculated for maximum media exposure, but oversimplification of a painful and scary procedure is particularly misleading to women who have to make this difficult choice. I love the analogy to a boob job. I made the BMX decision because I already had cancer in one breast and was not eligible for lumpectomy or nipple sparing mastectomy. I just got through the final stage: nipple reconstruction and it was no picnic. I am sure AJ looks great and I am glad she has lowered her risk. But I still think of her as self absorbed, publicity hungry, and basically clueless. Caroline",
      "MessageIndex": 45,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/804660",
      "Title": "Angelina Jolie's prophylactic surgery JoanQuilts SusansGarden"
    },
    {
      "AuthorID": "fmaury",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152986/profile",
      "Content": "Jun 1, 2012 10:40PM fmaury wrote: Hi LynnM, I just joined this group. I had a bilateral mastectomy on May 16 and have tissue expanders in. So far so good. I spent the first week at home with a portable \"nerve block\". A sort of epidural anesthetic that was annoying (2 bulbs that needed to be carried in little bags) but boy did it help with the pain! I was out and about and taking walks, cooking, working at the computer, etc. During that time I took antibiotics twice a day, 1-2 percocets at night and celebrex/tylenol during the day. I was also prescribed a low dose of valium 3 X day to relax the muscles. Finally, I was already taking gabapentin (Neurontin) for neck pain issues (which have disappeared since the surgery, go figure!) so I kept on taking that as well. Bottom line: the only time I was in real pain was the night the nerve block came out. But I took extra percocet that night and every day was better after that. The absence of serious pain has allowed me to do stretches (prescribed by physical therapist) and stay active. When I sit around all day, I can really feel the tightness at the end of the day. The lesson for me has been: don't be afraid of the drugs, they are part of the recovery process! Wishing everyone a prompt recovery! Caroline",
      "MessageIndex": 524,
      "PostDate": "01/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786042",
      "Title": "May 2012 Mastectomies? Still_Snarky Fearlessfoot"
    }
  ]
}