{
  "AuthorID": "formygirls",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
  "Posts": [
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 18, 2008 02:55PM formygirls wrote: Sorry. I created this comment about the adjuvant calc but then realized I was using a different website which said I had a negative life expectancy!! I should have died 4 years ago:) Oh well.. I will ignore these sites and just keep singing..I will survive and I will qualify for senior citizen discoounts. That is my  goal now.",
      "MessageIndex": 1,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704226",
      "Title": "Adjuvantonline calculator formygirls formygirls"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 12, 2012 05:24PM formygirls wrote: Soliel, This is great news. I hope you do not have a reaction to your next txs. But with this news, I am sure you ready for anything. I start Abraxane tomorrow so I am really excited to hear about your response.",
      "MessageIndex": 29,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789002",
      "Title": "Happy Tears Falling Falling! soleil505 Brendatrue"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 12, 2008 09:23PM formygirls wrote: Janis, You have given me strenght through your posts. This news just sucks. I add my prayers for good news, healing and peace.",
      "MessageIndex": 138,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/706997",
      "Title": "not good you guys Fitztwins Lindaip"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 12, 2012 10:06PM formygirls wrote: Congratulations to both of you. Enjoy! I just attended my daughter's fifth grade graduation last week and it was awesome to be there.",
      "MessageIndex": 6,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788987",
      "Title": "It's going to be a great day! TonyaB meima-Bev"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 20, 2013 12:22AM formygirls wrote: Barb, I hope you have a great time at the wedding and can enjoy it with min side effects.",
      "MessageIndex": 5,
      "PostDate": "20/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803499",
      "Title": "Decadron bhd1 Leah_S"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 6, 2008 09:11PM formygirls wrote: Thanks everyone. Sounds like I am not alone and this is an expected side effect even in the second week. Well.. two down..six more chemo to go. Hopefully this will end:)",
      "MessageIndex": 11,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/703341",
      "Title": "Bone pain in second week with Neulasta? formygirls SpecialK"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: This Post was deleted by formygirls. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704226",
      "Title": "Adjuvantonline calculator formygirls formygirls"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: Does anyone have bone pain in the seond week after the shot? I do dose dens AC and had my second tx last Tuesday and the shot on Wednesday. All of last week, I was just tired but nothing else. Tuesday I spiked a low grade fever that went away in a day but since then my bones are hurting real bad. It is in my lower back and legs. Everone else only talks of bone pain right after they get the shot. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/703341",
      "Title": "Bone pain in second week with Neulasta? formygirls SpecialK"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: Does anyone have bone pain in the seond week after the shot? I do dose dens AC and had my second tx last Tuesday and the shot on Wednesday. All of last week, I was just tired but nothing else. Tuesday I spiked a low grade fever that went away in a day but since then my bones are hurting real bad. It is in my lower back and legs. Everone else only talks of bone pain right after they get the shot. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/703341",
      "Title": "Bone pain in second week with Neulasta? formygirls SpecialK"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 13, 2013 01:53PM formygirls wrote: Blossoms, Hugs. I am happy to hear that WBR is working and the headaches are better. Your cancer is being attacked one by one. The chest wall rads should bring relief and there are many many chemos for you to try. I hope you will experience relief in your chest soon. Hang in there.",
      "MessageIndex": 1,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800435",
      "Title": "I am really really scared and hoping for support.... Blossoms Blossoms"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Dec 12, 2012 10:38AM formygirls wrote: I hope you feel better soon and come home healthy to your boys. Know that we are all rooting for you and sending you hugs.",
      "MessageIndex": 43,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797460",
      "Title": "well I finally landed up in the hospital lukejessesmom exbrnxgrl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Oct 2, 2012 05:55PM formygirls wrote: Wonderful news Tonya. Congratulations!",
      "MessageIndex": 27,
      "PostDate": "02/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794282",
      "Title": "Scan Today @ 11:00 TonyaB HLB"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 13, 2008 04:57AM - edited May 13, 2008 04:58AM by formygirls Mia, Welcome to this group. The initial days are confusing and it will get better once you have a tx plan. I feel like an old timer and was only diagnosed 02/28. I am 36 with two beautiful girls. Treatment varies for everybody. I am stage IIIB/C and and my tx involves 4 months of chemo and  8 weeks of radiation. Some patients get Herceptin for a year if they are Her2+. You should bring up all pains to my onc. Most of the time it is nothing but it good to tell your onc everything so they can check it out. On your question regarding mast vs lump that will depend on you and your onc and if your surgeon was able to get clean margins. There is no one answer for everyone. In my case I do not have a choice and will be getting a bilat mast after my chemo is completed. Good luck.",
      "MessageIndex": 1,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/705460",
      "Title": "Newcomer of Breast Cancer at stage III JoyMia7 apple"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: I had three scans last week--a PET/CT, CT of abdomen and pelvis and CT of chest last week. Results are bad and confusing. My PET says improvement and reduction in mets in liver, bones, nodes and does not even mention lungs. The two CT's that I read today show progression in lungs and liver and new lesion in hips. Does anyone else have unreliable PETs? I am bummed that Navelbine has not worked. I am meeting with onc on Monday and hopefully she will change chemo. She just sent me an email saying PET looked great but CT was confusing. Confusing? The CT indicates clear progression to me. I am really disappointed as my TMs have dropped, liver function has improved. I had hoped for better results. Navelbine has been very hard on me but I was ok with it if it was working. Now it appears it is not. My left lobe of the liver which was full of cancer is much better but my right lobe which was clean is now filled with cancer also. Lungs are worse. My brain MRI is not for another few weeks so I do not know if brain mets are back but I have started to have headaches again. Well, on to a new treatment with new hope. Thanks for reading. I am just frustrated and down today. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788701",
      "Title": "PET says improvement but CT scans says progression formygirls Bestbird"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 6, 2012 06:10PM formygirls wrote: Paula, Thanks. The three reports actually said the words. The pet scan said overall improvement evidenced by decreased activity in osseous metastatic disease, hepatic involvement, and lymph node activity while the two CT scans used the word Progression in liver, lungs and bone.My onc did not send me the CT scan reports and only sent me the PET. I picked up the CT reports today when I went for my infusion. I think my onc is trying to protect me from bad news. Will definitely have a talk when I see her on MOnday. I guess chemo is working on some strain on the cancer and not on the others as some tumors regress while new ones continue to grow. My family is more upset than I am. I am not as upset as I would have been before. I got a smoothie from Jamba Juice and Mad Men to watch.",
      "MessageIndex": 2,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788701",
      "Title": "PET says improvement but CT scans says progression formygirls Bestbird"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 7, 2012 07:46PM formygirls wrote: Thanks everyone. I did get an MRI of the liver also last month. Hopefully the onc and radiologist will pow pow and try to resolve all these reports. I wish things were more black and white instead of the murky grey and we knew whether chemo was working or not. Will know more on Monday when I see my onc.",
      "MessageIndex": 8,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788701",
      "Title": "PET says improvement but CT scans says progression formygirls Bestbird"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 11, 2013 01:20PM formygirls wrote: Have you tried an appeal through your case manager at the insurance and having your onc speak directly to the medical director at your insurance?. Perjeta was denied for me but they approved on appeal. My onc had to submit the reasons in writing. It is a hard one to get approved. I progressed on perjetA and am now on TDm1. Good luck.",
      "MessageIndex": 2,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803039",
      "Title": "How did you get approval for Perjeta Ready2Win SPAMgirl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jul 25, 2012 04:13PM formygirls wrote: This is such a special moment. Congratulations.",
      "MessageIndex": 8,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791079",
      "Title": "I became a GREAT Grandmother last night!! meima-Bev Karen2012"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 6, 2008 07:35AM formygirls wrote: Gracie, I also have a liver spot that was being watched by my onc. It showed up on the MRI when I was intially dx for bc. It was scanned again after three months in May and had not changed in size at all despite chemo for my bc and was called a B9 hemangioma and mets was ruled out. Most liver spots are B9. I know that does not take your worry away as these three months of waiting were very stressful for me. I hope you get B9 good news also. But I have read a lot of posts like this during the time I waited between scans. My onc told me the spots less than 1cm would not show up on a PET. Mine was 1.7cm but onc did not want to biopsy since I was already on chemo and we just rescanned midway through chemo. Wishing you good luck.",
      "MessageIndex": 8,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706817",
      "Title": "Maybe liver mets? GracieM2007 Maya1"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 6, 2013 10:46PM formygirls wrote: Thank you all for your support. I am off TDM1 and have started Xeloda, Afinitor, tykerb with Herceptin and Zometa. I cried for a few days but got my self together and started new tx as I am not ready for hospice yet. I still feel ok physically so want to keep trying till my body can take chemo and if I have choices. We have put WBR on hold till the liver mets stop growing or brain mets start increasing rapidly. It is a fine balance as I will be have to stop chemo to get WBR. I wish you all great success with TDM1. I loved being on it and had hoped to stay on for a long time.",
      "MessageIndex": 81,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800601",
      "Title": "Anyone on T-DM1? violinfingers Pbjarrett"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 23, 2013 05:36PM formygirls wrote: I have my scans tomorrow. This will be my third set of scans on TDM1. Last one was six weeks ago and was great. This time TMs have tripled so expecting major progression. Had my brain MRI today which was not good. Figures crossed for not very bad news tomorrow.I do not want to leave you guys yet....kicking and screaming as I am pulled away:)",
      "MessageIndex": 68,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800601",
      "Title": "Anyone on T-DM1? violinfingers Pbjarrett"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 18, 2013 12:56AM formygirls wrote: Bondgirl and Jill --Welcome to TDM1. I have been on it since Nov 15 and really like being on it after Perjeta and Taxtore. The side effects are so manageable. I will probably start a new chemo next week and I am so miserable. I still feel good but my TMs have doubled twice in a row and my liver enzymes are creeping up. I have scans next week to confirm. It will be hard to go from this to Halaven, Doxil, ixempra or Xeloda which are the four chemos left. I hope you get a long run as I believe this a chemo you can have a good quality of life with.",
      "MessageIndex": 59,
      "PostDate": "18/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800601",
      "Title": "Anyone on T-DM1? violinfingers Pbjarrett"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 17, 2013 04:50PM formygirls wrote: Anna, I also had progression on perjetA, tax and Herceptin. I was able to only take it for three months. It was emotionally very hard to progress on it as my onc and everyone had said that perjetA was my wonder drug and we were so excited when I was finally able to get it. I am now on TDM1. I was nervous about getting on this as this feels like my last silver bullet. I have been on it since Nov. so far, I have had mixed results. Regression in lungs, and most tumors in the liver but one new tumor in the liver grew. But the trial let me stay on. Side effects are much easier than any chemo I have been on the past. I have a lot of headaches but I do not know if they are from my brain mets or migraines triggered by TDM1. I have fatigue for a couple of days. It does seem as easy as promised n the news. I really hope I can stay on this as I can see how someone can be on it for a long time with a good QOL if it works. I hope you get good results with it. Let me know if you have any questions.",
      "MessageIndex": 1,
      "PostDate": "17/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800601",
      "Title": "Anyone on T-DM1? violinfingers Pbjarrett"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 4, 2013 04:27PM formygirls wrote: Surly, My TMs are very reliable. They have been dropping since starting TDM1 but doubled last tx. Obviously very concerned. I had scans the same week and the scans were good. So for now my onc and I are just watching nervously. It is too early to scan again but my TMs have never increased like this before without progression. I hope this is something to do with the drug. I know someone on TDM1 for two years whose TMs have always increased but has had no progression. Hope to be like her.",
      "MessageIndex": 36,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800601",
      "Title": "Anyone on T-DM1? violinfingers Pbjarrett"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 18, 2013 01:00AM formygirls wrote: Stephanie, I did not know that TMs could become dumb and lose reliability. I will hang in there with that tiny shred of hope as I go for scans again.Thankyou. Good to see you post. I have read your sister posting for you in the past.",
      "MessageIndex": 60,
      "PostDate": "18/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800601",
      "Title": "Anyone on T-DM1? violinfingers Pbjarrett"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 25, 2013 08:10AM formygirls wrote: Barb, I had horrible news yesterday. I had progression in brain, liver, lungs and bone. Tumors grew in size and number. I am beaten down and tired.maybe it is time to wrap up. No chemo seems to work more than 3-4 months for me. My onc wants me to try affinitor next enough though I am ER - and her positive because of a PI3k mutation I have. I am not sure if I want to try again. I just want to curl up and cry and dissapear. Thank you so much for checking and thinking about me.",
      "MessageIndex": 74,
      "PostDate": "25/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800601",
      "Title": "Anyone on T-DM1? violinfingers Pbjarrett"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 30, 2008 09:23AM formygirls wrote: I started out as stage 2a also. Now I am stage 3c/d....I don't even know. My initial tumor was 2 cms through u/s guided biopsy. Then they felt a node and my stage went higher. I had another biopsy where they removed a 7.5 cms tumor and I still had tumors left in me. I then had a MRI which bunch of nodes matted together. So I don't even know what my stage is anymore. I will never know for sure as I am having neo-adj chemo and hopefully most of the tumor will be gone when they do the mast. Every doctor visit and report has made things worse. Yesterday I had a followup MRI which was the first positive report since the whole thing started. It actually showed improvement in the tumor because of chemo. ",
      "MessageIndex": 20,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/702880",
      "Title": "From Stage 1 to stage III a Bibbie Lindaip"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 16, 2012 11:49AM formygirls wrote: Great news! Congratulations.",
      "MessageIndex": 4,
      "PostDate": "16/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785933",
      "Title": "It's working!! 33skidoo justjudie"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 17, 2012 07:46AM formygirls wrote: Ativan came to my rescue last night also. I generally take an Ambien to sleep but with all my meds was confused if I had taken it or nor and did not want to overdose on Ambien. 1.30, 2.0, kept waking up and tossing and turning. Got and went to the restroom in darkness and came back and put one leg on the bed and but too close to the edge and quickly fell to the floor on top of the charging iPad, kindle and all my bags of meds. Finally took an Ativan and slept from 2.30 to 7.00.",
      "MessageIndex": 38,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785574",
      "Title": "You may be taking too much ativan...... K-Lo K-Lo"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 10, 2012 06:38AM formygirls wrote: Great news! What a relief.",
      "MessageIndex": 9,
      "PostDate": "10/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787009",
      "Title": "Tammie??? texasrose361 Cathy2"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 3, 2013 06:40PM formygirls wrote: I miss her posts on the brain mets thread. This thread is often sad and Jodi was always so uplifting and happy despite everything. She lifted us up.",
      "MessageIndex": 8,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804172",
      "Title": "We can send our warm feelings about Jodimomoffour K-Lo Cathy2"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 23, 2012 01:11PM formygirls wrote: Sorry about the progression. Is this the trial? I hope it works for you. clinicaltrials.gov/ct2/show/NC...",
      "MessageIndex": 6,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792441",
      "Title": "mm111 bhd1 bhd1"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Nov 2, 2012 07:09PM - edited Nov 2, 2012 07:10PM by formygirls Good news on the bones and the liver tumor. regarding the new tumors, this happens to me on every CT since being dx in Feb. My bones have stayed stable, my main tumors which were in the left lobe of my liver keep shrinking but new tumors keep coming and growing in the right lobe of my liver. I am ER and PR - but Her2 positive. My MO thinks the cancer in the right lobe may have changed pathology and become triple negative. We are very confused since I have progression in the right lobe and regression in the left lobe. I have spent the last two days researching options with my MO. She wants to biopsy the new tumors to find out if pathology has changed and we should stop using only her2 agents.",
      "MessageIndex": 1,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795830",
      "Title": "Results of CT and Bone Scan SPAMgirl cheery"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 18, 2012 08:08PM formygirls wrote: Michelle, Sorry to see you join this forum. I wish you the best. I wanted to mention that I was triple negative and a liver biopsy showed that I had become her2 positive with Mets so your biopsy is a good idea.",
      "MessageIndex": 47,
      "PostDate": "18/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787587",
      "Title": "Well, here I am... LuvRVing LuvRVing"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Sep 3, 2013 06:30PM formygirls wrote: Tadpole, I wish you peace and comfort. I am sending you lots of hugs. Thank you for updating us. I was just reading your post today with all the songs and thinking of you.",
      "MessageIndex": 3,
      "PostDate": "03/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810362",
      "Title": "Message from Tadpole tadpole pajim"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 10, 2012 11:38AM formygirls wrote: This is such great news. Here is to you and NED forever! Very happy to hear this news.",
      "MessageIndex": 12,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782475",
      "Title": "FIRST TIME WITH NED! MCTHO rosie06ct"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Oct 1, 2013 03:41PM formygirls wrote: Dbla, I really hope Halaven works for you and is not too hard and your dh finds something soon. During progression weeks we should be exempt from ANY bad news.",
      "MessageIndex": 67,
      "PostDate": "01/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811650",
      "Title": "(I Kinda Knew It, But) CRAP!!!!!!!!!!!!!!!!!!!!!!! dbla dbla"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 27, 2013 02:56PM - edited Feb 27, 2013 02:57PM by formygirls Sorry to hear about your progression. I am here if you have any brain mets questions. Been there...still doing it.",
      "MessageIndex": 18,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801111",
      "Title": "New to this Group Kodapants vickib"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 12, 2012 10:56AM formygirls wrote: Her children will be in my prayers. My condolences to you and her family and friends. ",
      "MessageIndex": 15,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784030",
      "Title": "A sad update on Suze 35 Suze35 Janie-bug"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 1, 2013 02:33PM formygirls wrote: Have you had a recent CT of the liver? That would help rule out many problems.",
      "MessageIndex": 10,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804071",
      "Title": "Elevated AST and ALT levels Angelm Europa"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 13, 2012 12:19AM formygirls wrote: Nakita, These videos are inspiring. I wish you all the best. Your daughter is adorable. I really hope and pray the best for you. You and I have the same doctors. I also go to UCSD Moores and the infusion center there. I hope I run into you sometime. I am there at least once or twice a week.",
      "MessageIndex": 4,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789019",
      "Title": "Some inspiration kita bhd1"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Nov 20, 2013 07:10AM formygirls wrote: this is great news. You can let your body recover and enjoy the season. This is a win win.",
      "MessageIndex": 25,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814742",
      "Title": "Completely stymied, but also happily surprised. HELP. Chickadee chrissyb"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 21, 2012 10:45PM formygirls wrote: Kita, I am so happy to read this post. It sounds like you are having a great time and I can only imagine how adorable your dd looks on the horse. I hope you get to see her become a rodeo queen and have many more days like today. Great news on the parp trial also.",
      "MessageIndex": 1,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792375",
      "Title": "What a great day :-) kita exbrnxgrl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Sep 19, 2012 02:33PM formygirls wrote: Trevor, I am so sorry for everything your family is going through. Things sound really hard for Maria. I hope she finds comfort during these difficult times. Hugs. I have no advice.",
      "MessageIndex": 9,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793757",
      "Title": "Can u go back to previous chemos Trevor mw900"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jan 8, 2013 09:38AM formygirls wrote: Kita, Thinking of you. I hope you were able to get home. ((Hugs))",
      "MessageIndex": 38,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798278",
      "Title": "Hospice at 25 oh he'll no! kita stride"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Sep 19, 2013 12:04AM formygirls wrote: So happy to hear it is working. Hope it continues its magic for a very very long time.",
      "MessageIndex": 15,
      "PostDate": "19/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811230",
      "Title": "Halaven is Working!! raro redwolf8812"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: I have another question for all the experts here. I went for a second opinion two weeks ago and they relooked at my slides. Initially I had been diagnosed with grade 3 triple negative 7.5 cms tumor that was invasive (IDC) and staged as IIIA and going through neo adjuvant therapy. I will have a bilat mast after chemo. My new pathology report from the cancer center says I have both IDC and DCIS! And my DCIS tumor is ER+70% and PR+ 30% while IDC is triple negative. How could they have missed this? I am still new to this and do not know much about DCIS (figured I did not have it so have not researched it yet) but is pretty common to also have DCIS with ? I assume this will not impact my treatment except maybe add hormonal theraphy for the DCIS. Thanks. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/703560",
      "Title": "Second opinion pathology is different!! formygirls myheidiscrapbooking"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jan 6, 2013 09:00PM formygirls wrote: Kita posted an update on her caring page. I am so sad and cannot believe that no other options are available. She is such a lovely lady.",
      "MessageIndex": 25,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798278",
      "Title": "Hospice at 25 oh he'll no! kita stride"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jan 6, 2013 10:28PM formygirls wrote: Caryn, I have copied the link below www.caringbridge.org/visit/nak... Let me know if you have trouble accessing it. She is waiting for a military flight to be transported back home to hospice. She has also rehomed her puppy.",
      "MessageIndex": 27,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798278",
      "Title": "Hospice at 25 oh he'll no! kita stride"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 25, 2012 07:37AM - edited Apr 25, 2012 07:53AM by formygirls I cannot believe that Tina has died. She had not been to the boards this month and I was afraid. I am so sorry to hear this news. I have no advise. My situation is bad and I have accepted that I am dying soon and have forgotten how to live and it is hard to be in denial when you are always sick. Every scan brings more bad news and I feel like I am slowly walking towards the gallows. After getting horrible results on Monday, I spent all day yesterday in an Ativan haze and it helped as i was not sobbing non stop. Faith does not provide comfort nor does having a bucket list. But doing small things with my kids makes them very happy (we baked pies on the weekend). I try to do the small things I can and the kids are happy to lie down and read with me. I have always admired your approach and how you seem to be in the present. Why change if you are happy? I am inspired by how you to choose to live. Death when it comes will make it itself very real. So why change your life now? I am trying to become more like you:)",
      "MessageIndex": 7,
      "PostDate": "25/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786425",
      "Title": "Trying to find a balance... alesta29 alesta29"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 21, 2013 06:37PM formygirls wrote: Mandy, I have leptomenginal mets. I have had six doses of intrathecal chemo through spinal taps for them last summer.The chemos were depocyt and methotrexate. These were given in addition to the systemic chemo.",
      "MessageIndex": 10,
      "PostDate": "21/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798456",
      "Title": "Leptomeningeal Metastases or Carcinomatous meningitis in Brain mandymoo mike3121"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Nov 18, 2013 07:14PM formygirls wrote: I have had it but mine were given through a spinal tap every time. I had to take steriods for a week with each tx. I did not get the omaya port at that time as my neuro onc was more comfortable with the spinal tap procedure. I cannot add much in terms of SE as I had on the same day as four other chemos which were both IT through spinal tap and IV chemo. I got six txs every three weeks. This was last summer. Good luck to your mom.",
      "MessageIndex": 39,
      "PostDate": "18/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798456",
      "Title": "Leptomeningeal Metastases or Carcinomatous meningitis in Brain mandymoo mike3121"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 13, 2012 05:39PM formygirls wrote: That is awesome news. Congrats! Enjoy NED forever.",
      "MessageIndex": 87,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788744",
      "Title": "Tooth - sinus infection, seriously ill CoolBreeze bhd1"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 9, 2012 12:41PM formygirls wrote: No tips on Xeloda but was thinking of you. Hope you got the Xeloda today and all is well and it kicks the cancer.",
      "MessageIndex": 4,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783836",
      "Title": "Xeloda tomorrow twinsmom96 lovehertons"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 2, 2008 04:59PM formygirls wrote: Deb, Hopefully you will get great news tomorrow. Thinking and praying for good results for you.",
      "MessageIndex": 38,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706593",
      "Title": "OK...I know this is so predictable, but I'm spooked! AlaskaDeb deborye"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 14, 2012 01:17PM formygirls wrote: My condolences to her family and friends. It really hurts to see all these young lives being taken by this disease. ",
      "MessageIndex": 30,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784098",
      "Title": "My hero, Deep81, is an angel BlueCowgirl Sugar77"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Sep 24, 2012 04:36AM formygirls wrote: Sending healing wishes and and happy birthday for Monday.",
      "MessageIndex": 68,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793873",
      "Title": "Scuttlers is having surgery today justjudie nancyh"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Sep 21, 2012 01:50PM formygirls wrote: Diane, I am happy you are doing well with a good quality of life. I wish you many more good years.",
      "MessageIndex": 3,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793844",
      "Title": "My cancerversary DC197 DC197"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 8, 2013 07:10AM formygirls wrote: 21",
      "MessageIndex": 20,
      "PostDate": "08/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 22, 2013 10:00AM formygirls wrote: Jennifer, Congratulations! Wishing you many many years more. This is so great to hear.",
      "MessageIndex": 1,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800871",
      "Title": "5 Years Out! JeninMichigan Jac53"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 23, 2013 01:43PM formygirls wrote: It is so wonderful to read this news. We need posts like this. Congrats to you and your family.",
      "MessageIndex": 12,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809787",
      "Title": "OT good news Padiddle DianeKS"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 6, 2013 12:57PM formygirls wrote: Happy birthday Stephanie. Hugs to both of you.",
      "MessageIndex": 15,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804276",
      "Title": "Steph's 34th birthday...I love you my sweet sis. Travelingpants2 Angelfalls"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Oct 11, 2012 01:00PM formygirls wrote: Congratulations! Hope you have many many more.",
      "MessageIndex": 39,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794782",
      "Title": "I made it to the big 50!!!! LuAnnH Annie62"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 16, 2008 01:23PM formygirls wrote: Hope you get B9 results but there is no need to wait 2-3 days to get MRI results these days. In most hospitals(atleast the ones I use) radiologists read the scans the same day and your dr should have it right away. In my case, I get results within 2-3 hours of the scan. The radiologist reads it within a couple if hours and my onc will either email me the report or call me right away as she knows how stressful waiting is. I know not all doctors respond so quickly but you should call your onc today and let them know you are waiting.",
      "MessageIndex": 1,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/705655",
      "Title": "Waiting AGAIN!!! austin2k3 awb"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 19, 2012 10:01AM - edited Feb 19, 2012 10:02AM by formygirls I had very high fevers for a few days (my infusion was on Wed) with chills and headache. Today my fever might come down. But I also had Gezmar with Cisplatin along with Zometa and the onc said Zometa could be the culprit. But she said my kind of fevers for 3-4 days were very rare with Zometa, she called it acute phase reaction and said that it should not happen again.",
      "MessageIndex": 6,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782896",
      "Title": "Zometa Godschild2 sandilee"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 8, 2013 06:32PM formygirls wrote: Sue, Congrats on the good news. I had the same pain on Navelbine. We did all kinds of tests and tried all kinds of medicines. Ultimately, it went away on its own after a few weeks.We figured it was some kind of intestinal neuropathy. The pain was intense and horrible but stopped. I did have progression soon after it stopped and moved on to the next chemo. Good luck to you.",
      "MessageIndex": 17,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808986",
      "Title": "Could use a good idea or two sueopp formygirls"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 22, 2013 06:22PM formygirls wrote: Nicole, All the best with the MRI. I hope you get great news. My rad oncs always assure me that breast mets are very responsive to radiation in the brain so I hope the same for you. I have my follow up in 3 weeks so I feel your worry. ((Hugs))",
      "MessageIndex": 2,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809749",
      "Title": "First MRI after WBR & nervous... nmiller1978 teacher911"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 3, 2008 04:19PM formygirls wrote: I also found another study that said if you got neutropina/infection during chemo your survival rate goes down. I gave up trying to research at this point. There is way too much bad news out there and no way of predicting which side of the statistic I will be on anyway. Most people get one or the other se during chemo--atleast that is my rational since I got low wbc with both my txs.:)",
      "MessageIndex": 5,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/703342",
      "Title": "Anemia during treatment Member_of_the_Club wallan"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 25, 2008 01:15PM formygirls wrote: Bridget, I am also triple negative stage 3 with nodes involved. I had a bone scan, chest x-ray, breast mri and ab/pelvis/liver MRI to rule out mets when I was dx. I went for multiple opinions and they all said these scans were necessary for me. None of them requested PET for me since I had the other scans and mri done. I realize once tx is done most oncs only scan when symptoms are present but you should insist on these scans atleast once to rule out mets. They should have done them when you were dx. You should push for it now. Do not be afraid to be aggressive and listen to your insticts. Even if you piss doctors off--it is your body and life.",
      "MessageIndex": 7,
      "PostDate": "25/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707975",
      "Title": "protocol on scans??? nobleanna007 nobleanna007"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: I just finished Taxol #2 last week (doing DD Taxol, already completed DD AC) and my nails on my hand and feet feel funny. They hurt when I touch them, have become dark and become longer (like I had a manicure). I am scared to touch them in case they come out. Does that mean they are all going to fall off? Does it hurt when they do? How so do they grow back? Dealing with no hair was bad enough and now this... Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706245",
      "Title": "Nails falling with Taxol? formygirls pacmom"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 29, 2012 03:17PM formygirls wrote: Lori, Just wanted to send positive thoughts your way. I hope this turns out to be nothing.",
      "MessageIndex": 13,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792736",
      "Title": "Are you kidding me????? bourscheid LuAnnH"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 12, 2013 03:08PM formygirls wrote: Kay, I have taken sleep meds since the day I got my mets dx last feb. I take regular Ambien. I have also tried Lunesta and Ambien CR. My MO gives them to me. I cannot sleep anymore without them. I was on steriods and they really messed up my sleep. I used to take the 10 mg Ambien but the last couple of weeks I have started taking a half dose as I felt groggy all day and my short term memory was affected. The half dose has given me some clarity but I do not sleep as well. I was a good sleeper till all this happened. Now I am so anxious all the time and cannot forget this so I need my sleep meds. I think I am addicted to them but it does not really matter anymore.",
      "MessageIndex": 2,
      "PostDate": "12/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801725",
      "Title": "Sleep Meds kayrnic Brendatrue"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 15, 2008 01:07PM formygirls wrote: (((Hugs))))You are in my thoughts and prayers. Wishing you strenght to fight and beat this.",
      "MessageIndex": 13,
      "PostDate": "15/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704020",
      "Title": "Dx with Brain Mets Today TripleNeg snowyday"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 2, 2013 03:42PM formygirls wrote: I was on Tykerb last year for a month and am now back on it. I do not think it works for me as I have progression. But I take it because of the bb barrier and my brain mets are growing. I will soon be starting high pulse dose Tykerb. Take 20 tablets every four days. Helps to cross the barrier better. My current dose is 5 tablets everyday. I take it with Xeloda and Herceptin.",
      "MessageIndex": 1,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804136",
      "Title": "Tykerb Question sueopp hendricks1"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 30, 2008 07:04AM formygirls wrote: Desi, I asked that because your doctor said they reached the chest wall and could not get any more tissue and you have positive margins. I found that my chest wall was involved because of the breast MRI I had. I am having neo adj chemo so I will have surgery after chemo and hopefully they will be able to get negative margins if the chest wall recovers by then. Good luck on Friday. BTW--Are you Indian?",
      "MessageIndex": 6,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/704769",
      "Title": "Question about my path report S3K5 SpunkyGirl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 22, 2013 04:22PM formygirls wrote: I am getting so tired of these comments from people -- I could get hit by a bus anytime so don't worry about death. But last week, my rad onc said that. I expect more from them. I have 15 brain tumors andmlung, liver and bone mets and you are telling me that we have an equal chance of dying. It took all my self restraint to keep quite while dh was smiling as he knows how I hate it when people say that. I love my rad onc so just kept quite. I know people mean well and life is unpredictable but can they all stop saying that or let me know the bus route so I can stand in front of it!",
      "MessageIndex": 862,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 18, 2012 04:36PM formygirls wrote: Awesome news! Great to find out tx is helping.",
      "MessageIndex": 2,
      "PostDate": "18/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786048",
      "Title": "They Are Dropping lukejessesmom lwd"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jul 24, 2013 12:07PM formygirls wrote: Wishing you a very happy birthday and a quick recovery .",
      "MessageIndex": 90,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807898",
      "Title": "Update on me - brain surgery scheduled nancyh RonnieKay"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 17, 2008 05:54PM - edited Apr 17, 2008 05:55PM by formygirls Diedre, Good luck tomorrow. If you want, call the dr and get the news so you do not spend the night stressing. I needed to know the results right away and waiting was very stressful. I did that but it is your personal choice. Will be thinking of you.",
      "MessageIndex": 50,
      "PostDate": "17/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703885",
      "Title": "I have surgery on Monday Deidre flower123"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 17, 2008 05:56PM formygirls wrote: I cannot believe that they would not give the results over the phone and make you wait another day. When will doctors realize the stress they put us under..I get ssooooo mad!!!",
      "MessageIndex": 52,
      "PostDate": "17/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703885",
      "Title": "I have surgery on Monday Deidre flower123"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 2, 2012 09:19AM formygirls wrote: Other than the clinical trial trial in Chicago for spinal mets, I have read some posts from people on the Her2 support group discussion board. A few people have tried it there. Good luck.",
      "MessageIndex": 3,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786790",
      "Title": "Intrathecal (IT) Herceptin for brain mets marvass hhfp"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 13, 2012 09:41PM formygirls wrote: Bumping for Janette",
      "MessageIndex": 26,
      "PostDate": "13/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786790",
      "Title": "Intrathecal (IT) Herceptin for brain mets marvass hhfp"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 2, 2012 09:27AM formygirls wrote:   HER2 Support Group Forums > her2group I do not know how to post links with my ipad yet and was only able to copy the first message from the discussion thread on the site. complete response of leptomeningeal her2+ bc to intrathecal herceptin (case report other than our member Courtney) Complete response in HER2+ leptomeningeal carcinomatosis from breast cancer with intrathecal trastuzumab Mafalda Oliveira • Sofia Braga • Jose ́ Lu ́ıs Passos-Coelho • Ricardo Fonseca • Joa ̃o Oliveira Received: 15 February 2011 / Accepted: 16 February 2011 / Published online: 3 March 2011 Ó Springer Science+Business Media, LLC. 2011 M. Oliveira (&) 􏰀 J. L. Passos-Coelho 􏰀 J. Oliveira Medical Oncology Department, Instituto Portugueˆs de Oncologia de Lisboa Francisco Gentil, Rua Professor Lima Basto, 1099-023 Lisbon, Portugal e-mail: mafalda.moliveira@gmail.com S. Braga Instituto Gulbenkian de Cieˆncia, Rua da Quinta Grande, 6, P-2780-156 Oeiras, Portugal R. Fonseca Pathology Department, Instituto Portugueˆs de Oncologia de Lisboa Francisco Gentil, Rua Professor Lima Basto, 1099-023 Lisbon, Portuga BRIEF REPORT Abstract Introduction Leptomeningeal carcinomatosis (LC) is a rare but rapidly fatal event in the natural history of breast cancer [1]. HER2? breast cancer has an increased risk of central nervous system (CNS) metastases [2] but there are little data on LC frequency in these tumors [3]. Trastuzumab, a monoclonal antibody against the extracellular domain of the HER2 receptor, is highly effective in systemic control of HER2? metastatic breast cancer [4] but it is not clear if it can penetrate the intact blood brain barrier (BBB) [5]. We report the case of a patient who received weekly intrathecal (IT) trastuzumab for LC from HER2? breast cancer for 18 months, with impressive neurological benefit. Case report A 40 year-old woman presented in April 2003 with a left- sided cT4bN1M0 estrogen receptor (ER) positive (70% of cells) invasive ductal carcinoma. She received six cycles of neoadjuvant chemotherapy (5-FU 500 mg/m2, epirubicin 100 mg/m. Trastuzumab, a monoclonal antibody against the HER2 receptor, is a major breakthrough in the treat- ment of HER2? breast cancer. However, its high molec- ular weight precludes it from crossing the intact blood– brain barrier, making the central nervous system a sanc- tuary to HER2? breast cancer metastases. We prospec- tively assessed functional outcome and toxicity of administering trastuzumab directly into the cerebrospinal fluid of a patient with leptomeningeal carcinomatosis (LC) and brain metastases from HER2? breast cancer that had already been treated with other intrathecal chemotherapy, with no benefit. Upon signed informed consent, weekly lumbar puncture with administration of trastuzumab 25 mg was begun to a 44 year-old women with metastatic breast cancer (lymph node, bone, lung, and liver involvement) previously treated with tamoxifen, letrozole, anthracy- clines, taxanes, capecitabine, intravenous trastuzumab, and lapatinib. She received 67 weekly administrations of intrathecal trastuzumab with marked clinical improvement and no adverse events. She survived 27 months after LC diagnosis. A complete leptomeningeal response, with no evidence of leptomeningeal metastasis at necropsy, was achieved. We believe that intrathecal trastuzumab admin- istration should be prospectively evaluated to confirm clinical activity and optimize dose, schedule, and duration of treatment. Keywords Intrathecal trastuzumab 􏰀 Leptomeningeal carcinomatosis 􏰀 HER2? breast cancer",
      "MessageIndex": 4,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786790",
      "Title": "Intrathecal (IT) Herceptin for brain mets marvass hhfp"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Nov 12, 2013 07:23PM formygirls wrote: how about IT Herceptin? Is gamma knife an option this time? I am very sorry to hear this. I have also have had two knife txs and WBR last month. I suspect I will be in your position very soon as I do not and cannot do WBR again. Try to find IT chemos. The Her2 forum has many ladies doing that. It is not std protocol so ins is a problem. I wish I could offer more. Is the neratinib trial for brain mets an option? Good luck and lots of hugs.",
      "MessageIndex": 1,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814457",
      "Title": "Help! How can this be my only option Bondgirl DancingVeggie"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Sep 1, 2012 02:04AM formygirls wrote: Tilly, Hugs. Lots of them. Life is really too short to do things that we don't want to do! You should not have to do all this visits and taxi trips---they sound exhausting. I have enough mets that i can always come up with an excuse to not visit/do things if I don't want to--brain, lungs, liver etc something is gong on. Your wig sounds great and I hope you have a fabulous 50th. Some people are just insensitive. I hope things ease up and your liver function and jaundice improve. Seriously, even with me I feel like my brain and liver are battling one another. Hope you feel fabulous soon and write a fun post about your birthday plans.",
      "MessageIndex": 12,
      "PostDate": "01/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792843",
      "Title": "Sorry - this is a rant Tillycat marywh"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Oct 19, 2013 01:22PM formygirls wrote: I am so sorry to hear this. I hope WBR works. I am going thought it right now and am halfway done. My biggest SE is fatigue. ((Hugs)) let me know if you have any questions.",
      "MessageIndex": 13,
      "PostDate": "19/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813118",
      "Title": "Don't even have a title for this crap Chickadee lulubee"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 16, 2013 07:42PM formygirls wrote: Congratulations. I hope you have many such happy times ahead.",
      "MessageIndex": 15,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803385",
      "Title": "Dropping by to say Hello tammie tammie"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Dec 7, 2013 02:10AM formygirls wrote: I have also lost my hair three times and am currently bald. The first time was hard but I knew it would come back as i was stage 3:) i had glorious long hair for three years after that. The other two times have been with mets and the current one is with WBR. Everyone treats you differently because you look sick. I have never worn wigs but I was on disability right away and did not have to face the world. In hindsight, if I had to do it again I would wear wigs and use makeup to force myself to be normal and forget this cancer for some time. I am 42 and looking at myself in the mirror is the hardest for me. It is tough being bald in the winter. I live in S Cal so even though it is not bad it still feels cold to my bald head:). I do wear a ski cap when my kids friends come home so I do not embarrass my girls.",
      "MessageIndex": 7,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/815424",
      "Title": "Please share your experience after losing your hair lotusblossom marywh"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jan 6, 2013 11:57PM formygirls wrote: My thoughts and prayers are with you. I loved the pictures you posted of the holidays. I hope she makes a quick recovery.",
      "MessageIndex": 46,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797691",
      "Title": "Mrs. Five Alive in Hospital FiveAlive lilylady"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 3, 2012 02:46PM formygirls wrote: Great news!",
      "MessageIndex": 11,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791506",
      "Title": "Finally Good NEWS!!!! dawn16 apple"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Dec 17, 2013 09:19PM formygirls wrote: LuAnn, I have had red and itchy bumps on my body with affinitor and Xeloda. This was after i had been on these drugs for a couple of months. My onc first said it was shingles and with the anti viral meds and anti biotics it would go away. But it kept coming and I stopped the meds.---The anti viral and the antibiotics. It was taking the same amount of time to heal. After a couple of months, the bumps have stopped. I was just noticing today how my arms were full of dark spots from the bumps. I hope you find a solution and get good news. ",
      "MessageIndex": 5,
      "PostDate": "17/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/815896",
      "Title": "Need Help!!! Can't figure out what is happening LuAnnH LuAnnH"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 8, 2012 10:23PM formygirls wrote: Laurie, I have two girls who are 8 and 11. Their care has been the hardest part. My dh is young and is only 39, i am 40. But stuff happens and age has nothing to do with it as we know. My parents live in India. I am very lucky as they have agreed to leave everything and live with my dh and kids. My mom is great and will raise the kids exactly as I wanted to. She is already running my home as I am in bed often really sick from chemos. I Know that is not an option for most people. It is very hard as my parents have to leave their entire life to move here but they are willing to do that for the kids. My dh cannot raise the kids on his own. It is bittersweet to watch my parents run the home with dh and the kids doing fine. It is reassuring to know things wil be fine and life is running smoothly while i stay holed up in bed. If something were to happen to my dh, my younger brother who lives across the country would get the kids. My parents are too old to take legal responsibility. How that would work out from a parctical school, house standpoint, I do not know but I am not worried about that option yet. My brother and his wife are great and i know they will do the right things.",
      "MessageIndex": 2,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791699",
      "Title": "Kids and who cares for them alesta29 apple"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 9, 2008 12:30PM - edited May 9, 2008 12:32PM by formygirls Joni, I had an MRI with contrast March 1 which indicated a 14mm spot which the radiologist said was an hemangioma but to investigate for mets since I have bc. My breast MRI last week was also with contrast but indicated a 20mm spot on my liver--just happened to see it. On Monday, I am getting another liver MRI with contrast. At this point, I am hoping for a miracle that says the breast MRI was wrong and the spot looks the same on the liver MRI. The radiologist saw blood vessels in the spot during the breast MRI which means it is some tumor--doesn't it?. Also I do not think hemangiomas grow in size and only cancer grows. That is why I am super worried. But why would it grow on chemo when the BC cancer went in remission? My onc does not like to do a biopsy either so we will see what happens Monday.  I just need to be patient.....be patient...be calm...Thank you.",
      "MessageIndex": 4,
      "PostDate": "09/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705246",
      "Title": "Help with liver MRI formygirls LuAnnH"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 13, 2008 05:56AM formygirls wrote: Thank you everyone. I just did my liver MRI today and got great news. The breast MRI was wrong and the spot did not increase in size. It is stable despite the 2 months of chemo so the radiologist is calling it a hemangioma and no biopsy is recommended.",
      "MessageIndex": 6,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705246",
      "Title": "Help with liver MRI formygirls LuAnnH"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 11, 2013 03:04PM formygirls wrote: LuAnn, Thinking of you and I hope you get to home soon. Happy Mother's Day to you. I hope your doctors can come up with a solution with bug season starting.",
      "MessageIndex": 14,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804510",
      "Title": "Quick update, back in the hospital.... LuAnnH dmacw"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 5, 2013 10:59AM formygirls wrote: My condolences to her family. She was so young..this is unfair:(",
      "MessageIndex": 11,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802759",
      "Title": "Elisha82 is an angel debbiej Gingerbrew"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 10, 2012 04:54PM formygirls wrote: Penny, You might want to ask about a pain med called Ultrum/Tramadol. I have mets in the liver and can be sometimes allergic to ibuprofen. One of the dr mentioned Ultrum as it is metabolized by the Kidneys. ",
      "MessageIndex": 3,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783923",
      "Title": "Wow - lower body aches & pains from new chemo redwolf8812 jeanne46"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: I would love advice from stage 4 diabetics. I was dx with mets in feb this year and just last month also became diabetic. I was not diabetic before but had gestational diabeties with both my children so i am familiar with insulin and carb counting. I have been on decadron a lot with my txs and the cancer along with decadron has made me diabetic last month. Even without steriods my fasting is around 150 and is 250 to 300 fasting with decadron. My sugars stay in the 250- 350 range all day. My oncs say insulin is too dangerous for me since I do not eat well, have nausea and I take steriods inconsistently. They have put me on metformin and the sugar numbers above are with metformin. They have told me to ignore my sugars as I have bigger problems, the impact of high sugars takes place over long term and I will not be around. I met three oncs and they all said the same thing. Insulin would be dangerous and diabeties was the least of my problems. I am vegetarian and the only thing that I can eat these days is fresh fruit and smoothies. I cannot handle eggs or any protein. Anyway just venting if diabetic veterans have any suggestions on handling decadron or veg protien ideas. I am losing weight as I am scared to eat anything with my sugars being so high. I wish I had not developed a meat aversion during chemo but I just cannot handle meat anymore. I know drs are telling to ignore sugars but it is hard to accept that I will not live long enough to deal with the implications of diabeties even though I know it is true. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791464",
      "Title": "Advise from stage 4 diabetics formygirls Mzmerz"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 2, 2012 05:55PM formygirls wrote: Thank you for the tips. You gave me good suggestions. I bought some Muscle milk tonight. I do make things like lentil soups for most meals but I have reached a point where even with metformin and good diet I cannot bring my sugars down without insulin because of the steriods. With the decadron, my sugars stay very high. I am trying hard to ignore my sugars as there is nothing I can do bring my sugars down with diet alone. Onc gave me a long lecture on forgetting my diabeties completely and eating whatever I want, whenever I want. I guess my onc knows how bad things are and she is trying to tell me to live life. I need to start doing that but it is hard. Thank you for letting me vent and understanding my challenge. Just reading your responses makes me feel like some one gets me and does not think I am crazy for thinking about this when I have so many other problems. I need to let go and accept that things will be like this with steriods.",
      "MessageIndex": 6,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791464",
      "Title": "Advise from stage 4 diabetics formygirls Mzmerz"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 30, 2008 06:40AM formygirls wrote: Do you also have chest wall involvement? As the other ladies have said, they generally go back if they have positive margins. What does your onc say about this? Are they just going to use chemo to address the positive margins?",
      "MessageIndex": 4,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/704769",
      "Title": "Question about my path report S3K5 SpunkyGirl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Sep 11, 2012 01:13AM - edited Sep 11, 2012 01:13AM by formygirls Dear Soleil, Please do not be hard on yourself. There was no way for you to know how you would react to Affinotor. I do not understand why your onc thinks you are now allergic to all chemos. I hope they have a good plan for you on Thursday. I will be thinking of you. I enjoy reading your posts and admire your strength and attitude.",
      "MessageIndex": 22,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793326",
      "Title": "Holding my breath and trying not to worry soleil505 soleil505"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 21, 2012 05:31PM formygirls wrote: Sorry you are in so much pain. I have no suggestions but was wondering if you could ask your onc to prescribe an anti spasmodic med. Those are supposed to help with muscle spams. I cannot recall the name right now. I really hope you feel better. You are getting a strong combo and I hope this gets you to NED again.",
      "MessageIndex": 2,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786239",
      "Title": "Combined drugs with multiple symptoms scuttlers bhd1"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 20, 2008 08:03PM formygirls wrote: Minz, There are many options but many ladies get Taxol or Taxotore in the next round. If Her2+++ she will probably get Herception also. I will finish my 4 sessions of AC on Tuesday and will then begin 4 sessions of Taxol.",
      "MessageIndex": 2,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704258",
      "Title": "Chemo - Round 2? MinAZ formygirls"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Oct 20, 2013 07:07AM formygirls wrote: I hope the day is getting better. I wish I could take this misery away from all of us. This is yet another bump and this too shall pass.",
      "MessageIndex": 51,
      "PostDate": "20/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813118",
      "Title": "Don't even have a title for this crap Chickadee lulubee"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 23, 2012 08:25AM formygirls wrote: Congratulations. Thanks for sharing. Hoping for many mre anniversaries.",
      "MessageIndex": 9,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792404",
      "Title": "It's my FIVE year metsiversary! 33skidoo Swannay"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 24, 2013 03:17PM formygirls wrote: So sorry to read this. My condolences to you and your family.",
      "MessageIndex": 41,
      "PostDate": "24/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800719",
      "Title": "Mrs. FiveAlive? Sheff GatorGal"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 19, 2008 02:59PM formygirls wrote: I did get a second opinion on tx and path and for me it was worth it. Especially path as it plays a big role in your tx.Both recommened same tx and made me feel better and the second path report did give me new information. My ins covered everything. I am trying to second opinions at each change in tx(neo adj chemo, now surgery and will do for rads) as my ins will pay.But I think it is worth it even if your ins does not cover.",
      "MessageIndex": 6,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707607",
      "Title": "Anyone ever think about getting a 2nd path opinion? BustersMom drcrisc"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 8, 2012 09:10AM formygirls wrote: I have question for all you ladies on Navelbine. I started chemo 4 weeks ago. Week 1 was Gemzar and Cisplatin and then stitched to Navelbine and Herceptin after my path turned out to be HER2+. I had Navelbine week 2 and week 3. Yesterday when I went for infusion (week 4), they did not give me Navelbine as my ANS was only 594(abs neutrophils .6). The nurse said no to Neupogen or Neulasta and they asked me to come back next week. Do you get shots on a regular basis to prevent this? Does everyone get a week off? Right now I am scheduled for tx every week with no week off. Onc wants me to complete 2 cycles (8 txs) and then get a PET. I am wondering whether I should insist on Neupogen to prevent this happening in the future. I think Neulasta is not an option since I have weekly tx. I hate missing chemo at this stage when the cancer is moving so fast. Thanks ",
      "MessageIndex": 52,
      "PostDate": "08/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781234",
      "Title": "Need Info on Navelbine LuAnnH jcb51"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 27, 2013 11:48AM formygirls wrote: I am so sorry to read this. She was so supportive on these boards. My condolences to her family.",
      "MessageIndex": 20,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802377",
      "Title": "lynn1 bhd1 Leah_S"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jan 1, 2014 07:17PM formygirls wrote: I was first dx with brain mets in may 2012. I never had a brain scan before that. They are\\were asymptomatic. I have had 9 gamma txs first round in May. my rad onc did not do Wbr but did gamma but we knew we would not get them all. Six  IT chemo through spinal taps after the follow up MRI in summer 2012 as the neuro onc felt I had lepto menengial mets. I have had 5 gamma tx over 3 days last summer and finally 10 sessions of WBR this halloween. The txs itself are not bad but WBR has given me a lot of fatigue. It is not the end but it is what it is and you have to meet with your oncs and develop a plan. Throughout, I have had brain MRI's every 2-3 months. I have my first post  WBR MRI on the 17th. I have a neuro oncologist along with a radiation onc looking at my scans. My main onc stays away from the brain and she treats my systemic disease which is everywhere--- lungs, liver and bones and nodes. If you have questions, please PM me.",
      "MessageIndex": 10,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816382",
      "Title": "I now have multiple brain mets. So scared! Please help! cmhartley MusicLover"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 11, 2012 09:53AM formygirls wrote: Tammie, I hope you feel much better at home and this mass is just an infection that disappears. They think that is a possibility so that is good. Praying for a clean scan when they recan in 10 days. Hugs",
      "MessageIndex": 3,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788942",
      "Title": "Leaving hospital waiting on lung biopsy tammie myangels"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jul 9, 2012 12:01AM - edited Jul 9, 2012 12:02AM by formygirls Kita, I am doing the same thing right now with my girls. They read in bed while I lie down. I wanted to go the beach so badly but am afraid of being more than a min away from the bathroom. Major big D because of chemo. It is hot in SD today.",
      "MessageIndex": 8,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790263",
      "Title": "Just like my mom kita kita"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 9, 2012 08:14PM formygirls wrote: Wonderrful news! Hope you get a long run with Xeloda and the stomach thing turns out to be nothing.",
      "MessageIndex": 6,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783902",
      "Title": "Still neckin' with that Stable Boy dreamwriter nancyh"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 16, 2013 12:16PM formygirls wrote: Great news. I am happy you have a chemo that is working. I hope it continues for a very very long time. You need good news!",
      "MessageIndex": 29,
      "PostDate": "16/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801870",
      "Title": "Gemzar is working!!! LuvRVing Heidihill"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 4, 2012 09:52AM formygirls wrote: I am sorry to hear this. I really hope Xeloda works for you and does it's magic.",
      "MessageIndex": 4,
      "PostDate": "04/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783587",
      "Title": "More mets twinsmom96 seaperch"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 15, 2013 10:45AM formygirls wrote: Ebru, Thinking of you and hoping you have great results on Xeloda with minimal side effects.",
      "MessageIndex": 63,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801657",
      "Title": "scanxiety time..all over again stagefree formygirls"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 26, 2012 12:56AM formygirls wrote: Congratulations! Hope you have many many more to come and watch your girls grow up. And like you said, I hope you forget them all as you busy living.",
      "MessageIndex": 1,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786439",
      "Title": "I forgot my 2 year anniversary! 3littlegirls steelrose"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 20, 2012 09:23AM formygirls wrote: Amy, Has your dr discussed the Yttrium-90 (radioactive isotopes implanted in  liver) procedure with you? I have widespread mets to my liver and they mentioned it as an option to me. I wish you good luck with your decisions.",
      "MessageIndex": 27,
      "PostDate": "20/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782064",
      "Title": "Stopping treatment & need feedback ameliak CoolBreeze"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jan 26, 2014 11:16PM formygirls wrote: congrats. I hope you have many, many more.",
      "MessageIndex": 8,
      "PostDate": "26/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817373",
      "Title": "Seven Years, Six with Mets Triple Negative TonyaB DivineMrsM"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 5, 2013 02:31PM formygirls wrote: I am so sad to read this. My condolences to her boys whom she loved so much.",
      "MessageIndex": 35,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801402",
      "Title": "Luke and Jesse's Mom, Cindy...Heaven's Newest Angel SarahsMom vickib"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Nov 12, 2013 07:25PM formygirls wrote: also wanted to add I have been on Xeloda and pulse dose of tykerb since summer and brain mets progressed on that. Not effective for me but I am still taking it as I have progressed on most chemos.",
      "MessageIndex": 2,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814457",
      "Title": "Help! How can this be my only option Bondgirl DancingVeggie"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: HI ladies, I hope you can help with this. Some background. I had a liver CT scan in Oct 07 which showed 2 spots on my liver 10mm on the left and 17 mm on the right. Feb 22 08 I was diagnosed with BC. I had a followup bone scan, chest xray and MRI of liver, abdomen and pelvis and all were ok but the liver MRI showed a 14mm spot on the left side and no spot on the right side. My bc is very aggressive, large tumor with multiple nodes and my onc started me on neo adj chemo right away. She said she would not biopsy the liver yet as it looked like an hemangioma but follow up with another liver MRI half way through chemo. I just finished 4 AC tx and had a followup breast MRI last week which showed a partial remission in the breast with improvements in chest wall, most lymph nodes now look normal and 2/3 reduction in the tumor. However the radiologist happened to see a 20mm spot on my liver on the left side. I have a liver MRI scheduled for Monday but I am going crazy with worry. My onc had said that if the spot had not changed in size and my breast showed remission, she would assume it was not mets. But from the breast MRI , it appears that the spot has grown. She tried to reassure me, that we need to compare the new liver MRI to the liver MRI from 2 months ago and not read too much into what the breast MRI says. She said her logic is if it was mets is would have the same biology and there is no reason for it go grow if breast cancer shows remission. What are your thoughts on this? I know I will have answers in a couple of weeks. If the liver MRI on Monday shows an increase I will push for a biopsy. But is it possible it is mets and the breast tumor is responding so well to chemo and the liver continues to grow. I am going crazy with worry and have been living with this uncertainity of the liver for over two months now.Any advice? Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705246",
      "Title": "Help with liver MRI formygirls LuAnnH"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 14, 2013 07:37PM formygirls wrote: Blondie, Here is a Halaven thread. Is this what you are looking for? community.breastcancer.org/top...",
      "MessageIndex": 10,
      "PostDate": "14/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809271",
      "Title": "anyone with eribulin / halaven experience? blondie1 cmhartley"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 9, 2012 01:14AM formygirls wrote: This is great news. I have been thinking about your appt and was really happy to see your post. Nothing worrisome is awesome!!",
      "MessageIndex": 129,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783699",
      "Title": "PET Results CoolBreeze ruthbru"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Oct 22, 2013 09:45AM formygirls wrote: chickadee, Hope your first WBR went well today. I finished # 6 today. Hanging in there and thinking of you.",
      "MessageIndex": 113,
      "PostDate": "22/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813118",
      "Title": "Don't even have a title for this crap Chickadee lulubee"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 10, 2012 07:01PM formygirls wrote: Thanks. Looks like folks are 3 weeks on, 1 week off. I was not on any week off, always on. This was my 4th week which I missed because of bad blood work. I am not finding Navelbine as easy as it is supposed to be. My onc always tells me that she has a 84 old patient on it with no problems. I think she is trying to tell me something:) This week is definitely harder with very low energy--difficult to crawl out of bed.  Good luck everyone--hopefully Navelbine is working it's magic for all of us on it. ",
      "MessageIndex": 55,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781234",
      "Title": "Need Info on Navelbine LuAnnH jcb51"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 21, 2012 08:07AM formygirls wrote: Laurie, This sucks. So not the news I was hoping to read from you today. Hugs. I am a relatively new brain metser ( was dx a couple of months ago. Ten lesions with the largest being around 1 cm). They did stereotactic rads and I will have an MRI next month to checked if it worked. You will get through this also as we have no choice. I am encouraged by the success stories I read here. I used Ativan heavily to help me get through the initial days. I have not told my kids yet. They already know about my stage 4 dx and the implications of this so I left this detail and news out. My kids are younger so I could get away. Thinking of you.",
      "MessageIndex": 7,
      "PostDate": "21/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787820",
      "Title": "And the crap news today is... alesta29 LauraOntario"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 22, 2012 09:34AM formygirls wrote: My condolences to her family and her boys. Rest in peace.",
      "MessageIndex": 48,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786065",
      "Title": "WingsofHope - Dana Alaina MJLToday"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 12, 2012 03:52PM - edited Mar 12, 2012 03:54PM by formygirls Q--you should call your dr so you can get relief. Did anyone get mouth sores when on Navelbine? I called my onc today as I have developed mouth sores and wanted Magic Mouthwash but the nurse wanted me to come in tommorow as I should not get any mouth sores with Navelbine. I was not worried as I thought all chemos cause mouth sores. The nurse practioner got me worried.",
      "MessageIndex": 64,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781234",
      "Title": "Need Info on Navelbine LuAnnH jcb51"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Sep 25, 2012 11:07PM formygirls wrote: I am so happy. I was worried after I read your post yesterday.",
      "MessageIndex": 11,
      "PostDate": "25/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794027",
      "Title": "I got Approved for SIRT!!!! soleil505 redwolf8812"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 19, 2012 08:53AM - edited Feb 19, 2012 08:55AM by formygirls I also have two kids, 8 and 10. Maybe the diagnosis is too raw and new, but I do not want to create memories. I would like them to forget me as quickly as possible, so they do not hurt and I do not plan on creating anything for them. Everyone is trying to get me to start something for them and how no one can forget their mom. But for me, if they forget me they will not miss me--that is my logic anyway. I may come around one day but I want everyone to forget me so they can move on with their lives. I wish we could all pretend at home that mommy is away on a LONG business trip  and they did not have to face this reality so young. MY dh will be a great parent but I worry constantly how he will cope on his own. I convince myself everyday that I am not indispensable and my kids will not be the only ones to grow up without their mom. They are great kids. I guess what I grieve most daily is more that I will not be able to see what they become as adults, who they marry etc. This is the hardest part of this journey for me. It hurts to even watch them.",
      "MessageIndex": 24,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782737",
      "Title": "Coping as a young mom? rosasmommy klynnz"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: Ladies. I do not know how to ride this roller coaster. Early last month I was dx with extensive mets to lungs, liver, bones and nodes. This was sudden and the extent of mets was very hard to take. I spent all of Feb crying nonstop, but went on disability and started tx. I started an easy chemo Navelbine but am having many s/e. I also had a reaction to the Zometa both times with high fevers. But I was coming to terms with it, my liver numbers began to improve a bit and this forum helped me. I began to hope that I could be one of the lucky ones who get a couple of years. I realize that it could not be much longer since I am hormone negative and will always have chemo.  Then last week I started having non stop headaches. I do not know why--I do have large mouth sores from Navelbine but who knows. With my history, it most likely brain mets. I cannot get myself to get a brain MRI. I have barely come to terms with my existing mets. My brain was the only place left.  I am tired of giving bad news to my family. My chemo will have to stop while I get tx for my brain and then my liver will go haywire. I know I am running ahead without a scan but am unable to stop these thoughts as my head pounds constantly. I know I should get a brain MRI but I cannot bring myself to call my onc. I want to be mentally ready for the next steps. I hate opening my eyes in the morning as I begin to feel my headache again. I wish I could stop tx and end all this but know that I cannot because of my kids. With mets everywhere, I struggle with suffering through tx but know I have to keep trying even if there a small flicker of hope. Left to myself, I know I would get off this train. Sorry for the long post but I needed to vent. I feel like just when I managed to bring myself up, another huge wave is coming again at me. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784280",
      "Title": "Venting--more mets?? formygirls ibcmets"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 17, 2012 07:13PM formygirls wrote: Thank you for your support. I did speak to the chemo nurse and the PA on Friday about this and they did not think this was s/e of chemo or medications as this started last week and I have been on the chemo for a month. I am taking pain meds and they help some but do not take it away completely.They both suggested talking to the onc for a MRI for mets. I do not feel like getting my head out of the sand and would rather not know. But..I know that will not make the problem go away. Sorry--I am feeling down and hope to get the strenght to call the onc on Mon.I know what I have do but  just writing my thoughts and fears in a post and knowing someone gets me helps.",
      "MessageIndex": 7,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784280",
      "Title": "Venting--more mets?? formygirls ibcmets"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Dec 5, 2012 11:26AM formygirls wrote: I am sorry to hear this. I also have brain mets and have young children and just turned 41. This is a scary phase and you will feel better once you have a treatment plan. Your neurosurgeon should help you tomorrow. I try to focus on the current day and not think too much about what could happen and go through the day on auto pilot just enjoying my kids. I would ask for meds to help you sleep and something like Ativan if you need it during the day. I need those to get through the day. I have no other advise but unfortunately there are a few of us in this position and we understand. The days and nights get better with time and meds. Lots of hugs.",
      "MessageIndex": 5,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797254",
      "Title": "looking for hope and hugs leftfootforward aic"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 13, 2012 02:28AM formygirls wrote: Sending you hugs and my best--13 more to go!",
      "MessageIndex": 104,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 25, 2012 03:30PM formygirls wrote: Kay, I hope this is nothing but I would press for a mammogram. In my own experience, an ultrasound was not enough.",
      "MessageIndex": 2,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788067",
      "Title": "My daughter, 31, breastfeeding2 months postpartum has lump kayfh windy2011"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 19, 2012 06:45PM formygirls wrote: Also wanted to add that my onc is switching me to 2 weeks on and 1 week off to see if that helps. She is trying to avoid neupogen and my counts have been very low. I also take Herceptin every week and will be adding daily Tykerb as soon as ins approves.",
      "MessageIndex": 2,
      "PostDate": "19/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786105",
      "Title": "For those on navelbine LuAnnH onedayatatime"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 24, 2012 10:57AM formygirls wrote: Congratulations! Persistance pays:) Hope this contniues to work for you and you get NED soon.",
      "MessageIndex": 34,
      "PostDate": "24/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783122",
      "Title": "After 17 months... Amyf lilylady"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Nov 9, 2013 07:18AM formygirls wrote: I do not know which chemo you on. My first chemo saw my AST and alt climb from 100 to around 4000. I could not take most chemos because of the high liver numbers. i had to switch chemos and they dropped back slowly and were even normal for a few weeks. I am sorry you are in hospital.my first chemo was Gemzar and carboplatin if that helps. It was unexpected and I was not prepared. This was last year feb 2012. I was reeling from the dx and this on top was too much. But it passed. Good luck to you",
      "MessageIndex": 8,
      "PostDate": "09/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814193",
      "Title": "Too Early For This Freedomchild82 bhd1"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 12, 2012 01:02PM formygirls wrote: I am so happy to see this update. It will be good to be home after all you have been through. Wish Elka, you and the family all the best.",
      "MessageIndex": 84,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783793",
      "Title": "In hospital again PizzaDad soleil505"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 7, 2012 09:32PM formygirls wrote: Sending lots of good thoughts your way and hoping she pulls through this.  ",
      "MessageIndex": 5,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783793",
      "Title": "In hospital again PizzaDad soleil505"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Oct 15, 2012 09:49AM formygirls wrote: Sending hugs and wishes for a quick recovery to Brenda.",
      "MessageIndex": 29,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794817",
      "Title": "Naniam soleil505"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: Ladies. I do not know how to ride this roller coaster. Early last month I was dx with extensive mets to lungs, liver, bones and nodes. This was sudden and the extent of mets was very hard to take. I spent all of Feb crying nonstop, but went on disability and started tx. I started an easy chemo Navelbine but am having many s/e. I also had a reaction to the Zometa both times with high fevers. But I was coming to terms with it, my liver numbers began to improve a bit and this forum helped me. I began to hope that I could be one of the lucky ones who get a couple of years. I realize that it could not be much longer since I am hormone negative and will always have chemo.  Then last week I started having non stop headaches. I do not know why--I do have large mouth sores from Navelbine but who knows. With my history, it most likely brain mets. I cannot get myself to get a brain MRI. I have barely come to terms with my existing mets. My brain was the only place left.  I am tired of giving bad news to my family. My chemo will have to stop while I get tx for my brain and then my liver will go haywire. I know I am running ahead without a scan but am unable to stop these thoughts as my head pounds constantly. I know I should get a brain MRI but I cannot bring myself to call my onc. I want to be mentally ready for the next steps. I hate opening my eyes in the morning as I begin to feel my headache again. I wish I could stop tx and end all this but know that I cannot because of my kids. With mets everywhere, I struggle with suffering through tx but know I have to keep trying even if there a small flicker of hope. Left to myself, I know I would get off this train. Sorry for the long post but I needed to vent. I feel like just when I managed to bring myself up, another huge wave is coming again at me. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784280",
      "Title": "Venting--more mets?? formygirls ibcmets"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 20, 2012 04:58AM formygirls wrote: Thank you all. I finally sent an email to my onc today explaining the headaches so I guess a MRI will happen--thank you for your gentle prodding:) It is really hard preparing for the worst outcome (the engineer in me needs to flowchart the outcomes all the way through! What if it is mets, what happens to the chemo to the liver, what about lungs etc and I drive myself nuts.) but I haven taken the first step. My headaches have been constant for almost over a week know and pain meds do not help much. They do however keep changing in location every day--left side, right side, back..... Now the scanxiety begins.",
      "MessageIndex": 26,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784280",
      "Title": "Venting--more mets?? formygirls ibcmets"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 20, 2012 01:06AM formygirls wrote: I enjoy your writing and sense of humour. Your post on Elite PET scans on your blog made me laugh.",
      "MessageIndex": 18,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784287",
      "Title": "\"Honey, you look so...\" CoolBreeze holdontohope"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 17, 2012 11:51PM formygirls wrote: I second the comments about an MRI. I had a CT a couple of weeks that not clear. Radiologist was not sure if the changes in the right lobe were new mets or fatty tissue. My onc has ordered a MRI of the liver as she feels that will give her a very accurate picture. Also since you have two doctors, maybe chose one as your captain and have him guide these decisions? Are your two doctors communicating with each other? Good luck.",
      "MessageIndex": 14,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786009",
      "Title": "Help me with Confusion CoolBreeze Bestbird"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jan 29, 2014 09:08PM formygirls wrote: I participated in such a clinical trail when I was stage 3 but obviously it did not work as I have mets everywhere. I did not get the Zometa arm of the trial but got another bisphospanete. I had to take it every morning for three years and was dx with mets at the end of study in feb 2012. ",
      "MessageIndex": 2,
      "PostDate": "29/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817482",
      "Title": "Zometa bhd1 ibcmets"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Dec 30, 2012 10:41PM formygirls wrote: Apple, Prayers and best wishes are headed your way. Hope to see your fun posts again soon.",
      "MessageIndex": 7,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798177",
      "Title": "Has anyone heard from Apple? marie5890"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 30, 2008 03:29PM formygirls wrote: I finished chemo two weeks ago and feel exactly like you. I have the pain and the numbness.",
      "MessageIndex": 1,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708266",
      "Title": "weakness after chemo sonnebe Curlylocks"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: This Post was deleted by formygirls. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803347",
      "Title": "Scan every six weeks? Too soon? formygirls formygirls"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jul 30, 2012 08:07PM formygirls wrote: Kita, Good luck. I hope you get good news. She normally emails me the same evening so she probably has your results by now. But i keep bugging her and the nurse till they email or call me. I am impatient and need to know ASAP. I look forward to seeing you on wed with great news!",
      "MessageIndex": 32,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791044",
      "Title": "Scan next week kita exbrnxgrl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 25, 2008 05:21PM formygirls wrote: Anna and Emma, I am glad you both are seeing positive results. I have a followup MRI scheduled for Tuesday to see how my cancer is responding to the chemo. I am beside myself with worry. What if, things are worse or still the same? I sometimes get pain in the breast again and worry that it is growing. As a triple neg, chemo is my only choice and I have just completed 4 AC.  I just realized today that I have chest wall involvement and multiple lymph nodes involved instead of just 2 nodes(finally read my old MRI report carefully) so my prognosis just got worse. I really need good news on Tuesday. So please think about me.",
      "MessageIndex": 21,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704241",
      "Title": "neoadjuvant chemo - but tumor not shrinking? Emma56 carpediempenny"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 29, 2008 04:07PM - edited Apr 29, 2008 04:08PM by formygirls An update from me on my neo-adjuvant chemo. I did have my MRI this morning and the MRI shows a partial remission. I still have cancer but the dr said 2/3 of the tumor had shrunk. Instead of a bunch of matted lymph nodes with cancer only one node is still swollen and my chest wall involvement has decreased. My onc said while this was not a complete remission which occurs in 10% of the cases, she was happy with the progress after 4 ac. I am on to the 4 taxol which starts next week and will have surgery after all the chemo is completed. I have mixed feelings about the report--I am grateful that there has been some improvement and some remission but there is still some tumor left. The MRI again found a spot on my liver. The good news is the the spot on the liver has not grown/changed in size in the last two months which the onc feels is a positive sign because if it was cancer the spot would have also reduced in size in response to the chemo but the spot also showed blood vessels which means it is a tumor--hopefully benign.",
      "MessageIndex": 23,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704241",
      "Title": "neoadjuvant chemo - but tumor not shrinking? Emma56 carpediempenny"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Sep 19, 2012 06:09PM formygirls wrote: Tammie, Sorry that the bones showed uptake but yay on the stable liver. Hope the docs at Roswell can give you guidance on threads and the new hormonal. All the best. I hope things are improving with your son. Is he still at the same place? Are they making a difference?",
      "MessageIndex": 2,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793776",
      "Title": "Scan results ? tammie tammie"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jul 17, 2013 11:13PM formygirls wrote: Nancy, Just wanted to send you lots of hugs. I will be thinking of you. I hope your birthday will be great and the surgery successful.",
      "MessageIndex": 16,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807898",
      "Title": "Update on me - brain surgery scheduled nancyh RonnieKay"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jul 24, 2012 04:16PM formygirls wrote: Good luck! If you have time, drop by the infusion center on Wed after you see your MO. I will be there all day and would love to say hi.",
      "MessageIndex": 7,
      "PostDate": "24/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791044",
      "Title": "Scan next week kita exbrnxgrl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: I am starting my first chemo in a couple of hours--cisplatin+gemzar+zometa. So please send your wishes/prayers/energy along to San Diego to kill everyone of these cancer buggers.  The last 10 days have been a rollercoaster. From no tx because of liver to finally a chance to do some chemo to bring my liver numbers down. I also made a 1 day trip to MDA to meet Dr.Gonzalez there and she agreed with my onc here that right now all trials are out till my liver enzymes do not get normal or close to normal again as >5UL disqualifies you. On a surprising note, I got a call late last night from a friend that also got some of my liver tissue saying it was HER2 positive. I have always been triple negative and this would be good as it might give more options. No news on ER/PR yet. Since it is not official and I have nothing from onc, we are not changing my chemo yet. I get 2 rounds of this chemo and then a PET will decided next steps. I feel like a warrior today going into a battle, which he knows he will lose and die in the end but has to keep up a valiant fight and stay on the ground as long as possible to prevent the enemy from entering the city(I know--it sounds silly). So it is with mixed emotions I enter the battleground today, knowing I have to fight on for the kiddos. I have never felt as much loved as I do now. I been overwhelmed by the support from our community and friends and family here. I know dh and kids will be taken care of when I am gone.It gives me some peace. I have already assigned duties to my friends-who will help my kids with hw, pick them from school, meet and talk with dh every Friday so he has someone to talk too and they all cry and laugh but agree:) Have a great day. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782692",
      "Title": "updatestart chemo today &receptors changed--possible? formygirls nancyh"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: I am starting my first chemo in a couple of hours--cisplatin+gemzar+zometa. So please send your wishes/prayers/energy along to San Diego to kill everyone of these cancer buggers.  The last 10 days have been a rollercoaster. From no tx because of liver to finally a chance to do some chemo to bring my liver numbers down. I also made a 1 day trip to MDA to meet Dr.Gonzalez there and she agreed with my onc here that right now all trials are out till my liver enzymes do not get normal or close to normal again as >5UL disqualifies you. On a surprising note, I got a call late last night from a friend that also got some of my liver tissue saying it was HER2 positive. I have always been triple negative and this would be good as it might give more options. No news on ER/PR yet. Since it is not official and I have nothing from onc, we are not changing my chemo yet. I get 2 rounds of this chemo and then a PET will decided next steps. I feel like a warrior today going into a battle, which he knows he will lose and die in the end but has to keep up a valiant fight and stay on the ground as long as possible to prevent the enemy from entering the city(I know--it sounds silly). So it is with mixed emotions I enter the battleground today, knowing I have to fight on for the kiddos. I have never felt as much loved as I do now. I been overwhelmed by the support from our community and friends and family here. I know dh and kids will be taken care of when I am gone.It gives me some peace. I have already assigned duties to my friends-who will help my kids with hw, pick them from school, meet and talk with dh every Friday so he has someone to talk too and they all cry and laugh but agree:) Have a great day. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782692",
      "Title": "updatestart chemo today &receptors changed--possible? formygirls nancyh"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 19, 2012 06:39PM formygirls wrote: LuAnn, I am on a 42mg dose. I paid attention when the chemo nurses were infusing yesterday. I am having a terrible time with it and have missed tx twice because my WBC dropped to .5 But we think it is working so have no choice but it is not an easy chemo for me even though it has a reputation of being easy.",
      "MessageIndex": 1,
      "PostDate": "19/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786105",
      "Title": "For those on navelbine LuAnnH onedayatatime"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Oct 3, 2012 11:44PM formygirls wrote: Sorry about the news. I had a rt mast in 2008 when it was dx with stage 3. My surgeon would not remove the healthy breast. I did not like wearing a foob. Last year I had the other mast as they thought I had a high risk of recurrence. It was one less thing to worry about but then i got mets this year. I would have preferred to have them both removed the first time as I had to go through surgery twice. I did not have reconstruction. Wish you all the best with whatever you decide.",
      "MessageIndex": 33,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794390",
      "Title": "Sitting at DF waiting for results Frapp Frapp"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 18, 2012 10:48PM formygirls wrote: Thank you all for your good wishes and support. I have had a rough week. On Wed , I had a marathon infusion session of Gemzar, Cisplatin and Zometa that lasted almost 7 hours, got home and woke with a fever of 103. Had to got to ER and spent 8 long hours as they were not willing to let me go because I had received chemo. Came back home at 9:00 in the morning. Since then I have been running high fevers and chills but have no energy to go to ER again. My path report did came back and I changed from triple negative to Her2+. YAY! So I now will get Navelbine and Herceptin every week starting next week instead of the cocktail I was getting. Otherwise, I am ok and with the help of Xanax, Ambien and a host of other such friends get through the days and nights. I still have not gotten a brain MRI even though my dr ordered one. My mets are already everywhere and I am dreading the news that it is in my brain too. I do not have any symptoms but I know they don't always cause symptoms. The last two weeks have been traumatic and I thank you all again for your support.",
      "MessageIndex": 32,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782692",
      "Title": "updatestart chemo today &receptors changed--possible? formygirls nancyh"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jul 20, 2012 10:28AM - edited Jul 20, 2012 10:33AM by formygirls This is such a hard post. My daughters just turned 8 and 11. My dh and I have had extensive talks with time about my disease and death. Because of the extent of my disease, we have been very open with them that this is probably the last summer. I have practically working with on who will pick them up for school, help them with prom clothes, who will call dh every evening to remind him to come home, my best friednd will help with homework etc. I am blessed that my parents came from India and are going to live with my dh and my kids to bring them up. My mom is an angel and is trying her best to fill my shoes per my instructions. She is letting me move in piece knowing there will be someone to watch and raise my kids. My dh is a great husband but he is a workaholic. they cry and then I distract them. This will not get easier till I actually go. There are moments I fantasize that that my PET, CT, BRAIN MRI, SPRINE MRI will also show !NED on the same day and I get a reprieve with no txs for 6 months!!!! One can dream. The plan was initially not to talk unless there was major progression. Or tx change that would everyone. Unfortunately, since my dx in Feb, I have had progression every month and tx has changed so often. So we never got the time to sit, calm down and absorb that things will be ok. Got one news, barely got up and then hit us again. ,",
      "MessageIndex": 5,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790839",
      "Title": "Mommy please don't die! stagefree SPAMgirl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 25, 2013 09:30PM formygirls wrote: Loved it. Could not stop my tears.",
      "MessageIndex": 7,
      "PostDate": "25/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809938",
      "Title": "New Video, Feedback Please... EnglishMajor AnacortesGirl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Nov 19, 2013 05:48PM formygirls wrote: Tera, I have been on this combo since May with affinitor and Zometa added. I take 2000mg tykerb (20 tablets)once every four days, 3000mg xeloda daily (14/7)and 10 mg affinitor daily, herceptin and zometa once three weeks. My SE is diarhea for which I take lomotil and have extreme fatigue for which I have not found a remedy. I think Afinitor may be the problem here. I have not had Hfs yet. I did not lose hair on this combo but lost it last month to WBR. Good luck.",
      "MessageIndex": 2,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814724",
      "Title": "Xeloda, tykerb and Herceptin Bondgirl sblankenship"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 4, 2012 09:54PM - edited Feb 4, 2012 09:55PM by formygirls Hello ladies, I introduced myself in a new post yesterday but thought I would add here also. My name is Shifali and I have two precious girls (8 and 10) and a darling husband. I had a great corporate job(marketing) which I left yesterday after I was diagnosed with extensive mets to bones, nodes, lung and most of my liver yesterday. This is still new to me. I just turned 40! I discovered this site when I was first diagnosed as a stage III TNBC in Feb 2008. Feb is a bad month for me:( I do not have a tx plan yet so I will be asking lots of questions in the coming days. Please bear with me. I plan to be glued here every waking moment as no one else gets this nightmare and no one else also inspires me to keep fighting. This has been my lifelife since I got the call my onc.",
      "MessageIndex": 70,
      "PostDate": "04/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781871",
      "Title": "...And you are? EnglishMajor keepingon"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 15, 2012 08:20AM formygirls wrote: Thank you both. Jennifer, The story gives me hope. I am hoping it turns receptors. The results of HER2+ are prelim and are from the lab not connected to the onc so I am hoping this happens. I would love to have more drugs to be able to fight.",
      "MessageIndex": 3,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782692",
      "Title": "updatestart chemo today &receptors changed--possible? formygirls nancyh"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Dec 7, 2013 02:58AM formygirls wrote: My oncs always say that how I feel is most important so less pain and symptoms is a great thing. It sounds like Xeloda is doing its job. Hope your scans are good.",
      "MessageIndex": 4,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/815413",
      "Title": "When pain improves hansaim formygirls"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 18, 2012 11:33PM formygirls wrote: I am glad you feel great and hope your scans come out great too! Good luck",
      "MessageIndex": 2,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782888",
      "Title": "NED, Reggie, stable boy??? Iwillwinthisbattle nancyh"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Nov 27, 2012 05:50PM formygirls wrote: I am on expanded access and have received one treatment so far. You cannot get any other drug or treatment while you are on this trial.",
      "MessageIndex": 1,
      "PostDate": "27/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796907",
      "Title": "tdm 1 expanded access bhd1 LuAnnH"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 31, 2012 03:13AM formygirls wrote: I did the scan and found multiple brain mets today. Not a good weekend. It is too much with the liver, lung, bones, nodes and now brain. I am just numb today.",
      "MessageIndex": 32,
      "PostDate": "31/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784280",
      "Title": "Venting--more mets?? formygirls ibcmets"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 30, 2013 01:07AM formygirls wrote: Judie, I am so sorry things have been so bad. I really hope you find relief soon with rads and can start chemo. Sending you lots of hugs and support.",
      "MessageIndex": 7,
      "PostDate": "30/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806951",
      "Title": "Delay in Chemo and 20 Rads sessions justjudie pajim"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Sep 18, 2013 11:08PM formygirls wrote: I have not used it as a single agent but I hope it works for you. Wanted to send you the best of luck with this. OT but Why will your ins not pay for anymore chemo? This should not be a decision they get to make. That scares me.",
      "MessageIndex": 2,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811225",
      "Title": "Gemzar, anyone? marywh Chickadee"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 25, 2012 12:15PM formygirls wrote: Silent bell, Neupogen can also cause transient increases in ALP. It did for me but last week when I did not take Neupogen my ALP was normal. I mention this as you wrote that your wife has issues with her liver enzymes and to not worry if ALP increases significantly after taking the shot. This is a rare side effect so hopefully she will not face it. I also get intense fatigue with Neupogen. I am on a three week chemo cycle and take neupogen for four days starting on day eight. I was told to bring neupogen to room temp before injecting.",
      "MessageIndex": 4,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788044",
      "Title": "Any tips on neupogen shots? silentbell nancyh"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 22, 2013 12:14AM formygirls wrote: I think about this all the time now. So much that this is all I do and have sunk further into depression and anxiety. I have progressed on a lot of chemos and have very few options left. I feel all the doors closing one by one. Some days I am so miserable that I want to go right now and want the bus that goes around killing people to hit me. I dream about a quick, painless death. But I see my kids and I want to live. I am 41 and my kids are still young. I do not know if I will ever be strong enough to stop treatments myself. I will let the onc tell me that there are no more options. The ins and my team of doctors will make the decision when i come to the end of the road. I do not want my kids and family to watch me die a miserable death but some part of me keeps hoping that the next treatment will give me a few more months. I cannot bring myself to say stop even though life sucks. My onc said till my body is healthy enough to take chemo txs she is willing to keep trying. She never gives me false hope and stays away from any prognosis discussion. It helps that she has not given up on me yet. I trust her. I know it is a matter of time but I keep crying for more time even though I know it is pointless. This is such a difficult decision and the last and most important one in my life.",
      "MessageIndex": 11,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809693",
      "Title": "How do they decide? Chickadee jlmacy"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 4, 2013 08:41AM formygirls wrote: Love and hugs to you. I hope Gemzar works well and is not too hard on you. I love to read your posts about cycling along the ocean and outings with your granddaughter. I hope to read many more posts like that.",
      "MessageIndex": 49,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802699",
      "Title": "Scans Pretty Grim....Sigh soleil505 Cynthia1962"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Nov 1, 2013 11:27PM formygirls wrote: I have done kadcyla and tykerb for a brief time. It was doable and diarhea was the main SE. I do take xeloda and tykerb with afinitor now. There is a trial for neratinib for brain mets and also IT Herceptin if your onc will consider it. I have also done WBR and was discussing neratinib with my onc today if the next scan shows progression again. Unfortunately the neratinib trial is not offered at my cancer center and I can no longer travel. Good luck.",
      "MessageIndex": 2,
      "PostDate": "01/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813889",
      "Title": "What is next for brain mets? Bondgirl vickib"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Aug 23, 2012 09:49AM formygirls wrote: Soliel, I am sorry to read this. I know you were looking forward to go on a chemo break from Abraxane. This sucks! I hope your onc has a good plan for you today to knock those liver mets down and things will begin to look up again. This roller coaster keeps moving. I would wait to make big decisions till you have a plan and can think through. From your posts I can tell how much you love working also. Hope things improve. I really enjoy reading your posts and the energy you bring to the board. I wish you all the best.",
      "MessageIndex": 27,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792410",
      "Title": "scans not good ....progression. Guess I have to to plan Q soleil505 vickib"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 17, 2012 11:45AM formygirls wrote: These kind of questions break my heart. I have been open with my kids but I have brAin, liver and lung mets and am not doing well. We often talk about this and my girls are very aware (as aware as a 10 and a 8 yr old can be) about my coming days. My 8 yr old will often describe her future home, the names of her children and her cars when we snuggle at night to sleep since I will not be there. They know I will not be around for long but I have told them I do not know exactly when-it could be months or could be a couple of years if things go well. This is a hard discussion and you know your child best and how they will deal with this news. If you are doing well, maybe you can leave it for now and just say what you said--I hope to be there.",
      "MessageIndex": 2,
      "PostDate": "17/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789243",
      "Title": "what to say to a 10 year old Lauriesh Frapp"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 5, 2012 04:13PM formygirls wrote: Rahima, I  just wanted to let you know that I have laso been just diagonsed with TNBC mets to liver, nodes, lungs and bones--last Friday. I do not know about brain yet. I would be interested to learn what you find out. I have heard my inspring stories on this board with chemo,",
      "MessageIndex": 1,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782201",
      "Title": "Metastatic TNBC - any survivors? rahimaw Bestbird"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 9, 2013 03:03PM formygirls wrote: Thank you ladies. I will start working the phones Monday. But i do not have much energy left to fight this. This makes me question how my life is worth. My family says it is worth it but I feel like we are throwing money on a sinking ship. Spending all this money to stay alive forces me to rethink spending my day under covers(in a good way). I am just pissed as hell that ins will not pay for what my says I need.",
      "MessageIndex": 6,
      "PostDate": "09/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805841",
      "Title": "?? Ins denies brain radiation. What to do? formygirls Cafelovr"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 24, 2013 09:56PM formygirls wrote: I wanted to give an update in case anyone else is in the same boat. I went through two levels of appeal at CIGNA and they were both denied. I then appealed to the CA state dept and requested an IMR( independant medical review)which was also denied. Thank you for the links. The IMR process with the state was very easy and everyone was very helpful. They gave me an expedited IMR. I have no more appeals left. They all want me to have WBR while my rad onc wants me to do targeted radiation. I have decided to go with my rad onc recommendation and self pay for tx as I am not willing to stop chemo for three weeks. Thank you for your suggestions. I lost this particular battle but I tried.",
      "MessageIndex": 16,
      "PostDate": "24/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805841",
      "Title": "?? Ins denies brain radiation. What to do? formygirls Cafelovr"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 18, 2012 11:04PM formygirls wrote: I hope and pray your scan is clean today. My brain mets do not have symptoms yet. I had headaches but the neurologist said they were unrelated headaches and they went away right after the MRI. Hopefully your headaches are due to tension or chemo.",
      "MessageIndex": 6,
      "PostDate": "18/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787724",
      "Title": "Brain ma111 bobkat"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Nov 19, 2012 05:22PM formygirls wrote: This is such sad news. What an incredibly touching post from her son. My thoughts are with her and her family.",
      "MessageIndex": 43,
      "PostDate": "19/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796556",
      "Title": "Lowrider, Facebook post mnmom3"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 3, 2008 11:35PM formygirls wrote: Annie, I am so glad you decided to stay. I have been a member only for the past couple of months. I do not post much but am on line constantly and feel that I know most of you. I love your writing, your humour  and your approach to all the problems we face. Look forward to being on this journey together with you and all the other sisters on this board. On a lighter note, I am envious of how beautifully some of you can express your thoughts in these messages. All I can say is Ditto after reading some of the messages. I am speechless. We do have some very creative, expressive personalities / potential authors among us.",
      "MessageIndex": 42,
      "PostDate": "03/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704951",
      "Title": "Unsubscribing HeatherBLocklear sueps"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Apr 21, 2012 11:57AM formygirls wrote: Ann, So sorry to hear that it is falling. I was hoping you were going to be one of those who escapes this side effect. I have lost hair before with chemo but this time is much harder. Mine is still falling very slowly with Navelbine. I really hope you can find a wig that is comfy and looks great!",
      "MessageIndex": 27,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786193",
      "Title": "Bald again CoolBreeze JillThut"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 19, 2012 08:54AM formygirls wrote: Fantastic news. I am so happy for you. Relax!",
      "MessageIndex": 4,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789334",
      "Title": "AWESOME NEWS :) tammie barsco1963"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 29, 2012 08:17AM formygirls wrote: Happy birthday to your dear daughter. I hope this will be a very special day for both of you and you get to see many many more birthdays. These big days are always bittersweet. Will I see another, what will she do next year?",
      "MessageIndex": 16,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788212",
      "Title": "My daughter is 4 tomorrow katie31 apple"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: Some background. I have brain mets and got radiosurgery for 9 lesions in May. 2012. Since then I have had a few progressions and my MRI this week showed 5 new lesions in my brain that need to be treated. My treatment team does not want me to get WBR because: 1) rad onc feels they can treat me with radiosurgery again. 2)I also have too much systemic disease and cannot be off chemo for three weeks to get WBR 3)I can do WBR only once and they want to save it till the end 4)I am not in a great physical shape for WBR as I am having a tough time on my chemo of Xeloda, Afinitor, tykerb, Herceptin and Zometa. BUT my ins (CIGNA)has denied me treatment for radiosurgery and will only pay for WBR. They have a lifetime limit of only seven lesions for radiosurgery and they say I have exceeded that. This treatment will cost between $15 and $30,000. My doctors have already appealed and lost. CIGNA is insisting I do WBR if I want treatment but my rad onc is insisting I can get by with radiosurgery and I should keep WBR in my back pocket. My rad doc says tx has to be done in the next two weeks otherwise my MRI and CT will have to repeated. Do you have suggestions for me for appealing this through a state agency or some other option? I live in CA. I would really like to avoid WBR for now. If all fails, we will tap into my life ins or 401k but I hate using money that I would like to leave for my kids. Seriously, this whole thing is a nightmare enough without all this. Thank you for your advise. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805841",
      "Title": "?? Ins denies brain radiation. What to do? formygirls Cafelovr"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Oct 3, 2012 11:38PM formygirls wrote: Sorry. This sucks. I hope Halaven works for you and is tolerable. Was hoping that your chemo break would be longer. All the best.",
      "MessageIndex": 13,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794442",
      "Title": "Halaven, here I come CoolBreeze CoolBreeze"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: Let me introduce myself. I am TNBC--just turned 40. Have two lovely girls who are 8 and 10 and great dh. My onc called 30 mins to let me know that I have mets in my bones, lungs and half my liver. My outlook was very bleak and she gave me the option of not doing any treatment at all. I am not worried about SE's for now and would like to fight. I am shell shocked.I do not know what to do--where to begin. My dh is crying, my brother and friends are crying and my parents in India are in a mess. I have not told my kids yet. DH does want them to know yet. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782130",
      "Title": "HELP. Just diagnosed today--lung, liver and bone mets formygirls Heidihill"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 3, 2012 10:14PM formygirls wrote: Thank you all for your support. I will go for a second opinion. The results were today from a CT Scan and I have a PET on Monday. My onc is trying to get a biopsy of my lungs or liver next week hoping that my markets may change. I am meeting with my onc on Mon morning and I want to impress upon her that I do not want to give up yet. I like her and know she will support me. I go to amjor cancer center here. When I asked her what we should do next, she mentioned that depended on my goals --was a QOL more imp or was I willing to try to fight with chemo. I am very determined to fight this to the extent I can--especially after reading all the posts in this forum. You have all inspired me to fight. I am encouraging my dh to register here also as he needs strenght. My onc gave me the option of starting chemo right away or waiting for a couple of weeks till my biopsy results come in. I told her I would like to start right away as my liver is in a bad state(my numbers are high and I am running a fever). Is that the right decision? Thank you all. I hope to get to know all of you better in the coming days, months and maybe years.",
      "MessageIndex": 15,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782130",
      "Title": "HELP. Just diagnosed today--lung, liver and bone mets formygirls Heidihill"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Nov 6, 2012 07:44PM formygirls wrote: My sympathies to her family and friends. The pictures are so beautiful.",
      "MessageIndex": 18,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795985",
      "Title": "carla9112 is an angel bourscheid GatorGal"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "May 13, 2012 04:59PM formygirls wrote: Your post struck a chord and I can so relate. I am 40 with two young girls who are 8 and 10 and get so pissed off when I have to listen for hours about knee and other old age problems of other people and they try to compare their problems with mine. I get mad at myself as I am not a bad person but I get jealous when I see older people. It is not their fault that I have to leave soon. I am glad you were able to attend your dd graduation. My older daughter graduates from elementary school (5 grade) on JUne 6 and she keeps asking me if I will be around and I keep reassuring her that I plan on being there for her graduation. This is the only graduation I will probably be around for so it will bittersweet. In my day dreams, I am around to see them both graduate from high school and very willingly agree to die after the graduation ceremony:) that is a pact I keep making with the higher powers.",
      "MessageIndex": 27,
      "PostDate": "13/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787388",
      "Title": "No, you don't understand... Stormynyte Reneepals"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Jun 8, 2012 12:17PM formygirls wrote: Penny, Great attitude. I just saw my older daughter graduate from elementary school this week and am grateful I could be there for the day. Things suck but they could be even worse-I have to keep reminding myself.",
      "MessageIndex": 3,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788785",
      "Title": "Was bummed, now a little happier redwolf8812 Frapp"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Mar 20, 2013 06:58PM - edited Mar 20, 2013 07:01PM by formygirls ",
      "MessageIndex": 1,
      "PostDate": "20/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802092",
      "Title": "diabetes, anyone? raro AnacortesGirl"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "formygirls wrote: Let me introduce myself. I am TNBC--just turned 40. Have two lovely girls who are 8 and 10 and great dh. My onc called 30 mins to let me know that I have mets in my bones, lungs and half my liver. My outlook was very bleak and she gave me the option of not doing any treatment at all. I am not worried about SE's for now and would like to fight. I am shell shocked.I do not know what to do--where to begin. My dh is crying, my brother and friends are crying and my parents in India are in a mess. I have not told my kids yet. DH does want them to know yet. Initially diagnosed with triple neg stage 3 bc in Feb 2008. Mets dx in Feb 2012 with change in receptors .Mets to liver, brain, bone, lung and nodes and central nervous system. Dx 2/3/2012, IDC, 6cm+, Stage IV, Grade 3, 2/29 nodes, ER+/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782130",
      "Title": "HELP. Just diagnosed today--lung, liver and bone mets formygirls Heidihill"
    },
    {
      "AuthorID": "formygirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64245/profile",
      "Content": "Feb 5, 2012 03:42PM - edited Feb 5, 2012 03:43PM by formygirls I wanted to give you all an update. I have decided to go to MDAnderson for a second opinion and my appt is on Feb 13. I see my main onc tomorow but will hold off on all tx till my second opinion.We are concerned that MD might not  enroll me in clinical trials if I start chemo in San Diego. Is that ok? Time is critical since my liver is in crtical condition but I do not feel as if I have any other choice if I want a second opinion. My primary onc will give me her tx plan tomorrow. I also have a PET tomorrow.",
      "MessageIndex": 36,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782130",
      "Title": "HELP. Just diagnosed today--lung, liver and bone mets formygirls Heidihill"
    }
  ]
}