{
  "AuthorID": "formybunch",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204467/profile",
  "Posts": [
    {
      "AuthorID": "formybunch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204467/profile",
      "Content": "Sep 25, 2014 03:53PM formybunch wrote: Hello Jovial, I'm so glad you decided to reach out on here and post about how you feel. I am not yet diagnosed (still trying to make my way through all the appointments and a future surgery for a final diagnosis), but ever since this all started two months ago, I find myself crying a lot. And I mean a lot! Puffy eyes, hard to breath and stuffy nose. I look terrible most of the time! This morning I dropped my son off at the bus stop and was going to work out, but turned around, came home and spent a good hour crying in my bedroom. Besides crying a lot at home, I cry in my car in the garage, in parking lots and any where I think it's hard for others to see me even behind my sun glasses! So you are not alone. As a mental health therapist, I can tell you that crying is normal. Your world has been turned upside down and you have suffered a loss- that peace of mind and sense of control over your own body that was there before all this started. You have to mourn and allow yourself to pass through this time. Shoppygirl is right, don't think you have to be brave and face this like it doesn't affect you. I'm right there with you as are all the other women on here. You are never alone.",
      "MessageIndex": 11,
      "PostDate": "25/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/824830",
      "Title": "I cry at EVERY appointment! jovigal ILoveTeaching"
    },
    {
      "AuthorID": "formybunch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204467/profile",
      "Content": "Jan 5, 2016 09:41AM formybunch wrote: If you don't feel comfortable with what your doctor is saying, it's a good idea to find one you feel is good. They need to be thorough at the very least. Testing helps, but I have heard that surgery is the best way to know what is going on since it tells you for sure what is causing your symptoms. You may want to think about the surgery since your symptoms have changed. That way you can be sure. It's a lot to go through and never easy to deal with any of this. I've been researching duct excision extensively since I have had discharge for a year or so now and it sounds like an easy surgery (if surgery can be easy in any way!). Praying that it turns out for you and that you can soon put this behind you.",
      "MessageIndex": 1,
      "PostDate": "05/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/838912",
      "Title": "Nipple Discharge, Areola Dimpling, Breast Dimpling M0m4vr61 M0m4vr61"
    }
  ]
}