{
  "AuthorID": "frangipangi",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102622/profile",
  "Posts": [
    {
      "AuthorID": "frangipangi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102622/profile",
      "Content": "Jun 10, 2010 09:11PM frangipangi wrote: Hi Hopeful34, I think 14 is a tough age to cope with mum having breast cancer. I guess he is old enough to understand alot including the dangers and probably doesn't know how to cope.  Are you still having treatment? Has he spoken to anyone about it? I was advised to enlist a close friend or family member to 'talk' to the kids when I wasn't around as apparently they will often say things to someone else they won't say to you. I will PM you re the details of my little project as well, X ",
      "MessageIndex": 9,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753814",
      "Title": "Any Mums with Teens/Young Kids? frangipangi juliaw"
    },
    {
      "AuthorID": "frangipangi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102622/profile",
      "Content": "Jun 21, 2010 10:26AM frangipangi wrote: Hi Duman, I am so sorry to hear your news. Telling our children we are sick is never easy, to tell them you are terminal must be unbelievably awful. I do believe though that no matter how hard, you have done the right thing being honest. I'm sure your daughter's anger stems through fear, she cannot imagine life without her mum. When I was diagnosed, I was told to ask an adult friend who had a good relationship with the children to 'talk' to them and be there to listen. This gave the kids a chance to say stuff they may not have wanted to say to me. I don't know if this might help your daughter. It also made me feel slightly better knowing someone else was specifically looking out for them. My heart goes out to you & to your family. How is your husband/partner coping? I hope you are surrounded by good friends & family who are giving you the support you need. Words seem so inadequate, I wish there was something we could do to make it all better...How do you cope with what be overwhelming fear? I hope you don't mind me asking .. Stay strong X ",
      "MessageIndex": 19,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753814",
      "Title": "Any Mums with Teens/Young Kids? frangipangi juliaw"
    },
    {
      "AuthorID": "frangipangi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102622/profile",
      "Content": "Jun 17, 2010 03:53PM frangipangi wrote: Hi in_cognito! I can't imagine the upheavel being diagnosed so soon after the birth of a child. My youngest was 3 years old (my son was 7) so I know what you mean about 'needing years'. I didn't want to talk about 5 year prognosis because I needed 15... I chose to have a bmx because I wanted to do everythign I could to reduce the risk of a recurrence. I know stats show that this is not necessarily the case but it made sense to me and after I'd made the decision, two of my doctors told me they would do that if it were them/their wife. I also felt that if one was for the chop, might as well lose both as recon would be easier too...Chemo was tough but part of the 'package' to try to do as much as possible to ensure there were no rogue cancer cells whizzing about. What stage are you at right now in your treatment? How is your partner coping? How are you managing treatment & taking care of a newborn? X ",
      "MessageIndex": 16,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753814",
      "Title": "Any Mums with Teens/Young Kids? frangipangi juliaw"
    },
    {
      "AuthorID": "frangipangi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102622/profile",
      "Content": "frangipangi wrote: Hi there, My kids were just 3 and 7 when I was diagnosed with breast cancer. My husband was working offshore and I was living 4000 miles from home. I realised that as a mother to young kids, my worries were different to women who either had grown up kids or none at all. The fear of how my family would cope if something happened to me...how I would manage to take care of them while I was ill...how my children would cope...all this was as well as worries about mastectomy & chemo. Well, its nearly my two year anniversary and I want to support other mums who are in a similar situation. I got through my treatment thanks to some amazing doctors and the support of my friends & family. I learnt alot of lessons about what we need as a woman fighting breast cancer, as well as our needs as a mother and a whole lot about helping our children as they watch mum battle this dreadful disease. I was wondering if there are any other mums out there who might be interested in helping other breast cancer mums too? If you have a baby or school age kids and feel you would like to be part of something new then please PM me and I'll tell you more. If you are currently battling breast cancer, then please contact me as I truly believe the support and encouragement on offer will help you through the journey you are about to take. I need 'pioneering' breast cancer mums (& their friends/relatives) from anywhere around the world! If you check out my profile you'll also see my website, its especially for mums diagnosed with breast cancer or follow my Tweets as 'BreastCancerMum' Thanks! Hope to hear from you X BreastCancerMum Dx 6/20/2008, 2cm, Stage IIB, Grade 2, 0/4 nodes, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753814",
      "Title": "Any Mums with Teens/Young Kids? frangipangi juliaw"
    },
    {
      "AuthorID": "frangipangi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102622/profile",
      "Content": "Jun 10, 2010 09:07PM frangipangi wrote: Hi Twinmom77, Any input would be appreciated. A current question at the moment is advice on how to cope...maybe take a look and see if you can help? Must have been hard with your partner not helping much. Shows what a strong woman you are for coping though! Thanks ",
      "MessageIndex": 8,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753814",
      "Title": "Any Mums with Teens/Young Kids? frangipangi juliaw"
    },
    {
      "AuthorID": "frangipangi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102622/profile",
      "Content": "Jun 14, 2010 09:48AM frangipangi wrote: Hi AussieSheila, I am so sorry to hear about your latest dx after 15 years clear...you sound so calm and in control, a real inspiration. Can't be easy telling teens and I'm sure its not easy for them or you now. It did sound like your '95 diagnosis had a positive effect on your youngest...its interesting how perhaps something good happened because of it, perhaps a wake up call. Will PM you X ",
      "MessageIndex": 12,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753814",
      "Title": "Any Mums with Teens/Young Kids? frangipangi juliaw"
    },
    {
      "AuthorID": "frangipangi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102622/profile",
      "Content": "Jun 17, 2010 03:42PM frangipangi wrote: Hi Houndmommy, You sound so in control for someone so recently diagnosed! I am consistently amazed at how strong so many mums are when confronted with breast cancer. Sounds good that your son will have a chance to speak to another child in a similar situation. I was always surprised at how blunt kids were and mine were so young, but even their friends would ask very direct questions. Thanks for looking at the site, be great if you could join up. I just added a page about chemo today plus updated the inspirational quotes so take a look. What stage are you at in your treatment? X",
      "MessageIndex": 15,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753814",
      "Title": "Any Mums with Teens/Young Kids? frangipangi juliaw"
    },
    {
      "AuthorID": "frangipangi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102622/profile",
      "Content": "Jun 8, 2010 01:57PM frangipangi wrote: Hi Twinmom77,  How awesome to have twins! Thanks for your kind words and congratualtions on finishing up treatment - its a great feeling. I'm sure you have your hands full (:)) with the little ones but if you could spare any time, it'd be great to have your insight on things. For example, as your kids were young, how did they cope? What did you tell them? My daughter was three and whilst she didn't really understand she knew something was 'bad' and the whole chemo thing really scared her. She was very withdrawn at pre-school and suffered terribly anxiety that I would go into hospital and not come back. I am trying to build up a base of mums who would post regularly which would encourage others to join. Mums like yourself who are coming out the other end would be invaluable as I think when you're 'in it' it feels like you will never be well ever again. You could also keep in touch with how you do after treatment, as I found it took me a full year before I got even close to what is now my new normal, especially on tamoxifen!",
      "MessageIndex": 2,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753814",
      "Title": "Any Mums with Teens/Young Kids? frangipangi juliaw"
    },
    {
      "AuthorID": "frangipangi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102622/profile",
      "Content": "Jun 8, 2010 02:30PM frangipangi wrote: Thanks ladies!",
      "MessageIndex": 5,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753814",
      "Title": "Any Mums with Teens/Young Kids? frangipangi juliaw"
    },
    {
      "AuthorID": "frangipangi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102622/profile",
      "Content": "Jun 10, 2010 01:18PM frangipangi wrote: Hi Ann, I have sent you a PM but in the meantime... When I was diagnosed, I did get a second opinion. There are accounts of misdiagnosis due to errors/mix ups in pathology but they are very rare...still, if in doubt, do another biopsy. How do feel about your doctor? I think having faith in your surgeon is paramount as there are so many decisions to make and its not always straighforward. I would be cautious about taking on any new roles just now...depending on what treatment you have, you could end up with just a lumpectomy & the new intraoperative radiation where they do the operation & radiotherapy all at one time. If this is the case, I understand recovery is very quick and much easier as you don't have the weeks of radiotherapy which are very tiring. So you could perhaps become the scout leader a bit later on? However, do think carefully as you may be very emotional and tyou may need all your resources to cope with yourself and your family. If you need chemo or have a mastectomy then recovery time will be longer too. Lots of mummy guilt when you get diagnosed with breast cancer!! I can remember feeling like I'd ruined their childhood innocence and feeling totally useless at times when I couldn't even pick my 3 year old up for a cuddle..So do be wary of taking on extras. Concentrate on you & your family. It would be worse to start then have to give up, or start and feel it was too much.. I guess if your vacation is just a week or two then the doc probably thinks a few weeks won't matter. I'm not a medical expert, my doctor didn't rush me either. The best ever advice he gave me was that I had to get myself prepared mentally as well as physically before the surgery.   I say take the vacation, try to have a great time as a family and enjoy the calm before the storm. Hope that helps a little Frangipangi",
      "MessageIndex": 1,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/753915",
      "Title": "Could use some advice Ann97 Ann97"
    }
  ]
}