{
  "AuthorID": "frankp",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163768/profile",
  "Posts": [
    {
      "AuthorID": "frankp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163768/profile",
      "Content": "Jan 14, 2013 10:05AM frankp wrote: I know it is a confusing time, but on top of everything you are learning, consider getting a blood test for HER2. That is the protein, called a tumor biomarker, on the surface of some breast cancer cells. HER2 is usually measured early on in the biopsy, but some of the time the tissue is negative, while the blood test measures HER2 that broke off into the blood stream. Many oncologists do not order serum HER2, but I think it is a good idea. You can read more at www.hertestonline.com and www.oncogenescience. com. Oh, my wife had a double mastectomy 17 years ago, and our sex life has been just fine--certainly a jarring experience at the time, but the alternatives could be worse.",
      "MessageIndex": 21,
      "PostDate": "14/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798613",
      "Title": "Stage and grade of cancer determined AFTER surgery. What!?! InTheWind InTheWind"
    },
    {
      "AuthorID": "frankp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163768/profile",
      "Content": "Nov 4, 2012 02:50PM frankp wrote: Susan--You do have a boarderline HER2 result. Maybe the OncoType Dx test will shed more light on your HER2 status. However, it can help to check your serum HER2 because if that is elevated your doctor can do more test to confirm whether or not you are a candidate for the HER2 drug Herceptin. Herceptin is one of three drugs that target HER2 tumors--usually used in addition to other chemotherapy. For more serum HER2 information, you might check the web site www.labtestsonline.com and the site www.hertestonline.com frankp",
      "MessageIndex": 21,
      "PostDate": "04/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795532",
      "Title": "Chemo??.... awaiting the oncotype DX test- any advice?? susancats frankp"
    }
  ]
}