{
  "AuthorID": "FrankenBoob…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241478/profile",
  "Posts": [
    {
      "AuthorID": "FrankenBoob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241478/profile",
      "Content": "Oct 25, 2016 10:48AM FrankenBoobz wrote: Hi! 2016",
      "MessageIndex": 250,
      "PostDate": "25/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Jan 11, 2013 06:56AM Frankenboobs wrote: thank you, divine, shannie, and butterfly... i'm sorry about your loss too. juneaubug, your hair looks great! you have a little stylin' thing going on already! good for you! rainmaze, it's hard to tell from the little pic but it looks like you have growth! as for that 6% thing, i didn't know the number was so high. i'm glad i didn't know that when i was waitingwaitingwaiting for hair! mamav, thank you! onvacation, a hairdresser told me that the back and sides tend to grow a little faster than the top and bangs do. i panicked when she mentioned trimming off the curly ends because i was still in that \"every mm counts!\" phase, but once she trimmed everything up and neatened the whole mess up, it all balanced out, however, even now the bangs seem shorter than the rest and there's a bizarre little fringe along the front of my hairline... a line of hair right across the front that is now only about an inch long. i don't know if that's normal or why it would grow so much slower than the rest of my hair though. prior to chemo i had waist length hair and i don't recall every noticing anything like that. i'm waiting for the day when i can make a decent ponytail...",
      "MessageIndex": 18454,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Nov 25, 2011 12:16AM Frankenboobs wrote: mammalou, i wish there was a \"like\" button here. that's huge! congrats!! =)",
      "MessageIndex": 12626,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Nov 26, 2011 12:02AM Frankenboobs wrote: thanks for the tip, LuvRVing. i just might try that sooner than later. =)",
      "MessageIndex": 12630,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Dec 10, 2011 08:07PM Frankenboobs wrote: thank you, shelley. i'm sure you look wonderful! :)",
      "MessageIndex": 12884,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Feb 8, 2012 02:27AM Frankenboobs wrote: again, thank you all! my hair is still faux-hawking, which some in my family find funny since i am a mohawk... lol it's long enough that i can - with the help of product - make it lay down, but when i just wash it and towel dry it, i end up with that. i'm wondering if chemo curls are a given. at this length, especially in the back, it's really wavy! it had a slight wave when it was long and would perhaps have been very wavy if it had ever been really short, but i'm kind of doubting that. has anyone not developed curls? as for latisse, i know a lady who uses it just because she's always had teeny little sparse lashes. she definitely has had success with the product.  mommaof4, you look great! =D",
      "MessageIndex": 13922,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Dec 10, 2011 07:58PM - edited Dec 10, 2011 08:09PM by Frankenboobs okay... i'm going to try uploading a photo here just because i'm so grateful to all the brave and beautiful gals who went before me. lol kk... you're beautiful! your hair looks amazing! :) edit... first... before chemo: 10 weeks after chemo. it's seriously salt & pepper - mainly salt - but you can see i have hair! :)",
      "MessageIndex": 12882,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Dec 18, 2011 03:39AM Frankenboobs wrote:",
      "MessageIndex": 12995,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Feb 9, 2012 12:08AM Frankenboobs wrote: thanks all for the compliments! :) thanks, ossa, for the information. that's an amazing number of women you work with but i'm still surprised by the number with cancer. it's an epidemic these days. would be nice to find out why... mommaof4, i considered doing latisse before i started chemo but i didn't know if it would be worth the expense if in the end they all fell out anyway. i wish i had researched that better. i lost the last of them about 8 weeks after chemo finished but they were only gone about 3 weeks. i was amazed at just how fast they grew in once they got started again! claireinaz, we've all felt that way in our journey. i came here for months and spent a lot of time looking at photos of new growth and such, and longed for the day when i could add mine to the roster. if i were you, i wouldn't sacrifice a mm of your hair. if it's firmly planted, leave it go and see what develops. the way you describe it is exactly how i described mine when it first started growing back. it sounds hopeful. :)",
      "MessageIndex": 13938,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Nov 26, 2011 07:34PM Frankenboobs wrote: elizabeth and bc, thank you for posting your pics! i agree with robo, you really do look great! needtobestrong, i too used baby shampoo, and aveeno moisturizer just to keep my skin from drying out. massaging that in was actually very relaxing. thanks for the advice, divine! i've been crazy camera shy since the whole \"i'm bald\" thing got underway, but you're right, looking back over the ones i do have, there is a noticeable difference. i'll make it a point now. =)",
      "MessageIndex": 12642,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Nov 26, 2011 08:25PM Frankenboobs wrote: bak, i have 2 of them and have worn them exactly twice. i prefer scarves because the wigs just feel heavy, hot, and itchy! you have to go with what works best for you... =)",
      "MessageIndex": 12644,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Feb 7, 2012 06:18PM - edited Feb 7, 2012 06:22PM by Frankenboobs",
      "MessageIndex": 13907,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Feb 10, 2012 02:38AM Frankenboobs wrote: thanks, kk & carrol! :) i was advised not to use shampoo at all when i had no hair/stubble. my hairdresser suggested i use just a very mild conditioner. she gave me 3 sample bottles of some salon stuff and they lasted all the way through. at night i slept with a scarf thingy on because i used virgin olive oil treatments on it at night. a very thin, light layer of it, and then rinsed it off in the morning. i have very dry hair to begin with, not a lot of natural oils so my scalp is prone to dryness anyway. robo, stubble counts as hair! lol",
      "MessageIndex": 13962,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Feb 11, 2012 05:16PM Frankenboobs wrote: sunflower, your hair looks awesome! i cannot wait until mine becomes something that looks like a hairstyle i might have chosen. thanks for sharing! :) claire, mine felt like it took forever to stop being stubble and to start feeling a little like hair, but really, once it takes off, it happens very quickly. i started taking pics of it once a week - mondays since i finished my chemo on a monday - and even if i couldn't see the daily changes, i could really see them from week to week. i'm glad i did the pics now. i will keep doing them until i stop thinking of it as \"chemo hair\"... lol as for the nightmares, i think those are pretty common too. i don't think that anyone could go through what we've gone through and not worry a little about dying too soon. i still find myself mentally adding \"if i'm still here\" to the ends of sentences. i have a flash of panic every time i have an unexplained ache or pain - \"is it a new tumour?!\" - and i wonder if we ever really get to feel and believe that everything is going to turn out okay. when does the worry stop? i know i'm not alone. every person who has ever had to face this hideous disease has asked themselves the same questions. i get by with that old saying, \"one day at a time\". it's all we've got... regardless. lago, luvrving, and carrol, you're all inspirations! i call you my \"hair models\".. lol",
      "MessageIndex": 13986,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Feb 7, 2012 09:57PM Frankenboobs wrote: thanks all! it feels good to actually mostly recognize myself again. cdairth, i felt much better about mine after getting it coloured. it was sooooo white that i actually looked like i had bald spots even though i had good coverage. do what you have to, to feel good again. this journey can be so depressing and it's just amazing what doing little things for ourselves can accomplish. i hope you feel perkier soon!",
      "MessageIndex": 13915,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Nov 24, 2011 10:29PM - edited Nov 24, 2011 10:30PM by Frankenboobs i've been lurking on this board since my hair fell out, looking for hope and promise. i love this thread! thanks to all the brave ladies who have posted photos and timelines. you would not believe how much hope you have provided and just how inspirational you really are!  i'm now 8 weeks and change pfc and have about a half inch of white furry hair and while there are plenty of dark hairs in there, from a distance it all looks quite white and... yanno, bald. i'm dying to colour it dark just so that it all shows as something like hair! lol i lost all my eyebrows and all but a few eyelashes almost a month after my last chemo and now i have eyebrows that are visible but still very patchy on the outter ends and and about an eighth of an inch of eyelashes top and bottom again. enough for mascara finally! i haven't had to use eyeliner this week. thank you again for sharing your stories and pics! i would have been so lost and depressed without you brave gals! =D",
      "MessageIndex": 12624,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Dec 10, 2011 09:49PM Frankenboobs wrote: thanks, kay... :) seacretgardn, i lost all of my eyebrows and the last of my lashes about 3 weeks after my last chemo. both had been very thin but one day they were just gone! thankfully they made a very quick comeback. i learned it was actually harder to lose the eyebrows than my hair. i can fake hair all day long but learning to create eyebrows was a serious challenge for me! lol i was on FEC and D so i'm not sure what happens exactly with your regimen. perhaps you'll be one of the lucky ones who just gets thinning. :) good luck with your treatments. i hope it runs smoothly for you. thank you, bak94. i too had peach fuzz at the 6 weeks mark. it wasn't hair as much it was very fine duck down. it never did arrive as stubble. it seems that the duck down just got more plentiful and then some of it started turning darker. somewhere along the line the down got coarser too. mine is probably just over half an inch long right now but it's visible. you'll be surprised how fast it actually changes now! :)",
      "MessageIndex": 12888,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Dec 12, 2011 03:35AM Frankenboobs wrote: thank you kk and momine. mamav, you look wonderful! your hair is wicked cute! carrol is right! i can't wait until mine actually has some length and i can ditch the cover-ups. i'm kind of glad it's so cold in these parts right now... lol  ",
      "MessageIndex": 12914,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Feb 7, 2012 08:17PM Frankenboobs wrote: thank you, ladies! it's just thrilling to have any hair again! :)  yes, ossa, they're all mine. i think losing them and my eyebrows was harder than losing my hair!",
      "MessageIndex": 13910,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Jan 9, 2013 08:54PM Frankenboobs wrote: it's been a long time since i posted here, though i have been keeping up with your journeys. it was an odd year. i finished rads in april, was \"discharged\" as an oncology patient in june, and spent some time during the summer doing some traveling and trying to be \"normal\" again. then my dad's problems started. chemo for mets from prostate cancer... they didn't know where. he was doing pretty well on it until he wasn't, and long story short, he passed away in december. the death certificate doesn't reflect that his was a cancer death and i worry that his overall treatment will be deemed a success when they gather the stats for 2012. instead, it will be a cardiac stat. i wonder how many others get off the books that way. anyway, i wanted to share my hair journey because i know how very much i was inspired by all the beautiful ladies that posted before. i would have felt so very frustrated and dejected had i not been able to come here and see pictures. i called them my hope and inspiration. i hope everyone is doing well and that the new year is full of growth and happiness! love and peace... ",
      "MessageIndex": 18440,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Frankenboob…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131268/profile",
      "Content": "Jan 10, 2013 04:56AM Frankenboobs wrote: thank you, shore. it's been a tough year but i'm still here to fight another day. hikergal, i had an awful time with chemo curls! in september i had an inch cut off the top, back and sides because it seemed that my hair was straight except for the curly ends. in december i had a little trimmed off the bottom for the same reason but it seems that the curl there is a little deeper than it was every place else. now i have to use a straightening iron on just those parts so it matches the rest. i know some women have to deal with the curls for years, and some, forever. i'm pleased to say that for the most part mine has returned to near normal. i can't see your profile pic very clearly but from here your hair looks great!",
      "MessageIndex": 18443,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    }
  ]
}