{
  "AuthorID": "FreakedOut2…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76738/profile",
  "Posts": [
    {
      "AuthorID": "FreakedOut2…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76738/profile",
      "Content": "Jan 23, 2009 04:53AM - edited Jan 23, 2009 04:54AM by FreakedOut2008 Hi Everyone, Well I have gone through the lumpectomy surgery and have had the porta cath placement done on the 20th of January, Chemotherapy starts January 29th. I'm not sure exactly how I feel about all of this, I do know that I have cried and screamed and even gotten angry. Well all of you that have gone through this it makes me feel really crappy that I sat in my bathroom floor crying and screaming \"WHY ME, IT'S NOT FAIR\" I am sure that all of you have felt the same way. Its very hard to talk to my family about all of this, its as though they really don't seem to understand the seriousness of the whole BC situtation. The doctors have told me that it is Stage 1 IDC, Grade 3, 0/3 nodes, ER-/PR- and its aggresive. They wanted me to take part in a clinical trial of a medication that they are trying to get FDA approved for breast cancer, but I already feel so overwhelmed with what they are going to give me as treatments already that I decided not to do the trial. Is that a mistake? I want to do whatever it takes to get a better assurance of the cancer not returning, but I am scared all at the same time. Over the next 5 months I will have 16 treatments, they are telling me that the first two months will be the hardest because of the strength of the treatment they are giving to me. But that the last 12 weeks won't be as bad. I really don't know what to think about all of this, they tell me to join a support group, but I am not usually very good with crowds of people that I don't know.",
      "MessageIndex": 21,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726415",
      "Title": "TOO SCARED TO THINK FreakedOut2008 LauraGTO"
    },
    {
      "AuthorID": "FreakedOut2…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76738/profile",
      "Content": "Dec 28, 2008 12:47PM FreakedOut2008 wrote: Thank you all so much for your response to my post, I am certain that as I put the pieces of my puzzle together I will come back here often to talk with all of you. I am so glad to know that there are people out there that can give me some support and hope in the future. Thanks again.",
      "MessageIndex": 9,
      "PostDate": "28/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726415",
      "Title": "TOO SCARED TO THINK FreakedOut2008 LauraGTO"
    }
  ]
}