{
  "AuthorID": "frequency35…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104209/profile",
  "Posts": [{
    "AuthorID": "frequency35…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104209/profile",
    "Content": "Oct 21, 2010 11:03AM frequency357 wrote: after a double lumpectomy I met a week later w/my oncologist, who hadn't even properly read my path report. She wanted me to sign up for the TailorX trail, which is underway now to determine if womwn with mid range scores on Oncotypedx benefit from chemo. As it stands, they know low scores 0-11 don't, high scores 25 plus do, but word still out on mid range. Anyway, my tumor size and stage etc did not qualify me for trial, and then I had to ask well how about doing the test anyway so I know how to decide about chemo???? seemed like she didn't care too much about my personal situation, just a guinea pig for research(which at first I was willing to do). So then she ordered Oncotypedx, which takes 2 weeks if you're part of trial, but 6 if you are not! They wanted me to proceed w/chemo.....even tho 85% of early stagers DO NOT BENEFIT from chemo.  Considering all the negative SEs of chemo, I was not willing to do it w/o knowing I was benefiting. I told them I wanted to proceed w/radiation, would follow w/chemo if test indicated good idea. They argued w/me about this, still pushing me to start chemo or wait 6 weeks, even though studies confirm there is no statistical advantage to sequencing chemo before radiation as long as both are done within 6 or 7 months post surgery. My radiation oncologists agreed about this w/me, saying they'd been telling this for years, but the medical onco seems to have the most influence. I fired mine.  After radiation my Oncotype came back in mid range, and I chose not to do chemo as no evidence yet that it would truly benefit me, and latest studies indicate mid range not likely to benefit either, but it's very much a personal choice. It's sad that during such a stressful time we have to do so much research, inform  ourselves, and assert ourselves to be treated as individuals who are more than our cancer. Look into doing radiation b/4 chemo, so as not to waste time. Talk to your radiation onco, get a second opinion. Do what feels best for you, it's your life. Sometimes they see the forest, but not the tree sitting in front of them. Take Care.",
    "MessageIndex": 10,
    "PostDate": "21/10/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/759653",
    "Title": "I am so frustrated: Who is supposed to order the oncotyping? surfette kira1234"
  }]
}