{
  "AuthorID": "FriendGwen",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
  "Posts": [
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Oct 30, 2012 12:36PM FriendGwen wrote: Hi ladies! This is my first post but I have been reading this board for the last couple of weeks. I was diagnosed on September 17th and had a bilateral mastectomy on October 18th. Had reconstruction with silicone at the same time. This past Friday I had my drains taken out (so happy about that) and we discussed my path report. No more cancer was found in either breast but a \"smidgen\" in the one lymph node they took so with that... I am certainly looking at more treatments. I meet with the RO tomorrow and the MO on November 13th. I intend to go back to work by Thursday (very laid back desk job). I have been following your posts on my iphone while resting this last week and have really appreciated the support and information you all share. I look forward to sharing my journey with you all too. Thanks!",
      "MessageIndex": 389,
      "PostDate": "30/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 10, 2012 09:03AM FriendGwen wrote: My surgery was three weeks and two days ago and I'm happily celebrating the ability to sleep in any position I want! Oh how I've missed side sleeping but it has returned! Have a great day ladies!",
      "MessageIndex": 563,
      "PostDate": "10/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793972",
      "Title": "October 2012 Surgery? Leigh22 ConnieGreene"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jun 15, 2013 09:36AM FriendGwen wrote: My hair is growing back completely gray. I had colored it for years. At 49 I can't decide whether to take this opportunity to toss the hair dye forever or to color it so that it draws less attention to myself after I toss the wig. Has anyone ditched the dye? Any regrets?",
      "MessageIndex": 19307,
      "PostDate": "15/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 17, 2013 01:35PM FriendGwen wrote: I'm heading into my third of six treatments in a minute and was just super energized by your photos. Thank you so much for posting! My last chemo is March 21. I would live to think I could lose the wig and scarves during the summer. You all give me hope! You look great!!!",
      "MessageIndex": 18513,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 16, 2012 01:16PM FriendGwen wrote: Ten days from first treatment and I would say the first three days were the \"toughest\" and then they got steadily better so that now I don't have any SE. But thankfully none of it was all that rough. I have had cramps, hangovers, and colds that had me way more miserable! Now I don't know whether I will stay like that with each treatment as my sense from reading the October and November boards is that each cycle is a bit more challenging.",
      "MessageIndex": 385,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 16, 2012 01:42PM FriendGwen wrote: I'm not taking a multi vitamin like I normally do. I asked two drs and they just grunted about getting my vitamins from food. I was given a vitamin D script to take once a week during treatment. Runnergirl - consider wig shopping. You might be surprised how comfortable and cute they can be.",
      "MessageIndex": 389,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 23, 2012 05:41AM FriendGwen wrote: Runnergirl - yes let's committ to the 5Ks. Mine is April 21 which is a month PFC. I haven't run in a race in about five years but I think it's a great warrior goal. What I did like about running was I adopted a tough girl no vanity but strong mentality when I was running. I mean you really don't care what you look like and have your eye on the finish line. I need to adopt that same mentality during treatment. My hair is shedding and I had several eyelashes in my eyes throughout the day. I need to identify again with runner Gwen and keep my eye on the prize. We all do. The end result will be warrior cancer-free bodies. We can do this.",
      "MessageIndex": 561,
      "PostDate": "23/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 26, 2012 04:04PM FriendGwen wrote: Just took the weirdest shower of my life. It was the first shower and hair washing since Friday (because of port surgery). I knew my hair was on borrowed time but there was still a little side of me thought that maybe just maybe I wouldn't lose it. Being that today is day 20 post first round I guess I'm super lucky I was able to keep it through Xmas. I'd say half of my hair has come out. I finally just put a bandana on (ugh, the only one I have is pink) so I would stop pulling out the clumps. Tonight I'll have my DH buzz it. It was super strange having the clumps of hair on my hands. I looked like an ape! I'm relieved DH is at work, DD1 is back at her apartment, and DD2 is still asleep. I needed to be alone for this. It's weird though I'm rather void of emotion. I hope I stay that way and can just look in the mirror and see a strong woman who is aggressively treating the cancer so I can be around anothe fifty years. I'm so glad to have this board to turn to. Yesterday my DD1 was reminding me how I have gotten through each part of treatment and side effects better than anyone thought. Surgery was fine. By six weeks I had no discomfort and now am completely at ease with my chest. First chemo was definetly better than I had anticipated. Now if I can just muddle through hair loss I'll be on top of this thing.",
      "MessageIndex": 623,
      "PostDate": "26/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 27, 2012 11:23PM FriendGwen wrote: Glad to see the infusions went well for most of us today. Judaday - glad they caught your reaction and hope it's smooth sailing from here on out. Paula - you are adorable!!!",
      "MessageIndex": 688,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 29, 2012 03:48PM FriendGwen wrote: Paula, I'm eating a big bowl of Greek yogurt, granola, and blueberries as I am reading your post! Will follow up with the baking soda!",
      "MessageIndex": 734,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 2, 2013 04:05AM FriendGwen wrote: I had a micromet in the lymph node too which has lead me to chemo and, apparently radiation. Is anyone else here following up with rads? I've had too much time on my hands the last few days and am reading about and questioning whether rads are really necessary. I met with the RO back in november and I recall he made a pretty good argument for it but at that point I hadn't yet met with my MO and so wasn't certain chemo was going to be required. Rads seemed like the lesser of two evils but now I'm doing chemo I like to think I can forego rads. Chemo is harder short term but rads seems harder on my other organs. I meet again with the RO in Feb but need to start gathering my thoughts now.",
      "MessageIndex": 802,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 3, 2013 04:39PM FriendGwen wrote: Nicole - I have had the same weight increase/decrease through both chemo cycles. I'm on the down side now seven days post second infusion. When I went to the second infusion I was a half a pound up from my first infusion weight. It seems we bulk up during the first four days, then lose it and then some more and then add a couple back. I would love to keep it off but if I can even just stay the same thru treatment I'll be happy. Thanks for bringing up sex! Yeah not much action in our house but am confident it will return. DH has been great about it. I slept until 10:30 today and it completely screwed up my plans for the day. I'm still sitting and drinking coffee trying to find some energy. Anyone having total congestion? I really don't think it's a cold but just SEs. I find myself fascinated by my nearly bald head. I have taken some pix and then emailed them to myself (then erased off my phone!). I imagine I'll do a year in review next December.",
      "MessageIndex": 852,
      "PostDate": "03/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 3, 2013 08:32PM FriendGwen wrote: Sophia!! I know that was a nightmare for you but my God your description was so brilliant I'm laughing! I think you outdid Stephen King with that one!! Sending you big non-oozy hugs! I will now read your posts in Sofia Vergara's accent! Runnergirl - yea for the 5k goal! I'm dragging DH to the 5k kickoff meeting next week. It's at the cancer support center which I have yet to visit. I like the idea of going as both a cancer survivor and runner. It looks like I'm getting a kitten!! I'm so excited. I put out the word a month ago and it's taken this long for one to find me. I have a dog and a cat but something about breast cancer diagnosis and my girls going to college in the same month got me thinking how much I need a kitten. Go figure.",
      "MessageIndex": 859,
      "PostDate": "03/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 4, 2013 02:27PM FriendGwen wrote: Good morning ladies. Have had a very content morning watching our new kitten Annie prance around the living room amazed at everything she runs into. Both my college age daughters are home asleep in their beds. The coffee is good and my taste buds approved of the pear I had. So right now for this moment I am content. Take that cancer and chemo and all your SEs!",
      "MessageIndex": 881,
      "PostDate": "04/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 7, 2013 08:33PM FriendGwen wrote: Jen - I find myself colder more than usual. I'm back at work today and ventured out for my lunch time walk. Granted it is in the 40s but I didn't last 15 minutes before I was back at my desk. Even with my wig on I'm usually cold. And how about getting out of the shower! I still wrap my head like I have all my life to dry my hair. Now though, when I take the towel off.. voia....I'm all dry! Hope everyone is having a content, side-effect-free Monday. The gym I joined post surgery is opening up a brand new facility today so it's a bit easier to drag myself there today after work. I'm so looking forward to my SEs to completely wane this week so I have ten days of normalness before cycle three.",
      "MessageIndex": 951,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 9, 2013 07:33PM FriendGwen wrote: I went out to lunch today and ate a salad with chicken and lo and behold... it tasted normal! And delicious. Thank you taste buds for reappearing. Perhaps a glass of wine tonight!",
      "MessageIndex": 1005,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 9, 2013 07:38PM FriendGwen wrote: My kitty Annie is a chow hound! And I fear she will be way too interested in that glass of wine. She's my cat for sure. :)",
      "MessageIndex": 1007,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 17, 2013 05:35PM FriendGwen wrote: Hi ladies. I'm at work gearing up to head to chemo round three which will put me at the half way mark. Hoping I don't feel any worse than the previous two rounds but will deal with whatever comes my way. Happy to have off work on Monday for MLK as that may be my worse day. It's like running a race every three weeks! Good luck with all my sisters whether at infusion or battling the soldiers on the home front!",
      "MessageIndex": 1142,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 18, 2013 01:23AM FriendGwen wrote: Back from chemo and the grocery store and bouncing off the walls from steroids. It's like nesting when you are getting ready to have a baby. Only I'm gearing up to take care of baby Gwen once she crashes! I tried to stock up on any foods that somehow seemed tolerable last time. Here's hoping I guessed right. Now off to start with the baking soda rinse.",
      "MessageIndex": 1150,
      "PostDate": "18/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 20, 2013 03:44PM FriendGwen wrote: Day three after third chemo and have the lightheaded dizzy thing happening. Have two real estate clients to meet and dinner at MIL's. Fortunately I have a real estate partner with me should I need to retreat. Also managed to pull a muscle or something in my hip while running yesterday. Ugh. Glad to have no obligations tomorrow so I can rest!",
      "MessageIndex": 1184,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 23, 2013 02:34AM FriendGwen wrote: LeaA - thanks so much for the links!",
      "MessageIndex": 1219,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 26, 2013 01:18PM - edited Jan 26, 2013 01:19PM by FriendGwen Ladies - has anyone been told to avoid hot tubs if they have had lymph nodes removed? I only had one removed during my surgery in October. None of my doctors said anything about it. I'm going to my sister's house this weekend and would love to get into her hot tub.",
      "MessageIndex": 1265,
      "PostDate": "26/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 7, 2013 08:00PM FriendGwen wrote: Hi ladies! Sitting here in chemo land having my fourth infusion. It is nice knowing exactly what to expect. I do this alone and really like the solo time. Bren - ugh! So sorry about your week! Hang in there! Julie - my amazing Momma had BC in 1994 at age 65. She blames it on hormone replacement therapy. She had a single mastectomy with no reconstruction and no additional treatment. She's now 84 and other than IBS she's doing great with no recurrence. My aunt was diagnosed the next year and did the same thing as my mom with no treatment and no recurrence. She opted a few years ago to have her remaining breast removed as being lopsided hurt her back. Both these gals have been inspiring me that life will go on cancer free. Ummm, did I have my first hot flash last night or was it from the steroids? I'm 48. My sister didn't start menopause til she was 52. I haven't had my pd since December. I wonder if chemo induced menopause is the real deal or temporary.",
      "MessageIndex": 1379,
      "PostDate": "07/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 9, 2013 10:43PM FriendGwen wrote: Hi ladies. My tastebuds from round four are beginning to go. This is definely my most miserable SE! I managed to work real estate for about six hours today which included a somewhat ok club sandwich for lunch. I'm beginning to crash but determined to hold on to normal for as long as possible so just told DH we'd go out for a pizza dinner. Maybe if I move quickly I'll enjoy it!",
      "MessageIndex": 1407,
      "PostDate": "09/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 14, 2013 11:47PM FriendGwen wrote: It's so nice after a long day of work and chemo brain and no tastebuds to come to these boards and know everything I am going through is normal and shared by all of you! I'm writing on my phone so can't address individuals only topics. About sex... Haven't had any since chemo started and really appreciate my DH for being ok with that. This is all temporary. I thought going hairless down there would be great but I don't like it. It feels weird and maybe the opposite of Nicole (I think it was you) as it seems almost swolen. And very dry. Chemo vaginal changes... Lovely. After two days in the couch in my gloom I bounced back and am back to feeling good (well except for all the SEs!). Kiwi, I have an old dog and a cat but as soon as I started chemo I knew I needed a kitten. It was a great decision and I know little Annie has helped in my chemo recovery. And these animals do bring such a normalness back to our daily routines. And it's hard to feel sad when a kitten is stretched out asleep on your neck!",
      "MessageIndex": 1437,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 17, 2013 12:51AM FriendGwen wrote: I have the eye twitching!! It feels so huge but when I look in the mirror I can't even tell. It's the silliest SE! Ok back to sewing a pillow case. It's the first little craft I've done in years and a result of cancer/chemo/empty nest time to do things for me!",
      "MessageIndex": 1455,
      "PostDate": "17/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 18, 2013 02:14PM FriendGwen wrote: Donster and Steiner: Yeah, I have a bit of TC weight gain too. I think I'm up about four pounds so that would be a pound per infusion. I have cut way back on exercise and I eat whatever satisfies especially during the no tastebud time. But like Donster says one thing at a time. I know I feel better when I exercise but I'm having a little pyschological thing going on. I worry that my wig will fall off or go askew while at the gym! I could also be taking a weekly yoga class where I work but don't for the same reason. Today my coworkers are starting a couch to 5K running program and although I'd like to go ... it's a little intimidating given my treatments and SEs. New SE this morning... my nails hurt. Ugh.",
      "MessageIndex": 1465,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 25, 2013 04:03AM FriendGwen wrote: Hi ladies. I'm feeling good as infusion five is this Thursday. Four down two to go. My fingernails are achy and both thumbs have red arcs on them. They're very sensitive and feel as if I've pulled them back. I hope this isn't an indication of trouble to come. My eyebrows are thinning as there's been no newbies growing in which tells me once the senior brows fall out I'll be brow-less. Boo. At least it was nice seeing so many gorgeous women sporting short hair-dos at the Oscars! Perhaps we will look that sharp later this year! Bren - hang in there!!",
      "MessageIndex": 1500,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 28, 2013 06:57PM FriendGwen wrote: Here I sit in infusion 5 with my eye twitching and my nails taking on a whole new look! Ah in the scheme of things these are minor SEs I can deal with. I'm just so excited that in another thirty minutes I can say only one more infusion left! Of course got two rounds of post chemo funk to get through but nonetheless progress is being made. Are most of you heading to radiation after chemo? I start april 22.",
      "MessageIndex": 1514,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 3, 2013 04:50PM FriendGwen wrote: It's day three post chemo five so taste buds are gone and any SEs are rearing their not so pretty head today. I finally decided to use day two as a rest day so that perhaps I'll be better on day four to go to work. Last round I was really light headed day four. My thumb nails look like I banged them with a hammer! My eyebrows are there but not too pretty and losing hair on the end. After this week of SEs God willing I'll only have one more. I have very little energy but contemplating making a big crock pot of mashed potatoes as my go to food for the next few days. Wishing all of you a nice Sunday!",
      "MessageIndex": 1533,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 23, 2013 07:10PM FriendGwen wrote: Sandy - I read you post and then ordered a used copy of the book from Amazon! The Mederterrian diet has been the one diet that has consistently appealed to me. I agree with a mostly vegetarian diet. I also like some dairy, bread and wine! All things that add joy! Steiner - sorry you've been battling bugs but happy the steroid weight came off. I'm encouraged. I'm enjoying my last post chemo weekend allowing myself to stay home and chill! Going to make a black bean veggie lasagna for dinner if I can get my butt off the couch! The taste buds are starting to go. Boo! But am so happy to put the steroids away! Happy Saturday ladies!",
      "MessageIndex": 1595,
      "PostDate": "23/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 8, 2013 10:45PM FriendGwen wrote: I went for an easy walk today and it really kicked my butt. Now I'm home totally exhausted and achy. Yikes. I feel like chemo:1. Gwen:0. I had ambitions of the walk and the gym after work but not happening. I hope this is temporary and I get some strength back soon enough!",
      "MessageIndex": 1656,
      "PostDate": "08/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 9, 2013 02:11AM FriendGwen wrote: Thanks Nicole - you're totally right. And Runnergirl - wow I can't believe you're nine weeks pfc! I guess this whole thing is a slow process. I suppose I need to relish in my tastebuds returning. I guess the light at the end of the tunnel is a little farther than I thought but each step forward gets us closer. How's everyone's fingernails? I'm wearing a band aid on my thumb because it really wants to lift off.",
      "MessageIndex": 1659,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 29, 2013 06:30PM FriendGwen wrote: Hi everyone! For those of you doing radiation what is the difference between the boosts and the regular sessions? Just want to prep myself as I found the worse part so far was day one when I didn't know how long I was going to be on the table. My fuzzy hair is coming in more and more in a mix of brown, gray and white. I lost about 80% of my eyebrows but am seeing the regrowth coming up. It's like watching a garden bloom! Bren - sending good thoughts your way. Whatever life throws your way you will come out strong.",
      "MessageIndex": 1720,
      "PostDate": "29/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "May 9, 2013 03:32AM FriendGwen wrote: Yay Bren!!!! I'm so happy for your excellent results! That is wonderful news and worthy of some celebrating... Champagne... Limo ride... Or even just a restful and comfy night's sleep!",
      "MessageIndex": 1737,
      "PostDate": "09/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jun 8, 2013 05:42PM FriendGwen wrote: Hi Jen! Glad you checked in. I've been thinking about the December group. I finished rads ten days ago and am really feeling good. I see the MO on Friday and will get my tamoxifen script. My hair is coming in salt n pepper but completely covering my scalp. My eyebrows had thinned a lot but they're back. And yes back to shaving my legs! I have lost about 8 pounds as I'm back to being a vegetarian only this time it's not just avoiding meat and eating crap but following a whole foods plant based diet. Basically no processed junk and adding lots of fruits, veggies, beans etc. After going thru the loss of tastebuds during chemo I am so happy to be eating and enjoying real food. I'm in awe of melon and peppers and avocado! I hope everyone is coming out if the intense treatment stages and seeing the light at the end of the tunnel!",
      "MessageIndex": 1744,
      "PostDate": "08/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 21, 2012 02:23PM FriendGwen wrote: I'll be starting around December 6th, still waiting for it to be scheduled. Right now I'm trying to decide whether or not to get a port put in. I had intended to but last night I got an email from the MO nurse saying it was really optional based on the chemo I was going to have. So I'm kind of thinking of going without it at first and if my veins have a problem then I'll have it installed. I have so many appointments coming up (blood work, vision, LGFB, need a wig fitting, etc.) that one less appointment is tempting! Steiner18 have you looked at wigs yet? How's your spirits holding up? I'm still working and feeling great and ready to just move foward with this journey!",
      "MessageIndex": 1,
      "PostDate": "21/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 28, 2012 12:46PM FriendGwen wrote: Skimommi - I am hoping to exercise through treatment as well. I have always done some kind of exercise but have kept an extra 15 pounds on me since having my babies. My babies are now 18 and almost 21 so that excuse is old! I do not want to add any more weight no matter what treatment I'm on! SO I have joined yet another gym and have met with a personal trainer in hopes that she can help me stay on track over these next six months. Keep me posted on how you're doing with exercise. Runnergirl - You diagnosis is a whole lot like mine. My MO gave me three options: ACT, a second one I can't remember, and Cytoxan/Taxotere. I chose the cytoxan/taxotere and will start on December 5th. My choice was just me following a gut feeling based primarily on what I had read on these boards but I can't say there is any right one for any of us. I think the one I chose may be a little easier on the heart and since I may have mitral valve prolapse (never confirmed) I went that direction. Keep researching and then follow your gut I suppose! MommyGoth - Am totally up for ideas on how to rock the bald and/or pixie look! On Friday I am having my plastic surgeon repair my piered ear where the hole was simply too big for my liking (I love that I can now say \"my plastic surgeon... never would have anticipated that before BC). I had stopped wearing earrings years ago. Since I'm looking at rocking the bald head I decided earrings are imperative. KeetMom - That's so great that you are feeling good so far! I hope it keeps up. Keep us posted. I wondered around Target last night looking at their hats and was in a bit of a fog thinking Wait.. what?? How did I get here? Am I really picking out things to wear on my soon-to-be bald head? Ultimately I wasn't ready to commit yet and walked out without any head coverings. I think once I go to the Look Good Feel Better class next week I will be inspired to make some purchases. And perhaps I'll take my older daughter with me for some fashion advice. Day by day I am closer to treatment and hence reality but also to successfully getting through this journey! Have a great rest of the day ladies!",
      "MessageIndex": 66,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 2, 2012 01:57PM FriendGwen wrote: Heather - thank you for visiting us and giving us inspiration. It really helps. Nicole - posts like Heather's really help give me something to hang my hat on. I didn't expect to be in this situation but am focusing on all the ways I can turn this sucky situation into one that will help me grow and give me the tools to live an even happier and more empowered life (for many many decades)! I have always exercised but rarely taken it to the next level, which I hope to do now. I understand chemo may throw me for a loop but I'll do what I can. Meanwhile I focus in what I might like to do this summer once treatment is done and my pixie cut would be returning. I have found myself really belly laughing more since diagnosed. I work with my best friend which allows us to find a lot of humor in life's quirks. Like all of us I really do not look forward to losing my hair but it will be an experience that will enable me to look past my shoulder length bob with bangs that I've been sporting for way too long! Maybe I'll discover short hair is awesome which is something I may not have ever had the courage to do before. I'm also reminded frequently how many people are thrown crappy challenges and how many rise to the occasion. I work on a college campus. The other day I was walking and saw a student who I am assuming had been in a fire as his face was quite different (not sure what word to use here but you get the idea). He was walking with two other students and chatting and looked content. It was very humbling. I realized ok I will lose my hair but I can simply put on a wig. The hair will grow back on its own, no surgery required. This young man will probably continue to have surgeries and long term scars. I look at the breast cancer survivors I know and they look great. We can do this. The time will go by quickly enough. Keep picturing yourself happily being outside this summer doing something you love, or maybe even doing something new you would never have tried before BC!",
      "MessageIndex": 111,
      "PostDate": "02/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 10, 2012 03:54PM FriendGwen wrote: Runnergirl - if your insurance covers it, which it probably will, you might want to get a wig. I expect I'll be in my wig for months while at work and then sporting the hat/hair wig at the gym or running around. Home will be scarves and caps. Although who knows how it will all pan out! I'm at work feeling very spacy. I took an anti-naseua at 2am but otherwise haven't had anthing since Friday. I feel achy but intend to go for a walk during lunch and see how I do. I'm not feeling the best I've ever felt but it did occur to me this morning that I have had hangovers worse than this! Bren58 - I have never been one to take meds either so this is kind of weird. I'm still hesitating unless I feel really bad as it seems like the side effects from the meds (constipation primarily) might be worse than the symptom I took it for! I'm getting the idea food is not going to be a big source of enjoyment. Boo! Maybe a good smoothie or something will help.",
      "MessageIndex": 238,
      "PostDate": "10/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 10, 2012 06:12PM FriendGwen wrote: My MO wrote me a script for the wig and when I went to the wig place on Saturday they were submitting it to insurance and felt pretty confident it would cover up to $500. My wig was $350 but another $140 in hat/wig and hats so they may be able to get it all covered. I wrote checks which I hope won't be cashed. I really think wigs should be like the reconstructive surgery... covered by insurance should women want it. I'll know for sure by the end of the week and will keep you posted. I walked during lunch and then got sidetracked to get a strawberry smoothie. It went down okay while in my mouth but then the sense of mouth burn returns.",
      "MessageIndex": 240,
      "PostDate": "10/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 10, 2012 06:59PM FriendGwen wrote: JenMas - the only thing I did was get a gentle powder for constipation that the nurse suggested and put that in hot drinks for a couple of days post chemo. I believe it's taxotere that can make you constipated not to mention the other meds they offer. I also made sure I had baking soda as I'm swishing baking soda/salt/water in my mouth a few times a day. They should give you some scripts for you to use as you need them. I kept wondering if I was nauseus or not so twice I have taken a pill. It might be worth asking about heartburn as a few of us have that that too. And yes... water, water, water!!",
      "MessageIndex": 245,
      "PostDate": "10/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 13, 2012 02:30PM FriendGwen wrote: Bren58 - Congratulations on your daughter and you ability to be part of it! Our children's successes are those magical moments that I cherish so much. I got two back to back texts from my college daughters yesterday. The first was a picture of an A on the big Astonomy paper DD1 turned in. The second was a declaration that DD2 aced her Calc exam and finished two hours early. I love those moments!",
      "MessageIndex": 316,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 17, 2012 04:00PM FriendGwen wrote: Steiner - I'll check on the Vitamin D dose when I get home and let you know. I'm really clueless on dosages. MTJulie - don't feel like a wimp!! Each cycle and each day is different for each one of us. At the moment I'm enjoying the pretty normal way I feel but I'm sure my share of feeling cruddy will also come. Baby yourself when you need to! Yesterday I went for a hike with my husband while he ran. Thirty seconds into it I decided to run and did so, at a very slow pace, for two miles. I felt so invigorated I took a picture of myself sporting my new pixie and texted it to some of my rocks (my supporters). It was very empowering running in the crisp December weather ten days post chemo! Spent the afternoon rearranging the living room (after seven years!) and setting up the tree. I actually cleaned out the buffet of my girls' arts and craft items and replaced it with MY stuff! Wow. I think now that they are both in college the boxes of glue sticks and stickers are no longer necessary. DD1 is a fine arts major so she has moved on to higher quality art supplies. Have a great Monday ladies and know we are another day closer to putting this journey behind us and moving full steam ahead into health!",
      "MessageIndex": 411,
      "PostDate": "17/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 19, 2012 03:12PM FriendGwen wrote: Hi ladies! Sophiafred and MTJulie - I opted for the double mastectomy because basically... I wanted them to match! At 48 they were beginning to get a bit droopy so it was vanity and comfort that had me do both. I had two lumps in my left breast so the BS felt a lumpectomy wouldn't have left me with much. I didn't have tissue expanders either but went straight into reconstruction with silicone implants and after about 5 weeks of minor stretching discomfort I feel completely fine. No regrets. Duckie - my MO suggested using Miralax for constipation which I drank in coffee on days 2 and 3 post first chemo and it did the trick. I think my sniffles are just a SE from chemo and not a cold so hopefully no problems with low WBC. It's day 13 and hair is completely intact. The calm before the storm...",
      "MessageIndex": 485,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 27, 2012 02:57AM FriendGwen wrote: Umm disregard mention of vision problems but strike one up for chemo brain. I was wearing my daughter's glasses.",
      "MessageIndex": 647,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 27, 2012 01:15PM FriendGwen wrote: LeeA - I LOVE the PacMan image! I rocked that game back in the 80s! Now I know why!",
      "MessageIndex": 674,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 30, 2012 07:39PM FriendGwen wrote: Hi ladies! Day 3 post chemo 2. I had a weird night of sleep. First night without Ativan since Wednesday. I can't decide if I caught a cold or am having chemo SEs. Am definitely spacey and lightheaded and food tastes gross although I want to eat. My brother is stopping by and my daughter is here so I forced myself to shower (took two minutes), put on make-up, my wig and a Baltimore Ravens jersey since we are watching the game. Am trying to convey an image of all is well even though that's not quite how I feel. Fake it til I make it I suppose!",
      "MessageIndex": 774,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 6, 2013 02:32AM FriendGwen wrote: Jenjenl - I know it is a surreal experience but you did it! The anticipation is almost worse. It has been about 12 days for me and I'm adapting. I wear my wig when out and go topless or wear scarves at home. Just tonight I figured out how to do a turban with a beautiful scarf and I'm feeling almost a little glamorous. It's like playing dress up. Today when I went running I wore the baseball hat with half wig. As someone who has had bangs for years having a bald forehead seemed ridiculous and not me. But it was also kind of empowering not having hair in my face. Tonight when I went out to dinner I had on my wig with awesome highlights. It's kind of fun having my different looks! And you will love your quick shower tomorrow. It takes me under ten minutes to shower, put on make up and get dressed. More time to drink coffee and play with my new kitten!",
      "MessageIndex": 927,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 8, 2013 07:36PM FriendGwen wrote: Sophia - Agreed!!! I stupidly mentioned my concerns about whether I should do radiation at a family dinner the other week and my pack-a-day smoker brother-in-law announced he \"doesn't believe in radiation\". Umm, excused me based on what? Your 12th grade science class from the 1970s? Or your talk radio shows? STFU! I told him radiation saves lives and just quickly changed the subject. And please... agreed... no more gifts of herbs or articles about lemons or broccoli curing cancer. Let me just quietly, strongly get through treatment... Thank you very much.",
      "MessageIndex": 978,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 13, 2013 08:29AM FriendGwen wrote: Speaking of the flu shot my MO gave me the go ahead to get one. I had assumed once I was having chemo I couldn't get it. So on Friday I got the shot. Off to the Visionary Arts Museum in Baltimore with the family this morning.",
      "MessageIndex": 1058,
      "PostDate": "13/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 13, 2013 02:35PM FriendGwen wrote: Peggy - FWIW I had a double mastectomy with immediate reconstruction (implants no tissue expanders as I stayed with the same size) and I had no problems physically or emotionally. I was back at work in under two weeks. I had a tightness in my breasts for about six weeks but then it was fine. I hope this helps! Bcoct - cats crack me up!!",
      "MessageIndex": 1068,
      "PostDate": "13/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 19, 2013 09:55PM FriendGwen wrote: Hi ladies. It's a sunny day here so I managed a run/walk for about forty minutes with DH. I think the steroids are beginning to calm down. The mouth ick had begun so everything tastes cruddy. Otherwise though I think I feel better two days post chemo than the first two rounds so that's encouraging. DD2 went back to college today so it's quiet again. Thinking a nap with the kitten sounds good about now.",
      "MessageIndex": 1174,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 20, 2013 12:24AM FriendGwen wrote: Runnergirl - I sat around too much after chemo 2 and I think it made me feel worse. So I'm trying to do a little more this time and hope for the best. Who knows how long that will last!",
      "MessageIndex": 1176,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 31, 2013 12:47AM FriendGwen wrote: Hi Carla - I've been thru three rounds and I don't think the SE have gotten worse but maybe a little different. I had a brief bout if constipation with the first round only. I was congested with the second round only. I think the taste buds seemed a bit worse after chemo 3. I feel less anxiety now since I know pretty much what to expect. Overall it's not nearly as bad as I had thought it would be. However I am very excited to finish up in March! Good luck to you!",
      "MessageIndex": 1316,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 6, 2013 02:24AM FriendGwen wrote: Volleymom - I'm so sorry about your flu! Talk about adding insult to injury. It these chemo cocktails can kill off bad and good cells it would be nice if they could zap a nasty flu bug too! Sending you recovery vibes! Chemo four (out of six) is Thursday. I've been happily enjoying my last ten days of feeling normal. It was fun being on my game while watching my home boys, the Ravens, win their Superbowl game! Baltimore is still celebrating! I'll always remember this Superbowl as my chemo bowl! Hang tough ladies! We got this!!",
      "MessageIndex": 1366,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 8, 2013 07:48PM FriendGwen wrote: Bren -  very cool link you posted. How adorable is that girl? Runnergirl - Strep throat? Yikes! Glad you're feeling better! Bouncing off the walls in a combo of hyperness and fogginess thanks to three days of steroids. TGIF! Hope the weather cooperates as tomorrow I put my Realtor hat on and have three showings and two listing appointments. At least here in Maryland the market seems to be seriously turning around! By Sunday I will allow myself a day of rest and may take off work from Monday at that seems to typically be my toughest day. So not looking forward to the tastebuds going bad. It looks like I've put on about 5 pounds since chemo began and it's not like I don't know how that happened. Nothing tastes good so I eat anything I want to try and be satiated. Then I get the tastebuds back and so eat anything I want because it's so much fun! Gotta get a grip on that. Oh... and I've not exercised since my run three weeks ago when I pulled a muscle. So yeah, eating and not moving isn't the best for weight control. Good luck Paula on your last treatment! Volleymom - when is your surgery planned? Honestly the whole thing wasn't as bad as I expected. The tubes that you'll have post-surgery are a little annoying but not painful. Visit the surgery threads to get some good advice on dealing with them.",
      "MessageIndex": 1400,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 10, 2013 11:00PM FriendGwen wrote: Hi gang. I have barely moved from the couch all day. All those day 3 post chemo SEs hitting me. Along with it I'm feeling rather gloomy. Since dx in September I have stayed very upbeat knowing this is something I will beat. I don't allow myself to wallow in self pity or indulge in fear. I used to write in a journal but have only written once as I don't want to explore too deeply. I had a fitful night of sleep and today have battled that fear and gloom I have been avoiding. Im so sensitive today to every nuance to cancer that pops up on tv or Facebook. I'm hoping this is all part of the steroids leaving my body and the toll chemo can take on us. I'm sorry to sound down. I just can't dump it on to my amazing family and friends who have been so empowering to me. I know I am doing everything in my power to beat this damn cancer and like to think it's already gone. Why today am I second guessing it all?",
      "MessageIndex": 1412,
      "PostDate": "10/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 15, 2013 07:22PM FriendGwen wrote: Finally went for a walk today for the first time in weeks. It wasn't much but damn did it feel good. I crossed paths with a woman with a really short haircut and a pink sweatshirt with hope written on it and we smiled. I suspect she was a kindred spirit a couple months ahead of me in this journey. There's a lot of us out there which although that's a sad observation there is also comfort in knowing how many survivors there are. Enjoy your Friday ladies!",
      "MessageIndex": 1445,
      "PostDate": "15/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 12, 2013 12:23AM FriendGwen wrote: Congratulations Peggy!!!!",
      "MessageIndex": 1557,
      "PostDate": "12/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 22, 2013 09:40PM FriendGwen wrote: Nice to see you back Runnergirl! Keep the faith ladies. Yeah our bodies have been through some challenges but there's no question we can come out of this stronger than ever. I admit I had aspirations of doing a lot more exercise these last three months but honestly I do this every winter! I literally put on one pound for each round of chemo. Didn't want any one round to feel ignored. And I realize rads may bring on some fatigue but one way or another I'll keep putting one foot in front of the other. I keep picturing myself strong come the fall and hopefully sporting that cute pixie cut I had for a week in December!",
      "MessageIndex": 1590,
      "PostDate": "22/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 5, 2013 03:13PM FriendGwen wrote: kslansky - glad surgery went well! Today is tattoo and piercing day! How's that for being one bad-ass momma? It's nipple tattoos. And I had my plastic surgeon sew up my original ear piercing back in December as the hole was too droopy for my liking and she's repiercing it today. I actually had to go to Claires and buy starter earrings. So yeah, tats and piercings today. I never would have guess I'd be saying that!",
      "MessageIndex": 1642,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jun 21, 2013 11:24AM FriendGwen wrote: Wow Sandra! 60 mile ride! That's awesome! Good luck!!! I had my hair \"trimmed\" yesterday by my hairdresser and great friend. I'm still wearing my wig except at home but had her shape up what she could and basically cut the wild hairs on the back of my neck. It just felt so good to be back in her hairdressing chair! I'm heading to the beach on Monday and think I might toss the wig at least while on the beach. So ready to move forward!",
      "MessageIndex": 1754,
      "PostDate": "21/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 24, 2012 03:18PM FriendGwen wrote: Banksy: I'm planning the two step haircut as well. My hair is shoulder length right now. I work at a college and will have several weeks off starting some time the week of Dec 17th. I figure if I start chemo around the 6th I will start losing my hair around the 20th. So as soon as I'm done working I will get my hair cut into a pixie. Even if the hair loss hits quickly I hope to at least have a few days with the new super short cut before shaving it off. I'm imagining Anne Hathaway's current cut! Meanwhile I'll get a should length wig similar to my current style to wear once I go back to work. Hopefully that will fool the masses! So that's my plan!",
      "MessageIndex": 20,
      "PostDate": "24/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 25, 2012 04:24PM FriendGwen wrote: Keetmom, my 18 year old daughter had spinal fusion four years ago too. She's now one of my best emotional supporters reminding me the discomfort will pass quickly and it will all be worth it. You have certainly had your share of challenges but it sounds like you've picked up lots of strength along the way. We can get through this!",
      "MessageIndex": 29,
      "PostDate": "25/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 28, 2012 07:19PM FriendGwen wrote: My MO didn't order the test for me because of the damn smidgen of cancer found in my lymph node.",
      "MessageIndex": 71,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 29, 2012 08:08PM FriendGwen wrote: I don't have a port. I intended to but then spoke with the oncology nurse who said it really was optional based on the chemo drugs I was getting. So I have decided to give it a try without a port. If it proves difficult I'll schedule the port surgery. This is all so new... Just taking it one step at a time and relying on intuition.",
      "MessageIndex": 87,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 3, 2012 06:17PM FriendGwen wrote: Hi ladies! I'm at work but gearing up to go to the Look Good Feel Better Class very soon. Tomorrow I meet with the onc nurses and on Thursday it's chemo day. Let the games begin! So ready to just do this already!!",
      "MessageIndex": 131,
      "PostDate": "03/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 5, 2012 08:05PM FriendGwen wrote: Adagio - I don't have a port either and start chemo tomorrow. I intended on getting it but my oncology coordinator told me it's not essential and that I may as well see how I do with the first round. She said the nurses prefer the port so they don't have to search for the vein but after she spoke with my doctor she was reassured that it was optional. They will want to monitor me more closely I suppose tomorrow. Did your veins cooperate on your first round of chemo? I went for an hour long walk during lunch today. I decided to keep an online diary monitoring my side effects and overall health during treatment. I have high hopes to come out of this whole thing in better shape than before.",
      "MessageIndex": 173,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 7, 2012 06:11PM FriendGwen wrote: Welcome Laurreg - Thanks for sharing how your first week went. Very encouraging. I had my first chemo yesterday and am in work today, although I took my time coming in. Wow on these steroids! I weighed myself this morning and am four pounds heavier than yesterday morning! I'm pretty sure the small salad and hot cocoa I had for dinner wouldn't have done that! Ugh. Last day for steroids thank goodness! Happy Friday ladies!",
      "MessageIndex": 198,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 8, 2012 10:40PM FriendGwen wrote: Hi ladies. Very happy to report the wig shopping was a success. My daughter and I chose about five and the owners brought a few more. Some were quite ridiculous! I had to explain to DD who the Bay City Rollers were after trying on one of them. DD did use the word mullet on a couple others. But alas we found one quite cute that is just a bit shorter than my current style but with fabulous expensive looking highlights! Will have my friend trim it a bit. I also got a baseball hat with wig connected on the bottom to exercise with. Feeling good having the wig challenge done. Still no real SEs since Thursdays treatment other than constipation so I'm drinking something for that now.",
      "MessageIndex": 211,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 14, 2012 04:26PM FriendGwen wrote: Judaday - It was me that wrote about my daughter's facebook post. It was super sweet of her but so gut wrenching. But hey what they heck.. I better be her hero!! My girls are my heros. Sandra60 - we had surgery the same day! Your first day of treatment is my second round. So far so good. Beachlovingmom and Dwihtd - Hopefully the next time you log in you'll be reporting how easy your first treatment went! We're all behind you! Bren58 - So you did it! Congratulations on the shave! I'm getting the pixie tomorrow morning just so I can have a few days with a super short but one I might actually wear, before it all goes bye bye.",
      "MessageIndex": 345,
      "PostDate": "14/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 15, 2012 04:08AM FriendGwen wrote: Hi ladies. My latest SE is one bloodshot eye. It doesn't bother me and I was fine to wear my contacts but it showed up last night and is still here. I googled it and it can be a chemo SE. I suppose crying watching the news coverage this evening hasn't helped much. So sad. Haircut in the morning!",
      "MessageIndex": 357,
      "PostDate": "15/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 7, 2013 04:01PM FriendGwen wrote: Hi Bren! I'm doing/feeling great! Yes this holiday will be much nicer than last years for sure! Today I got a message from a friend who found a lump and is having a biopsy next week. She's very nervous. I reassured her as much as I could that yes it sucks but the whole thing is doable and most likely treatable. Nonetheless I pray she's fine and can avoid the year we all had. My hair is growing and this morning I realized I might actually be able to put it into a pony tail! Ok it's only about a half an inch ponytail but it's a start!",
      "MessageIndex": 1776,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 27, 2012 08:01PM FriendGwen wrote: Hi everyone! I have so many appointments all leading up to chemo day on the 6th. My to do list is a mile long. Since like all of us I have no idea what to expect once I start treatment, I'm trying to get as much done as possible beforehand. It's a bit overwhelming but I find it helpful to make me feel like I'm in control of the situation. I find myself thinking about something coming up later in December or in 2013 and thinking about my hair, or lack of, and how I might be feeling. I'm pretty sure it will be a bald Xmas. And possibly a wiped out New Years Eve. Put I also picture myself lying in the sun this summer rocking a cute pixie cut and thinking what a survivor I am to have weathered this storm!",
      "MessageIndex": 46,
      "PostDate": "27/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 4, 2012 07:54PM FriendGwen wrote: Banksy - I'm laughing at your Mr T comment! So funny. Sunflower - Thanks so much for paying us a visit and cheering us on. It really helps to hear from our sisters that went before us. Looking forward to doing the same next December, and every December thereafter! Had my Chemo class today and feel pretty in control of the upcoming challenges. Am armed with scripts for steroids, anit-nausea, sleep aid, and Vitamin D. No restrictions on food, other than I may not want really spicy stuff. The nurse said rinsing with a baking soda/water mix a few times a day is a good idea. Was adviced to drink lots and lots of water from here on out. I start the steroids tomorrow. I will most definitely spend my lunch time walking around campus!",
      "MessageIndex": 151,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 7, 2012 01:59AM FriendGwen wrote: Am home after my first day of chemo and feel pretty normal so far. Since starting steroids I've had some fleeting headaches and a bit of heartburn. I managed to have the chemo without a port today but two nurses strongly suggested I get the port. They convinced me so I'll set that up the week before Xmas. Thank you Runnergirl for asking the question I had about when to take the anti nausea meds. I'll wait til tomorrow provided it doesn't rear its ugly head first!",
      "MessageIndex": 191,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 7, 2012 08:41PM FriendGwen wrote: Skimommi - Boo!!! I'm so sorry to hear you're dealing with chicken pox! Yeah, not having control over things in many ways is the hardest part of this journey. Hang in there and remember this too shall pass!",
      "MessageIndex": 201,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 9, 2012 06:31PM FriendGwen wrote: I agree skimommi - visions of being at my parent's cabin on a lake in the Adirondacks this summer is what keeps me grounded right now! Plan that summer vacation on Florida!!",
      "MessageIndex": 224,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 11, 2012 12:11AM FriendGwen wrote: Mfml - no way!!!!!!! That is a classic! Love it!",
      "MessageIndex": 260,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 11, 2012 04:30PM FriendGwen wrote: MTJulie - Welcome! Good vibes are coming your way for both an easy drive to the infusion center and a relatively relaxing treatment. I actually enjoyed the forced downtime to read People and play on my iPhone. Also, like you my mom is a survivor. It's been 18 years and all she had was a single maxtectomy without any treatment. She's 83 and on zero meds. She keeps telling me she hasn't lost any sleep worrying about my cancer cause she knows I'm going to be fine. She worries more about her one year old puppy! Dawn - Yes, miralax! That's the anticonstipation stuff I took as well and it works great (yet slowly and gently). Banksy - I know what you mean about becoming the research queen. This time a year ago I was obsessed with all things related to getting my daughter into college (and paying for it). Now I'm slowly becoming an expert on breast cancer. Ugh! Not what I was planning but so grateful to have all this information available. I also purposely limit myself from flinging too deeply into the wild west of the web where there's so much scary or wrong information available. It's challenging finding the fine line between science and understanding what it's all about, and mixing it with the personal stories of survivors. I've become the collector of survivor stories from both friends and strangers. I have had about five women contact me to share their (upbeat) stories and it's been great. Day five post first chemo and other than food tasting odd I feel pretty normal! Have a great day ladies! Gwen",
      "MessageIndex": 272,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 13, 2012 02:48PM FriendGwen wrote: MTJulie - I'm going to have six weeks of rads too! Another journey for us to share :)",
      "MessageIndex": 318,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 16, 2012 01:23AM FriendGwen wrote: Long but successful day! I got my thick shoulder length hair cut into a pixie and it's pretty cute. Granted I don't expect to have it more than a week or two but it has helped me visualize what I hope to have next fall. I then had my hairdresser (and dear friend) trim the bangs of my new wig. I wore my wig all day and honestly felt great. It looks really pretty and I love the highlights. I'm a real estate agent and so had an appointment to show one of my listings to a family I had never met. I'm pretty sure they had no idea I was wearing a wig! In the afternoon my husband and I drove to Pennsylvania to fetch my daughter from college. On the way we visited with my sister and brother-in-law. He had no idea I was wearing a wig! Crazy! By the time I got home it felt good to take it off but it was not uncomfortable. Am feeling like I got this part covered! Oops no pun intended ;)",
      "MessageIndex": 377,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 17, 2012 07:04PM FriendGwen wrote: Pands - Thanks! Yours was the answer I was looking for! jenjenl - Take a deep breath, know you are doing everything right with getting the best treatment there is and assume you will be absolutely fine. Then try and stop what iffing and thinking about it beyond what you need to do for treatment right now. Working will help you focus on other things which is a big help. You got this! Volleymom77 - that is incredible news. Wow. It's really amazing to realize how powerful these chemo drugs are and that they are doing exactly what they are supposed to. I like to think my surgery took all the cancer out of my body and now the chemo is like this mid-life oil change that only us lucky ladies get to have to assure us we have the most kicking genes to keep us going another fifty years!",
      "MessageIndex": 425,
      "PostDate": "17/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 20, 2012 06:13PM FriendGwen wrote: Day 14 post first treatment and for the first time I did see hair in my hand when I shampooed, and on the towel when I dried off. I'm in my wig and feel the occasional tingly feeling. I had an appt with the MO's assistant today. She knew I was wearing a wig. I realized probably people that know me know I am wearing a wig. I work at at college with wonderful professors who have simply said they liked my \"do\" and didn't dig any deeper. I wonder if I fool complete strangers when out at the stores or in the gym. I find myself looking at everybody's hair now! I guess I never thought folks were wearing wigs before so probably strangers aren't obsessing about me! Get over it Gwen! I am wearing a wig! So what! I had to have an EKG today in preparation for tomorrow's port surgery. I'm lying on the table hoping my wig doesn't fall off or that the tech wasn't weirded out by my odd looking breasts thinking wow this is weird. She commented on how relaxed I must be judging by my heart rate! Okay I got this. If that didn't make me nervous nothing will.",
      "MessageIndex": 510,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 27, 2012 01:08PM FriendGwen wrote: Paula - you give great advice! I agree with all of it! Sandra - I have had several offers for the magic anti nausea treatment too! So far I haven't taken anyone up on it but should I feel so inclined I will! I haven't indulged since the 80s! Jenjenl - I hear you about control. In many ways that is what has helped me the most. I read these boards and prepare myself and then sit back and let it all go knowing whatever comes my way I can handle it. Get the pixie cut! I had mine for ten days and loved it. Will have it again next Xmas! Tammyj - Sophia is right. You've come to the right place. Remember all the side effects are a list of any effect anyone has ever had. The vast majority of us will just have a few minor ones. And hair loss but even that is not nearly as bad as we all first think. Hang in there. You got this! I'm here having my second infusion and thoroughly enjoying myself. Seriously there is nothing scary or uncomfortable about sitting in a comfy recliner with a warm blanket, watching a Reese Witherspoon movie, eating snacks and playing with my iPhone! No laundry to do! No dishes to clean!",
      "MessageIndex": 672,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 28, 2012 11:27PM FriendGwen wrote: Jenjenl - what a wonderful day for you!! That's awesome and just fills my soul with happiness! Enjoy that pixie. It's a great transition to our GI Jane and then smooth head. Im looking forward to my long-term pixie in 2013!",
      "MessageIndex": 719,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 1, 2013 05:45PM FriendGwen wrote: Happy 2013 ladies. Let's make this year ours!! I started reading the Crazy Sexy Cancer Survivor book and adore the writer. Her name is Kris Carr and she's a fabulous cancer thriver. She's very inspiring and in spite of her inoperable stage four cancer ten years ago she is full of health (it's a rare cancer that is on her lungs and liver). Paula, thanks for the reminder about the steroid meltdown. I feel both antsy and exhausted and it's getting on my nerves. And topped with a head cold. Part of me wants to get outside and hike. The other side gets dizzy just standing up. I want to do something but my brain is foggy. Ahh. This too shall pass. I've been remembering all my dreams the last few nights. It's like I go from deep REM to wide awake quickly and frequently throughout the night. Steroids again I bet.",
      "MessageIndex": 797,
      "PostDate": "01/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 12, 2013 11:15PM FriendGwen wrote: Hi gang! I'm in my good week so I'm living large. I went out for happy hour with buds both Thursday and Friday. Today I managed a 2.8 mile run and now am watching football with my family (go Ravens!). Annie the new kitten is asleep. I met with my MO on Thursdsy. We discussed radiation and I will go forward with it. It seems to be a better alternative than surgery to take more lymph nodes. I'm fine with it as I know I am doing everything possible to fight this. Hoping to be done all the treatments by mid June. And hoping to go topless by August when I'm with my family at our lake house in the Adirondacks. That's my plan! Hang in there ladies! You are all awesome!!",
      "MessageIndex": 1042,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 12, 2013 11:17PM FriendGwen wrote: Okay... When I say topless I do mean without a wig not without a shirt!!",
      "MessageIndex": 1043,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 15, 2013 12:11PM FriendGwen wrote: I had my blood work done this morning for Thursday's infusion. As I was walking through the parking lot I was looking at the bumper stickers. Threre were several cars (mine included) with \"Life is Good\" stickers. I thought wow, that's ironic being at a hospital and the cancer parking lot. But then I thought actually we are the folks that are actively treating this disease so we can move forward and have a long healthy life. So yeah, life is good! Judaday - so sorry for all the crud you had to go through, and into your good week no less! I'll think of you while we are both having infusion on Thursday. Peggy - I'm with you on the no sex thing. I just keep reminding myself it's just a little break. We celebrated our 25th wedding anniversary in June and I expect on the 26th I'll be back to my old self, sex and all. Plus, DD2 is still home from college which tends to be a strong form of birth control (we live in a pretty small house). Nanc - your sacred spot sounds wonderful! I love creating those! Paula - I agree with you on the benefits of tea tree oil. I will start putting that on my nails now. Ladies - have any of you ordered the Brian Josephs cream for your eyebrows and eyelashes? The ladies on the hair forum have mentioned it several times. It's not cheap... $50, but if it legitimately works I'd be interested.",
      "MessageIndex": 1096,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 18, 2013 05:47PM FriendGwen wrote: Am happy today is Friday as I'm still flying on steroids and getting lots done before the crash (both work related and personal). Was just notfied DD1 is receiving another grant for college so our balance was just dropped by $1500. Thank you for that miracle! That just paid for her plan to visit a GF in Spain during spring break. Nothing makes me happier than seeing my daughters fulfill their dreams! I just had to make five corrections to this post... chemo/steroid brain in full force! Good luck Paula on the rest of your infusion today! Kiwi - my own brother came to visit the weekend after my last treatment complete with a cold. Ugh. I need to get tough with visitors too. TGIF ladies!",
      "MessageIndex": 1158,
      "PostDate": "18/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 26, 2013 12:23PM FriendGwen wrote: Donster - Out of the mouths of babes often come such brilliant words of advice. That's a great way of looking at your bad day. I'm getting antsy myself. Infusion 5 is Thursday but I have so much to do over the next couple of weeks I'm finding it hard to schedule my recovery days! I work full time plus am a realtor and real estate is picking up big time. Most of my clients don't even know about my BC. But seeing the light at the end of the tunnel helps a lot. It's almost March which is when my final chemo is! Enjoy your day gang!",
      "MessageIndex": 1510,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 22, 2013 01:40PM FriendGwen wrote: Julie - grrr what a stupid insensitive thing for your MO to have said! Wouldn't it have been way more beneficial to tell you not to be concerned that you'll drop the weight no problem. Duh. Tell someone they will do well and they will. Chastise them and they feel defeated. Med schools need to step up their bedside manner classes! My last chemo was yesterday so I'm enjoying my last day of tastebuds! I stressed out about my upcoming rads a couple months ago. I did some research and talked with my MO and RO and decided to do it. I'm going into it with a positive frame of mind and not second guessing it. Act 3 of this breast cancer treatment play!",
      "MessageIndex": 1583,
      "PostDate": "22/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 6, 2013 01:14PM FriendGwen wrote: Bren - I hope you can skip either ALND surgery or rads too. But if doing both is in the cards then just remember you are fighting this thing full force and this time of treatment will all be behind you soon enough. Hang in there. So I love the tattoos! The dr and nurse were lots of fun and even turned on a big \"Tattoo Parlor\" sign in the exam room. After all this treatment the last few months, and no visits to a hair salon, it was really gratifying to do something purely cosmetic and fun for me. I'm happy to have earrings again too that I can play up once the little pixie shows up on my head. Enjoy your weekend everyone!",
      "MessageIndex": 1648,
      "PostDate": "06/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 9, 2013 07:51PM FriendGwen wrote: Yay Sandra on the weight loss! That's what I want to hear! And the thought of tamoxifen possibly helping further would be beyone fabulous. I went walking again today and it felt easier. Although now my fingers are too swollen to get my rings off which does sometimes happen when walking. But I feel like I'm retaining fluid too. I need to get back to drinking tons of water. I met with the RO today and got my rads tattoos. I start a week from tomorrow. Just so ready to get er done!",
      "MessageIndex": 1662,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 10, 2013 01:52AM FriendGwen wrote: I'm totally retaining fluids. My ankles have lost that bone bump. I'm going to call my MO tomorrow. I ran into a gal I met at the LGFB class today while leaving the rads area. She is almost finished rads. She was telling me the worse part for her was the nipple burn. She told me what lotion to buy and I took everything she said in. As I was driving back to work I had this huge epiphany. I don't have nipples. Only tattoos! Duh.",
      "MessageIndex": 1665,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 18, 2013 06:57PM FriendGwen wrote: I've concluded that I have two options. I can worry about it which will do nothing to stop a recurrence but could possibly add stress to my body which could decrease my overall health. Or not worry about it, assume I have done and am doing everything I can to reduce the risk of recurrence, and live my life as if I will die in my sleep at 101. I will do my best to be physically and emotionally strong by following a super healthy diet, getting enough sleep (love that part), taking vitamins, and exercising. Doing all that will keep my mind busy enough with no time to waste on worrying!",
      "MessageIndex": 1682,
      "PostDate": "18/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jul 6, 2013 03:54PM FriendGwen wrote: Yay for feeling good!! I was just thinking about it yesterday. I feel better than I felt before BC. Not sure if it's because chemo and rads are over.... Or if that cancer was actually taking a toll on me... Or if I'm so grateful now for not being in a chemo fog, or having to watch my arm range if motion, or being able to eat and taste the most wonderful fruits and veggies now, or perhaps a combo of all. I also like to think the Tamoxifen is making my bones stronger. I've been running the couch to 5k program and loving it. I'm still wearing my wig to work and in town but not for exercise or at home. In this Maryland heat having super short hair is so awesome. I think our timing for chemo was pretty ideal. Have a great weekend ladies and keep posting!",
      "MessageIndex": 1762,
      "PostDate": "06/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 29, 2012 10:10AM FriendGwen wrote: Hi everyone! Elimar - Yes, my dr showed me the Adjuvant Online and by doing chemo, rads, and tamoxifen I'd reduce my chance of the cancer returning from 25% to less than 10%. Skimommy - I'm going to avoid upper body strengthening for a while. I'm going to ask my plastic surgeon about it tomorrow. I was good about not lifting anything more than 5 pounds for several weeks after surgery but am back to carrying groceries and laundry. I really miss the yoga class I was taking but that downward dog position would be way too hard! My game plan is to try and eat as healthy as possible since that's so more the main source of weight loss, but to use the exercise to release those endorphins and keep me feeling good during treatment. I know I'm not getting buff during these next six months but even just keeping things status quo willl be okay with me. Nanc - My LGFB class is Monday and I'm really looking forward to it. I love free stuff but also am looking forward to getting my appearance plan together! Chisvel - First treatment and you're feeling good! YES!!!! One down!!!",
      "MessageIndex": 77,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 12, 2012 02:18PM FriendGwen wrote: duckiedee - can you wear your wig with your current hair as it is? I understand the logistical dance you are doing! I'm the same way! I'm six days post first chemo and hair is still the same. Just trying to gear up for the change. Getting mine cut pixie short on Saturday and will start wearing the wig to work on Monday. Each morning when I blow dry and straighten my hair I say a little see ya again in a couple years (to get it back to my shoulder)! I've also decided to envision my new baldness as GI Jane and not chemo victim! I keep thinking of Demi Moore and Sigourney Weaver. Hey did I read Kelly Pickler (American Idol) just shaved her hair in solidarity with a BC friend going through chemo? Very cool. On the food-tasting-weird front... lemon drops are my new best friends.",
      "MessageIndex": 298,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 13, 2012 02:26PM FriendGwen wrote: Good morning everyone! Erin Orchard - Welcome! I am one week post first chemo and have not had any nauseua. I typically get car sick and was very nauseus post surgery but so far so good. We may all have our moments at certain points during treatment but as some of the other ladies have pointed out there are plenty of meds ready to help. I took the anti-nauseau pill twice pretty much out of anticipation that maybe I would feel ill but never did. I really think chemo has come along way in the last decade. So far I have been really pleased with how doable first surgery, and now treatment has been. Hair loss will come next week so that's the other piece of the emotional puzzle to deal with but I know I will survive that as well. Check in here to the boards often as this group of gals really are supportive and a wealth of information. Nicole503 -  I just added buffs to my Xmas list yesterday! They seem great and as a big fan of the show Survivor I will feel solidarity with those survivors! They have some great prints and are available all over the web. I even watched a youtube video yesterday on all the different ways to wear them. I like that they are used by healthy outdoors people and not associated with chemo. Powermom - yeah, I'm starting to get a little water challenged myself. The colder the water is the more I can handle it. Also it cannot be in a metal container as then it really is gross. I do think this is key to keeping our side effects away so I just keep sucking it down. I met with a personal trainer for my first session last night and it was really empowering. I have another session tomorrow.",
      "MessageIndex": 315,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 17, 2012 06:04PM FriendGwen wrote: Have any of you had a beer or a glass of wine since starting chemo? I'm pretty sure my onc nurse said to not drink but I can't remember if that was throughout the entire treatment of just the first few days after each infusion. I had no desire the first week because I was hydrating myself like crazy and then my taste buds were screwy but I'd really like to think I have have a glass during my Xmas Eve dinner. I'm not currently taking any meds. I will ask the Physicians Assistant who I meet with on Thursday but really I'm hoping if I ask enough folks I'll find the answer I want.",
      "MessageIndex": 417,
      "PostDate": "17/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 18, 2012 04:55PM FriendGwen wrote: Paula - I completely agree about a merry heart! I chose to be happy and so I am. It's pretty cool. I also allow myself to watch funny things on television and have found I will belly laugh at slapstick like I never used to do. I also have a friend who posts stunninly beautiful pictures of nature on facebook every morning and it brings me such joy! And snuggling with my fat cat or old dog makes me merry!",
      "MessageIndex": 450,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 18, 2012 05:06PM FriendGwen wrote: Runnergirl - Uh oh.. now that I've inspired you you've inspired me to keep with it. I'm sitting at my desk with my tennis shoes next to me and a great walking path out my door. Okay, okay... I'll go walk. Paula - there is a youtube video. Google \"how to wear a buff\" and you'll find a cute outdoorsy dude explaining on the ways he wears it.",
      "MessageIndex": 453,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 20, 2012 08:20PM FriendGwen wrote: Sophiafred - I LOVE IT!! Yes GI Jane is our girl! Demi is gorgeous and I love the caption!! I may have to watch this film over the holiday!",
      "MessageIndex": 516,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 22, 2012 01:15AM FriendGwen wrote: Hi ladies! Sorry to hear about the struggles. Keep the faith. This too shall pass. Got my port installed today. Wow, I loved that sweet little sedative they gave me. Been home all afternoon puttering about wrapping gifts and being so grateful to have two weeks off from work. Day 15 and my hair is coming out. Because of this port the dr said no shower until Wednesday! Holy smokes. The plus side is if I can keep myself from touching my scalp maybe I can keep my hair thru Xmas. I love my pixie cut. Should have done this ages ago. Hopefully it will return by the end of summer.",
      "MessageIndex": 546,
      "PostDate": "22/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 22, 2012 02:47PM FriendGwen wrote: Good Morning! Runnergirl - the wind is howling here in Maryland this morning. I feel great but between the wind and the post port surgery instructions of \"no exertion\" I guess I'll be taking it easy now through the few days post chemo 2 on the 27th. Between that and all the Xmas goodies finding their way into my house I hope I'll feel strong enough at the beginning of 2013 for running and the gym. I have a goal to run a 5k at the end of April. It's a fundraiser for a local cancer support center and the course is at the college where I work and often walk at lunch. It couldn't be a more perfect combination. If I'm not up for it I'll at least do the one mile walk. Oh and I got the port at the strong encouragement (insistence?) of the infusion nurses. Had a glass of wine last night. It was fabulous. Today is cookie baking day. I know my hair is coming out in strands so I'm just not touching it!",
      "MessageIndex": 552,
      "PostDate": "22/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 24, 2012 02:40PM FriendGwen wrote: Hi ScarYola! Glad to hear the hair loss wasn't as rough as you had anticipated. Mine is still hanging on but I know it's coming. As for the tests I had an MRI on my breasts only prior to my surgery just so they could verify what they had already seen with the mammogram and sonogram. I asked about additional tests but the dr said it wouldn't show them anything. Treating the whole body with chemo was the most aggressive treatment. FrednTan - thank you for stopping in and encouraging us! Am off to the hospital for blood work and to have my port bandaged changed. Then it's family time! Merry Christmas everyone! Wishing you all a wonderful Xmas Eve!",
      "MessageIndex": 587,
      "PostDate": "24/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 25, 2012 03:58PM FriendGwen wrote: Merry Christmas ladies! Got several pairs of earrings and a buff for Xmas all in preparation for what will soon be a bald head! Today there is still hair on my head which I am grateful as I just wanted it to hang on for Xmas. Tomorrow it's back to steroids for Thursday's round 2 infusion. Runnergirl - I will be thinking of you tomorrow.",
      "MessageIndex": 604,
      "PostDate": "25/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 27, 2012 01:07AM FriendGwen wrote: Jenjenl - yay for a happy day! My DH just buzzed my head! And I'm completely unphased and maybe even a little happy?? I didn't expect that although many women say there is a real sense of empowerment. Am currently rocking a baseball hat. Funny without hair my face seems thinner. Nicole - I got an email today from the same company saying my scarf is on the way! Good timing! Fightlikeawoman - I was just looking at the Xmas tree and wondering why the lights are blurry. Hmm. A SE I reckon.",
      "MessageIndex": 641,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 28, 2012 05:42PM - edited Dec 28, 2012 05:44PM by FriendGwen Keep drinking water ladies!! We will get through this! I'm home in jammies, wearing my glasses (mine not my daughter's!) and sporting a red cap. Just had a knock at the door and saw the car belonged to a neighbor/friend who knows about the cancer. I hesitated for a second but then thought screw it and opened the door. She brought me a huge chocolate covered apple. We chatted for fifteen minutes and it was very easy! This is who I am at this moment, that's all! I will look more like Gwen again in a few months only I will have a warrior inside me too.",
      "MessageIndex": 711,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 5, 2013 07:53PM FriendGwen wrote: Dcsandpiper - thanks so much for that info. I am going to talk with my MO. I really feel like the rads are overkill. I had a double mastectomy with reconstruction and am doing chemo. I seriously do not want to risk any other physical ailments as I want to really make exercise a major part of my life and ongoing treatment. Just back from a 2.8 mile hike only I ran the first 1.4 miles! It felt great and I spent a lot of time visualizing my strong self in 2013. Endorphins have been released!!",
      "MessageIndex": 917,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 6, 2013 02:49PM FriendGwen wrote: Bummer about the coffee ladies! It's about the only thing that hasn't gotten funky for me. I don't take sugar in it which may help as I've noticed sweet things aren't great. I seem to tolerate a burger the best which is funny since I was a vegetarian for a year until a few months prior to dx. Last night I was desperate to have a beer while out to dinner. It too tasted gross. If this is anything like last cycle my taste buds should be back this week.",
      "MessageIndex": 932,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 9, 2013 08:39PM FriendGwen wrote: Sophia - if you can handle it switch to just taking baths and don't wash your hair. I did that from day 15 when I had port surgery until day 20 and held on to my hair through Xmas. Once I hit the shower it came out in clumps but still appeared pretty normal. That night however I was ready and so had my DH shave it. It's all rather surreal but the anticipation was worse than the reality.",
      "MessageIndex": 1009,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 27, 2013 05:47PM FriendGwen wrote: Happy Birthday Julie!! It's my DD1's 21st birthday today too! Clearly a great day for a birthday. DH and I are taking her out to dinner and I'm crossing my fingers and toes that the food will taste good. I'm still fascinated by my bald head. I have a lot of white crazy fuzz, some like half an inch long. Then there's some super short dark hair. I can't tell what's new and what's been there all along. I've started taking photos at some point during each round and emailing them to myself so I can reference it (and then delete promptly from my iPhone!).",
      "MessageIndex": 1282,
      "PostDate": "27/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 10, 2013 11:31PM FriendGwen wrote: Thank you Sandy. Your post was exactly what I needed. :)",
      "MessageIndex": 1414,
      "PostDate": "10/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 5, 2013 10:45PM FriendGwen wrote: Congrats Holly! I'm looking forward to being done soon! I finally feel like myself today for the first time since Friday. Taste buds aren't quite as horrendous. Latest side effect? Tintinitus! Did I spell that right? It's like there's a white noise machine in my head. I googled it. It's a chemo thing of course! These drugs have a mind of their own!",
      "MessageIndex": 1537,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 6, 2013 09:23PM FriendGwen wrote: A new flower indeed Holly! I spent my snow day cleaning out my closet. I tried on a bunch of things and stared at my bald self in the mirror and decided I'm going to look and feel fabulous in no time. I put on a sweet Laura Ashley sundress I had bought when DD1 was six. She's now 21 and although the dress is a hair snug it still works. Fifteen years and BC treatment and I'm still the same person pretty much with the same body. I'm just happy that so far this damn cancer has not taken that from me. I'm excited to get moving again and will wear that dress once the sun finally comes out!",
      "MessageIndex": 1545,
      "PostDate": "06/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 19, 2013 11:31PM FriendGwen wrote: Hi ladies. I have my final chemo on Thursday. I didn't drink enough water this past weekend and had wine instead! By Sunday evening I was sure I was getting a UTI. I drank a bunch of water and by Monday was much better. Saw the MO's PA today and she said its from the chemo. I hadn't realized how important it is to stay hydrated throughout treatment. Once I feel better around day ten I tend to drop the good habits. I'm so looking forward to Spring and warmer weather! I need to move my tired body and drop this winter chemo weight!",
      "MessageIndex": 1576,
      "PostDate": "19/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 28, 2013 01:40AM FriendGwen wrote: I've sat in meetings the last couple days and found myself really self conscious about my unsightly fingernails. I rarely paint my nails but am considering it. But then I keep thinking I read something about not painting them anything but clear? Chemo brain has me wondering what's real and what's not. I spent most of the evening holding my chemo kitty Annie as she was recovering from being spade today. She's been my sweet little loving nugget these last three months. It was nice to comfort her!",
      "MessageIndex": 1611,
      "PostDate": "28/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 2, 2013 07:51PM FriendGwen wrote: Congrats Duckie, JenJenl and Nicole! I'm 12 days post final chemo and have to say I am seriously feeling my energy and tastebuds returning! I hit the gym yesterday and am going back today. My eyes are still watery, nose runs a bit, blah blah blah but those are the minor SEs. My head is full of white peach fuzz. As a brunette I keep thinking if it stays like this I may get a glimps of what I'd look like blonde. I wish I had tried on some blond wigs! I find myself studying any woman with a short hair cut wondering at what point mine will look like that! Hang in there ladies, we are mile 20 of this marathon!",
      "MessageIndex": 1632,
      "PostDate": "02/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 16, 2013 07:29PM FriendGwen wrote: Nicole - I'm was doing cytoxan and taxotere every three weeks for six rounds. Last week would have been the time for the next infusion. I found myself noticing my breathlessness but mostly just walking up stairs. I also was clearly retaining fluids. On Friday I got a pill from the PA which I have taken each day since and my fluid retention is back down. I met with the MO yesterday and he said that is why they give us steroids because of the taxotere water retention. Also, those steroids always pumped me up energy wise obviously. So like you this was the first time in months I wasn't getting that jolt. That might explain why the gym looked too challenging last week. I suppose this is something to just work through until my body realizes I'm not getting another jolt of steroids. Were you on steroids? On another topic I had read that low Vitamin D may be connected to breast cancer reoccurance. I asked the MO about it yesterday and he said that of woman that have BC return 1/3 had low D, 1/3 were borderline, and 1/3 were fine. He said that may me indicative of the general population or not. They can't really give survivors a D or a placebo as that would be unethical. So I'm going to do a multi vitamin from here on out as well as a second pill in the evening of just D. That's my plan! And give myself to sit in the sun whenever I can (just a few minutes)! Starting radiation tomorrow...",
      "MessageIndex": 1672,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 25, 2013 02:47AM FriendGwen wrote: That's great news Jen! Wishing you an easy recovery. No food or water in the morning due to port removal surgery tomorrow. Looking so forward to having this physical symbol of treatment gone! Been exercising this week and feeling stronger. Day by day!",
      "MessageIndex": 1699,
      "PostDate": "25/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jun 16, 2013 06:21PM FriendGwen wrote: I went for a run today for the first time in a long time. Running with boobs that stay in place (thanks to a double mastectomy with implants), short hair (thanks to chemo), and a tanned chest (thanks to radiation) is fabulous!! How's that for finding a silver lining! Happy Father's Day ladies!",
      "MessageIndex": 1752,
      "PostDate": "16/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 17, 2012 04:53PM FriendGwen wrote: Wow Steiner - that 14 days hair loss think seems to be dead one. That means Thursday for me. Today I am in my wig at work and so far I have had about 7 compliments on my \"hair cut\". Honestly I think folks have forgotten about my BC which I have not been too vocal about. Works for me!",
      "MessageIndex": 414,
      "PostDate": "17/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 18, 2012 04:52PM FriendGwen wrote: Good morning ladies! One week until Xmas! Thanks for weighing in on the alcohol thing. If a beer or wine tastes good on Xmas Eve I will have one. If not, that's okay too. Judaday - we are on the same treatment on the same schedule! Bren58 - Good luck with Round Two! ding ding ding! Runnergirl - Hoping you get low liver counts today and that your 4-year old is a good little companion! Sophiafred - you have pretty much the same diagnosis as me. If it wasn't for that damn smidgeon in my lymph node I may have been able to avoid chemo. Oh well, just letting the little warrier chemo drugs work their magic on my bod. I'm slated to follow up with radiation and tamoxifen. Talk about doing everything you can! Had a double mastectomy too! Beachlovingmom - Yeah, this hair thing is a challenge. My hair was shoulder lenth and quite thick. I cut it into a pixie on Saturday and really like it. I know it's fleeting but I figured baby steps would be a little easier. Judging by what the board is saying my hair will start falling out on Thursday so I may shave it this weekend. I'm wearing my wig at work and am happy to have it although will go for scarves and buffs at home. I've had sniffles for the last couple of days and am a bit sneezy. A cold or side effects? I feel fine otherwise. Hoping it's SEs. Happy Tuesday everyone!",
      "MessageIndex": 449,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 18, 2012 07:12PM FriendGwen wrote: Steiner - Yeah, I'm taking that mega dose 50,000 of Vitamin D. What were the SEs your friend had? I've taken it twice and haven't noticed anything.",
      "MessageIndex": 457,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 27, 2012 12:07AM FriendGwen wrote: Pands - it does look like a birds nest when it comes out! Paula - ok I'm going to take the Ativan tonight since I'm on steroids today. Glad to know you wake up refreshed. Judaday - lets rock this thing tomorrow! Runnergirl - yay for an uneventful infusion! Hope to have the same! Ladies - is anyone else driving themselves to get treatment? I arranged to be dropped off and picked up the first time in case of additional drugs but had none. Worse case I can call plenty of folks that could come and fetch me and my car but I just prefer doing it independently.",
      "MessageIndex": 637,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 27, 2012 08:11AM FriendGwen wrote: Thanks Runnergirl! Wearing the wig over a buzzed head today! Packing up my bag of entertainment for chemo. Looking forward to reading a yoga mag I got from Santa. Judaday - I take steroid pills the day before, of, and day after. I have not gotten the neulasta shot and don't expect to unless I have a problem with the blood counts. I took an anti nausea pill twice firing the first round. Last night I took the Ativan for the first time and it was fine. I was afraid it would wipe me out but all it did was let me sleep like I normally do when not on steroids. I take a weekly vitamin D that the MO prescribed. And tonight I'll have Miralax in my tea to help with the constipation that all this tends to bring on. Good luck today! You too Nicole!",
      "MessageIndex": 660,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 29, 2012 04:37PM FriendGwen wrote: Paula - I get the vanilla flavor. It's a bit gooier and not as sweet which is why it's good to add the cereal and fruit. But it offers more protein than regular yogurt.",
      "MessageIndex": 736,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 30, 2012 12:36AM FriendGwen wrote: You're right side up Paula!",
      "MessageIndex": 745,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 31, 2012 09:47PM - edited Dec 31, 2012 09:48PM by FriendGwen Hi gang. Peb - I take Tylenol and it seems to help with many gripes. You will probably start feeling better tomorrow. I'm on the same chemo exactly three weeks ahead of you and I remember feeling great within a week. I think our immunity is lowest however from like day 7 to 10. Julie - I hope you feel better soon! Adding the flu on top of treatment is so unfair! Hang on! Hopefully this will be it for the season. Nicole - LOVE your sunrise post! Thank you for sharing that! So how did the buzz cut go? You ready to drop and give me 20 yet? My GI Jane has morphed into Sinead. I still feel pretty tough though. Sandra - I've been having heartburn too and Zantac seems to take pretty good care of it. Today is Day 4 and I definitely wound up with a cold. A cold plus chemo is pretty annoying although it occurred to me, again, how good the timing is. I am off work til the 7th so hopefully this will be the one and only bug I get this season (you hear that universe? I'm talking to you!) DH and ventured out to the bookstore today as I absolutely had to get out of the house! Being New Years I normally spend time writing in my journal and coming up with my plan for the year. It's always the same stuff (lose weight, exercise, save money, blah blah blah). Well I guess this year I can add kicking cancer's ass to the top of the list! So to inspire me I bought a book called \"Crazy Sexy Cancer Survivor\". Hope to have fun with that! Then we stopped and bought three variations of Ben and Jerry's to ring in the New Year with. The weight loss goal can start tomorrow.",
      "MessageIndex": 788,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 8, 2013 05:43PM FriendGwen wrote: Hi ladies! Just wondering... is anyone else so sick of the pink breast cancer ribbon and all the marketing crap that goes with it? Why do people think I want any of it? One friend gave me a goodie bag right before I started chemo which had chocolate and magazine (perfect) but then a whole sea of pink bc stuff including several bc ribbon pins. Then this weekend several of my friends gave me a sterling silver bracelet which is quite pretty only what is it? The damn bc ribbon. Ugh. Would have loved just a simple bracelet. I am all about the great work Komen and the other bc orgs do and I know everyone's intentions are super sweet so I always act very grateful and appreciative. But it's hard enough trying to live my life normally that the last thing I need is more reminders of this damn cancer. Also, I wish I could tell folks please don't share with me stories of people you have known that had cancer unless they beat the hell out of it and are thriving. There is nothing worse then sitting through a story and then hearing them ended it with \"but she passed on\". Ugh! Thanks for letting me vent. On a positive note I went to the grand opening of my gym last night and the locker rooms were the most beautiful things I had ever seen! It will be quite a while until I can shower there (obviously) but when I do it will be luxurious! Hope everyone is feeling good today! Or at least not bad!",
      "MessageIndex": 969,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 15, 2013 01:18PM FriendGwen wrote: Thanks Tinah - I started the same chemo as you the day before. I haven't used the cream and still have my brows and lashes. Ahh! No easy answers. The thing concerning me is that a lot of the ladies say they lose them after they're done chemo! I guess the cream is an added insurance and so I think I will order it. The only downside is losing $50. The upside of keeping them is quite worth it.",
      "MessageIndex": 1099,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 21, 2013 04:43PM FriendGwen wrote: Welcome Jasmin55 - glad you found us! What I wouldn't give to find something satisfying to eat! Day four and I think this is my worse day in the chemo cycle. Am glad to be home sporting my turban and working on taxes. I just wish I could find something delicious. I know I need to keep hydrated but water has taken on the gross taste. Am working on V8fusion with seltzer but have barely touched it. I found my scalp hurt when I first lost the hair and had it buzzed cut. Now it's just a softer light colored peach fuzz that no longer hurts. You ladies struggling with it should start feeling better soon. For what it's worth... I love my baby smooth legs! Happy MLK day ladies!",
      "MessageIndex": 1203,
      "PostDate": "21/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 22, 2013 06:38PM FriendGwen wrote: Bren58 - a hair cut for free.. score! LeeA - That is awesome you were able to meet with the Integrative dr. So her scoop is.. moving forward, try and get a thirty minute walk in a day and eat a Mediterrain diet and you will typically reduce your rist of reoccurance by 30%? That is quite motivating. Hmm, so if I'm doing chemo, rads, and tamoxifen that should reduce my risk to under 10%. Add your suggestions and I'd lower it to under 7%? Just trying to find the right numbers to keep me motivated to eat right and move my body. Did she discuss alcohol at all? I have always enjoyed drinking and have just started to have a glass or two during my good week of treatment. I was so freaked out in September of my diagnosis I didn't touch any alcohol until my Thanksgiving dinner. I'd like to think there's a place for it in my life (moderately) where the positives outweigh the negatives. Nicole - I'm still too fuzzy headed to be shiny. Have you lost all the hair on your head? I'm really light headed today and having a hard time getting enough water in. I'm not peeing enough which concerns me although I have had about 20 ounces. May skip out of work a bit early today.",
      "MessageIndex": 1212,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 24, 2013 07:25PM FriendGwen wrote: Jenjenl - not TMI!! You're just vocalizing what many of us feel! Seeing the transition in our own bodies over the last month or few can be rather overwhelming. I find myself comparing things to BBC and after. Like I'll see an email or picture from August and think wow... I had no idea what was about to hit me. And what BS was I worrying about then? Probably money! Funny, I still worry about all the little and big crap too. BC is just another item on the list. But the visual change is pretty wild. I just went to the mall during lunch to buy some birthdy presents for DD1. I kept thinking this is my first time here in a wig. Do people know? For a while I was avoiding my typical places like the local grocery store so that I'd be less likely to run into someone I know. I went yesterday and saw no one. I think I'm finally getting to the Screw it stage... this is who I am right now (same Gwen just with a highlighted perfect looking wig and eyebrows that are insistent on going every which way before jumping ship). It will be another six months before I will look back to my old self and then will be in a very short hair cut. For people that don't know about my BC they will probably start putting it together. I haven't posted any picture of myself on FB since prior to cutting my hair. At some point it will happen. Sorry... just rambling trains of thought here. Thank you for being a therapy board! One week post threatment three and I'm so done with my lack of taste buds! I bought $50 worth of random foods last night and the only thing that worked was dark chocolate almond milk. But I was so happy something tasted good I drank a large glass and then got a belly ache! Whaa!",
      "MessageIndex": 1241,
      "PostDate": "24/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 7, 2013 09:22PM FriendGwen wrote: Yeah I took an Ativan last night and look forward to one tonight. I take them on steroid days and it helps. I'm definely starting with getting hot at night. Not sweating yet just hot around 4am. Oh joy!",
      "MessageIndex": 1381,
      "PostDate": "07/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Feb 19, 2013 08:46PM FriendGwen wrote: Bren - I'll be doing radiation after chemo. There was some discussion of surgery but in the end I decided the 20 minute of rads per day for six weeks was probably less annoying and with less chance of lymphoma. That was where I ended up. I hope it will prove to be the right decision but who knows!",
      "MessageIndex": 1476,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 1, 2013 02:35AM FriendGwen wrote: For what it's worth I asked the nurse today if most folks lose their nails and she said no, just some discoloring. So that's promising. I came home tonight and cleaned intensely for an hour. Thank you steroids. Now I'm relaxing and having my second steroid hot flash. It's so weird! Hoping I won't have them during menopause but guessing I will. My MO said I am probably done with getting my pd since I haven't had it since starting chemo. Hmm any chance I can just bypass menopause symptoms altogether? I think that would be a fair trade off for losing my hair!",
      "MessageIndex": 1521,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 10, 2013 01:20PM FriendGwen wrote: Wow Nicole the conference sounds amazing! I went to a conference on breast feeding 18 years ago with DD2 on my back and got so much out of it. There's nothing like being with lots of other women going through the same situation to really feel empowered. It sounds like the mood of your conference was upbeat and encouraging even in the face of something so annoying as cancer. As you remember more tidbits over the next few days be sure to share. There's only so much I can read online. It's much nicer having it filtered through a sister survivor.",
      "MessageIndex": 1549,
      "PostDate": "10/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 21, 2013 01:54AM FriendGwen wrote: Bren - you are quite right. I have to admit I am way stronger of a person than I ever thought. My journey is far from done what with radiation, tamoxifen and a life time of looking over my shoulder but not letting it rule me. But I'm pleased with how I've handled surgery and chemo so far and hope I can continue that way. But in many ways the hard work remains. So far I've been a passive patient. Once I get through rads I know I have to start the hard work of serious exercise and a clean diet. Those are two things I can do to actively discourage cancer from returning. So yeah I'll keep returning to these boards. I've gained a lot from reading the posts from the regulars on the exercise boards whose treatments are complete. They're an amazing group just as all you ladies are!! Annnd... I just had a steroid hot flash and pulled the scarf off! :)",
      "MessageIndex": 1579,
      "PostDate": "21/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Mar 25, 2013 06:05PM FriendGwen wrote: I'm thankful for a snow day today since I've been feeling cruddy since Thursday's final chemo. DD1 came home from spring break in Europe last night. I was so grateful for the snow as her classes were cancelled enabling DH and I to visit with her all morning before she went back to her apartment. Now the quietness of the house is making the chemo-induced ringing in my ears really annoying. My fingernails are making typing a challenge. My taste buds are so whacko I can't enjoy much of anything. My nose is running! I'm dizzy! No energy!! Okay I'm done griping! Thank you ladies for indulging me. I called my sweet parents but didn't have the heart to whine too much.",
      "MessageIndex": 1599,
      "PostDate": "25/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 1, 2013 02:37PM FriendGwen wrote: We have all managed to get through much of our treatment and it's finally April! Started this process with the diagnosis in September. My mammogram was September 11th! Clearly that was poor scheduling! Nonetheless, I feel great relief in coming this far and am ready to get my strength back. Am planning to hit the gym this week and to get groovin' on the Mediterranean diet. Granted I still have lots of side effects but am hoping there won't be any new ones. My weight has fluctuated by about five pounds over the ten days since my final chemo and unfortunately the high number was this morning. Oh well, all the more motivation to get moving and eating right. Thanks all for discussing tamoxifen. I was thinking I would begin post radiation but I'll see what the MO says. I suppose there's no point in waiting unless it's just to give my body a break by dealing with rads on its own before jumping to the final treatment. Have a great April Fools Day ladies!",
      "MessageIndex": 1620,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Apr 6, 2013 07:34PM FriendGwen wrote: Julie - he's an idiot with zero people skills. There's a lot of words I'd like to use to describe him but I'll keep my potty mouth quiet. Grr. How he's gotten as far as has in life is beyond me. Maybe med schools should reevaluate their admissions and what they teach. There's way more to being a strong doctor than grades and internships.",
      "MessageIndex": 1654,
      "PostDate": "06/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 21, 2012 03:39PM FriendGwen wrote: I'm having Cytoxan and Taxotere.  I'll have six rounds every three weeks and then radiation, and then Taxoxifen. There was a smidgeon in my lymph node so that's why all the treatment. I had my surgery four weeks ago (same day you were diagnosed) and other than a little tightness I feel pretty much back to my old self. I had premanent implants, no tissue expanders. It makes sense that you are having a port. It seems like every day I'm given a new thing to decide about!",
      "MessageIndex": 3,
      "PostDate": "21/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 23, 2012 11:44PM FriendGwen wrote: Internutz1, thanks for posting such an encouraging post. I know we can all make ourselves crazy researching and listing all these possible side effects! I plan to be knowledgable and prepared but also optimistic and confident that this is a journey I will get through with grace! Back from a wonderful Thanksgiving with my family! Nothing like being around them to lift my spirits and feel energized and ready to get through this next challenge!",
      "MessageIndex": 12,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Nov 30, 2012 07:23PM FriendGwen wrote: I met with my plastic surgeon today and she said I have no restrictions on exercise! Hoping to keep it up through chemo. I do find the more I exercise (and that includes nice long walks) the better my chest feels six weeks post surgery. This week I haven't felt any discomfort at all! Last weekend before chemo! I intend to play hard! Have a great weekend ladies!",
      "MessageIndex": 100,
      "PostDate": "30/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 4, 2012 01:59AM FriendGwen wrote: The LGFB class was nice but it kinda left me down. It just got real. They brought out lots of knit hats that were made by a group at a local church. It was so sweet and I took two but it also weirded me out. I'm now on the receiving end of charity. Ugh. I don't like it! Then my daughter who's away at college posted a picture of the two of us on facebook. Her caption was \" my hero, my best friend, the most beautiful woman on earth\". As if that wasn't a enough of a tear jerker then I see all the people that liked it. I haven't been very vocal about all this but I could tell just how many people know. I just want to quietly get through this. But at the same time I really appreciate my friends that check on me. I don't know what I want! Yeah clearly it's first cycle chemo week!",
      "MessageIndex": 142,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 8, 2012 12:59PM FriendGwen wrote: Good morning ladies! Happy to report those four pounds of steroid weight have left! Gotta really watch salt during chemo. It's wig shopping day. I'm picking up my 20-year old daughter from her college apartment to come with me. I hope to make a fun day out of it with lunch and some shopping. I feel great so far but am expecting a possible crash later today. As long as I get a wig today my goal for the weekend will have been accomplished. Hope everyone is feeling well and cherished today!",
      "MessageIndex": 204,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Dec 27, 2014 08:59PM FriendGwen wrote: Hi ScarYola! I haven't checked this site in months but am feeling grateful celebrating two years since chemo began. It's becoming a blur and that's fine with me! Wishing all of you another wonderful, happy, and healthy new year! Blessings to all of you!",
      "MessageIndex": 1793,
      "PostDate": "27/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "FriendGwen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163492/profile",
      "Content": "Jan 4, 2015 06:19AM FriendGwen wrote: steiner18. Please fill us in on your lab reports. We are here foryou.",
      "MessageIndex": 1799,
      "PostDate": "04/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    }
  ]
}