{
  "AuthorID": "friscosmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93577/profile",
  "Posts": [
    {
      "AuthorID": "friscosmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93577/profile",
      "Content": "May 6, 2010 03:30PM friscosmom wrote: Not something you can take but something I found that helps with hot flashes at night is a Chillow.",
      "MessageIndex": 11,
      "PostDate": "06/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/752241",
      "Title": "Hot flash relief? RegulJ nursecal"
    },
    {
      "AuthorID": "friscosmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93577/profile",
      "Content": "Jan 25, 2010 02:32PM - edited Jan 25, 2010 02:34PM by friscosmom I had this exact type of biopsy. Thankfully, I didn't have time to think or worry about it too much, they ordered it the day I went in for my diagnostic mammo and ultra-sound. Mine was ultra-sound guided, meaning that a nurse had an image up for the Dr. to see to navigate the needle to the lump. I was laying down on my side (my lump was on the right breast at 9 o'clock so they had me over on my left side so he could get to it). They started by cleaning the area (cold!), then they numb the area and of course that stings some but not too bad and I'm a huge baby when it comes to that stuff! They put the needle in a little, inject some, got a bit further, inject some more, etc. I think there were about 4 or 5 insert/injects. Once that part was done I felt nothing other than some pressure as he took the sample then went back in to insert the clip. The clip was not a problem with scans, I had a breast MRI, CT and PET all after the clip was inserted. Best wishes and no worries, it's really not bad other then a little bit of sting from the numbing medication.",
      "MessageIndex": 1,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/747328",
      "Title": "?'s about biopsy redspark3 redspark3"
    },
    {
      "AuthorID": "friscosmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93577/profile",
      "Content": "Jul 1, 2010 07:43PM friscosmom wrote: I'll be joining you all for July rads. Had my simulation Wednesday and will start rads on the 19th; 35 treatments. Had lumpectomy in December, last chemo was two weeks ago. I was not given any creams or lotions; my rad oncologist said there's nothing that can prevent skin damage and they will give me ointments/lotions as needed if I have burning and that if I have real problems with my skin that she will do a \"break\" if necessary. I'm hoping that I can get through it without a break, seems it would be more effective.  All the best to those of you that will be starting next week.",
      "MessageIndex": 26,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "friscosmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93577/profile",
      "Content": "Jul 2, 2010 05:31PM friscosmom wrote: julieeee - hope you're healed up soon and good to have someone here that has experience with this from the other side of the steel doors. :)",
      "MessageIndex": 30,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "friscosmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93577/profile",
      "Content": "Dec 9, 2009 12:00AM - edited Dec 9, 2009 12:15AM by friscosmom Hi everyone, I'm new here, just diagnosed 11/5/09, had my lumpectomy yesterday and was disappointed to learn that the sentinal nodes came back positive; I guess we all pray for clear results. I won't know all the details on the rest of the lymph nodes until Thursday but I'm assuming based on the size of my mass, 1.8 cm and the sentinal results that I fit into this category. I've been reading some of the posts here, it's all so overwhelming, so much information. Helpful information but sometimes I feel like I'm learning a whole new language.",
      "MessageIndex": 222,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "friscosmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93577/profile",
      "Content": "Dec 9, 2009 01:25PM - edited Dec 9, 2009 01:36PM by friscosmom Hi AnnaM, Frisco is one of my horses (he's the one in my profile pic I just added).",
      "MessageIndex": 226,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "friscosmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93577/profile",
      "Content": "Dec 9, 2009 12:19AM friscosmom wrote: Thanks Lauren3, definately not a place anyone would ever choose to be but thankful to have found a group so helpful and supportive.",
      "MessageIndex": 224,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "friscosmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93577/profile",
      "Content": "Dec 10, 2009 09:25AM friscosmom wrote: Thank you and sorry to hear about your horses, we've been through that with a couple of ours. Sounds like your horses had a good life, they should be spoiled in the end. :) My horses have helped me through some tough times in the past and I know they'll help me get through this too. I know that sounds silly if you aren't a horse person but there is something very calming and peaceful about being around horses; not to mention that they depend on me and that will help to keep me going.",
      "MessageIndex": 228,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    }
  ]
}