{
  "AuthorID": "Fritzmylove",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
  "Posts": [
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Apr 14, 2019 08:44PM Fritzmylove wrote: I had a 7cm tumor and did Neoadjuvant chemo. Pathology after BMX showed no cancer left in the breast tissue. I’m not a long term survivor (yet!) but it is possible for chemo to totally obliterate even the large tumors.",
      "MessageIndex": 73,
      "PostDate": "14/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/845339",
      "Title": "Large tumour survivors LM070917 Mumoftwo416"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Apr 15, 2019 10:18AM Fritzmylove wrote: Could you get both oncologists’ opinions? Then if they recommend the same treatment plan, go with the one that’s closer.",
      "MessageIndex": 79,
      "PostDate": "15/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/845339",
      "Title": "Large tumour survivors LM070917 Mumoftwo416"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Nov 27, 2018 05:00PM Fritzmylove wrote: Redish/brownish discharge was what prompted me to have the imaging done that ultimately led to biopsy and cancer diagnosis. However, there are many other reasons why you may be experiencing nipple discharge. I would ask your doctor about it to be safe.",
      "MessageIndex": 1,
      "PostDate": "27/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868565",
      "Title": "Lump and nipple discharge Courtney2090 Courtney2090"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Nov 17, 2018 11:02AM Fritzmylove wrote: You are in the hardest part of this process. You know it’s cancer, but all the pieces haven’t been put together yet. I had to go through all kinds of tests before starting the treatment process. I asked for anti anxiety meds to help get me through the diagnosis process. Once all the tests were over and I had a plan, I was able to wrap my head around everything that happened. Huge hugs as you go though everything. These boards have been a big help, too.",
      "MessageIndex": 1,
      "PostDate": "17/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868400",
      "Title": "Anxioy and overwhelmed Love83 msphil"
    },
    {
      "AuthorID": "Fritzmylove",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Fritzmylove wrote: I’m 34 years old and yesterday went in for a mammogram and ultrasound after my right breast felt extra lumpy and I had some brown discharge. They immediately wanted to do a biopsy so now I’m waiting for the results. I’m new to all of this so I’m going to leave a bit of my ultrasound results below. I was given BIRAD of 5, so I’m expecting cancer, but what has me really worried is my lymph node and the word “metastatic” in my test results. Can anyone calm my nerves? I have 2 young children 3 and 5 and I am terrified about what this all could mean. In the right breast upper, inner quadrant, there are extensive pleomorphic microcalcifications which involve the breast from the subareolar region to the posterior depth over approximately 7 x 4.6 x 5 cm. The appearance is highly suspicious for malignancy and biopsy is recommended. In the left breast at approximately 11 o'clock, mid depth, there is a small group of heterogeneously coarse microcalcifications. Stereotactic biopsy (x1) is recommended. A few scattered punctate calcifications are seen in the left breast, medially. ULTRASOUND FINDINGS: Targeted right breast ultrasound was performed and gray scale/color flow images were reviewed. In the upper, inner quadrant of the right breast, in the region of palpable lump, there is heterogeneously echogenic breast tissue with scattered small cysts. Multiple clustered echogenic foci are seen in the region of the palpable lump around 2 o'clock consistent with suspicious microcalcifications seen in the mammogram. A slightly dilated duct with low level internal echoes is seen in the subareolar region. No definite suspicious mass is demonstrated. In the right axilla, there is a slightly enlarged lymph node with thickened cortex which measures 1.7 x 1.6 x 0.9 cm. The appearance is non specific however, metastatic involvement cannot be excluded. Ultrasound biopsy is recommended. CHEK2+ Dx 9/19/2018, IDC, Right, 6cm+, Stage IIIA, Grade 2, ER+/PR+, HER2- Chemotherapy 10/1/2018 TAC Surgery 2/20/2019 Lymph node removal: Right, Sentinel; Mastectomy: Right; Prophylactic mastectomy: Left; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Hormonal Therapy 3/4/2019 Femara (letrozole), Zoladex (goserelin) Radiation Therapy 4/22/2019 Whole-breast: Lymph nodes, Chest wall Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/867268",
      "Title": "Please Help Calm Me Down Fritzmylove DATNY"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Mar 1, 2019 03:35PM Fritzmylove wrote: All of your posts bring me so much hope. I just finished neoadjuvant chemo and had my BMX. My pathology showed 4/7 nodes still positive, even though my 6cm breast tumor and sentinel node were completely negative for cancer cells. Is there a chance i could be posting on this thread in the future?",
      "MessageIndex": 175,
      "PostDate": "01/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836950",
      "Title": "Stage III Cancer Survivors...15+ years and out weesa lexi4"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "May 16, 2019 09:34AM Fritzmylove wrote: Congrats Naomi! I really needed to see this today.",
      "MessageIndex": 194,
      "PostDate": "16/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/836950",
      "Title": "Stage III Cancer Survivors...15+ years and out weesa lexi4"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Sep 22, 2018 10:54PM Fritzmylove wrote: Hi all. I was diagnosed Wednesday, and am now waiting until Monday to see my BS for the first time. They found it in a lymph node that they biopsied, and it has thrown me into a panic. I was told it's pretty extensive in the breast, but still no mass is detected. What does that mean!? I've asked every medical professional that I've come into contact, and no one can tell me much. I'm freaking out that I've had this for a long time and that it's spread. Parts of my body I never noticed before have started to ache or tingle. The back of my head. My shoulder. My knee. Is this the cancer? Is it my brain freaking out? I have no desire to eat or drink. I'm panicked at the thought of leaving my 2 young children without a mother. How will my husband cope? I've noticed that I have ridges on my fingernails. Is this a sign that it's spread? I don't know how I'll make it until Monday, and then through the various tests I'll be put through to determine whether or not it's spread past the lymph node(s).",
      "MessageIndex": 335,
      "PostDate": "22/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/866087",
      "Title": "Anyone want to sit and wait with me? ColleenS80 Amica"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Jan 27, 2019 04:29PM Fritzmylove wrote: I just finished chemo 2 weeks ago, so I'm still in the thick of it, but some examples of my chemo brain: I couldn't think of the word \"iguana\" yesterday when my son was calling a picture of one an \"iguanodon.\" I had to ask my husband \"what's the big lizard called with the spikes on its back.\" I felt like an idiot. Playing a game of cards is frustrating for everyone involved. I can't keep track of who's turn it is, what trump was called, what card was lead, etc. I played a game of euchre over the holidays with my sister, who went through chemo for thyroid cancer 13 years ago... our partners were about to quit because between the two of us, we couldn't keep track of anything which made the game drag on forever. I have to concentrate intently to conversations, and even then, I have a hard time following along or coming up with meaningful responses. I'm an introvert by nature, so chemo brain makes it even more difficult for me to socialize.",
      "MessageIndex": 8,
      "PostDate": "27/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869310",
      "Title": "Chemo Brain nanette7fl Sassa"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Mar 29, 2019 06:31PM Fritzmylove wrote: My breast tumor was completely dead after chemo, but still had positive nodes. I was told I’ll still get chest wall and axilla rads for 5-7 weeks starting this April. BTW I want an MO as positive as yours! Saying you’re cancer free and going for a cure!! Amazing! Mine doesn’t seem to want to use those words, yet tells me to be optimistic.",
      "MessageIndex": 3,
      "PostDate": "29/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/870709",
      "Title": "How long is a Course of radiation for axillary nodes? B-A-P RebzAmy"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Mar 15, 2019 10:40PM Fritzmylove wrote: I have the CHEK2 mutation and elected to do a bilateral mastectomy because of the risk of a second breast cancer diagnosis. I don’t think the mutation has any effect on whether a cancer is more or less likely to spread. The mutation creates the cancer cells. It has no effect on how the cells then grow and spread. You honestly don’t need all that much after surgery. A wedge pillow is great to have, and they sell them at Walmart for like $20. You don’t need a shirt with drain pockets. Most of the time I had my drains safety pinned to my surgical bra, and then put socks over the bulbs so the plastic didn’t touch my skin. If you feel like you need something else, go to Home Depot and get a cheap canvas tool belt that has 2 pockets you can wear around your waist. All those things you see on Etsy for after surgery are pretty, but unnecessary. As long as you have shirts that button or zip in front, you should be fine for the 2 weeks you’ll have drains and not able to move much. Lean on the support you do have. Try to focus on yourself during this time, as difficult as it may be. You’re in the hardest time of a cancer diagnosis. One step at a time. ((Hugs))",
      "MessageIndex": 1,
      "PostDate": "15/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/870395",
      "Title": "Chek2 Gene Mutation donnarn94 Denise-G"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Oct 23, 2018 06:23AM Fritzmylove wrote: So glad to hear you have an amazing set of doctors that were instrumental in you catching this so early! Good luck with surgery, and here’s to many more cancer free birthdays for you",
      "MessageIndex": 1,
      "PostDate": "23/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867934",
      "Title": "Path report received today BluGene Moderators"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Apr 21, 2019 09:16PM Fritzmylove wrote:",
      "MessageIndex": 1,
      "PostDate": "21/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/871142",
      "Title": "How do you Wash Hair after a Double Mastectomy? Christene502 Christene502"
    },
    {
      "AuthorID": "Fritzmylove…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/280056/profile",
      "Content": "Mar 14, 2019 03:48PM Fritzmylove wrote: I have a weighted blanket, and used it after BMX once I was home. Be careful though because it will be difficult to pull/ move because of the surgery and restrictions you have the first few weeks. What I found most helpful to sleep on my back was a wedge pillow, neck pillow, and about 5 other pillows behind and around me. You’ll figure out what’s most comfortable. Good luck!!",
      "MessageIndex": 1,
      "PostDate": "14/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/870383",
      "Title": "Weighted Blanket? Motheroftwo36 Motheroftwo36"
    }
  ]
}