{
  "AuthorID": "frozentoes",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
  "Posts": [
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 14, 2017 10:35PM frozentoes wrote: Clinical trials are not the only step in the research and development of treatments. They are a critical piece but not the only piece. Seeing progress and success are not guaranteed and this makes it very difficult and disheartening. Especially when you're loved ones or you are participants or hopeful recipients of the results. I believe that by not trying to recruit participants for clinical trials, physicians are creating a disservice to their current and future patients. Hopefully people can be exposed to these opportunities through social and support networks. I was lucky enough to chose my care to be done through a research medical facility so opportunities for clinical trials were more available. But I know that others are not so I will continue to help try to promote threads like this and educate people on their opportunities.",
      "MessageIndex": 25,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/838839",
      "Title": "No enrollees in clinical trials, no cure anytime soon TectonicShift PreludeSing"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 15, 2017 10:19AM - edited Nov 15, 2017 10:20AM by frozentoes Tallantire, welcome! Just wanted to wish you luck with your treatment today. These choices we make are not the easiest but it's best to take your time and really think them out. And good luck with the cold cap. Let us know how it turns out. Drink lots of water!",
      "MessageIndex": 150,
      "PostDate": "15/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Feb 13, 2018 08:48PM frozentoes wrote: Cancer fatigue is real. There are so many things contributing to fatigue when you have cancer. The cancer, treatments (surgery, chemo, and rads! Not to mention meds), side effects, mental health, eating, and many other things. Chemo and radiation can be very hard on a person so try not to expect to bounce back right away. It will take time to return to normal. Some people are lucky enough to have experienced just a little bit of fatigue but I’m not sure if that’s the “norm”. Be patient with yourselves. It’s ok to take time to continue resting. This fight is a marathon, not a sprint. Today was day 1 of AC. So far it’s been pretty uneventful. I had a short nap before dinner but I am feeling fine. Although, I am on a high dose of prednisone so that may have something to do with it. I’ve also got a new arm buddy with disco lights. I say disco lights because I want it to be cooler than it is so I’ll pretend. :) The nurse that put it on said, “It’ll just be a small poke”. My shouting “OH DAMN!” when it went off may demonstrate my disagreement of her assessment. Does it hurt when it distributes the medicine? She said 27 hours after it was stuck to me so I’ll find out tomorrow. I’ll make sure I’m not in the middle of Target or something in case it takes me by surprise. Someone earlier mentioned frustration around food. I could not agree more! So I asked for an nutritionist with oncology experience. Luckily, my clinic has one. Pretty much the jist of what I learned is that I can still eat soy products but minimally, stick to lean proteins if I can, there is no need to eliminate citrus with the chemo I’m getting, and to generally try to eat a balanced diet. As much as I’d love a Bloody Mary right now, I’ll just stick to water. Maybe in a couple of months....",
      "MessageIndex": 1325,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 8, 2017 06:03PM frozentoes wrote: The port has been installed! I feel sore and tired but that's normal. The doc ended up putting it in on the left since the cancer is in my right breast and there is a supraclaviclur lymph node involved. Thought it might get in the way of future treatments if it was put in on the right. It's just a bit weird since I had been getting myself used to the idea of it being on the right. Next step is chemo. T-minus 6 days!",
      "MessageIndex": 66,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 16, 2017 07:28PM frozentoes wrote: Today was a bit much emotionally. The nurse had warned me that the steroids might make me more emotional than normal. Or I could just be tired. Who knows. Whatever the cause the tears seemed to come a lot easier than normal today. I went to work and everyone was very supportive but they all wanted to know how 'it' went. When I picked up my daughter from school her first words were do you still have hair. But I did get hugs from a couple of her fellow girl scouts and that started the water works again. rljess - I would be a bit put off if my oncologist didn't answer my questions. Do you have any opportunity to find a different one?",
      "MessageIndex": 171,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 18, 2017 06:01AM frozentoes wrote: IntegraGirl, how did you hear about Valter Longo protocols? Was that recommended by your MO? I hadn't heard of this before and started googling and some of the research sounds really interesting. I'm really intrigued by the potential to stimulate the bodies immune system. Did you see any effects during chemo, beside minimize SEs (which sounds great btw)",
      "MessageIndex": 187,
      "PostDate": "18/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 24, 2017 11:13PM frozentoes wrote: Meowmmy65 - I like the scarf too but I really love your glasses! Super cute. Blair - I think you're right. I'll have to save that for my next insomnia fueled Amazon shopping spree. I wonder if they even make those guys anymore? What is the EMLA cream? Is that something that has to be prescribed or can I find it at a pharmacy? The first time they accessed my port it stung but I'm guessing it was because it was still pretty swollen and new. The second infusion didn't hurt at all. Barely a pinch. I'm planning on giving it one more go and if it doesn't hurt again, I'm not going to bother with finding a cream but if it's like with IVs and dependent on the nurse, then I'm going to need some.",
      "MessageIndex": 244,
      "PostDate": "24/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 28, 2017 07:53PM frozentoes wrote: Hi all, I am really happy to read that your treatments are going well. Today was #3! No Benadryl or steroids and lucky for me no reactions! So it sounds like I can continue my treatments with only the Pepcid as premed. So here’s another example of how everyone reacts differently to chemo. After the 2nd treatment, I must have been pretty good at avoiding the SE truck because it finally caught up with me yesterday. I got home early from work exhausted with muscle and joint aches. I hadn’t been able to eat anything because I totally lost my appetite. As my friend so succinctly described it, I felt like a wrung out wash cloth. At my appts this morning for treatment #3, my blood work came back with low white blood cells and low proteins. The doc said to go ahead with treatment but they want to make sure I’m eating a lot more protein. Any suggestions on how to eat more protein?",
      "MessageIndex": 296,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Dec 6, 2017 06:15PM - edited Dec 6, 2017 06:20PM by frozentoes Hope99, remember to breathe. :) You sound a lot like me. I was (still am 90% of the time) really anxious and worried. But worry is not going to help. Focus on the things that can help like taking care of yourself and preparing to get through this! You will be ok. Your cancer seems very similar to mine. When it was first found, the doctor said it was 2.5cm and there was a suspected lymph node. So they staged me at IIA. After a biopsy confirmed cancer in the lymph node and an ultrasound found a DCIS buddy next to the original mass, they sent me off to get a PET/CT. That ended up showing about 8 more lymph nodes including in the breastbone area and clavicle area so I was down graded to Stage IIIB. I told my oncologist I wasn't sure I wanted to see her anymore if she kept giving me bad news. This may sound scary but the good news is that the medical staff I am working with are doing their best to fully understand the full scope of my cancer so that they can best attack it. For me, the treatment is chemo first, then surgery, followed by radiation. The idea is that they want reduce or eliminate the cancer in the lymph nodes and the tumor first. So far, after 3 treatments, the tumor and original lymph node have shown reduction! Although, your chemo drugs may be different from mine, it sounds like they might be doing something similar. And don't be afraid to ask your doc questions. If their answers don't make sense, tell them to try again. You got this! ",
      "MessageIndex": 447,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Dec 8, 2017 10:11PM frozentoes wrote: Last night I pulled the trigger on the clippers. Actually my husband did. :) I just couldn't take the intense shedding anymore. I was finding hair everywhere including my food and that was the last straw. So here I am in my hairless glory. A couple of things to note: I was happy to discover that my head shape is pretty normal. A little disappointed that there was no hidden treasure map hidden under my hair, but oh well. Hats and scarves stick to my head like Velcro now. It's a bit strange but it's about 10-20 degrees above zero here so I am covering up because it's REALLY cold without hair. And my hair stubble makes sounds on the pillow when I try to sleep. That was totally unexpected. ",
      "MessageIndex": 505,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Dec 14, 2017 12:39AM frozentoes wrote: 19501952 - The only premeds I get during my weekly taxol treatments now is Pepcid. It helps with reactions but also with reflux. Heartburn and reflux can be pretty common for different chemos. My MO told me that it’s ok to take Tums or Zantac or Pepcid if I continue to have issues during the week. So far I’ve been lucky to avoid nausea but the heartburn and reflux has got me a few times. Toni - Welcome to the group and I’m sorry to hear this isn’t your first fight. I do not have experience with TC or AC but I can tell you that everyone’s experience seems to be a bit different. I’ve heard from some people that Taxol was a walk in the park compared to AC while others had the complete opposite experience. The only thing certain is that the unknown and anticipation sucks. BUT you’re in good company. :) These ladies will share some good advice and lend an ear when you need them. I had a funny conversation with a couple of 6 year olds today. I picked my daughter up from school and she came running up with a couple of her friends. One of them is from her Girl Scout troop so I know her pretty well and the other is a little boy from her class. They both asked is they could see my bald head. I said sure and took off my hat. The little boy’s eyes were huge and he asked me it my daughter really shaved my head. When I said that yes she had helped, they both gasped and said wow that’s so cool! Then they ran off like it was nothing. But my kid was so proud that her friends thought it was cool that she got to help shave her mom’s head.",
      "MessageIndex": 624,
      "PostDate": "14/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Jan 1, 2018 12:10AM frozentoes wrote: Happy New Year, everyone! I hope 2018 is an amazing year for all! ",
      "MessageIndex": 878,
      "PostDate": "01/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Jan 5, 2018 11:36PM frozentoes wrote: klvans, make sure you talk to your radiation specialists about your concern with the tattoo. There are a lot of places that will use alternative methods still. Some people choose not to because tattoos are against their religion. I am also a bit nervous about radiation. More because my genetic testing came back with a variation of unknown significance on the ATM gene and the ATM is known to have problems with radiation. So far, no one seems concerned because it’s a variation of unknown significance but to me that screams unknown risk. But I also have these pesky supraclavical lymph node and intramammary lymph node that need fried because they can’t be surgically removed. So, a bit of a catch 22. I am a bit jealous of everyone that has their treatments spaced out over 2-3 weeks. This weekly taxol is really starting to beat me up. I’m very happy it’s nearing the end (8 of 12 done!) but then I start the AC portion. I’m hoping having a week between infusions will give me some time to feel normal again. I’ve also decided to take a leave from work. I was going to try and work through the whole process but I just feel like I’m doing a disservice to my job and myself. Luckily my employer is extremely supportive which oddly enough feeds into my guilt. But it’s the right move for me. And as if I’m not just a bucket of sunshine already, I recently found out that my sister, who got her mammogram because of my diagnosis, has found out that she has breast cancer too. At first they thought it was just atypical ductal hyperplasia but after the excision and pathology they found DCIS. They believe they got it all so I am very hopeful that she will not have to experience the same thing I am. I am happy that she caught it as early as she did but sad that she has to deal with this at all. So far, my other 3 sisters have had clear results. Once I’m cleared by my doctor, I am so taking a long vacation. :)",
      "MessageIndex": 938,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 21, 2017 10:52AM frozentoes wrote: I'm getting treatment number 2 as I type and so far so good. :D According to my doc the \"truck\" that got me last week was probably the steroids more than anything. I'm hoping that's the case as they halved the dose today. I can sympathize with you ladies on the cost front. The copays really add up. I read that some of you live in smaller towns or rural areas. Are there social services in your area? There are some groups like the American Cancer Society that you can contact online or over the phone that can help you find resources to decrease costs. I'll try to find the link to the group I found but there are sending me a free scarf. It's not much but it's something. :) Hope everyone has a great day!",
      "MessageIndex": 199,
      "PostDate": "21/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 24, 2017 02:06AM frozentoes wrote: Hello ladies! I hope everyone has had a good holiday and that the rest of the week/weekend turns out SE free for everyone. Blair, you're definitely not the alone in being very nervous. I think this entire club we're in is pretty good about being nervous for so many reasons. :) I do not want to take steroids any more. I think I can weather the chemo stuff but I am really tired of the side effects from the steroids from the premeds. They make me so irritable and agitated. Every little thing makes me want to either crawl back under the covers or start yelling. I'm finally starting to feel like normal and this week was half the dose of last week. I think the only thing that has really helped me the past couple of days is getting out and walking. It even got me through dinner with my in laws. Usually wine does that but that's off the menu lately so it's another walk for momma! ",
      "MessageIndex": 234,
      "PostDate": "24/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Dec 18, 2017 06:26PM - edited Dec 18, 2017 06:27PM by frozentoes Hope99, I understand that you are feeling scared. We all are or have or will be. It is just part of having cancer. It sucks and it's not fair and there are no clear answers because every single case is different, no matter how many doctors think they've seen 'your' cancer before. Node involvement is serious because it might lead to further cancer other places. THAT DOES NOT MEAN IT WILL. You can have anywhere from 15-30 lymph nodes on each side of your chest (it varies per person). There are different areas in the chest that the lymph nodes are. Chemotherapy is used for 3 main reasons: 1-reduce the size of the tumor in the breast, 2-reduce or eliminate cancer in lymph nodes, 3-eliminate rogue cancer cells in the body (as a precaution). Also, I am confused on why that study makes you sad. They stated that the sample size was small (94 ppl) and that they could not prove causality. What was not stated but I choose to focus on is that those 94 women, who after 6-7 years had no reoccurrence, may or may not have other health problems when they're older, but they will have the opportunity to get older. I know this won't work for everyone but try to remember that you are doing this because you want to live. Find that reason for living and focus on it! Don't let your worries steal the joy you can get from today. We are all paying the price for more tomorrows, be it wrestling with bowel issues or hair loss or muscle pains or worse. But there has got to be something that helps get you through it. Go ahead and learn about how to best fight your disease but don't let it consume you. Look for the stories of people who have struggled and over come their battles. Look for stories of people who help others. We will all have anger and sadness and confusion and this natural! Just don't let that be all. I believe that we will get through this. ",
      "MessageIndex": 679,
      "PostDate": "18/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Dec 18, 2017 07:25PM - edited Dec 18, 2017 07:26PM by frozentoes Mom4gma3 - My care team checks for swollen legs/ankles every week. This can be a sign of allergic reaction or other complications. I would call your on call and ask them about it. It may be nothing but it's worth a call Or listen to nonahope because I can be a bit reactionary when it comes to swelling. :D.",
      "MessageIndex": 684,
      "PostDate": "18/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Dec 29, 2017 09:31PM - edited Dec 29, 2017 09:32PM by frozentoes Merry belated Christmas, ladies! It sounds like everyone is marching through the season as well as could be expected. I have to say, I loved the pictures of the red paw booties. I am so very glad I do not have to bring my cats outside. The temps have been hovering around 0 all week and I see people walking their dogs and I both question their sanity and commend their dedication to their fur babies. This was week 7 of 12 for Taxol. Aside from the crazy wait at the infusion center (almost 2 hour delay!) due to the holiday catch up, I've had almost no SEs. Or, I'm just getting so used to them that they feel like nothing. :D The big D was lurking around day 1 and 2 but I found my Imodium pretty quick and fought it off. I also had so much energy on day 2 that I dropped the kid off at her grandparents and I spent the day shopping for me! Today wasn't as energy filled but still good. After last week I was seriously dreading treatment but #7 has reminded me that it isn't always bad. Re: neuropathy - I have been taking B6 and B12 since just before week 1. I was already low on B12 and the doc suggested to get in the habit. I didn't start to feel symptoms until late into week 5. It was just off and on in a couple of finger tips and toes. Kind of numbness, more like feeling cold and not being able to warm up. It seems to affect my pinkies (both hands and feet) first and then comes in. So, I'm wondering if part of it is circulation. Luckily for me it seems to clear up and hasn't stuck around. I've also been told that it doesn't have to be just numbness or pins and needles, that neuropathy in feet can also feel like you have something stuck in your sock and you've been walking around on it but there isn't anything there. So, I have a question about the emotional side of chemo. I know we talk a lot about the physical side effects but there seem to be a lot of mental side effects too. How are you dealing with the emotional side of things? The stress? For me, I feel so damn lonely all the time. I have my husband and daughter but I don't see friends often. I'm afraid of becoming a burden to my family so I feel like I'm always putting on a strong front and it's exhausting. Everyone I know is very supportive and are always offering to help but I just can't seem to make myself ask. Tonight a friend brought over dinner for me and the family and it was so sweet and I am very, VERY grateful. But I am also feeling a bit saddened that I'm in this position. I've always been the caretaker. The fixer. Now, I need fixed and I hate it. If anything, this is a lesson in humility. Anyway, what's the hardest non-physical SE you've dealt with?",
      "MessageIndex": 849,
      "PostDate": "29/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Jan 3, 2018 12:45PM frozentoes wrote: Well, rljess, you have me beat on temperatures! It’s a whooping 3 above here and I’m off to infusion #8. Ugh. Is there such a thing as infusion anxiety? I’ll be fine, I know but dangit I really don’t want to go. Stay warm, ladies! I’ll check in later.",
      "MessageIndex": 905,
      "PostDate": "03/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Feb 10, 2018 05:17PM frozentoes wrote: Ok, ladies, I am all done with my 12 weekly Taxols! Woo hoo! Next Tuesday I start the dose dense AC for 4 treatments. Those who’ve done AC, what was your experience? Help me prepare",
      "MessageIndex": 1307,
      "PostDate": "10/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Mar 7, 2018 01:53PM frozentoes wrote: Yay, Kat! Hope you recover quickly. Sending healing thoughts your way",
      "MessageIndex": 1427,
      "PostDate": "07/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 13, 2017 12:18AM frozentoes wrote: Stage2ire, your little boy sounds like a sweetheart. And I'm sorry that you had to be apart from your daughter for so long. I am hoping that my daughter stays healthy during this. She's my little shadow and I'd be lost without her. Though, I know we'd do whatever it takes for all of us to stay and get healthy. It's heartening in a way to know that I'm not the only one having late night crying sessions. I used to wake up in the middle of the night to pee. Now I throw in some tears for good measure. :)",
      "MessageIndex": 123,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 30, 2017 11:55PM frozentoes wrote: Today was better than yesterday. I did get some good news. Since I’m involved in a clinical trial, I get additional scans along with the treatments and they noticed a slight reduction in the size of my tumor already. So, it’s responding to the chemo treatments! That alone makes this weeks worth of side effects totally worth it. There’s still 9 more Taxol and 4 DD AC to go, but hey, piece of cake, right? :) I just have to keep the goal in mind. Someone had aske when others had started taking their nausea meds, I didn’t take anything until this week (treatment #3). I’m not sure if I’m just lucky or if it finally caught up to me. Now, I’ve taken the compazine and ativan. The ativan has been very helpful with getting to sleep but not making me feel like I can’t wake up. With a little kid, I worry about how she’d react if she couldn’t easily wake me up. Today I was well enough to go to work. One of my coworkers came up and reaches toward my (very short) hair and say, “Oh, are you changing the color again?” I just looked at her and said, “It’s called a bald spot. It’s falling out.” I would have felt bad if it hadn’t been someone who I hadn’t had pretty in depth conversations with in the past. Maybe I should just start wearing a scarf now",
      "MessageIndex": 340,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Dec 9, 2017 04:47PM frozentoes wrote: nonahope, I would guess it’s the Taxol too. It’s known to effect the liver pretty radically in some people. I’m going to keep you in my thoughts until your US though! Orangedaisy, you are handling your rash much better than I would have. Seriously, this is a case where I would have totally not followed any advice I would have given to others. Good on you for keeping a rational head! :D I am hoping it clears up quickly. Blair2, hopefully, your hair will stick around for a long time! I have always had really fine hair and i thought it was pretty thin to begin with but the lady that used to dye my hair always said I had a LOT of it, it was just fine. I didn’t believe her until it started coming out. It really shed for a while but then i started getting some bald spots too. Oh well. Let’s just hope it comes back in some form (hopefully on top of the head and not the chin). As for your back, it could be from your fall. Some injuries take a while to manifest. Or it may be totally unrelated. Have you had back issues in the past? I’ve had a bad back for many years and pains can be triggered from sleeping wrong to picking up something the wrong way. Just be gentle and treat yourself to a day or two of rest. I once sneezed and threw my back out. Backs can be fickle. And welcome to the new ladies. This is a pretty great place for advice.",
      "MessageIndex": 531,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Dec 13, 2017 12:44AM frozentoes wrote: Oh, I love all the pictures! Keep them coming! Kiddos and pets are a great distraction. :D I think I jinxed myself today. I went in for treatment #5 and told the PA how great of a week I had. The only SE was minor fatigue. Even my bowels had seemed to sort them selves out for a while. Even my WBC was up! So I had treatment, chilled out watching some Dr Who, went home and napped. Then woke up to an itchy rash on my arms and and the big D was back. Ugh. Every week is different. On a brighter note, I’m almost half way through the Taxol phase. Yay! S",
      "MessageIndex": 601,
      "PostDate": "13/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Feb 17, 2018 04:59PM frozentoes wrote: AC started this week and so far so good. A bit fatigued but it’s offset by the high dose of steroids I’ve got for other things. So far, if I keep up on my meds, there is only mild nausea and no other SEs yet. Oh, except irritable bladder. If there isn’t a bathroom near by when I feel a slight urge, then I am in BIG trouble. I’m really hoping that isn’t the norm. I may have to get some depends. I am ravenous. Steroids always make me hungry but my gosh this is almost like i’m insatible. So I decided to try roasting Brussels sprouts and cauliflower. It turned out well but I’ve eaten all of it already. I suppose if there’s veggies to graze on vs Girl Scout cookies, I should go veggies. And I’m really bored. I feel like I’ve read the whole internet a couple of times over. I’m too nervous to go out to stores because of the flu. It’s freezing outside. I really wish I had a bungalow on a beach somewhere.",
      "MessageIndex": 1347,
      "PostDate": "17/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Feb 20, 2018 04:39PM frozentoes wrote: I’ve set up my laptop about 20 ft from my bathroom so I can make it in time. I’m at about once every 1-2 hour frequency right now. Part of it is trying to stay hydrated and the other is the bladder irritation from chemo. My bladder was never the same after pregnancy but at least there was still a warning or time before bladderspolotion. I’m happy to report that my liver functions have been within normal for yet another week! Yay, liver, I’m proud of you! I was going to go into the office tomorrow because I need some adult interaction. I love my 7yr old but I want to talk about something besides Roblox or YouTube. But two more people came down with the flu this week so no office trip for me. I just don’t understand why people go in when they don’t feel well. My office has a phenominal sick leave/PTO package and we can easily work from home at ANY time. It’s such a bad work habit to make yourself go in when you don’t have to. I really wish it was easier to change habits. So, quick question for those who’ve had surgery already. Have you had problems with lymphedema? I am really nervous about it. Since I’ve had a lot of lymph node involvement, I’m pretty sure they’re going to take all of them. Any advice",
      "MessageIndex": 1363,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 4, 2017 01:36PM frozentoes wrote: Hello. In four days, I am getting a port and on the 14th I will get the first of 12 weekly Taxol treatments. Following that will be 4 cycles of AC every two weeks. I am grateful to have found these forums. Reading about the experiences of others and hearing their advice has been very helpful. I know I will be reading (and hopefully participating) a lot as I continue through this fight. I feel like I am on a constant roller coaster of emotions. I'm trying very hard to keep my composure for my family but getting chemo scares me. Rationally, I know this is the right step for me. No matter how much I educate myself, I can't seem to make self less scared of the possible side effects. It's the unknown that scares me the most. For now, I'm off to get a hair cut! At least I can control that for now.",
      "MessageIndex": 25,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 5, 2017 09:57PM frozentoes wrote: rljess, MSP is the place to be! Until it's 20 below. :) I love it here. To answer your question, no, I haven't had surgery yet. We're going to do chemo first to try and shrink the primary tumor and it's little buddy. Hopefully it'll decrease the lymph node involvement too. The docs also suggested waiting for the genetic testing to come back before deciding on the surgery options. Getting my hair cut short wasn't too bad. I've had pixie cuts in the past so it's not new just not what I would have chosen if the circumstances were different. My 6yo requested that I keep a ponytail for her to keep so I did. I'm trying to find ways to help her cope with these changes without scaring her. We went shopping for hats today and you'd think in Minnesota (land of ice and snow) that there would be plenty of soft, scrunchy beanies but everything I found made me feel like I was either getting ready to go snowboarding or has a big fuzz ball on top. Here I am getting ready to kick some cancer butt and I'm worried about how a hat makes me look? /sigh I am trying to figure out how to get 20-30 minutes of walking in per day. Around here the temps are going to be ranging in the 20-30s, 40s if we're lucky! I have a gym membership but I'm a bit nervous of germs. Should I just arm myself with Lysol and hit the treadmills",
      "MessageIndex": 41,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 12, 2017 10:58PM frozentoes wrote: I'm starting chemo on the 14th as well. Is there anyone here who hasn't had surgery yet? We're going the chemo route first then surgery. I am also stage 3b with a lot of node involvement too and that is scaring the day lights out of me. I'm starting with 12 weeks of Taxol followed by 4 biweekly AC treatments. When I was first diagnosed it was staged at 2 but after the PET/CT and MRI and everything else, the pesky lymph nodes keep lighting up. So, now I'm up to stage 3 and I'm hoping we can squash it here. I just turned 40 and I have a 6 year old. I'm not ready to give up. There's way too much left to do. How are you ladies talking to your kids about this? We've been pretty open with my daughter and she's taken it well. I've been encouraging her to ask lots of questions and talk about it. I am trying to keep her from being scared but I know that she senses my fear. I also lead her girl scout troop and we just told all of them about it today. It was such an interesting experience. I love the honesty of kids and the simplicity in how they see things. It's refreshing compared to the reactions I get when I tell adults about my cancer. ",
      "MessageIndex": 119,
      "PostDate": "12/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 15, 2017 01:03AM frozentoes wrote: Good evening, fellow fighters! Day one went really well. I am totally in love with my care team. I don't think I'll have the same nurse for all of my infusions but if she's any indicator of the others, I'm in great hands. Using the port today for the first time was interesting. Once they were able to successfully access it, the whole process was super easy. The original nurse had a hard time finding the access point because there was still some swelling so it wasn't painless. Next time, I can use lidocaine to numb the area first. Which I will definitely be doing! rljess - I'm sorry your port placement did not go smoothly. When they were placing mine I could feel everything but the numbing agents they used kept the pain away. It wasn't comfortable but not painful. I told the surgeon that he might be a good surgeon but he was an awful masseuse. I used an ice pack off and on for about 4 days for the swelling. It helps with the pain too. Just be sure not to lift or push anything heavy. That includes the cart at Target! (I made that mistake) My port was placed Wednesday and by Monday I was feeling almost back to normal. Just like all of this, it takes time. I'm glad that my treatments are starting off with Taxol. It sounds like the AC side of things are heavier with SEs. At least I can pretend to ease myself into this. The premeds they gave me before the Taxol were benadryl, prednisone, compazine (i think, for nausea?), and pepcid. So, the benadryl ended up knocking me out for the actual Taxol drip. The grogginess lasted for quite a while. The nurse said once that wore off the prednisone could make me feel amped up a bit and so far that's true. So, sleeping tonight might be delayed. One thing that took me by surprise is that my sense of smell became super sensitive. I'm not sure if it's due to the benadryl and prednisone clearing up some sinus inflammation or the taxol. When I woke up from the benadryl cloud all I could smell was ramen soup and it was not pleasant. No one around me could smell it but the nurse went looking around the floor and found that someone on the other side had made some for lunch. Luckily, it didn't trigger any nausea, just an aversion to eating ramen anytime soon. I think my nutritionist wouldn't be too upset about that. :) Tomorrow is probably going to be when I feel lousy but that's ok. At least today was good! Also a note for any ladies with ports headed to their first treatments, be sure to wear low cut or v-neck shirts. It's just easier for the nurses to access your port.",
      "MessageIndex": 147,
      "PostDate": "15/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Nov 17, 2017 06:07PM frozentoes wrote: This morning I woke up my daughter singing \"I got this feeling inside my bones, it goes electric, wavey when I turn it on\" and telling her it was going to be a fantabulous day because by gosh we both needed a good day. And true to 6 year old form, she just wanted to go back to sleep but no, this time I insisted she get up and sing with me. By the time I dropped her off at school, she felt good, I felt good and I knew today would be ok. I only had a couple of moments at work when I felt like I wanted to pass out under my desk but luckily a couple of coworkers took me out for a walk and got my blood moving. I keep pounding the water and I hope that helps keep me hydrated because that feels like it's going to become a real challenge. Between the dry winter and chemo, I feel like a raisin. Other than that things are still pretty good. Hopefully week 2 goes as smooth. And to top off a good day, I got my genetic testing results and they found no genetic variations! This is such good news for me and my family. I am very relieved. This may also mean that my surgical options might be different too. Lastly, the kid got a golden LOL doll today so it really was a fantabulous day after all!",
      "MessageIndex": 183,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Dec 21, 2017 02:53PM frozentoes wrote: Infusion #6 was yesterday. Pretty much went home and slept the rest of the day and night. When I was awake, it was like I had the flu with muscle aches, joint pains, and chills. Even a fever that got to 100.4. But took Tylenol and went back to bed. Only to wake up to my 6 year old complaining of a stomach ache and then vomiting most of the night. At least it’s in the past now. Luckily today’s a little better. The kid is definitely on the mend. I am at least awake without flu like symptoms. Just trying to fight off the big D. So, we’re both eating the brat diet today. Husband is complaining of feeling fatigued and I’m having a very hard time being sympathetic. This taxol rash has moved from my arms to my stomach and head. I am not happy about that. I’m already bald, why do I have to have a rash now? Ugh, I am having a very hard time trying to be positive. At least Christmas is just before my next infusion so I know I’ll be feeling better for that. Maybe I’ll get the presents wrapped in time! Blair - i’m sorry that your back pains are still plaguing you. I really hope they can come up with something to help. Nonahope- best of luck with #4! Re: food tastes - i’m not sure if it’s the chemo effects or the congestion but today is the first time I started having problems tasting food. I was eating bananas and peanut butter and it was like eating white bread. Just no taste. I was/am disappointed. I’m hoping this clears up soon. Re: humor - I am a firm believer in laughing over crying. I feel like crying causes more exhaustion and laughing is cathartic and healing. It may not always feel appropriate but most times it’s needed. Maybe that’s just my twisted sense of humor. Here is a comic I found that a man drew about his experience with colon cancer. There are a lot of parallels but I love how he presents his experiences. Not for the faint of heart or for those who don’t like things above PG13. You’ve been warned. https://cancerowl.com/my-cancer-story/ ",
      "MessageIndex": 723,
      "PostDate": "21/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Dec 22, 2017 01:20PM frozentoes wrote: nonahope - Yay! So happy to hear that the liver was just acting up. Silly organs. :) rljes - not sure about Netflix but amazon prime has the marvelous mrs maisel which looks really good, although i’ve only seen the first episode. And if you were in MSP, this is the time of year you’d need that coat. Christmas Day’s high will be 3 above zero and low is expected to be -10. Today on my way home from work, I had to take off my beanie and put the windows down because I was having a hot flash that seemed to be centered on my poor bald, rashy head. Good thing I’ve got heated seats so at least my butt could stay warm. Oh, and it’s only 23 F out. But it felt great on the noggin! Ok, time to pound some coffee and make a last ditch effort to Christmas shop while I have a burst of energy today. Wish me luck! And I’m really glad that everyone seems to be weathering these rounds pretty well. Hopefully the holidays will give everyone a bit of a break. :).",
      "MessageIndex": 740,
      "PostDate": "22/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "frozentoes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261973/profile",
      "Content": "Jan 28, 2018 12:57PM frozentoes wrote: Kat, I’m not sure if this gif will work but it’s what my sisters and I send to each other when we’re feeling down and can’t be there to hug each other. I’m with you on the grieving of my past normal. I want it back so bad and it hurts knowing that it’s not possible. Eventually I will embrace my new normal and get to the point that line between fades but right now it’s still fresh. But, as they say, one day at a time. :) Hope99, I have been very lucky that I have had the pleasure of meeting and knowing a number of women that had BC and are surviving for a number of years. My brother in law’s step mother is going on 25 years with no reoccurrence, a coworker was diagnosed when she was 39 and is now 17 years without reoccurrence, 3 friends from a former job are all survivors of 5, 7, and 10 years, a lady who works on the same floor I do was diagnosed and treated 12 years ago and she is still doing fine, my sister’s day care provider has been stage 4 for 7 years but she is still going strong, the nurse at my daughter’s school is a survivor of 5 yrs, and the lady I met through a support group is 15 years out without reoccurrence. I know my social circle isn’t super large but I don’t know anyone personally that has passed from breast cancer. Ok, so my treatments are getting harder each week but luckily next week is the last Taxol treatment. I’m not sure what the next steps are because my MO wants to wait to see what the MRI looks like to make determination for the next phase. Since I’m in the clinical trial, there may be different path depending on the tumor’s response to treatment. So I guess I’ll know more in a week or so. Being back in that unknown phase is a little hard but if my consolation prize is evidence that treatments are working, I guess it’s a decent trade off. Finally, I wanted to share a few pictures of my after infusion treatment team. They’re pretty awesome and I love them.  ",
      "MessageIndex": 1205,
      "PostDate": "28/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    }
  ]
}