{
  "AuthorID": "fufu",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
  "Posts": [
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 07:10PM fufu wrote: Hello scuttlers, i am so sorry for your loss. May your brother in law rest in peace. I am sorry your family had to go through this. For me it has been an emotional rollercoaster. I am very well aware of personal choice and personal rights but i cannot watch someone i love not try to live. Life is precious to me and if my cousin loses her battle i do not want to say i should have spoken to her that is not who i am. I use my voice and that is on;y cause i care otherwise i would not waste my precious time and energy. I know that there will come a time that i will have to back off, but it is not now, now i must speak up.",
      "MessageIndex": 32,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 08:24PM fufu wrote: thank you pricess123, i appreciate all the info you have provided and i will definately try to convince her to take your advice. And yes her stage makes me nervous as well, i will read up on the thermogram but if im not mistaken it does not detect tumors does it?",
      "MessageIndex": 36,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 26, 2011 01:35PM fufu wrote: Hi Kaara, i am completely aware of what she i telling me, though the one thing that makes it harder is that she is not even willing to listen, but like i told her she has to because i listen to her, because i listen to what she is eating and what she is doing and what she believes in so she has to at least give me some time and listen to me. And yes she might cut me off but honestly it's a chance i am willing to take. That is why everyone is afraid to give their opinion cause they are afraid of being cut off, not me i'm not afraid i want her to go talk to her doctors and then make her decision. She got preliminary results and then decided to leave for three weeks off to a holistic health center and still has not gone back to get the final results. She has not even educated herself on her disease.All i want is for her to make her decision after she has all the facts, then i will accept her decision but will never ever agree with it. Life is too precious and yeah! sometimes we have to put up the fight of our lives and i am not saying it's gonna be easy, i have lived it once too many believe me.",
      "MessageIndex": 58,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "fufu wrote: A close relative of mine who i adore has recently been diagnosed with invasive ductal carcinoma, stage III, grade III. She is young and has a young child and has decided to refuse all medical treatments. She has chosen to live a holistic lifestyle instead and believes that this will cure her cancer. I am worried, confused, and scared. I do understand her fear of chemotherapy but i feel that the holistic approach is even more risky. Has anyone been cured of this type of cancer by living a holistic lifestyle??? Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 26, 2011 04:34PM fufu wrote: I have read the article on Steve Jobs and Kim Tinkham and many more. Yes i believe she is brainwashed, i almost believe she spent three weeks in a cult. Bleomycin is not used for bc it is used for hodgkins lymphoma. I deal with my cousin with great care and compassion and i never ever use a negative tone i actually commend the fact that she has stopped smoking and drinking alcohol and has stopped eating all the things that she loves. And i never ever once mentioned that she do chemo i asked her to consider having surgery that's all but that is way too much for her to handle considering that she was recently taught how to deal with loved one's like me, just get rid of them they are dark energy. I read a lot on this place she attended for three weeks and got reviews from a lot of people and yes apparently it is like a cult and you are taught how to deal with all aspects of your journey. Wow!!!!!!!!!!!!!!! i feel like i'm on an emotional rollercoaster, never expected that i would have this to deal with, it is tough and scary.",
      "MessageIndex": 64,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 26, 2011 09:03PM fufu wrote: Thank you princess i will definately look it up. You seem to be well informed. Thanks Tarry, funny enough i just spoke to my sister about an hour ago and told her that the rest of the family will also have to speak to her because it's so easy to push one person away but it won't be so easy to get rid of all of us, lol. I will ask the rest of the family tomorrow and see what happens, trouble is i heard from a family member that her boyfriend, and her father and her brothers are supporting her decision so we are the nay sayers according to her, and we bring dark energy her way. Oh well it is what it is and sometimes we gotta do what we gotta do.",
      "MessageIndex": 73,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 27, 2011 07:42AM fufu wrote: Hello ladies here is the answer to your questions. Princess i'm sorry didn't see the question on the alternative forum i'm new here so i'm having a hard time getting around, lol. So at around the middle of September my cousin felt a lump on her left breast called the doctor the doctor immediately sent her for a mammogram. As the technician was performing the mammogram he told her that she will need an ultrasound, had one on the spot and then the technician suggested a biopsy which again was done on the spot. Two weeks later she got the results i do have the pathology report this is what it says. IDC classification SBR-EE, grade III, tubulaire score 3/3 nuclear score 3/3 miotique score 1/3, BIRADS-5. After this report she did see oncologist and surgeon who told her she is stage III and suggested mastectomy and chemo to start, they did an mri and another biopsy in house because they wanted their own technician to do it.Immediately after the second biopsy she left the country and went to the hippocrates health institute for a three week life changing program but told the doctors that she is going on vacation. While there she decided that she will not be doing any medical treatments or surgery and is convinced her tumor has shrank. Because i have been pushing for surgery she will be finally seeing the doctors on Tuesday i hope to God they can get through to her. Sorry if i wasen't clear about her diagnosis, maybe some of you can shed some light. What do you think? am i so wrong in being petrified for her life?",
      "MessageIndex": 80,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 02:18PM fufu wrote: KSteve of course she will not be doing scans as she has been taught that they are \"invasive\". She tells me that her tumor is shrinking and this is by her feeling it. I agree with you that she should be giving the oncologist and all other doctors involved in her case a chance but...................... she refuses. I will be there for her no matter what but i do not support or agree with her decision. Thanks",
      "MessageIndex": 11,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 06:41PM fufu wrote: Thank you cynister, believe me i am trying to get her to talk and listen, i will keep trying i will be damned if i sit back and watch without at least trying.",
      "MessageIndex": 23,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "fufu wrote: A close relative of mine who i adore has recently been diagnosed with invasive ductal carcinoma, stage III, grade III. She is young and has a young child and has decided to refuse all medical treatments. She has chosen to live a holistic lifestyle instead and believes that this will cure her cancer. I am worried, confused, and scared. I do understand her fear of chemotherapy but i feel that the holistic approach is even more risky. Has anyone been cured of this type of cancer by living a holistic lifestyle??? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 01:24PM - edited Nov 25, 2011 01:26PM by fufu Thank you to all of you that have actually taken the time to share your stories, the courage and compassion you all possess is truly heartfelt. My relative is my first cousin who is very important in my life. She has not had any surgery as she refuses. As she was awaiting results a friend of hers recommended a holistic health center and she went there for three weeks where they taught her how to live this holistic lifestyle and the tumor shall go away. I for one don't buy it. I believe her decision is based on fear as her mom and my mom, they were sisters passed of chemotherapy four years ago, one three days after the other. But, she must open her eyes and see the survivors, my husband being one of them, sixteen years in remission, he actually is considered cured. Back then the chemo was even worse as the anti nausea meds were not as advanced.  Anyway after attending this holistic health center she truly believes she will be cured with that alone and will hear nothing that has to do with conventinal medecine from anyone. I did push today for her to at least have surgery, but do not think that i was succesful in making her rethink her decision. I am sooooooooooooo scared.",
      "MessageIndex": 7,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 26, 2011 08:38AM fufu wrote: Elizabeth my mother and my aunt (my cousin's mother) died of the chemotherapy. they both had hodgkins lymphoma, they were both treated at the same time and they both died of lung toxicity three days apart. It was one of the chemo agents used called bleomycin, it was a one percent chance of dying from lung toxicity. It was a terrible experience for our family that has scarred all family members so yeah! the fear is real.",
      "MessageIndex": 47,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 26, 2011 06:18PM fufu wrote: Thank you Lago, i am a very strong person and can handle a lot. I eventually will learn how to deal and accept my cousin's decision but in the meantime i am one that can't sit back and watch.",
      "MessageIndex": 66,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 07:18PM fufu wrote: Lago you read my msg wrong. I meant it is amazing that you have gone through so much but you are here, you are a survivor. i meant that chemo is not fun but you are here and that is amazing. It means that yes chemo is not fun but it's what makes you live. My husband went through hell with chemo sixteen years ago but he is alive he is here and yes! i think it's amazing.",
      "MessageIndex": 34,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 26, 2011 12:09PM - edited Nov 26, 2011 12:10PM by fufu Shelleyj43, hope she comes to her senses you say, oh my i have been praying for that for two months now. You must understand that in her mind she is not being selfish and she is doing the right thing for herself and her child. In her mind eating wheatgrass and doing enemas is curing her she is even convinced that her tumor has shrank just by feeling it. She even attempted to tell me (just a little while ago) that she is doing chemo every single day (meaning her lifestyle change, to her that's chemo). And as i said earlier she said that i am \"dark energy\", lol. I hope to God that a little bit of what i said was heard.",
      "MessageIndex": 55,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 30, 2011 06:28PM fufu wrote: Thank you all for your kind words. I will pray for my cousin everyday and i will be there for her no matter what. I don't turn my back on the people i love just because i don't agree with their choices. I just will back off and not give her my opinion and if she should need me i shall go running.",
      "MessageIndex": 92,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "fufu wrote: A close relative of mine who i adore has recently been diagnosed with invasive ductal carcinoma, stage III, grade III. She is young and has a young child and has decided to refuse all medical treatments. She has chosen to live a holistic lifestyle instead and believes that this will cure her cancer. I am worried, confused, and scared. I do understand her fear of chemotherapy but i feel that the holistic approach is even more risky. Has anyone been cured of this type of cancer by living a holistic lifestyle??? Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 07:13PM fufu wrote: Chiluvri i understand her fear as well believe me, but the fear of chemo should not be greater than the fear of the cancer. It's called survival and if chemo is her only chance she should take it.",
      "MessageIndex": 33,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 26, 2011 12:01PM fufu wrote: Hello ladies, So i spoke to my cousin and of course she did not want to hear anything but i wouldn't have it so i continued to speak and she finally told me that i am dark energy, lol and she didn't wanna hear anything else. I am not done with her. I will continue to use my voice (as nobody else in the family is) even if it means her tossing me to the curb, lol. I must take my chances and am fully aware of the consequences.",
      "MessageIndex": 54,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 26, 2011 08:02PM - edited Nov 26, 2011 08:57PM by fufu Thanks Kaara, i have heard that the holistic health center is known for treating ms and diabetes and other disease though not cancer especially not stage three. I would feel great had she decided to use it as a complimentary but no she is using it as an alternative. I would prefer that she just has the surgery and gets that tumor out of her body that's all i am suggesting. Sweetbean thank you for understanding, and i completely understand that watching what you put in your body would eliminate some of your side effects.",
      "MessageIndex": 70,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 27, 2011 10:14AM fufu wrote: Princess i am so sorry i have not answered on the alternative board, as i said i'm new here and as silly as this is gonna sound i can't find the post. Pls let me know where it is. I am looking on the alternative forum and i cannot find it, help!!!!!!!!!!!! lol",
      "MessageIndex": 84,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 30, 2011 10:40AM fufu wrote: To all you wonderful women that have given your time, advice, and expertise i wanted to let you know how much i appreciate each and everyone of you. The courage that you have to share your stories and to listen has touched my heart. As you continue your battle or are in the recovery process i wish you all happy healthy days ahead. As for my cousin she saw the doctors yesterday she will be having a bone scan and an abdominal ultrasound and then will see the doctors again sometime in January. She will have no surgery and no treatment, i tried really hard to the point that i have not slept in over a month. So last night i decided that it would be best for me to back off right now as the situation was taking a toll on me mentally and physically, so i'm done. I wish her well and i hope she proves my concerns wrong. I will pray for her and for all of you. Happy days ahead.",
      "MessageIndex": 88,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 06:47PM fufu wrote: Hi Lago, I know that chemo is not fun, believe me i have seen what it does several times in my life with several loved one's. You did it and you are here to talk about it which is amazing. God bless.",
      "MessageIndex": 25,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 06:12PM - edited Nov 25, 2011 06:15PM by fufu Thank you Racy, my heart still aches every minute of every day.",
      "MessageIndex": 21,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 06:45PM fufu wrote: Hello princess123, Yes i do and i wouldn't exactly call them treatments. My cousin went to the hippocrates health institute in west plam beach, florida where they taught her to live a holistic lifestyle. She is now a raw vegan, cut out all food groups and eats only some vegetable and only raw.She consumes a lot of wheatgrass and juices a lot, has weekly enemas and sometimes colonics, and takes lots and lots of supplements. Thank you",
      "MessageIndex": 24,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 06:54PM fufu wrote: Calamtykel you did the best thing for your family. And i do agree with you at her stage it can be \"suicide\". Thank you for taking the time.",
      "MessageIndex": 28,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 07:00PM fufu wrote: Hello Plantlover, If only it were that easy. Can't force someone who has officialy been brainwashed, but will keep trying and i will definately be telling her about this thread perhaps i can get her to read it. And yes! i said brainwashed that is what i believe.",
      "MessageIndex": 30,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 06:39PM fufu wrote: Thanks She, I am not against complimenatary myself but alternative scares me. I have encouraged her to consider surgery but the answer is NO.",
      "MessageIndex": 22,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 06:50PM fufu wrote: Thanks diana, I will be there for her no matter what. This is definately not about me it's about her it's about giving herseld a fighting chance that is all i want. As for you God bless! nine years is amazing.",
      "MessageIndex": 27,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 25, 2011 06:58PM fufu wrote: Pamonymous, i agree with what you are saying , and i am afraid that those cells are already invading other parts of her body, but i am trying so desperately to make her understand she won't listen but i will continue to try. I wish you very many years with your children.",
      "MessageIndex": 29,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Nov 26, 2011 08:42AM fufu wrote: I am truly sooooooooo overwhelmed by all your responses. I don't know any of you but you are all taking the time to answer me and provide me with advice or information, i cannot thank you all enough.",
      "MessageIndex": 48,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "fufu wrote: A close relative of mine who i adore has recently been diagnosed with invasive ductal carcinoma, stage III, grade III. She is young and has a young child and has decided to refuse all medical treatments. She has chosen to live a holistic lifestyle instead and believes that this will cure her cancer. I am worried, confused, and scared. I do understand her fear of chemotherapy but i feel that the holistic approach is even more risky. Has anyone been cured of this type of cancer by living a holistic lifestyle??? Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    },
    {
      "AuthorID": "fufu",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140103/profile",
      "Content": "Dec 1, 2011 07:01PM fufu wrote: Thanks jennyboog, people like you make all the difference, God bless!",
      "MessageIndex": 95,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/778632",
      "Title": "stage III choosing alternative fufu fufu"
    }
  ]
}